{"id": "41bf620b199bef48de50689a756ddf36", "url": "https://www.bonappetit.com/story/dive-bar-people", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "What Is a Dive Bar? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Strange Dreaminess of People-Watching at a Dive BarThe best thing to do at a dive bar is people-watch while nursing your favorite drink.By Alicia KennedyFebruary 18, 2022FacebookTwitterEmailIllustration By Tamara ShopsinFacebookTwitterEmailIn Underrated, we review the ordinary rituals we build around food. Next up: people-watching at a dive bar.My memories of late nights at the dive bar imprint on my mind like dreams. Their logic seems otherworldly: A man stands in a corner with a giant white-and-yellow boa constrictor around his neck as people flock around the snake. After the tear gas clears from a protest, young women spray paint the outline of their bodies onto a wall in homage to the cover of Rage Against the Machine’s album The Battle of Los Angeles. An old man sits at the bar for hours of repeated pours of bourbon, apparently unaware or unconcerned that he’s still wearing his bicycle helmet. A famous character actor walks in, surveys the dance floor with a scowl, and turns to leave while I blink and wonder, Could that really be him?A dive bar late at night sets a certain kind of scene, one that is dreamlike and absurd, both clouded and heightened by the effects of alcohol consumption. At a dive bar, you never want to be the subject of someone else’s memory; you don’t want to be the main character—the one making a scene or talking the loudest. The best thing to do is people-watch while nursing your favorite drink, observing, objective, not drunk but not sober. In an ideal world, the ice in your plastic cup of whiskey soda won’t quickly melt; it will keep the drink cool while you absorb your surroundings.My own special talent at dive bars has always been getting strangers to tell me their life story. Something about my presence and perhaps my rapport with the bartender seems to promote openness; my mother and sister have the same talent (or burden, untrained as we all are as therapists). I’ve advised women to dump boyfriends; I’ve watched others cry over unreturned text messages, a dead phone, past assault. I keep my own stories close to the vest because, as a writer, I prefer to observe, but I am always open to an argument about contentious political issues. I’m lucky that it’s never gotten too intense.I live in Old San Juan, Puerto Rico, which is a city of dive bars—at some, you can order a martini or cosmo without worrying about the freshness of ingredients, at others you should just order that whiskey soda in a plastic cup (it’ll probably be Dewar’s, and the pour might be extremely heavy). Some of these bars have murals on the walls or TVs playing music videos, others have neither and are covered in graffiti. Still more will be located in a secret spot right by the ocean, open only one night per week. Usually you can’t get food at these places, and if you can, it’s a frozen empanadilla that’s quickly heated in a toaster oven.The most famous of these local bars is El Batey, which has been open for over 50 years and maintains its punk essence despite the neighborhood’s endless gentrification and appeals to tourists. The walls are scribbled over with the names of people who have visited for years and lined with photos of past patrons who have passed away. The bar has a feeling of grime thanks to the Sharpie-covered walls, and the service is no-nonsense. But when you become a resident of an area, you feel a sense of homeyness in its dives, and for me, that’s in El Batey, which I frequented even before I officially moved into town. It was the last bar I drank in with my brother before he passed, giving the place sentimental value for my whole family.The definition of a dive bar has always been a hotly debated subject among drinks lovers. “[W]hat makes a dive bar so difficult to define is that it is mostly about feel,” writes Knoefel Longest, and I agree. While we can say that a dive bar features cheap well drinks and beer, that no one knows how long that bottle of martini brand vermouth has been on the shelf, or that someone has stuck stickers to the likely filthy bathroom walls, ultimately, a bar is a dive because it’s a dive. It’s a tautology that we will likely be untangling for as long as bars exist.But if I had to define a “dive,” it’s a place where you see the same folks day after day on their stools, not necessarily because they are problematic drinkers but because they’re after a third place, or that special communal ground that isn’t home or work. A dive provides. A dive gives counsel when sad, fast friends when lonely, and entertainment in the form of fever dreams: the snake, the spray paint, that famous actor. A dive is a place to reflect, a place to marvel, a place to experience people as people—sometimes at their worst, sometimes at their best, always fascinating, always real.Explore Bon AppétitLifestyleCultureUnderratedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-18", "author": ["Condé Nast", "Alicia Kennedy"]}