{"id": "41c66a66340782b484465368f93ed83a", "url": "https://www.bonappetit.com/story/white-vinegar-best", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "White Vinegar Is Our Desert Island Vinegar (Seriously) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhite Vinegar Is Our Desert Island Vinegar (Seriously)The secret to braises and sauces that truly sing? It might be the same stuff you use to clean your stove.By Alex DelanyFebruary 13, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailThis is an article about white vinegar. However, it isn’t an article about how to clean your pans. Or your shower. Or your gnarly stovetop. Or making a papier-mâché volcano erupt. No, it's about using white vinegar for what we believe to be its true calling: cooking.Yeah, putting white vinegar in your food is a certified brilliant move. Tell the “White vinegar is only good for cleaning” people to take their red wine and apple cider vinegars and sit down. This laboratory-esque liquid is a little bit misunderstood; it comes with a borderline scary reputation. Maybe it’s the cheap price that steers people away, or the stark, sterile appearance. But while some people might deride white vinegar as tasting \"harsh,\" we prefer to think of it as \"assertive\"—\"confident,\" even.That gripping acidic flavor comes from grain that is fermented to produce alcohol, which little micro-organisms then consume and and convert into acetic acid. All vinegars contain acetic acid—it's the stuff that makes your jaw clench and your mouth water. But while red wine vinegars and apple cider vinegars and all the other vinegars have additional flavors that play with and sometimes against that sharpness, white vinegar is pure acid—clean, bright, and clear.And a lot of times, that's exactly what we're looking for. When a dish tastes exactly how we want it to, with all of the flavors in sync, but it still wants a biiiiiit of acid to make it pop? We could add any vinegar or citrus, sure but that would introduce not only tartness but other flavors as well. Or we could just add a splash of our trusty white vinegar and get exactly the sharpness we're after with no drama. White vinegar is the person who donates millions of dollars to a charitable cause and asks not to be named.A saucy braised pork shoulder from a $50 Dinner Party\nPhoto by Alex LauIt’s the dark horse ingredient that makes food tantalizing, a silent guardian of flavorful wonder, enhancing without distracting. White vinegar is perfect for quick-pickle situations where you really want to taste those veggies, or as the acid in a dressing for the simplest slaw. But it's good for so much more than veggies. We love adding white vinegar to braises and stews; It delivers a particular zing that balances intense fat and deep, browned, meaty flavors. It’s commonly used in dishes like chicken adobo or chicken agrodolce, both of which benefit from an almost hypnotically sweet-salty-acidic sauce. That same flavor shows up in hoisin sauce. It is tanginess incarnate, the clearest, cleanest, most direct route to lip-smacking, mouth-watering, completely crave-able food.At its heart, white vinegar is the difference between a good braise and a great braise, a sauce that tastes good and a sauce that makes you dance in your seat.  White vinegar may be the cheapest, the most lo-fi. But it also happens to be the best.About that homemade hoisin sauce we mentioned earlier...Hoisin-Glazed Pork ChopsBecause you need more pork and homemade hoisin sauce in your life.View RecipeExplore Bon AppétitBasicallyVinegarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Alex Delany"]}