{"id": "42204b4b8d0040f7fe79353912a676d3", "url": "https://www.bonappetit.com/story/doubting-thomas-los-angeles", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "The Seeded Bread at Doubting Thomas in Los Angeles Restored My Faith in Fancy Breakfast Toast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Seeded Bread Restored My Faith in Fancy Breakfast ToastIt’s like the body builder of breads.By Alex PastronDecember 26, 2019FacebookTwitterEmailPhoto by Amanda Hernandez / @hungrypanditaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Having a toast on the menu is something of a requirement in Los Angeles. (See: Sqirl, Hail Mary, Destroyer.) And while I love a seasonal jam or whipped ricotta as much as the next person, I recently began to feel something I can only describe as toast fatigue. They all started to feel eerily the same, like a tiny carb-based ghost haunting me at every restaurant in the city. Then, I saw the toast at Doubting Thomas in Historic Filipinotown.While most toasts are defined by their toppings, this particular one is all about that bread. Specifically, the inch-thick, house-made seeded bread. It’s like the body builder of breads, so dense and crumbly that it requires both a fork and knife. This is a good thing, because a weaker bread would go soggy under the weight of whatever toppings owner Naomi Shim is using, whether it’s a combo of burrata, almond pesto, balsamic, and heirloom tomatoes or smashed avocado with shallots, chive oil, lemon, and radishes.This seedy bread starts with sprouting rye berries, which Shim soaks, strains, and rinses twice a day for two days. She then mixes the berries with flour (spelt and rye), dark beer, oat milk, malt syrup, brown sugar, four types of seeds, and natural levain (a.k.a. starter). The result is a bread that has cured my toast fatigue. It tastes so rich and nutty, and you get a pleasant and unexpected crunch with each bite, thanks to all the seeds—sunflower, flax, sesame, and pumpkin!And while you can’t buy this hearty bread by the loaf, if you ask nicely, Shim will sell it to you by the slice. Or you can do as Angelenos do and order the toast.Go there: Doubting ThomasExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRead MorerestaurantsMy Favorite Spot for Toast in Toast Town Is Actually a Pizza PlaceBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-23", "author": ["Condé Nast", "Alex Pastron"]}