{"id": "422c330ba80790a5ac14a973e78c0feb", "url": "https://www.bonappetit.com/story/swedish-fish-candy", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "A Skeptic Tries: Swedish Fish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: Swedish FishI’d dodged red candy all my life. Until, in a late night delirium, a handful of sweet little fish swam right into my mouth.By Justine LeeDecember 15, 2021FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmailA Skeptic Tries is a series examining our food resistances and what happens when we try them anyway. Next up, contributing writer Justine Lee faces off against her childhood enemy: Swedish Fish.It started one afternoon in a classroom. I’d been celebrating the end of yet another grueling standardized test season with the rest of Mrs. Rosenthal’s fourth grade gang, and we’d all been distributed a hodgepodge of mini candies. From the responsibly portioned pile on my desk, I opted for a red Starburst, something I’d never sampled before. Right off the bat I was disgusted. The slab was tough as cement and my prepubescent fangs had to tug and pull for minutes (okay fine, seconds) to extract any flavor at all. Finally, my efforts were met with an overload of mystery-fruit yuckiness. As my classmates ate their sweets with glee, I sat in silent fury. This was SO. GROSS. I likened it to tasting blood-colored cough medicine that had hardened like the scabs covering my knobby knees.An already picky eater, those mere seconds of arduous chomping gave me nothing in return and only crystallized my sensitive disposition. I was notorious in my household for the hunger strikes I’d orchestrate if my Frosted Flakes were the slightest bit waterlogged in whole milk. Meltdowns occurred when my mom tried to get me into French soft cheeses. And I was in the running for a Guinness World Record for the longest grudge held against fresh ginger. In other words I was easily set off and processed that one bite of candy as a cruel attack. Assuming all red candies would be similarly nasty, at the wise old age of nine, I swore an oath: I’d dodge fruit punch Starbursts —and all of their red disciples—forever.I am, of course, in the minority. Red candy is America’s sweetheart. Most consumers prefer their fruity sweets in scarlet hues, and the candy aisle supplies what is desired. Starbursts FaveReds, a combination of reds (and pinks)—fruit punch, strawberry, watermelon, and cherry—in one packet, is one of the numerous cogs in Big Food’s deliberate ploy to cash in on the beloved color. Over the years I have come of age. I am super chill (almost) all the time! I’ve learned that cereal milk makes for dreamy soft serve and melted Brie is a petit luxury. A smokin’ hot food safety expert I knew in college once extolled the natural antimicrobial properties of ginger, so I started eating that too. And I’ve even developed a burning pash for the emotional bravado penned by Taylor Swift, the self-made red queen. But the crimson-stained candy remained untouched; the wounds endured.That was, until recently. In an all-night race to meet a few project deadlines, the clock on my laptop hit bewitching hours and I sought out a snack. There, looming in the back corner of my otherwise bare pantry, I found a tall bag of assorted red candies. In all honesty, it came in a gift box. And in all honesty, it’s a miracle I didn’t trash it, but I hate food waste (even when said food is cursed). Holding the bag of Satan’s sweets in my hand, I teetered on the edge—do I or do I not try them?—until my rumbling stomach called the shots.At my kitchen table I scattered the contents of the bag on a plate. There I was, back in Mrs. Rosenthal’s class; only now I knew better than to dive in straightaway. Instead, I began combing through each candy to decipher which to start with, thinking a process of elimination might increase my chances of making it out of this showdown alive. Naturally, red Starburst was a BIG NO. Mini Twizzlers? Waxy-looking trouble. Red Sour Patch Kids: I’d seen those mischievous ads, no thank you! That left Swedish Fish. They had wrinkles and cracked skin. Their little bodies were flabby and malleable. (I know because I squashed and stretched four until they all resembled that stingray from Finding Nemo.) Maybe it was hunger-induced delirium, but something about their distorted faces made them seem more, I don’t know, approachable? And before I knew it, one swam into my mouth.Chewing nervously, I waited in anticipation of another oral attack. But no such occurrence prevailed. In fact, the experience was tranquil. Like eating a ripe piece of fruit outdoors. The flesh was soft but not disconcertingly so. For something made almost entirely of refined sugar plus Red Dye 40, it proffered a kind of subtle, respectable sweetness. And there was flavor—actual pronounced flavor! Where red Starbursts fell flat, the Fish accentuated berry notes, rounded out with a citrus punch. I imagined this is how it would taste, perchance, if I were frolicking barefoot in the Swedish woods, stopping to pluck a lingonberry—and not chomping on a mass-produced knockoff. Hey, anything’s possible at 2 a.m.Lesson learned: Don’t write off an entire category of food based on one bad encounter. Had it not been for slim pickings, had I not squashed four and eaten 20 (yep, 20!) Swedish Fish in a late-night spiral, who knows if I’d have tried red candy at all? I suppose this wouldn’t be a terrible life, and some people would argue that I’m better off without the added sugar. But I’d overcome bouts of adolescent picky-eating and prejudice toward other foods; red candy was my final test. Since those little Fish helped me swim upstream, I’ve archived a tome of self-imposed jurisdictions that, for a time, made me critical of all foods. And I’ve come out on the other side with a curious palate that, for the most part, serves me well.We aren’t BFFs or anything, but Swedish Fish did take me on a journey of self-realization, introducing some other tasty reds along the way. Twizzlers eat like fruity gemelli. Red Sour Patch Kids are delish—though I hear they’re Swedish Fish in sheep’s clothing. No matter. As for the Starburst? Let’s say it evaded my efforts. I just didn’t want to go back there, and I’m all right with it. As Taylor Swift once said, “If something’s toxic and it’s only ever really been that, what are you gonna do? Just move on. It’s fine.”Explore Bon AppétitA Skeptic TriesCultureRead MorecultureA Skeptic Tries: Quitting CoffeeBy Luna AdlercultureA Skeptic Tries: OatmealBy Joel WigelsworthcultureA Skeptic Tries: Dairy Queen's Dipped ConeBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-15", "author": ["Condé Nast", "Justine Lee"]}