{"id": "422f1e92bd680205e166f4e5d0f45a31", "url": "https://www.bonappetit.com/recipe/stir-fried-udon-with-pork", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Stir-Fried Udon Noodles With Pork and Scallions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStir-Fried Udon Noodles With Pork and ScallionsBy Claire SaffitzMarch 24, 20224.6(178)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintWith chewy noodles, well-browned ground pork, and crunchy cabbage, this take on yaki udon (stir-fried udon noodles) gets its flavor from an umami-rich punch of soy sauce and mirin, a sweet Japanese rice wine. (You might recognize the combination from teriyaki recipes.) It also has green onions for a fresh bite and a drizzle of sesame oil for nutty depth. You can easily make it vegetarian: Simply omit the pork and sub in 8 oz. shiitake or crimini mushrooms instead.If you don’t have mirin in your pantry already, it’s easily found in many larger grocery stores, East Asian markets, and online. Some brands may be labeled “aji-mirin.” This common product is an imitation of true mirin (the name translates to “tastes like mirin”). Whatever you find will be delicious in this recipe, but if you spot hon-mirin (a.k.a. true mirin, which is quite a bit more expensive) it makes the dish even more special.This is a weeknight-ready, quick-fire udon noodle recipe, so prepping your ingredients before you start cooking is a smart move. See the step-by-step instructions here.If you want to serve with a vegetable side, a plate of greens like bok choy or yu choy pairs well. For more udon recipes, check out the boxy noodles in a buttery tomato and soy broth or tossed with kimchi, gochujang, and butter.Editor’s note: This recipe was originally published in March 2017.Ingredients4 servings2tablespoons vegetable oil, divided4cups very coarsely chopped green cabbage (from about ¼ medium head)27-ounce packages instant udon noodles, flavor packets discarded2teaspoons toasted sesame oil8ounces ground pork5scallions, white and pale-green parts coarsely chopped, dark-green parts thinly sliced2teaspoons finely grated fresh ginger (from a 1-inch knob)1teaspoon crushed red pepper flakes⅓cup mirin⅓cup soy sauce1tablespoon toasted sesame seeds, plus more for servingPreparationStep 1Heat 1 Tbsp. vegetable oil in a large skillet over medium-high. Add cabbage and cook, tossing often, until edges are browned, about 4 minutes. Reduce heat to low and continue to cook, tossing often, until thickest parts of cabbage leaves are tender, about 4 minutes longer. Remove from heat and set skillet aside.Step 2Place udon in a large heatproof bowl (or pot if you don’t have one) and cover with 6 cups boiling water. Let sit 1 minute, stirring to break up noodles, then drain in a colander. Transfer noodles back to bowl and toss with sesame oil. Transfer cabbage to bowl with noodles. Wipe out skillet.Step 3Heat remaining 1 Tbsp. vegetable oil in same skillet over medium-high and add pork, breaking up and spreading across surface of pan with a spatula or tongs. Cook pork, undisturbed, until underside is brown, about 3 minutes. The pork will never brown if you’re fussing with it the whole time, so when we say “undisturbed,” that means keep your paws off it and let the heat of the pan and the pork do their thing. When pork is browned, break up meat into small bits. Cook, tossing, just until there’s no more pink, about 1 minute. Add chopped scallions (the pale parts), ginger, and red pepper. Continue to cook, tossing often, until scallions are softened and bottom of skillet has started to brown, about 1 minute. Add udon mixture, mirin, and soy sauce and cook, tossing constantly, until noodles are coated in sauce (be sure to scrape bottom of skillet to dissolve any browned bits), about 45 seconds. Remove from heat and fold in 1 Tbsp. sesame seeds and dark-green parts of scallions. Top with more sesame seeds before serving.How would you rate Stir-Fried Udon Noodles With Pork and Scallions?Leave a ReviewTell us what you thinkReviews (72)Back to TopTriangleVery very good. A recipe that’s truly better than the sum of its parts. I enjoyed my portion with a couple blobs of Sambal for extra heat and acid but everyone else loved it as is. Please don’t skip the cabbage. KGToronto, Canada3/26/2022Absolutely fantastic!  We've made it 4 times and what I've found really amps up the flavour is adding a little of the mirin/soy sauce liquid to both the veggies and meat while sauteing.\n\nWe basically double + the amount of veggies, adding broccoli and mushrooms to the increased napa cabbage.\n\nAlso, to the mirin/soy sauce liquid, I add a little chili garlic for some heat.\n\nKeeper!\n\nAnonymous2/28/2022This recipe is a keeper. Simple, delicious, and satisfying. A huge hit in our house!Laurie St Petersburg FL12/13/2021This recipe was so good I added an extra packet of noodles while cooking because I knew I’d want more. And we (2 of us) ate it all in one night. This is also my first recipe review. It’s that good. MeganSan Francisco, CA9/11/2021I make this once a month and any time we have guests. It’s a hit! We add edamame and sriracha cream sauce on the side Erin T8/27/2021I added some fresh Olathe corn once and have added it every time since. Goes so well with the pork and cabbage. This recipe is delicious, quick, and easily modified with any protein or veggies you want to sub. Great find for a working mom! Or any mom. Or dad. Or person. Period.Amanda DDenver, CO6/29/2021We absolutely love this recipe. I increased the cabbage and use authentic udon noodles (as opposed to instant) otherwise keep it all as the recipe dictates.  I make this about once every six or seven weeks.BillLa Jolla CA6/29/2021I just made this for the first time. I used turkey instead of pork, but otherwise followed the recipe. It's so delicious! Steve901 Saskatoon, Saskatchewan 6/24/2021My grown kids stopped by and were chowing down on the leftovers. What is this amazing stuff? So now I’m doubling it and making if for the whole family for Fathers Day dinner. I will definitely be saving this recipe. I made it exactly as described, maybe a little extra pork. They think I’m a genius cook! Ebba Bradenton, FL6/19/2021Barely edible for someone who's not a huge fan of ginger. I often put ginger in dishes, but this one was so overpowering it was insane. Others in my house who love ginger had no problem – so just be careful if you don't love ginger! Otherwise a yummy recipe, could just use less ginger for me personally.AnonymousArizona4/22/2021Excellent simple recipe. I modified it slightly for even more flavor by adding a tablespoon of toasted peanut oil to the noodles and a drip more to finish it after cooking down the mirin and soy sauce. I also roughly chop a handful (about 3/4 cup) of Virginia roasted peanuts and add it on top after plating. Peanuts add a whole new dimension to this and go great with the sesame.Steve RalineaMadison, WI3/31/2021I made the recipe as written and it is tasty, but too salty. Next time I will use less soy sauce or low sodium soy sauce.SarahOgden, UT3/27/2021Just looking at the ingredients, I couldn’t tell why so many reviewers loved this dish, but we did too. The only change I made was to use soy crumbles instead of fork to make it vegetarian. AnonymousDenver, CO3/20/2021I have made this recipe about 5 times now.  So as you can tell I like it.  I do add more vegies, plus in Australia we have a deli product called Chinese Pork.  I added this a couple of times too as the meat and boy oh boy, did it turn out great.  Such a great based sauce recipe to do delicious dinners.  Took me a few times to get the noodles right, but I think I got it now hahaha.  Thank you for such a great recipe, I will continue to use it, in fact again tonight.  :) Anita PQld Australia.  3/9/2021This is probably my favorite BA recipe, and I've made it more times than I can count. Often, I make the standard version, but it is very adaptable. One change I always make is that if I'm using cabbage, I cut it into thin strips rather than a coarse chop as the recipe instructs. It cooks more quickly and evenly this way, and results in a more cohesive texture in the finished dish. I also add a little minced garlic along with the ginger and scallions. Finely chopped broccoli makes a good sub for the cabbage.\n\nThis can be made with any kind of ground meat (maybe add some more oil if it's leaner than pork). I've made it with ground turkey, as well as Beyond and Impossible plant-based meat. If you're using plant-based meat, check its sodium content and substitute some low-sodium soy for part of the soy sauce or else it might come out too salty. \n\nUse real mirin, not the fake kind (it should not have glucose or corn syrup or anything like that in the ingredients) for best flavor!AnonymousCT2/19/2021Explore Bon AppétitStir-FryJapaneseEast AsianAsianUdon NoodleNoodlePasta & NoodlesGreen CabbageCabbageLeafy GreensVegetableGround PorkPorkMeatEasyQuickWeeknight MealsMainDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-13", "author": ["Condé Nast", "Claire Saffitz"]}