{"id": "423257569ffda31212f06655f9f50d9f", "url": "https://www.bonappetit.com/story/panjos-pizza-parlor", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Panjo’s Pizza Parlor in Corpus Christi Is the Place That Time Forgot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsPanjo’s Pizza Parlor Is the Place That Time Forgot“Very few people ever touch the laminated menus. They order what they’ve always ordered, what their parents ordered, what their grandparents did.”By Bret Anthony JohnstonJune 6, 2018FacebookTwitterEmailPhoto by Jason PageFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Metaphorically speaking, Panjo’s Pizza Parlor is at the corner of dead and dying. Across one street is a Toys “R” Us with a “Going Out of Business” banner; across another is a vacant shopping mall. The space next to the restaurant is available for rent, the hollowed-out husk of what had been a RadioShack. And yet Panjo’s—a small business owned by a mom and pop and eight daughters—is thriving.Established in 1964 in Corpus Christi, Texas, Panjo’s is a low-lit and beautiful relic. There are long rows of picnic table seating, all benches and thick lacquer, every surface saloon brown and rubbed to a glossy patina over decades of dining. Most of the walls are red and white cinder block, though one is mustard yellow with “i LOVE my PANJOS!” (sic) spray-painted in tall letters. Beside the restrooms is a gumball machine offering trinkets and decals of an alarmingly young Jessica Simpson for a quarter. The staff—most of whom wear tie-dyed Panjo’s T-shirts—announce orders for pickup through an ancient sound system that makes every word sound fuzzy and far away, as if in echo from years before.Ready for the oven.\nPhoto by Jason PagePanjo’s is usually loud, a festive cacophony. Either a group has taken over an entire row of tables for a party—birthdays, graduations, anniversaries, and retirements—or fans are cheering for some Texas team playing on one of two televisions. Until his death a few years back, Bubba the Pianist held honest-to-God weekend sing-alongs. He’d been a fixture at Panjo’s since the Johnson administration. (There was a short-lived effort to bring in another musician after his death, but the staff quickly learned that Bubba was irreplaceable.) Children chase each other while their parents refill pitchers of beer. Nervous teenagers come in on first dates and watch through the glass as workers in the kitchen sprinkle a mixture of provolone and mozzarella cheese onto pizza dough. Beachcombers arrive in tank tops and sandals, dragging in the scent of salt water and sunscreen, and strike up conversations with folks ahead of them in line, ranchers in sweat-stained Stetsons or bankers with Rolexes. Everyone eats off paper plates.Check out that cinder block.\nPhoto by Jason PageVery few people ever touch the laminated menus. They order what they’ve always ordered, what their parents ordered, what their grandparents did. Because like most everything else at Panjo’s, the menu hasn’t really changed in almost 60 years: pizza, burgers and sandwiches, a few salads, beer and soda on tap, sweet tea made that morning. Each pizza is made to order. The sauce is thick, and the staff is stunningly liberal with toppings. Panjo’s does do a deep-dish pie, but what keeps customers loyal for generations are the thin-crust pizzas. Crisp, buttery, perfect. It’s all in the ovens. They’re the original Bakers Pride models that were in the restaurant when it opened—heavy ceramic slate and gas-driven. The cornmeal-dusted crust has an extra crunch to it, a texture that customers never forget and can’t find anywhere else.It's all in the ovens.\nPhoto by Jason PageSo you come back. You come to remember your nervous first dates and loud graduation parties, to reminisce with friends and family, to raise a glass to Bubba and others you’ve lost since their last visit. You talk about your jobs and health, your successes and struggles, the countless ways the world outside this old restaurant seems less and less recognizable. But inside Panjo’s, things seem familiar, safe, good. The saloon-brown benches, the gumball machine, the family behind the counter are all as you remembered. And so when your number is called—through a fuzzy speaker, in echo from years ago—you can believe, if only for a moment, that time will spare you too.Bret Anthony Johnston is the Director of the Michener Center for Writers and the author of the international bestseller Remember Me Like This.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsTexasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Bret Anthony Johnston"]}