{"id": "424251b0fb8d154584708795dba8e0f3", "url": "https://www.bonappetit.com/story/lasagna-cookbook-club", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "7 Times I Audibly Gasped While Reading the Lasagna Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Times I Audibly Gasped While Reading the Lasagna CookbookIt sounds dramatic but it’s true.By Alex BeggsOctober 3, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Pearl JonesFacebookTwitterEmailYou should clap your hands together above your head and swan dive into Lasagna as soon as you can. The cookbook, that is. It’s a joy to read and to cook from, a welcome push to get comfortable in this season we call fall—which is just one reason why it’s our pick this month for BA’s Cookbook Club. Tuck yourself into al dente sheets of pasta, insulate with layers of shredded fontina, cushion with ricotta, and luxuriate in meat sauce. Who needs cashmere when you have bechamel?In her squared-off new cookbook with the editors of Taste, Anna Hezel writes: “We want to think of lasagna not just as a set of grandma’s recipes that is frozen in time and space, but as a dish that continues to evolve, warp, bubble up, and melt as it sails around the globe and passes from generation to generation.” [Picture a tray of lasagna floating through the atmosphere past space stations and satellites and boulders of intergalactic debris.] What we have here is the work of a certified lasagna fanatic. (I’ve edited some of Anna’s writings for BA, and knew she was a sherbet punch proponent—I had no idea of the lengths of her lasagna love). Her passion comes through in every page, in every close-up shot of crispy-edged noodles slick with melted mozz. Lasagna made me gasp on no less than seven occasions.The recipes range from classic (okay, yes) to fried lasagna bites (gasp!) to Nutellasagna (monstrous gasp!). The veggie lasagnas appeal to Healthyish me: Kale pesto, roasted squash with leeks and sage, sweet corn and scallion. Nice. But I take it back for the ridiculously meaty Italian sub lasagna, which can murder me and steal my husband for all I care, I want ittttt (deep gutteral gasp). The baked pastas alongside the typical wide-noodle variety sound just as delicious—I’ve got my eyes on the roasted poblano pepper-stuffed shells whose photo shows a cheese icicle falling from a spoon (sensual gasp). The writing is playful and comprehensive and encouraging; we could all use motivational lasagna sometimes.Wowowowow.\nPhoto by Alex LauHow legit is this lasagna book? Garfield creator Jim Davis gives his stamp of approval on the inside cover: “Garfield’s love of lasagna is well-documented. In his opinion, it’s nature’s perfect food. I’m often asked, ‘Why lasagna?’ Truth is, lasagna is MY favorite food. So, it looks like Garfield and I will be fighting over this delightful book.” Starstruck gasp!!!I’d never made a lasagna before. I’d associated lasagna with feeding huge families, or, I’m sorry but it’s true, funerals. The enthusiasm rippling through Lasagna was contagious. I wanted to comfort others with a 13 x 9 pan full of bubbling stuff. I want to say “I love you” with a sloppily cut wedge of layered carbs and cheese—anything but words.So. Much. Cheese.\nPhoto by Alex LauAnd so I made the vegetarian mushroom lasagna first, with a bounty of farmers’ market ‘shrooms (next time I’ll use cheaper ones, they get so buried in cheese I’m not sure the expensive nuance of a maitake comes through). I served it to friends for a Sunday dinner with a garlicky, acidic romaine salad. The herby, butter-browned mushrooms peeked through layers of two pounds (gasp) of fontina and Parm, while the glue that kept the family together was a simple bechamel. We moaned and patted our bellies and were happy.My second lasagna foray was a carbonara cousin. This one was easier. No bechamel, just pasta, pancetta, a fontina-parm layer, and thyme-infused cream poured over the delicate architecture. When the lasagna was bubbling and crisping at the edges, I took it out and cut shallow circles in the top to drop four eggs in. (The recipe calls for using a cookie cutter, which I I do not own. A knife worked perfectly and I got to eat the cut-out lasagna shreds as an appetizer.) Ten minutes later, the whites were set and so was the table. But it was even better the next day, and the day after that, as lasagna breakfast = brilliant gasp. And great news! Now you can make it too.Get the recipe:Carbonara LasagnaThis lasagna version of carbonara includes mild Fontina, pancetta-studded ricotta, and eggs baked right in, toad-in-the-hole style.View RecipeBuy It: Anna Hezel’s Lasagna: A Baked Pasta Cookbook, $11 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubLasagnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-03", "author": ["Condé Nast", "Alex Beggs"]}