{"id": "4244fda20646a107305bce32ac0e2195", "url": "https://www.bonappetit.com/recipe/grilled-chicken-with-lemon-and-thyme", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Chicken with Lemon and Thyme Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Chicken with Lemon and ThymeBy Claire SaffitzMay 21, 20194.8(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintA grilling recipe that's make-ahead friendly and doesn't have to marinade for hours to pick-up great flavor? Oh have we got you covered. The chicken can be grilled an hour ahead of time—it gets more flavorful as it hangs out in the lemony marinade. And remember: When it comes to grilling chicken breasts, it's skin-on, bone-in all the way. The meat stays juicier, and you get the bonus of crispy skin.Ingredients4 servings3Tbsp. plus ½ cup extra-virgin olive oil, divided, plus more for grill4skin-on, bone-in chicken breasts (about 3 lb.)Kosher salt, freshly ground pepper2lemons4garlic cloves, crushed3large sprigs thyme1cup torn pitted Castelvetrano olivesPreparationStep 1Prepare a grill for 2-zone heat (for a gas grill, set one burner to medium-high and one or two burners to low; for a charcoal grill, bank most of the coals on one side). Lightly oil grate. Pat chicken breasts dry; season generously all over with salt and pepper. Place on a rimmed baking sheet; let sit at room temperature at least 30 minutes and up to 1 hour.Step 2Thinly slice 1 lemon crosswise into rounds; pluck out seeds. Place half of lemon slices in a small bowl. Add garlic and 1 Tbsp. oil and toss to coat; season with salt and pepper. Set remaining lemon slices aside for serving. Slice remaining lemon in half and squeeze juice into another small bowl (you should have about ¼ cup). Set aside.Step 3Pat chicken dry again (the salt will have drawn out more moisture) and rub with 2 Tbsp. oil. Grill oiled lemon slices over hot side of grill, turning once, until charred in spots, about 3 minutes. Transfer to a plate. Grill chicken on cooler side of grill, skin side down, until skin is browned and starting to crisp, 15–20 minutes. Turn chicken over, cover, and continue to grill until an instant-read thermometer inserted into the thickest part of breasts registers 160°, 8–10 minutes longer. If desired, uncover grill, move chicken over to hotter side, and lightly char a minute or two. Transfer to a cutting board and let rest 10–15 minutes.Step 4Pull chicken meat from bones and slice ½\" thick. Place on a rimmed platter, shingling slices. Scatter thyme sprigs, olives, grilled lemon slices, and reserved fresh lemon slices over. Season with more salt and pepper; drizzle reserved lemon juice and remaining ½ cup oil over. Let sit at least 15 minutes and up to 1 hour before serving.How would you rate Grilled Chicken with Lemon and Thyme?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleMade recipe as is, and it could not have been easier. It was a huge hit and perfect summer dish. I look forward to making again and trying the honey addition as recommended in other reviews. AnonymousColumbus, OH6/24/2021Best bone-in breast chicken I have ever had.  Very juicy and flavorful.  We drizzled olive oil to finish it (not the 1/2 cup recommended.). Important to follow recommended times.LisaTinley Park, IL6/14/2021After reading mixed reviews, I was apprehensive. I am so glad we tried it anyway! This recipe was so simple and SO DELICIOUS! I left out the olives because I despise olives but kept everything else the same. We had to leave the chicken on the grill on the second side for an additional 6 minutes and it was just perfect. My husband and I agree, some of the yummiest chicken we’ve ever had. Served it with a simple side salad and a baguette with dipping oil. Two thumbs up! Oh and to the other reviews who have questioned the lemon juice and oil at the end and how it compromises the crispy skin. I will agree with that, but I wasn’t bothered by it.AmandaorlowskyjNew Hampshire, 🇺🇸 9/27/2020Excellent recipe.  Simple ingredients, delicious!  Also wonderful to be able to make an entrée well before the company arrives.  I tried one change the second time I made it - I added 1 Tbsp honey at the end; made it into an agrodolcewcavers37745/21/2020Great recipe. I didn't find the chicken to be dry at all. I modified to use capers and rosemary because that's what I had on hand. Super versatile. Will make again for friends.AnonymousCopake Falls, NY5/21/2020Done as it is, it turned out WAY dry!  So I modified,  Instead of adding just oil, I added 3 cloves sliced garlic and 1 tsp dried (1 Tbsp fresh) thyme to 1/3 cup olive oil and heated to roast garlic. From that, made up a vinaigrette using olive oil and added 1 Tbsp honey or sugar - makes it into a kinda agrodolce.  It was a rock star with those mods!wcavers3774Victoria, B.C. Canada5/3/2020Delicious flavors, tasted even better the next day. Just seemed to have a lot of fat / oil. AnonymousSan Francisco1/7/2020Seriously so good and a huge hit at my dinner party. I was apprehensive about grilling the chicken because I am always scared it will come out dry but it was anything but. I love this recipe for its simple ingredients and ease of cooking. Will surely use it again. Anonymousdenver, co 9/23/2019Ok, I made the recipe to clear out the fridge and with full knowledge that I can’t be bothered to heat the grill. Using butterflied boneless, skinless chicken breast, I followed the instructions and then seared the breast on a heavily oiled, ripping hot grill (not griddle) pan for a couple minutes on each side. Holy cow. It was delicious. The recipe also translates well to fish. Just lighten the lemon and salt a bit because fish has no backbone (haha) against the intense flavor. AnonymousHouston, TX8/25/2019This is a fantastic recipe! The lemon, thyme and olive just sing together. Although you may lose some crispyness with the olive oil and lemon added late it creates a perfect, flavorful dressing. The grilled lemon just puts it over the top. I served this at lunch, cold, with fingerling salad and greens. Big hit!Santa Rosa7/11/2019I improvised. Mixed oil, lemon juice, dry thyme, black pepper in a bowl first. Then cooked whole chicken cut up breast, wings, thigh, drum stick. It's not served cold. Just let chicken rest after taking it off the grill. The grilled lemon slices are extraneous but a nice touch. You can serve it bone in but I pulled the meat off the breast bone for my wife because I like to spoil her. Great dish, will do again for sure.\nAnonymousSaranac Lake NY6/5/2019Agree with Canada. Also, this is supposed to be served cold?  This is a very very odd recipe but I will try it AnonymousTennessee 5/28/2019Really? Why would you pour 1/2 cup olive oil over grilled chicken after it has been bbq’d complete with crispy skin... seems vet odd.AnonymousCANADA 🇨🇦 5/28/2019Explore Bon AppétitChicken BreastChickenPoultryOliveOther IngredientsLemonCitrusFruitSummerEasyMainGluten-FreeNut-FreeDairy-FreeKetoHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}