{"id": "4249fe8f883fb8d0c947947af32804f6", "url": "https://www.bonappetit.com/story/travel-anxiety", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Travel Anxiety Tips From a Neurotic Person | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Neurotic Person's Guide to Beating Travel AnxietyFrom someone who used to freak the F out every time she thought about getting on a plane.By Sara EliseMay 31, 2018FacebookTwitterEmailIllustrations by Tomomi MizukoshiFacebookTwitterEmailAs I’m standing in the security line, placing my stuff in a dirty plastic bin filled with other people’s stray hairs and food crumbs, I feel a bubble of panic growing inside of me. I start to worry about every possible thing that could go wrong: What if the plane crashes? What if there are bed bugs in my plane seat? What if the TSA takes my tweezers because they’re sharp and my facial hair starts to grow abnormally fast and I end up growing a full mustache while I’m on vacation? Sometimes I even feel lightheaded and have blurred vision, sweaty palms, and heart palpitations.Most travel anxiety stems from feeling like you don’t have control over the process. (Let’s be real—unless you’re in first class, you're basically being herded like cattle.) So I decided to address the main issues that contribute to flying generally being a sucky experience for me. First, plane air is dry AF, so I leave with a headache and feel like my entire sinus system has shriveled up. Second, plane food is gross, but I get super hungry when I’m flying. Third, turbulence makes my brain decide that we’re all going to die immediately. And finally, the plane seats are designed for a very small human who wants to lean forward the entire flight, which I’ve never understood.To combat these issues, I’ve developed the following regimen. It is by no means a one-size-fits-all solution to travel anxiety, but it’s definitely helped me get through my process so that I could begin living my best life, on and off the ground.Quick-fix spritzI make my own mist with essential oils to calm my nerves with aromatherapy. I like to use lavender and chamomile for relaxation with a few drops of eucalyptus for sinus clearing. Mix that with filtered water and put in a mist bottle and voila! Spritz your face every time you’re feeling dry or want an instant mood shift.Pack snacksI now make my own snacks before the flight so I can eat on my own schedule and not be hangry in the customs line. One of my favorites is this salty + sweet trail mix. There's also this great list of snacks for every palate that are quick to make and super easy to fly with.Fly highPrior to the trip, I also make indica-strain cannabutter-infused treats. Eating the treats while I’m in the security line has me pretty much asleep by the time we take off. If you live in a place where cannabis isn’t legal, CBD tinctures have a similar body-calming effect but without the high.Treat your feetHave you ever owned a pair of super plush cozy socks? There are very few feelings in the world that beat putting on a comfy pair that hug your toesies just right. So invest in a pair stat, even if only for making your plane ride more luxurious. Bonus points if they're hydrating socks with aloe vera or shea butter in them.Save faceIn addition to my plush socks, I also wear a face mask. No, not an eye mask—a mouth-and-nose-covering face mask. Scarves also work. My stretchy, breathable mask helps block out everyone around me so that I can focus on the calm music in my headphones. The full face coverage also helps with my sinus hydration. Extra credit if you spritz your lavender mist into the mask for the ultimate in relaxation.Let goEvery time I feel a pang of anxiety, I coach myself away from the edge by reminding myself that I am prepared. I am in control of all of the things that I can possibly be in control of to have a successful trip: I've thought about hydration, comfort, satiety, and relaxation! Now, my only job, aside from being prepared, is to let things unfold as they’re meant to. And to hope that the pilot knows how to do their job, too.Explore Bon AppétitHealthyishTravelRead MoreLifestyleThese 6 Products Keep Me Healthy Through Every Stage of TravelingGallery6 SlidesBy Nancy Jo Iacoi Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "Sara Elise"]}