{"id": "4258124744e3975f0486ac22a58cb500", "url": "https://www.bonappetit.com/story/atomix-design-details", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Atomix's Commitment to Well-Crafted Detail Is Bonkers and We Love It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Restaurant’s Commitment to Well-Crafted Detail Is Bonkers and We Love ItSomeone please stop me from stealing every spoon, plate, and cup at Atomix.By Elyse InamineJanuary 22, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.Yeah, we get it: The dishes at Atomix in New York City are dazzling. Just read all the reviews! But the thing that makes Atomix a true experience comes down to all the meticulously sourced details surrounding the food. The otherworldly ceramics. The personal collection of chopsticks generously shared. The menu presented on graphic flashcards—and coveted by every diner who comes through (I have two sets!).For chef JP Park and general manager Ellia Park, who also run the more casual Atoboy just two blocks away, the presentation is about more than simply showing off their taste in the good stuff: It’s about handing the mic to young Korean creatives just like them.“I want Atomix to be a way to introduce young Korean talent,” JP says. “There aren’t many channels to enter the market otherwise.”Here, the couple uses their sumptuous halibut dish to show how each detail of their sleek, fine-dining restaurant contributes to that mission.1. The Food: JP blends French (brown butter) and Korean (doenjang, a fermented bean paste) staples for jjim, Atomix’s steamed fish course. “The nutty flavor of the brown butter complements the deeply rooted umami of the jang,” he says. The sauce is then poured over a round of silky halibut, spoon-tender hunks of butternut squash, and fatty foie gras.Take your pick from Ellia’s vast collection of chopsticks.\nPhoto by Alex Lau2. The Chopsticks: “When you go to a Japanese restaurant, you pick your own sake cup,” Ellia says. “I wanted to do the same.” So she lets diners choose their own set of chopsticks, crafted by different Korean artists, from her personal collection of 40 sets. She picked them up over the last two years from different shops throughout Seoul.3. The Plate: Ceramicist Youme Oh, who also happens to be JP’s cousin, crafted this jade-hued ceramic bowl by hand to mimic traditional Korean wares. For the rest of the plates, the Parks commissioned all South Korean makers, including up-and-comers like artist Eunyoung Kown to more established names like porcelain master Namhee Kim.Gotta catch ’em all.\nPhoto by Alex Lau4. The Menu: Each dish on the tasting menu comes with one of these cards: The front side features a South Korean artist’s drawing inspired by JP’s dish sketches (Oh made this one), while the back details every component of the dish, from the sauces to the accompanying banchan.5. The Spoon: Ellia stumbled upon these simultaneously rustic- and modern-looking spoons at Jeo Jip (저집), an old-school ceramics shop in Seoul. Each copper utensil is made by hand, hence the tiny variations.Explore Bon AppétitRestaurantsRestaurants + TravelDesignDish DecodedRead MorerestaurantsHow to Wash $1,000 PlatesBy Priya KrishnarestaurantsDon’t Call Passerotto FusionBy Elyse InaminerestaurantsThe Long and Winding Road to Richmond's Most Ambitious New Restaurant—in One DishBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-22", "author": ["Condé Nast", "Elyse Inamine"]}