{"id": "425e03ea7e3b657f63fd62f675de78f9", "url": "https://www.bonappetit.com/story/party-tricks-dont-feel-like-cooking", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "How to Host a Dinner Party When You Just Don't Feel Like Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Host a Dinner Party When You Just Don't Feel Like CookingThere. Will. Be. Fried. Chicken. Alison Roman gives you permission to phone in your next party.By Alison RomanOctober 25, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.A nice thing about being a cookbook author is that when you invite people over for dinner, they never ask what you’re making because they assume it’s going to be delicious, possibly even elaborate. The other thing about being a cookbook author? You don’t always feel like making dinner—which, I have finally learned, is very much okay.As soon as I gave myself permission to not “be perfect” or “make everything myself,” I started having more fun at my own dinner parties—which yes, occasionally means “ordering buckets of fried chicken” and “eating dinner on the stoop.” The times you want to be social in your own home but Just Can’t with actual cooking are the perfect times to literally phone it in and order or pickup the things you’d never make yourself (for me, that’s a very short but specific list and includes fried chicken). Honestly, if your friends show up expecting a side of slow roasted salmon and get upset when they see a paper bucket holding crispy, golden brown legs and thighs...maybe get new friends?Though, in an effort to remind everyone that you still cook (and actually enjoy it!), throwing together a side or two and a few sauces to go along with said chicken is a great move. Plus, the chicken needs a few friends, no? This little extra effort says, “I love you enough to have you over and enjoy my company, but not enough to stand over a vat of hot oil for hours.”If you got it, stoop it.\nPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiI do not mean baking fresh biscuits (we don’t feel like cooking, remember?). I mean quickly tossing together a crunchy shaved salad or slaw made from hearty vegetables like cabbage, carrots or raw broccoli and dressed assertively with lots of citrus and fresh herbs to serve as a fried chicken palate cleanser. I mean casually whisking together a sauce with something like yogurt (or mayonnaise, IF YOU MUST), a little grated garlic and lots of salt and pepper meant for double dipping. I mean whipping up a homemade hot sauce made from finely chopped jalapeños and white distilled vinegar to dunk in, or an almost-too-hot chili oil made with chili flakes and Sichuan peppercorns to drizzle over for a spicy-numbing experience. I mean serving everything on paper plates, because you also want to say, “I love you enough to not make you do the dishes”—an even better gift than that chicken.More Party Tricks, right this way...Bad Wine Is Just a Great Cocktail Waiting to HappenIn Alison Roman’s new column, Party Tricks, the ‘Dining In’ author defends the wine spritzer.View StoryExplore Bon AppétitParty TricksFried ChickenEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Alison Roman"]}