{"id": "42667b7d5e097340ca2b5ccbb40e5949", "url": "https://www.bonappetit.com/recipe/garlic-broth", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Garlic Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueGarlic BrothBy Chris MoroccoMarch 7, 20184.8(45)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis back-pocket broth is hardly even a recipe, but it's the most soothing soup we can imagine for sick days, cold nights, and any other time you need a little extra comfort. Ingredients4 servings2heads of garlic2Tbsp. extra-virgin olive oil, plus more for drizzlingA handful of herbs (such as parsley, cilantro, and/or sage)Kosher salt, freshly ground pepperPreparationStep 1Slice 1 head of garlic in half crosswise; set aside. Separate cloves from remaining head, peel, and crush lightly. Heat 2 Tbsp. oil in a large saucepan over medium. Add crushed garlic cloves and cook, tossing occasionally, until golden brown and softened, 8–10 minutes. Add 2 quarts water, increase heat to high, and bring mixture to a boil. Add herbs and reserved halved head of garlic. Reduce heat so broth is at an active simmer and cook until garlic is very tender and broth is reduced by nearly half, 30–40 minutes. Season generously with salt and pepper.Step 2Strain broth through a mesh sieve into a large bowl (or, pass a wide slotted spoon through it a few times to fish out garlic and herbs).Step 3Divide broth among bowls. Sip it as is, or you can add cooked noodles, drizzle in some whisked eggs to make stracciatella, or rub toast with raw garlic and drizzle with oil and float on top.Step 4Do Ahead: Broth can be made 3 days ahead. Let cool; cover and chill.How would you rate Garlic Broth?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleCan you make these recipes in the metric system? I hate having to do all these conversions.Shea DewarVictoria, British Columbia 1/30/2022In Hungary, my friend's partner makes this with garlic and chicken broth, and paprika (of course), so it is red.  I make it at home and add some onions or leeks, and then blend it up and add flax milk to give it some body.  I put toast squares on top.  It helps me get through those coughing days.  Dr. D.Orlando, FL10/4/2021Does anyone know how long will this last in the freezer?Sami1/20/2021I make something similar to this, but leave all the garlic in & use chicken broth instead of plain water.Bonnie C.Culpeper, VA1/19/2021I made a lot of my own additions/edits to this but it was so delicious! Definitely will use this recipe often during the chilly winter months. For reference I doubled the garlic, sautéed shallots with the garlic, added a little bone broth to the mix, then used my immersion blender to blend the garlic instead of removing it. Throw in some white beans, and it’s a delicious, garlicky soup. AnonymousPhoenix, AZ12/16/2020This was pretty decent...but not quite what I expected given the rave review below. Good! But not great.AnonymousCanada9/16/2020I love garlic and I really want to try to make this broth, but I want to know what herbs work best. I'm  growing fresh rosemary, thyme, and basil, but I want to know what  has worked best those who have already perfected this recipe in their own kitchen?\nAnonymousSchwenksville,PA 6/5/2020So good! Could definitely be frozen if you want to save it in the future for recipes. I put rosemary, cilantro, and thyme in mine and added some leftover carrots I had . Also added a dash of fish sauce at the end before I finished salt & pepper-ing it. Feels like a broth your mom used to make you when you were sick. AnonymousHouston, TX4/11/2020Really tasty! It's nice and oily too so it has a lot of body to it. mariahllacuna6017Bay Area, CA3/16/2020Can this broth be frozen so it’s always on hand?PollograndWA3/11/2020Has anyone tried to make this in an Instant Pot?\n\nIn the process of making it on the stove top, but think it would work well using a pressure cooker.  Any thoughts?davidwspragueConnecticut12/30/2019Made this last night because I was looking for something simple to make before the overeating of holidays starts. I doubled the garlic and used thyme I had left over from another recipe. It is outstanding. Iowa12/19/2019Made this last night to use for ramen and it was great! I did find myself wanting to make adjustments to get more flavor. Instead of removing the garlic cloves, they were soft enough that I mashed them into a paste with the back of a spoon and mixed them back in. I also added some soy sauce instead of salting at the end. I used cilantro as the herb and it worked well, although I'll probably try and use more next time, as well as maybe some onion? Also would love to try as a stracciatella, I bet that would be delicious and a super fast lunch!lindsaysrNorth Carolina12/8/2019LOVE this recipe. I always use more garlic than it calls for (3 or 4 heads for about 2.5-3 quarts of water), and I add some tomato paste and whole peppercorns when i saute the garlic. I also love adding a can of drained and rinsed white beans for some protein! And I NEVER strain the garlic cloves out - if you cook it long enough, they take on a positively buttery texture. Delicious, and I always have the ingredients on hand!honeybeebutchMinneapolis, MN4/5/2019Made this tonight to help with cold symptoms and it's really delicious just on its own out of a mug. I used sage, parsley, and thyme. Very easy for a big flavor yield! buongiornonyc1/9/2019Explore Bon AppétitSoupSoups and StewsStockGarlicVegetableStarterDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Chris Morocco"]}