{"id": "42670b267e9337f11447a448b1cce75d", "url": "https://www.bonappetit.com/recipe/spinach-and-artichoke-melts", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Spinach and Artichoke Melts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueSpinach and Artichoke MeltsBy Deb PerelmanMarch 19, 20194.6(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintYour favorite creamy dip—but in a form you (and your kids) can happily eat for dinner. We recommend serving it with a simply dressed salad for the adults: Bitter greens and a bright acidic vinaigrette will be an ideal counterpart to all that cheesy goodness.Ingredients4 servings½tsp. kosher salt, plus more10oz. baby spinach114-oz. can artichoke hearts1large garlic clove, finely chopped2oz. Parmesan, finely grated (about ½ cup)2Tbsp. mayonnaiseJuice of ½ lemonDash or 2 of hot sauceFreshly ground black pepper2oz. chilled cream cheese, cut into ½\" pieces4½\"-thick slices country-style bread (such as sourdough)Extra-virgin olive oil (for drizzling)6slices provolone cheesePreparationStep 1Heat broiler. Bring ½ cup water and a large pinch of salt to a simmer in a large skillet over medium-high heat. Add spinach, a fistful at a time, letting it wilt slightly before adding more and using tongs or a heatproof rubber spatula to toss as you go. Continue to cook, tossing occasionally, until all of the spinach is wilted, about 2 minutes. Drain and let cool slightly, then squeeze out as much liquid as you can.Step 2Drain artichoke hearts and press out as much liquid as you can. Coarsely chop artichoke hearts and spinach and place in a large bowl. Add garlic, Parmesan, mayonnaise, lemon juice, hot sauce, and ½ tsp. salt and mix well; season with pepper. Gently mix in cream cheese, taking care not to fully break up pieces. Taste and season with more salt if needed.Step 3Arrange slices of bread on a foil-lined rimmed baking sheet and broil until lightly toasted, about 1 minute per side. Drizzle 1 side of each toast with oil and spoon spinach mixture on top, packing it on and taking care to cover edges so they don’t burn. Cut 2 slices of cheese in half. Place a slice and a half of cheese on top of each toast, arranging so that spinach mixture is covered.Step 4Broil toasts until cheese is melted and browned in spots, about 2 minutes (keep a watchful eye on toasts as no two broilers are the same and you don’t want the toasts to burn).How would you rate Spinach and Artichoke Melts?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleVery yummy, but quite rich with all that cheese & mayo. Would go out of my way to make again.CallieOregon6/29/2021This is easy to make and is absolutely scrumptious!  Everyone in my family loves it!\nThanks Deb for another winner!!Debra HannahKansas City2/19/2021This is a really fun way to make lunch more exciting, and super easy to make (a tiny bit messy, but not too bad). I used double the amount of garlic, next time I’ll probably use even more than that, and I recommend more provolone per sandwich. I also did not use nearly as much spinach because I thought it seemed excessive and that instinct turned out to be correct. The lemon really does brighten it up. I love this recipe, it’s going to be a great app to serve to vegetarian friends at parties (remember parties?) when sliced into individual bite sized pieces.AnonymousOmaha, NE11/12/2020Love the idea!  I added a bunch of things so can't honestly review the original... but again I LOVE the idea and will be making again! Added the ingredients I usually add to the dip version - a bit of sour cream, onion, Worcestershire sauce, dijon mustard and fresh basil.  Next time I'll cut the cream cheese cubes a bit smaller, but otherwise, it was delicious!  The lemon added a nice bit of brightness and the provolone was a melty wonderful additionAnonymousLos Angeles, CA6/24/2020Explore Bon AppétitSandwichProvoloneCheeseSpinachLeafy GreensVegetableArtichokeWeeknight MealsMainSnackNut-FreeVegetarianBroilLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Deb Perelman"]}