{"id": "426818a00d6f8ac9a8391629cf3d4877", "url": "https://www.bonappetit.com/recipe/little-gem-salad-with-buttermilk-chaas", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Little Gem Salad With Buttermilk Chaas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueLittle Gem Salad With Buttermilk ChaasBy Vivek SurtiSeptember 17, 20193.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrintChaas is an Indian buttermilk beverage, but “it’s much better as a salad dressing than a post-basketball drink,” says Vivek Surti, the chef at Tailor in Nashville, No. 7 on our 2019 Hot Ten list. “It’s buttermilk seasoned with mustard seeds, cumin seeds, curry leaves, and dried red chiles. I drizzle it over a mix of greens and whatever I’m into—tomatoes, beets, nuts.” Mix it up to make it your own. But don’t start to heat the oil until all of the chaas seasonings are measured out and close at hand; blooming the spices goes quickly.Ingredients8 servingsDressing1cup buttermilk2Tbsp. vegetable oil5dried chiles de árbol, lightly crushed, seeds removed if desired4curry leaves1tsp. cumin seeds½tsp. brown mustard seedsKosher saltSalad and Assembly1bunch red and/or French Breakfast radishes, trimmed, thinly sliced3heads of Little Gem lettuce, torn crosswise into 2\"-wide strips1small cucumber, thinly sliced½cup fresh English peas, sugar snap peas, and/or 1½\"-long pieces green and/or wax beans1sprig mint, leaves torn2Tbsp. finely chopped cilantroKosher salt (optional)PreparationDressingStep 1Pour buttermilk into a measuring glass or small bowl. Heat oil in a small saucepan or skillet over medium-high until shimmering. Add chiles, curry leaves, cumin seeds, and brown mustard seeds one at a time, pausing for a second between each addition and swirling pan. Cook until spices are toasted and curry leaves sizzle and pop, about 10 seconds (take care as oil will splatter!). Quickly pour spice oil into buttermilk; stir to combine. Taste chaas dressing and season with salt.Step 2Do Ahead: Dressing can be made 1 day ahead. Cover and chill.Salad and AssemblyStep 3Soak radishes in a bowl of ice water until they curl, about 10 minutes. Drain and pat dry.Step 4Toss half of the radishes in a large bowl with lettuce, cucumber, peas, mint, and cilantro. Drizzle in dressing; toss to coat. Taste salad and season with salt if needed. Top with remaining radishes.How would you rate Little Gem Salad With Buttermilk Chaas?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladButtermilkOther IngredientsLettuceLeafy GreensVegetableChileRadishCurry LeafHerbs & SpicesChile de ÁrbolSpringQuickSideVegetarianGluten-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}