{"id": "4274e32acf7f6aaa7bbd4e5afbca4c74", "url": "https://www.bonappetit.com/story/summer-of-beverages", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Summer Drinks for Staying Cool | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat I'm Drinking to Stay CoolCute glasses, the pitcher I love, and more reasons to stay hydrated.By Christina ChaeyJuly 4, 2021FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery other week Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.Somehow, heat-wave season in New York started before July even arrived and I’m currently experiencing the other kind of hot girl summer, the kind that prompts heat rash to bloom, uh, everywhere; even the inside of the fridge is sweating while it works overtime to stay cool.As a result the summer of beverages has arrived early this year, with a few upgrades that have made staying hydrated a lot more stylish. I recently bought this Hario V60 Cold Brew Maker, a tall and sleek pitcher that I can guarantee I will never use to make cold brew because I am that impatient. I do use it to make lots of roasted-barley iced tea by dropping an individual sachet of grains (like these ones from Ippodo) into water and letting it do its thing for a few hours.Every so often I’ll go through a phase where coffee will send me into a state of frenzied anxiety, so in my current attempt to cut back, I’ve been opting for gentler iced matcha lattes in the mornings. It’s a treat to find a delicious version out in the world, but the ritual of preparing it at home is a pleasure in itself, and takes about as long to prepare as a cup of coffee. I make homemade almond milk (see my go-to method here) a couple of times a week and keep it in a big jar in the fridge. I follow the fantastic tea company Kettl’s iced matcha latte method to the letter, then pour the finely frothed electric-green tea over a glass of almond milk and ice. (A drink this cute needs a cuter glass than the ones I own; I’m hoping these ultra-durable, stackable glasses do the trick.)If it sounds like all I’m doing these days is shopping online, it’s because...I am. I recently wrote about moving into my own apartment and unsurprisingly, the single biggest upgrade to my life has been having a fridge I can stock as I please. The best thing I have in there: Not one but THREE reusable carbonator bottles for my beloved Aarke sparkling water maker. Between those and the four bottles of pét-nat, my fridge is now 50 percent bubbles, which is the correct ratio of food to bubbles. Next on my shopping list: the perfect ice cube trays.Stay Cool in the Kitchen:Photo by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeIced Matcha LatteWatermelon and Snap Pea SaladHerby Avocado HummusBreakfast Salad with Smoked Trout and QuinoaAperol SlushyPeach Sorbet with Crushed BlackberriesExplore Bon AppétitHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-04", "author": ["Condé Nast", "Christina Chaey"]}