{"id": "427796a89c551d0cc58156559494f838", "url": "https://www.bonappetit.com/story/don-ciccio-figli-ambrosia", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "My Fall Starter Pack Is Just Bottles of This Aperitivo | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Fall Starter Pack Is Just Bottles of This AperitivoDon Ciccio & Figli’s Ambrosia is my PSL.By Jesse SparksOctober 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m a Fall Person. Once the temperature drops to 70 degrees, I break out my coziest coats and bake every apple- or pumpkin-based dessert we have on the BA website. But I’m not a Fall Drink Person. Meaning I’m not into “fall”-flavored things, like pumpkin-infused cold brews and maple-spiked ciders, because they never seem to taste like what they’re supposed to be emulating. Have the people behind them ever even tasted a pumpkin before?!But once I got my hands on a bottle of Don Ciccio & Figli’s Ambrosia, I found my Fall Drink.Made with turmeric, blood oranges, and cantaloupe, this aperitivo is bright and citrusy. The first swig tastes how it feels wearing your fuzziest sweater at golden hour and watching the sun set: warm and inviting. It’s super balanced on its own, so you can sip it on the rocks, but also complex enough to make into a spritz—(yes, a fall spritz! I like to pair it with cider, like this cute little number), and adaptable too. I’ve slipped it into a Paper Plane, a bold and tart mix of amaro, aperitivo, whiskey, and lemon juice, for a more nuanced take that other popular aperitivi don’t always provide.So as the temperatures continue to drop, you can easily guess what I’ll be doing: drinking this little elixir in an attempt to extend fall for another four months. A Fall Person can dream.Buy it: Don Ciccio & Figli Ambrosia, $35 at Warehouse Wines & SpiritsAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendAperitifShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-18", "author": ["Condé Nast", "Jesse Sparks"]}