{"id": "4277659d938f5a88b3013470489a886f", "url": "https://www.bonappetit.com/story/silken-tofu", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Silken Tofu Deserves a Permanent Spot in Your Pantry or Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is a Silken Tofu Appreciation ArticleFive very good reasons to always keep silken tofu around.By Chihiro TomiokaFebruary 10, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.I recently walked by an enterprising restaurant advertising its “tofu burrata.” Such analogies leave me conflicted. Of course, it makes sense to link less familiar foods to more popular ones. And the process of making tofu is very similar to that of cheese, with fresh soy milk used in lieu of dairy. If I had ordered that tofu item, I’m sure that it would have been just-set, custardy, and silky, much like fresh ricotta or a burrata.But I can’t help but wonder if it’s such analogies that have set up unrealistic expectations for tofu and caused some people to scorn it. Tofu will disappoint anyone who expects it to melt or to ooze or to perform as a stunt double for chicken or steak. But when you accept tofu for what it is, even the most basic supermarket version can be tailored to any occasion. Tofu—nutritious, long-lasting, and versatile—is very much its own star.Even at grocery stores as mainstream as Whole Foods, tofu comes in many forms. Today, however, I’m focusing on the silken variety. For a quick overview, tofu is the product of fresh soy milk that has been set into curds (in Japan, this is traditionally done with a mineral coagulant known as nigari) and pressed to yield varying firmness. In Western recipes, you’ll often see the most firmly pressed tofu—the stuff labeled as extra- or super-firm—used as something of a meat substitute, steeped in marinade, breaded, or fried. In Japanese recipes, however, tofu is typically less manipulated; instead, it’s used as stand-alone ingredient in soups, braises, and stir-fries. And silken tofu, on the opposite end of the spectrum, isn’t pressed at all, and it’s so soft that it can be eaten with a spoon. I find that it makes a welcome addition to my winter hot pots and summer salads. It’s also useful as a supporting player in sauces and even as a binder in meatballs.A Japanese supermarket will boast a tofu aisle to rival the yogurt section of a Parisian Monoprix, with brands like Otokomae (imported from Kyoto!) that are so flavorful they should be eaten unadorned, with the barest drizzle of soy sauce. Even if your supermarket stocks a more utilitarian brand (like House), however, this standard boxed kind is still a useful staple (and sometimes even a shelf-stable one) that you should always keep around.Once you’ve got your silken tofu, here are five ways to put it to use.1. Make it into a creamy sauce.My favorite use for silken tofu is shiraae, in which silken tofu and sesame seeds are blended into a sweet and nutty sauce for blanched vegetables. The addition of the sesame seeds and some mirin transforms even the most utilitarian box of tofu. I follow my mother’s formula, which is as follows.For a generous bowl of vegetables, take about 150 grams silken tofu (approximately ⅓ of your block; refrigerate leftovers and eat within a couple of days) and add 1 Tbsp. white miso and ground toasted sesame seeds, along with about 1 tsp. mirin (substitute sake if you don’t have mirin, along with a touch of sugar). Silken tofu is so soft that you can do all of this in a bowl with a pair of chopsticks (or a spoon).This is entirely to taste, so adjust the quantities based on your preference. The sweetness of white miso, for example, can vary drastically. American supermarket varieties skew far saltier than white miso from Kyoto. I grew up in a western Japanese family where our seasonings skew sweeter, but it is common for shiraae to rely entirely on sesame seeds, tofu, and soy sauce.Once you reach a point where the sauce is smooth and slightly nutty and tastes good to you (the texture will be something like a very light hummus), slather it onto whatever blanched vegetable you have. Spinach and green beans are favorites. 2. Fry it.If you are feeling ambitious, make agedashi dofu with the rest of your block. Coat generous (think 3-inch) cubes of firm silken tofu with katakuriko (potato starch) and shallow-fry them in a neutral oil. Note that silken tofu is fragile, so handle with care. When the cubes are golden, top with a mound of grated daikon and a warm bath of store-bought mentsuyu (or make your own with dashi, soy sauce, and mirin).3. Slip into soup.Because frying is quite an endeavor, I’m more likely to slip it into whatever soup I’m making (usually miso-based). It’s especially good when gently warmed in your next hot pot.Silken tofu is a perfect addition to miso soup.\nLaura Murray4. Top it with something punchy.Some classic topics for hiyayyako—chilled silken tofu with toppings—are puckery ponzu, chili crisp, and soy sauce (with grated ginger and scallions).Silken Tofu Lavished With Toppings Is My Ideal MealHiyayakko is joyful, decadent, endlessly customizable, and no-cook too.View Story5. Make it into dessert.Turn custardy silken tofu into bouncy dango, a generic catchall for rice flour–based Japanese dumplings:Two-Ingredient Chewy, Stretchy, Go-Anywhere DumplingsThe satisfying chew of mochi + tofu’s soft quiver.View StoryChihiro Tomioka buys chocolate chip ice cream for the chocolate chips and has written about all things Japanese at Food52.Explore Bon AppétitBasicallyTofuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-10", "author": ["Condé Nast", "Chihiro Tomioka"]}