{"id": "42814f647b2849482106d1f11489db2d", "url": "https://www.bonappetit.com/recipe/chitranna", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Chitranna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChitrannaBy Chitra AgrawalAugust 16, 20204.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sarah Jampel EmailPinterestPrintEmailPinterestPrint“My mother prepared chitranna, a South Indian rice dish from her home state of Karnataka, on certain occasions—for picnics, long car rides, holiday gatherings, and, as I recall, for an International Potluck held by my fourth-grade teacher,” writes cookbook author and recipe developer Chitra Agrawal. “She referred to it simply as Yellow Peanut Rice, and I always looked forward to it, though I didn’t learn its proper name until I was much older. The word chitranna translates to ‘mixed rice’ in Kannada. There are numerous variations, all relying on different souring agents such as lime, green mango, tamarind, or, in the case of the one I grew up eating most often, lemon.” To make it a meal, serve it with Green Beans Palya, raita or yogurt, and achar, and read more about the recipe here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonZojirushi NS-TSC10 Micom Rice Cooker$192 $165 At AmazonWooden Spoon$6 At AmazonForkRimmed Baking Sheet$20 At Bon Appétit MarketSmall Bowl$13 At AmazonLarge Skillet with Lid$40 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 Servings1cup rice, preferably sona masoori or basmati1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, divided, plus more⅛tsp. ground turmeric¼cup fresh or frozen grated coconut or dried unsweetened shredded coconut1tsp. plus 2 Tbsp. vegetable oil¼cup raw or unsalted roasted peanuts, preferably with skins1tsp. chana dal (optional)1tsp. urad dal (optional)½tsp. black mustard seedsPinch of asafetida1dried red chile4–5fresh curry leaves1lemon¼bunch cilantroGreen Beans Palya, raita or yogurt, and achar (for serving)PreparationStep 1Place 1 cup rice, preferably sona masoori or basmati, in a medium bowl and wash in several changes of water until water is almost clear. Pour in fresh water to cover generously. Let soak 30 minutes.Step 2Drain rice and transfer to a medium saucepan or a rice cooker. Add 1¾ cups water, then mix in ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and ⅛ tsp. ground turmeric. If using a medium saucepan, bring to a boil. Cover and reduce heat to low. If using a rice cooker, press cook. Cook until rice is tender and there is no water remaining, 12–15 minutes. Remove from heat and let sit, still covered, 10 minutes (this will allow the grains to separate). Fluff rice with a fork and spread out on a rimmed baking sheet; let cool.Step 3If using ¼ cup frozen grated coconut, microwave in a small bowl in 15 second bursts or place in a colander and set under warm running water until thawed. If using ¼ cup dried unsweetened shredded coconut, place in a small bowl and pour in hot water to cover. Let sit until ready to use.Step 4Heat 1 tsp. vegetable oil in a wok or large skillet over medium. Add ¼ cup raw or unsalted roasted peanuts, preferably with skins, and cook, stirring, until golden brown, about 4 minutes. Transfer to paper towels to drain; season with salt. Wipe out and reserve wok.Step 5This next part will happen quickly, so measure your ingredients out before you start cooking. Combine 1 tsp. chana dal and 1 tsp. urad dal (if using), ½ tsp. black mustard seeds, and a pinch of asafetida in a small bowl. Heat remaining 2 Tbsp. vegetable oil in reserved wok over medium-high. As soon as oil is shimmering, add a mustard seed. When the oil around the seed starts to sizzle or the seed starts to move, add remaining spice mixture. Cook, covering with a lid as needed to contain the mustard seeds while they are popping and stirring so mixture evenly toasts, until very fragrant and sputtering has subsided, about 1 minute.Step 6Reduce heat to low. Break 1 dried red chile in half and add to wok. Rub 4–5 fresh curry leaves between your fingers to release oils and add to wok. Cover immediately (the moisture from the curry leaves will cause the oil to spatter). As soon as sputtering subsides, uncover and stir to evenly coat in oil.Step 7Add cooled rice and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt to wok. Cook, stirring, until combined, about 2 minutes. Stir in ¼ cup fresh grated coconut, thawed frozen coconut, or drained dried coconut and cook, stirring, until combined and warmed through, about 1 minute. Remove from heat.Step 8Cut 1 lemon in half. Coarsely chop leaves and tender stems from ¼ bunch cilantro. Squeeze juice from lemon into chitranna. Measure out 2 Tbsp. chopped cilantro and add to chitranna along with peanuts. Taste and season with more salt if needed.Step 9Top chitranna with remaining cilantro. Serve with Green Beans Palya, raita or yogurt, and achar.All our friends are here!\nPhoto and Food Styling by Sarah JampelStep 10Do ahead: Rice can be made 3 days ahead. Let cool in saucepan, then cover and chill. Break up with your hands until there are no clumps before using.How would you rate Chitranna?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleChitranna is typically 7 different types of rice, of which this is just 1 type.AnonymousSan Antonio, TX10/13/2020This cook is NOT an imposter; her mom is from Karnataka. So am I. This recipe is legit. Not that you need my validation to believe this dish is YUMMY AF. Cook it, taste it, and tell me I'm wrong. \nAlso, such amazing kudos to bringing South Indian dishes to light - so exhausted by the constant recipes for chicken tikka masala. Never thought I'd see my daily childhood dishes here!AnonymousMinneapolis8/27/2020I made this with brown basmati rice and a 1/4 tsp of Kashmiri chilli powder for extra spice - it was phenomenal! I didn't have skin-on peanuts so used a mix of roasted salted peanuts and plain cashews. Paired with the green bean palya it was a perfect lunch. AnonymousLondon, UK8/27/2020I really liked making this chitranna, and I paired it with the Green Beans Palya. The only substitution I had to make was I used basil leaves instead of curry leaves. \n\nI definitely think that the asafetida is required for this dish and can't be substituted. I bought chana dal and urad dal for this, but could see using some substitutions if those are difficult to find. (Though I didn't have issues finding them in an Asian Market).AnonymousPhoenix, Arizona, United States8/20/2020Why is an American impostor of northern Indian heritage violating a sacred Deccani dish?TheSwordofTipuZultanMysore, India8/18/2020Why is an American impostor of northern Indian heritage making Deccani food?TheSwordofTipuZultanDeccan8/18/2020Explore Bon AppétitSouth AsianAsianIndianRiceRice & GrainsTurmericHerbs & SpicesCoconutFruitCurry LeafEasySideVegetarianVeganGluten-FreeDairy-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-16", "author": ["Condé Nast", "Chitra Agrawal"]}