{"id": "429b168e1819732b55255611803d9e8c", "url": "https://www.bonappetit.com/story/best-anchovies-ortiz-jar", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "The Best Anchovies Don't Come in a Tin, People | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Anchovies Don't Come in a Tin, PeopleDitch those annoying little cans and get on Team Jar.By Alex DelanyJune 20, 2018FacebookTwitterEmailFacebookTwitterEmailIf you’re the type of person who enjoys anchovies, you’re where you need to be. You’re in a safe space. We’re not going to tell you that they smell weird or taste fishy or are generally gross. We're just going to tell you what the best anchovies are. Here at Basically, we love anchovies. But that doesn’t mean we love every anchovy equally. We have favorites, and a jar—notice we said jar, not can—of Ortiz anchovies will always be our go-to for these little fish. In terms of practicality and flavor, it beats the tinned ones every time.Is the tin of anchovies half-empty or half-full? Doesn't matter. After you peel back the cover and use a few fillets in your pasta sauce or on a slice of pizza you just reheated (pro move), you're stuck with a tin of anchovies without a lid. You can throw the tin in a Ziploc bag or take the fillets out and throw them in a Tupperware, but both of those options usually end with you hovering in front of the fridge a couple weeks later wondering, What the hell is that smell? These jars of Ortiz anchovies solve this whole dilemma with a resealable lid. When you pick a couple fillets out of the jar, you just screw the lid back on and forget about them. You can do that. They won't smell up the fridge.Another awesome thing: There's a little fork attached to the jar of Ortiz anchovies. It's cute, but it's not there just to be cute. It's there to make you a more civilized human being. Sticking those fingers of yours inside a jar of fish and olive oil isn't the most graceful act you'll ever commit. The fork allows you to remove the anchovy fillets without having to rub your hands all over them, which is generally a pretty good way to keep your hands smelling nice. You're not going to get a nickname like Fish Fingers or Stank Hands or Chovie Brovie when you use the fork. You don't want those nicknames. You want the fork.Anchovies belong in a Caesar salad. You better make them  good.\nPhoto by Heidi's BridgeAnd it goes without saying that we co-sign the quality of Ortiz jarred anchovies. The olive oil-packed Spanish fish taste better than the run-of-the-mill stuff, and they have a tender, meaty texture. When people say that they hate anchovies, they’re probably referring to bad anchovies. And that’s understandable. Bad anchovies are...intense. But the good ones pack a nice salt punch and clean flavor. They’re little nuggets of umami that boost flavor levels in sauces, condiments, dressings, and marinades. The bad ones just make things taste old and fishy.Now, let’s talk about price. If you expected us to say, “But the real reason we love these is because they’re free!” we’re sorry to disappoint you. They aren’t. They’re on the pricier side of things, running you about 11 bucks for a jar. But since the fillets are top quality, and you don’t have to worry about wasting any of them (Thanks, lid!), we’re happy to pay that price. Plus...the fork. Cute ain't free, people.Just Buy It:  Ortiz Anchovies, Pack of 3 3.5-oz. Jars, $35 on Amazon.Then make yourself a Caesar salad!Lazy Caesar SaladNo raw egg yolk, no problem. All the flavor you love in the classic in a quarter of the time.View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Alex Delany"]}