{"id": "42a15a357383af53873d3245a144f385", "url": "https://www.bonappetit.com/story/not-that-you-needed-one-more-reason-to-visit-chicago-but", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Not That You Needed One More Reason To Visit Chicago, But… | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredNot That You Needed One More Reason To Visit Chicago, But…The Food Festival that Will Have you Swinging your HipsBy Chicago GourmetSeptember 20, 2018FacebookTwitterEmailFacebookTwitterEmailChicago is a symphony of perfect marriages. It's got big-city charm with a warm, Midwestern sensibility. It’s resplendent in the summer, yet it is transformed into a snow-globe wonderland that winter lovers pine for. It’s got outstanding art museums and access to outdoor activities. And best of all, it touts some of the best chefs and restaurants in the world, a roster that includes fine dining; chic, James Beard awarded hotspots; and good ‘ole hot dogs.Consider Elske for gorgeously-plated dishes in a cozy locale. Opt for the burger, always, at Au Cheval. Elevate your palate with Mexican flavors at Mi Tocaya Antojeria and take it easy when you order laid-back American favorites at Giant. Beyond the local mainstays we can’t get enough of, however, Chicago offers a stellar lineup of festivals each year, including our very own Chicago Gourmet, September 26–30.Setting up shop each year in Millennium Park, this epic food festival puts a sonic spin on the five-day experience through this year’s theme–Rock the Fork–pairing great food with music. Think of it as a concert of culinary delights. Featuring cooking demos, wine and mixology seminars, and so many tasty bites you may never leave, Chicago Gourmet is slated to rule the city this month.Experience several of the aforementioned restaurants, and take advantage of special musically inspired events, such as Italian Feast on the Symphony Center Stage, where you’ll dine within the walls of where the city’s most prestigious classical musicians pluck and play. Enjoy a menu prepared by Chicago native, Season 15 Top Chef Winner Joe Flamm, and others. Or, jive with musically inclined chefs John Hogan, Jeff Mauro, Bruce Kalman, and Duff Goldman, who do double duty at Blues, Booze & Bites. During the main event weekend in Millennium Park, Rick Bayless and Diana Dávila are teaming up for a duo demo during Chorizo Cha-Cha Challenge. Things heat up with Emily Fiffer & Heather Sperling of Botanica during Spice Party, and our very own Julia Kramer will emcee There's More Than One Way to Make a Gin & Tonic cocktail seminar.There’s no shortage of dishes to try or beverages to imbibe, and with the Windy City as your backdrop, we think you’ll be a lifer at Chicago Gourmet.Explore Bon AppétitChicago GourmetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Chicago Gourmet"]}