{"id": "42aaa562b700f491eda4b2627978c1ec", "url": "https://www.bonappetit.com/recipe/vietnamese-herby-turmeric-fish-summer-rolls", "year": 2020.0, "month": 7.0, "day": 1.0, "content": "Vietnamese Turmeric Fish Summer Rolls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVietnamese Turmeric Fish Summer RollsBy Tyna HoangJuly 6, 20204.7(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Justin Bridges, Food Styling by Tyna Hoang EmailPinterestPrintEmailPinterestPrint\"Time-honored recipes are important both for passing down history within families and introducing the culture to those outside it. And while for many people that might mean that traditional recipes should never be changed, I would argue that food is always evolving,\" writes recipe developer and food stylist Tyna Hoang. \"The key questions are who is making those changes and whether they honor the spirit of the tradition. It's crucial that the history of the dish is referenced, respected, and not discarded. My family's recipes are dear to me, and I aspire to share Vietnamese cuisine with a wider audience and to broaden and deepen the understanding of what Vietnamese food is and can be. More often than not, some indigenous ingredients are inaccessible, so I've learned to adapt and use elements that are available. These acculturations are part of what makes me the Vietnamese-American I am. This particular recipe is my homage to Hanoi's classic Chả Cá Lã Vọng, a dish of fried fish seasoned with turmeric, shrimp paste, and dill that's served over vermicelli with lots of herbs and nước chấm, a staple fish sauce dressing. My simplified version is married with the summer roll for a quick and refreshing nod to an otherwise perfect traditional recipe. In Vietnam, summer roll dishes are usually served deconstructed with platters of crisp greens, herbs, and accoutrements so guests can assemble their own rolls (post COVID-19, of course). Preparing and eating a traditional meal is like sampling an important part of history, and I'm just as excited to participate in its evolution so that there are new stories to look forward to and share.\"All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonShallow Serving Bowl$26.99 At AmazonMedium Skillet$60 At AmazonFish Spatula$14 At AmazonIngredients4 servings4Persian cucumbers1pineapple12\" piece ginger4–6garlic cloves1tsp. ground turmeric4Tbsp. fish sauce, divided½tsp. crushed red pepper flakes, plus moreKosher salt1lb. white fish fillets (such as red snapper, hake, halibut, or tilapia), preferably skin-on1Tbsp. sugar1lime1Tbsp. vegetable oil12rice paper roundsTender lettuce (such as green leaf or Bibb) and tender herbs (such as cilantro, dill, and/or Thai basil); for servingPreparationStep 1Slice 4 Persian cucumbers lengthwise into planks that are about 3\" long and 1/4\" thick. Cut off the crown and the rounded bottom of 1 pineapple, creating two flat surfaces. Stand the pineapple up, then use your knife to cut away the skin, following the contours of the pineapple from top to bottom. Cut your pineapple in four long pieces, then remove the core. Cut the pineapple plank crosswise into short 1/4\" pieces. Set aside.Step 2Peel and finely chop one 2\" piece ginger and 4–6 garlic cloves. (You should have about 2 Tbsp. each.) Mix 1 Tbsp. finely chopped ginger, 1 Tbsp. finely chopped garlic, 1 tsp. ground turmeric, 2 Tbsp. fish sauce, ½ tsp. crushed red pepper flakes, and a pinch of kosher salt in a small bowl. Cut 1 lb. white fish fillets, preferably skin-on, into 4 equal pieces, then massage marinade onto fish to coat evenly. Place in a shallow bowl or dish. Let marinate in the fridge at least 30 minutes and, preferably, up to 2 hours.Step 3Meanwhile, make the nước chấm dipping sauce. Stir 1 Tbsp. sugar and 5 Tbsp. warm water in a small bowl until sugar is dissolved. Halve 1 lime and squeeze in the juice (use your hand or a fine-mesh sieve to catch the seeds). Add a pinch of red pepper flakes if you’d like it to be spicy, remaining 2 Tbsp. fish sauce, remaining 1 Tbsp. finely chopped ginger, and remaining 1 Tbsp. finely chopped garlic. Stir to combine. Set aside for serving.Step 4Remove fish from refrigerator. Heat 1 Tbsp. vegetable oil in a medium nonstick skillet over medium. Working in batches if needed, cook fish (start skin side down, if your fish has skin) until flesh is opaque all the way through, firm, and flakes easily with a fork, about 3 minutes per side. Transfer to a plate  and flake into smaller pieces.Step 5To assemble rolls, working one at a time, dip 12 rice paper rounds in a clean shallow bowl or pan of hot water until pliable but not floppy, about 15 seconds. Lay flat on a large plate or cutting board and arrange a piece or so of torn tender lettuce, some tender herbs, a slice or two of the reserved cucumber and pineapple, and a few pieces of fish horizontally across the center of wrappers, leaving a 2\" border on left and right sides. Fold left and right sides inward, then tightly roll wrapper starting at the side nearest you. If you’d like to make rolls with exposed fillings, simply fold in the left side of wrapper before adding fillings. Arrange fillings so that they overhang slightly on the left side, then fold in the right side and roll up. Repeat until all of the fish has been used (you should get 10–12 rolls). Serve with reserved nước chấm for dipping alongside.Photo by Justin Bridges, Food Styling by Tyna Hoang Photo by Justin Bridges, Food Styling by Tyna Hoang Photo by Justin Bridges, Food Styling by Tyna Hoang Photo by Justin Bridges, Food Styling by Tyna Hoang Photo by Justin Bridges, Food Styling by Tyna Hoang Step 6Alternatively, you can plate all of the components separately with a bowl of warm water for soaking the wrappers and let guests assemble their own.Step 7Do ahead: Nước chấm can be made 2 weeks ahead. Cover and chill.How would you rate Vietnamese Turmeric Fish Summer Rolls?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleMy husband and I had such a fun time assembling each little summer roll at the dinner table, it's like a breeze of fresh air away from work and reality.TracyNew York, NY6/30/2021Fish was absolutely delicious, easy, well-balanced. Can’t wait to make again soon.Anonymous8/11/2020Delicious? And minimal cooking time is great for summer. Anonymous212318/5/2020Very tasty and with curb appeal.  Everyone enjoyed the rolls.AnonymousColumbus OH7/20/2020Made this for dinner tonight and it was excellent. I had cilantro and chives on hand, so that’s what I used for the herbs. My only regret was that I didn’t make more.balderdash7/16/2020This recipe is great! I would make the rolls again and would also use this marinade just to make the fish. The marinade was so so flavorful. More recipes from Tyna please!AnonymousNew York7/8/2020more vietnamese dishes please!! perfect for summertime I would love to see some noodle dishes from this author. (nice to see asian dishes from asian contributors as well!)Anonymouscalifornia7/7/2020YES - Thank you so much for this feature! Tyna Hoang is so incredibly talented and I love how accessible her recipes are. I appreciate how she embraces adapting ingredients to what might be more available (especially now during Covid) while simultaneously respecting the history & tradition of that food. Glad to see more diverse representation on Basically - I look forward to seeing more of her contributions.Rachel MBrooklyn, NY7/7/2020I'm part Vietnamese and I love the new presentation of recipes like this.  It's important to honor the history and traditions of foods.  Excited to try this dish, I've never had this variation before!AnonymousSan Francisco Bay Area7/6/2020Excited to try this recipe and enjoyed the writing and presentation of this (new to me) dish!AnonymousIthaca, New York7/6/2020Explore Bon AppétitWrapAsianSoutheast AsianVietnameseFishSeafoodCucumberVegetablePineappleFruitTurmericHerbs & SpicesStarterMainNut-FreeGluten-FreeDairy-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-06", "author": ["Condé Nast", "Tyna Hoang"]}