{"id": "42b1031924ba3e16931df712dbc8b7bc", "url": "https://www.bonappetit.com/recipe/seafood-chowder", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Seafood Chowder Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueSeafood ChowderBy Betsy and Kristine LarsenApril 14, 20204.9(46)Read ReviewsTriangleEmailPinterestPrintPhotographs by Elizabeth Cecil, food styling by Danielle PattavinaEmailPinterestPrintEmailPinterestPrintWhat sets this New England–style chowder apart from all the rest? It’s deeply flavored yet light and decidedly not gloppy. This recipe is from Larsen’s Fish Market, a tiny little seafood shack in the tiny little fishing village of Menemsha, Martha’s Vineyard.IngredientsMakes about 8 quarts2Tbsp. unsalted butter, divided1large onion, finely chopped1celery stalk, finely chopped1Tbsp. Old Bay seasoning1tsp. freshly ground black pepper, plus more1Tbsp. dry sherry or mirin2½cups clam juice, divided2cups fish or seafood stock or broth1lb. potatoes (any kind), peeled,cut into ½\" pieces1¼lb. mixed white fish (such as swordfish and/or sea bass) and shellfish (such as peeled, deveined shrimp), cut into ½\" pieces8oz. cooked lobster meat, cut into cubes (optional)1Tbsp. all-purpose flour½cup half-and-halfPreparationStep 1Melt 1 Tbsp. butter in a large heavy pot over medium heat. Cook onion and celery, stirring often, until translucent, about 5 minutes. Mix in Old Bay and 1 tsp. pepper; cook, stirring, 30 seconds. Add sherry; cook, stirring occasionally, until alcohol has cooked off, about 1 minute. Add ½ cup clam juice; bring to a simmer. Cook, stirring occasionally, until vegetables are very soft, about 5 minutes. Add stock and remaining 2 cups clam juice and bring to a boil. Add potatoes and simmer, uncovered, adjusting heat as needed, until just tender, about 5 minutes. Add fish and shellfish and cook, stirring gently, just until mixture returns to a simmer, about 2 minutes. Remove from heat and stir in lobster meat if using.Step 2While the potatoes are simmering, melt remaining 1 Tbsp. butter in a small saucepan over medium heat. Whisk in flour and cook, whisking constantly, until light blond in color, about 1 minute. Whisk in half-and-half and 1 cup chowder broth (skimmed off the top) and bring to a simmer, whisking constantly. Cook, still whisking, until thickened and creamy.Step 3Stir half-and-half mixture into chowder ; return to medium heat. Bring to a simmer, stirring gently. Remove from heat; season with salt and more pepper. Ladle into bowls and serve with oyster crackers.How would you rate Seafood Chowder?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis is a superb recipe. I made it once to rave reviews by the resident food critic (my wife) who said it was absolutely delicious and a great treat.   But when it came time to make it again, I couldn't find it! Thanks be to the seafood gods, that I found this page again!  I love the flexibility of the method - one can modify ingredients and amounts depending on preference and what you have on hand, and it will still work out. A classic version of a great classic. Eric OlsonSanta Fe, NM10/14/2021This was a great base.  The guys went deep sea Fishing in Cape Hatteras and caught an Amber Jack.  Bought some shrimp and mussels and had left over corn and potatoes from last night.  Cut up some slab bacon with this broth base…. Was absolutely amazing .  It’s a keeper !Donna B Lancaster pa8/11/2021The only clam juice I can  find is  the bottled Clamato which seems to be  tomato juice with a bit of clam flavour.  Is that what the recipe calls for or can a real clam juice be bought somewhere? I'm in Canada.MargCanada6/19/2021Very good! This is nice comfort food on a cold winter day. \n\nI used sea bass and crab meat, which is what they had at my market. The sea bass had a very tough skin, to my surprise, so I de-skinned it, using kitchen shears and a sharp knife. And as another commenter said, the potatoes need more than 5 minutes to get soft. \n\nAlso I used some subs since I have food sensitivities. I used arrowroot flour instead of all-purpose flour, and \"simple\" coconut milk, which is about the same consistency as half-and-half. And ghee instead of butter. All worked fine. \nAnonymousNYC1/27/2021I just made 10 gallons of this for a very large group. I excluded the lobster  due to cost. I used clam juice rather than seafood stock.\nIt was absolutely wonderful. I plan to make this  often.Fran MilioDelaware12/23/2020What can be used in place of clam juice if making this for a group where someone is allergic to shellfish?  We'd be using all fish for the protein.\n\nIf there isn't a replacement, what chowder recipe would you recommend that may work in its place?Anonymous12/12/2020This was delicious! I found instructions a little hard to follow, potatoes needed more cooking. That didn’t matter it came out great. I used Halibut, baby Clams and crabmeat. Cara11/29/2020I used herbs de provence instead of old bay since I was out of old bay and for the fish/shellfish combo I did 1/2 lb monkfish, cut into cubes, 1 lb. shrimp, 4 medium scallops, and 8 oz. lobster meat. Delicious and I’ll make again. Can’t wait to bring my seafood guy a cup of this! He helped me pick the whitefish for this recipe. nianicoleLas Vegas, NV6/23/2020Thank you Molly! I will be missing Larsen's this year also.  How lovely to have a little MV this summer! How about that bluefish pate next ??!! -KimcalikimkCottekill, NY5/27/2020This is incredibly delicious (with a bit of a kick!) and comes together quickly. I used striped bass and clams and it was amazing. I used a heaping tablespoon of Old Bay and I’m glad I did. Don’t let the picture fool you - the broth is a bit darker in color, not white (there’s more broth than cream and that’s a good thing!). Endlessly adaptable - I’ll try adding shrimp next time. And there will definitely be a next time!!EAinBK5/26/2020This was so, so delicious!! I used sea bass, shrimp, and lobster meat. Super light but had so much flavor. Though yes, it definitely doesn't make 8 quarts...was enough for 4 servings in my house!alezamoflorida5/25/20208 cups. Simple typo, guys. Simmer down - pun intended :) Looks delish! It will still be cool enough in L.A to make it this weekend - yay!!MinniesmomLos Angeles5/25/20208 Quarts?  That must be a typo!!  I will make it this weekend and check it out!!Carroll CharbonnierSanta Rosa5/16/2020I have not made it yet but wondering, why does it say it makes 8 quarts? That would be 32 cups. Not enough ingredients for that.AnonymousVirginia5/3/2020I just made this wonderful chowder.  Followed the recipe exactly as written, but used fresh fish I had just purchased; cod loin and shrimp.  This is an extremely easy, satisfying  meal.  Perfect for staying in during nasty weather and during the pandemic.  Only one problem...wish I could share with friends!  But my husband and son loved it.AnonymousNew York4/28/2020Explore Bon AppétitChowderSoupSoups and StewsNew EnglandAmericanPotatoVegetableFishSeafoodLobsterShellfishMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Betsy", "Kristine Larsen"]}