{"id": "42b2bd801d099c267166f3ef28670425", "url": "https://www.bonappetit.com/story/bonnies-peach-ginger-jam", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Bonnie's Peach Ginger Jam Is Really My No. 1 Jam | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBonnie’s Peach Ginger Jam Is Really My No. 1 JamI go through an entire jar in…two days.By Christa GuerraJanuary 16, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl Jones, Prop styling by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Do not get me started on this jam. I give it to all my friends. I bring it to every party. I put it on every cheese board. That’s because Bonnie’s Peach Ginger Jam is the best thing in the world.I’m not a huge peach preserves person—they can be too gloopy and sweet—but this jam has a little bit of candied ginger, which gives it some complexity and the perfect amount of heat to keep me going back for more. I discovered it while shopping at Whole Foods, and since I’m an art director, I was obviously judging all the jams by their labels. Once I saw Bonnie’s, I loved how simple the jam label looked with its thin-lined script and white label, sort of minimal for the jam world. So I bought it, and I’ve been hooked ever since.Whenever I have this jam at home, it’s like nothing else exists in my kitchen. Even if I bought some ingredients to make dinner, I’ll always spoil my appetite by eating too much of this jam on whatever I can find—rice cakes, Ritz crackers, matzo, toasted bread, water crackers, an entire baguette. It takes me only two days to go through the jar. I’ll just plow through it. But one of my favorite ways to eat it is on a cheese board. Just cut up some pears, brie, and manchego, and stock up on two jars. Trust me, it will go fast.Buy it: Bonnie’s Peach Ginger Jam, $10 at Bonnie’s JamsAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingJamRead MorecultureThis Jam Club Brings Sqirl to You—No Flight to L.A. RequiredBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-16", "author": ["Condé Nast", "Christa Guerra"]}