{"id": "42e88a649598af082674cbc8e258ce4e", "url": "https://www.bonappetit.com/story/modernist-alarm-clock", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "This Futuristic Alarm Clock Turned Me Into a Morning Person | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Futuristic Alarm Clock Turned Me Into a Morning PersonIt has done the impossible.By Elyse InamineOctober 4, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I tried it all. I stored my phone away from my loft bed, forcing me down some very steep, not-up-to-code stairs. I routinely read and re-read all the late fees I’d incurred for sleeping through morning circuit training classes. Nothing—not even shame and losing money, my two greatest weaknesses!—got me to actually roll out of bed when my alarm went off. That is, until my very patient husband bought me the LBell Wake-Up Light and Alarm Clock.The stylish, opaque globe is like the Swiss Army knife of sleep: It’s a clock and wake-up light (and also a sleep aid and radio). Every morning, the clock slowly emits light, starting with a deep red and ending with a bright, white light, to mimic the sunrise and quietly wake me up in the 20 minutes before my alarm sounds. At the end of that cycle, a soundtrack of gently flowing water fills my tiny loft, telling me that it’s time to get up. And I actually do.Now I’m up early—sometimes even before the peaceful trickle of water begins—to stretch before class or make some coffee. That’s because I feel rested, not jerked awake by my usual phone alarm and craving just ten more minutes of sleep. Somehow, I’m still a bit late to the office...but I’ll just have to blame my post-workout hair straightening routine for that. —Elyse Inamine, digital restaurant editorBuy It: L Bell Wakeup Light, $46All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItSleep WeekShoppingRead MoreLifestyleThis Low-Waste Shampoo Bar Saved My Thick, Dry HairBy Christa GuerraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-04", "author": ["Condé Nast", "Elyse Inamine"]}