{"id": "42e8d7d060ceeebb92b8ca3a7babc25a", "url": "https://www.bonappetit.com/recipe/goi-tom-bap-cai", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Gỏi Tôm Bắp Cải Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueGỏi Tôm Bắp CảiBy Tyna HoangFebruary 9, 20214.9(32)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrint“Gỏi, or nộm in northern Vietnam, defines a salad of sorts in Vietnamese cuisine,” says recipe developer and food stylist Tyna Hoang. “It is typically a combination of ingredients accompanied by various toppings and a protein (in this case, bắp cải, or cabbage, serves as the base). The dressing can vary, but more often than not it’s nước chấm, a garlicky fish sauce lime condiment that is essential to Vietnamese cooking. Gỏi is often served as a starter or alongside a heartier dish as a palate cleanser. For as long as I can remember, there has never been a family gathering or Viet wedding without gỏi. The combination of crisp cabbage, shredded carrots, and fresh herbs tossed with tangy nước chấm and topped with crunchy peanuts makes this salad as refreshing as it is exciting. This recipe is a simplified version of one that I grew up on, but upgraded with shrimp poached in coconut milk for a subtle richness.”Ingredients4 servings2Tbsp. sugar2red or green Thai chiles, thinly sliced1garlic clove, finely gratedJuice of 1 lime¼cup fish sauce113.5-oz. can unsweetened coconut milk1tsp. kosher salt, plus more8oz. large shrimp, peeled, deveined½head small green cabbage, shredded (about 5 cups)2medium carrots, peeled, shaved½medium red onion, thinly sliced¼cup coarsely torn cilantro¼cup coarsely torn mint¼cup store-bought fried shallots¼cup crushed dry-roasted peanutsPreparationStep 1Combine sugar and 7 Tbsp. warm water in a small bowl and whisk until sugar is dissolved. Stir in chiles, garlic, lime juice, and fish sauce. Set nuóc cham aside.Step 2Bring coconut milk, 1 tsp. salt, and ½ cup water to a simmer in a small saucepan over medium heat. Remove from heat and add shrimp. Cover and let sit until shrimp are opaque and pink, about 4 minutes. Drain and chill until ready to use.Step 3Toss cabbage, carrots, onion, cilantro, and mint in a large bowl. Pour half of reserved nuóc cham over and gently massage into vegetables until evenly distributed. Top with chilled shrimp, fried shallots, and peanuts. Serve with remaining nuóc cham alongside.Do ahead: Nuóc cham can be made 1 week ahead. Cover and chill.How would you rate Gỏi Tôm Bắp Cải?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleDelicious! My boyfriend said it was the best thing I've ever made him. The nuóc cham has a surprisingly complex (and delicious) flavor for how few ingredients are in it. I followed the recipe almost to a T - though I let the shrimp sit in the coconut milk longer (the coconut flavor really came through) and added in vermicelli so it would be more filling. JamieDenver, CO9/6/2021Super delicious, definitely adding to the rotation. Didn't bother with poaching the shrimp and just sauteed them in coconut oil instead. I thought the first half of the nuoc cham was plenty for the salad and didn't use any of the reserved half, so will probably halve that part next time. Fried my own shallots, because yum. SarahBerkeley, CA5/5/2021I've made this a ton of times now and switch out the ingredients with what I have on hand, it's awesome! Great recipe. EmilyAthens, GA4/26/2021Love this!  It is great now but will really make a perfect summer dinner salad.  So refreshing!Bon Appetit fanAshland, OR4/1/2021Loved this recipe - will 100% make it again many more times. The coconut-milk-poached shrimp didn't add anything for me, so next time I'll skip it or maybe sub in grilled marinated shrimp instead.Lori3/24/2021Great and easy weeknight dinnerJrLos Angeles 3/20/2021Explore Bon AppétitSaladVietnameseSoutheast AsianAsianShrimpShellfishSeafoodGreen CabbageCabbageLeafy GreensVegetableEasyQuickWeeknight MealsMainDairy-FreeGluten-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Tyna Hoang"]}