{"id": "42ea2dec5f687a820bd3b04b8607cf61", "url": "https://www.bonappetit.com/recipe/chicken-meatballs-green-beans-tomato-broth", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Chicken Meatballs and Green Beans in Tomato Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Meatballs and Green Beans in Tomato BrothBy Chris MoroccoSeptember 14, 20204.7(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown, Bowl by Meilen Ceramics EmailPinterestPrintEmailPinterestPrintMy grandma used to make a version of this dish using pork and showers of Parmesan. I have updated it to include ground chicken and miso for a lighter, late-summer dish with equally deep flavor,  but feel free to use whatever ground meat you prefer. Gently poaching the meatballs is not only faster than roasting, but means none of their flavor is lost to a baking sheet.Ingredients4 servingsMeatballs1lb. ground chicken, preferably dark meat4scallions, finely chopped1large egg2Tbsp. red or white miso1tsp. kosher saltFreshly ground black pepperBroth and Assembly3Tbsp. extra-virgin olive oil2shallots or 1 small onion, thinly sliced4garlic cloves, thinly sliced1Tbsp. double-concentrated tomato paste1pint cherry tomatoes2Tbsp. red or white miso12oz. green beans or other pole beans, trimmed, sliced into 2–3\" lengthsKosher saltTorn basil leaves (for serving; optional)PreparationMeatballsStep 1Combine chicken, scallions, egg, miso, salt, and several grinds of pepper in a medium bowl. Mix vigorously with a fork until combined (it will seem a bit wet at first, so keep at it) and just beginning to feel slightly sticky; set aside.Broth and AssemblyStep 2Heat oil in a large saucepan over medium. Add shallots and cook, stirring often, until softened, about 5 minutes. Add garlic and cook, stirring, until softened and just beginning to turn golden around edges, about 3 minutes. Add tomato paste and cook, stirring, until slightly darkened in color and beginning to sizzle in fat, about 2 minutes. Add cherry tomatoes, miso, and 4 cups water. Bring to a simmer, stirring vigorously and mashing miso against side of pot to dissolve, and cook, stirring occasionally, until most of the tomatoes have burst open, (it’s okay to help them along with a spoon), about 5 minutes.Step 3Add green beans to saucepan and cook until tender, 6–8 minutes. Using 2 spoons, drop gumball-size balls of reserved meat mixture into simmering broth. Once all of the meatballs have been added, cook, stirring occasionally, until cooked through, about 5 minutes. Season with salt.Step 4Ladle meatballs, vegetables, and broth into bowls and top with basil if desired.How would you rate Chicken Meatballs and Green Beans in Tomato Broth?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleA delicious meal for the first day that felt as though autumn is arriving soon. I made it with ground turkey, chicken bone broth, and sliced mushrooms and subbed coconut amino acids to taste to kick up the nutritional value. The meatballs did fall apart before cooking through with only gentle stirring. I wound up transferring the dish into two separate skillets to cook faster. It came out thick and rich and saucy and delicious. Thanks for a new favorite quick and healthy dinner recipe!SceneSirenDallas, TX9/22/2021I've made it a few times now, and while it is very good as written, I tend to add a few things just because we prefer a slightly more robust flavor. But again, the lightness of the original recipe is very good if that's what you're looking for. In the meatball mixture, I add a hefty dash of red chili flakes and use lots of black pepper as well. I used chicken broth for water and don't add as much salt, and also lemon zest and dill at the end. Really delicious and in regular rotation now! Sarah New York 4/14/2021This. Was. Amazing. Such delicious umami flavors. Incredible comfort food.JBSeattle2/22/2021I guess this depends on the miso you have, but the miso I used itself was really salty to begin with and I added the whole tsp of salt to the meatball mixture without thinking and it ended up being way too salty(almost inedible). I'd suggest starting with 1/2 tsp of salt to begin with if your miso is already salty.AnonymousCA1/4/2021Subbed ground turkey for chicken, onion for shallots, and bok choy for green beans and still came out great! I thought 4 cups of water was a little too brothy for me so I let it simmer down a bit before adding in the meat and veg (I will probably just opt for less water next time.) The recipe says only 4 servings but it seems like so much more than that! Great recipe, will be adding to the meal prep rotationJodieSanta Barbara, CA12/1/2020Delicious! Made with 1/2 chicken broth, 1/2 water when it says to add 4 cups of water and came out delicious and hearty! Also used instant miso broth concentrate and had perfect miso-ey flavor! Second time making this and will become a staple. AnonymousPhoenix, AZ11/30/2020Delicious!  Made it just as written and it came out great.  Added some rice to a few bowls but otherwise just ate it as a soup.NoraBuffalo, ny11/29/2020I made this recipe today. The meatballs turned out completely amazing. I really wanted to make chicken meatballs. This was the first time I ever made them. I bought boneless skinless thighs and put them in a food processor because the packaged minced chicken at the supermarket didn't look so great. I also didn't have cherry tomatoes or basil leaves so I used small tender tomatoes that I had and parsley. I will DEFINITELY be remaking this recipe. It was absolutely delightful. zozoNew York11/25/2020This recipe turned out wonderfully! It’s a great weeknight dish for when you want something fresh and homemade without putting in a ton of time and effort. I served everything over rice and would definitely recommend that for a heartier twist. anna_cayotLong Beach, CA10/2/2020We made this just as written in the recipe and we thought it was amazing.  We also found it got better the next day!  Very flavorful broth and meatballs, I thing the miso was the secret weapon of the flavor :)  We'll definitely make this again, we loved it!AnonymousMcLean, VA9/30/2020Meatballs were ok; kinda fell apart in the broth even with minimal stirring. Might be because I used turkey instead of chicken OR they were simply too large. I thought 2tbsp/miso in the meatball was a bit crazy so I only added about 8 grams. I also added powdered ginger (thanks penzeys!) I liked the broth but ended up adding 3 thinly sliced shishito peppers, reducing the miso by half and supplementing with a hearty spoonful of chicken better than bouillon. Added about 8oz./green beans. I imagine if you had a lot of people to feed you could add all 12 oz, but I could barely fit the pound's worth of meatballs and 8 oz of beans into my pot submerged enough to cook. At the end I topped with giardinera from number one sons (best ever giard!). Seriously, so good! Thanks for the fun recipe Chris, can't wait to play with it even more. Anonymouswashington DC9/22/2020This is a home run with summer and simple ingredients  Miso made light but flavorful broth. I learned Miso can be used as a substitute for bouillon!!!  Am adding this to my recipe book.\n\n AnonymousSacramento, CA9/22/2020I liked the recipe as a whole. The meatballs were really flavorful and denifitely my favourite part of the dish, and though the broth was a little bit bland, adding chopped mint leaves, ground pepper and lemon juice about a minute before I took my pot off the stove definitely fixed that.AnonymousGreece9/21/2020Explore Bon AppétitStewSoups and StewsGreen BeanVegetableMisoCondiments, Sauces & PastesCherry TomatoTomatoGround ChickenChickenPoultryFallEasyOne-Pot MealsQuickWeeknight MealsMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-14", "author": ["Condé Nast", "Chris Morocco"]}