{"id": "42ebe84f0fac1529e1295151ce29c433", "url": "https://www.bonappetit.com/story/tomme-beevas-protest-support", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "If the Building Burns, Well, We’ll Figure It Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf the Building Burns, Well, We’ll Figure It OutAmid the protests in Minneapolis, Tomme Beevas has turned his restaurant into a hub for protection and supplies.By Tomme Beevas, as told to Stephanie MarchJune 1, 2020FacebookTwitterEmailPhoto By Caitlin AbramsFacebookTwitterEmailAs the Twin Cities roiled in anger over the killing of George Floyd, I watched our local restaurants get swept up in the tide. Many places, already strapped by the pandemic, chose to shutter out of solidarity. Some lost their buildings to the fires. And some answered the call to take a stand. As the senior editor of Food & Drink for Mpls.St.Paul Magazine, I knew if there were one restaurant owner in the city who would put himself and his business on the line, it would be Tomme Beevas of Pimento Jamaican Kitchen. His small Jamaican outpost on Eat Street, a neighborhood dominated by immigrant family businesses running through the middle of the city, has always been a welcoming gathering place for peoples of many backgrounds. I called Tomme and asked what these days have meant to him. —Stephanie MarchI am a Black man and a business owner. And yet, if I die, what’s the point of owning a business? I have dreadlocks. I fit the stereotype. I am a target. This protest is about my life. And my business is 80 percent Black and other people of color, so this is about us.Pimento never closed. We had to shut down our St. Paul restaurant due to the pandemic, but this Minneapolis spot has been open for carry-out the whole time. And now, during the protests, we still aren't stopping. We can’t stop—because our neighborhood needs us.We decided to keep our doors open through the protests so that we could be a safe place for people who were out there. If not us, then who? If not now, then when? There are long term problems that we have to fix in this country, but right now Minneapolis is ground zero. We have to be in this.Volunteers help distribute food, water, and other donated supplies.\nPhoto by Caitlin AbramsWe put the call out on Twitter for masks, gloves, medical supplies and water donations. The amount that showed up was amazing—we were overwhelmed with cases and cases of water, and people just kept coming by and dropping off more bags of supplies. Because the protests have been interrupting supply lines and shutting down public transportation, people couldn’t get food, so people from other neighborhoods brought food from their grocery stores into the city. We became a distribution point for the people in our area, whether they were protesting or not.Thursday night, we heard on the street that we might be a target for the white supremacists who have been using the protests as a cover for their own agenda. So, seven of our employees committed to staying at the restaurant, no matter how late. We made plans for putting out fires and prepared as well as we could for whatever might happen. Our main goal has been to keep people safe. We thought, “If the building burns, well, we’ll figure it out.” Because Pimento isn’t a building, really. Pimento is people.Food, water, and other donations from the community\nPhoto by Caitlin AbramsAs word spread, 50 volunteers showed up to help protect us and the neighborhood. Together we stood and watched over each other: a Vietnamese jewelry store, a Chinese grocer, all the businesses on the block. We had Eat Street on lock! We didn’t need the police force. We don’t need our tax dollars to go to people who want to kill us. This was an act of public community safety. It was love.You know, Thursday was my birthday, and it was the first birthday I’ve ever worked. But it was good to be at Pimento, and to be here now, as all these people keep showing up with more food to donate and ways to help. We have trauma that we have to heal. And we need to be here to do that work.Want to help support Pimento's efforts on the ground? Venmo @pimentokitchen (and if prompted enter verification 0645‬).Explore Bon AppétitFirst PersonMinneapolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-01", "author": ["Condé Nast", "Tomme Beevas", "As Told To Stephanie March"]}