{"id": "42f854c824633c991eaf9c9169d27f0d", "url": "https://www.bonappetit.com/story/gourmet-makes-behind-the-scenes", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Behind the Scenes of Gourmet Makes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSing Alongs and Tagalongs: What Goes Down on the Set of Gourmet MakesI spent five blissful days behind the scenes on Gourmet Makes as Claire Saffitz baked Girl Scout Cookies.By Alex BeggsMarch 17, 2020FacebookTwitterEmailFacebookTwitterEmailThere’s a lot you don’t see when you watch Claire Saffitz recreate beloved junk food on Gourmet Makes. Her coffee, for one, might be hidden behind a stack of cookies. You’ll never see all of the downtime on set while dough chills and ovens preheat. There’s singing, dancing, and deep philosophical conversations about the Fast and the Furious franchise. You don’t see the culinary assistants in the corner, crouched in front of a stainless steel cabinet, searching for the right type of coconut oil. And even I wasn’t allowed to see the Google sheet of the budget, which producer Tyre Nobles assures me almost always comes in “under.” (When Tyre brought his own iron in from home—more on why later—I believed him.)This January, I was allowed to lurk on set to document behind the scenes of Gourmet Makes: Girl Scout Cookies and now I can share that riveting glimpse with you, dear superfans. The crew wanted this to be a story about the power of friendship. And maybe it is. But it’s also about our loosey-goosey formula for making good, wholesome, fun TV here at Bon Appétit. (So far, Gourmet Makes has chalked up over 200 million views.) Here’s a day-by-day, hour-by-hour track record of how it gets done. With lunch breaks.But First… A Few Things Claire Would Like to Clear Up Real Quick:“We’re not sponsored by companies that make snack foods.”“We eat the leftovers. They go to editors and video team. There’s a Slack channel about it.”“There was a rumor I moved to Alaska and started a bakery. I didn’t.”“I’m not here against my will.”Watch the episode of Claire making Girl Scout Cookies\nDay 11:00 p.m.-ishAfter tracking down Claire, who’s just finished filming the bagel bites episode, director Dan Siegel tells me he’s worried she’s going to want to eat lunch before filming begins. She stands in front of the pyramid of Girl Scout cookies and says, “why not break for lunch?” Nope. She blows air out of her lips. The crew assembles into their usual spots, from  from left to right from Claire’s POV:Jon Weigell, associate producer, is sitting on a crate with his laptop. Jon keeps notes for the editors but sometimes misspells things, like “silk pad” instead of “silpat,” which cracks everyone up. He’s also a singer in two metal bands: Sabretooth and Attempted Revenge.Kevin Dynia, director of cinematography, is wearing an “easyrig” vest that protects his back while he holds the heavy camera on his shoulder. He, Tyre, and Jon are huge wrestling fans.Dan Siegel, director and No. 1 Claire wrangler, is standing at the ready with his beloved director’s slate.Tyre Nobles, producer, morale boosting extraordinaire, and corporate credit card holder, is organizing the stash of Girl Scout cookies.Mike Guggino, sound mixer, is sitting on a stool with headphones on and a big bag of sound equipment. Mike plays guitar in a Led Zeppelin cover band but is also in a “real band” called The Space Merchants, FYI.Culinary assistant Christine Malanga (and me) seated against the Gourmet Makes pantry shelves by the windows.Rhoda Boone, food director for video and Claire’s “biggest cheerleader in her darkest moments,” is zooming around the kitchen. Rhoda oversees the culinary assistants who shop for groceries, source supplies, do prep work, and wash dishes for the various Bon Appétit and Epicurious shows.Dan moves a package of dried kelp out of the camera’s sightline on Andy Baraghani’s station, and then slaps his slate and we’re rolling. Claire starts analyzing the pile of cookie boxes. “Someone already opened this one!” she says holding a box of Tagalongs. Kevin groans, “I’m sorry.”Wandering by with a huge English cucumber in hand, Adam Rapoport grabs a Samoa and says the new lemon cookies are “nonsense.” Someone on the crew says, “we’ll have to blur that cucumber out,” and they all laugh in a collective low, manly chuckle. This is when I realize everyone is either wearing flannel or Patagonia, and I see two pairs of hiking boots. The video team is very aesthetically outdoorsy.More Test Kitchen editors stop by to try cookies: Molly Baz, who drops her wallet and sends cards flying everywhere, Sohla El-Waylly, and Andy Baraghani, who’s snackish for a Samoa.Lunch break! Dan has to tell Claire, “eatcha burrito,” because she’s gotten distracted talking to me about how distracted she gets talking to her friends in the kitchen.3:42 p.mTyre has made everyone “spa waters”—lemony, minty ice water—in labeled quart containers. “He slaps the mint and everything!” Jon tells me, eyes wide. Tyre waves his pointer finger in a slow circle to signal it’s time to roll and Claire cracks up. “Tyre’s hand motion—only he can do it—is a huge part of the show,” she says. “It’s a morale booster.”Claire scrapes the chocolate coating off a Tagalong, and shows us the button-like depression for the peanut butter. “I fill my depression with peanut butter too,” mumbles Kevin. The chuckle erupts.It’s important to get that shot of the cookie’s cross-section. For science.\nPhoto by Emma FishmanDan reminds Claire that now’s time for her “favorite part.” Reading the ingredients. Christine swoops in to take away the cutting board of cookie shavings. Claire says the famous line, but channels Eeyore. “Can you...sound more excited about it?” requests Dan. Claire’s voice barely uplifts: “And now it’s time for my favorite part, reading the ingredients.” Tyre dances.4:28 p.m.While Kevin sets up to shoot at the computer, where Claire will search YouTube for videos of Girl Scout cookie recipes, Claire and Mike chit-chat about J. Lo’s Oscar nomination snub. The sun’s going down, Claire lets out a monster yawn and stretches her arms, Mike touches his toes...energy is low. This is Take 9. I ask Dan how many takes there are in a typical shoot day. “Many more than this,” he replies.5:27 p.m.Claire believes that all Girl Scout cookies are the same base cookie recipe, and that’ll be the first recipe she tackles. Christina has set up a sheet tray of basic cookie ingredients: flour, butter, sugar, and then makes a mad dash to find vanilla, corn starch, and baking powder in the dedicated Gourmet Makes pantry. In between takes, the crew breaks out into “Heaven Is a Place on Earth” for no discernable reason. Claire whips up a quick sablé dough and hands it to Dan to put in the fridge.That’s a wrap. The culinary team makes a grocery list. Tyre cleans everything up. “I gotta make sure the area is clean so Gaby doesn’t yell,” he jokes as Kevin takes down the lights.Day 2 (which is actually two weeks later)While everyone is setting up, Tyre tells me about Test Kitchen Apocalypse. It’s a game Dan invented: In the event of a zombie apocalypse, and everyone’s stuck in the Test Kitchen, what would you use to survive? “The goal is points for creativity,” Dan clarifies. “I’d throw ball bearings on the floor and the zombies would slip.” Claire would use the blade of a food processor as a throwing star. Or maybe a kitchen torch and can of Pam to make a flamethrower. Tyre would use a dough hook, to stab the chest of a zombie and pull the heart out.10:08 a.m.The crew camps out in a formal dining room off of the Test Kitchen where they eat lunch and store equipment. Claire is deep in thought at her laptop and doesn’t hear Mike asking her a question. Dan tells him, “She’s ordering emergency underpants online.”Claire: “First of all, never say ‘underpants.’ I ordered underwear and a bathing suit online, because I’m going on vacation.” This is Claire’s first vacation in...over a year. She’s been filming the show, writing a cookbook, planning a wedding. She needs this vacation.Kevin gets a hypnotizing shot of dough mixing.\nPhoto by Laura Murray11:17 a.m.Shooting has finally begun and Kevin leans it to get a shot of another batch of cookie dough swirling in the stand mixer. In the background, Sohla’s making homemade HobNob cookies and the kitchen smells amazing.For some reason Dan puts on a Mardi Gras eye mask used in Chris Morocco’s show Reverse Engineering (which he also directs), placing his eyeglasses over it. Claire looks up from washing her hands and shakes her head, smiling.The dough has to chill. I lose track of takes. Dan loses track of Claire when she disappears to make a phone call. Kevin starts singing “praline, praline, pra-liiiiiine,” to the tune of Dolly Parton’s “Jolene.”12:29 p.m.The crew is doing the YMCA???12:33 p.m.Claire’s first batch of cookies have burned and she accuses Dan of knowing they were burning. “Maybe look inward when you’re mad,” Dan says.She makes more. Chris comes by to try them, Gaby’s giving someone a piece of her mind, and Mike is mimicking curling (uh, the sport) with his big fluffy boom microphone. (“This is off the record,” he tells me. No it was not). It’s absolute chaos in the Test Kitchen.This crew will follow Claire to the ends of the earth—and into the freezing walk-in. \nPhoto by Laura Murray1:22 p.mWhen Claire needs cookie cutters, she starts to wander the kitchen and the crew jumps into action as if electrified. Filming starts and stops in between rolling out new cookies and putting them in the fridge to chill, and in each pause, they chat movies. Claire has recently watched all three Terminator films. Photographer Laura Murray stops by wearing her childhood Girl Scout sash complete with a square dancing patch.This spurs a discussion about which Girl Scout badges everyone would earn. “Andy gets the skincare badge,” says Claire. “Molly gets the abbreviation badge. Gaby gets the organizing badge. Brad gets the autodidact badge.”1:50 p.m.Lunch break!2:40 p.m.Culinary producer Kelly Janke sets up a brand new shiny red KitchenAid stand mixer while Kevin and Jon sing, in homage to Aretha Franklin, “You make me feel like a brand new stand mixerrrrrrrrr!”Delany: Cookie opportunist.\nPhoto by Laura MurrayAs Claire works on the Thin Mint cookie dough, Delany keeps popping by to claim his badge. The ‘tado badge? Claire wants him to pick something genuine. He struggles. “The all-around best badge? The humility badge?”While the dough chills, everyone gathers ‘round a laptop to watch a new Fast and the Furious trailer. Claire’s eyes widen and her mouth opens into a shocked O at the stunts.3:53 p.m.Dan: “There’s probably a lot of lost footage of Claire straightening her workspace. She can’t work in messy conditions.”Dan, Tyre, and Jon with the Tagalong mold. \nPhoto by Laura Murray4:11 p.m.Claire is using Amazing Mold Putty to make a mold for the Tagalongs while talking to Andy about J.Lo and Shakira’s Super Bowl performance. Kevin warbles “Dan Siegel, Dan Siegel” to the tune of “Shakira, Shakira.”4:40 p.m.Dan: “Take 28.”Claire: “It feels like Day 28.”5:30 p.m.Claire is shaving chocolate off another Tagalong so she can make a mold of the naked cookie and some of the crew are singing “Come Sail Away.” Mike tells me, “this is the spicy hour.”Filming ends with Claire announcing her plans for the next day and answering some questions from Dan like, “how do you feel about making Girl Scout cookies at this point?”Claire: “I know what I’m doing.”“If you earned one badge for today, what would it be?” he asks.“Working while tired?”And that’s a wrap.Here we go.\nPhoto by Laura MurrayDay 310:42 a.m.Claire: “You know how some days, you don’t know what mood you’re in until you’re on the subway?”Dan: “But what about when you’re here with all your friends?”Claire needs a snack and rummages for cottage cheese she left in the fridge a month ago—finds it! Today she’s shooting the Tagalong peanut butter filling, but first, Claire wants to clean a dirty microwave that’s been driving her crazy for months, months! She grabs a bottle of spray cleaner and attacks it. “You’re going to have to blur this out,” she says, taking the crusty microwave plate to the dish pit. Everyone groans and moans. “In case it isn’t clear,” Claire says, “this is more about anxiety management than anything.” (Dan: “It was pretty clear to me.”)She punches out Samoas and then fills the Tagalong molds with dough. She can only make three at a time.While the dough is chilling, Claire talks to Mike about Vanderpump Rules. Mike has worked on a variety of reality shows, including Real Housewives, Ghost Adventures, and “all the Amish shows,” and has endless stories about them.12:55 p.m.A quick round of Test Kitchen Apocalypse (Dan wants to vacuum seal zombie brains out). “If there’s one thing you take away from Gourmet Makes,” Claire tells me, “it’s that we make our own fun.”Lunch break!2:40 pm.Conversation has shifted to conspiracy theories, the Mandela effect, and the movie Shazam! while Claire punches indentations in the Samoas and bakes Thin Mints.3:39 p.m.The hustle/bustle in the kitchen has quieted down and not a lot’s happening. Claire’s starting work on the Samoa caramel. Dan pulls out three types of coconut oils and she snaps up the one she needs. Editorial assistant Jesse Sparks walks by eating a giant peeled carrot.5:17 p.m.Jon offers his homemade peanut butter to Claire for use in the Samoa filling, but after she blends it with vanilla, salt, and a little water, it oozes oil. “How much oil did you add to this?” she asks him, twice. Jon blushes deeply.That’s it for today.Day 410:24 a.m.Claire knocks the peanut butter filling on the counter. It’s hard as a rock. “Not sure how I’m feeling about this peanut butter…”Jon: “If you need to use something else, I won’t be hurt.”Kelly going through the Gourmet Makes pantry, which contains MANY types of cheese powder.\nPhoto by Laura MurrayKelly rushes to track down Claire’s favorite peanut butter, Smuckers natural. Dan is telling everyone about a dream he had where he crushed a baby mouse (Dan’s wife is pregnant). Mike reassures him, “babies are actually not that delicate, they can fall off the bed…”Somewhere along the way, the peanut butter mixture on the stove starts burning. “We don’t say the ‘b word’ around here,” Mike corrects me. “You mean: ‘got some color,’ ‘pushed things a little,’ ‘this one caught,’ ‘very well done,’ ‘very caramelized,’ ‘toasty, roasty toasted.’”10:55 a.m.Claire begins applying caramel on the Samoas with her beloved offset spatula and Dan asks, “Need some help?” Claire is the student who does the entire group project herself, so she doesn’t want help. But she needs it. Otherwise this is going to take all day. Christina Chaey, Sarah Jampel, and I come in to help, and by help, I mean I broke a cookie and was banned from any more help. It’s taking about four minutes per cookie because the caramel is very sticky and not very spreadable, and Claire is a perfectionist. “Is this an exemplary example?” asks Sarah. “Maybe a little thinner,” replies Claire. “I don’t...wanna disappoint you,” Sarah says. Dan tries, and Claire says he’s done “irreparable damage” to it. She redoes a cookie Rhoda has finished.Around 1 p.m.We break for lunch.Tiny scale, being tiny.\nPhoto by Laura Murray2:13 p.m.Everyone begins searching for “tiny scale”. “You know how in Sex and the City they say New York is the fifth character?” Claire says. “Tiny scale is another character on Gourmet Makes.” Rhoda helps her make a plan for the chocolate coating. “You don’t have to temper,” she reassures Claire.3:14 p.m.Mike cries out, “Claire, Moonstruck LIVE! is sold out!” Claire uses angled food tweezers to dip each Tagalong in chocolate.4:49 p.m.“This is when we do arts and crafts,” says Tyre. He brings out the Girl Scout sash he bought on Amazon, 3D fabric paints, the only patch that arrived in time, which says COOKIE DIVA, and his iron from home. “Sometimes filming gets in the way of all the fun we’re having,” Claire says when she sees the paints.At a bathroom break, Claire grabs her phone and whispers to me, “This is when I check my email,” and sprints away.5:19 p.m.The cookies are complete, but the kitchen is cleared out and there’s no one to try them on camera. So while technically Claire finished the challenge in four days, they’ll need a final day of shooting to get those reactions.Mike tries a Tagalong as Claire packs them neatly on a sheet tray. “There’s a flavor I’m getting...is it Jon disappointment?”While Claire begins her elaborate decorations on the sash that’s way too small on her, everyone discusses which role they’d be on the Fast and the Furious (Dan is Vin Diesel, Claire is Michelle Rodriguez, Kevin is Helen Mirren, etc.). Claire uses her food tweezers to fix a mistake in her puffy paint design.6:12 p.m.The sash is complete and everyone packs up.Claire carefully plates her perfect cookies.\nPhoto by Emma FishmanDay 510:42 a.m.The Thin Mints and Tagalongs have a light splotch of oil on the tops, probably from the cocoa butter in the coating. “Don’t try and make me say I should have tempered it,” Claire warns Dan. It’s important they get the shot of her holding the original cookie next to the recreated one, cut in half to see the cross-section. Claire compliments her work: “Every element is harmonious.” She takes a plate of cookies to the window to take a photo she’ll post on Instagram when the episode airs.Sohla swooping in for Samoas.\nPhoto by Emma Fishman11:14 a.m.Claire goes to put on the sash but it traps her at the armpit. “I need a sash extender.”Dan: “Let’s stop trying to add another two hours to the shoot.”She cuts the sash carefully along the bottom seam so it can hang over her shoulder, and Dan asks her to take cookies to the 26th floor, where the Bon Appétit editorial staff works. “What would a Girl Scout do?” he asks. “They go door-to-door selling their cookies! You gotta sell!”Claire: “I didn’t sign on to this.”We cram into the elevator with Claire who’s holding a sheet tray of cookies, gazing down at them proudly.In the office, Andy tries a cookie and gushes. “They are so tender and so proportioned.” He makes a plan to tell Claire about his date later.Chris is ecstatic and at one point uses the word “evanescence,” and talk turns to Jon’s peanut butter, which is “probably the best I’ve ever had,” says Chris, and Jon lights up.More staffers try cookies and Claire wants to make sure there’s a plate for deputy editor Julia Kramer, who’s in a meeting. Back in the kitchen, she says a few parting words about the challenge as a whole, and when it’s time to say the line, “this is how you make gourmet Girl Scout cookies,” she rolls her eyes deeply. One more time, requests Dan, but “hold the look.”11:52 a.m.The episode wraps, and the crew jumps up to set up the next one: Tater Tots. The day isn’t done yet.Explore Bon AppétitVideoRead MorecookingClaire Saffitz Made the Apple Cake of Our DreamsBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Alex Beggs"]}