{"id": "430f8e70f21901a938666d0011ce76a6", "url": "https://www.bonappetit.com/recipe/swordfish-steaks-cherry-tomatoes-capers", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Swordfish Steaks with Cherry Tomatoes and Capers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSwordfish Steaks with Cherry Tomatoes and CapersBy Claire SaffitzApril 4, 20194.0(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintActive Time15 minutesTotal Time30 minutesSwordfish, with its meaty texture and strong (not in a bad way) flavor, can stand up to other robust seasonings like these. In its place, choose another firm-fleshed type, such as cod, halibut, or salmon.Ingredients2 servings4tablespoons olive oil, divided1–21-inch-thick swordfish steaks (about 1½ pounds total)Kosher salt, freshly ground pepper½small red onion, finely chopped4oil-packed anchovy fillets, drained, finely chopped215-ounce cans cherry tomatoes, drained2tablespoons drained capers2tablespoons Sherry vinegar or red wine vinegar2tablespoons oregano leavesLemon wedges (for serving)PreparationStep 1Heat broiler. Drizzle 2 Tbsp. oil in a 2-qt. baking dish. Add swordfish steaks and turn to coat; season with salt and pepper.Step 2Toss onion, anchovies, tomatoes, capers, vinegar, and remaining 2 Tbsp. oil in a medium bowl; season with salt and pepper and arrange around fish.Step 3Broil until fish is golden brown and tomatoes are starting to blister, 5–8 minutes. Turn fish and broil until fish is opaque throughout and tomatoes have burst and are blistered in spots, 5–7 minutes.Step 4Top with oregano and serve with lemon wedges for squeezing over.How would you rate Swordfish Steaks with Cherry Tomatoes and Capers?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleDifficult to broil swordfish immersed in the tomato melange. Have to cook the fish separately, as well as the tomatoes. Nice change to plain swordfish. Used champagne/balsamic vinegar. Fresh oregano a little strong for my taste. AnonymousSan Francisco9/5/2021How close should the broiler be to the fish ? 4 inches or 6inches?  I’m sure it makes a difference.EHNew w8/27/2021Fantastic recipe and easy! Made it twice for my husband and my 93-year-old father and they both loved it! DO NOT forego the anchovies! They bring together the sauce and provide an umami that compliments the swordfish so nicely. I did broil the tomatoes for 4 minutes before throwing them in with the onion mixture. And do not overcook this - it keeps cooking just a bit once it sits for a couple minutes. As my late mother would say: Divine!TammyLaguna Beach, CA8/4/2021Amazing. Made with halibut and left out anchovies. This is a new go to for my picky family.carrieolewisSan Francisco9/12/2020Delicious and easy!  I used fresh cherry tomatoes, too, and put them in the broiler for 3-4 minutes before adding the fish.  The fresh oregano is a fantastic garnish.AnonymousBrooklyn, NY8/19/2020This is delicious! I had fresh cherry tomatoes and it worked great to give them a head start as others suggested. I did not have anchovies or capers but I did have a jar of hoagie spread and it was a top notch sub. katematayaDallas, TX6/29/2020You can use fresh cherry tomatoes in the article about her cooking on vacation, she says to give them a head start and get blistered, then toss in swordfish.nagaEarth4/19/2020Just wanted to ask if you can use fresh cherry tomatoes.. or does it not make a difference. Am going to make this dish using Halibut.lynnpratsidesBritish Columbia Canada4/8/2019Please correct me if I am wrong but I thought swordfish was on the list of non-sustainable fish.AnonymousMontreal, Canada4/8/2019Explore Bon AppétitSwordfishFishSeafoodCherry TomatoTomatoVegetableCodHalibutWeeknight MealsEasyMainDairy-FreeGluten-FreeNut-FreeBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-07-20", "author": ["Condé Nast", "Claire Saffitz"]}