{"id": "4320839ff479b77e4405b70921c3324a", "url": "https://www.bonappetit.com/story/grow-your-own-food", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "How to Start a Garden Even If You Don't Have a Yard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle How to Grow Your Own Food, Even If You Don't Have a GardenNot-so-green thumbs welcome.By Aliza AbarbanelJuly 15, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn It’s Getting Hot in Here, Healthyish assistant editor (and aspiring low-waste disciple) Aliza Abarbanel walks us through one thing we can do each month to adapt our lifestyles and pantries. Up next: Setting up a successful garden, even if it’s all indoors.A bouquet of floppy scallions is quietly regenerating from its roots on my windowsill, next to a stout leafy plant that, in a previous life, was nothing more than a slimy avocado pit. I don’t have a backyard or even a fire escape to call my own, but I’m still driven to grow things, and I’m not alone. The past few months have seen a resurgence of interest in gardening—as a coping mechanism, a way to strengthen community resiliency, a screen-free source of entertainment, and an ultra-local food system.“When quarantine hit and shelves were empty, I was really thankful that we didn’t have to go out and I was glad that I already had some summer plants going,” says L.A.-based food photographer and avid gardener Jeni Afuso. About 200-square-feet of her concrete-covered backyard is packed with planters overflowing with okra, shishito peppers, and Sungold tomatoes. It’s a produce lover’s paradise, with benefits that go deeper than dinner. “Gardening connects me to my great-grandfather who emigrated from Okinawa to work on the sugar cane fields in Hawaii; my grandfather, who was a Japanese gardener and landscaper in San Fernando Valley in the 1950s; and my late father, who enjoyed gardening with a curious soul,” says Afuso.The appeal is obvious, but the obstacles to growing your own food can seem daunting—especially for people like myself with limited access to outdoor space. Unwilling to accept defeat, I turned to passionate backyard gardeners like Afuso and Dominique Drakeford, sustainability influencer and founder of Sustainable Brooklyn, plus farmer and horticulturalist Amber Tamm, to create a blueprint for anyone who wants to develop a green thumb. Before you hit up the local nursery, ask yourself these questions:What’s my sunlight and space situation?Forget your heirloom tomato craving for now: Light, space, and seasonality dictate what you can successfully grow. “Whether you have yard access or an apartment, observe how the sun is hitting your windows or how the sun arches over the land to figure out where to plant what,” says Tamm. “You don't want brassicas like kale in super sunny spots, that’s more for tomatoes. Figure out what you can grow, not what you want to grow.”Start tracking light just after the sun rises, then note if each area is in full sun, dappled sun, partial shade, or full shade every hour until sundown. For indoor plants, The Sill recommends a quick shadow test: Hold a piece of paper parallel to your preferred window around midday, then hold your free hand about a foot above the sheet of paper. A sharp shadow means bright light; a softer shadow means softer light.Next, focus on space. The soil beneath grassy yards can be transformed into fertile ground with time and fertilizer, and cement-covered rooftops, balconies, or backyards can be outfitted with earth-filled containers. If you’re constricted to counter space alone, don’t despair. Herbs, microgreens, and sprouts can flourish indoors. Wheatgrass can be sprouted from seeds in a few days then planted in a pot (or repurposed container) stationed in bright sunlight; pea shoots will grow in covered trays with no sunlight required; herbs like basil, thyme, and oregano flourish in window sills. Sprouted potatoes can even be propagated in repurposed, dirt-filled garbage cans—no planters or garden required.What will I actually eat?There’s no point in planting cilantro if you think it tastes like soap. After mapping out your light and space, head to a local nursery, farmers’ market, or seed resource to assess your options based on the current stage of each growing season, and don’t be afraid to ask questions.If local options aren’t meeting your needs, there’s always the internet. “Kitazawa Seed Co has been a vital connection to my heritage,” says Afuso. “They have so many seeds for Asian vegetable varietals that are nonexistent here in the US, even at Japanese markets. I started with the vegetables we bought at the Japanese market, like komatsuna and mizuna, because I was tired of going every week. We saved so much money not going to the market, we saved a lot of gas, and a lot of Japanese vegetables are sold pre-bagged, so it was nice not seeing as much plastic in the house.”What will I plant in?“People get caught up in tools and pots, and I want to emphasize how to utilize recyclable items,” says Tamm. “It’s one of the best ways to start.” Turn milk cartons into herb gardens by flipping them sideways and cutting circular holes for planting, start seeds in pint-size berry containers, and drill drainage holes in the bottom of large cans to accommodate solitary herbs.If you decide to buy some containers, be strategic about your surface area. Raised vegetable beds help maximize space but can get pricey. “I didn’t want to commit to building a raised bed so we bought $1.50 planters at Daiso as I needed and also some five gallon nursery pots, which ended up being less expensive,” says Afuso.How will I learn?Nature is unpredictable, especially for beginners, so it’s essential to find good gardening resources to supplement your own instincts. “I followed certain YouTube channels like Epic Gardening and Cali Kim, and read Farming While Black by Leah Penniman, but a lot of it was trial and error and understanding that a lot of it comes down to creating healthy soil,” says Drakeford, who upped her soil game with a worm-powered backyard compost bin.Tamm shares tips from her favorite farmers through her blog, Voices from the Garden, but also encourages beginners to take their own notes. “Inherently, on a cellular level, we know how to grow food; we've just forgotten or don’t have the time to remember,” she says. “Use this time to remember and create an index of what works and doesn't work for your space.“In this spirit, Afuso organizes her in-the-garden observations in a meticulous spreadsheet, tracking germination temperature, notes on which plants need vertical support, and other reminders for the years to come. “I’m going to be growing food for the rest of our lives,” she says.My own indoor garden is just beginning to progress past the row of herbs on my windowsill, thanks to a notebook packed with plans for pea shoots, mung bean sprouts, and other achievable projects for my space (indoor) and light (strong, but filtered). The final pages are itemized with information on purple bok choy, sturdy Tuscan kale, endless heirloom tomatoes, and other al fresco dreams. This sprawling garden is, for now, purely imaginary, but the exercise itself has given me a new perspective on food systems—one that other gardeners share.“I’ve always been an advocate for farmers, but being able to have my hands touch soil and understand what it feels like to grow on a very small scale, I'm even more inspired to speak on behalf of farmers and amplify the work of those who are disenfranchised, systematically targeted, or aren’t getting paid fairly in the space,” says Drakeford. “It’s equally important to be advocating for farmers and using your power, privilege, knowledge, and experiences to fight for food access and land sovereignty.”Explore Bon AppétitHealthyishIt's Getting Hot in HereRead MoreLifestyleHow to Stop Making Excuses and Start Composting AlreadyBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-15", "author": ["Condé Nast", "Aliza Abarbanel"]}