{"id": "43352f6d2fb6ef870a2876132eba9428", "url": "https://www.bonappetit.com/recipe/sour-cream-coffee-cake", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Sour Cream Coffee Cake from The Silver Palate Cookbook Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSour Cream Coffee CakeBy Sheila Lukins and Julee RossoFebruary 1, 20194.2(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from The Silver Palate Cookbook, our February 2019 pick for BA’s Cookbook Club. It’s an elegant, moist cake ideal for serving at a large brunch party (it’s worth timing to have it ready 30 minutes out of the oven) or with your morning coffee. If you don’t have pecans handy, walnuts make a great substitute.Excerpted from The Silver Palate Cookbook by Sheila Lukins & Julee Rosso (Workman Publishing). Copyright © 1979.Ingredients10 servings1cup (2 sticks) unsalted butter, room temperature, plus more for pan2cups all-purpose flour, plus more for pan1Tbsp. baking powder¼tsp. kosher salt1½cups shelled pecans, coarsely chopped1Tbsp. ground cinnamon2½cups sugar, divided2large eggs, beaten to blend2cups sour cream1Tbsp. vanilla extractSpecial EquipmentA 10\" Bundt panPreparationStep 1Place a rack in middle of oven; preheat to 350°. Butter and flour Bundt pan. Sift baking powder, salt, and 2 cups flour into a medium bowl.Step 2Mix pecans, cinnamon, and ½ cup sugar in another medium bowl.Step 3Using an electric mixer on medium-high speed, beat remaining 2 cups sugar and 1 cup butter in a large bowl until incorporated and smooth. Add eggs, beating well to combine and scraping down bowl, then beat in sour cream and vanilla.Step 4Reduce mixer speed to low and beat flour mixture into butter mixture, increasing speed to medium-low if needed, until just blended. Do not overbeat.Step 5Scrape half of batter into prepared pan. Sprinkle evenly with half of pecan mixture. Spread remaining batter over; smooth top, then sprinkle with remaining pecan mixture.Step 6Bake cake until a tester inserted into the center comes out clean, 50–55 minutes. Let cool 20–30 minutes. Invert onto a platter and serve warm.Photo by Chelsea Kyle, Food Styling by Anna StockwellStep 7Note: This cake was not tested by the Bon Appétit Test Kitchen.How would you rate Sour Cream Coffee Cake?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThis is delicious, and should absolutely be with one cup of sour cream. I would maintain the leavening in the recipe. My Silver Palate cookbooks says 2 cups of sour cream, but my mom's version calls for one cup of sour cream. Two is too many!JessWashington, DC11/21/2021I agree with the other reviews that 1 cup of sour cream is plenty. I believe the amount of baking powder is also a typo. 1 to 1 1/4 teaspoons would have been plenty. My cake fell in the middle just before I removed from the oven, which could have been caused by over-leavening.AnonymousPhilly10/11/2021It would be nice if one of the editors responded to the query about one cup or two of sour cream. I also have the cookbook, and its recipe asks for two cups of sour cream. However, since so many people had a disappointing outcome with two cups, maybe the cookbook itself has a typo?ConstanceHastings, NE 689018/18/2021This is the best bundt cake ever!! Its soo delicious and looks beautiful! I made it for my family and they loved it so much :) It's super easy to make and you can really tell by the taste that its a professional recipe. \nI put all the filling in the middle and used 1 cup of sour cream (I read the reviews and they said 2 cups is a typo).AngelaOntario, Canada12/22/2020I 've made this recipe for years, have the cookbook, and yes, it is only ONE cup of sour cream, same ingredients, this must be a typo\nAnonymousLynchburg, VA12/18/2020The cake did not cook well.  It tested done at 55 minutes, but sunk as it was cooling.  Then when it was cut, it was gooey inside.    So disappointed!   We I cooked it in the microwave for 5 minutes and it broke apart.  I finally dumped it into my large glass Corningware square baking dish and baked it for another 20 minutes.  Now it is cooked, but looks like a crumb cake. I have searched for the original recipe and I do believe it should have only 1 cup of sour cream.  GrandmereBHowel, MI5/15/2020Can you please advise re 1 cup sour cream versus 2 cups.\nThe original cook book is 1 and I have   been making for years we love it.\nMy children now make it.\nSharonanne3@sympatico.ca\nSharon from Canada\n\nNiagara on the Lake, canada3/23/2020I have been making this for years  we love it \nI have the silver palette cookbook which I purchased 20 or so hrs ago \nAnd the recipe calls for one cup sour cream\nWhen I came across this printout I tried with 2 cups sour cream and did not turn out.\nCan someone please advise re this difference in recipe.\nThx sharon\nAnonymousCanada 3/23/2020I have made this recipe over and over for many years, and it is outstanding!  I do find it a bit of a temperamental recipe, as you  have to cream butter just right or it can look undone in middle.  Other times I’ve had to cook it longer than called for.  But don’t let it stop you... always delicious. \nI will add that I make it in a flat bottom bundt/angel food pan where the bottom and tube lift out.  After preparing the cake, when I put the pecan topping on the top, (before baking) I press the mixture lightly into the batter so it is on top of the batter but secured.  After baking and cooling, I cut around center tube and lift  out, then run a knife under the cake to release it.  I put A rack on top and flip it over, remove the bottom, then flip it back onto a plate so the pecan topping is on top.  Pressing it in before baking will help adhere maybe 70% of the topping, so I brush together all that sugary goodness that escaped and sprinkle on top.  Always get requests for this cake.Lisa SiegfriedSt. Peters, PA2/29/2020I baked this on Christmas morning for my family and subbed blueberries for pecans, and added about 20minutes to the bake time due to elevation and the extra moisture. It was a huge hit and tasted even better the next day as a snack. Will be making it regularly now!Montana1/9/2020Yes, the photo shows a cake baked in a bundt pan. It was absolutely baked in a bundt pan. Perhaps, some are not clear on what a bundt pan actually is? From previous experience, I put all the nut mixture in the layers (batter, nut, batter, nut, batter) it worked fabulously!AnonymousTN1/5/2020@SIXTIESBABY2889: brown sugar contains considerably more moisture than white sugar and is not a 1:1 replacement in baking. That's most likely the reason for the fialure. AnonymousToronto12/26/2019Looked beautiful when I took it out and toothpick came out clean but when you cut into it it does not look done and it's mushy. The only thing I changed was instead of regular sugar with the nuts I mixed brown sugar. Half a cup with what I used. I did not alter the mix at all so I can't see the reason why it would look under done.sixtiesbaby2889Boston, Massachusetts 11/13/2019We LOVED this cake! We have had trouble with baking in the past so we were intimidated, but it was a breeze! Just follow the recipe and you'll be just fine. Super moist and delicious--I get the feeling we'll be making this a LOT during the holidays! Only issue we ran into was the crumble on the bottom getting lost a bit during the transfer from the pan to a platter, so I think next time we might try re-ordering the layers slightly. Other than that this is a 6 out of 5 stars for us!AnonymousLos Angeles10/21/2019Warning: Food Snobs may wish to skip this review to protect their delicate sensibilities!\nIn the 1970's Duncan Hines had a re ipe for this cake on the back of one of their \"butter cake\" mixes - it was called \"Sock-it-to-Me\" cake (remember \"Laugh-in\"?) and it was DELICIOUS!! And very popular. I've always wanted the \"from scratch\" recipe and this is it - thank you, thank you, thank you!!! 😊AnonymousSan Francisco Bay Area9/22/2019Explore Bon AppétitCakeDessertPecanNutWalnutSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-01", "author": ["Condé Nast", "Sheila Lukins", "Julee Rosso"]}