{"id": "4337fb80436ff46f05b7e27a113c6a18", "url": "https://www.bonappetit.com/story/meal-prep-strategies", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "5 Meal Prep Strategies From a Guy Who Does It For a Living | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Meal Prep Strategies From a Guy Who Does It For a LivingGet your oven mitts ready because these meal prep tips are on fire.By Micah FredmanMarch 14, 2018FacebookTwitterEmailPhoto by Micah FredmanFacebookTwitterEmailThere are many ways to be a chef these days besides working at a restaurant. You can serve the every whim of hedge fund billionaires and pop queens. You can travel the world apprenticing with groundbreaking chefs and yoda-like culinary masters. I’ve tried my hand at all of these, but where I’ve truly found my calling is meal prep. I run a small food delivery business—Private Chef, Delivered. Each week, my clients get customized batches of soups, vegetables, grain salads, proteins, and more. The goal is to give people the building blocks of homey, seasonal meals that can come together in a matter of minutes. In other words, I spend most of my waking hours on meal prep.I love this kind of cooking because it’s got just the right amounts of fancy, artsy, pretty, and yoda—and it’s the best way to eat healthyish too. Here are six of my best meal prep tips for ensuring that your dinners are dynamite all week long.Make it a project, not a choreIf your circumstances allow for it, make a project out of your meal prep. Your week ahead is jam-packed, but take this day to devote to your nourishment. It deserves your time and attention. Maybe one week you want to go deep on Marcella Hazan's recipes, and the week after you're using Madhur Jaffrey as your culinary muse.. Maybe you live in New York City but want to take a virtual pilgrimage to a restaurant you’ve heard so much about, so you gather your recipes from Zahav, Chez Panisse, or The River Cafe. In this way, your meal prep becomes less of a chore and more an opportunity to access a new, less familiar place.Instagram contentThis content can also be viewed on the site it originates from.Crank up the heatMy uncle is not a chef, but, like any good chef, he is very much devoted to efficiency. As a child, I recall my mother mocking his inability to comprehend why one wouldn’t just cook everything at 500°. It would be done faster that way, right? Well, certain foods will just not do well at 500 degrees (baked goods, tougher cuts of meat, dense, large vegetables). But, when I’m low on time, 500° cooking is exactly what I do—your carrots, cauliflower, and broccoli will love it. Fair warning, this method requires keen attention, and it helps if you have a taste for deeply caramelized and well-charred flavors.Instagram contentThis content can also be viewed on the site it originates from.Cook like your grandmaOr, perhaps not like your grandmother, but like those grandmothers that we chefs romanticize as masters of hearty soups and stews, stewed lentils and dals, short ribs, and tagines. I’ve cooked with abuelas and nonnas from Oaxaca to Merida to Sicily to Piedmont. Each grandmother had a wisdom and quirkiness of her own, but, across the board, they were adept at an effortless and patient approach to cooking, teasing out deliciousness through the layering of flavor and the slow transformation of simple ingredients. The point is not to make mole every Sunday (every other Sunday is fine—it’s easier than they say). Rather, the benefit of grandma-style of cooking is that these dishes improve over time: When Wednesday or Thursday rolls around, those flavors you laid down on Sunday have melded perfectly, and dinner is at its prime.Instagram contentThis content can also be viewed on the site it originates from.Always be ready for grain bowl successAlongside grandma’s slower, stewed items, I like to make a few vegetable dishes and grains in rotation: charred cabbage and radishes with sesame, miso-seared haricots verts with wilted spinach, cardamom and honey-glazed acorn squash, pearl couscous with roasted mushrooms. That way, when your minimalist Nordic inclinations are having their moment, or your Japanese sensibility is craving clean and crisp, you’re ready. And when you’ve got to have your stir-fried, plant-based, Sriracha-drowned grain bowl, you can throw a few items together and that is well within your reach too.Instagram contentThis content can also be viewed on the site it originates from.Save herbs and citrus for lastSome components of a dish, like herbs and citrus, are best left out until the last possible moment. The brightness and freshness they add are fleeting, so if you add them to your dish on Sunday, they’ll be neither fresh nor bright come Wednesday. Grandma’s slow simmered tagine is best with a final scattering of rough-chopped parsley, cilantro, mint, and a fresh squeeze of lemon; bolognese, warmed up over that pearl couscous is taken to new heights with some torn basil; a coconut curry isn’t really a coconut curry without cilantro and lime added at the end. So grab a few herbs for the week and a handful of lemons and limes, and keep it fresh.Explore Bon AppétitHealthyishMeal PrepRead MorecookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Micah Fredman"]}