{"id": "433c846d6382de1c73b64f7726930831", "url": "https://www.bonappetit.com/recipe/vegan-pho", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Vegan Pho Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan PhoBy An UongFebruary 15, 20224.3(24)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintPho was the dish my family gathered around every Sunday, whether we were at home or at our favorite spot in Los Angeles’s Chinatown. Even as I started to cook more vegetarian food as an adult, my craving for a filling, soul-edifying pho remained, and I spent years chasing down the right combination of ingredients that would produce a vegan pho broth just as umami-packed as one with beef bones. Here I landed on a mix of dried shiitake mushrooms, kombu (dried kelp), and miso to bring a nuanced complexity to the broth. (Read more about how I developed the recipe here.)Drawing inspiration from cookbook author Andrea Nguyen’s vegan pho recipe, I use warm spices like cloves, star anise, cinnamon, and coriander to bring the flavors of this Vietnamese noodle soup together. The key is to make sure the spices are toasted adequately enough so you can smell their fragrance before adding the other ingredients. And don’t be afraid to let your onions, carrots, and celery get significantly charred at the start. Once you add water, all of that smoky goodness will melt away into your vegetable broth. While the broth soaks up flavor from the spices and mushroom-miso-kombu party, the fun part comes with prepping the toppings for your pho bowls: soy-caramelized mushrooms and fried tofu matchsticks. —An UongNote: Less sweet than refined sugar and often golden in hue, rock sugar brings a mellow, balanced sweetness to the broth, but raw sugar will work as a substitute.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonWooden Spoon$6 At AmazonMesh Sieve$13 At AmazonKitchen Towels$22 At AmazonLadle$27 At AmazonIngredients4 servingsBroth2Tbsp. vegetable oil4star anise pods2cinnamon sticks8whole cloves1tsp. coriander seeds½tsp. fennel seeds1medium onion, quartered1medium carrot, scrubbed, coarsely chopped2medium celery stalks, coarsely chopped12\" piece ginger, peeled, coarsely chopped15x3\" piece kombu½cup dried shiitake mushrooms1Tbsp. rock sugar or 2 tsp. raw sugar1Tbsp. white miso1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreNoodles and Assembly114-oz. block firm tofu3Tbsp. vegetable oil2tsp. soy sauce, divided14oz. oyster and/or shiitake mushrooms, torn or cut into bite-size pieces2heads of baby bok choy, halved lengthwiseKosher salt12oz. medium-width rice stick noodlesThinly sliced onion, thinly sliced scallions, bean sprouts, basil leaves, and lime wedges (for serving)PreparationBrothStep 1Heat 2 Tbsp. vegetable oil in a large pot over medium. Cook 4 star anise pods, 2 cinnamon sticks, 8 whole cloves, 1 tsp. coriander seeds, and ½ tsp. fennel seeds, stirring occasionally, until fragrant, about 1 minute. Increase heat to medium-high and add 1 medium onion, quartered, 1 medium carrot, scrubbed, coarsely chopped, 2 medium celery stalks, coarsely chopped, and one 2\" piece ginger, peeled, coarsely chopped. Cook, stirring occasionally, until vegetables are starting to char in places and browned bits form on bottom of pot, 8–10 minutes.Step 2Add one 5x3\" piece kombu, ½ cup dried shiitake mushrooms, 1 Tbsp. rock sugar or 2 tsp. raw sugar, 1 Tbsp. white miso, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 8 cups water to pot. Bring to a boil and cook, scraping up browned bits with a wooden spoon, until reduced just slightly, about 10 minutes. Reduce heat, cover pot, and simmer until broth is golden in color and quite fragrant, 45–60 minutes. Strain through a fine-mesh sieve into medium saucepan; cover and keep warm over low heat. Taste broth and season with more salt if needed.Noodles and assemblyStep 3While broth is simmering, wrap one 14-oz. block firm tofu in a clean kitchen towel and place on a rimmed baking sheet. Weigh down with a heavy object (a couple of heavy cans works well) and let sit 10 minutes. Unwrap tofu and cut into ¼\"-thick matchsticks.Step 4Heat 3 Tbsp. vegetable oil in a large skillet over medium. Add tofu in an even layer and cook, undisturbed, until lightly browned underneath, 6–8 minutes. Stir tofu and cook, tossing occasionally, until golden and crisp all over, about 5 minutes. Add 1 tsp. soy sauce and stir to coat. Using a slotted spoon, transfer tofu to a platter.Step 5Add 14 oz. oyster and/or shiitake mushrooms, torn or cut into bite-size pieces, to skillet and cook (still over medium heat), stirring occasionally, until softened and starting to brown, about 4 minutes. Add remaining 1 tsp. soy sauce and cook, stirring, until mushrooms are coated, about 1 minute. Transfer mushrooms to platter.Step 6Add 2 heads of baby bok choy, halved lengthwise and 3 Tbsp. water to skillet and cook over medium heat, stirring often, just until water is evaporated and bok choy is bright green, about 2 minutes (be careful not to overcook the boy choy; it will continue to cook in the bowls). Season bok choy with kosher salt and transfer to platter.Step 7Cook 12 oz. medium-width rice stick noodles in a large pot of boiling water according to package directions. Drain and run under cold water to prevent sticking.Step 8To serve, divide rice noodles among bowls. Top with tofu, mushrooms, bok choy, thinly sliced onion, and thinly sliced scallions. Ladle broth into bowls. Arrange bean sprouts, basil leaves, and lime wedges on another platter for topping as desired.How would you rate Vegan Pho?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI made this tonight, following the recipe exactly. It took me awhile but the payoff was totally worth it! I’ve been disappointed with every vegan pho recipe I’ve tried, until now. Home run!ToddAshland, Oregon3/14/2022I made this last night and followed the recipe exactly and found it to be a lot of work for something which in the end was quite bland. The spice flavours came through the strongest and to be honest I found them a bit odd, but maybe that's just me, it didn't have the depth of flavour I expected, or the umami flavour that I thought it would have and which I wanted more of. It was also, I thought, quite an expensive recipe (shiitake mushrooms, kombu), at least where I live, for very little payoff. I wouldn't make it again. AnonymousFrance3/7/2022Made this tonight as directed and it came out super good! Very little prep and a lot of passive time. The only thing I didnt do is i cooked the shitakes separate from the tofu cause my cast irons small and the bokchoy in the broth before serving. Besides lazy shortcuts, this made my Wednesday. ChrisBrooklyn NY3/3/2022Absolutely delicious! Irene2/22/2022Explore Bon AppétitDinnerVietnameseSoutheast AsianAsianMainDairy-FreeGluten-FreeNut-FreeVeganVegetarianSimmerSoupSoups and StewsRice NoodleNoodlePasta & NoodlesOyster MushroomMushroomVegetableTofuOther IngredientsShiitake MushroomKombuSeaweedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-15", "author": ["Condé Nast", "An Uong"]}