{"id": "4350d5b03b988442e4429284071f5faa", "url": "https://www.bonappetit.com/recipe/onigiri-three-ways", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Onigiri Three Ways Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOnigiri Three WaysBy Diana YenSeptember 13, 20204.5(14)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Diana YenEmailPinterestPrintEmailPinterestPrint“Compact and ready to be taken on the go, onigiri—which are sold in convenience stores all over Japan—are great packed into lunches or enjoyed as an easy anytime snack,” writes recipe developer Diana Yen. “The balls are stuffed with flavorful and often salty fillings that pair well with the sticky rice: Go classic with Kewpie mayonnaise and tuna or umeboshi (mouth-puckering pickled plums), or try pickled vegetables like kimchi—even yesterday’s chicken salad works. The fun part is forming the balls, and you don’t need to be a sushi chef to do it. The secret is to use slightly warm rice for easy molding and to keep a bowl of water nearby to dip your hands in to prevent sticking. As for soy sauce, you won’t need it. These little flavor bombs are tasty all on their own. This recipe makes 3–4 balls of each type (tuna, umeboshi, and kimchi). If you only want one flavor, simply increase your filling of choice.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Bowl$18 At AmazonMesh Sieve$13 At AmazonMedium Saucepan$39 At AmazonScissors$17.95 At AmazonSmall Bowl$13 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonIngredientsMakes 12-162cups sushi rice38½x7½\" toasted nori sheets, divided15-oz. can tuna2Tbsp. mayonnaise, preferably Kewpie1tsp. soy sauce4umeboshi⅓cup kimchi¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼cup furikake or toasted sesame seedsPreparationStep 1Place 2 cups sushi rice in a large bowl and pour in cold water to cover by 2\"–3\". Gently swish around with your hands to rinse, then drain. Repeat process until water is almost clear (about 3 more times). Pour cold water over rice to cover by 1\" and let soak 30 minutes (this will help the grains cook more evenly). Drain well in a sieve.Step 2Combine rice and 2½ cups water in a medium saucepan and bring to a boil over high heat, stirring occasionally. Reduce heat to low, cover, and simmer rice until water is absorbed, 12–14 minutes. Remove from heat and let sit (still covered) 15 minutes. This will allow rice to steam and become tender. Uncover and gently fluff rice with a fork. Let sit until cool enough to handle but still warm.Step 3Meanwhile, cut three 8½x7½\" toasted nori sheets into 3x1¼\" strips with kitchen shears; set aside.Step 4Prepare the fillings. Mix one 5-oz. can tuna, 2 Tbsp. mayonnaise, preferably Kewpie, and 1 tsp. soy sauce in a small bowl to combine. Place 4 umeboshi on a cutting board. Working one at a time, press a chef’s knife against fruit until pit is exposed; pull out and discard. Set fruit aside (no need to chop). Working over the sink and using your hands, squeeze liquid out of ⅓ cup kimchi; chop into small pieces.Photo and Food Styling by Diana YenStep 5Place 1 cup water in a small bowl and stir in ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Dip your hands in the salted water, then scoop a little less than ⅓ cup rice into 1 hand. Form into a thick disk 3\"–4\" in diameter (keep remaining rice in pot covered). Create a small indentation in the center and add 1–2 tsp. filling of choice (or a whole umeboshi). Mold rice up and over filling to create a sphere (filling should not be visible), then press firmly with index finger and thumb to form into a triangle. Place on cutting board or a baking sheet. Repeat with remaining rice and filling, dipping your hands in salt water each time. (You’ll have extra tuna—save it for making a tuna salad sandwich or spooning onto crackers.)Step 6Place ¼ cup furikake or toasted sesame seeds on a small plate. Wrap bottom of each onigiri with a strip of reserved nori, then roll remaining exposed sides in furikake.Photo and Food Styling by Diana YenStep 7Do ahead: Onigiri can be made 2 days ahead. Tightly wrap and chill.Photo and Food Styling by Diana YenHow would you rate Onigiri Three Ways?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI am doing kimchi omlette for this recipe tksAnonymousToronto Canada7/7/2021I did mine with crab meat instead of tuna and they turned out lovely Gretchen 1/13/2021Explore Bon AppétitJapaneseEast AsianAsianRiceRice & GrainsTunaFishSeafoodNoriSeaweedOther IngredientsMainSnackDairy-FreeLunchBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-13", "author": ["Condé Nast", "Diana Yen"]}