{"id": "435f35b194109199e1bcff83089846a1", "url": "https://www.bonappetit.com/story/two-types-of-charcoal", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The Two Types of Charcoal and When to Use Each Type  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Pick the Right Charcoal for Your Summer GrillingThere are two types of charcoal (yes, two!) and two totally different uses.By Alex DelanyJune 21, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailHold up: There are different kinds of charcoal? Yup. You’re damn right there are. Like sandwiches, insurance plans, and automobiles, charcoal is no one-size-fits-all beast.You’ll find two main types of charcoal out there in the world, and they lend themselves more appropriately to different grilling situations. So before you give it a light, you need to know what you'll be cooking. Here are the two main types of charcoal and what you should be using them for:We've got briquettes on the left and hardwood lump on the right.\nPhoto by Chelsie CraigCharcoal briquettes are probably what you picture when you think about charcoal. Typically the cheaper option, they're uniform nuggets of dense, packed sawdust, and they offer an even, predictable, long-burning heat that’s great for grilling larger pieces of meat that take a long amount of time to cook through.Because briquettes aren’t 100 percent wood (they’re packed with binders to hold their shape), they're technically the less natural option, but if you’re planning on grilling all afternoon, consider these nuggets your economical, dependable, workhorse.Hardwood lump charcoal is your other option—and it's all about flavor. Made from irregularly-shaped pieces of real hardwood (no filler or binding agents—just trees!), it burns hotter, less evenly, and more quickly than briquettes. Hardwood lump imparts flavor on the food you’re grilling because it’s an ingredient in itself: Depending on what kind of hardwood lump you're using, be it mesquite, applewood, or pecan, your food will taste taste (and smell) different.We use hardwood lump for quick, hot-and-fast grilling (say you're grilling bread or sliced squash or hot dogs and burgers), but here's a pro tip:  You can also throw a handful on top of already-burning briquettes to create a plume of aromatic wood smoke so that you can have some of the benefits of both types of charcoal.To summarize, here's our rule of thumb: If you’re grilling something that’s quick-cooking, like thin-cut pork chops or smaller vegetables like string beans, asparagus, or snap peas, you want the high-heat fire of hardwood. If you’re going low and slow on a whole chicken or a large steak, briquettes are your best friend. Either way, dinner’s better when you know you’re using the right charcoal.Want to grill some skewers? Use that lump!These Chicken Skewers Are My Best Friend (Kind Of)There's no messing up with these spicy, sambal-laced grilled chicken skewers. They've always been there for me, and they'll always be there for you.View StoryExplore Bon AppétitBasicallyGrillCharcoalRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-20", "author": ["Condé Nast", "Alex Delany"]}