{"id": "43637cb1bff06d36b4bbada14e3b541a", "url": "https://www.bonappetit.com/recipe/spicy-tomato-shellfish-stew", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Spicy Tomato Shellfish Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSpicy Tomato Shellfish StewBy Claire SaffitzFebruary 13, 20184.4(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFor this stew recipe, if you have one, use a large, wide pot with a tight-fitting lid so you have plenty of room to let the shellfish open in the tomato sauce.Ingredients4 servings1fennel bulb1head of garlic, cloves separated, peeled1medium onion, thinly sliced4oil-packed anchovy fillets228-oz. cans whole peeled tomatoes, juices drained and reserved⅓cup dry white wine1½tsp. fennel seeds1½tsp. crushed red pepper flakes, plus more for serving⅓cup extra-virgin olive oil, plus more for drizzlingKosher salt½cup mayonnaise1Tbsp. fresh lemon juice1cup no-salt-added clam juice1lb. littleneck clams, scrubbed1½lb. mussels, scrubbed, debearded8large sea scallops, side muscle removed, or jumbo shrimp, peeled, deveinedLemon wedges (for serving)4slices country-style bread, toastedPreparationStep 1Preheat oven to 350°. Remove fronds from fennel bulbs and thinly slice; set aside. Thinly slice fennel bulb; set aside. Thinly slice all but 1 garlic clove. Combine sliced garlic, fennel bulb, onion, anchovies, drained tomatoes, wine, fennel seeds, 1½ tsp. red pepper flakes, and ⅓ cup oil in a large Dutch oven or other heavy pot. Season with a generous pinch of salt and cover pot, leaving lid slightly askew. Bake until tomatoes are dark red and jammy, 1¼–1½ hours.Step 2While tomato sauce is cooking away in the oven, mix mayonnaise and lemon juice in a small bowl. Finely grate remaining garlic clove into mayonnaise, season with salt and pepper, and mix together. Cover and set aside.Step 3Remove pot from oven and crush tomatoes against the side of the pot with a wooden spoon to break them up. Stir in clam juice and reserved tomato juices; season with salt. Place pot over medium heat and bring to a simmer. Add clams, pushing into the liquid so they are all submerged. Cover pot and cook just until clams start to open, about 5 minutes. Add mussels, cover, and cook just until mussels start to open, about 5 minutes. Remove lid and use spoon to push shellfish into center of pot. Arrange scallops around perimeter, nestling into liquid so they’re just barely submerged. Cover pot again and simmer just until scallops are cooked through, about 4 minutes.Step 4Ladle stew into bowls; discarding any clams or mussels that are not open. Drizzle with more oil and sprinkle with more red pepper flakes. Scatter reserved fennel fronds over top and tuck a lemon wedge into each bowl. Slather seasoned mayonnaise over toast and serve alongside.Step 5Do Ahead: Tomatoes can be roasted 1 day ahead. Add clam and tomato juices and let cool. Cover and chill. Bring to a simmer over low heat before making the stew.How would you rate Spicy Tomato Shellfish Stew?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis was a fantastic recipe!!  I followed exactly and added some small sea scallops that I had on hand.  The flavors were perfectly balanced and the stew made a great accompaniment to a nice crusty loaf of french bread.  Definitely a winner and will find a place in my regular meal rotation.  Andy RummelDanvers, IL4/17/2021really good recipe! easy to make and leave in the oven. has to be served with bread and side salad or else it is not filling. added scallops and shrimp and it was great! the anchovy paste and clam juice add so much flavor!Kiersten Wasserman2/15/2021Explore Bon AppétitStewSoups and StewsClamShellfishSeafoodMusselScallopCanned TomatoTomatoVegetableFennelOne-Pot MealsMainNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}