{"id": "43641834255cbcc2c05b21092ea82f2c", "url": "https://www.bonappetit.com/recipe/applejack-sour", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Applejack Sour Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueApplejack SourBy Al CullitonOctober 15, 20194.6(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Yekaterina Boystova, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintLaird’s Applejack is an inimitable apple brandy we like to reach for once fall rolls around. Here we use it to make some sours for an all-time best Thanksgiving pregame. They’ve got the apple, citrus, maple, and baking spice notes of the season with enough refreshment and punch to chill any remarks from combative relatives.IngredientsMakes 12oz. applejack (preferably Laird’s)¾oz. fresh lemon juice½oz. fresh orange juice½oz. pure maple syrup2dashes of Angostura bittersFreshly grated nutmegPreparationStep 1Combine applejack, lemon juice, orange juice, maple syrup, and bitters in a cocktail shaker. Add ice and shake until the outside of the shaker is frosty, about 20 seconds.Step 2Strain cocktail into an ice-filled rocks glass and sprinkle with nutmeg.How would you rate Applejack Sour?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleI just got into mixing drinks and this was my first time using a shaker. Such an easy drink to make and so good!JosephineGeorgia11/26/2021Great fall cocktail--I left out the maple syrup as I prefer my cocktails not so sweet :)queeneekansas city11/5/2021I brought this drink to a Thanksgiving dinner in 2019 (pre-COVID times) and my wife told me that we would be the only ones drinking it.  She was wrong.  The bottle was drained in less than an hour.  One of my favorites.AnonymousArlington, VA2/27/2021Really great drink! Tart and well balanced with a nice punch, it's perfect for the fall season. My fiance and I enjoyed this during our Quarantine Thanksgiving for 2 this year!Darlisa A.Los Angeles, CA11/27/2020Yum. Now I just need a coupe glass to enjoy it even more. Mary G.Colorado 11/26/2020I made this last year after seeing it in the fall issue. It is Fall in a glass. Sweet, tart and rich. This is now a go-to fall cocktail in my house after serving it to family last Thanksgiving.MyndiKansas City10/17/2020I love the thought of \"test driving\" a recipe.  \nLooking forward to whipping this one up!  Indianapolis 10/4/2020This is a winner! Absolutely delicious . I agree with another reviewer that it is good to strain the citrus juice. I have also made this with bourbon when we ran out of applejack (!!) and it’s just as good. This is now part of our cocktail repertoire!AnonymousDanville, CA1/26/2020Dammmmmmn this is delicious! Strain your citrus for a cleaner sip. bigbadbrookieSalt Lake City11/28/2019I really enjoyed this. Very nice combination of a little sweet and a little tart. AnonymousAustin, Texas11/6/2019Hey, can you give advice on mixing a batch/pitcher of these? Because nothing says \"make ahead\" more than Thanksgiving. I'd love to just have these ready as guests arrive. EdstrohMissouri10/24/2019I meant \"t\", not \"T\".egardenutWashington DC10/20/2019I meant \"t\", not \"T\".egardenutWashington DC10/20/2019I \"test drove\" this recipe today today to preview it for Thanksgiving. It's a GO! Tried one with nutmeg and one with pumpkin pie spice and both were great. For one I used the 2 T of maple syrup, and for the other I used 1T maple syrup and 1 T apple cider, and they were both winners. Served on the rocks for \"sippers.\"\nI think my guests are going to LOVE them!egardenutWashington DC10/20/2019Explore Bon AppétitCocktailDrinks AllAmericanFallQuickDrinksThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Al Culliton"]}