{"id": "436da37d59e56954a86fbaddbd82db65", "url": "https://www.bonappetit.com/recipe/sweet-potato-tea-cake", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Sweet Potato Tea Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueSweet Potato Tea CakeBy Elizabeth Prueitt and Chad RobertsonDecember 18, 20194.5(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThis recipe is one of the many standouts from Elizabeth Prueitt and Chad Robertson’s Tartine: A Classic Revisited. Instead of icing, this spiced loaf is blanketed in a fluffy vanilla meringue, which bakes up crisp on the outside and chewy on the inside. Puréed, boiled sweet potatoes give the cake its earthy sweetness and rich orange color, but we also tested the recipe with canned pumpkin purée, which can be used in a pinch. Be sure to let the cake fully cool so you get a beautiful, clean slice.Excerpted from Tartine: A Classic Revisited: 68 All-New Recipes + 55 Updated Favorites © 2019 by Elizabeth Prueitt. Reproduced by permission of Chronicle Books.IngredientsMakes one 9x5\" loafUnsalted butter (for pan)1⅓cups plus 1 Tbsp. (185 g) all-purpose flour2tsp. ground cinnamon1½tsp. baking powder1tsp. ground nutmeg½tsp. baking soda¼tsp. ground cloves1cup (255 g) boiled and puréed sweet potatoes (from about 2 medium potatoes)¾cup (180ml) neutral oil1tsp. kosher salt2cups (400 g) sugar, divided3large eggs3large egg whites1tsp. vanilla extractPreparationStep 1Place rack in lower third of oven; preheat to 325°. Lightly butter sides and bottom of a 9x5\" loaf pan. Line pan lengthwise with parchment paper, leaving about a 2\" overhang.Step 2Whisk flour, cinnamon, baking powder, nutmeg, baking soda, and cloves in a medium bowl to combine.Step 3Using an electric mixer on medium-high speed or a stand mixer fitted with the whisk attachment, beat sweet potato purée, oil, salt, and 1⅓ cups (266 g) sugar in a large bowl until well combined. Add eggs one at a time, beating well after each addition before adding the next. Scrape down sides of bowl with a rubber spatula. Add dry ingredients and beat until incorporated. Scrape down sides of bowl, then reduce speed to medium and continue to beat until smooth, 5–10 seconds (batter should be the consistency of a thick purée). Transfer batter to prepared pan; smooth surface with an offset spatula.Step 4Pour water to a depth of about 2\" into a medium saucepan, heat over medium, and bring water to a simmer. Whisk egg whites and remaining ⅔ cup (134 g) sugar in a medium bowl (or use the stand mixer bowl) set over simmering water (do not let bowl touch water). Continue to whisk until whites are hot to the touch (an instant-read thermometer should register 120°), about 5 minutes.Step 5Carefully remove bowl from pan and immediately beat on high speed (or return bowl to stand mixer and beat with the whisk attachment) until mixture is very thick and holds stiff peaks when you lift out the beaters, 5–7 minutes. Add vanilla and beat to combine.Step 6Spoon meringue over batter. Drag a knife through meringue and batter to create a marbled pattern. Don’t thin out the meringue too much, though; it bakes best when left in thicker patches.Step 7Bake cake until a paring knife inserted into the center comes out clean, 90–100 minutes. Let cake cool in pan on a wire rack 20 minutes. Run a sharp knife around short sides of pan, lift out cake using parchment overhang, and let cool completely. Serve cake at room temperature.Step 8Do Ahead: Cake can be made 4 days ahead. Tightly wrap and store at room temperature, or chill up to 1 week.How would you rate Sweet Potato Tea Cake?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleIf you accidentally added all 3 eggs and 3 egg whites to the batter when you saw \"add eggs one at a time\"... this comment is for you! I added some extra flour and baking powder, poured it all into the baking dish, and it turned out just fine. Tasty recipe!LizzyNew York City1/30/2022I’m giving it a 5 because I did make modifications (I made the cake for someone who needed a sugar alternative, like monk fruit or stevia) so I had to use less sugar because those sugar alternatives tend to taste a lot sweeter than cane sugar (reduce monk fruit sugar at most by 25%) but everything else was the same and came out pretty well considering. I will say my meringue split and it needed all together an extra 25 to 30 minutes to bake so I took out the cake smushed the split meringue halves together because it was tacky on the inside and it was like the split never happened. I might try roasting the sweet potatoes and adding cardamom. Brown butter for the sweet potato purée? Maybe next time. HannahSouth Carolina1/14/2022I made this recipe exactly as written (by weighing ingredients) and baked for 95 minutes. It is the most amazing snacking cake/breakfast cake! So good! The meringue on top is genuis, although did take slightly longer than the recipe called for to get to stiff peaks... Will be making this agian and again and again. Such a great fall treat! MaryWinWilliWashington, DC11/23/2021The cake itself is so very delicious. I didn't have a stand or hand mixer, so I (along with the help of a friend I recruited when my arm was about to fall off) hand-whipped the meringue. Would highly recommend not to do that and maybe skip the meringue if you're without an electric mixer (meringue was goopy with egg whites in some places). Could replace with a sugar crust instead.HMSPhiladelphia, PA3/29/2021This dessert looks gorgeous and tastes divine! Made it following the exact recipe by weight. Took 100 minutes to bake. And make the full meringue recipe. It is not too much. Just pile that lusciousness on top. One change for next time, will tent the meringue in foil as soon as its no longer sticky, around 50 minutesShe’s Stunning!Nashville, TN1/23/2021Made it exactly like the recipe said and it was absolutely gorgeous and perfect at the first try. Good crumb, the marshmallow is so beautiful and I actually understood and trusted what I was doing while making it. This looks like one of these recipes that will never be looking as beautiful as the picture - but it is totally possible. CarlyAmsterdam1/14/2021I've made it twice, both times with amazing results. For the cake, I cut sugar to 1 cup and used about 4 tsp. of sugar to dust an even layer to create a sugar crust. Baking at 375 for 70-75 minutes was perfect for this method. Not too sweet and the warm spices make this an ideal fall/winter bake. The cake has a nice texture and crumb, and when combined with the crackly sugar crust is great!AnonymousAlexandria, VA12/19/2020This also works without the meringue (sorry ewww), in an 8x5 loaf pan, for about 65 min substituting 1/2 cup unsweetened applesauce for part of the oil. That version is delightful. A little “bouncy” texture from the applesauce but tastes great. Great spice mixture and amount. Bring on that cinnamon!AnonymousPhiladelphia 12/10/2020Waaaaay too much meringue! I made this recipe as written and after I made the meringue and started spooning it on my cake batter I realized there was like triple the amount that someone would need for this tea cake! I wasn't really sure what to do at that point because the recipe says to spoon it all on! I put about half of it on the batter and tried to swirl it around but there was just too much of it, I could tell it just wasn't really going to work out, but I baked it anyway. It took about 130 mins before it was done finally and the meringue was much darker than pictured and very crumbly at this point. The cake part tasted pretty good and moist, but the meringue was over done. Would maybe try it again and use less of the meringue.CiennaGratns Pass, OR11/16/2020I also won't rate because I took quite a few liberties but I think it turned out awesome! I substituted whole wheat for 1/4 of the flour, used 2/3 cup of vegetable oil and olive oil to complete the 3/4 cup, used only 3/4 the amount of sugar, added an additional 1/2 tsp of salt, and added 1/4 tsp of cardamom for extra spice. I didn't do meringue, but instead covered the top in pumpkin seeds, demerara sugar and flakey salt. 90 min was just right. Perfectly sweet, delicate crumb, a little savory. Would totally recommend!AnonymousAtlanta, GA9/30/2020Had a fun experience with this cake: since I substituted the sweet potato with purple yam, the batter turned a funky grey color after adding the eggs, so I added red and blue gel coloring to make purple again. But after baking, the inside of the loaf turned out to be a *gnarly* dark green... No idea what I did wrong, but it was moist & delicious and just the right amount of sweetness with 100g of sugar in the batter. So while it didn't end up on my Instagram, I'm not complaining ;)AnonymousChandler, AZ6/4/2020Pretty tasty. I modified the recipe by not adding nutmeg or clove (didn't have any on hand). Also reduced the amount of sugar in the cake itself (but still kept the same measurements for the meringue). My cake was done around 80 mins into baking and my meringue was huge! The cake itself dense but really moist. The meringue is a nice addition - marshmellow-y and sweet. If I think if I were to include the nutmeg and clove, it would bring a really nice warmth to it. AnonymousSan Diego, CA5/19/2020I won’t rate the recipe because I didn’t use the nutmeg or cloves and used just a cup of sugar, per reviewer recommendations. But this cake was SO good. The texture was amazingly moist, tender, dense-ish. Not too oily, not too sweet, just right. The merengue looks really beautiful on top. I’d recommend piling on all the merengue, even though it may seem like too much. The topping shrinks a lot in the oven. Overall, very delicious. AnonymousPhiladelphia5/9/2020This was delicious! I used butternut squash instead of sweet potato, reduced sugar and oil to 1/2 c and 1/3 c, added 1/3 c applesauce. I used half oat flour and half gluten free ap. I skipped the meringue but swirled in some maple tahini. Beautiful texture, great spice profile, and a nice tall loaf.   cherylkozoriz3154Toronto5/9/2020Amazing! That meringue top is delicious and makes this really special. I did use less sugar in the sweet potato batter, but kept the meringue proportions the same, as I didn't want to mess with the chemistry there. I will say though that I had plenty of meringue to spare after completely filling the rest of my loaf pan with it, so I ate some straight from the bowl like it was marshmallow fluff. Next time I make this, I think I'll scoop the excess into a ziplock bag and pipe little meringue cookies out of it!AnonymousBrooklyn, NY5/1/2020Explore Bon AppétitLoaf CakeCakeDessertSweet PotatoPotatoVegetableSnackNut-FreeHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-18", "author": ["Condé Nast", "Elizabeth Prueitt", "Chad Robertson"]}