{"id": "437e5230b7931b892c28ba1656260895", "url": "https://www.bonappetit.com/story/breakup-condiments", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "I Don’t Miss My Ex, But I Do Miss My Condiments | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Don’t Miss My Ex, But I Do Miss My CondimentsI thought I didn’t need these things, the semi-perishable, the replaceable. I was wrong.By Mari UyeharaMarch 8, 2018FacebookTwitterEmailPhoto by Alaina SullivanFacebookTwitterEmailIt was around this time last year during one of the season’s worst snowstorms that my then boyfriend and I broke up. While snow piled up on the sidewalks outside, we fought at the dining room table in a room filled with his orange Le Creusets, my father’s turquoise ceramics, and the knives we bought together in Kyoto. The snow was so bad all transportation out of the city was canceled, and I had to wait until the next morning to escape to my parents’ house in Massachusetts, creeping out while it was still dark. Now, don’t worry, this isn’t an achingly painful Modern Love story, tracing the contours of a complicated relationship tenuously held together. I don’t miss my ex. But I do miss what I left behind, my condiments. This is a story of love, loss, and hot sauce.In New York City there are 8.538 million people, so many that the subway is now breaking down under the sheer numbers it was never built to carry. There are so many busy people, yet most are so lonely. I’ve found out about deaths and major breakups weeks later over a group dinner or catch-up lunch. Most people don’t want to burden anyone else with their personal millstones. Not me, though. I have too much kitchenware. The idea of going back alone to the Brooklyn apartment of broken dreams to bubble-wrap Champagne flutes for eight hours made me want to blow my brains out. So I cajoled five friends into helping me move out.On the appointed day at the appointed time, Farideh, Scott, Mike, Paul, and Krista showed up. I cranked up some early-’90s R&B. We packed up my food processor and stand mixer, cast-iron pans, and salt-glazed teapot with matching cups. Each whiskey glass and every last Champagne flute was dropped into a bubble-wrap pouch and slipped into a slot of a specially made box. “What happened?” they asked. I shrugged my shoulders. “It didn’t work out.” Someone lit a joint, and we burned a sage smudge stick. I’d read on the internet that you were supposed to waft it into corners to cleanse the place, so I did that in the hopes that the next occupants would have better luck.My shoes, bags, and dresses were stuffed into more boxes. But when Paul started packing loose bags of cornmeal and dried chickpeas, I stopped him. I didn’t need these things, the semi-perishable, the replaceable. Enough was enough. We should start loading the U-Haul.In the weeks thereafter I did everything I could to smooth out the breakup. Moving on from a relationship, I had decided, required a rewiring of the brain. I didn’t drink that much. I wrote get-that-shit-out-of-your-system letters. And like a good Brooklynite, I religiously attended yoga every day. I wrote in my parents’ office, while one of our malamutes, Nixi, 75 pounds of wolfish fur, curled by my feet and followed me downstairs when I went to make tea. But one thing started to bother me. I remembered all the condiments I left behind.I had left a good balsamic vinegar in that cupboard I stopped Paul from unloading. It was not one of the thin, sharp balsamics, but one of those that pours slowly, one that is aged and syrupy thick. Traditional balsamic vinegars are made with tons of late-harvest white grapes and aged in wood casks for up to 30 years, losing volume but gaining flavor. That cumulative, concentrated work of farmer, fermenter, and time most likely ended up in a Brooklyn garbage truck and then shipped to a landfill far away.I had also left behind Mizkan jun genmai su, pure brown-rice vinegar I’d picked up in one of New York’s better-stocked Japanese stores, which cookbook author Elizabeth Andoh calls “the extra-virgin olive oil” of Japanese rice vinegars. It sounds ridiculous, mooning over a $6 vinegar, but it’s true. Those yellowish rice vinegars found more easily in the “ethnic” section of the supermarket just don’t hold a candle.And my hon mirin, true mirin, which is hard to find in the U.S. The vast majority of “mirin” bought and sold here have an ingredient list that begins with glucose syrup and ends with corn syrup and salt. I had a tall glass bottle of Takara, made with real sake, that I had to get at an actual sake store. Neither were available in the local Asian grocery store, Tran’s, in western Massachusetts.I want my South River Sweet White Miso back. Unlike the uniformly smooth misos sold in the U.S., its texture is more rough-hewn, its tangy flavors sour and bright. It sells out so often that I acquired a mini stockpile of the stuff, picking it up any time I saw a jar. The owner of South River Miso told me they reached capacity in what they can make, which is hand-mixed with koji and foot-stomped (in hygienic booties!) before it is set to age in giant cedar barrels in a beautiful Japanese-style farmhouse. It is not a scalable operation. Those squandered jars were ones some other miso lover could have bought and used.That famous Sqirl jam, straight from the source.\nSometimes on weekends I would make Nancy Silverton’s extra-flaky biscuits, which require grating five sticks of frozen butter, possibly my least favorite kitchen task, and rolling and folding dough many times. The ends of two jars of Sqirl jam made in small batches with exquisite hard-to-find fruits—Elephant Heart Plum and Santa Rosa Plum & Flowering Thyme—would have been nice on another batch of butter-laden biscuits. But those too went to the landfill.I used to have a serious arsenal of hot sauces, with all the regulars, but my favorite is the now sold-out Hot Ones pineapple-chipotle sauce, the supplementary condiment to my friend Chris’s YouTube show, First We Feast’s Hot Ones. Many years ago, before the show took off, when we were coworkers in a different office, we tasted 70 hot sauces together with our other friend Jordana, drinking milk in between to cool our singed taste buds. I like to think that this was a formative experience for the making of his very own bottle. For its release, I gathered with other former coworkers in the Williamsburg hot sauce store, Heatonist, on a warm summer night. We all bought a jar as a show of support; it turned out to be a really, really good sauce. The pineapple-chipotle sauce had a serious capsaicin spike balanced with rounded fruity flavors; its thickness would have been well-suited to biscuits and runny eggs.Yes, I sorted through the wreckage of that relationship, tossing everything that needed to go with a Kondo-like militancy to free up some space for new possibilities. In life, as in refrigerators, it’s best to operate under the policy that there’s no room for expired goods. But if I had to do it all over again, I would have sorted through my cupboard too, keeping everything worth holding on to. You see, that hot sauce was irreplaceable.1 / 24ChevronChevronDurkee Famous SauceThis tangy mayo/mustard hybrid with a healthy kick of vinegar was created by Eugene R. Durkee in 1857, making it America's first packaged condiment. Eric Finkelstein from Court Street Grocers says that \"people from all over the country have a connection to this product, and for whatever reason all think it's from their hometown.\" It originated in Buffalo, NY, but now it's produced in Iowa.\nBuy it: $8 on AmazonExplore Bon AppétitValentines DayCondiment/SpreadRead MorecultureIn Defense of Cooking Like a Complete and Total ManiacBy Mari UyeharacultureThese 10 Great Online Specialty Food Stores Have EverythingBy Mari UyeharaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Mari Uyehara"]}