{"id": "437e62c961789804e132c349d1272530", "url": "https://www.bonappetit.com/story/gateway-to-ancient-grains", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "How a Surprise Wedding Cake Became My Gateway to Ancient Grains | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Surprise Wedding Cake Became My Gateway to Ancient GrainsPlus: 7 new ways to bake with them.By Sonia ChopraJanuary 14, 2021FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.I worked in a bakery when I was younger, and I loved it. I loved dipping and swishing melted chocolate ganache on fresh vanilla cupcakes, piping icing flowers and twisting fondant into bows, leveling cake tiers, and perfecting my method of pouring royal icing smoothly over cookies and petit fours. I even loved my sheet pan burns and the weird sugar smell that stayed in my hair all day. But most of all I loved sketching out cake designs with customers, helping them pick flavors and fillings, and talking them through buttercream decorations.I went back to that same bakery for my own wedding, this time sitting on the other side of the cake tasting, sampling buttercreams and lemon curds and pulling up my Pinterest board to talk about colors and cake toppers. It was the only part of wedding planning that I had really pictured before we decided to get married—and yes, it was so fun. But then our wedding plans changed and we eloped in July at a farm, ordering a small cake at the last minute from the farm’s bakery. Because of the timing and the pandemic and how hyperseasonal the meals are, we didn’t know anything about the cake in advance. It was a real exercise in letting go. In the end it was a true beauty, but the coolest thing was that the flour in the cake was made with einkorn grown right there at the farm.Want this letter before it hits the website? Sign up for our newsletter!Einkorn flour! I had tried the ultra-ancient grain in bread but never as a cake, but after the wedding I was totally sold. Which is why I am so excited about the feature in our February issue (out now on newsstands; subscribe here to receive it), which includes recipes using einkorn plus six more ancient grains from the incredible Roxana Jullapat’s new cookbook Mother Grains (out in April; preorder here). Roxana talks us through how to use whole grains to bake standout treats like the macadamia brown butter blondies that look so good I screenshot a photo from our art review (sorry, design team!) just to keep staring at it.You can find the rest of her recipes from the issue below. And if you’ve baked with ancient or other whole grains, I’d love to hear about your favorite recipes (or see a picture of your favorite celebration cake!). As always, I’m at sonia@bonappetit.com.Get the Recipes:1 / 7ChevronChevronRicotta Cornmeal Pound CakeView RecipeExplore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-14", "author": ["Condé Nast", "Sonia Chopra"]}