{"id": "4389b78137be2cf2f25dc684abef1aa8", "url": "https://www.bonappetit.com/story/bts-smokehouse-sturbridge-massachusetts", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Every New England Road Trip Requires a BBQ Plate From B.T.'s Smokehouse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEvery New England Road Trip Requires a BBQ Plate From B.T.’s SmokehouseYou’re here for the brisket.By Amanda ShapiroJuly 19, 2019FacebookTwitterEmailPhoto by Pat PiaseckiFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Pretty much everyone raised in New England took field trips to Sturbridge, Massachusetts, to tour its simulacrum of an 18th-century village. These days, I take field trips to Sturbridge to eat at B.T.'s Smokehouse, an unassuming roadside restaurant serving some of the best barbecue I've ever eaten, despite being in a region that’s, well, not known for barbecue.Situated between I-84 and I-90, B.T.’s is an ideal pit stop for any drive that takes you up to (or down from) Boston, New Hampshire, or Maine. Brisket is the thing here—smoked for 24 to 30 hours on local apple and hickory wood. You can order it à la carte, in a Reuben-style sandwich, or—my favorite—on a platter with classic sides like collard greens and mac and cheese.While it may be unassuming, B.T.’s is hardly undiscovered. The lines get long, so time your trip to hit the smokehouse when it opens at 11 a.m. or during the late-afternoon lull. Order your meat to go, grab a beer at the convenience store next door, and park yourself on the hood of your car, the curb, or anywhere you can find a spot. It isn’t glamorous, but it is astonishingly good.Go there: B.T.’s SmokehouseExplore Bon AppétitHighly RecommendRestaurantsBarbecueNew EnglandRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-19", "author": ["Condé Nast", "Amanda Shapiro"]}