{"id": "43964d1f2392e952d3a370b74068895e", "url": "https://www.bonappetit.com/story/kielbasa-fried-rice", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Kielbasa Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Plans Can Wait—Tonight Is For Kielbasa Fried RiceBest eaten alone. On the couch.By Alex DelanyOctober 7, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailTwo weeks ago I realized I hadn’t cooked dinner at home in ten days. For someone that works at a recipe-focused food brand, that’s kind of inexcusable. So I canceled plans that evening, left work at an appropriate time, and stopped at the grocery store on the way home. I made kielbasa fried rice and listened to a couple records as I did it. I sat down with a plate of simple, cheap, incredibly satisfying dinner and proceeded to watch Ocean’s 12 and Ocean’s 13 on Netflix. Yes, I watched them both. In one sitting. Yes, I started with 12. And yes, THEY HOLD UP. Clooney, Pitt, Damon, Cheadle, Roberts, Garcia, Zeta-Jones, Cassel, Gould, Pacino, all on the same screen, spitting hilarious, non-stop banter? Are you kidding me? Why hadn’t I watched those movies in forever? They're fun!Needless to say, I had a fantastic evening alone, sitting on my couch, eating fried rice as the largest stars of the mid-2000s pulled off flashy, elaborate heists. It was a recharge night—and it was the best night I had all month. That’s Rent Week right there: understated yet supremely enjoyable, just like the kielbasa fried rice I chose for this month’s recipe. So cancel your weeknight plans, throw on this Stuff I’ve Been Listening To playlist I made for you (completely free of charge), and get ready to eat some fried rice in your comfiest pair of gym shorts.We’ll start with our rice. If you’ve read about fried rice on Basically before, you remember that we like to use day-old rice. If you’re going for crispy fried rice, this is key, since there’s less moisture in the rice, meaning that it will dry out quickly. But we’re not going for crispy rice. We want the fluffy stuff—there’s already enough texture going on with the kielbasa. So first up, steam 1 cup of rice.Kielbasa fried rice? You love to see it.\nWhile your rice is steaming, prep your other ingredients:Take 1 link of Polish style kielbasa (We’re talking about 14–16 oz. of sausage) and slice it into coins that measure about ¼” thick.Thinly slice 8 scallions on a bias, so the cross section is a little bit wider than it would be if you sliced them directly across the trunk. And thinly slice 2 cloves of garlic.Toast some sesame seeds to garnish our rice later on. If you’re thinking, Hmmmmmm toasted sesame seeds? I feel like he uses toasted sesame seeds in a lot of his recipes, then you are correct. They're not only my favorite topping ever created, but you probably have some in your pantry and they take all of 5 minutes to toast in a dry nonstick skillet over medium heat. Just make sure you give the pan a shake every once in a while. Burnt sesame seeds aren’t so tasty.Next, start cooking:Heat a couple glugs of neutral oil in a large nonstick skillet over medium-high heat.Dump the sliced kielbasa in the pan and let cook, undisturbed, for about 3 minutes, until the underside takes on a deep brown color.Add the sliced scallions and garlic to the pan and stir so that most of the kielbasa flips to the other side. Sprinkle with kosher salt and continue to cook for another couple minutes, until the scallions begin to soften.In goes the rice:Dump your steamed rice into the skillet with one more glug of neutral oil.Immediately add a couple pinches of salt, a splash of soy sauce, and a couple pinches of white sugar. I know, the sugar sounds a little odd, but next time you order fried rice at a restaurant, pay attention to the sweetness. Fried rice is sweet. That’s the truth. It also balances the saltiness of the kielbasa and helps with caramelization.Stir the contents of the pan so the scallions, garlic, and kielbasa are evenly distributed.Clooney might like this rice. Maybe not. But also...maybe yes.\nPhoto by Emma FishmanNow it’s time for the egg river. Yeah, a geological feature made out of eggs. Sounds fun, right?Quickly whisk 3 large eggs and a pinch of salt in a small bowl.Push the contents of your skillet to either side so that a strip of exposed pan runs down the middle. There shouldn't be any rice in this section.Pour the whisked eggs into the exposed section of the skillet. Bam. That’s the egg river. Let the eggs sit undisturbed for 1–2 minutes, then give them a quick scramble, scraping along the bottom of the skillet. Once the eggs have cooked through, give the whole skillet a stir, distributing the eggs throughout the rice.You're finished! Throw a couple big scoops into a shallow bowl, top it with sesame seeds and a squeeze of lime juice. Grab a fork. Or a spoon, if that’s your thing. (I won’t judge you either way.) Sit down on your couch. And watch a movie you’ve already seen before. You don’t need to do anything at all tonight. You already made fried rice. That’s plenty.Rice not your thing? Try some noodles instead.These Cold, Pesto-y Rice Noodles Are Incredibly ChillHot noodles? During Rent Week? In this heat? Hell no.View StoryExplore Bon AppétitRent WeekBasicallyRiceKielbasaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Alex Delany"]}