{"id": "43a1d96af90109db42fb9e151721d9c5", "url": "https://www.bonappetit.com/story/antipasto-salad-recipe-salami", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "An Antipasto Salad Recipe for People Craving Salami Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAn Antipasto Salad Recipe for People Craving Salami SaladYou know you’re one of those people.By Aliza AbarbanelJuly 20, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailThe Whole Foods olive bar and I have a complicated relationship. I love the neat rows of peppadew peppers and cornichons, the smell of brine and olive oil that hangs in a gentle cloud above the sneeze guard. My bank account, however, shares none of these warm, fuzzy feelings. After a particularly painful splurge involving gigante beans, I rerouted my usual grocery store path to avoid the bar entirely. And when the Simple issue of Bon Appétit came out, this new recipe was an excuse to replicate my beloved salad bar antipasto at home, for half the price (and definitely less sneezes).This antipasto salad has some big flavors—creamy mozzarella, meaty salami, fresh basil—balanced with a lemony, garlicky dressing. Date food, it is not. Some people would tell you this isn’t really a salad, because there is no lettuce, barely any vegetables, and a prodigious amount of mozzarella. Ignore them. You don’t need that kind of negativity in your life. It’s a no-cook recipe for the dead middle of summer, when your will to stand near a stove has been sweated out, replaced by a deep hunger for air conditioning and spritzes. In fact it’s barely a recipe at all! There’s some minor chopping and whisking. Seriously: the hardest part is waiting 15 minutes before eating.In addition to featuring thinly sliced fennel, salami, torn fresh mozzarella, and artichoke hearts, this recipe calls for long sweet peppers, which appear at farmers’ markets during the peak of the season and are sold under a variety of names. Look for long sweet yellow, sweet banana, Hungarian sweet, or Cubanelle. If you search and search but come up empty-handed, substitute two medium red, orange, or yellow bell peppers (skip the green ones, as their flavor is much more grassy and herbal.*).Good red wine vinegar is worth it. Here’s why.\nPhoto by Alex LauStart by whisking together a dressing from grated garlic, extra virgin olive oil, red wine vinegar, oregano, and red pepper flakes. Gather your precious antipasto ingredients, thinly slice a small red onion, and add everything to the dressing. Let it sit for at least 15 minutes so the flavors meld, and tossing occasionally.This salad can chill in the fridge for up to a day, so feel free to pause here if you’re prepping in advance. When you’re ready to serve, zest half a lemon over the salad, add basil leaves, and toss. I know it’s easy to forget this final step in the excitement to finally eat, but don’t! Write yourself a note if you have to! This salad has a lot of bold flavors, and the lemon zest and basil provide much needed brightness. Finally, give it a taste and add more salt and pepper as needed.I served this all-star salad alongside hot-smoked salmon with fennel and yogurt (another delicious no-cook recipe) and some crusty bread to soak up that deliciously garlicky dressing. I’m keeping this recipe in my back pocket for family gatherings and rooftop picnics—hectic occasions that need make-ahead salads like these. Plus, if I skim some salami off the top before it actually gets to the potluck, nobody will know.Get the recipe:Antipasto SaladA no-cook summer salad with a lemony, garlicky dressing. And salami.View RecipePairs well with salami salad:Explore Bon AppétitAntipastoSaladSummer SidesSalamiMozzarellaBasilRead MorecookingThis Salad Has a Few of My Favorite Things (Burrata, for One)By Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-20", "author": ["Condé Nast", "Aliza Abarbanel"]}