{"id": "43b4ef6bbfdd70e6ff84064c501e9139", "url": "https://www.bonappetit.com/story/hummus-recipes-spicy-avocado-sweet-potato-beet", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "1 Easy Hummus Recipe, 5 Ways to Mess with It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking1 Easy Hummus Recipe, 5 Ways to Mess with ItSpicy hummus. Avocado hummus. Curried sweet potato hummus. ALL OF THE HUMMUS.By Alex BeggsFebruary 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailSometimes I waltz through the refrigerated aisle of hummus and brush my fingers along all of the different brands and sing, “I’ve never seen so many hummuses in my life”! Like Belle when she sees all of the books in the Beast’s library. JUST LIKE THAT, OKAY?My favorite right now is Whole Foods’s jalapeño flavor, but I’ve also been known to make googly eyes at anything with visible garlic in such excess my breath immediately stinks by association. But in the times I've made it at home, it never got as smooth and flawless as the store-bought stuff. Turns out this is a common complaint that's pretty easy to fix.I needed someone in my life to give me the chickpea makeover it so extremely needed. Waits by the phone for a Hollywood agent to call. That chickpea makeover arrived. We have a super easy base recipe, and then four more that riff on it with fun way-beyond-the-grocery-store flavors that will impress your friends and make your haters insanely jealous as they scroll through your feeds, lurking but not liking anything. So, yeah, a win-win.First up, Classic Hummus!Classic Chickpea HummusSo easy you'll never buy hummus again.View RecipeThis is a super basic recipe. It's all about getting that silky smooth texture, so you'll need plenty of pita chips to test it until you get it right. Riiiiight. The hummus is simply a vehicle for olive oil consumption, and according to some, \"olive oil is more medicine than food.\" So get your Mediterranean Diet on and eat hummus at every possible opportunity, folks.Herby Avocado!Herby Avocado HummusCreamy avocado hummus, where have you been all our lives?View RecipeI skipped the cilantro because I have the genetic \"thing\" that makes it taste like soap. But other than that, this recipe is SO GOOD. I mean, AVOCADO. You could also add parsley, mint, any tender herbs you’ve got. The high fat in avocado does fill you up, though, so try not to eat the whole thing before your friends come over. JK what are friends?Beet and Ricotta!Beet and Ricotta HummusThis bright pink and super creamy hummus is a party showstopper.View RecipeIt's. So. Beautiful. Also beets, they're mainly a vessel for BRIGHT PINK COLOR! The earthiness of beets is mellowed out by the ricotta, which is a nice bit of recipe balancing magic. You could also use Greek yogurt (healthy) or a light goat cheese instead of the ricotta, if you have feelings about ricotta. I'm not sure what those are, but you should work on them.Curried Sweet Potato!Sweet Potato HummusAdding water is key to a smooth and spoonable consistency.View RecipeThis is my personal favorite. (It feels like saying one of my children is my favorite, but I'm just being honest.) The combo of coconut oil + sweet potato is never not going to do it for me. There's an appealing warmth from the curry spices, a little bit of sweetness from the roasted tuber, and that faintly tropical hint of coconut. You want that! You need that! All you have to do is prick the sweet potato all over with a fork, cook it for a long time, and then it'll slide right out of its skin like I do when getting out of my work pants the second I get home.Spicy Carrot!Spicy Carrot HummusHarissa + hummus = heaven.View RecipeHarissa and carrots, another irresistible pairing. The recipe is SPIIIICY. You can ramp up the spice at your own discretion, keeping in mind that different brands of harissa are spicier than others. Could you also use Sriracha or sambal or gochujang instead? YES!!!Okay, okay, one final thought for you hummus freaks out there: You've been using hummus as a dip all this time, but what about...other stuff? Hummus in the morning, hummus in the evening, hummus at supper time, and all that. I like to serve it under roasted, braised, or seared juicy meats, like you would any purée. Hell, you could even mound a big ol' salad on top and call it dinner. Now THAT'S a good idea!!!Explore Bon AppétitBasicsHummusBeetSweet PotatoAvocadoRicottaSnackBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-30", "author": ["Condé Nast", "Alex Beggs"]}