{"id": "43c33642a621585ab76e95c729c0294a", "url": "https://www.bonappetit.com/story/learning-to-love-insomnia", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "The Cure For Insomnia Turned Out to Be Staying Awake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Learning to Love Insomnia Finally Put Me to SleepA short history of my long, sleepless nights.By Amanda ShapiroMay 29, 2018FacebookTwitterEmailIllustration by Tomomi MizukoshiFacebookTwitterEmailThis story is part of the Healthyish Guide to Finally Getting a Good Night's Sleep. Click here to read the whole guide—then get those zzzs.I don’t know any other insomniacs, or maybe I do. It’s not something that comes up in casual conversation. We’re private people to begin with, us not-sleepers, and our nighttime habits are the most private thing about us. So when I talk about my wakeful nights—how they started and how I spend them—I don’t know if it sounds average or uncommon, a little quirky or totally bizarre.I used to be what people call a good sleeper. I slept through natural disasters. I slept through shrieking babies in the next room. Through college, I could sleep eight, nine, 10 hours in one go and had to stop signing up for classes in the after-lunch spot because of how often I’d nap through them. Even at the most stressful times, sleep was simple, something I did as often as possible and with great pleasure.My transition to bad sleeper happened over the course of about nine months in my early twenties. I’d spent the summer after grad school living in Alaska, renting a room from a divorced nurse who drank only St. Pauli Girl, “writing my thesis,” biking six miles to the community pool to take hot showers, and watching movies on VHS. It was a time of low-lying but increasing anxiety. It was dawning on me that I needed to break up with my boyfriend, an actor 10 years older than me, and also that I wasn’t going to be a successful writer by the time I finished my MFA as I’d planned. It all seemed truly catastrophic...because I was 23.Back in New York that fall, I got a job at a high-end vegan restaurant, traversed the city tutoring prep-school kids, and nannied on the Upper East Side. I broke up with my boyfriend but still slept with him regularly. Among all that, I fretted about writing in both practical and existential ways. When would I have time to do it? What if I never finished anything? Why did I panic every time I sat down to try? I couldn't even read books because they reminded me of all the writers who’d accomplished what I was sure I never would.I started waking up, almost always a few minutes after 2 a.m., with\nthe certain feeling that everything in my life was wrong.I was living in one of those sagging, impossible-to-clean brownstones in Brooklyn with five roommates. My room, on the third floor, was a converted nursery, just big enough for a bed wedged against a hissing radiator, a narrow desk, and a plastic rack of clothes. It was in that room, that fall, that I started waking up, almost always a few minutes after 2 a.m., with the certain feeling that everything in my life was wrong.I always think of the phrase “free-floating anxiety” when I think of my insomnia, but that’s not really a good description of what it’s like. My anxiety doesn’t float; it burrows into a spot in the back of my throat and sits there, immoveable, until something—usually alcohol or a long, scalding hot shower or sleep if I’m lucky—manages to soothe it away. When I first started waking up, I’d keep my eyes closed for hours, willing myself unconscious. I’d lie there resolutely, anxiety building, until some gray morning hour when I’d groggily surrender and get up. Soon my bed itself began to feel cursed; even the thought of being in it made the tension bloom in the back of my throat.One night, when I woke up at the usual 2:06 a.m., I got up. I went downstairs and made a cup of tea, then I sat on the couch, under a blanket in the dark. I turned on the TV and watched an episode of \"Say Yes to the Dress.\" Then I watched another episode. I got hungry so I made a bowl of oatmeal and ate it while watching a third episode. By that point, six women had found wedding dresses and were living happily ever after, and anxiety had loosened its grip on me. When the garbage trucks started heaving and whining outside the window, I washed my dishes, folded the blanket on the couch, went upstairs, and slept.This became my routine most nights: tea, oatmeal, shitty television. When I’d seen every “Say Yes to the Dress” rerun, I switched to other innocuous, low-stakes shows. No “Law & Order”; definitely “House Hunters.” Never “The X Files”; always “Barefoot Contessa.” I grew up in a house with a strict TV policy, and my childhood training kept me from turning it on even now that I could watch 200+ channels any time (one of my roommates was a tyrant who insisted that we all split premium cable). But the rules were different in the middle of the night. My brain was at recess, and anything that helped me escape the monotony was fair game.I was definitely sleep-deprived, but my various jobs all started in the afternoons and evenings, so I could afford to sustain this pattern for days, sometimes weeks, at a time. But TV was only a temporary pacifier, and I soon got the urge to do something else at night, if not productive then at least distracting. I’d read Just Kids, Patti Smith’s memoir about her friendship with Robert Mapplethorpe in the ‘70s in New York, and it made me feel artsy and inspired by the city in a way I hadn’t in a long time. I’d gone to the Blick store across from the Chelsea Hotel and bought a cheap set of acrylic paints and brushes that stayed under my bed until the night that I decided to bring the set downstairs along with a pair of scissors, a stack of paper, and some glue. In about two hours, I made a little collage with paint and paper on a little 7”x 7” square of cardstock. The TV stayed on in the background so it never felt like I was working exactly, just idly cutting, gluing, and painting. I pretended I was fixing a small appliance or back at summer camp, dutifully doing arts and crafts.I moved through my day differently with the knowledge of what I did in\nthe middle of the night.I made dozens of middle-of-the-night collages and paintings over the next couple months. I kept them small because finishing one felt like an accomplishment that I could take with me back to bed. Over time, a strange thing happened: I started to look forward to waking up at night. Since moving to New York, I’d become very bad at having fun. I went to school, I went to my jobs, I tried to write, I went to the gym. Occasionally I saw friends and went on OKCupid dates in an attempt to forget my ex-boyfriend. I’d become a linear person, someone who looked toward the next task and the next, and I thought that’s what adulthood was until insomnia came along and carved out a separate place. Being awake, truly awake, not lying in bed with my eyes scrunched closed, felt deviant. I hadn’t asked for insomnia, but it seemed now like an offering. “Forget adulthood,” it said. “Watch bad TV and paint stuff.”Something interesting happens when you’re making art with the same carelessness as watching television: It becomes less fraught, less terrifying. Sometimes it feels great, and other times it’s boring, but quality stops being the point. I never had any illusion of quitting everything to become a collage artist. I’d put my squares of cardstock on the desk I never used to let them dry before filing them away in a drawer. But I moved through my day differently with the knowledge of what I did in the middle of the night. It was one activity that no one condoned or enforced, and it was all mine.Gradually my insomnia-fueled painting gave way to little poems, which gave way to writing prose in fits and starts. The TV stayed on but I usually kept it on mute. As it got warmer, my bowl of oatmeal became frozen bananas smeared with nut butter. (I never knew until recently that all these are actually sleep-promoting foods.) Most of what I wrote was mindless, literally illegible to me now. But some made its way into my thesis, which was feeling more and more approachable when I looked at it during daylight hours. Sometimes I’d go a couple weeks sleeping normally, and I’d start to crave those middle-of-the-night times. These were the only hours that my adult brain would let my kid brain free to play. But I never had to worry because the insomnia would always return, and I’d go back to my drawing, writing, snacking routine.Insomnia followed me even as I finished my thesis, stopped sleeping with my ex-boyfriend, vowed to quit writing forever, and left the city. It followed me as I fell in love again, slowly started writing again, and moved back to New York. At that point, I was working semi-normal hours as a factchecker, publishing regularly, and dating someone new. I had a little money to spend on indulgences: a dinner out, a new red dress, a bougie fitness class, a weekend upstate.This turned out to be the sleep aids I needed. As my day life got a little closer to my night life—just slightly more hedonistic, a little less terrified—I started sleeping more.It took a few more years for insomnia to loosen its grip on me, and I’ll probably never be a “good sleeper” again. I still have bouts of wakefulness, like when I have a deadline or something stressful on the horizon. I’ve learned that I avoid high-stakes situations with such dedication and resolve that my brain’s only choice is to sneak-attack in the middle of the night. (Case in point: It’s 4:31 a.m. as I’m writing this.) I’ve come to terms with all that. In fact, I’ve come to like that I’m this way. It’s the outcome of who I was in my twenties and who I fought to be: a writer, even if only between the hours of 2 and 6 a.m. If I’d had bigger responsibilities—a full-time job or a kid or a spouse—I would’ve handled my insomnia differently. Probably with pharmaceuticals, let's be honest. Instead I let it pull me out of bed and show me a version of myself, someone I’m still trying to convince myself I can be.Explore Bon AppétitHealthyishSleep WeekessayRead MoreLifestyleHow Sleep Became a Wellness FixationBy Ashley FettersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Amanda Shapiro"]}