{"id": "43c6d6d16cbf6ce47894733215026b32", "url": "https://www.bonappetit.com/story/brown-butter-oatmeal", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Add Brown Butter to Your Oatmeal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Add Brown Butter to Your OatmealThe one thing to change about your morning routine (and it’s not “wake up earlier”).By Alex BeggsMay 23, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Brown butter makes it (a.k.a. everything) better.I recently made eye contact with the white-haired guy on the Quaker oats canister. My whole body shuddered. I rotated it to have his smug smile face the backsplash. “You’re not better than me!” I hissed at the mystery man, a generic conglomeration of features that are supposed to insinuate “honesty, integrity, purity, and strength.” YOU ARE A MAN OF OATS. Chill!In a fit of unsubstantiated breakfast malice, I set out to show him. (Even if he couldn’t see me, because he was facing the wall. And is a cartoon.)Next to the pan of burbling oats, I melted three-ish tablespoons of butter, and kept melting it, until it turned foamy and brown. A-ha! And then, once the oats got to my desired state of mush, I added some brown sugar and cinnamon, stirred in the brown butter, and portioned out bowls for me and my companion. He was in shock. “Why is this oatmeal so fucking good?” he said, using an expletive my editors prefer to avoid unless absolutely necessary. IT’S NECESSARY. THEY WERE AMAZING OATS. The brown butter gave it this caramelized, restaurant dessert flavor—like bananas foster without the bananas, or the scent of torched crème brûlée at the table next to you. I’d even say the butter took that edge off the sharp, expired cinnamon I was using.I’ve never been good at math, but I’d say the otherwise boring, blah, ho-hum oatmeal was 1000 percent better. There was no fruit in the house, no nuts, no tahini. It’s hard to improve on oatmeal without those accessories. But we had butter. Oh, we had butter.That was a dramatic over-telling of how I added brown butter to my oatmeal, something hundreds of thousands of people have probably done before. Whatever, I’m a genius! Try it, you’ll like it! Mornings keep cracking, days keep beginning, you’ll have plenty of chances.The \"most important\" meal:I Swore I’d Never Make Waffles Again, yet Here I Am Making WafflesAnd liking it.View StoryExplore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-22", "author": ["Condé Nast", "Alex Beggs"]}