{"id": "43d2192cdd26850c3a3cc4cc19a26a5c", "url": "https://www.bonappetit.com/story/anna-kendrick-portland-maine-restaurants", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Anna Kendrick Loves Portland, Maine’s “Sexy Restaurant Revival” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAnna Kendrick Loves Portland, Maine’s “Sexy Restaurant Revival”The Portland native spills on the best brown butter crab toast, her dream fast food menu, and the signature cocktail she makes for every party.By Alyse WhitneySeptember 6, 2018FacebookTwitterEmailIllustration by Joe WilsonFacebookTwitterEmailWhen Anna Kendrick found out that her hometown of Portland, Maine, was named our Restaurant City of the Year, she screamed. Even though the actress lives in Los Angeles now, most of her favorite food memories are from living in Maine, eating brown butter crab, blueberry-topped panna cotta, and all kinds of fresh fish. (However, she doesn’t freak out about lobster—more on that later.) Below, the star of the upcoming thriller A Simple Favor (out September 14) shares some of her favorite dishes from growing up, how she feels about the burgeoning restaurant scene, her dream fast food meal, and a sneaky plan for entertaining at home. Oh, and her signature cocktail recipe, which you’ll want to make immediately.Where do you eat when you’re back home in Portland?Street & Co. for sure. It’s one of the best restaurants in Portland. It is about as old world as you can get in the States. You can sit out on cobblestone streets and hear live music from the bar down the street. You get the benefit of the ambiance of live music but it’s not right up against you.What’s your go-to order?They have a lot of beautiful, fresh seafood, so I’d usually just ask what was good today. But there was a brown butter crab appetizer that I would always look for on the menu and order immediately. They would put it on these bruschetta-style little toasties. Oh God. My mouth is watering thinking about it. It’s so good.Growing up in Maine, were you always alllll about lobster?I don’t actually flip out for lobster the way that I’m supposed to. It’s not like I grew up eating it so much that I got sick of it or something; it’s not like I was bathing in lobster! But I had it really young and there wasn’t a lot of pomp and circumstance around having it, so I was like, This is alright, I guess. My favorite thing at Street & Co. was always dessert. It’s my favorite part of any meal, really, but this is the place that made me fall in love with high-end desserts.If you could only pick one dessert there, what would it be?Definitely the panna cotta. I know panna cotta is a little more prevalent now but at the time, it wasn’t in a lot of restaurants! I get really angry when people put a really sweet sauce on it instead of a nice tart sauce because they always did a beautiful blueberry or blackberry sauce to cut that sweetness. I recently had a panna cotta that had a full-on caramel sauce on it and I was like, What are you doing?!Kendrick and Blake Lively in A Simple Favor.\nPeter Iovino/LionsgateHow do you feel about the shift in the restaurant scene?You expect your hometown to stay exactly the same. It was really nice to see that there are all these places cropping up. There’s this cool brewery restaurant that opened on the water, Liquid Riot, and it’s funny to see the hooligans my brother used to hang out with as chefs who make all this gorgeous food.  It’s cool to see Portland having a kind of a sexy, restaurant revival moment.On the flip side, you love fast food. A few years ago you said you had to cut out Taco Bell. Have you stood by that, or are you still eating it?I’m on and off the wagon in a huge way for sure. There was actually a night that I ordered it on Postmates. I got home really late and I said to myself, Screw it. I’m ordering Taco Bell. I got one of those emails that said my order had been canceled. I was like, This is a sign. This is the universe telling me that I have to be better than this.If you could create a three-course tasting menu of fast food, what would be in it?The Taco Bell cheesy gordita crunch, a Jack In The Box breakfast sandwich, and probably a Wendy’s frosty.What’s your beverage pairing?I feel actually really embarrassed right now. If I’m just having Taco Bell I’m going to go whole hog and be really nasty and have a Mountain Dew. I’m old school. If you’re going to have the Taco Bell it’s not like you’re going to have Vitamin Water and pretend that your shame isn’t real. Just have a Mountain Dew!Now that you’ve established all your eating out habits, how do you like to cook at home?I’ve been basically trying to crack really, really easy entertaining stuff. I don’t mean like Martha Stewart easy. I mean actually really easy. The thing that people find really impressive but is literally no work is taking a baguette out of the oven just before people arrive. I don’t lie and say that I made it fresh, but it’s warm. There’s this place Olive Hill Farm in Los Olivos that I buy olive oil and vinegar from, like cranberry pear balsamic vinegar and basil olive oil. I just cut up a baguette and let people dip. It’s always such a hit, and no one knows it’s no effort at all. I try to make it look all sexy. I’m into anything that’s no work but looks impressive.The Quarter Horse is Kendrick’s go-to cocktail.\nPhoto by Alex LauIn your new movie, A Simple Favor, Blake Lively is obsessed with the perfect martini. Do you have a signature cocktail?I just started making a Quarter Horse. I haven’t seen it on menus, but I don’t know a ton about cocktails. I like drinking them, but I don’t know a lot about them. I found it on a cocktail app that I have called Highball, and it’s made with bourbon, lime, simple syrup, ginger beer, and bitters. It’s like half Moscow Mule, half Old Fashioned. It will get you tipsy quickly but never give you a hangover. It’s the dream. I’m living the dream!Do you make them one at a time in a shaker, or a big batch?This is actually one of the things I really like about making them is there’s no muddling or shaking it in a mixer. You just pour it in a glass and put some ice over it, and it tastes incredible, like a proper shaken cocktail. There are fewer dishes to do after you’re done making it. Sometimes it feels very chic to be using a cocktail shaker, but sometimes you’re like, Ugh. I’ve got to clean all of this up.Here is the exact Quarter Horse recipe from the Highball app. Click here to enlarge.\nImage courtesy of Highball; illustration by Bryan FountainWhat other cocktails have you found on that app?I’m also into a French 75 or a champagne cocktail moment. Mostly because I don’t love just drinking champagne. I know how that sounds, like, Oh, I just hate diamonds. All I have to do is throw a sugar cube into champagne and add gin or cognac, and then I feel like I made something special.If you were thinking about lobster, though...Explore Bon AppétitCelebritiesPortland MaineMaineRead MorerestaurantsPortland, Maine, Is the 2018 Restaurant City of the YearBy Andrew KnowltonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Alyse Whitney"]}