{"id": "43db25c40d388951b43fbb587dcfe1cb", "url": "https://www.bonappetit.com/story/4-things-registered-dietitians-look-for-in-a-quality-olive-oil", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "4 Things Registered Dietitians Look For In A Quality Olive Oil | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored4 Things Registered Dietitians Look For In A Quality Olive OilChoosing from the many, many bottles of olive oil in the supermarket can be confusing, overwhelming and downright time consuming. Start shopping like a Registered Dietician and you can change all of that. RD, MS and Recipe Creator, Natalie Rizzo shares what to look for.By PompeianOctober 10, 2019FacebookTwitterEmailFacebookTwitterEmailYou’ve likely stood in front of the countless bottles and wondered if price point matters, how to tell which brands are authentic and whether or not you even need to buy olive oil (spoiler alert--you do!). A high-quality olive oil is a versatile and useful tool to help you eat and live well, as well as a kitchen staple for making everything from salad dressings and crostini to stir-frys and marinades.Unfortunately, after spending entirely too long trying to determine the difference between brands of olive oil, most people feel defeated and opt to make their selection based on price, which shouldn’t be the case. Next time you’re in the olive oil aisle, look for these four characteristics to shop like a Registered Dietitian and choose the highest quality bottle.1. Smell and TasteIf you think about it, olive oil is an integral part of almost every dish you eat, whether it’s the base of a recipe, added on top for extra flavor or mixed into a delicious dip or spread! If you’re lucky enough to shop at a store that allows tasting, try the assortment of olive oils on display. If not, save this step for home! Start by smelling the olive oil and then take a taste, allowing it to rest on your tongue. Ideally, it should smell and taste like fresh olives. Most high-quality olive oils have a fruity or peppery taste with a hint of bitterness. If the olive oil tastes or smells sour or stinky, it has likely gone bad from long exposure to heat or light.2. Dark bottlesLight, heat and air can make an olive oil go rancid quickly. To prevent that rapid decline in quality, look for olives oils that are packaged in dark bottles. The tinted bottle protects the liquid gold from being disturbed by harmful outside forces like light and oxygen. Once you bring your olive oil home, be sure to store it in a cool, dark place. Thinking about putting your bottle in the pantry directly above your stovetop? Think again. Be sure to keep the bottle away from heat and light and keep the cap on. There’s no need to transfer your oil out of the bottle when you bring it home (unless it’s into your pan!).3. Farm to table approachIt’s easy to forget that the oil in the bottle came from the juice of an actual fruit, olives. The highest quality olive oil stems from olives that are picked at the very peak of freshness. I choose Pompeian because you can truly taste the difference in their Olive Oils - their farmers and craftsmen have carefully nurtured the world’s best olives from the olive trees to my recipes. By overseeing every step of this ancient craft, the olive oil people at Pompeian personally guarantee the highest quality, best tasting olive oil in every bottle.4. Extra Virgin Olive Oil (EVOO)There are many types of olive oil to choose from – virgin, extra virgin, classic, extra light tasting--the list goes on! If you’re looking to reap the maximum health benefits from olive oil (did you know it’s a staple in the Mediterranean diet?) look for an extra virgin olive oil.The most authentic EVOO is \"First Cold Pressed,” which involves grinding freshly picked olives into a smooth paste at a low temperature to preserve the quality of the olive oil. From there, water is removed by centrifugal force, resulting in a fresh, authentic EVOO. Next, the oil is filtered to remove any leftover moisture and unwanted pieces of olive flesh or pit. The result is a high-quality oil that contains only the natural juice of olives. Consider Pompeian, the olive oil people, next time you shop. Their brand is a family of farmers whose expertise and passion bring you fresh olive oil from the grove right to your shopping cart.See! You don’t have to be a Registered Dietitian to shop like one. Olive oil is America’s healthiest cooking oil, known for its role in the prevention of chronic diseases, as well as its delicious taste. Like any healthy product, it’s important to do your research! With these four reminders in mind, shopping for an authentic and tasty olive oil should be simple. All you’ll have to worry about is enjoying your next meal!By Natalie Rizzo, MS, RDRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-10", "author": ["Condé Nast"]}