{"id": "44242c0a4cafda0229d7677aca2c9152", "url": "https://www.bonappetit.com/story/ask-andy-living-alone", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Ask Andy: I’ve Started Texting My Ex During Social Distancing...Should I Stop? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersLifestyleAsk Andy: Do I Need to Stop Texting My Ex?Senior food editor Andy Baraghani will be answering your questions about solo living all month long. By Andy BaraghaniApril 23, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a month-long series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.I went through a bad breakup last year with someone I'd been with for a long time. We both made mistakes—and we both felt very betrayed. I tried to stay on good terms with this person because we have mutual friends, but it was too hard to move on. So, a few months ago, we cut off communication entirely. I was finally feeling some closure, then this pandemic got real, and suddenly the floodgates opened between us. We're both quarantined alone, and we’re texting each other every day. I know there are a million memes about “texting your ex.” I know we \"shouldn't\" be talking right now, but this feels like uncharted territory where normal rules don't apply. I’m afraid I’m starting to catch feelings again, and I'm afraid it will lead to more pain. Andy, what should I do? – Losing-It LeeDear Losing-It Lee,Boy, do I feel you. Breakups are one of the hardest things we have to go through, and they’re as much a part of life as falling in love. From my experience, they never get easier. Every time I go through a breakup I think to myself, “I can’t bear to go through that again.” All the tears, heartache, loss of appetite, and inability to think clearly are paralyzing. Honestly, a “clean break” just doesn’t exist. Apologies if I offend anyone here, but if you’d call your breakup “clean,” I would question just how much you were in love with that person.Like so many people, I’ve been on both ends of the spectrum, both texting and receiving texts from my ex to try and get back that happy feeling our relationship used to provide. We all know how it works: You start typing something out to your ex, then delete it. Rephrase what you were saying. Delete it again. Finally you can’t bear to wait any longer and just press that blue arrow and immediately get that rush, that high. You sit for a bit. Now your stomach is slowly beginning to turn. 5, 10, 15 minutes go by yet no response. After 40 minutes, you're tempted to send a follow up. What the fuck is taking them so long? I thought my text was thoughtful. An hour goes by and when they finally respond,  a sense of calm comes crashing down over you.I agree with you: We’re in uncharted territory. The whole world feels like it’s falling apart. Many of us are stuck at home practicing social distancing.  Combine that with feeling extra horny these days (it happens) and of course you’re going to want to text your ex. Reaching out may help relieve loneliness and anxiety and eliminate uncertainty and panic.While I don’t want you to feel any shame about reaching out to your ex during this time, I also don’t want you to be reckless with your actions. Reconnecting with your ex does come with a risk: If you’re falling back into old patterns, it makes sense that you’re starting to catch feelings again. Stay honest with yourself and your emotions. Sit with them. Consider laying out some boundaries so you don’t feel like you’re rushing back into your old ways. Here are a few boundaries I would suggest:Avoid talking about the past, or the in-between time from when you broke up until now. Dwelling on the past almost never helps the present.Texting tends to cause a lot of ambiguity. If things are getting murky, try communicating over the phone, Facetime, or Zoom instead.If talking to each other every day is working out, then let it be. But if you think the lines are getting too blurry, take a step back.  Be careful of becoming too dependent on your ex to validate your feelings or  provide you with reassurance. Even in our current state, we have to find ways to adequately sooth ourselves and know our self worth.Also, make sure you have people in your life besides your ex to help lift you up. Global pandemic aside, it’s never good to put all your energy, love, and vulnerability into one person. The person with the most power to make you feel good will always be yourself.Be good to yourself,AndyAsk Andy: How Do I Make Meaningful Friendships in My Late Twenties?I recently moved to the U.S. for work from the Middle East.  So far, I haven't been struck with crippling loneliness, but I know it’s just a matter of time before the feeling sets in. I am trying to refrain from online dating because I firmly believe that one should not casually date or have flings just because they’re lonely. Instead, I’m trying to focus on finding a connection with friends. Any tips on how to form strong, deep, meaningful friendships in my late twenties? – Lonely LeoDear Lonely Leo,Finding and building new connections is never easy. For some reason, we’ve been taught to think that new friendships happen organically. In our first few days of grade school or college, we’ll just meet someone and connect with them. Or when we move to a new city, we’ll be able to seamlessly connect with our neighbors. The reality is that forming new friendships takes some effort no matter what age you are, and the belief that it should be easy can actually hinder your chances of finding those meaningful friendships you’re looking for.We’re in a time where many of us are working from home, feeling confined, and have limited contact with others. This makes it even more difficult to form new friendships. On top of that, you’ve moved to a new country. So when it comes to connecting with someone in a meaningful way, whether it be in a platonic or romantic relationship, you must be intentional with your actions. More often than not, we tend to take a passive stance on engaging with others, but you are more in control than you think.I understand if dating apps make you feel even more lonely, but finding ways to virtually connect may provide some comfort, whether it’s temporary or long-lasting. You aren’t the only one feeling isolated and disconnected from the outside world, and plenty of people have met friends through the apps. The truth is that these apps are a powerful tool for connection, romantic or platonic, especially in our time of social distancing.Dating apps aside, many communities have transitioned into meeting virtually. Trainers are doing live group classes. Artists are teaching their craft. DJs are playing live streams from 11 P.M. till the wee hours of the morning. Does this replace being at the gym, going to class, or having a night out? No. Still, it’s a way to foster and connect with a community. If you feel safe and secure enough to do so, look into volunteering with local community groups. Check your local newspapers and event listings, many of which have made the switch to tracking virtual events, to find something that matches your interests. You never know who you might meet in a live chat.I would also encourage you to strengthen the relationships you already have right now, whether these people  are near or far. Show them that you care by checking in through phone calls or video chats. Don’t just be there for them—be engaged.  You begin to form more complex, deeper relationships when you listen to people and try to understand their thoughts and feelings. It’s less about trying to give your friend advice and more about being present and empathetic.When we return to a life with opportunities to interact in person, put yourself in settings where you’re more likely to socialize. Think about your interests, hobbies, or getting into some kind of volunteering. The key is to keep yourself busy and find opportunities to interact with others.When I look at my own life and think about the friendships that have been built over the years, I think the most important lesson I’ve learned is to be open: to new experiences, to disagreement, to other lifestyles. Remember that people enter our lives for different reasons. Finding connection isn’t easy, but that’s what makes it so valuable.Be good to yourself,AndyAsk Andy: How Do I Find Alone Time While Quarantining With My Partner?I moved in with my boyfriend a month before all of this happened. He's the first partner I've ever lived with (and vice versa) so we had a whole plan for how we were going to approach this cohabitation thing. But then that all went to shit. Now we're both working from home in our 335-square-foot apartment and I'm having trouble balancing partner time and alone time. Any tips for quarantining with another person? How do we not get sick of each other? And make the time we do spend together feel special? And how do I respectfully ask for my alone time (because I really miss it)? –Shacked-Up SarahDear Shacked-Up Sarah,Moving in with your partner is a natural step in so many relationships. We want to share moments and make memories with our significant other—just not all day long. Spending time apart helps us find balance, and good tension from one another that (hopefully) builds desire by helping you both look forward to seeing each other again.Most of the time, you’d get some breathing room through things like your job, outside hobbies, or hanging out with friends. Of course, being in quarantine with a partner robs couples of those experiences. It makes us desperately seek some alone time. Most people don’t have the luxury to take one wing of the house while their partner takes the other, and taking the bed while your partner takes the sofa or worse, the tub, (it happens) can cause things to spiral out of control even faster.Properly communicating your needs to your partner, while also being open and listening to their needs, is the key to surviving your quarantine together. Be clear and direct about what you need while being gentle and respectful. This is not the time (actually, it’s never the time), to be passive aggressive.I’m quarantined with another person, but I still make time for myself. I make blackout hours where I go into a separate room, shut the door, and work on whatever work that needs to get done. I'll also do this when I want to sneak in a face mask (the skincare kind) or watch an episode of a show on my own. I’ll step outside or take a walk just to get a change of scenery.When you do spend time together, treat it as an opportunity to grow your relationship by getting to know your partner in a new way. Try scheduling mini dates on each others’ calendar so you both have something to look forward to. It could be as simple as taking an after-work walk. If you’re tired of the nightly Netflix date, learn how to make fresh pasta at home. Treat each other with affection and take turns giving each other a massage, or explore each others’ bodies a little further... Not only will this bring the two of you closer together, it will help relieve tension for you both.Recognize that it is totally okay to want alone time, especially right now, and that every couple is different. Some act as partners in every aspect of their lives, and others have very separate worlds. As hard as some moments or days may be with your partner, know that there are other people who are completely isolated through this. Use this time to keep the one you have close to you and to build each other up.Be good to yourself,AndyAsk Andy: How Do I Learn How to Live Alone in the Middle of a Pandemic?My roommate/best friend/coworker (all one person) left me to go isolate with her boyfriend about two weeks ago. At first I wasn’t mad because I figured I would have done the same, but now the loneliness of what is essentially complete isolation is starting to hit me. How do I keep myself from resenting my roommate, and do you have any tips for combating this isolation when FaceTime just isn’t enough? –Solo SteveDear Solo Steve,First and foremost, you have to take a step back. Why cause yourself pain by being consumed by your roommate when, now more than ever, we should be thinking about the things that make us feel good? I’m constantly reminding myself that this is not the time to be critical of yourself or anyone else. This is time to be gentle and kind.Give yourself a break, but continue to have structure by making a list of practices that you can look forward to throughout the day. Think about your needs, your desires, and how to keep yourself in a state of calm, acknowledging that, because of the circumstances we’re in, stability and happiness may feel elusive. Some people are trying to learn new skills like baking sourdough, hosting virtual dance parties, and cooking more than ever. It's also okay to just survive for a bit, without feeling obligated to learn something new or be creative. I have days when I want to be experimenting in the kitchen or looking through The World of Interiors for design inspiration. Other days I am just trying to exist and maintain connections with people I care about by checking on friends, family, and coworkers more than I usually would. If someone doesn’t get back to me, I hold no resentment, because nobody knows what each of us is experiencing and when, since everyone deals with trauma differently.Be honest about what will provide you with a sense of calm, because I think that is what a lot of us are searching for right now. Step onto your fire escape, walk around the block, go to a park and hug a tree for dear life. Ask yourself what feels most natural.We take it for granted that we can text, call, and FaceTime whenever we want, but we should feel lucky that we have the ability to connect. Obviously it will never replace physical touch—a hug, a handshake, a kiss, sex—but it’s essential for our minds and souls to maintain connection. You can still make memories even though it feels like the whole world is on pause. You can still create those moments; they just might be different than what you’re used to.When it comes to your roommate, this is not the time to turn our backs on one another. You're already two steps ahead by acknowledging that you would probably do the same thing in their position and recognizing that you could develop a certain amount of resentment over time.When I’ve experienced moments of resentment or anger towards someone, it’s never satisfying and does no one any good in the long run. It adds to our pain and keeps us from thinking clearly. When all of this settles down, I hope you’ll welcome each other back into your lives. Our minds, bodies, and hearts will be so in need of human connection, and the last thing I would want you to do is push another human away.Be good to yourself,AndyExplore Bon AppétitHealthyishHealthyish Guide to Being AloneCoronavirusRead MoreLifestyleThe Healthyish Guide to Being AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "Andy Baraghani"]}