{"id": "44255c9a620783baff74531b3ee8f3d0", "url": "https://www.bonappetit.com/story/stainless-steel-bowls-katori", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "Why I Can’t Live Without My Stainless Steel Bowls | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy I Can’t Live Without My Stainless Steel BowlsKatori are beloved by Indian cooks, but really everyone needs them.By Priya KrishnaJuly 29, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThere are certain familiar comforts that I’ve observed when I eat at another Indian person’s house. Yogurt containers are used as storage. You’re served double the food that you actually have room to eat. And the servingware is made of stainless steel.For most of my life, I always thought my family’s stainless steel stuff was lame. They represented my Indian parents’ sense of practicality; they were cheap, dishwasher-safe, and easy to cram into our kitchen drawers. My mom’s nice pottery was only for special occasions. Monday through Friday, stainless steel dominated the dinner table—our dal and our yogurt would go into two tiny stainless steel containers, and everything else (the sabzi, the salad, the roti, the rice) would go on stainless steel plates. Bo-ring.Then, I moved into my first apartment and acquired two nice wooden bowls, which promptly cracked and faded in the dishwasher (oops) and imbued everything with a weird damp log taste. I splurged on a ceramic bowl too. It chipped within two weeks.On a trip back to Dallas about a year ago, my mom, having seen the lack of serving vessels in my New York apartment, suggested that I take home some of her stainless steel prep bowls that couldn’t have been more than three inches wide and four inches tall—we call them katoris. They were small and lightweight, so I stuffed a few into my carry-on.In no time at all, those katoris became the most-used items in my kitchen. One was my new salt crock. I made quick salad dressings and dipping sauce for dumplings in another. They perfectly fit a single scoop of ice cream, or my morning yogurt drizzled with honey and walnuts. My boyfriend, who bakes quite a bit, started hogging them for measuring out small amounts of chocolate and sugar on his digital scale. We would drop them on the floor frequently and they never broke. We could stack a bunch of them into our tiny dishwasher, and store them in our tiny cabinets. I started to realize that maybe my parents were onto something.A few months later, we photographed my cookbook, Indian-ish, at my parents’ house. We shot all of the dishes on my mom’s best pottery, acquired from years of business trips around the world—leaf-shaped serving trays from the Philippines! A speckled, black-and-white bowl from Tasmania! We spent hours carefully laying out each dish on the dining table so that our photographer, Mackenzie, and stylist, Judy, could select the right one for the shot. One day, they were looking for utensils, and they stumbled upon the drawer full of stainless steel plates and bowls.“Why didn’t you put these out with the rest of the servingware?” Mackenzie asked me.“I don’t know. Those are what we eat food off of every day. They’re just not that special,” I replied.Immediately, Mackenzie grabbed a plate, dolloped some chutney on it, placed it on set, and took a test shot. I glanced at the computer screen, and to my surprise, the stainless steel plates looked amazing on camera. They gleamed and glistened. They reflected light beautifully. They made the colors of the food pop. She and Judy couldn’t believe my mom and I had been holding it out on them.We ended up shooting a good portion of the recipes on those plates. It felt right, in a way. The book is about my family and how we eat on a regular basis. Those stainless steel plates and bowls are as everyday as it gets for us. And who knew they would look so luxurious in harsh, highly saturated lighting?!A few days ago, Judy texted us that she had gone on a stainless steel shopping spree at her local Indian store. As for me, it took some time to come to this realization, but I’m through with eating my weeknight dal chawal on pricey pottery. Now, every time to head home to Dallas, I pack light: I want to save room for all the katoris I’ll be tossing in my bag to take back with me.Buy it: Stainless Steel Katori (Set of six, 2.75 inches diameter), $9 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Priya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, is now out from Houghton Mifflin Harcourt! Follow her on Instagram @PKgourmet.Explore Bon AppétitShoppingIndianishToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-29", "author": ["Condé Nast", "Priya Krishna"]}