{"id": "442a13f1eef6b2657349adeb83f55145", "url": "https://www.bonappetit.com/recipe/the-greatest-creamed-greens", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Creamed Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueThe Greatest Creamed GreensBy Alison RomanAugust 13, 20195.0(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe key to these greens lies in the heavy cream mixture, which should be gloriously rich, salty, and extremely garlicky. Oh, and stirring in a little crème fraîche at the end. This is one of the sides from Alison Roman’s “Steak House Night in America” menu, alongside: Martini Bar, Low-and-Slow Rib Roast, Baked Potatoes Deluxe, and Upside-Down Apricot Tart.Recipe adapted with permission from Nothing Fancy: Unfussy Food for Having People Over by Alison Roman (Clarkson Potter, an imprint of Penguin Random House, LLC). Copyright © 2019. Ingredients6–8 servings¾cup fresh coarse breadcrumbs or panko6Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper1½cups heavy cream6garlic cloves, smashed¼tsp. freshly grated nutmeg3large bunches kale, mustard greens, Swiss chard, spinach, and/or broccoli rabe (about 3 lb.), thick ribs and stems removed, coarsely chopped¾cup crème fraîchePreparationStep 1Toss breadcrumbs with 3 Tbsp. oil in a large skillet; season with salt and pepper. Set over medium-high heat and toast, tossing often, until golden brown and crisp, about 4 minutes. Set aside.Step 2Bring cream to a simmer in a medium saucepan over medium heat. Add garlic and nutmeg; season with salt and pepper. Simmer until reduced by half, 15–20 minutes. Once the cream gets added to the wilted greens, it will dilute and loosen up a bit, so it’s better to aim for thicker rather than thinner.Step 3Meanwhile, heat remaining 3 Tbsp. oil in a large Dutch oven or other heavy pot (5.5 qt. or larger) over medium. Add a large handful of greens and season with salt and pepper. Cook until slightly wilted and there’s room to add more greens to pot. Add another large handful of greens, season, and repeat process until all of the greens have been added. Continue to cook, stirring often, until greens are bright green and very tender and most of the liquid released from greens has evaporated, 10–22 minutes, depending on the greens you’re using; spinach will release more liquid than kale.Step 4Add cream mixture and crème fraîche to greens and mix to coat evenly. Taste and season with more salt and pepper as needed. Cook just until heated through, about 2 minutes.Step 5Transfer greens to a bowl and scatter reserved breadcrumbs over.Step 6Do Ahead: Greens and breadcrumbs can be made 4 hours ahead. Store separately, loosely covered, at room temperature. Reheat greens over low and top with breadcrumbs just before serving.How would you rate The Greatest Creamed Greens?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis was damn good! Turnip greens/chard/spinach.Used red pepper flakes in place of the nutmeg (some here not fans of nutmeg). Could just add a half teaspoon of them in addition too, I'm thinkingA cook from BuffaloBuffalo, NY3/10/2022Delicious! I add a shaving of freshly ground nutmeg, always to my creamed greens, and get rave reviews! I've also added a bit of lemon zest on top to serve. Bethany Nelson-LieserBig Lake, MN11/19/2021Made for Xmas 2020 delicious Anonymous12/27/2020My coworker Beneta made this for sick children on the streets, it tasted soooo good.BenitaWinsNew York11/21/2019This is delish. But if you add lemon zest to the breadcrumbs and red pepper flakes to the greens it’s life changing.KATSFISHER4Baltimore10/12/2019Explore Bon AppétitAmericanKaleLeafy GreensVegetableMustard GreensSwiss ChardSpinachBroccoli RabeQuickEasyWeeknight MealsSideNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Alison Roman"]}