{"id": "4438e0de78011ad01087bc4d5d35fe60", "url": "https://www.bonappetit.com/recipe/creamy-sesame-noodles-with-yuba", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Creamy Sesame Noodles With Yuba Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy Sesame Noodles With YubaBy Jessie YuChenJanuary 27, 20223.9(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susan OttavianoEmailPinterestPrintEmailPinterestPrintThese vegan noodles in a creamy, soy-milk-based sauce come together in under 30 minutes for a comforting throw-together meal. The sauce, which has nutty tahini, savory miso, and soy milk, is just thick enough to cling to each noodle, but it's light enough to be full-on slurpable. Add ribbons of protein-packed yuba (tofu skin) on top and you've got a nourishing, feel-good bowl.Yuba, or tofu skin, is actually a by-product of the tofu-making process—when large vats of soy milk are heated for making tofu, the soy proteins coagulate to form a delicate skin that rises to the milk's surface and gets skimmed off. The resulting yuba has a mildly nutty flavor and bouncy elastic texture. Tofu skin is sold fresh or dried, but fresh yuba (such as the one by Hodo Foods) is typically sold in pliable, folded-up sheets that you can slice into “noodles,\" as in this recipe, or tear up and add to soups, salads, or stir-fries. Look for fresh yuba in the refrigerated section near the tofu at Asian markets or well-stocked grocery stores. Read more about tofu skin here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpider$6 At AmazonWhisk$10 At AmazonMedium Saucepan$39 At AmazonMicroplane Grater$16 At AmazonTongs$13 At AmazonLarge Pot$55 At AmazonIngredients4 servings2Tbsp. vegetable oil3garlic cloves, finely grated11\" piece ginger, peeled, finely grated¾cup dry sake or rice wine⅓cup tahini2Tbsp. white or yellow miso3cups unsweetened soy milkKosher salt5oz. fresh yuba sheets (tofu skin), thinly sliced18.8-oz. package dry udon noodles or similar size and shape wheat noodle2scallions, thinly sliced2Tbsp. toasted black and/or white sesame seeds1Tbsp. toasted sesame oilPreparationStep 1Heat vegetable oil in a medium saucepan over medium. Cook garlic and ginger, stirring occasionally to prevent sticking, until starting to brown, about 2 minutes. Add sake and cook, whisking constantly and scraping up any browned bits stuck to bottom of pan, 30 seconds. Whisk in tahini and miso, then add half of soy milk and cook, whisking often, until incorporated and thickened slightly, about 2 minutes. Whisk in remaining soy milk and season with salt. Reduce heat to low and keep sauce warm until ready to use.Step 2Cook yuba in a large pot of boiling water until loosened up and warmed through, about 2 minutes. Using a spider or tongs, transfer to a medium bowl.Step 3Add noodles to same pot of boiling water and cook according to package directions. Drain and return to pot.Step 4Ladle about 1 cup sauce over noodles and toss to coat. Divide noodles among bowls and spoon more sauce over. Top with yuba, scallions, and sesame seeds. Drizzle sesame oil over, dividing evenly.How would you rate Creamy Sesame Noodles With Yuba?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleStill searching for the perfect sesame noodle recipe—unfortunately, this wasn't it. I was excited about the addition of miso because I love miso, but in my opinion, the flavors just didn't work together. I had to add chili oil for this to be palatable, and still didn't enjoy eating it. Wouldn't make again.lasagnaqueenPortland, Oregon3/25/2022Explore Bon AppétitDinnerLunchEasyQuickWeeknightAsianHealthyishVeganVegetarianDairy-FreeMisoCondiments, Sauces & PastesNoodlePasta & NoodlesUdon NoodleTahiniMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-27", "author": ["Condé Nast", "Jessie Yuchen"]}