{"id": "4441d50b39cf633a7f1565e4263647f7", "url": "https://www.bonappetit.com/story/silicone-mats", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Silicone Baking Mats Are So Nonstick, You’d Think They Were Crafted By Angels | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSilicone Mats Are So Nonstick, You’d Think They Were Crafted By AngelsIf burnt bits and stuck-on glazes make you want to scream, you need one of these.By Sarah JampelJune 4, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Silicone baking mats may as well be the most nonstickiest material on the face of the earth. They’re so smooth and moisture-wicking, nothing will cling to them. If you want to know what it’s like to try to gunk something to a silicone mat, imagine trying to stick a piece of gum to the skin of a dolphin that just emerged from the water. Not gonna happen.So yes, you do need at least one silicone baking mat—if not for the tactile pleasure it can offer you (dolphin skin!) then for its wide array of uses in the kitchen.First and foremost, it will make your cooking life a little bit easier: It’s reusable (my sheets of pre-cut parchment paper are precious and used sparingly) and it expedites clean-up—I’d scrub a silicone baking mat over a clunky, oil-slicked baking sheet that barely fits in my sink any day.But it has also value beyond convenience: These mats, which are made of silicone woven with heat-conducting fiberglass or nylon fiber mesh, are ideal for candy in the brittle-toffee-bark family, caramelized nuts, meringues, macarons, marshmallows, fussy cookies like tuiles, florentines, wafers, tempered chocolate—basically, all of the stuff that threatens to stick to parchment and drive you absolutely insane. Or, if you have aspirations for perfect cookies but wonky, warped baking sheets that don’t do a great job at heat distribution (I feel your pain!), a layer of silicone will help create a smooth surface, lessening the effect of such flaws.If all of that seems a little too pastry-cheffy for you, don’t count yourself out just yet: Silicone baking mats are also great for the kind of sticky-saucy situations (oven-dried strawberries, soy-glazed chicken thighs, roasted pineapple, bubbling-over galettes, jam-filled rugelach) where you’re worried about burnt-on bits or over-caramelization, or whenever you’re dealing with something particularly delicate (looking at you, salmon skin). Or, if you’ve ever scratched your head at the idea of kneading or rolling dough on a “clean work surface” (there is not one appropriate surface in my apartment that’s clean enough for “work”), a silicone mat can stand in. It’s the ideal environment—flawless, easily wipeable—to braid challah, shape morning buns or, heck, knead store-bought pizza dough for one of the dozen grilled pizzas you’ll be eating this summer.And now it is my duty to tell you that a silicone mat cannot always replace parchment paper, nor should it always be a barrier between your food and your baking sheet. Because silicone is not as effective a conductor as metal, food won’t brown or crisp to the same extent and cooking times might be longer. Silicone also encourages spreading, resulting in cookies that have an even texture throughout. If you’re aiming for a chocolate chip cookie with a puffy center and a lacey, caramelized edge (this happens when a cookie’s structure sets before it has a chance to spread too far away from the center), you’ll want to skip the silicone and go for parchment instead.But so what? No pan liner can be everything for everyone. There is a time and a place for parchment, for foil, for bare aluminum sheets, and for silicone mats. Invest in one and your future marshmallows will thank you.Photo by Chelsie Craig OXO Good Grips Silicone Baking Mat$21 $17 at AmazonExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Sarah Jampel"]}