{"id": "44487e34f7006e5f984cb5dba46ad3c0", "url": "https://www.bonappetit.com/recipe/big-falafel-cake-with-cucumber-salad", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Big Baked Falafel Cake With Cucumber Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBig Baked Falafel Cake With Cucumber SaladBy Kendra VaculinMarch 4, 20223.8(37)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellEmailPinterestPrintEmailPinterestPrintThis large-format, weeknight-friendly take on falafel starts with canned chickpeas, instead of dried, and calls for baking instead of frying. Packed with herbs and a few heavy-hitting spices, the golden brown savory cake is first crisped in a skillet for optimal craggy edges, then finished in the oven until cooked through. To make it a meal, pair a wedge with a simple salad of cucumber, radishes, and quick-pickled red onion. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonCast Iron Skillet$30 At AmazonWhisk$10 At AmazonMicroplane Grater$16 At AmazonIngredients4 servings1large red onion3Tbsp. plus 1 tsp. fresh lemon juice¼tsp. sugar1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more¾cup (packed) cilantro leaves, divided¾cup (packed) parsley leaves, divided2Tbsp. cornstarch or potato starch1tsp. ground cumin½tsp. baking powder½tsp. ground coriander¼tsp. cayenneFreshly ground black pepper2garlic cloves, finely grated1large egg, beaten215.5-oz. cans chickpeas, rinsed2Tbsp. extra-virgin olive oil, plus more for drizzling1cup plain whole-milk yogurt3Persian cucumbers, thinly sliced2radishes, trimmed, thinly slicedPreparationStep 1Place a rack in middle of oven; preheat to 350°. Cut 1 large red onion into quarters. Thinly slice 1 quarter crosswise and place in a small bowl. Add 3 Tbsp. fresh lemon juice, ¼ tsp. sugar, and a big pinch of kosher salt and stir to combine, breaking up onion. Set aside to pickle.Step 2Transfer remaining onion quarters to a food processor and add ½ cup (packed) cilantro leaves, ½ cup (packed) parsley leaves, 2 Tbsp. cornstarch or potato starch, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, 1 tsp. ground cumin, ½ tsp. baking powder, ½ tsp. ground coriander, ¼ tsp. cayenne, a few grinds of black pepper, and 2 garlic cloves, finely grated. Pulse just until onion is chickpea-size (8–10 pulses). Add 1 large egg, beaten, and two 15.5-oz. cans chickpeas, rinsed, and pulse until chickpeas are coarsely chopped (8–10 pulses).Step 3Heat 2 Tbsp. extra-virgin olive oil in a 10\" ovenproof skillet, preferably cast iron, over medium-high and swirl to coat bottom and sides. Scrape in falafel mixture and pat into an even layer all the way to the edges of skillet. Cook falafel until starting to turn golden around the edges, about 5 minutes.Step 4Transfer skillet to oven and cook until falafel is set on top and browned around the edges, 18–22 minutes.Step 5Meanwhile, whisk 1 cup plain whole-milk yogurt, remaining 1 tsp. fresh lemon juice, and a pinch of salt in a medium bowl. If yogurt is thick, thin with water, 1 Tbsp. at a time, to a drizzle-able consistency.Step 6Coarsely chop remaining ¼ cup (packed) cilantro leaves and ¼ cup (packed) parsley leaves and place in a medium bowl. Add 3 Persian cucumbers, thinly sliced, 2 radishes, trimmed, thinly sliced, and reserved pickled red onion; season with salt and pepper. Drizzle oil and some of pickling liquid over; toss salad to combine.Step 7Run a butter knife around edges of skillet to loosen falafel if needed, then carefully invert onto a plate. Cut into wedges and divide among plates. Serve with salad mounded on top and yogurt drizzled over. Season with more pepper.How would you rate Big Baked Falafel Cake With Cucumber Salad?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleI thought this came out really well! My advice would be to use the processor carefully. Keep it chunky and the texture will be more crumbly. But I have to say that the yogurt sauce needs tahini. That's just a necessary part of anything called felafel. Steve Miami 3/25/2022This is definitely a savory bean cake with falafel seasoning, rather than a falafel proper. That being said, it was easy, quick cooking, and delicious. I'll be adding it to my weeknight meal rotation. As others mentioned, don't over-process the ingredients in the food processor, otherwise the texture will be too dense. I cooked mine in a well seasoned cast iron pan, and had no problems with it sticking, or burning. Served with sriracha, it scratched the falafel itch, without having to make a big mess frying them. The Morning Star3/22/2022Wow, this was delicious! The felafel cake was perfect tasting, even if it didn’t come out in one piece: crisp and flavorful. The salad and yogurt were also very good, with the pickled onions mild and the dressing tart. Very good weeknight recipe!Kate LawlessDeerfield, MA3/19/2022I really wanted this to work, but it did not. Bottom was close to burned and the top stayed damp. I did get it out of the pan in almost one piece and tried to flip it and bake the top side down, but  Ididn't have  a lot of luck there.\nI doubled the spices, but it was sorely lacking in taste. I've had the real falafel so maybe I was expecting too much. I do wish EPI could rework this recipe and try again. It has a lot of potential, but not as written.TerryDes Moines3/17/2022My husband really liked this, and the flavor was good, but I am going to have to experiment if I try this again. The cake completely fell apart when I tried to take it out of the pan, and the texture was dry. I added tahini to the yogurt sauce and tomatoes to the salad. I saved the leftovers, so its was worth making, but it needs some improvement. nilssonsBoston, MA3/15/2022The flavor of this is nice (though, I pretty much doubled all the spices). I also really enjoyed the salad and yogurt (I also added tahini). I do have to agree with some of the other reviews - mine turned out dense and mushy. I might have over-hydrated the mixture or over-blended the chickpeas. If I make this again, I'm going to use dried, soaked chickpeas instead of canned, as I was hoping for a fluffier texture. SashaJersey City, NJ3/14/2022All in all I liked this better than frying small falafel and felt it was a fun presentation.  I flipped my falafel cake after pan frying it, it was almost burnt but not quite. I would either reduce the heat or flip it after 4 vs 5 minutes  next time. Flippimg it helped get uniform crispiness and avoided the soggy cake that some other reviewers have noted. I used the sumac sauce from Jerusalem which was great. Alyssa D.Carson City, NV3/14/2022Loved it!  Had no coriander so substituted for mint and it worked beautifully!  Next time I will flip the cake once it's out of the oven and fry off, so it's got an even crisper outer. Tammy 3/13/2022Found it dry, and had to add a lot more seasoning/spice than what the recipe called for. I wonder if another egg would have helped. AnonymousAustin3/12/2022To JIL2 - I did not see \"soap\" on the ingredient list, so I do believe it is an optional addition\n\nThat being said, you are probably genetically predisposed to disliking the cilantro taste, and, shocking as it may be, the vast majority of people find it a refreshing and light herbal addition to many dishes. Please take care to limit your personal consumption and avoid it in your falafel. Soap BubbleMesopotamia 3/11/2022Perfect weeknight dinner! whole thing can come together in 30min and the salad and sauce round it out very nicely.AnonymousWilton, CT3/10/2022Mine burnt on bottom and stayed mushy everywhere else. Cooking it on stovetop now and going to flip like a frittata to brown both sides. Next time I think I’ll just make regular falafel balls.AnonymousSan3/9/2022Loved this, although it stuck a little to the pan. Added tomatoes to the salad. LexStaten Island, NY3/9/2022I HATE CILANTRO --- NOT FOND OF SOAP IN MY FOOD...I SUBSTITUTE THE SAME AMOUNT OF PARSLEY FOR CILANTRO AND, DEPENDING ON WHAT I AM MAKING, HAVE USED CELERY LEAVES --- JUST NOT WITH THE SAME MEASUREMENT...JIL2EL CAJON, CA3/8/2022I have a spouse who hates cilantro. Thoughts on a substitute?AnonymousPhiladelphia 3/7/2022Explore Bon AppétitDinnerMainWeeknightVegetarianNut-FreeChickpeaBeanVegetableCucumberYogurtOther IngredientsCilantroHerbs & SpicesParsleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-04", "author": ["Condé Nast", "Kendra Vaculin"]}