{"id": "445016c4998534bb7c5ad81efeb9edac", "url": "https://www.bonappetit.com/story/cecile-richards-planned-parenthood", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Planned Parenthood’s Outgoing President Cecile Richards on Making Trouble—and Pies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePlanned Parenthood’s Outgoing President Cecile Richards on Making Trouble—and Pies“Women want to be the architects of their future and their destiny, not just the recipients of it.”By Hilary CadiganMay 16, 2018FacebookTwitterEmailFacebookTwitterEmailWhen she’s not fighting for women’s health or facing Spanish Inquisition-style congressional hearings, Cecile Richards bakes pies. Cherry, especially, but also pecan, lemon meringue, the occasional apple. Now, after 12 years, the lifelong activist is stepping away from her role as president of Planned Parenthood and embarking on a new chapter: traveling the country in support of her new autobiography, Make Trouble.In the book, Cecile recounts her journey with grit and candor, from her upbringing in East Texas to her first job organizing low-wage laborers in New Orleans to her years advocating for Planned Parenthood and the one in five American women who count on it, despite the countless men who have tried to stop her. She also delves into the more personal details: her ongoing love affair with tacos; her struggle to balance work and motherhood; the lessons she’s learned from her own mother, the legendary Ann Richards, outspoken feminist and last Democratic governor of Texas.We spoke to Cecile about her life of activism, the foods that have fueled it, and what’s ahead. As the late great Ann used to say, “Politics can be dirty, but there’s nothing dirtier than trying to get a dried egg off a breakfast plate.”So, your book was originally supposed to include a recipe with each chapter. Why?I’d never written a book before and as I was putting it together, it seemed like in every part of my life food (and music) had been important, in very different ways. I’ve lived all different places in the country, and we had different food traditions in Texas than we had in Louisiana or California. The book is a lot about activism, and it’s a bit of a memoir. It’s hard to separate that from what we were eating, what we were listening to, and what we were cooking.Instagram contentThis content can also be viewed on the site it originates from.Including a lot of pies!Yes! I’ve tried everything and I like to think I’m still learning. But I guess the most important thing about making a pie is, what do you use? Are you a lard person, are you a butter person? Are you a chilled vodka in the crust person? There’s a million different ways. I’ve tended to settle back on an all-butter crust. My favorite recipe is from Tartine, the bakery in San Francisco. I have all their baking books.When I came to Planned Parenthood 12 years ago, I started a pie-baking contest. Which is kind of fun because at the time we only had about 35 employees, and now we have about 500. So it’s become a contest I can’t even win anymore. Sometimes I would make four different pies, hoping that something would at least place, you know? My most treasured gift on leaving was a booklet of all the winning pie recipes.How has cooking helped you bridge gaps in your work as an activist?This goes back to my early organizing days. I worked for years with women who—we had nothing in common. They were hotel workers or they were janitors, or many of them worked in nursing homes. But whatever their cooking traditions were, getting a chance to share a meal, you learn about people. What foods are important to them? To me, that can tell you a whole lot. Cooking and sharing food together, it’s a universal human experience.Food has been political for you too. As you write in the book, your first big stance was in middle school when you decided to become a pescatarian.Right, exactly! That was actually kind of horrifying for my mother. Because, you know, growing up in Texas and then suddenly declaring I wasn’t going to eat meat anymore. I remember her sending me to the doctor. He looked at me—and looked very puzzled. But eventually my mother became a gourmet cook for all kinds of foods she’d never made before. That’s what women do. Adapt. It was her way of showing love.Cecile Richards (third from left) with her family in seventh grade, the year she went pescatarian\nCourtesy of Cecile RichardsNow that you’ve left Planned Parenthood, what’s next?I’m very focused on what I can do to support the women who are running for office. There are many, many, many of them. Many more than we’ve ever seen before. And then I’m exploring all kinds of issues that I care about. I’ve been working for 12 years to help advance women’s access to reproductive health care, which I think is important. And there are a lot of other things that women care about in this country. Like affordable childcare, access to equal pay, higher education, and good public schools.What’s your message to women at this moment in time, when things feel very difficult, but also kind of exciting?I think it’s a time to really look to ways in which you can support each other. Support other women. Stand up for people who may need it. Stand up for women who are standing up for themselves. That’s the overwhelming sense I’m getting from women around the country. They want to be the architects of their future and their destiny, not just the recipients of it.Buy it: Cecile Richards’ memoir, Make Trouble, is $19 on Amazon.Speaking of pie...Explore Bon AppétitBooksPieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Hilary Cadigan"]}