{"id": "4450998215f440c16e8cfa57bb3b8bfe", "url": "https://www.bonappetit.com/story/celeste-ng-strangers-at-thanksgiving", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Strangers at Our Thanksgiving Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Strangers at Our Thanksgiving TableThey were new to this country, to the holiday, to us. And we made space for them.By Celeste NgOctober 23, 2019FacebookTwitterEmailIllustration by Ping ZhuFacebookTwitterEmailFor many of us, Thanksgiving is a time to gather with family. But when I was growing up, our Thanksgiving table was often full of strangers: people I had never met, people my parents barely knew, people I would never see again.They would arrive around five-thirty, looking nervous and a little out of place. We lived in the suburbs—first in Pittsburgh, and later in Ohio—and they drove their cars slowly down our quiet little street, looking for our house in the fading light. We’d know they were coming by their headlights, which swooped across the off-white screen of the living-room curtains like old-fashioned searchlights, as they turned into the driveway. Then, when we heard the engine quiet outside and saw the lights click off, we’d go to the door and greet them.They always came from overseas, these strangers. My mother was a chemistry professor, and each year she invited the foreign students—who had nowhere to go for the holiday weekend—to our house to celebrate. Many were from China or Taiwan; to them, my Hong Kong–born mom was a natural mentor and mother-like figure. But others came from Romania, Sri Lanka, and beyond. There was a girl from Bulgaria who gave me a wooden vial of rose-scented perfume; there were two tall blond Ukrainians who seldom spoke aloud, at least to us. There was a young man who wore a turban and a soft bushy beard. One year we hosted a whole Vietnamese family who’d just moved to the neighborhood; only years later did I learn that they were refugees.People who were new to the country often gravitated toward my mother—maybe because, as an immigrant, she knew what it was like to try and make your way in a strange new place. They sought her out for advice on everything from academic issues to relationships to navigating American culture. And when November rolled around, they joined us at our Thanksgiving table as if they were part of our family, like long-lost relations or distant cousins home from college.My father would open the front door and there they’d be, coming up the front walkway, clouds of their breath materializing in the frosty November air. Often only my mother had even seen them before, but we held the door wide open and invited them in. They’d knock the snow from their boots, squinting slightly as they came into the warm, bright house and introduced themselves. There were so many of them over the years that I don’t remember any of their names.Illustration by Ping ZhuSome years there were just a few guests. But some years there were a half dozen or more. Often, even after we put all the leaves in the dining table, we kids overflowed into the kitchen. But we always made space, and there was always far too much food.For most of our guests, it was the first American Thanksgiving they’d experienced, and somehow it became my job to explain what was going on. In a Chinese family the youngest child is responsible for keeping everyone’s teacup full: The younger generation is supposed to tend to the older, to make sure they’re comfortable and have all that they need. So perhaps I became the explainer as a natural extension of this role—the little caretaker of the table. But it’s also possible that my mother gave me the job because even at that age, I loved to tell stories.“There’s a meaning behind each of the foods we eat today,” my mother would say as we gathered around the table, and then she’d give me a nod. This was my cue to stand up and begin.As we started to eat, I told our guests the simplified, beautified story I’d learned in elementary school, which at that age I still believed: the Pilgrims, the Mayflower, the desire to start a new life abroad. How the Pilgrims had struggled. How the Native Americans had welcomed them and helped them and taught them. How they’d all joined together for a huge feast after the Pilgrims’ first successful harvest.I must have been an amusing sight: a little Chinese American girl three feet tall with a six-foot vocabulary, in a blunt fringe of black bangs and my favorite red party dress, delivering an earnest primer on Thanksgiving. The guests at our table were scientists and intellectuals, studying physics and biology and organic chemistry. But they listened politely as I prattled on, describing a celebration of having plenty, of welcoming newcomers, of learning from one another, of getting along—the same story my kindergarten classmates and I had acted out with paper-bag puppets.As we passed each dish around, and each guest took a tentative spoonful, I explained what we were eating. Here is the corn, I would say, glistening with butter, which the Pilgrims had not known how to grow—until the Native Americans taught them to plant the seeds with fish to help fertilize the soil. Here are the deep-ruby rounds of jellied cranberry sauce and the honey-orange yams and the creamy mashed potatoes oozing with pools of gravy—all foods native to the Americas, as new to the Pilgrims as they were to many of the guests at our table. And here, of course, is the centerpiece, the turkey, with its crisp bronze skin: this strange new fowl our ancestors had never encountered before, but which had sustained them through those hard early years, and which now was the heart of this quintessential American feast.I didn’t know yet, as a child, that this story was largely a pretty fiction. That even the food was a myth, that there’d been no sugar for cranberry sauce and probably no turkey at all. I spoke of “our ancestors” and the traditions they’d handed down, but my own parents had immigrated in the 1960s; most of our guests had been in the country less than a year. None of the people at our Thanksgiving table were descended from the Puritans—or the Wampanoag either, for that matter.And it would be several more years before I learned how most encounters between Europeans and indigenous peoples actually played out—before I learned about Cortés and Pizarro, about Andrew Jackson and the Trail of Tears, about the legacy of colonization and racism that our country still struggles with today. At those Thanksgiving dinners, though, we simply passed the bowls around the table and encouraged everyone to try a taste.Looking back, I cringe at the rose-tinted storybook view of America I preached to our visitors. At the time they all seemed very grownup to me, but they were only in their 20s, younger than I am today—barely more than children themselves, probably homesick and lonely for their own families. I wonder where they are now: which of them chose to stay in this country and what kind of welcome they received if they did. How they’re doing, 30 years on, in an era where the news is full of border walls and Muslim bans and immigrant concentration camps, when those seen as foreigners—even those American-born like me—are told more and more frequently, “Go back where you came from.” I wonder if the people who dined with us now cringe, too, at the simplified Thanksgiving story a little girl told them years ago, at a table full of new immigrants and new Americans.Illustration by Ping ZhuBut I also realize that even if the Thanksgiving story we shared with our guests was distorted and simple, the food itself was not—and it told a slightly different story. True, we had all the old Norman Rockwell standbys—the corn, the yams, the mashed potatoes—but we’d made our own additions too.My mother always stuffed her turkey with fried rice laced with turkey drippings and scallions, studded with chopped lap cheong and golden bits of egg. She thought it tasted better than regular stuffing—and besides, it placated my father, who insisted he wasn’t full if the meal didn’t include some rice. After my story about the Pilgrims, after we carved the turkey, we passed the rice stuffing around in a blue-and-white-patterned bowl, alongside the Stove Top version from a box.“Try both,” we urged our guests. “That’s the more traditional American kind, made with bread crumbs and seasoning. And this is our family’s variation.”At those Thanksgiving dinners, my mother served her own egg rolls—a special treat because they were so labor-intensive. My sister and I would spend Thanksgiving morning making them at the kitchen table, folding the delicate wrappers around the steaming just-cooked filling, sneaking spoonfuls of it anytime our mom’s back was turned. Our mother fried the egg rolls right after our guests arrived and just before we sat down at the table, and when you took one from the plate and bit into it, the golden-brown shell crackled audibly and shattered on your tongue, giving way to a burst of salty pork and savory shiitake slices and tangy bamboo shoots.“These aren’t traditional for Thanksgiving,” my mother would explain matter-of-factly—as if anyone might have mistaken egg rolls for a Puritan dish. “But they’re our tradition.” Our visitors sometimes liked the turkey and the yams and the mashed potatoes, and sometimes didn’t, but without fail the egg roll plate would be completely empty by the end of dinner, even the stray shards of crisp wrapper gobbled up.A few lucky guests who stayed overnight got to enjoy turkey jook the next morning. Jook is a common Chinese breakfast food, usually made with chicken broth. But that one Friday our family made it with homemade turkey stock—a uniquely Chinese American post-Thanksgiving tradition, and in my book, the absolute best way to make use of a turkey carcass. The way my mother cooks it, it is the most basic of dishes— little more than rice and broth topped with a drizzle of oyster sauce and a scattering of chopped scallions—but visitors always raved over how good it was, how nourishing and filling and homey, and my mother would ladle them another bowl.There is the story we tell about Thanksgiving, and then there is the meaning of it. At those dinners, as my mother sliced the pumpkin pie and passed around dishes of homemade almond jelly with fruit—another family tradition—she must have looked at those young students and seen herself and my father 20 years earlier, when they’d been new too. When my parents had arrived in Indiana for graduate school, they were newlyweds in a new state in a new country on a new continent, and neither of them had ever tasted cranberry sauce or turkey before. But they soon made American friends, who invited them to their Thanksgiving table. Who made them feel welcome, who introduced them to Thanksgiving dinner, who encouraged them to think of this country—and these traditions—as their own.Perhaps my parents invited those foreign students as a way of continuing that cycle, of paying forward what had once been done for them. And despite the oversimplified myth of Thanksgiving I told them, I like to think all those strangers who dined with us over the years understood something true about Thanksgiving nonetheless. That at heart this holiday is about welcoming others—especially those from far away—and making them feel at home. That there is room to acknowledge both the traditions of the place you’re in and the place you come from. That Thanksgiving dinner is a reminder to everyone— including yourself—that there is space, and goodwill, for everyone.We didn’t say any of this at those dinners, of course. We simply pressed seconds and thirds on our guests, sent them home with Tupperwares of leftover turkey and fried rice and extra slices of pumpkin pie and our phone number, and told them to call us if they needed anything at all.Celeste Ng is the author of the novels Everything I Never Told You and Little Fires Everywhere.Explore Bon AppétitFirst PersonThanksgivingRead MorecultureMy Family’s Thanksgiving Tradition? A Complete Disregard For ItBy Emma StraubcultureThanksgiving at Patti Smith's HouseBy Patti SmithcultureThank You God, for Black ThanksgivingBy Rembert BrownecultureHow Cranberry Sauce Became a Staple of My Indian ThanksgivingBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Celeste Ng"]}