{"id": "445635646fe3572aeddc32417281a6f0", "url": "https://www.bonappetit.com/story/dessert-dip-dunkaroos-for-adults", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "This Dessert Dip Is Dunkaroos For Adults | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Dessert Dip Is Dunkaroos for AdultsTurn summer fruit into a proper treat.By Lauren SchaeferJune 16, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When my favorite farm stands are overflowing with ripe peak season fruit, it feels wrong to fuss with it too much. Yet even simple summer desserts often call for more tossing, crumbling, and baking than suits my taste. What I really want at the end of a meal is a sweet something that allows whatever’s in season to shine, and this creamy dessert dip—basically after-dinner crudités—is almost always the answer.That’s right: dessert dip! A bowl of rich, lightly sweetened dairy that makes a platter of perfect cherries, strawberries, sliced plums, or any other fruit feel like a proper treat. If you want to sound fancy, you can say something about how that chocolate-flecked concoction evokes stracciatella, arguably the best and simplest Italian gelato flavor. But if you want to be real about it, you can tell everyone that they’re eating adult Dunkaroos. Either way it’s probably the easiest, most crowd-pleasing warm-weather dessert anyone could possibly ask for. Here’s how to make it:In a medium bowl, combine 1 cup cold whipped cream, ¼ cup good sour cream, 2 Tbsp. powdered sugar, and ¼ tsp. salt. (I like to add 1 Tbsp. amaro, whiskey, or rum to the mix, but I’m a great lover of boozy desserts—totally optional.) Use an electric mixer or a whisk to beat it all together until soft peaks form. Then, take a 3½-ounce bar of dark chocolate, chop it finely, and gently fold it into the dip. That’s it! Spoon it into a cute bowl, arrange some beautiful fruit around it, maybe some crunchy store-bought cookies or shortbreads for good measure, and you’re all set for a lazy, lingering post-prandial hang.I love this dessert dip setup for all the same reasons I love crudités. It’s as low-lift as it is generous, as casual as it is considered, and it allows everyone at the table to share food from the same communal platter at whatever pace works for them. And if that isn’t the whole point of a simple summer dessert, I don’t know what is.Explore Bon AppétitIt's That SimpleDessertSummer DessertsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-16", "author": ["Condé Nast", "Lauren Schaefer"]}