{"id": "44566da188402acf448b67e4b1a051e0", "url": "https://www.bonappetit.com/recipe/black-bean-chicken-torta", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "BUSH’S® Black Bean Chicken Torta Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® Black Bean Chicken TortaFacebookPinterestTwitterEmailA not-so-average torta with crispy chicken and black beans for the win.PrintIngredients2 tablespoons canola oil, plus more for frying2 (15.5 ounce) cans BUSH’S® Black Bean Fiesta4 (1 pound) chicken cutlets, pounded a ¼-inch thin1/4 cup all-purpose flourKosher salt and freshly ground black pepper2 large eggs1 1/4 cups panko4 soft fresh rolls, like kaiser½ cup sliced pickled jalapenos1 ripe red tomato, thinly sliced8 ounces queso fresco, thinly sliced¼ white onion, very thinly sliced½ cup fresh cilantro leaves1 large avocado, thinly slicedRecipe PreparationIn a medium skillet, heat the oil over medium. Add the beans and their sauce and bring to a simmer. Cook, stirring, and using the back of a wooden spoon to mash some of the beans until a chunky puree forms and the sauce is thickened, about 5 minutes.Setup a breading station. In one shallow bowl, whisk the eggs. In another, add the flour. In a third  shallow bowl, add the panko. Season chicken with salt and pepper. Coat the chicken in flour, tapping off excess. Then dip in eggs and coat with panko, patting to adhere.Heat ¼-inch oil in a large high sided heavy bottomed skillet, and add two of the cutlets. Fry the cutlets, turning halfway through until panko is golden and cutlets are cooked through, about 4 minutes. Remove to a wire rack set in a rimmed baking sheet or paper-towel lined plate and sprinkle with salt. Repeat with remaining cutlets.Slice rolls open and slather the bottom buns with the warm mashed beans. Top the beans with the pickled jalapeno, the cooked chicken cutlets, queso fresco, tomatoes, and onions. Season with salt and pepper and top with cilantro. Arrange the avocado on the cut side of the top buns and close the sandwiches.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansSandwichMexicanChicken BreastBlack BeanQueso FrescoAvocadoMainNut-FreeLunchDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}