{"id": "4457db4a90e50d94da19071e9ce1a695", "url": "https://www.bonappetit.com/story/cold-rent-week-rice-noodles", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "These Cold, Pesto-y Rice Noodles Are Incredibly Chill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Cold, Pesto-y Rice Noodles Are Incredibly ChillHot noodles? During Rent Week? In this heat? Hell no.By Alex DelanyAugust 2, 2019FacebookTwitterEmailFacebookTwitterEmailSomeone recently told me that chill is a filler word, a meaningless substitute for a more worthwhile descriptor. I understand that line of thought, but I respectfully disagree.Just because chill can mean many things, doesn't mean that it means nothing. My summer is chill. Or at least, I want my summer to be chill. Chill is falling asleep on the roof and waking up without sunburn. Chill is eating a popsicle inside, in front of the air conditioner. Chill is canceling your Saturday night drinks plans to lay on the couch with a beer. Chill is how I want a doctor’s appointment and a dinner party to be. Chill is eating a big bowl of cold, pesto-covered rice noodles when it’s hot enough outside to melt your damn face off.Which brings us to this month’s Rent Week recipe: a big bowl of cold, pesto-covered rice noodles to eat when it’s hot enough outside to melt your damn face off. It’s herb-packed, wickedly simple, and COLD, I repeat, COLD. So smash the play button on this Run Amok playlist I made for you (filled with thrashy, trashy dance tunes and free of charge) and grab some herbs.Now, when I say, some herbs, I’m being intentionally vague. The best thing about pesto is that you can swap tender herbs and greens without a second thought. As long as they’re tender (soft, not woody and stemmy), they’re good to go. Cilantro. Basil. Mint. Chives. Arugula. Carrot tops. Celery leaves. Parsley. Kale. Whatever. For this pesto, I use a combination of about 4 cups of chives, cilantro, and parsley, in whatever ratio you’d like. 1-1-1 gives you balance. You can always tip the scales in favor of the herb you like best.The pesto we’re making isn’t traditional. My Italian ancestors would likely be upset. There are no nuts or cheese, and it’s probably closer to a salsa verde in terms of ingredients. Here’s how we make it:Chop the 4 cups of tender herbs a couple times into more manageable sized pieces, leaving the stems attached. Peel 3 cloves of garlic and chop them in half. Zest and juice 2 limes. Chop 1 jalapeño or Fresno chile in half, and throw everything in a blender. If you don’t have a blender, fine. You can make this pesto by chopping all of these ingredients as finely as possible. In restaurants, they call that rustic cooking.Very, very chill.\nAdd a few pinches of kosher salt and about ½ cup of olive oil into the blender. But this is Rent Week, and olive oil is expensive. So sometimes I’ll do ¼ cup olive oil and ¼ cup neutral oil like canola or peanut. It gives you the same fattiness, but with just a bit less flavor. Blend until the pesto takes on a creamy appearance. You shouldn’t be able to see any large pieces of leaves, and the motor should run smoothly, without catching on any chunks of garlic or chile. The pesto should look rich and emulsified.Fill a saucepan with water, add a couple pinches of salt, and bring it to a boil. While you’re waiting on the water, heat a non-stick pan over medium heat and toast ¼ cup of sesame seeds. Give them a shake every minute or so, and dump them out of the pan when they’ve taken on a deep golden brown color, about 5-6 minutes.When the water comes to a boil, turn off the heat and add 8-10 oz. of flat rice noodles. I like the ones that have the approximate thickness of linguine. Turning off the heat and cooking the noodles on the residual heat of the water ensures that you won’t overcook them.When the noodles are soft with a pleasant chew, dump them into a colander and rinse them with cold water. This lowers the temperature of the noodles and removes any excess rice flour, so they won’t be as sticky. Dump the noodles into a large bowl, pour pesto over them, and mix. Don’t add all of the pesto at once though! Mix it in incrementally, so you don’t over-sauce.Once that’s lookin’ saucy and herby and downright beautiful, use tongs to plate the noodles into a shallow bowl. Top each bowl of noodles with toasted sesame seeds, grab a frigid, frosty beverage, find the most comfortable seat in your immediate vicinity, and...chill.Another chill Rent Week dinner? Eggplant dip.This Rent Week Eggplant Dip is Absolutely an Acceptable DinnerEmbrace the dip-as-dinner lifestyle, starting with this sweet and sour eggplant number.View StoryExplore Bon AppétitBasicallyRent WeekRice NoodlesPestoSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-02", "author": ["Condé Nast", "Alex Delany"]}