{"id": "446d659a925e89733b4f79c2dd25d391", "url": "https://www.bonappetit.com/story/bidet", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "This Bidet Attachment Keeps Me from Panic Buying Toilet Paper | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersshoppingStop Panic-Buying Toilet Paper and Get This InsteadThanks to this bidet attachment, I am the president *and* secretary of the Clean Butt ClubBy MacKenzie Chung FeganMarch 24, 2020FacebookTwitterEmailCourtesy of TushyFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Of all the items that my local grocery store sold out of last week—flour, eggs, good olive oil—the thing that I was least worried about was toilet paper. I strode by the decimated paper goods aisle without even a flicker of worry because I have another way to clean my butt.With the money you spent buying four months’ worth of toilet paper, you could have purchased a TUSHY. This bidet attachment snaps onto your toilet and features an adjustable nozzle that spritzes your butt with water after you do your business, drastically reducing the amount of toilet paper needed. It also leaves me feeling cleaner. Think about it: If you had something dirty on your hands, wouldn't you rather wash them in the sink than wipe them off with 2-ply paper?I’ve had my TUSHY Classic for about a year, and I warn you that pooping without it is now a misery. Unlike Toto toilets, the bidets most popular in Japan that can cost several thousand dollars, the TUSHY Classic is only $79—and you can get a 10 percent discount if you use the code TIME4TUSHY (LOL).Granted, it doesn’t have all the bells and whistles of a Japanese toilet, and while the TUSHY Spa offers a warm water option, the water from the Classic model comes out cold. (The sensation is...bracing.) But it does the trick, leaving me feeling fresher than toilet paper alone and certainly less chafed.And while Americans have historically been anti-bidet, according to Wired, TUSHY sales have increased tenfold in the last few weeks. I may be worried about a lot of things right now, but my butt isn't one of them.Buy it: Tushy Bidet Attachment, from $79All products featured on Healthyish are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishCoronavirusShoppingHealthyish Loves ItRead MoreLifestyleThe Back Massager That My Coworkers Always StealBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-24", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}