{"id": "4476977e7e53e5d4f11d8407341faad4", "url": "https://www.bonappetit.com/story/poached-fish-in-tomato-curry", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "This Poached Fish in Tomato Curry Got Me Out of My Salmon Rut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Poached Fish in Tomato Curry Got Me Out of My Salmon RutThis weeknight recipe comes together effortlessly in one skillet.By Aliza AbarbanelSeptember 18, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailLet the record show: This is the recipe that broke my salmon dependency.In my defense, I didn’t mean to limit my cooking to just one fish. But fatty, flavorful salmon is delicious and pretty easy to get right on a weeknight, whether it’s slow-roasted until lusciously tender or seared on the stovetop for shatteringly crispy skin (shoutout to the cold-pan method).To be honest, I never felt the need to branch out—until senior food editor Andy Baraghani handed me a bowl of cod poached in tomato curry. The firm-fleshed filets were meaty and decidedly not-too-fishy thanks to a punchy tomato-coconut curry perfumed with cardamom, turmeric, and chile. After a summer of eating dip for dinner, I knew this was just the recipe I needed to ease back into turning on my stove.It turns out that poaching is the ideal method for gently cooking fish, especially sturdy-but-flaky white fish like halibut  and cod. As long as the liquid is kept at a lazy simmer, you’ll get filets that are buttery and flaky, not rubbery and tough. And while you can poach in olive oil or even milk, Andy’s one-skillet recipe layers in flavor with a highly aromatic tomato-coconut curry. Think ginger, garlic, and a fiery red chile, plus crushed cardamom pods, ground coriander, and ground turmeric. (We like Diaspora Co’s single-origin heirloom turmeric and cardamom, which is ethically sourced and infinitely fresher than most spices in the grocery store.)This recipe uses cherry tomatoes, which break down quickly to help sweeten and thicken the sauce. Larger tomatoes work fine too, as long as they’re roughly chopped. Once the cod joined the skillet, I covered the pan and simmered over medium-low until the filets were opaque and beginning to flake. Then I took it off heat to prevent over-cooking and added a hefty cup of basil leaves to perfume the whole pan.This is the kind of effortless dish I daydream about serving at dinner parties, and the contrasting hues of red curry and white fish would certainly make for an impressive centerpiece. But for now, the pared-down ingredients list and soul-satisfying broth appeal most on Tuesday nights. Spooned over white rice in my favorite shallow bowl, this dish makes weeknight cooking feel do-able again.Prepare to poach:Poached Cod in Tomato CurryWe opted to use cherry tomatoes for this poached cod recipe because we like their sweetness and how quickly they collapse into a sauce.View RecipeExplore Bon AppétitHealthyishCodFishCurryCoconut CreamRead MoreLifestyleMake Perfectly Seasoned Sushi Rice and Eat It With EverythingBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-18", "author": ["Condé Nast", "Aliza Abarbanel"]}