{"id": "447abfa2fc1ae21bbbdae2522931c612", "url": "https://www.bonappetit.com/story/just-buy-it-lodge-dutch-oven", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "The Best Dutch Ovens at Every Price Point According to Bon Appétit Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingYou Need a Dutch Oven—But It Doesn’t Need to Cost $300The best Dutch ovens come at a variety of price points. Get yourself one, and you’ll use it every day for the rest of your life.By Alex BeggsOctober 19, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There was a moment I knew.I knew my Dutch oven was as necessary in my life as my collection of seasonally-appropriate bathrobes.The moment was when I started using it to make weeknight pasta. It’s when I realized that the heavy cast-iron beast wasn’t just for beef stew and other weekend projects—it was for Tuesdays.Lodge 6-Quart Dutch Oven$115 $80 at Amazon$80 at TargetI keep my blue Lodge Dutch oven (a housewarming gift from my mother-out-of-law, Cathy. Thanks, Cathy!) in this hideous wooden cabinet next to the kitchen that my “cohabitator” will NOT let me set on fire. The cabinet looks like something Paul Revere would have put in his driveway with a sign that said “FREE! PLEASE, JUST TAKE IT.” Every day I think about how it would flicker, burning into ashes, but for now, it holds a lot of gin and the Dutch oven. So it remains.Anywaaaaaay, enough about that stupid cabinet and back to my favorite kitchen workhorse. I’m here to try to impress upon you just how much you need a Dutch oven, and that—equally important—the best Dutch ovens don’t always have a $300 price tag (although, yes, some do). Let’s see what I can do.You will use it to make tender, gently simmered meaty things. Like this kimchi bacon chicken braise, a personal favorite of mine. Or this rich pomegranate lamb shank stunner. Or pot roast—how you gonna make pot roast without a pot? An enameled cast-iron Dutch oven is perfect for braises because of its heft, which helps with heat retention and distribution. It’s ideal for searing meat over high heat on the stovetop and then transferring it to the oven for low-and-slow cooking. That’s versatility. You’ll wonder how you ever got through these miserable winter months without one.Meaty.\nPhoto by Alex LauOn a related note: You will use it to brown meat before you put that meat into the Instant Pot. This is a fact of life: Better browning equals better flavor. The Instant Pot cuts out a ton of work, so take the time to get some color on your meat in a cast-iron Dutch oven, which will do it more effectively and efficiently than pretty much any other pan in your kitchen. (A cast-iron skillet will work too. See a theme here?)You will use it when you make pasta. We all (now) know that the key to glossy, better-than-restaurant pasta is adding starchy-salty pasta water to your sauce and then cooking your noodles right in there so they soak up all that sweet, sweet ambrosia. I used to attempt that in a regular old stainless-steel frying pan, and the pasta would always go everywhere, which is where the Dutch oven comes in—it’s the only vessel in my kitchen that will easily fit a pound of pasta, plus whatever I’m doctoring it up with. Sizzle a bunch of garlic in plenty of olive oil, throw some cooked pasta in there along with pasta water and a good knob of butter, stir it all around enthusiastically, and you’ll be sold on this whole Dutch oven thing after one bite.Saucy.\nNikole HerriottYou will use it to make soups. It’s huge, it makes a lot of soup. Who ever makes a small amount of soup?! Soups are about accidentally making enough to feed a soccer team, remembering you aren’t on a soccer team and don’t know anyone who is, and then freezing it for later. Goooooooal!Soupy.\nMichael Graydon & Nikole HerriottYou will use it to bake bread. One day, anyway. It’s on your list. And the Dutch oven will get preheated in a crazy-hot oven and the lid will trap steam and the even heat distribution will hit your loaf from all sides, allowing you to produce a puffy, crackly-crusted loaf of no-knead bread.Maybe the best part? You will cook things in it and then serve those things in it, straight from the oven to the table, because it’s pretty. Classically pretty, like puffy sleeves and brooches. Why get a separate platter dirty? Are you obsessed with doing dishes or something? (On that note: Most Dutch ovens, including the ones we list here, are dishwasher-safe, but we recommend hand-washing with tender love and care.) I may—OR MAY NOT—own a very specific pumpkin-shaped cocotte that I use approximately once a year, but for the entire months of October and November it decorates my mantle and doesn’t rot into mush like real (inconveniently living) gourds. Put a kitten in it! Make a photoshoot of it.Bacon-y.\nMichael Graydon & Nikole HerriottWhat are the best Dutch ovens money can buy? Down to business. I have a Lodge, which I love, but there are plenty of great options out there at a variety of price points. You do absolutely need one, so choose the one that fits your budget. The best cast-iron Dutch oven doesn’t have to cost $350—but it sure can if you want it to. Here are our recommendations:Le Creuset Signature Round Dutch OvenInto the idea of owning a piece of cookware that’ll last for generations to come? Le Creuset’s iconic Dutch (French?) ovens are genuine heirloom pieces. I’ve had mine for 10 years, my mom has had hers for 40, and I know folks using Le Creusets that have been passed down from grandparents. They’re more lightweight than competitors—which is key if you’re in the market for a 13.25 quart Dutch oven to make enough soup for your soccer team—and come with that Le Creuset lifetime warranty (most of the others mentioned here do too, but Le Creuset’s is famously generous). We use them in the Bon Appétit Test Kitchen. The downside is, of course, the price—which is partly due to the high quality and partly due to the fact that these things are still made in France, where the cost of labor is high. If you don’t have a Dutch oven and a $350 pot is not in the cards, get yourself a Misen, Lodge, or Milo and upgrade when you’re ready. Le Creusets are built to last, and no doubt when I’m 80, I’ll be using mine to stew prunes. —MacKenzie Chung Fegan, senior commerce editorLe Creuset 5.5 Quart Dutch Oven$340 $314 at AmazonLodge Enameled Cast-Iron Dutch Oven My trusty Lodge works just as well as one of those fancy Dutch ovens with the sexy-sounding French names, but it costs a third of the price. With a shiny, smooth, nonstick enamel finish—which is just as practical as it is pretty—this thing is all about functionality, baking, braising, sautéing, and roasting food perfectly. I appreciate its slightly curved base, which makes for easy stovetop stirring, and its wide loop handles, which allow me to maneuver confidently from oven to table. Could you splurge on one of those pricey Dutch ovens? Suuuuuuure. But do you need to? Absolutely not. —Alex Beggs, senior staff writerLodge 6-Quart Dutch Oven$115 $80 at Amazon$80 at TargetStaub Enameled Cast-Iron Round Dutch OvenStaub cast iron Dutch ovens are another fan favorite among home cooks and chefs alike—including the test kitchen, where they are used side by side with Le Creusets. Unlike the Lodge and Le Creuset, the Staub Dutch oven has a matte-black enamel cooking surface with traces of quartz so it won’t discolor and provides extra heat conduction for better browning—ideal for searing meat and caramelizing veggies. The black interior, however, does make it more difficult to assess if you’re a minute away from burning that nice fond. It also has a heavy-duty, tight-fitting lid that’s equipped with little bumps along the underside to guide all the evaporated juices back down onto the food—expect less evaporation than a Le Creuset. Staubs are still investment pieces, but they’re a little less expensive than the other French guy, and you can find good sales if you keep an eye out. —Tiffany Hopkins, commerce writerStaub 5.5 Quart Cocotte$464 $307 at Amazon$360 at NordstromMisen Dutch OvenYou might be familiar with Misen knives (its bread knife is a favorite), but the DTC company has expanded into cookware too. Their Dutch oven is durable, well made, and reasonably priced. While the sides of a Le Creuset or Lodge Dutch oven meet the bottom at a gentle slope, Misen’s base is more angular, which frees up surface area for browning but does make it a tad tricker to get into the corners with a spoon. The high sides contain grease splatters better than competitors, and the generously sized handles mean you don’t have to worry about a heavy pot of stew slipping from your oven mitts. Choose between a regular lid and one that doubles as a grill pan—a cool feature, but trickier to remove from the pot when hot. Misen’s Dutch oven only comes in 7- and 9-quart feed-a-crowd sizes, so if you’re looking for a smaller (or lighter—the 7-quart clocks in at around 17 pounds with the lid) cast-iron pot, look elsewhere. —M.C.F.Misen 7 Quart Dutch Oven$165 at MisenMilo by Kana Classic 5.5 Quart Dutch OvenThe chic, modern Milo by Kana Classic Dutch oven is not your granny’s cookware—but it performs just as well. With a minimalist feel, this simple enameled cast-iron Dutch oven comes in rich hues like navy and emerald. Both of those colorways, plus the matte black, sport a dark enamel interior like Staub pots; opt for the white Milo if you want light-colored enamel coating like a Le Creuset. Heavier than a Le Creuset but lighter than the Misen, the Milo Dutch oven is made of 40% recycled cast iron. This is the type of cookware you store on open shelving for everyone to see. —T.H.Milo by Kana 5.5 Quart Dutch Oven$135 at Amazon$135 at KanaFYI, here’s how to clean it:Explore Bon AppétitBA RecommendsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-27", "author": ["Condé Nast", "Alex Beggs"]}