{"id": "448427daa7f8eb91845c9cb7949fbcbe", "url": "https://www.bonappetit.com/story/homemade-sweet-and-sour-sauce", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "My Mom Wouldn't Give Me Her Sweet and Sour Sauce Recipe, So I Made Up My Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mom Wouldn't Give Me Her Sweet and Sour Sauce Recipe, So I Made Up My OwnNot too sweet, not too gloppy, and made with ingredients you already have in the fridge. By Hetty McKinnonDecember 12, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Kat BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where staffers and contributors talk you through the process of making the dishes and drinks that they can make with their eyes closed.As a child, our Sundays were reserved not for worshipping but for eating. After piling into my dad’s orange Ford sedan, we'd head to Sydney’s Chinatown for dim sum, where we would commit various acts gluttony. I was a rabid adolescent, ravenously gobbling up all the dumplings, steamed rice rolls, and baos. For me, dim sum was a near perfect dining experience—except for the cloying, viscous, bright red sauce that would invariably ruin my deep-fried wontons. The sweet and sour sauce of my childhood tormented me: Sickly sweet and unnaturally fluorescent, it felt so at odds with big, bold, savory Chinese flavors that I knew so well.A few years ago, I felt that it was my cultural responsibility to reconcile with this iconic Chinese sauce. I called my mom in Australia to talk about her sweet and sour sauce recipe, which I remember as decidedly less sugary than the versions served in restaurants. She has never been a great sharer of recipes, but she did give me two personal tips which I immediately incorporated into my own sweet and sour sauce recipe: Add a good amount of ketchup, and also a little garlic.While ketchup is used in many modern sweet and sour sauce recipes, it is not considered a “traditional” ingredient. Paging through old English-language Chinese cookbooks from the ‘70s, of which I have somehow amassed quite the collection, I saw that recipes call for wild and wonderful things like crabapple sauce, canned pineapple juice, and pickled gherkins to impart that signature funky sweetness. Honestly, however, ketchup is a workhorse ingredient—it really does possess all the tangy sweetness that we are looking for in sweet and sour sauce.Now onto the garlic. While most sweet and sour sauce recipes don’t include it, I find that it’s actually the essential ingredient. Garlic imparts that elusive note of savoriness that so often makes food more delicious. In sweet and sour sauce, it tempers the sweet, brightens the sour, and introduces an emphatic umami note that brings everything into balance.For my sweet and sour sauce, all you need are ingredients you probably already have at home (and there’s certainly no red food coloring). Here’s how I make it: In a small saucepan, combine  ¼ cup of white sugar,  2 tablespoons apple cider vinegar (I like the fruitiness of cider vinegar, but most recipes use rice or white vinegar), 2 tablespoons of tamari (you could use soy sauce here, but I like tamari because it’s less salty and gluten-free), ¼ cup of ketchup, 1 grated or minced clove of garlic, and ¼ cup of water. Place the pan on low heat and stir the mixture until it comes to a gentle boil. Reduce the heat to the very lowest setting possible while you prepare the cornstarch slurry.What is a “cornstarch slurry” you may ask? It’s basically the magic potion that thickens up a dish, and it's often used in Asian cooking. It’s not as fancy or mysterious as it sounds: It’s simply a combination of cornstarch (you could also use potato or tapioca starch) and water. For my slurry, you will need to whisk 1 tsp. cornstarch together with 2 Tbsp. cold water until it's dissolved (this is a very small amount of cornstarch compared to many recipes you might come across, as I prefer my sauce on the runnier side, with zero gluggliness!), and then slowly stir it into the sauce (the stirring is the key to ensuring a smooth sauce). Cook on low heat for another 2 minutes or so, until the sauce looks thick.Decidedly less fluorescent than the stuff you get in the bottle! \nPhoto by Alex Lau, Food Styling by Kat BoytsovaOf course, sweet and sour sauce can used in traditional ways—add it as the last step of a stir-fry or use it as a dip for deep-fried wontons or egg rolls—but in my everyday cooking, I’m most often using sweet and sour sauce as a dressing that pairs perfectly with roasted vegetables, and in particular, cauliflower. I’ll roast the cauliflower florets until they are golden and earthy sweet, and then toss through noodles (instant ramen works well here), or my favorite grain (usually a 10-minute farro), along with slivers of red bell pepper, a scattering of sesame seeds, and big handfuls of cilantro and scallions. It's a perfect little dish to show the sweet, sour, and savory side of this classic Chinese sauce.Hetty McKinnon is an Australian food writer, recipe developer, and cookbook author living in Brooklyn.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-12", "author": ["Condé Nast", "Hetty Mckinnon"]}