{"id": "4494a27aeb1e9a4baec4d4bba24cf6eb", "url": "https://www.bonappetit.com/story/klean-kanteen-containers", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Love Hiking? Hate Lugging Heavy Stuff? You Need These Food Containers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLove Hiking? Hate Lugging Heavy Stuff? You Need These Food ContainersThey’re light, leakproof, and indestructible.By Ali FrancisJune 24, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah Morton, Prop Styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.As an outdoors enthusiast I can get down with the whole survival skills thing. I’ve learned to substitute supple leaves for forgotten toilet paper, boil murky pond water when my enormous bottle inevitably runs dry, and concoct shoelaces out of fishing line.What I can’t get down with is “hiking” food; many a fiber-devoid day have I spent grazing mournfully on Slim Jims and watery cans of tuna. I’ve tried packing grainy salads, loaded sandwiches, and hearty homemade trail mix, but the problem is that those need to be contained—and containers come with their own set of problems. They’re usually (a) made of plastic, which is notoriously unkind to Mama Nature (my host!), or (b) glass, which is both liable to shatter and heavier than I’m interested in lugging about the wilderness. I assumed I was doomed to salty, processed purgatory—that is, until I found this stainless-steel food box set from Klean Kanteen.Photo by Isa Zapata, Styling by Nicole LouieKlean Kanteen Lunch Box Set$60 at Klean Kanteen$60 at BackcountryMaybe you’re thinking what I was: Oh, please, how much difference will a new container make? Turns out, a lot! These are both remarkably sturdy—I stood atop the largest size like a ballerina in arabesque without leaving a dent—and seriously light. According to my very unscientific scale (my…two hands), the stainless steel was barely heavier than a plastic container of relative size. It’s a burden I’m happy to bear for the sake of greater durability, longevity, and sustainability (85% of stainless steel produced is recycled, compared to only 9% of plastics).Honestly, though, I’d recommend switching to these containers even if you are an environmental nihilist, have enough abdominal strength to lug four mason jars of homemade tomato sauce up a mountainside, or are just looking for a new lunchbox. Klean Kanteen’s boxes are built with your fridge in mind; they’re perfectly stackable and symmetrical, like little food-filled Legos. Plus, imperative when jostling around in a backpack or your back-to-the-office bag (!), all three sizes come with leakproof, silicone-trimmed lids—and both the 20- and 34-oz. containers feature secure, snap-lock tabs. (So secure that not a drop came out when I filled them with water and shook them about like maracas.)Regarding their (lack of) transparency, I do, on occasion, forget what I’ve stored in them. Did I pack the fried rice or the farro salad today? But it never matters. In lunch as in hiking, the view is always that much better when you don’t see it coming.Explore Bon AppétitShoppingHighly RecommendCampingSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-24", "author": ["Condé Nast", "Ali Francis"]}