{"id": "44b4eb046cba65ecda9056b51f8dfc2e", "url": "https://www.bonappetit.com/story/hella-cocktail-co-bitters-and-soda", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Hella Cocktail Co.’s Bitters and Soda Is My New All-Day Beverage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHella Cocktail Co.’s Bitters & Soda Is My New All-Day BeverageIt’s fizzy, bitter, and blissfully booze-free.By Allie WistSeptember 4, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I find myself drinking Hella Cocktail Co.’s Bitters & Soda at 10 a.m. and 10 p.m., at home and in the park and at the beach. It’s exactly what it sounds like: seltzer with a heavy dash of bitters. But I like to think of it as a deeply aromatic adult soda, a nonalcoholic spritz for lovers of amaro, radicchio, and IPAs, as well as bitter converts like myself. Like many Americans, I haven’t always appreciated bitterness, but as many non-Western cultures have long been aware, it’s a beautifully rich taste in its own right, just as delightful as umami and sweetness.Hella Cocktail Co. cofounder Jomaree Pinkard and his team have been waiting for years for an audience that would appreciate their ready-made version of that familiar sober-curious drink. As he observed Western palettes shifting slowly toward this, and as more drinkers began flirting with low-ABV and nonalcoholic beverages, Pinkard and company finally decided to put these products on the market this summer. They tinkered with 67 different recipes until they arrived at these two versions: Dry Aromatic, a purely bitter seltzer with clove and woodsy flavors, and Spritz Aromatic, a sweeter version with a bit of sugar to complement the bitterness.The drink is strangely comforting in its complexity. You taste new flavors with each sip. More chamomile, perhaps a bit of orange peel, I’ve noticed. “People’s palettes tend to pull out notes that are familiar to them,” Pinkard told me over the phone. “If your grandma used cloves, you might pull that out of the drink. If you have memories of allspice growing up, maybe you’ll notice that. Depending on where you are from or what you cook with, you’ll have a different experience.”These days I find myself going through the Dry Aromatic Bitters & Soda like La Croix. It’s wildly refreshing in the heat and revives me during the aeonian cycle of quarantine workdays. It’s a complex and earthy addition to the seltzer market—and to my fridge.Hella Cocktail Co. Bitters & Soda$30 at Amazon$30 at Hella Cocktail Co.Explore Bon AppétitHighly RecommendBittersSodaShoppingRead MorecultureTweezer Tongs Are the Superior TongsBy Sohla El-WayllycultureOmsom Asian Seasonings Have a Whole Lotta Flavor and a Whole Lotta CredBy MacKenzie Chung FegancultureI’m in Love With This Mustard, Partly Because of Its Name, Mostly Because It’s Just So GoodBy Amiel StanekcultureThis Apple Cider Vinegar Has Changed My Salad Game for GoodBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Allie Wist"]}