{"id": "44ecd08a278158ff5c6558036eb4f760", "url": "https://www.bonappetit.com/recipe/shrimp-and-linguine-with-piccata-compound-butter", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Shrimp & Linguine with Piccata Compound Butter Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesShrimp & Linguine with Piccata Compound Butter1 RatingFacebookPinterestTwitterEmail4 servingsThis incredibly easy recipe has everything you need for a perfect weeknight dinner. We're talking flavorful seafood and pasta with one of our favorite ingredients: butter!PrintIngredients1 lb. dried linguine1 stick salted butter, at room temperature3 Tbsp. fresh parsley leaves1 large lemon20 oz shrimp, peeled and deveined2 Tbsp. salted butter3 Tbsp. capers4 garlic cloves1/2 cup dry white wine1 tsp. crushed red pepper flakesRecipe PreparationZest and juice a large lemon. Roughly chop capers. Pull apart parsley leaves and roughly chop. Set aside.Combine 1 stick of salted butter and all other ingredients, besides the lemon juice, together in a medium bowl. Mash the mixture with the back of a wooden spoon. Add lemon juice 1 tsp at a time until just incorporated but not wet, about 1 Tbsp total. Then, cover with plastic wrap and chill.Add salt to large pot of water and bring to a boil. Cook linguine to al dente package directions. Drain pasta, reserving 1/2 cup of the pasta water.While the pasta cooks, season shrimp with salt and pepper.Chop 4 cloves of garlic.In a large Dutch oven, melt the 2 Tbsp of salted butter on medium-low heat. Add garlic and sauté until just fragrant, about 1 minute. Add the white wine, red pepper flakes, and several cracks of black pepper. Bring to a simmer and cook until wine is reduced by half, 2-3 minutes.Once the wine is reduced, add the shrimp in an even layer and cook, stirring occasionally, until just opaque, 2 to 3 minutes.Add the cooked linguine to the shrimp. Add the prepared piccata butter in evenly distributed dollops. Then, add ¼ cup of pasta water.Toss vigorously with tongs until creamy and emulsified, adding more pasta water a bit at a time if needed. Season with salt and pepper to taste.Divide between four plates.Garnish with the reserved parsley, freshly cracked pepper, and serve.Recipe by American Butter InstituteRelated VideoShrimp & Linguine with Piccata Compound ButterReviews SectionReviewsWrite a review…This was incredible! One of my most popular dishes (: we even replaced the shrimp with chicken for my boyfriend and he loved it! That compound butter and the lemony zing are fantastic. Thanks!AnonymousMontreal06/10/21GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2021-10-06", "author": ["American Butter Institute"]}