{"id": "44fe054bc31f5972fa441350442cfbff", "url": "https://www.bonappetit.com/story/make-ramen-noodles-angel-hair", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "This Ramen Noodle Hack Turns a Box of Long Pasta into Chewy, Springy Ramen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Approximate Springy, Chewy Ramen Noodles With a Box of Angel HairUse them to make a bowl of refreshing hiyashi chuuka.By Chihiro TomiokaAugust 19, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEven in the worst summer heat, cold noodles in a vinegary dressing are refreshing enough to spark my appetite. Take a look at my byline and call me biased, but some of my favorite noodles are Japanese: soba, udon, somen. Quickly boiled and dressed with some scallions, grated ginger, store-bought tsuyu, and a handful of ice, it’s dinner in 10 minutes. There’s nothing easier and there’s nothing better.But I don’t always have the requisite noodles on hand, and maybe you don’t either. At times like these, I suggest surveying that stock of pasta you may have supplemented during February’s COVID-19 shopping spree to check for a box of the long, thin variety. With this, you can approximate the noodles for the popular summer dish hiyashi chuuka (a.k.a. reimen, if you are from western Japan like me).In a popular hack that’s been espoused by many a Japanese cooking blog, regular semolina pasta is boiled with baking soda to make an excellent substitute for the bouncy, chewy noodles known as chuukamen. Chuukamen is the general term used to describe an array of (what Japanese consider to be) Chinese-style noodles (chuuka = Chinese-style and men = noodle). You have seen chuukamen as the yellow noodles in ramen, yakisoba, and the aforementioned hiyashi chuuka.These defining characteristics boil down (ha!) to the use of highly alkaline water (kansui) in the wheat-based chuukamen dough, which makes the chuukamen yellow and springy. (It is this kansui and the wheat flour that defines chuukamen.) Thus, adding alkaline baking soda into the boiling water allows the pasta to mimic the texture and color of chuukamen. You can play fast and loose with the quantities here, but start with this: one generous handful (100 grams) of cappellini (any long shape will do, but cappellini best mimics the thickness of the most conventional chuukamen noodles), 1 tablespoon of baking soda, 1 tablespoon of salt, and 1 liter boiling water (that’s about 4 cups). Boil per the package instructions until pleasantly chewy and bouncy. Here’s the important step: Rinse your noodles thoroughly to wash off the excess baking soda. After that, you’re good to go.This recipe is a riff on hiyashi chuuka, with tons of tender summer veg.\nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaI like to throw my rinsed noodles into a bowl filled with ice water while I cobble together some toppings from my fridge. For the popular and classic preparation that is hiyashi chuuka, top a pile of chilled noodles with julienned cucumber, egg crepe, ham, and poached shrimp (if you’re fancy) before dousing it in a sesame dressing. This is a summer menu special so popular at ramen restaurants that my brother, who worked at the one housed in the Mitsuwa supermarket in Edgewater, New Jersey (where it is adorned with char siu pork in lieu of ham), still blanches at the memory of having to prepare it in rapid succession.But my scavenger hunt often leads to a clean-out-the fridge version of hiyashi chuuka that strays a bit from the classic described above. I approximate an easy dressing by crushing toasted sesame seeds into premade tsuyu and doctoring it with sugar, rice (or apple cider) vinegar, grated ginger, and sesame oil. It’s meant to be easy and flexible, so if I’m out of tsuyu, I sub in soy sauce. Toppings might include strips of tofu, tamagoyaki, radishes, cucumbers, and even kimchi if I’ve got it. (If you need some more inspiration, look here and here.)Like any bowl of noodles, hiyashi chuuka is endlessly adaptable to any topping or dressing. And when the weather gets cold, the alkalized noodles also adapt well to soups and broths like that ultimate classic, ramen. It’s truly a noodle hack for the ages.Chihiro Tomioka buys chocolate chip ice cream for the chocolate chips and has written about all things Japanese at Food52.Explore Bon AppétitJapaneseNoodleRamenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-19", "author": ["Condé Nast", "Chihiro Tomioka"]}