{"id": "45228797e9353a12d41ed6ed7c0878fe", "url": "https://www.bonappetit.com/recipe/gluten-free-carrot-cake", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Gluten-Free Carrot Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGluten-Free Carrot CakeBy Chris MoroccoNovember 12, 20214.6(143)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintAlmond flour is a wonderfully sweet, nutty complement for fresh carrots, walnuts, and raisins. If you can’t find it, though, here’s a trick: Use 2¼ cups whole almonds and pulse them in a food processor along with salt, baking powder, all three spices, and baking soda until very, very finely ground.Ingredients8–12 servingsCake½cup virgin coconut oil, melted, plus more for pans3cups almond flour, plus more for dusting pans1½tsp. kosher salt1tsp. baking powder1tsp. ground cardamom1tsp. ground cinnamon1tsp. ground ginger½tsp. baking soda5large eggs1¼cups (packed) dark brown sugar1tsp. vanilla extract10oz. carrots, peeled, coarsely shredded, squeezed firmly to expel excess water¾cup shredded unsweetened coconut¾cup walnuts, finely chopped½cup golden raisinsFrosting and Assembly8oz. cream cheese, room temperature½cup (1 stick) unsalted butter, room temperature1¼cups gluten-free powdered sugar⅓cup Greek yogurt1tsp. vanilla extractPinch of kosher saltPreparationCakeStep 1Preheat oven to 350°. Grease two 8\" parchment-lined round cake pans with oil, then dust with almond flour, tapping out excess.Step 2Whisk salt, baking powder, cardamom, cinnamon, ginger, baking soda, and remaining 3 cups flour in a medium bowl.Step 3Using an electric mixer on medium-high speed, beat eggs and brown sugar in a large bowl until more than tripled in volume and mixture holds a ribbon for several seconds when drizzled over itself, 5–7 minutes. (Beating the eggs thoroughly in this stage goes a long way toward creating an aerated, light crumb, which is critical when using gluten-free ingredients.) Beat in vanilla.Step 4Toss carrots, coconut, walnuts, raisins, and remaining ½ cup oil in another medium bowl.Step 5Reduce mixer speed to low. Add flour mixture in 3 additions, alternating with carrot mixture in 3 additions, to egg mixture, beating well after each addition.Step 6Divide batter between prepared pans. Bake cake until lightly browned across the top, a tester inserted into the center comes out clean, and the top springs back when gently poked, 33–36 minutes. Let cool 10 minutes. Carefully run a knife around edges of pans to release cake, then invert onto a wire rack. Let cool completely.Frosting and AssemblyStep 7Using electric mixer on medium-high speed, beat cream cheese and butter in a large bowl, scraping down as needed, until very smooth, about 2 minutes. Reduce mixer speed to low and add powdered sugar. Beat until combined. Add yogurt, vanilla, and salt and increase speed to medium-high. Beat, scraping down occasionally, until light and airy, about 4 minutes. Chill 10 minutes if needed to stiffen slightly to a spreadable consistently.Step 8Arrange one cake round domed side down on a large plate or platter. Cover top and sides with one-third of frosting. Top with remaining cake layer, domed side up. Coat top and sides with remaining frosting.Step 9Do Ahead: Cake can be made 3 days ahead. Cover with a cake dome and chill.How would you rate Gluten-Free Carrot Cake?Leave a ReviewTell us what you thinkReviews (81)Back to TopTriangleThis cake is divine.  Absolute perfection.  Tremendously moist, and fabulous flavor.  I never got around to making frosting but instead popped one layer in the freezer and sliced the other to eat unadorned.  Jody SymulaRichmond, VA3/4/2022If you, like me, forget the oil--don't despair! How could it be more perfect than it is without it? The coconut oil I found was ten years past its best-by. date, and, distracted, I just forgot about finding an alternative (though a nagging feeling thatI'd missed something finally blossomed, after the quite beautiful cake was out and cool, into realization I'd left out oil). It really is the best carrot cake I've ever made.AnonymousPortland, Orefon1/21/2022To the reviewer below—\n\nSharon! Never fear, love! This is the One True Carrot Cake—a masterpiece. It is in no way dry—for me it is totally moist. I will be eternally obsessed with this recipe, I can’t believe how perfectly it comes out. \n\nTry using finely chopped dried cherries instead of golden raisins! It’s become my gold standard. Chris ZaneLouisville, KY12/23/2021Have not made this yet. The picture looks bone dry! It hardly seems like 10 ounces of carrots is enough… Is this just a spice cake really with a few carrots in it? My other recipe has 3 1/2 cups of carrots.SharonDenver12/12/2021I've made a lot of carrot cakes - including Claire's. And I must say, as surprisingly as it is considering this is gluten free and doesn't really require any sort of carrot soak or anything to soften the carrots...this is the best carrot cake recipe I've ever made, and the one I go back to the well to each and every time now. Even the frosting - don't skip it. The greek yogurt gives it this airy, whipped, light texture and is instantly a hit with anyone whose tried it. \n\nThis recipe does great as cupcakes.erikaAustin, TX12/5/2021I made them into cupcakes - phenomenal recipe!ClaireSeattle, WA11/17/2021Can I use almond meal instead of almond flour....and honey instead of sugar??EktaAustralia 9/27/2021Most amazing carrot cake I’ve ever made! As good as any from a high-end bakery, too. I swapped out canola for coconut oil because I just don’t like coconut oil. I used spray to grease the pans and the parchment. I didn’t dust them with almond flour, and cakes released beautifully. I also had to use regular raisins because the store was out of golden raisins (supply chain issues?). I followed others’ advice to refrigerate the frosting before use and it was perfect — thin, but easy to work with and fully covered the cake. Jill Chicago, IL9/6/2021I loved this cake and so did the rest of my family. It is  such a favourite that it is our chosen cake for my moms 85th birthday, tomorrow. I haven't done a lot of baking since I was a child so the video of Chris making the cake was a life saver. The cake turned out perfect the first time!\nThis GF recipe is good for people with gluten allergies , because gluten is bad for them:(  AnonymousSundre Alberta7/31/2021The best carrot cake I ever made 😋Natalia080817/20/2021The flavor is good and the cake is moist but I too had a disaster because coconut oil and almond flour are NOT the best way to prepare a pan.  the  cake stuck to the pan.  I would HIGHLY recommend oil then a round of parchment paper.   The cake has to be handled delicately.  4 stars because of the pan.  Somehow I cannot deselect the fifth star.RaayaNew York6/11/2021I LOVE this recipe!  I made it a couple years ago for Easter for my family.  Being gluten free, I miss a good carrot cake (my gram made the best one!).  This was the closest to her recipe and it was just perfect.  I did not make the frosting, as I love my grandma's.  I think a simple, traditional cream cheese frosting is perfect with this carrot cake.  No need to get all fancy adding extra ingredients.  I'm excited to make it again for this easter.  This time I am trying it in individual bundt cakes!AnonymousVa Beach3/30/2021What do you say it’s more healthy because it has no gluten? There is no scientific proof that gluten is bad. It’s just make believe. Take your responsibility!!!J2/6/2021I’ve made this cake three times now, the first two times I forgot to squeeze extra moisture out of the carrots. This time around I squeezed a fair amount of juice out and my conclusion is I like the cake better without squeezing the carrots. Either way, this is a fantastic recipe. Steph Canada1/22/2021AMAZING! This cake is moist, light, and sweet but not too sweet. The icing is DELICIOUS. I added extra cardamom by accident, and I'm glad I did! Made this for my birthday and couldn't have asked for a tastier cake. Thanks, BA! Sophia IdunPhiladelphia, PA12/31/2020Explore Bon AppétitCakeDessertCarrotVegetableAlmond FlourFlourCream CheeseCheeseEasyGluten-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Chris Morocco"]}