{"id": "452e4eee41a9adbc8c5458374f731e99", "url": "https://www.bonappetit.com/story/freeze-dried-fruit", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Freeze-Dried Fruit Adds Huge Fruit Flavor to Baked Goods and Desserts, From Cookies to Ice Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFreeze-Dried Fruit Adds Huge Fruit Flavor No Matter the SeasonEven when fresh strawberries are here, I'm reaching for the freeze-dried stuff.By Mehreen KarimMay 26, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailWhen I crave the zing and zest of summer desserts but don’t have access to fresh fruit, I turn to the freeze-dried versions. These weightless dehydrated fruit pieces span all seasonal produce, from dragon fruit to raspberry, and pack a super-concentrated, all-natural flavor without introducing additional moisture.My mom understood the draw of freeze-dried fruit long before I did. In the early 2000s, I would watch her perform the ultimate labor of love as she meticulously identified and extracted freeze-dried strawberries from giant bags of Special K Red Berries. Three or four bags of berry-less cereal later, she was left with a collection of crisp and pungent strawberry slices she’d blitz up and then incorporate into a dessert of her choice (strawberry Rice Krispies treats, to be clear).Twenty years later, both the demand for and availability of freeze-dried fruit is higher than ever. That means it’s easier to make creations that taste intensely of your fruit flavor of choice, no matter the season and without harming any bags of cereal in the process. So what is freeze-dried fruit and why should you keep a bag in the pantry? Read on!What is freeze-dried fruit exactly?Imagine an apple slice. Imagine that apple slice gets frozen to preserve its peak flavor and physical integrity. When deeply frozen, our apple slice is placed in a low-pressure vacuum, where its ice crystals sublime (that is, turn directly into water vapor). Not only does this process remove much more moisture than traditional drying, but it also does a great job of maintaining the fruit's original flavor, sweetness, and shape—only now it’s crispy, like astronaut food. Your imaginary apple slice has just been freeze-dried.Why should I opt for freeze-dried fruit over the fresh stuff?Freeze-dried fruits (let’s call them FDF) provide one of the easiest and most accessible ways to incorporate natural fruit flavors into your desserts. Once you have your hands on a bag of freeze-dried fruit, you can throw it into a food processor or pound it into a powder with a mortar and pestle and you’ll be left with a magic concentrated powder ready to be incorporated into a dessert of your choice.“It’s like adding cocoa into cookies!” says dessert mastermind and cookbook author Erin McDowell. Not only is it simple to use, but it also opens up your dessert flavor options ten-fold. Instead of limiting your fruit options to seasonal availability, you can widen your selection to fruits. Mango lassi cookies outside of mango season, anyone?But greater access to out-of-season fruit isn't the only advantage of FDF. Compared to fresh fruit, purées, and jams, FDF has no moisture content or added sugars that could irreparably alter the moisture levels and texture of your bake—especially since you would need to add a considerable amount because fresh fruit flavor is less potent. Since freeze-dried fruit is powdered, you don’t have to worry about it watering down your recipe, nor do you have to account for added sugar (the way you would with fruit jam). Bonus points for FDF: It’s so concentrated in natural color, it will also dye your desserts stunning shades of the rainbow.Alright, so when should I use freeze-dried fruit powder?Since it’s a powder, we recommend mixing it into the dry ingredients for things like cookie doughs and cake batters. It’s a great addition to no-churn ice creams that you don’t want to dilute with fruit purée. And if you’re craving a hit of berry goodness in your morning bun, feel free to stir some freeze-dried blueberry in the sugar filling—you may have just invented a heavenly cross between blueberry muffins and breakfast buns!Cookbook author Heidi Swanson vouches for raspberry powder for her Rye-Raspberry Cookies in her new book Super Natural Simple. “The flavor is direct and doesn’t get lost,” she says. “You can play with texture as well—leaving the berries in chunks, or crumbling them to dust. Raspberry purée did not work at all here.”That layer of pink is thanks to freeze-dried raspberry powder!\nPhoto by Emma Fishman, Food Styling by D'mytrek BrownLast but definitely not least, freeze-dried fruit powders function beautifully in dessert toppings, glazes, and frostings. Like this strawberry cream cheese frosting Sarah Jampel slathers in between vanilla cake layers. *Heart eyes.* For tropical glazed donuts and miraculously fruity macaron fillings, FDF has you covered. And if you’re not much of a baker, un-pulverized FDF will make for an all-natural crunchy topping for oatmeal or a stellar smoothie mix-in when your favorite berries are out of season.What should you keep in mind when using it for the first time?If you’re feeling nervous about your newfound FDF powers, start with something forgiving like basic sugar cookie dough—a few tablespoons of FDF powder won’t irreparably alter it. I had my first freeze-dried strawberry success when I mixed a few tablespoons into some Basque burnt cheesecake batter, resulting in a strawberry-marbled masterpiece. FDF powder won’t complicate any of these bakes but it will impart all its fruity flavors and color in the final product.Remember: A little does go a long way! After pulverizing a bag or two of freeze-dried cherries, for example, you’ll end up with close to 6 Tbsp. powder—and that’s a lot! Have fun experimenting with different ratios in your bakes. I typically use 3 Tbsp. powder in a batch of a dozen cookies, depending on how concentrated I want the flavor. If you’re looking forward to FDF’s vibrant colors, keep in mind that different fruits will dye your foods various shades depending on how much you use. You can expect brilliant magentas and violets from freeze-dried dragon fruit, blueberries, and plums, but strawberries may not provide the brightest shade of pink you’re hoping for (more like a muted red).As versatile as FDF powder is, I’ve successfully ruined a custard or two by haphazardly throwing in freeze-dried strawberry powder and letting it boil with the rest of the ingredients. The end result was gloppy and tasted of stale fruit cereal. Beware of cooking FDF down with liquids (as for pastry cream or any other stovetop custards). After troubleshooting with Erin McDowell, she informed me that my custard might have interacted with the proteins and fibers in the strawberry powder, causing them to seize up and potentially dim the bright strawberry flavor. Duly noted.Where do you buy it? Can you make it if you can't buy it?Unlike during my mom’s cereal box days, many varieties of freeze-dried fruits are available on the shelves of grocery store chains such as Kroger, Trader Joe’s, Target, Whole Foods, and other usual suspects. If you’re looking for less-common varieties like dragon fruit or plums, you might want to check out health food stores or online retailers like nuts.com.The internet suggests that you can make FDF, but I err on the side of caution knowing that our home kitchens probably can’t yield the same results as industrial equipment.Storing Tips: Because FDF is completely depleted of water, any moisture could make your powder clump up, so be careful about leaving its lid open in humid environments. I recommend storing your leftover powder in an airtight jar. It should be good to use for at least 3–5 months, depending on how airtight and moisture-free the environment.Explore Bon AppétitFruitBakeBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-26", "author": ["Condé Nast", "Mehreen Karim"]}