{"id": "4546955eb6e2dabf039600b942da100d", "url": "https://www.bonappetit.com/recipe/fried-eggplant-sandwiches", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Fried Eggplant Sandwiches Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesFried Eggplant Sandwiches3 RatingsFacebookPinterestTwitterEmailFor the cook who needs a veggie break––and a delicious fix.PrintIngredientsFried Eggplant Sandwiches1 large eggplant (about 1 pound), trimmed and cut into scant 1/2-inch roundsKosher salt, freshly ground pepperVegetable oil, for frying2 large eggs1/3 cup flour1 ½ cup panko-style breadcrumbs4 tablespoons Parmesan cheese4 sesame seeded hamburger buns, splitOne 24 oz. jar Rao’s Homemade Tomato Basil sauce, warm8 thin slices provolone cheese (4 ounces)1 cup fresh basil leavesRecipe PreparationInstructionsSeason eggplant slices evenly with salt and pepper. Arrange on a paper towel-lined baking sheet and let sit 15 minutes.Meanwhile, heat ½-inch of oil in a large heavy-bottomed pot to 350°. Whisk eggs in a shallow bowl, place the flour in another shallow bowl, and the panko in another.Pat eggplant dry, pressing between the paper towels to remove excess moisture. Dredge eggplant in flour, tapping off excess. Dip in eggs; coat with panko, patting to adhere.Working in batches, carefully fry eggplant in oil, maintaining the temperature at or around 350, until the eggplant is tender and the crust is deep golden brown and crisp on all sides, about 7 minutes, turning halfway through. Transfer to a wire rack to cool, season immediately with salt and sprinkle with parmesan. Repeat with remaining eggplant.Preheat the oven to broil with a rack in the top third. Arrange the buns cut side up on a rimmed baking sheet. Broil until golden about 3 to 4 minutes. Remove the top buns to plates.Spoon a tablespoon of Rao’s Homemade Tomato Basil sauce over each bottom bun and stack one eggplant slice on top of the sauce. Spoon another tablespoon of sauce over each eggplant slice. Top with another eggplant slice and spoon another 2 tablespoons on top of each slice. Top with provolone cheese and broil until cheese is golden and bubbly, about 3 to 4 minutes.Top with basil and close the sandwich. Serve with extra warm tomato basil sauce.Recipe by Rao’s Homemade®Reviews SectionReviewsWrite a review…This was great! Eggplant was crispy on the outside and tender in the middle.  We made our own tomato basil sauce instead of using jarred.  The sandwich was really tall with two slices of eggplant, so we ended up eating it with knife and fork.AnonymousJonesville, MI01/23/22Made this last night and we all loved it!  Burned the first batch of buns - 3-4 minutes under the broiler was way too long.  Everyone thought it could be a bit spicier-next time will use Rao's spicy tomato sauce.  But the eggplant was crispy outside and melty inside.  My daughter said she could eat these once a week!  Will definitely make again.AnonymousMinnesota06/22/21Wrong!  The first frying should be at 300º.  Then let the slices drain on paper towel and refry at 350º.  This is the same idea as double fried potatoes and raises the dish to amazing heights.  And you should mix in both Parmesan and Pecorino Romano cheeses in with the Panko.  Do this and you will have the eggplant sandwich of eggplant sandwiches.  Just follow these directions and you sandwich will be merely acceptable.  Be warned!Beside the Willamette.08/24/19GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitRao’s Homemade®SponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-01-23", "author": ["Rao S Homemade"]}