{"id": "4560df13bfaa9c77a612f2379a6dac73", "url": "https://www.bonappetit.com/story/best-new-york-slice-pizza", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "What’s the Best New York Slice? I Ate at 30 Pizza Joints to Find Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat’s the Best New York Slice? I Ate at 30 Pizza Joints to Find OutSauce. Cheese. Dough. Attitude. It all matters more than you’d think.By Alex DelanyJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhere do I go for slice of the best pizza in New York? That’s a question that I get asked on a weekly basis (no exaggeration). People show up in New York City and know what the deal is. There is pizza to be eaten. The New York slice is known worldwide.It’s dough and tomato sauce and mozzarella. That’s all it is. Making a slice of plain pizza should be easy, right? That’s what you’d think. But as someone who has consumed an unquantifiable number of slices since living in New York City (and developed many opinions about them), I’d like to say that it is not. Serving a good plain slice is just as much a science as it is an art. The simple things, it seems, are actually the most complicated.So where do I tell people to go? What’s the best slice? To be honest, I was getting lazy in my answers. I had slice joints queued up to copy and paste. I started to feel like I was out of touch, like I was cheating the people who were trusting me with their slice-eating experience. It was time to really do this right. That’s why I recently ate at 30 of the New York City’s best slice joints in two days, with the intention of finding the best plain slice in the five boroughs. I did this for you. You’re welcome. Here’s what I was looking for in a killer slice of pizza.The Baseline RulesThe slice had to be triangular. It had to be served as a single slice (no pies allowed). And there couldn’t be additional toppings on the slice. No pepperoni. No mushrooms. No anchovies.I was also looking at price and the wait time for the slice. The remarkable thing about a piece of pizza in this city is that you can get one almost instantly and always affordably. You don’t wait for a New York Slice. And you shouldn’t have to question whether or not the price is justified.Andrew Thomas LeeThe SauceA good pizza sauce is simple and never sweet. One of the most common flaws in a slice of plain pizza is sweet sauce. Sugar should never be added to pizza sauce. The only sweetness should come from the tomatoes. And those tomatoes should also be bright and acidic. A deep, sweet tomato flavor is a sign that the pizzeria is adding tomato paste to make up for the weak flavor of bad tomatoes. A simple pizza sauce should be balanced, with hints of olive oil, garlic, and salt.The DoughIf a pizzeria cares about its pizza, it cares about its dough. Dough is the make or break for a slice of pizza. The bottom of the slice should be crispy, with some serious color, and the crust should be comparable to a hard-roasted marshmallow, aggressively-cooked and crispy on the outside, but chewy and light on the inside, with plenty of air bubbles.Slices at Joe’s Pizza (left) and Louie & Ernie’s (right)\nThe CheeseA New York slice should be made with low-moisture mozzarella. We’re not eating Neapolitan pies here. We don’t want fancy, watery, fresh mozzarella on this slice. We’re looking for melty mozzarella that creates a slightly greasy coating over the top of the pizza and makes for perfect cheese pulls at every bite.The RatioA good slice doesn’t have a lot of sauce or cheese on it, just enough cover the dough and give flavor to each bite. The ratio of cheese to sauce should be even, neither shouting over the other. The layer of cheese shouldn’t be thick and impenetrable, and the sauce should be peeking through the cheese. The cheese and sauce should be having a conversation.Scarr's storefront on Orchard St. (left) and three plain Scarr's slices getting snatched up (right)\nThe Best Slice of Pizza in NYC Is…From Scarr’s Pizza on the Lower East Side of Manhattan. Everything about this slice was perfect. The sauce celebrated the natural flavors of a high-quality tomato, making me feel like I’d just watched some old Italian grandmother pick and crush the tomatoes herself. The cheese was applied without a heavy hand, creating the perfect ratio of red to white. And the dough. Oh, man. The dough. There was a toasty flavor in the dough, and its texture was equal parts airy and crusty, with a deep chestnut color and sturdy enough to support the cheese and sauce above it. I wasn't judging slices based on the quality of ingredients, but the fact that Scarr’s mills its own flour in the basement of the pizza shop was evident.And yes, we’ve written about Scarr’s before, so you might be thinking there’s bias here. No. There’s not. When put up to the rest of these places, Scarr’s was the best. We write about it for a reason.But what’s even more amazing is that it was a humble slice. The high quality of the ingredients and expert construction weren’t advertised, almost as if to say that there’s nothing special here. This is the way pizza should be. This slice took me back to my childhood as much as it made me excited for the future of pizza. The plain slice at Scarr’s is the slice. It is truly phenomenal pizza.The 3 Best Plain Slices in New York City:Scarr’s Pizza - Lower East Side, ManhattanNew Park Pizza - Hamilton Beach, QueensBest Pizza - Williamsburg, BrooklynThe Runners Up (These were spots that were in the conversation for the top three, but had small flaws that ultimately set them aside): Joe’s Pizza (West Village, Manhattan), L’Industrie (Williamsburg, Brooklyn), Luigi’s (Park Slope, Brooklyn), and Louie and Ernie’s (The Bronx)Other spots we visited: Lenny’s Pizza, Nino’s Pizza, Joe and Pat’s, Dona Bella, Williamsburg Pizza, Prince Street Pizza, Patsy’s Pizza, Sal and Carmine’s, NY Pizza Suprema, Don Pepi Pizza, Rosario’s, Pronto, Smiling Pizza, Bleecker Street Pizza, Artichoke Pizza, 2 Bros. Pizza, East Village Pizza, Franklin Pizza, Table 87, L&B Spumoni Gardens, Di Fara Pizza, Vinnie’s Pizza, Paulie Gee’s Slice Shop (Not open yet)And if you’re thinking, Wait. Alex didn’t hit my favorite pizza spot. He left important places off of this list. Well, it turns out that a lot of New York City pizza places are apprehensive about signing a piece of paper that allows us to film on their property. Which is fine. We’re not going to force anyone to do anything. But you can’t win if you don’t play the game.Want to learn how to properly eat a slice? This way.A Long Answer to a Simple Question: How Do You Eat a Slice of Pizza?The fold. The toppings. The location. The drink. It all matters. Maybe even too much.View StoryExplore Bon AppétitNew YorkPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Alex Delany"]}