{"id": "457d0993a6cf0270265ec9f5106b385f", "url": "https://www.bonappetit.com/story/goat-cheese-feud", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Apple Pandowdy, Where Did You Come From? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureApple Pandowdy, Where Did You Come From?Our easiest apple recipe has its own theme song.By Alex BeggsOctober 5, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Who you calling dowdy“An unattractive woman.” “(Almost always of a woman or her dress.) Shabbily dull in colour or appearance; without brightness, smartness, or freshness.” Well gee whiz. I was just trying to make Basically’s tried-and-true apple pandowdy last weekend, when I fell down an Oxford English Dictionary rabbit hole tracing the origins of “pandowdy” (and therefore the unfortunate “dowdy”). It’s baked, spiced apples and brown butter downstairs, and flaky shingles of haphazard puff pastry upstairs. (It’s our easiest apple dessert, hands-down-y.) According to the OED, pandowdy shows up in cookbooks around 1846, in Nathaniel Hawthorne’s writing, and in the work of John Updike at least twice, which seems to make sense. That led me down the rabbit hole of a catchy Pennsylvania Dutch tune that goes: “Shoo-fly pie and apple pandowdy, makes your eyes light up, your tummy say ‘howdy!’” Which has been stuck in my head for days now.Bake it: Apple Pandowdy (Pro-tip: Egg-wash the top for an even shinier, shattering finish.)Courtesy of AldiWhat’s the deal withAll these food advent calendars? They used to be cheap cardboard trays with nativity Bible verses and mediocre chocolates that ease you into the season of sugar. Now Aldi sells cheese, wine, and beer advent calendars. Bonne Maman makes a (sold out!) calendar with teeny-tiny jams. There’s a marshmallow one. A ...hard seltzer... one. A Trader Joe’s cat treat one. Haribo! The Elmer Gantry in me feels like we’ve strayed from the light here. Like maybe you’re just buying lots of stuff in a scenario when you would have been buying none of that stuff. Ya know? Think about it. That’s too much jam.Want this letter before it hits the website? Sign up for our newsletter!Photo by Priya KrishnaHis name is Seth and he bakes, it’s “Seth Bakes”!“Seth Bakes” is the Instagram Story reality show that follows a man named Seth baking elaborate goods live! à la minute! It’s hosted and narrated and broadcast by his significant other, BA contributing writer Priya Krishna. See his recent cardamom-cinnamon buns above. All we know about Seth is that he’s a meticulous, self-critical architect who favors a Book of Mormon apron, so I sought out to learn a little more.What’s going on here?I don’t know, honestly. Priya started filming me one day. I was trying to fulfill my New Year’s resolution to learn a new baking technique every week. I was minding my own business, and suddenly my life winds up on the internet.What’s the earliest you’ve woken up to bake something?5 a.m., to make rhubarb danishes!What’s the biggest baking challenge you’ve encountered?Sfogliatelle!!!! [Italian pastries that look like accordion files.] That was a disaster. It was doomed from the start. But I would chalk my baking attempts to one all-encompassing fail. [Editor’s note: We absolutely would NOT.]What happened when your coworkers realized you’re “Seth, from Seth Bakes”?On the way to a work event with my coworkers, I got called out on the street, and then once we got to the event, another coworker asked me about it in front of everyone. It was very embarrassing.What’s harder, building a building or building a croquembouche?A building....of course. It is so hard. It is IMPOSSIBLY hard. Buildings take, like, 10 years sometimes.Cool cool cool.Alex LauWhat the kaleI enjoyed reading about the rise and fall of kale in The Atlantic this week, but I gotta say, I still love the foresty Tuscan stuff. Especially when you get it super crispy, like in this new recipe by Heidi Swanson. Carla Lalli Music’s whole-lotta-kale spaghetti recipe is another go-to. And how could we EVER forget Chris Morocco’s controversial but delicious kale reuben, so crazy it works?!Find all kinds of kale recipes here.Congrats to Sang!If you read about Sandwich Hag in Dallas, a game-changing restaurant for people with different abilities, you’ll be as elated as we are to learn that chef Reyna Duong’s brother Sang is now food handler certified. If you didn’t read it, well, read it! Then you’ll know why this is such a big deal.Read it: Sandwich Hag Is Teaching Dallas How to Hire DifferentlyPhoto by Alex Lau, food styling by Pearl JonesNo kale here thoMy love for the Lasagna cookbook is so strong it’s our #BAcookbookclub pick for October. Get a copy and cook along with us! (That means tag @bonappetitmag when you do and we’ll regram ya.)  And we have the recipe for the cheesy, breakfast-appropriate carbonara lasagna that I made and ate for a solid week, happily ever after.Get the recipe: Carbonara LasagnaUnnecessary food feud of the weekGoat cheese. It rarely shows up in Bon Appétit recipes, and yet, we all seem to love it. Christina Chaey shared a gruesome photo of a soggy salad with a patty of fried goat cheese in the center saying, “Anyone who says they don’t want that is lying.” But no one came out from hiding. “A crusted goat cheese patty in a salad is a nice thing,” Emma Wartzman concurred. “Cover it in breadcrumbs and fry it” is the only way Andy Baraghani wants to eat it. “I could write 500 words on goat cheese! It’s my favorite animal cheese,” Carey Polis called out to me from inside her office. Okay, Carey, you get 29 more: “It’s the tangiest cheese, and the most lactic. What is better than sitting on the couch with a wedge of Humboldt Fog and some Carr's Crackers?! NOTHING IS BETTER.” Carla “likes it,” she said. “Fresh and aged.” Revealing! Molly Baz “wouldn’t touch it with a ten foot pole.” Highly particular Chris Morocco “will always have room in my heart for a bit of Monterrey Chèvre and Vermont Creamery Binns Bouche, but that is IT.” “Does halloumi count?” Asked Christa Guerra. Well, sometimes. “CUZ IT’S INCREDIBLE.”Sarah Jampel had the last word (and image):Get the recipe pictured further up: Marinated Goat Cheese with Herbs and SpicesExplore Bon AppétitBeggs NewsletterRead MorecookingThis One Rule Separates Good Baking Apples From The LosersBy Sarah JampelcookingThe Easy Thanksgiving Dessert For \"People Who Don't Bake\"By Amiel Stanekeffed it up3 Reasons Why Your Baking Fail Is Probably Not Your FaultBy Claire SaffitzcookingThis Buttery German Apple Cake Cured Me of My Apple FatigueBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-05", "author": ["Condé Nast", "Alex Beggs"]}