{"id": "457f1612e8c5078d7c0ccb973a761157", "url": "https://www.bonappetit.com/story/buy-cbd-oil-online", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Before You Buy CBD Oil Online, Ask These Questions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBefore You Buy CBD Oil Online, Ask These QuestionsDon’t judge a brand by its chic, well-designed label.By Charlotte PalerminoAugust 9, 2018FacebookTwitterEmailFacebookTwitterEmailBeing a vocal advocate for all things weed, I get a steady stream of messages from friends and family members sharing the thing that will deliver us, and our dogs, from stress, pain and anxiety.The thing they’re talking about is CBD.For those needing a refresh, CBD or cannabidiol is one of the many compounds, or cannabinoids, found both in cannabis sativa (federally illegal) and industrial hemp (gray area) that has shown preclinical promise in treating anxiety and inflammation. Adding to its therapeutic legitimacy, CBD was recently FDA-approved to be used in an epilepsy drug called Epidiolex making it the first cannabis compound to be federally recognized. Over the last year, CBD’s become the darling of the wellness world, working its way into our juices, facials, creams, and cocktails, purportedly giving people the benefits of cannabis without the THC high. Very chill.But, and there’s always a “but” when it comes to weed in America, unless you’re buying cannabis CBD in a state where weed is recreationally legal or have a medical card in a legalized state, you’re shopping in the unregulated market that is industrial hemp CBD. (Full disclosure: I've worked with restaurants to launch hemp-CBD drinks and am the co-founder of Nice Paper, a site about cannabis.)Unregulated markets come with some obvious risks; lack of oversight, false claims, the potential for dangerous pesticides and contaminants. Cannabis, in states where it’s legal, is regulated. Sold in state-licensed stores (akin to states controlling liquor stores, except with higher taxes and much stricter regulations) aka dispensaries, you can be confident that the CBD-dominant cannabis tinctures, topicals, vapes, and edibles on shelves are accountable to purity and accuracy tests.When buying industrial hemp CBD, i.e. everything you see outside of a state-licensed dispensary, all bets are off. Because the legality of industrial hemp is in flux, companies that use hemp CBD operate in a gray market with no oversight. Nick Mosely, Chief Science Officer of a testing lab in Washington explained that “everything currently on the market for interstate CBD sales is unregulated.” And product labels can be wildly different from what's actually contained in the product. Multiple studies of CBD oil sold online have repeatedly exposed brands that misrepresent purity and CBD dosage levels.Pesticides, mold, and other contaminants are obviously substances you don’t want to be mainlining into your body, but properly dosed CBD is also crucial. That’s because your body’s response to CBD dosage is bell-curved. Too little and you won’t feel anything; too much and it’ll dampen the impact with reported side effects like lethargy and diarrhea (not chill). Given the lack of research into dosage and the variety of ailments CBD is used for, most people have to find their own “Goldilocks Zone.”To add to the challenges, brands in the CBD space are struggling to verify their own products. Laura White, founder of Soul Addict, started a CBD line after she found it helped her with crippling anxiety. Wanting to create a reliable product in both purity and potency, she’d test on top of the farm’s tests and kept running into the same problem: The lab results didn’t match. When White finally found a farm that had accurate tests, she’d partner with them. A few years later, Soul Addict now sources all its CBD through small, family-run farms in Colorado and White is in the process of integrating her own crops from North Carolina. The lesson she learned? Brands should be constantly testing their product to verify their farms’ reports.CBD in all forms has enormous potential. Doctors are excited, the wellness community is excited, and I personally slather hemp CBD on my face to keep eczema at bay and put dropperfuls under my tongue to deal with anxiety. But, like all things marketed as panaceas, be skeptical and do your research before buying. If you’re interested trying CBD, always talk to your doctor first (particularly if you’re on other medication, which can interact with the cannabinoid). Start with a small dose and work your way upDon’t judge a brand by its chic, well-designed label. Ask these questions before buying CBD:Are they open about third party tests and willing to share the results? When in doubt, ask for multiple lab tests including from the farm and a third-party lab. They’ll list out contaminants, solvents, and the percentage of cannabinoids. According to White, “brands should be happy to share their results as they’ve invested in those tests. If they aren’t transparent, it’s suspect.” Brands like RITUAL, Care by Design, Humbodlt Apothecary and Kinslips have all gone through rigorous testing standards as they are cannabis derived. Since you can’t travel across state lines with cannabis CBD, industrial hemp CBD brands that have well-sourced farms and openly share tests include Lily CBD, Rosebud, Honey Pot Supply, and Soul Addict.Where is their CBD from? Hemp point of origin is important for two reasons; If your CBD isn’t from the U.S., it’s definitely not legal and, if they can’t tell you where the farms are, they may not know.Is it local or organic? At the end of the day, CBD is an agricultural product. If you’re worried about whether your kale is organic, you should take the same approach to CBD. Currently the USDA has been slow to label hemp farms organic, so the only way to tell if your product is actually organic is to study the lab results.Is it full-spectrum? Full-spectrum is the use of the whole hemp plant vs. an isolate which extracts the CBD from the plant. Using marketing terms like “pure” and “all natural,” isolates are sometimes not hemp at all and synthesized in a lab. While the efficacy of full-spectrum is debated in the scientific community, anecdotes and a study in Israel favor full-spectrum. In addition to potential benefits, there’s another reason you should be buying the whole plant: contamination. Chen notes that isolates are harder to trace back to origin and can be straight-up fake. Overseas lab-made isolates are cheaper than domestic versions, making the potential for contamination high. Utah recently grappled with synthetic CBD when 52 people became sick from an isolate. While isolates can be legitimate (FDA-approved Epiliodex is an isolate), you’re going to have to spend more time researching the brand’s products and practices. Put it this way, if you could get your vitamin C from Sunny D or fresh squeezed OJ, which would you prefer?Does the label list the amount of CBD per serving?  Products called hemp oil or hemp extract may contain little-to-no actual CBD. Unless the label tells you how much CBD is in the bottle and how much CBD there is per serving, you can’t be sure it’s legit.Explore Bon AppétitHealthyishCannabisRead MoreshoppingThese CBD Strips Are Perfect for Busy, Anxious People, Which Is All Of Us ReallyBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-09", "author": ["Condé Nast", "Charlotte Palermino"]}