{"id": "458bba65be58e8fc34aa5e539b635b48", "url": "https://www.bonappetit.com/story/coconut-curry-rice-noodles", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "These Coconut Curry Rice Noodles Are a Fast Weeknight Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Noodles Are My Weeknight Feeling-Like-a-Zombie DinnerThis recipe is a new weeknight essential. Now I’ll explain the whole zombie thing.By Alex DelanySeptember 17, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailThere are certain dinners that I refer to as Zombie Dinners. Hold on. This is a lot less gruesome than it sounds. Stay with me.These are the dinners that I can make as a barely functioning human being, after a sleepless night, a long day at the office, and a cramped commute (that borders on an existential crisis). When I walk through my door, my brain is at about 11 percent capacity, and my words have devolved to moans and groans. Lately, this new recipe for coconut rice noodles with ginger and turmeric curry is my Zombie Dinner of choice.I have senior food editor Chris Morocco to thank for this Zombie Dinner. He developed a few rice noodle recipes over the summer, and while all three are quite tasty, this coconut number is my favorite, because it checks the boxes needed to qualify as a zombie dinner. 1. I don’t need to go to the store to buy any of the ingredients. 2. It is either flavorful enough to wake me up or comforting enough to put me to bed immediately. And 3. It’s fast. It takes about 15 minutes to make this recipe. You know what else you can do in 15 minutes? Wait. That was not a rhetorical question. I am legitimately asking, because now I have a bunch of free time after dinner.But back to the flavor. The creamy sauce is built from coconut milk, a splash of water, red onions, garlic, ginger, and turmeric. That’s it. It coats every noodle in a velvety, warm, and luxurious sauce. You’ll lick it from the pan, and this is how simple it is to make: You sauté garlic and onions, add coconut milk, turmeric, ginger, and water, and let it simmer for five minutes. Bingo bango.I'm a fan of pad Thai style rice noodles for this curry, but you can go your own way.\nAnd while the recipe calls for vermicelli, you can really use any rice noodle for a similar effect. I personally like a medium-sized, flat, straight-cut noodle, like you’d find in pad Thai. It doesn’t matter which path you choose to take, as long as the rice noodles are cooked properly. Luckily for you, the method for cooking them in this recipe is pretty hard to mess up. You bring water to a boil, turn off the heat, and then drop the noodles in, so they cook more gently. After a strain and a quick rinse, this method delivers a noodle that’s pleasantly chewy. You throw them right in your simmering sauce, toss, and serve. (Read more here about how to cook rice noodles so they don’t stick together.You can keep these noodles as they are, or you can go add more to it based on what’s in your fridge, an ingredient that will cook quickly. While the coconut milk simmers, I’ve added thinly sliced cremini mushrooms, Tuscan kale or chard, an even medallions of chicken breast, but I’m sure that slices of eggplant, squash, or peas would work as well. Just make sure they’re sliced thinly. (Don’t slice your peas though, unless you’re some kind of serial killer, LOL...JK.)So maybe I made up the entire concept of Zombie Dinners as the premise for this article! But you know what? I think it’s going to stick. And the next time you’re looking for a low-energy weeknight dinner for whatever zombie state you’re in, feel free to join me.Get the recipe:Coconut Rice Noodles with Ginger and TurmericThis is a weeknight pantry curry that comes together in the time it takes to boil water for the rice noodles. Fast!View RecipeExplore Bon AppétitCurryCoconutRice NoodlesDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-17", "author": ["Condé Nast", "Alex Delany"]}