{"id": "45981721578e800c6960058d33fb00ee", "url": "https://www.bonappetit.com/story/big-fat-weekend-oakland-california", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "How to Spend a Big Fat Weekend in Oakland, California | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatHow to Spend a Big Fat Weekend in Oakland, CaliforniaA Bay Area–native on her guide to the black-owned businesses keeping the city’s spirit alive.By Ryan Walker-HartshornFebruary 13, 2019FacebookTwitterEmailPhoto by Ryan Walker-HartshornFacebookTwitterEmailI was born and raised in Oakland, went to college nearby, and moved to New York only a couple of years ago. Still, I never stop talking about how much I love the city I hail from. Growing up, my family taught me that our home was the birthplace of the Black Panther Party, whose activism shaped  a strong and resilient community, one where Black folks always supported and uplifted each other.This permeated the feeling of the city and my life in it. All the weekends spent meandering around Lake Merritt, taking in the sailboats, drum circles, and slackliners balancing between oak trees. Morning hikes on the Redwood trails. Sunset views of giant cranes (we call them dinosaurs) in the port, with San Francisco peeking through the fog. Evening drives with the windows down, hyphy hits from Mistah F.A.B., Mac Dre, and E40 bumping so hard that the CD skips. Dinners at Taqueria Sinaloa; midnight runs to Colonial for doughnuts straight from the fryer.While my routine hasn’t changed over the years, it’s clear how much the city has. Silicon Valley’s tech boom has reached all the way to Oakland, displacing long-time residents and businesses. That’s why I spend most of my time in black-owned establishments. Some are old-school spots that have managed to hang on, others are newer ones reclaiming power through the spaces they occupy, the people they hire, and the messages they promote. Here are a few of my favorite places to visit whenever I’m home.V excited about the caffeine in my cup.\nPhoto Courtesy of Ryan Walker-HartshornHaste MuerteLocated in Fruitvale, Hasta Muerte is a persons-of-color, worker-owned coffee shop serving great coffee and fresh pastries daily. I particularly loved the vegan donut and the mushroom and cheese empanada. It’s a cozy spot for finding peace of mind, or getting some work done.Super Juiced OaklandSituated in Old Oakland’s Swan’s Marketplace, the first Super Juiced opened in 2012 by Emanne Desouky and Rana Halpern, two hard working mamas that believe eating organic fruits and vegetables is neither a luxury nor a privilege, but a human right. They prioritize hiring queer youth of color and paying their employees above minimum wage. The Emerald Moon smoothie, a blend of housemade coconut milk, mango, kale, spinach, medjool dates, coconut chips, and cinnamon, was so good that my dad asked me for a “sip,” and ended up finishing the entire thing.Cherry pie to the left, pumpkin to the right.\nPhoto by Ryan Walker-HartshornLois the Pie QueenLois Davis and her husband opened their Oakland diner in 1973, and have been deemed local royalty ever since. Just look to the crowd of loyal regulars, and the signed photos of customers like Donald Glover, Daveed Diggs, and Steph and Ayesha Curry. (Angela Davis and Queen Latifah have been known to stop by too.) Though Lois herself passed away about 20 years ago, her legendary restaurant continues to flourish under the ownership of her son Chris King. It is a great place for a classic breakfast or a late-afternoon cup of coffee with a slice of sweet potato pie (my favorite). A Golden State Warrior might even drop in for a bite.Lovingly made by locals.\nPhoto by Ryan Walker-HartshornOwl N WoodIf you’re looking for authentically Oakland souvenirs, Rachel Konte’s apparel boutique Owl N Wood is the spot. I copped my favorite “heart Oakland” crewneck here that I  wear all the time.Lake MerrittYou may notice a giant body of water in the middle of the city; it’s about three miles in circumference and surrounded by lots of flora and fauna. It’s called Lake Merritt, and it is one of the most beautiful places to be in Oakland, especially in the spring and summer. You’re guaranteed to spot sailboats, community BBQs, and late night drumming circles. On Saturday mornings, I like to carve out a few hours for a visit to the farmers’ market and a movie at the Grand Lake Theatre. Even if you don’t see a film, catch a peek at the marquee—there’s always a witty and relevant message on display.That sweet potato butter is next level.\nPhoto by Ryan Walker-HartshornMiss Ollie’sCome for the Caribbean soul food (don’t miss the Plantain Plate with spicy pinto beans, garlic plantains, and tostones, or the skillet-fried chicken and waffles, topped with creamy sweet potato butter); stay for the vibes. Located on a charming corner in Old Oakland, the scene is all Harry Belafonte records, colorful art, and a community altar that patrons can add their own notes, flowers, and photographs to. It’s exactly where you want to be on a Friday night, dancing the two-step with a rum punch in hand.Day or night this place is bumping.\nPhoto by Ryan Walker-HartshornOeste Cafe and BarThis spot from Bay Area natives Sandra Davis, Lea Redmond, and Anna Villalobos (also a co-owner over at Miss Ollie’s!) is so dope, I went twice in less than 24 hours—first for a drink, then for brunch the next morning. We ordered the  shrimp and grits (topped with bacon bits and chives) to split, but I ended up devouring the whole thing. Luckily there were flaky biscuits and gravy, loaded with fennel seeds and ground pork, to smooth things over. Next time I’m in Oakland, odds are good you’ll find me at Oeste.BeastmodeOakland, California: The proud home of Marshawn Lynch and the Oakland Raiders. Three years ago, the running back launched his Beastmode brand and apparel shop, where new- and old-school hip-hop hits play over speakers and photos of prominent black athletes cover the walls. I bought Lynch’s Beastmode button-down jersey for my step-dad, and he has not taken it off since.The Africana—equal parts coffee and milk (and chic ceramics).\nPhoto by Ryan Walker-HartshornRed Bay CoffeeKeba Konte, the entrepreneurial force behind Red Bay Coffee, cares deeply about maintaining an authentic relationship with the local community and prioritizes diversity in his employment practices. He has two Oakland locations—one, an old Fruitvale warehouse that’s been turned into a roastery and cafe, and the other, a smaller spot with cozy outdoor seating off of Broadway in Downtown. I went to the latter, which was decorated with photographs of revolutionaries James Baldwin and Martin Luther King Jr. I especially enjoyed sipping on the Africana, made of two ounces of espresso cut with two ounces of milk served in a speckled, two-tone ceramic tumbler.E14th GalleryWalking into E14th Gallery is a breath of fresh air. The exhibition space and gallery store focuses on the work of local artists, activists, and Freedom Fighters. I love the works on view and recently purchased two afrocentric prints, one of the iconic Angela Davis and another of the beautiful Lauryn Hill. They also have a variety of handmade goods from Oakland artisans.All this was devoured in about, uhhh, three minutes.\nPhoto by Ryan Walker-HartshornEverett and Jones BBQYou absolutely cannot visit Oakland without a stop at Everett and Jones BBQ. Located in Jack London Square, and with the San Francisco skyline as a backdrop, E&J has the best BBQ in town. Go with a large group on Saturday night to hear live Blues as you pass around heaping orders of sliced beef brisket, smoked pork ribs, collard greens, candied yams, and macaroni and cheese. Be prepared to get your hands dirty.Souley VeganSouley Vegan gives me old-school diner vibes to the tune of Maxwell, Jill Scott, and Erykah Badu. They serve all the soul food staples—gumbo, grits, casseroles—but with a vegan twist. The Southern fried tofu burger is super crispy and the black eyed peas were so good, they reminded me of my grandmother’s.Explore Bon AppétitBig Fat WeekendOaklandCaliforniaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-13", "author": ["Condé Nast", "Ryan Walker-Hartshorn"]}