{"id": "459acd326b287f3df835d9a0858ed55e", "url": "https://www.bonappetit.com/story/fancy-food-show-2018-recap", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Inside the Fancy Food Show, Where Grocery Shops Go to Grocery Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureInside the Chaotic Fancy Food Show, Where Grocery Shops Go to Grocery ShopHere are the best snacks we ate—and what we avoided—at the massive trade show in New York.By Alex BeggsPhotography by Cole WilsonJuly 2, 2018FacebookTwitterEmailCole WilsonFacebookTwitterEmailEverything hurts and I’m standing by garbage when I hear a man working up to hawking a huge loogie. It’s like rolling thunder in the back of a slimy throat, or a truck with muffler trouble getting started. Hrrrrackkkkk. Thank god there are all these garbage bins around—in clusters placed strategically throughout this gigantic, salami-scented convention center—because he finds just the place to spew it, pfooft! right beside me. I watch his lanyard swing to the side as he continues on his busy path.Welcome to the Fancy Food Show! Where grocery shops come to grocery shop. Where distributors come to make deals, gourmet stores scout the latest niche marshmallows, spice merchants sell spices, dairy boards check out cheese, and a ton of randos prey on samples for whatever reason. Oh, and where editors for various food media outlets go to find out what is cool, or extremely not cool. There are lots of handshakes. There are lots of blazers, jeans, and running shoes. Everyone’s lassoed with lanyard name tags that reveal our affiliation in ALL CAPS. When I spot two gentlemen from my hometown of Houston’s beloved H-E-B I get excited and say, “H-E-B! The greatest grocery store on Earth!” But they zoom past me, two polo shirts in the wind.It’s a gigantic, overwhelming, three-story trade show in the 840,000-square-foot Javits Center in New York, and I couldn’t be more excited to be here. Because I love snacks.Things you see at the Fancy Food Show. I mean polo shirts and khaki pants.\nCole WilsonMan cuts ham.\nCole WilsonYeah, obviously choosing to set down my heavy tote bag—not sure why I so eagerly took a bottle of Oxigen water, which weighs as much as regular water—next to one of many, many garbage clusters was dumb. But I was three hours deep into this thing and my body ached, my senses were overwhelmed, and I thought it would be funny to see what people were throwing away. They throw away everything. Little plastic sample cups of lukewarm noodles in one of a hundred jarred sauces. Paper spoons of watery tomatillo salsa. Sticky handfuls of flavorless granola. Everything starts to blur into one fair-trade, allergen-friendly, no added-sugar, dramatic backstory, earth-saving package of just fine. It’s hard to discern the good from the meh from the tasty, but your snack-familiar reporter has an eye for these things. “Do you know what shrub is?” They ask. Hell yeah I do. So trust your guide as I walk you through 10 notable snacks:RIND SnacksThese are dried fruit peels, so before I over-promise you anything, know that they are dried fruit peels. The tangy kiwi flavor, however, was very interesting in my mouth. That’s what I wrote in my notes: “Interesting in my mouth.” The tiny kiwi seeds pop like chia seed explosions, and they’re tart and sour. Definitely for people who go for Sour Patch over Sno-Caps at the movies.Cole WilsonWilliwaw Salmon CrackletI wonder how many years behind these Chilean salmon skin chips will be from the abundance of salmon jerky on the market now. (They’re not available in the U.S. yet, but a sampler before me kept going back for more, so maybe...soon?) The dehydrated skin is sharper than your average Dorito, and a hell of a lot fishier, with a touch of sweetness. Pass on the pesto flavor, and embrace cat treat breath.Cole WilsonKimino Yuzu SodaAn impressively tanned dude poured me some bubbly yuzu soda: “Do you know what yuzu is?” he asked me, apparently a wide-eyed idiot. I did, and he was disappointed. What else was there to say? He watched me swallow the sweet citrus soda. “What does Kimino mean?” I asked. He did not know. (It means “made for you.”)Cole WilsonHoly Smoke Smoked Olive Oil and HoneyThere were SO MANY smoked honeys, smoked syrup, and smoked chocolates at the FFS. That’s how you know a trend is over, I was told by an apt specialty store owner. At the Holy Smoke booth, a Shia LaBeouf look-alike named either Kyle or Max wore a fishing hat and presided over his happy smoky empire. A toothpick of bread crust dipped in this smoked olive oil was like licking a campfire.Cole WilsonMySnacks Veggie ChipsA big theme at the FFS was: puffy. Take a grain, seed, whatever, and puff it with air to make it a snack. Early in the day, I said yes to a dehydrated shiitake mushroom chip made by California-based MySnacks, which cares not for Instagram, flashy branding, or e-commerce. There was no backstory here, nothing about gluten or allergies, just huge chunks of dehydrated funghi and alliums. I followed the rich mushroom with a whole clove of dehydrated garlic. Both were incredibly funky, with an appealing airy texture, and I was very into it. When a woman in a nearby booth projected herself into my personal bubble asking “ARE YOU A MANUFACTURER” I used my breath as a shield, “Nooooooo!”Stick to the plain milk chocolate flavor.\nCole WilsonUndercover QuinoaThese are like healthyish Hershey Krackel bars, presented in irregular chunks. The backstory is a classic: a mother realized her kids has ____ (celiac disease) and she couldn’t find any _____ (chocolate candy) that was gluten-free, so here we are. In fact, the daughters were present and accounted for, handing out samples from brimming straw baskets. They were milk chocolate-coated and creamy, with popping quinoa (puffy alert!) that was delightful to consume. I feel for these, hard. So did Whole Foods.Cole WilsonCruncha-MameYou guessed it—puffed edamame. The trippy packaging reminds me of trying to understand The Backyardigans, and then I remember I’m an adult and don’t have to. They add spinach to the edamame (somehow?), which you can really taste in a green, earthy way. But then a dose of flavor powder on top joins the party, which is a ranchy distraction. “Edamame! That’s what we snack on in my house,” proclaims a sampler with blue-streaked hair. Her enthusiasm earns a second free sample, and I’m impressed.Cole WilsonCannoli ChipsSturdy triangles of sugar-dusted waffle chips dipped in dense cannoli cream. When you buy these online, Walmart suggests the following related product: bags of pure cane sugar. At their choice corner booth, I overhear a woman in a sequined top tell the sales rep, “I used to be 600 pounds! Hope I don’t relapse.”Cole WilsonLegally Addicting Crack CookiesBeneath the groaner of a name, we have saltines with one side coated in chocolate and they deliver what is promised: salty-sweet-crunchy, if not crumbly. The everything bagel spice adds a jarring note of dried garlic.MY BROS!\nCole WilsonSap! Birch Water“Do you know...Evan Delany?” a young bro inquires when he sees my name tag. Bro, you mean Alex Delany? I ask. We laugh about the mix-up. (Evan is Alex’s brother, who knows Sap!Bros). Sap!Bro offers me a taste of the whole line of as-seen-on-Shark Tank Sap! Water, my favorite of which is the Birch water. It looks like a tree trunk! It tastes woodsy, earthy and sweet, more flavorful than the original sap water, which has a hint of maple so subtle you wonder if it’s all in your head. “It’s high in manganese” my new friend tells me, and we both wonder what, in fact, manganese is for.Makin’ deals.\nCole WilsonPhewph! That’s just a handful from the first floor of the show—there are over 2,600 companies at the show, so I didn’t see them all. Upstairs I sampled Korean scorched rice snacks (more puff), Kewpie yuzu kosho dressing, vegan jerky (chewy), a ton of matcha, and a much-needed frozen scallion pancake. There were hundreds of huge, international companies with flashy setups and more giant wheels of parm than I could count, plus the “German pavilion” where beer is to be found, and a couple cheersing plastic cups of red wine from the Rao’s booth. I’ll leave with these parting words I overheard from a canned tuna salesman: “We’ve tested 400 pounds of our tuna and we’ve never had a death.” And isn’t that something?Not sure what’s going on here but it’s safe to say probably CHICKEN VR!\nCole WilsonDIY your own fancy food:Explore Bon AppétitGrocerySnackNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-02", "author": ["Condé Nast", "Alex Beggs", "Cole Wilson"]}