{"id": "45add248f5c9d8696ae40a1340152a9e", "url": "https://www.bonappetit.com/story/stuffed-eggplant-recipe-crispy-beef", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "This Stuffed Eggplant Recipe Is Allllllll About the Crispy Beef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Stuffed Eggplant Recipe Is Allllllll About the Crispy BeefLearn how to roast eggplant until it’s creamy and caramelized, and then serve dinner on top of it.By Alex BeggsAugust 7, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailI never considered stuffed eggplant a mode of transportation. But there it was, a nightshade boat afloat a shallow sea of garlicky yogurt. The precious cargo inside: cumin-spiced ground beef, onions, and garlic. Some of the cargo had fallen overboard, yes, but I’m a trained lifeguard and knew what to do in such situations. (Eat it all.)This was the scene the other night when I made Basically’s Stuffed Eggplant with Crispy Beef. This new recipe for taught me how to roast tricky, spongy eggplant, boosted my meat-cooking confidence, and gave me a new formula for easy weeknight dinners:Garlicky yogurt base + roasted hearty veg boat + crispy protein toppingAnd if you read a lot of Bon Appétit, you know that nothing is complete without a thundershower of herbs on top, and in this case, some ruby raindrops of pomegranate seeds. Here’s how the whole thing goes down.The Eggplant TrickWhile the eggplant is whole, you poke a ton of holes in it with a fork. This helps as much steam to escape from the eggplants as possible when they roast, which means they’ll be less watery and more flavorful in the end. Then you cut the eggplants in half lengthwise. In the pale, seedy flesh, you carve a cross-hatch pattern, a lazy plaid that looks something like: XXXX. This adds to the poked hole technique (no YOU went to culinary school!) and helps the eggplant roast and break down faster, achieving that creamy texture we love in the purple globes. (Well, some people hate this about it. And they can go cry in a corner about it for all I care.) After that arts and craftsmanship, you swipe some olive oil all over the thatched eggplant, salt + pepper it up, and roast them flesh-side-down for 20 minutes at 425°F. We are NOT messing around. You NEED that high heat to get shit done here, so don’t sleep on 350°F and wonder why your EPs aren’t getting caramelized in a half hour.The Precious Cargo PrepWhile that’s a-roasting, grate a clove of garlic into some yogurt (I used labneh). Smash four other cloves, chop up an onion, chop herbs for grand finale, and make a cocktail. The eggplant come out after 20 minutes, get flipped, and go back in for a final 15, and that’s when I got started on the meat.Photo by Alex LauThe Precious Cargo CookWhen the clock’s got 5-10 minutes left, brown your meat. This means put it in a cast iron and DO NOT TOUCH IT for like 4 minutes. (This article will change your ground beef life if you haven’t read it yet.) After that time, it’ll be browned and crispy on the bottom. Break it up with a good spatula (I used my trusty fish spat), and push it to one side of the pan. The onion and garlic go into the other side, on top of all of that beef fat. Yes. Good idea!!! Again, let it cook without messing around for 3 minutes, then toss occasionally until everything’s translucent, which for me was around 5 minutes. Add a little cumin, more salt + pep, and mix everything together, meat and all, letting it cook for a final minute or so.Load the ShipsBoats, whatever. Plop the yogurt onto your plate, swirling it like the mystery hands in recipe videos, and place an eggplant half on top. Spoon the precious beef cargo on top of that, and top with a drizzle of olive oil, parsley, and pomegranate seeds if you so desire. This recipe also makes great leftovers.How to Make It VegetarianShout out to my plant-based friends. You could swap the ground beef for chickpeas here, or black beans, but without the beef fat flavor you might want to amp up the cumin and freestyle with more spices. Another great idea is to use that Trader Joe’s soy chorizo that people seem to be in love with, or your favorite fill-in-the-blank faux meat. Aaaaaand if you really don’t like eggplant, the same formula would work on boats of other design, like a sweet potato, bell pepper, or acorn squash.Get the Recipe:Stuffed Eggplant with Crispy BeefCustardy eggplant, sweet-tart pomegranate, creamy garlic yogurt, and crispy beef—eggplant naysayers, we're coming for you.View RecipeExplore Bon AppétitGround BeefRoasted VegetablesEggplantBasicallyWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Alex Beggs"]}