{"id": "45b01a946df5dc31833cd36d3b04c649", "url": "https://www.bonappetit.com/story/ethels-club-digital", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Ethel's Club Closes Its Doors But Opens a Virtual Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Community Space Closes Its Doors But Opens a Virtual HomeEthel’s Club, a social and wellness club for people of color, has launched a digital membership.By Shanika HillocksMarch 23, 2020FacebookTwitterEmailPhoto by Frank FrancesFacebookTwitterEmailWith social distancing in full effect, companies around the world have closed their office doors, forcing millions of people to figure out how to work from home. Co-working spaces haven’t been spared, and the freelancers who relied on them for desk space and other resources have been left adrift. But it’s not just an internet connection that they’re losing: many of these spaces also functioned as community centers and support networks for people who need them most.Ethel’s Club in Williamsburg, Brooklyn, is one of those spaces. The social and wellness club for people of color has offered work space but also discussion groups, performances, classes, and other gatherings—all led by POC—to its over 200 members since it opened last year.Instagram contentThis content can also be viewed on the site it originates from.Amid the global pandemic, Ethel’s Club’s founder Naj Austin has closed the brick and mortar space and pivoted to a virtual model. “In the midst of so much unknown and constant change, we wanted to create an easy way for people to establish a sense of calm and normalcy in their lives,” she says. “Our answer is to reinforce daily routines and make the communal rituals and social practices that we’re familiar with as accessible as possible.”Ethel’s Club’s new virtual membership is now available nationwide, with content streaming daily through Zoom and on Vimeo. The programming will keep the current health crisis in mind, offering breathwork practices to combat anxiety, for example; but it will also remain broad, with lectures on the history of hip-hop to the backdrop of a DJ set and introductions to BDSM and cannabis.“It’s imperative to create a space where [people of color] can gather as one, hold space for our fears and hopes, heal, and ultimately create new futures as a community,” Austin says. She stresses the importance of creating an ecosystem that’s not only suited to virtual life but also financially supports the freelancers, artists, and entrepreneurs whose livelihoods are at risk right now.Whether or not you have access to a community like Ethel’s Club, Austin says, consistency and connectivity is the key to keeping each other uplifted and empowered through this intense time. That means keeping in touch with loved ones with regular Facetime dates and phone calls that are less about what’s in the headlines and more about checking in with people’s emotional states. Instead of passing along news, “offer a personal connection, a Netflix recommendation, or a calming way to meditate,” Austin says. “We’ve all been granted this time to slow down a bit, let’s embrace it.”Explore Bon AppétitHealthyishBrooklynInterviewsRead MoreLifestyleWe Could All Use This Therapist's Advice Right NowBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-23", "author": ["Condé Nast", "Shanika Hillocks"]}