{"id": "45b9c7f33315578a68c5825883632b5e", "url": "https://www.bonappetit.com/story/turkey-burger-recipe", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "This Turkey Burger Recipe Is the One You've Been Waiting For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is The Turkey Burger Recipe You've Been Waiting ForIt's the  juiciest, most flavorful turkey burger we've ever had. (And we've had a lot of turkey burgers).By Claire SaffitzFebruary 20, 2018FacebookTwitterEmailPhoto by Chelsie Craig, styling by Claire SaffitzFacebookTwitterEmailTurkey burgers receive a fair amount of disparagement, and it’s not unfounded. Usually, turkey burger recipes result in something so lifeless and tasteless that drowning one in ketchup (that most perfect and delicious of condiments) doesn’t help much. Part of the problem is calling this food a “burger” at all, because it’s never going to satisfy the way juicy, salty, medium-rare beef will. That being the case, was it still possible to create a flavorful, juicy turkey patty that we liked eating? That was the challenge posed to me by Healthyish editor Amanda Shapiro, and I accepted, because full disclosure: I have a secret, inexplicable soft spot for turkey burgers (it's my secret diner order along with a baked potato and steamed broccoli), and I wanted to see if I could create a version that I could fully get behind.The main problems with cooked ground turkey are, one, it doesn’t taste like much, and, two, it’s dry. The first problem had the easier fix. In terms of flavor, ground turkey is pretty much a blank canvas, so mixing in some umami-rich ingredients like garlic powder, Worcestershire sauce, and grated onion provided a backbone. On top of that, smoky-spicy ingredients like ground cumin and sriracha gave it a little oomph.What posed a slightly greater challenge was the second problem: preventing the patty from drying out. Adding some mayo into the mix for richness improved the texture but didn’t keep the meat itself from losing moisture while cooking. To get to the bottom of the problem, I decided to stand on the shoulders of giants and consult the oeuvre of J. Kenji Lopez-Alt, chief culinary consultant of Serious Eats, author of The Food Lab, and overall cooking ninja. I was sure Kenji, with his food science knowledge and rigorous recipe testing skills, had an answer to this problem, and I was right.Now, a little bit of light food science nerdery is in order: As ground meat cooks, Kenji explains, the proteins link up and form a tight network that squeezes out moisture as it contracts. This is a particular problem with turkey because, unlike beef, the meat must be fully cooked through and therefore brought to a relatively high temperature. His solution was to add an ingredient that would not only contribute moisture on its own but would also interfere with the formation of a protein network during cooking and, as a result, prevent the meat from losing moisture (much the same as adding milk-soaked breadcrumbs to meatballs, for example). Kenji tested several options and settled on cooked eggplant puree as the clear winner.But to skip the bother of making my own eggplant purée (and also to avoid outright recipe theft), I decided to try an easier option: mashed avocado. Because what can't avocado do? As I hoped, it worked like a charm. Not only does it mash to a smooth paste in seconds, but avocado has a silky texture and neutral flavor that easily blends into the turkey meat. It sounds a little weird, I know, but it results in a turkey burger that doesn't shrink dramatically, stays flatter, cooks more evenly, and, miraculously, stays juicy.Sliced avocado on top, plus a swipe of sriracha mayo for creaminess and a generous topping of limey red cabbage slaw for crunch and acid make the whole thing a pretty tasty package. Not to brag, but food director Carla Lalli Music even called it her best turkey burger ever. Not saying we'd choose it over beef every time, but it's a damn good burger, and I call that a success.It's time for turkey burgers:Extra-Juicy Turkey BurgersTurkey burgers always sound like a great idea, but they too often taste like a fat sawdust patty. No more, friends! Mashing avocado into the turkey mixture helps prevent the meat from shrinking and drying out during cooking, which is why these stay awesomely juicy, even when they’re cooked all the way through.View RecipeExplore Bon AppétitHealthyishTurkeyBurgersRead MorecookingFinally, a Salmon Burger We Can Get BehindBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Claire Saffitz"]}