{"id": "45c794c08a811bb136d819446a6e3359", "url": "https://www.bonappetit.com/story/cornbread-muffins-are-no-joke", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "These Extra-Corny Cornbread Muffins Are No Joke | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Extra-Corny Cornbread Muffins Are No JokeA new recipe you can make for breakfast, slathered with honey butter, or as an all-purpose barbecue side.By Jesse SparksJune 21, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailNo matter how punishing the heat gets, I’m always in the mood for cornbread. I make sure to bring it as a side to backyard barbecues with family, and all of the poorly organized potlucks you get invited to (where you found out an hour ahead of time that you’re expected to bring food). And while I have a steamy romance with Jiffy, I’m re-evaluating everything after making this new recipe for extra corny cornbread muffins.They’re corny not because they tell dad jokes, but because there are actual kernels of fresh corn in there, plus sour cream for moistness, and cornmeal so you can actually taste corn, which is better than the taste of old cardboard. Plus, they scream versatility: dab them with honey butter for breakfast, serve them with chili for all of your sopping needs, or as a side to any barbecue spread. So roll up your sleeves and grab a whisk. It’s about to get hot, but not too heavy.It all starts with the usual scheming of senior associate food editor Molly Baz. Whisk together the dry ingredients: cornmeal (either medium or finely ground will do), salt, and a ton of pepper. Before you even ask, yes, you need that much ground black pepper. The pepper gives a slightly pungent bite you didn’t realize you were missing amidst the sunburn.In a separate bowl, whisk the wet ingredients together. Once everything is a smooth and glossy make a deep divot in the dry ingredients. Then pour that liquid goodness in and stir it in with a wooden spoon. Pro-tip: that wooden spoon switch-up will make mixing a breeze once the batter is too thick for a whisk.With the churning out of the way, it’s time for the main attraction and what sets this recipe above the box mix: that sweet, snappy, corn. Cut the kernels off the cob by placing the cob’s tip on a cutting board and holding it at a 45-degree angle. It’s the BA-approved way to keep hands, fingers and kernels intact without wasting any precious kernels (like in the clip above, but that stuff’s grilled, we’re using fresh). Mix in your corn, saving some for later, and pour the corn-studded batter into your greased muffin pan (this is our favorite one, by the way). At this point it sounds hard to top, but It. Gets. Better. That leftover corn? Anoint each muffin with corn and a sprinkle of flaky salt.After an agonizing stint in the oven (it’s only 18-ish minutes but the cravings were real), your golden blessings will be primed and almost ready. Give them some time to cool in the tray, then on a wire cooling rack. When it’s time to eat, the intact kernels still have their pop. The salt-to-sweet ratio hits a balance most cornbread mixes miss. The muffins are moist and rich and the farthest thing from a blazing mouthful of sandy beach.If you’re really trying to bless yourself, you’ll whip 2 tablespoons of room temp butter with honey to taste. Slice open a corn muffin, dole out some loving swipes of honey butter, and go to town. It’s ok, I’ll give you some privacy.Get the recipe:Extra-Corny Cornbread MuffinsFeaturing cornmeal AND fresh corn kernels.View RecipeServe with...Explore Bon AppétitCornbreadSummer SidesCornMuffinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Jesse Sparks"]}