{"id": "45cde6c543df2caff2a6990b9a7caea6", "url": "https://www.bonappetit.com/recipe/shrimp-and-okra-with-sausage", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Shrimp and Okra With Sausage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueShrimp and Okra With SausageBy Maya L. HarrisFebruary 9, 20214.6(52)Read ReviewsTriangleEmailPinterestPrintShrimp and Okra with SausagePhoto by Emma Fishman, food styling by D'Myrtrek BrownEmailPinterestPrintEmailPinterestPrintSeasoned pepper or Creole seasoning is the key to adding a spice cabinet’s worth of flavor in just a few shakes. If you can’t find either, you can roughly substitute with a pinch each of onion powder, garlic powder, cayenne pepper, kosher salt, and freshly ground black pepper. This recipe from lawyer, policy advocate, and writer Maya Harris is inspired by her family friend Regina Shelton. Read her essay about the treasured dish here.Ingredients4 - 6 Servings5Tbsp. extra-virgin olive oil, divided1large onion, finely choppedKosher salt1green bell pepper, seeds and ribs removed, finely chopped4celery stalks, chopped4garlic cloves, finely chopped1lb. fresh okra, cut into ½\" pieces, or sliced frozen okra1lb. smoked pork sausage (such as andouille or kielbasa), sliced ½\" thick1½cups tomato sauceCayenne pepperSeasoned pepper or Creole seasoning1lb. large shrimp, peeled, deveinedSteamed rice and/or cornbread and Tabasco (for serving)PreparationStep 1Heat 3 Tbsp. oil in a medium pot over medium-high. Add onion and a pinch of salt. Cook, stirring occasionally, until softened, 6–8 minutes. Add bell pepper, celery, and garlic. Cook, stirring, until vegetables are softened and just beginning to brown, 8–10 minutes.Step 2Add okra and remaining 2 Tbsp. oil. Cook, stirring often, until okra is crisp-tender and has lost most of its gumminess, 6–8 minutes. Reduce heat to medium. Add sausage and cook until it begins to release some fat and plump up, about 5 minutes.Step 3Add tomato sauce and a pinch or more of cayenne to pot; season with seasoned pepper. Bring to a simmer and cook until flavors come together, about 10 minutes. Add shrimp and cook just until cooked through, about 5 minutes.Step 4Serve shrimp with rice and/or cornbread and Tabasco alongside.How would you rate Shrimp and Okra With Sausage?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMade this last night because I had some frozen okra to use up. Turned out very good. Followed recipe except used tomato soup and 1/4 water in place of tomato sauce. Also added a fresh tomato. I don’t think you can go wrong with this recipe. Good proportions and flavor. Schmee Kalamazoo, MI10/3/2021Just here to cringe at Orlando becky feeling the need to mention her bf's ethnicity MarieMontreal7/29/2021My wife proclaimed this recipe to be company worthy.  My only changes were to sauté the shrimp and andouille separately first then removed them and added them back in at the recommended times.  This gave them a better texture than cooking them in with the trinity.  I ad to use frozen okra, but it still turned out very good.TongsPhilly area5/17/2021Any idea what I could substitute for the okra?\nSandy90265Malibu, CA3/6/2021This is pretty much just jambalaya....AnonymousUnited Arab Emirates 2/17/2021If you add a teaspoon of white vinegar, the okra won’t be slimy. Anonymous2/17/2021Does this use spaghetti sauce or tomato puree for the tomato sauce.  thanks.PDX cookPortland, OR2/17/2021Super easy, but the various ingredients need tune to cook down, so save yourself a solid hour. Otherwise it was incredibly easy to throw together. My Indian boyfriend is a notoriously picky eater and he loaded his plate three times and ate himself into a food coma on this. Without knowing him, you don’t know what a high degree of recommendation this is. AnonymousOrlando, FL2/16/2021Explore Bon AppétitStewSoups and StewsCajun & CreoleAmericanOkraVegetableSausageMeatShrimpShellfishSeafoodQuickOne-Pot MealsWeeknight MealsMainGluten-FreeNut-FreeDairy-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Maya L. Harris"]}