{"id": "45e636a10f16a83b0ba1fe9f37fd37cf", "url": "https://www.bonappetit.com/story/best-wings-in-buffalo", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "Who Serves the Best Wings in Buffalo? I Ate at 12 Spots to Find Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWho Serves the Best Wings in Buffalo? I Ate at 12 Spots to Find OutI went on a ravenous search for the best Buffalo wings in the city they’re named after. And yes, I found them.By Alex DelanyJuly 30, 2018FacebookTwitterEmailFacebookTwitterEmail“Why are Buffalo wings called Buffalo wings?” asked a nameless, slightly-stoned college sophomore for the six millionth time in the history of slightly-stoned college sophomores. “Are they made from, like, buffalo...s?”No. Of course they aren’t. Please, let all buffalo meat queries cease here. Buffalo wings are chicken wings tossed in Buffalo sauce. That sauce is called Buffalo sauce because it was invented in Buffalo, New York. And I recently went there to find the best Buffalo wing in the city.Buffalo is not one of the country’s health food capitals. It is known for Buffalo wings, roast beef and horseradish sandwiches (called a Beef on Weck), charcoal-grilled hot dogs, and as I learned from Buffalo’s more outspoken residents, pizza. I’m still not sure that I believe that. There’s only one city in New York I trust for pizza. But I admire Buffalo’s commitment to anti-health foods, and showing up there to overdose on one of the greatest finger foods of all time felt right. So after a couple cheap beers at The Old Pink (a truly world class dive bar, which deserves its own article) and a long night of sleep, I did.What makes the perfect Buffalo wing? Here’s what I was looking for:Flats are, in my professional opinion, the superior chicken wing format.\nPhoto by Kevin DyniaThe ChickenA jumbo wing is not a good Buffalo wing. Neither is a tiny wing. For the right ratio of skin to sauce to meat, you want a medium-sized wing. The meat itself should never be dry. This is dark meat chicken we’re talking about. Tender is the name of the game.The SkinIf you take a bite of a chicken wing, and all of the skin pulls off in one gummy piece, something is wrong. The skin on a perfect Buffalo wing should be crispy, not gummy, and you should be able to tear off a bite without the rest of the skin coming off. Emphasis on crispy. A good Buffalo wing is deep-fried, not baked. If something is deep-fried, I’m expecting a crispy exterior. Anything less is suspect.Left: wings at Gabriel’s Gate and right: The Wing King, Drew Cerza, founder of Buffalo’s Chicken Wing Festival\nPhoto by Kevin DyniaThe SauceNo one has ever called a Buffalo wing clean. They are inherently messy, covered in a near-neon orange sauce that makes them so delectable. It’s the sauce, for the most part, that sets apart a good wing from a great one. The sauce is the first thing you taste when you eat a wing, and a truly top-notch Buffalo sauce should be balanced.There are three main components in Buffalo sauce: heat, creaminess, and acid. You should get just as much tang as you do spice, and those two should be held down with an appropriate level of butter. It’s a symbiotic relationship, one that can fall out of whack if one element dominates. When you experience a sublime Buffalo sauce, this is what happens: The heat from Frank’s hot sauce (the traditional hot sauce used in Buffalo sauce) and added cayenne pepper exists in the back of your throat. The acidic zing of Frank’s and white vinegar lives on the front of your tongue. And the creaminess from the melted butter base coats everywhere in between.The Bar Bill Tavern wings, in all their glory.\nPhoto by Kevin DyniaThe wings should never be dunked in sauce. The proper saucing technique is to gently toss the wings in a large bowl, with a little bit of sauce at the bottom. This way, the wings get coated in enough sauce, but not enough to turn the skin soggy. No chicken wing soup, thanks.Drums and FlatsIt is also worth bringing up the drums and flats debate. Some like the accessibility of a drum. Some, the tender, easily-sauced meat of the flat. I am a flat person. But I couldn’t go around eating flats and no drums. That wouldn’t be fair. I judged each place based on an even mix of flats and drums. With all these criteria sitting in my brain, I determined a champion.And the Best Chicken Wing in Buffalo...Me, looking at the the image of Buffalo wing perfection at Gabriel’s Gate\nPhoto by Kevin DyniaIs from Gabriel’s Gate. The wings there held a sense of authority that I imagine every other wing in town aspires to. The sauce was balanced to a tee, with equal, dedicated effort put in by the heat, acidity, and creaminess. It was the kind of sauce you’d put on nearly everything: meats, vegetables, and snacks (say...popcorn). You might not admit to it, but you’d toss a damn salad in it, in the privacy of your home, away from the eyes of the folks who have never experienced the righteousness that is that sauce. They wouldn’t understand.Each bite was initiated with a crackle and followed by a juicy, fatty chew. They stayed crispy, too. There wasn’t excess sauce, just enough to keep the skin both coated and crackly. It was a perfect Buffalo wing, the kind you wouldn’t hesitate to order another 10 of (solely for personal consumption).Not that it factored into my decision, but the atmosphere inside of Gabriel’s Gate was killer too. If you go ahead and imagine what Grizzly Adam’s sports bar would like like, it looked like that. Half-cabin. Half-bar. And another half...everything else. There was something mythical about the whole thing, which explains why the wings were so damn dreamy. If you’re in Buffalo for wings, Gabriel’s Gate is your spot.The Top Three Wings in Buffalo:Gabriel’s GateElmo’sMammoser’sOther Wing Spots I Hit: Bar Bill Tavern, Doc Sullivan’s, The Blackthorn, The Lenox Grill, Anchor Bar, Duff’s, Cole’s, Glen Park Tavern, and Gene McCarthy’sSome of you may be thinking, Wait, why didn’t they go to my favorite wing joint? Without naming names, I'll say this: There were a couple Buffalo restaurants that did not want to sign the paperwork they needed to sign in order to appear in this video. And that’s totally fine. But remember, if you want to be the best, you have to play the game.Now...about the New York city I trust for pizza:What’s the Best New York Slice? I Ate at 30 Pizza Joints to Find OutSauce. Cheese. Dough. Attitude. It all matters.View StoryExplore Bon AppétitBuffaloChicken WingVideoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Alex Delany"]}