{"id": "45ee6dd708d21e388da06952ba291048", "url": "https://www.bonappetit.com/story/pam-baking-spray", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Pam Baking Spray Is Sprayable Flour That Saves My Bundts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePam Baking Spray Is Sprayable Flour That Saves My BundtsIt’s a harmless shortcut that works.By Alex BeggsNovember 13, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The moment you have to flip a Bundt cake onto a wire rack, oh man, the suspense—will it stick to the pan? Will the sculpted ridged humps come out torn and raggedy? After all that time you put in, you’ve got a cake with 50-50 odds: Will it come out cake-box perfect? Or will it look like it got excavated from the rubble of Pompeii?This is where all the time I spend on Reddit comes in handy. There, somewhere in a stream of comments, a friendly stranger recommended Pam Baking Spray for, well, everything. There’s regular Pam, aerosol baking lube (sorry, that’s what it is!) that spits out a combination of oils and super flammable hydrocarbons (which is why it turns into a flamethrower when used IMPROPERLY). And then there’s Pam Baking, which adds “real flour” and some “flavors,” to that mix. Instead of coating a pan with a sheen of slippery oil, Pam Baking comes out in a frosty white spray that smells like a sugar cookie.This is the kind of preservative-filled chemical product that professional pastry chefs Do. Not. Use. Pastry chefs will expertly coat the pan with butter and dust it with flour and accomplish the same nonstick thing. Pam is kinda lazy. And I am kinda lazy. Which is why I am drawn to this alternative. (When I flour pans, I always do a shoddy job and the cake still sticks. Did I use too much flour? Not enough? I certainly used enough flour to coat my entire kitchen floor, counters, and sink!)I recently used Pam for baking on Maida Heatter’s East 62nd Street Lemon Cake, one of the first viral recipes from pre-internet times. The last time I made it, the cake was a stuck-to-the-pan dried-out disaster. THIS TIME, it sha-wumped out of the pan easily. There was one blemish because I definitely underbaked the cake by 15 minutes, a user error I can’t fix with aerosol. But that was it. (On the Pam Baking bottle, there’s a lovely Bundt cake with a delicate zigzagged glaze. Even the people at Pam know that sometimes there will be imperfections, and you will hide them with glaze.)I’ve since used the spray on my pan for Basically’s easy chocolate cake, underneath the parchment paper for Basque cheesecake, and for Food52’s Genius Desserts almond cake. All worked just fine, and I didn’t detect that the mysterious vanilla flavor had transferred to the final baked product. I’d guess that they put those “natural flavors” in there as a food science mind trick for cooks. When you use it, it smells like cake, therefore it’s for cake, which means your cake will be great. I think this stuff is fascinating, but you might think it’s an affront to the art of cooking. Whatever! It’s $3. What have you got to lose? Your credibility as a food writer? Aw, come on.Pam Baking Spray$3 at TargetExplore Bon AppétitHighly RecommendCakeShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-13", "author": ["Condé Nast", "Alex Beggs"]}