{"id": "45f9dd81e5e5adad26e71d1a5daccf47", "url": "https://www.bonappetit.com/story/jessica-largey-simone", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "How Jessica Largey Battled Anxiety and Self-Doubt Before Opening Simone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Jessica Largey Battled Anxiety and Self-Doubt Before Opening SimoneThe James Beard award-winning chef took three long years to fight her demons and explore her new home in LA.By Jessica LargeySeptember 18, 2018FacebookTwitterEmailFacebookTwitterEmailJessica Largey thought she’d take six months off after leaving Bay Area restaurant Manresa (where she won a James Beard award as chef de cuisine) and before opening her first restaurant in LA. Three years and a lot of setbacks later, Simone, a produce-driven restaurant in the Arts District, will begin service on September 20th. We can’t wait to snag a reservation, but, in the meantime, we asked Largey to fill us in on how she’s found sanity outside the kitchen these last few years, and how she’s prioritizing mental health for both herself and her kitchen staff at Simone.I didn’t cook professionally for three years, which made me feel crazy. But I had a lot of time to think about my time at Manresa, how I was so burned out and overworked. I was 25 and winning awards, and people were telling me that I had a dream job while I didn't even know how to get through Wednesday. I went from a very confident line cook to the most insecure chef de cuisine of all time, and I think a lot of my struggle and depression there came from not having someone to look up to in the kitchen. I didn’t know how to be myself and also have a creative voice. All these people were looking to me for answers, and I felt like I had to always be right.\nOver the last three years, I’ve gotten to a place where I can say, “I don’t know. Let’s figure it out together.” That’s been huge.While we were getting Simone off the ground, I really wanted to work; I wanted to be creating. But it was also nice to have time to go out to other restaurants, to cook at home, and just learn how I liked to eat. I found myself cooking a lot less meat. There was intention behind that, to eat more plant-based food, but it was also what I was craving.Cooking for one person is really hard in general, but it’s especially hard for a chef. I was always begging my friends to stay for dinner because I had so much food. I’d go to the store or the farmers’ market, grab a bunch of stuff that looked great, and see what happened. I ended up turning some of these off-the-cuff creations into dishes at Simone. Yes, there’s a grain bowl on the menu!I also fell in love with being a morning person. I was waking up at 6 or 7 a.m. without an alarm, and I’m still doing that even though my hours at the restaurant have ramped up. Being up early feels like one of the best things I can do...for me but also for my relationship with my partner. It’s a secret time. There’s no expectation of communication; you get to hide and not be attached to your devices.I have little rituals, like making my Chemex coffee and devoting all my attention to it for those five minutes. Or taking a walk. When I moved to LA two and a half years ago, I took a lot of care getting to know my neighborhood on foot. Being able to walk in this city brings me a lot of joy. I can walk to Elysian Park; the LA River path is right by me. I can ride my bike for ten miles from right outside my door. I walk to Cookbook in Echo Park and a million amazing coffee shops. Getting to Simone only takes 45 minutes on foot. Even a short walk can change your day.I’ve spent the last three years working on myself, and I’m so happy to be putting all that into practice and working with other people. I want to teach my chefs and cooks that they don’t have to do it the way I did it. They can be who they are at work, and they can have a life outside of it.There are a lot of people in the kitchen at Simone. I’ve never worked with any of them before, and that was intentional. I tried to let go of my workaholic habits, all the pressure I put on myself, and wipe the slate clean. It’s been empowering.I try to not have gender be a part of my mindset, but it is a big issue in this industry. I was leading my cooks around the farmers’ market one day, and someone jokingly said to another one, “We lost mom.” I said to them, “If I were a male chef, you’d never call me ‘Dad.’”  Another time, I noticed a cook say to another cook, “ladies first.” I had a talk with my whole staff after that, and I told them, “We need to be aware of the fact that all these little things perpetuate a gender imbalance in this industry.” I tell my servers to pull out the chairs for everyone; not just the women. I tell my cooks never to assume that a woman will be okay with a smaller piece of meat than a man. As a manager, I like to be silly and have fun, but I can be very serious too. You can call me “Jess” unless things are very intense. Then you can call me “chef.”As told to Amanda Shapiro. Gillian Ferguson contributed reporting for this story.Explore Bon AppétitHealthyishChefsLos AngelesManresaInterviewsRead MorerestaurantsClaudette Zepeda-Wilkins on What It Means to Open a Matriarchal RestaurantBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Jessica Largey"]}