{"id": "460ecb4a4459ba5296d80d0741117bb5", "url": "https://www.bonappetit.com/story/kourtney-kardashian-natural-wine", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "I Guess I’d Drink A Glass of Wine With Kourtney Kardashian? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Guess I’d Drink A Glass of Wine With Kourtney Kardashian?I have something in common with a Kardashian and I’m not afraid to admit it.By Emily SchultzApril 4, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Food on the Internet! A column from Rachel Karten and Emily Schultz, BA’s social media team, dedicated to all the weird things we see while scrolling, double-tapping, and retweeting.It’s April 2019. Jim Carrey and Benito Mussolini’s granddaughter are feuding on Twitter, Aunt Becky bribed her daughter’s way into college, and Kourtney Kardashian and I have the same taste in wine. What is happening?On Tuesday, Kourtney Kardashian launched Poosh, which sounds to me like the written description for 💨, but is actually her new beauty and wellness website, full of content like Daily Habits to Lead A More Mindful Life (includes walking), Kris Jenner’s FAMOUS BROWNIE RECIPE (walnuts!?), and What KOURT Does Before A BIG NIGHT OUT (spoiler: it’s all about under-eye gel patches, folks). Yeah, none of these are very me. But then Eater alerted me to a hidden gem deep inside the poosh: that Kourtney Kardashian is into natural wine.The article opens with an image of a woman ensconced in a bed of white, fluffy sheets, holding a glass of red wine high over her head. Risky! See, my sheets are black for the sole purpose of hiding the snacks I regularly spill in bed. “Organic wine is better for your body and the environment,” the article opens, before preceding to explain that the minimal use of sulphites in organic wine can lead to less of a hangover. This first part is true! My issue with the second is that, for one, the headache bit is not proven science. But even more importantly, I often opt for the chilled light reds that are so chuggable and tasty that I drink just enough for a hangover. Whatever, I know what I signed up for.Scrolling further, I come face to face with her suggestions: German winemaker 2naturKinder’s Silvaner, Alessandro Viola’s sparkling Blanc de Blanc, La Moresca’s rosato, just a few of my favorite producers and their bottles all right there. Technically, the article calls them “organic,” which just means the vineyard growing the grapes has been certified, but most of these bottles are actually natural, which means nothing extra is added to the grape juice, regardless of how the fruits themselves are grown. (We get what you mean though, Kourt.) My jaw drops. How could it be? Where did she get these recs? Since when did we have anything in common?All of a sudden, I start imagining me and Kourtney sharing my favorite bottle of sparkling orange wine from Greece. I picture myself introducing Kris to Martha Stoumen’s wines, a female winemaker who makes her wine in California. Then there’s me and Kylie popping a bottle of bubbly Australian Rosé pét-nat while Travis Scott takes Stormi to the park. I think about Kim, and wonder if she’d be into a Tuscan Chianti—something to remind her of the simpler times of marital bliss. Getting carried away in a sweeping fantasy of spontaneous fermentation, carbonic maceration, and skin-contact (grapes only, get your head out of the gutter), I pause and wonder what it all means.Naturally, I turn to Instagram. Adam Vourvoulis, maker of wine, podcasts and cool t-shirts, thinks its rad: “Kourtney is selling natural wines to the audience they’ve built and I couldn’t be more excited that the wines I love are getting this kind of attention. I’m super stoked on this,” he posted. Then I DM Erin Bender, manager of Brooklyn wine shop Irving Bottle to get her take. “I would love to see some 2Naturkinder on Keeping Up with the Kardashians,” she writes back. Marissa A. Ross, Bon Appétit’s wine editor is all for it too. Having more visibility and accessibility is what matters, right? Right! Natural wine is for everyone!So yeah, Kourtney may have meant natural when she said organic, and yes, she is whispers a Kardashian, but if she’s exposing more of the world to the delicious wines that are better for the environment AND for the consumer, then we have no choice but to stan. So let’s cheers to Poosh with one of Kris’ brownies and a chilled glass of Beaujolais.Explore Bon Appétitnatural wineFood on the InternetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Emily Schultz"]}