{"id": "46119fab3395d387353a4ebad3c1b434", "url": "https://www.bonappetit.com/story/branded-the-airline-that-offers-the-freshest-farm-grown-produce-at-30000-feet", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "The Airline That Offers the Freshest, Farm-Grown Produce at 30,000 Feet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Airline That Offers the Freshest, Farm-Grown Produce at 30,000 FeetYour Singapore Airlines flight just elevated in-flight fare with sustainably grown farm-to-table cuisine.By Singapore AirlinesOctober 1, 2019FacebookTwitterEmailFacebookTwitterEmailIn a facility in Newark, New Jersey, in highly customizable, oxygenated chambers, beneath the encouraging glow of LED lights are rows of greens. Lots and lots of leafy, spicy, boldly flavored greens. This is AeroFarms, which just happens to be the world’s largest indoor vertical farm. It uses 95% less water than traditional farming methods and the greens grow happily free of pesticides, herbicides, and other similar chemicals. Once the greens reach peak freshness, they’re packed up and delivered to caterers who will prime them for their culinary journey on Singapore Airlines out of Newark Liberty International Airport. The result? Brighter, tastier meals in the air.AeroFarms' facility in Newark\nSingapore Airlines is no stranger to innovation. They’ve cultivated quite the reputation of “firsts.” Back in 1970, they were the first airline to offer free headsets, a meal choice, and free drinks in Economy class; in 1989, they became the first to fly non-stop across the Pacific between Hong Kong and San Francisco; and among many other firsts, they are the first to go to such great heights to support sustainability without sacrificing quality.For years, Singapore Airlines has been using more sustainable, plant-based ingredients in its in-flight meals where possible, sourcing local produce including everything from cherry tomatoes to pumpkins from farms in Singapore and destination countries. They’ve even sourced fish from fisheries certified by the Marine Stewardship Council for their sustainable practices. Not only does AeroFarms’ approach to reimagining plant-based cuisine offer more robust flavors in air, where taste is typically dulled in flight, but it also ensures access to fresh, nutrient-rich foods year round.A Singapore Airlines’ Business Class meal service\nSingapore Airlines’ food and dining program is already one of the best, featuring a team of chefs that even taste select meals in a simulated pressurized cabin to ensure maximum flavor 30,000 feet in the air. Their International Culinary Panel is made up of chefs from New York, Los Angeles, Milan, Mumbai, Shanghai, to name a few, and culls their epicurean expertise to develop delicious, inventive cuisine on board. Why should you wait until you land at your destination to begin a culinary adventure?Additionally, Singapore Airlines’ new wine program includes a new selection of high-quality, small-batch wines. For example, premium class passengers have access to the most in-flight Burgundy options, with 47 different labels in rotation over 18 months. Each wine has been handpicked by the company’s wine consultants, who personally sample and select each one.Each wine is carefully handpicked by Singapore Airlines' wine panel\nAs foodies and travelers alike are becoming more thoughtful about the food they eat on the ground, Singapore Airlines is bringing that same intention to their in-flight experience, effectively evolving the way we view airline cuisine forever.Hungry for more? Book your flight on Singapore Airlines today.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-01", "author": ["Condé Nast", "Singapore Airlines"]}