{"id": "461d7507479cbc41be890a9f7184d8c8", "url": "https://www.bonappetit.com/story/rejected-cooking-for-feminism", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Growing Up, I Rejected Cooking in the Name of Feminism—But What Did I Miss in the Process? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Rejected Cooking in the Name of Feminism—Until I Had to Feed MyselfI grew up thinking my feminism was a reaction to my kitchen-bound mom. Only later did I realize she cooked so I could be free.By Aurvi SharmaJanuary 6, 2021FacebookTwitterEmailIllustration by Larissa HoffFacebookTwitterEmailMy first feminist rebellion occurred in fifth grade. While enrolled at an all-girls’ school in a North India town, I was presented with a mandatory assignment to embroider a dining table runner with crimson cross-stitched lilies. I loathed threading the minuscule eye of the needle, and the teacher tsk-tsked at the back of my sample riddled with tangles. A quick check-in with the neighborhood boys confirmed my suspicion—there were no needlework assignments at the adjoining all-boys’ school. So I refused to embroider, becoming a 10-year-old renegade in the parochial hinterlands where, in the early ’90s, the idea of a modern woman evoked images of a cartoon vamp who wore her hair and skirts too short and wrecked homes by virtue of never cooking for her husband.But my rebellion was sneaky. I turned, as I always did during crises, to my mother, handing her my unfinished lilies. Besides helping me with homework, feeding the family, running the household, managing family finances, knitting sweaters for nephews and nieces, nursing sick grandparents, pickling radishes in winter and mangoes in summer, sun-drying poppadoms and lentil dumplings, darning torn pants, and sewing missing buttons, Ma also embroidered my runner, which earned me an A+.My father was an engineer with the government and was frequently transferred across North India. For the first six years of their marriage, Ma had shuttled between him and her political science lectureship, stocking his fridge with stainless-steel pails of kidney bean curry, matar paneer, and cabbage koftas while marking students’ work with a red pen. She attended shrieking pressure cookers set upon kerosene stoves as she prepared the week’s coursework in a city seven hours away. But this to-and-fro became impossible with two young daughters.Like most Indian men, my father was as helpless as my sister and me without Ma. My mother had wanted to become a medical doctor, but science in high school was a prerequisite to studying medicine, and Ma’s village school offered only the humanities for girls. Science was considered a masculine subject, too challenging for women. So Ma went on to earn a doctorate in political science instead, learning along the way how to knock a rifle at the National Cadet Corps and winning the medal of distinction. Then she quit her job to raise all three of us.Three times a day Ma served our family multi-dish meals. While she ate food long gone cold, she plied us with pea-stuffed parathas still sizzling from the skillet and creamy khichadi more languid than any risotto. When I finished homework she left me fresh pakodas and mango chutney along with dainty cups of lemongrass chai.The complex flavors of South Asian cuisine are created layer by layer, overlapping specific ingredients to build a consummate whole. The first step is almost always the chhonk, a technique where whole spices are tempered in hot oil. When I was a child, as Ma cooked, particular aromas hit me at different hours and I knew the time—curry leaves for a breakfast poha; cumin and fennel for an aloo-gobhi lunch; smoky black cardamom and the camphory nip of bay leaf for a long-simmered jackfruit curry at dinner. Ma’s cooking ordered my life, the scent of spices dividing my days into morning, noon, and night. Moving across 11 cities and seven schools, my mother’s food was the constant that steadied me.And yet, as I grew into teenagehood, I began to see this domesticity in a different light. The comforting clockwork of food turned Sisyphean, and I was convinced that cooking was for a woman who locked her true self in the spice cabinet.By the time I started college in Delhi, my girlfriends who entered arranged marriages had disappeared from my life. Formerly carefree aunts and cousins were consumed by the hunger of their husbands and kids. Worst were the boys I dated who casually remarked how lucky they would feel if I cooked for them. Never, I snapped. I had the statistics down: While Indian men average 36 minutes of unpaid household work every day, women carry out 10 times the amount of work, at six hours daily. On the cusp of adulthood, I promised myself I would not settle for this unequal bargain.To evade my 11 p.m. curfew, I lied to my parents that I was going for sleepovers and instead drank with friends in cars, danced in clubs till morning. After the clubs shut we headed to one of Delhi’s thousands of street food carts. I drove, balancing a plastic cup of booze between my legs. Ascending the city’s flyovers felt like taking off on a runway, soaring away from millennia-old tyrannies.At 3 a.m. the street cooks delivered their delicacies straight to the car. I placed the steel platters on my bare lap and my thighs burned, my fingertips oily as we ripped the potato parathas fragrant with ginger. We shared charcoal-grilled goat kebabs rolled inside kerchief-thin roomali roti. We gobbled juicy pork momos prepared in steamers strapped to bicycles, served with an incendiary red chutney that set my lips on fire.In those early hours I was one of a handful of women there, surrounded by a carnival of men. Popping the last momo into my mouth, just as dawn broke upon Delhi’s centuries-old tombs and spires, I often wondered drunkenly: Why would I ever cook for a man when I was clearly the one meant to be eating?When, at 22, I got accepted into a graduate writing program in England, I thought I’d finally found a ticket to the 21st century.I imagined a glamorous reprieve abroad, but the quiet hamlet in rural Cornwall turned out to be the opposite. For the first month I subsisted on soggy heat-and-eat pastas that I hid under a shower of chile flakes. The frozen curries all tasted the same—sweet and bland—smelling of a mysterious condiment called “curry powder.” Friendless, I loitered alone on the white pebbled beaches. It rained constantly and water seeped into my boots.On one walk, three different people complimented my “good English” and a seagull nearly pooped on my head. I returned to my dorm exhausted and fell asleep fully clothed, still in my wet socks, longing for the deep funk of my mother’s dal and the grounding heft of my family’s dining table. But the kitchen was as alien to me as this new country.When I woke up I unpacked the spices my mother had placed in my luggage, “just in case.” In my sparse dorm kitchen, I carefully measured out oil and set a pan on high heat. The next few minutes were a series of petite disasters—the cumin seeds charred when I added them to the too-hot oil. I burned the coriander powder. I scorched the onion. The potatoes somehow were half-cooked and half-singed.I repeated this ceremony every evening for the next week, burning my spices each night, ending with a morose dinner of white bread spread with I-CAN’T-BELIEVE-IT’S-NOT-BUTTER. I was thankful for the pre-softened not-butter and the toaster that did not demand any skills. All my life I had focused so hard on succeeding in the non-domestic that admitting I couldn’t even feed myself felt like the sharpest failure.And so, as always, I turned to my mother for help, confessing my kitchen calamities to her over Skype. She laughed and said, Let’s cook.Now? I said, surprised. She nodded nonchalantly. I grabbed my pan and we got to work.Over the next few weeks, my mother taught me how to cook by sight, smell, touch, and instinct. Every day I burned the spices a little less, learning how to balance flavors more. Under Ma’s guidance, I slowly mastered flambéing ghee for smoked raita, making rotis that ballooned like pufferfish over blue gas flames, cooking fragrant basmati so each grain remained long, soft, distinct.As we cooked together we reminisced how she used to bake birthday cakes for my sister and me in toaster ovens. How she unearthed dusty bottles of soy sauce in small-town grocery stores. How she clipped recipes from English-language magazines and made us pizza, puddings, and tortillas from scratch. Ma cooked and opened the world for us. In a society that constantly devalued girls, she raised two strong daughters, only ever asking us to focus on ourselves. Go play, enjoy, be yourself, she told us—a radical act for women even today.Oppression is a big word, but it manifests in small ways. My mother reminded me how my village grandmothers had little power and it was the kitchen where they found respite. In the chai-colored courtyards of their mud homes, village women gathered to cook communal meals on wood fires, roll out potato chips, wash wheat, pickle limes in mustard oil. The women sang, swapped life stories, and corralled relief in their culinary sisterhood, a smidgen of agency in a culture that repeatedly denied them.I had rejected cooking to assert my independence. But food for me was home itself. Family recipes were codas that held memories of grandmas who squatted in front of open fires and, like alchemists, turned ingredients into inheritance. When I was ready for it, my mother had passed on this legacy to me.Two months later on a wet Cornwall afternoon, I braised small eggplants in a sauce of coconut, peanuts, and tamarind. I simmered dal with chunks of unripe mango and set it ablaze with a chhonk of asafetida and chiles. I roasted cumin seeds on a skillet, placed them in my palm, and crushed them with my thumb the way I had seen my mother do innumerable times.After setting the table for one, I balanced the laptop on a tower of books and clipped the webcam on top. When my mother called I showed her the feast. I wished I could feed Ma this hot food the way she had fed me all my life. But I was at peace. From halfway around the world, my mother had gifted me the exquisite pleasure of feeding myself.Explore Bon AppétitFirst PersonIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-06", "author": ["Condé Nast", "Aurvi Sharma"]}