{"id": "461d5f1ffab30ee55162fdf092a56776", "url": "https://www.bonappetit.com/story/clydes-lynn-nottage", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "'Clyde's' on Broadway Is a Comedic Feast With a Serious Point | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureClyde’s on Broadway Is a Comedic Feast With a Serious PointSandwiches—and a critique of the American prison system—take center stage in this play from two-time Pulitzer Prize–winner Lynn Nottage.By Chala Tyson TshitunduNovember 23, 2021FacebookTwitterEmailPhotograph by Monique CarboniFacebookTwitterEmailDoes the perfect sandwich exist? While there will never be a universally accepted answer, the valiant quest for sandwich perfection is what drives playwright Lynn Nottage’s new comedy, Clyde’s, directed by her longtime collaborator Kate Whoriskey. Opening at Broadway’s Second Stage Theater on November 23, Clyde’s is a genuinely funny and deeply emotional exploration of radical imagination, restorative justice, and the healing power of food.Set in the greasy kitchen of a bustling truck stop, Clyde’s follows line cooks Letitia (Kara Young), Rafael (Reza Salazar), and Jason (Edmund Donovan) as they navigate life after incarceration. Fighting to stay out of the system, these troubled cooks are worked to the bone by their cantankerous boss Clyde (Uzo Aduba), a vicious egotist who takes her self-loathing out on her employees.Despite their differences–and Jason’s white supremacist prison tats–the unlikely trio manage to find harmony and solidarity through the tutelage of Montrellous (Ron Cephas Jones), a wise older cook who mentors his peers in the “gospel of good eating.” During rare moments of respite from Clyde’s hilarious yet terrifying tirades, the cooks come together to dream of that most noble pursuit: creating the perfect sandwich.Food is more than a plot point in Clyde’s–it’s the show’s foundation. “I was thinking about the tension of opposites in food, like savory and sweet,” Nottage tells me, recounting the writing process. “Things that are dissonant and harmonious, and how they shouldn’t work, but somehow when combined, they do.” By juxtaposing slice-of-life workplace comedy with precise social commentary, Nottage showcases her ability to mine the painful nuances of everyday life for much needed nuggets of humor. “After what we’ve been through this last year, people want to laugh,” Nottage says candidly. “People want to be reminded that, at the end of the tunnel, there is hope and joy.”“Baby eggplant parmigiana with puttanesca on an olive and rosemary ciabatta,” Rafael pitches to the group in one scene. “Bacon, lettuce and grilled squash on cornbread with molasses butter,” Letitia responds. “Curried quail egg salad with mint on oven-fresh cranberry pecan multigrain bread,” Montrellous declares, getting the final word in before Clyde yells for American cheese on white, snapping everyone back to work.When the cooks gather to share their ideas of the perfect sandwich, the entire pace on stage slows as the scene transforms into a stunning dreamlike sequence heightened by lighting designer Christopher Akerlind’s use of cool colors and soft light. As the cooks are suddenly beamed into this realm of higher consciousness, the hyperrealistic greasy spoon designed by Takeshi Kata (featuring wall-to-wall safety posters and grimy handprints on the walk-in fridge door) completely fades into the distance. These scenes, which are one of the most captivating parts of the show, imbue Clyde’s with a buoyant sense of magical realism that underscores just how much these four people love to cook, and how little they’ve been allowed to dream because of their pasts.“The plays that I write center people who have been marginalized by circumstance,” Nottage says, “who the American majority have not necessarily deemed worthy of placing center stage.” Clyde’s is a part of a long lineage of Nottage’s renowned plays–often directed by Whoriskey–that champion the stories of poor and working-class underdogs. Their first collaboration, 2003’s Intimate Apparel, is about a Black seamstress named Esther who finds social freedom in early 1900s New York through her skills at the sewing machine. Another collaboration, 2009 Pulitzer Prize–winner Ruined, revolves around a group of women trying to survive in a small tin mining town in the Democratic Republic of Congo.In fact, Nottage first came to the idea for Clyde’s while researching her 2017 Pulitzer-winning drama Sweat (also directed by Whoriskey), which follows the lives of workers in the factory town of Reading, Pennsylvania. “A lot of men coming out of prison could go to Reading and find a decent job for many years,” Nottage says. “But with the economic downturn and the closing of the railroad, industry shut down. One of the few places that [people leaving prison] could find work was in the food industry.”Before you see Clyde’s (or even if you don’t), you might benefit from quick crash course in the American carceral system: The U.S. has the largest prison population in the world, with nearly 2.3 million people currently behind bars; America is also a global leader in recidivism, with more than two thirds of those released from U.S. prisons ending up back in the system within three years; and with a staggering unemployment rate of 27 percent, those who can stay out face a serious lack of economic opportunities that leaves them incredibly vulnerable to exploitation from bosses looking to cut costs and cut corners. Bosses like Clyde.“I thought it might be interesting to look at the ways in which [people are] physically and spiritually being exploited and whether there is room for their spirits to be resurrected,” Nottage says. As the cooks try to keep their heads down, they’re continually pushed to the limit by Clyde’s constant degradation and jokes at their expense. Even when the staff find small moments of pride in their work, Clyde takes it upon herself to knock everyone down a peg. “Clyde could or could not be the devil, and Montrellous could or could not be an angel,” Nottage laughs. “The whole play is about good and evil.”As any line cook knows, a commercial kitchen is a place where dreams can be built and crushed at the drop of a chef’s hat. “I set it purely in the kitchen because it’s limbo,” Nottage says. “​​I wanted it to feel confining, but at the same time liberating.” And by setting Clyde’s at a truck stop in the middle of nowhere, Nottage dramatizes how liminal and trapping these spaces can be. But, as the show progresses and Letitia, Jason, and Rafael become more compassionate with one another (and themselves), they undergo a true transformation. “Through the help of Montrellous, they’re given these incredible tools to access their creativity,” Nottage adds. “That space that felt confining suddenly becomes a symbol of their liberation.”“What’s beautiful about the play is that it is affirming,” Whoriskey says. “We have these characters who seemingly will not get along, and we see them build a community. Through the strength of the community, their individual selves are strengthened.” While it’s not fair to describe Clyde’s as a “feel-good” play, it’s incredibly moving and refreshingly uplifting. Together, Nottage and Whoriskey have staged yet another triumph; one that unequivocally states that self-forgiveness is attainable for anyone willing to keep an open mind, and that even ex-convicts have the right to dream of a better life. “Folks aren’t the sum total of the worst thing that they’ve ever done,” Nottage says. “The people who are in Clyde's are fundamentally good people who have, in their past, done something that might be morally questionable.”According to Nottage, the producers of Clyde’s are hoping to practice what the show preaches: Second Stage Theater has created three apprenticeships for people with criminal records to work with the crew for the entire run. Nottage and Whoriskey also shout out Minneapolis sandwich shop All Square, whose energetic and joyful staff of formerly incarcerated cooks lent inspiration to the direction of the play. “Theater is really all about shifting perspective,” Nottage says. “What I hope people take away from [Clyde’s] is the humanity of the folks I am centering.” One thing is for certain–you’ll leave this show craving another serving.Explore Bon AppétitCultureNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}