{"id": "4643b3ed8a84b05c429eea5c652640a1", "url": "https://www.bonappetit.com/story/ghirardelli-dark-chocolate-brownie-mix", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "The Best Brownies Are the Ghirardelli Dark Chocolate Brownie Mix and I Will Not Apologize | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Brownies Come From a Box and I Will Not ApologizeI don’t make Ghirardelli’s dark chocolate brownies because they’re easy. I make them because they’re the best.By Sohla El-WayllyFebruary 25, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by pearl JonesFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The instructions on the box of Ghirardelli’s dark chocolate brownie mix couldn’t be simpler: Place water, oil, and egg in a medium bowl and stir until fully mixed. Instead, I like to crack the egg in a separate bowl, whisk it well before adding the oil and water, transfer it to a measuring cup with a spout, then finally stir it into the brownie mix. I use two bowls, a whisk, a spatula, and multiple measuring cups because I can’t help myself. But all the extra steps I add really don’t make a difference because these brownies really can’t get any better.My mom always stocked our pantry with boxes of this brownie mix when I was growing up. Not the reasonable 20-ounce package but the 7-pound pack from Costco. I’d face-plant into them when my best friend and I fought. I’d stress eat them while cramming for AP exams. I still look to them as the definitive brownie. No homemade brown butter, fancy Dutch cocoa, or tahini-swirled deal has ever come close for me. I guess it’s true what they say: You never do get over your first love.Most brownies are either fudgy or chewy, but somehow this brownie hits both ends of the spectrum. I don’t know how they do it, but there's drama in this box. The contrast between the thin crispy-chewy edge and the dense fudgy interior, studded with bittersweet chips, is so much more extreme than in any homemade brownie. I’m a corner person myself and this mix makes the ultimate corner piece. The edges are a little crunchy and a lot chewy while the middle has just the right amount of soft doughy texture and melty chocolate. The top features an ultra-shiny crackly top that adds a little sugary crispness to every bite. I don’t make Ghirardelli’s box mix brownies because they’re easy (which they totally are). I make them because they’re the best.Buy this: Ghirardelli Dark Chocolate Brownie Mix, $3 at TargetAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingBrownieRead MorecultureHeilala Vanilla Bean Paste Is the Best Gift For the Baker in Your LifeBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-25", "author": ["Condé Nast", "Sohla El-Waylly"]}