{"id": "465ad3787d968daf9bb1fe46b542616c", "url": "https://www.bonappetit.com/story/natural-food-coloring-suncore-foods", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "The Natural Food Coloring that the Bon Appétit Test Kitchen Swears By | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By This Natural Food ColoringRed Lake 40, Whomst?By MacKenzie Chung FeganDecember 11, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI didn’t realize how ungroovy my cookie game was until I saw Rick Martinez’s Tie-Dye Butter Cookies on the cover of the December issue. Swirled with licks of hot pink and cobalt blue icing, they were developed with fierce holiday cookie swaps in mind, but they’d be just as welcome at a Grateful Dead tailgate or a VSCO Girl theme party. “I knew that I wanted colorful cookies that were festive but that didn’t scream Christmas,” Rick told me. Out with the green and red, in with the pink and blue.Rick also knew that he didn’t want to use synthetic food coloring in his cookies. “The stuff you get at the grocery store does a number on your dough,” he explains. “If you add a tablespoon of it to a perfectly delicious, moist cake recipe, it’ll come out sad and dry.” The antithesis of the holiday spirit! Plus, what is synthetic food coloring anyway? According to respected scientific journal Wikipedia, the food coloring Blue #1, which is found in everything from Jolly Ranchers to canned processed peas to Blue Curaçao, is a “synthetic dye produced by the condensation of 2-formylbenzenesulfonic acid and the appropriate aniline followed by oxidation blah blah blah.” For our favorite recipes using 2-formylbenzenesulfonic acid, click here.Watch Rick go to work on his Tie-dye cookies.\nSo Rick went in search of a natural food coloring alternative. “I certainly wasn’t going to ask anybody to make a natural dye,” he says—although if you are the extra credit type, check out Healthyish’s guide to making your own. He settled on Suncore Foods Supercolor Powders, which come in a wide array of hues, from violet to aqua to yellow. For the Tie-Dye Butter Cookies, Rick used the Pink Pataya (made from 100 percent pure red dragon fruit powder) and Blue Butterfly Pea (made from 100 percent pure butterfly pea flower powder). In addition to having pronounceable ingredients, the natural dyes impressed Rick with their vibrancy and variety. “If you were using that little four pack of green, blue, yellow, and red,” he says, “you’d have to do a lot of mixing to get such a specific fuchsia color. Even then it would be tough, and if you had to make several batches, you probably wouldn’t be able to achieve the same color consistently.”Forecast for 2020: more tie-dye.\nPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle Gatton, prop styling by Beatrice ChastkaSince the powders are derived from actual foods, they do come with a slight taste, but nothing too conspicuous. “If you’re using the red powder, you’re not going to take a bite of a cookie and go, ‘Whoa, beets!’ But it does have a faint flavor, so you know you’re not just eating red powdered sugar and water.” The Pink Pataya powder gives off tropical vibes while the Blue Butterfly Pea is more subtle, with a hint of flavor that Rick describes as “berrylike.” Together, they add a ever so slightly fruity hint to an otherwise classic, vanilla-inflected butter cookie.Rick notes that while the two cookies he developed for the holidays featuring these dyes—the Tie-Dye Butter Cookies and the Alfajores with Coconut Dulce de Leche—use them in raw applications, he has tested them in batters and doughs with equally successful results. While the outside of the cake or cookie will brown as normal, inside you’ll find the same bold color—no 2-formylbenzenesulfonic acid required.Buy it: Suncore Foods Supercolor Powders, from $10 on AmazonAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Get the recipesTie-Dye Butter CookiesDid you hear? Tie-dye is back. And thanks to our easy Swirl-n-Dip method, it’s also edible.View Recipe Alfajores With Coconut Dulce de LecheThe traditional South American cookie gets a twist in this shortbread sandwich filled with coconut dulce de leche.View RecipeExplore Bon AppétitproductHoliday 2019ShoppingHoliday CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-11", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}