{"id": "465bce73b5b882762e2d066ee6495dba", "url": "https://www.bonappetit.com/story/its-holiday-cookie-season", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "It’s Holiday Cookie Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Holiday Cookie SeasonRecipes inspired by our childhoods.By Sonia ChopraDecember 2, 2020FacebookTwitterEmailPhotograph by Laura Murray, food styling by Sue LiFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.When you think about your favorite cookies, what comes to mind? I feel like I have at least three: a cozy-coffee-shop cookie (Culture Espresso’s chocolate chip, served-hot), overachiever help-me-win-the-cookie-swap cookie (tricolores), and fancy cafe cookie (Té Company’s perfect pineapple linzer torte).But in my heart, when I think about my favorite cookies, bar none, they’re always the ones that bring me back to childhood—the Danish butter cookies in that royal blue tin, the big sugar cookies with royal icing and colored sprinkles that I’d get from the bakery in my hometown as a treat, the oatmeal chocolate chip ones I’d make with my mom (and, true to kid form, would sneak plenty of batter from along the way).Want this letter before it hits the website? Sign up for our newsletter!Sarah Jampel's buttery, jam-filled tahini linzer torte bars.\nPhotograph by Laura Murray, food styling by Sue LiWhich is why I am so excited that the holiday cookie package in this year’s Holiday Issue (subscribe here!) is all about cookie nostalgia. Our recipe developers looked back at the cookies they loved the most growing up and upgraded them for our 2020 lives: more sprinkles, more chocolate, more nuts, more pizzazz. They range from fudgy bittersweet pizzettes and gingery marranitos enfiestados to a super-fun Fig Newton upgrade with tahini and beautiful brown butter and pistachio sables, and I think I love them all.I’d love to hear what cookies you’re baking or ordering or hoping to be sent this year, and whether that’s tradition for you or something new you’re trying this holiday season. As always, I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-03", "author": ["Condé Nast", "Sonia Chopra"]}