{"id": "465c15009457370eaab2b7392facdbdb", "url": "https://www.bonappetit.com/recipe/one-pan-weeknight-sausage-and-peppers", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "One-Pan Weeknight Sausage and Peppers Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDOne-Pan Weeknight Sausage and PeppersSponsored by Field Roast FacebookPinterestTwitterEmailPhoto by: LAURA MURRAYServing Size: 4 PeopleBon Appétit has teamed up with Field Roast, the makers of artisanal plant-based meats and cheeses, to explore the great tastes of the holiday season. Readers submitted their original Field Roast holiday recipe's for the chance to be featured in this December’s Bon Appétit magazine! Our winning recipe, submitted by Nadine Lockitch, is a must-have at the end of a winter day. This hearty one-pan recipe featuring Field Roast Plant-Based Italian Sausage, vegetables, and spices, packs bold flavor. It's guaranteed to become a weeknight mainstay. \nFind more recipe inspiration from Bon Appétit and Field Roast's Gather What's Good recipe series.PrintIngredients1 12.05-oz. package Field Roast Plant-Based Italian Sausage, sliced into ¼\" rounds¼ cup extra-virgin olive oil1 yellow onion, chopped3 cups chopped multicolor bell peppers4 garlic cloves, minced½ tsp red pepper flakes, plus more for serving1 14-oz. can crushed tomatoesCooked spaghettiKosher salt and freshly ground black pepperRecipe PreparationIn large skillet, heat 2 Tbsp olive oil over medium-high. Add onion; cook, stirring occasionally, until light golden, 5 minutes. Add bell peppers. Cook stirring occasionally until tender, 5 minutes. Add garlic, fennel seeds and red pepper flakes; cook, stirring occasionally until fragrant, 30 seconds. Salt and pepper to taste.Push vegetables to edges of skillet. Add remaining 2 Tbsp olive oil and Field Roast Plant-Based Italian Sausage in center of skillet. Cook until golden, 1 to 2 minutes. Stir to combine.Add crushed tomatoes. Bring to a boil; reduce heat to medium-low. Simmer for 5 minutes. Salt and pepper to taste. Serve over spaghetti with red pepper flakes.Discover more at FIELDROAST.COMSponsored by Field Roast GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Field Roast"]}