{"id": "467a11daa74f7663114e926f7e65f7fb", "url": "https://www.bonappetit.com/story/spicy-cashew-dressing-1", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "This Spicy Cashew Dressing Is Scientifically Proven to Make You Eat More Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Cashew Dressing Is Scientifically Proven* to Make You Eat More Salad*Not by an accredited scientific organization.By Aliza AbarbanelSeptember 6, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.A couple months ago, I unlocked the secret to eating more salad: really good salad dressing. I’m not talking about a balsamic vinaigrette—my preferred dressing is so luxuriously silky and richly flavored that every time I make it, I sop up every drop with bread heels and, well, fingers. Folks, I’m talking about spicy cashew dressing.Senior food editor Molly Baz developed this dressing for Bon Appetit’s next-level salad primer, where she found inspiration in the vegan nut-based Caesar dressings at NYC’s Lalito and Scarr’s Pizza, which have developed a cult-following (as much as you can say that about a salad dressing. But truly, the fans are fervent).Really, this dressing is all about the balance of high-impact flavors: Funky fish sauce, bright rice wine vinegar, spicy red pepper flakes, and plenty of salted, roasted cashews (which are fatty enough to replace about half the oil you’d typically need) are blended together to make a creamy, silky-smooth sauce with layers of toastiness and heat.It's that dressing that helps all of the ingredients in this salad make sense together.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiTo make it vegan, sub the honey and fish sauce for maple syrup and soy sauce.  Whatever you do, don’t try to swap in raw cashews. Roasting unlocks nuts’ complex, aromatic flavor, and it’s easy to do at home. You can buy salted, roasted nuts from the store, but I'm way more likely to have raw cashews at home. I toss them two teaspoons of olive oil and ½ teaspoon of salt, spread them on a sheet tray, and roast at 350° until my kitchen smells delicious and those cashews look golden, normally 8 to 10 minutes. I know it can be tempting to cut to the chase and skip this step, but taking those few minutes to toast unlocks a whole new world of flavor. And when the ingredient list is this minimal, it pays to make the most of it.I usually follow the recipe, adding ⅓ cup of warm water before blending to create a pourable, leaf-coating dressing that will make any random assemblage of ingredients that I'm calling a \"salad\" a cohesive meal. Its powerful flavor stands up to all kinds of pairings—after all, this dressing was developed to go with a dinner-worthy salad loaded with sweet potatoes, 8-minute eggs, and sturdy, bitter chicories. And when I want a thicker dip for crudités like Persian cucumbers and cute lil’ endive leaves, I'll hold back a few tablespoons for a more scoopable sauce.I’m confident there’s no jumble of fridge flotsam this nutty dressing can’t improve. Give it your loose carrots, roast chicken, and other leftovers yearning to breathe free—under a blanket of cashew dip, everything is delicious.Get the recipe:Spicy Cashew DressingInspired by the nut-based Caesar dressings at NYC’s Lalito and Scarr’s Pizza, our version starts with roasted cashews.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-06", "author": ["Condé Nast", "Aliza Abarbanel"]}