{"id": "467a1260c107019529ac8aae06a9b755", "url": "https://www.bonappetit.com/recipe/cheesy-kale-and-mushroom-strata", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Cheesy Kale and Mushroom Strata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCheesy Kale and Mushroom StrataBy Deb PerelmanOctober 25, 20184.4(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Molly BazEmailPinterestPrintEmailPinterestPrintWondering how to convince kids to eat mushrooms and kale for dinner? Deb Perelman of Smitten Kitchen has the answer. It’s an effortless one-pan meal if you have a cast-iron skillet, but if you don’t, just cook the kale mixture in a stainless-steel one, then bake the strata in a 13x9\" baking dish.Ingredients8 servings 13oz. sourdough or country-style bread, cut into 1½\" pieces (about 7 cups)2Tbsp. extra-virgin olive oil8oz. crimini mushrooms, sliced ¼\" thick2garlic cloves, thinly sliced1tsp. kosher salt, plus more½tsp. freshly ground black pepper, plus more2Tbsp. unsalted butter, divided3leeks, white and pale green parts only, halved lengthwise, sliced crosswise ¼\" thick1bunch curly kale, ribs and stems removed, leaves torn into 2\" pieces8large eggs2Tbsp. whole grain Dijon mustard2½cups whole milk5½oz. Gruyère or Comté cheese, coarsely grated, divided2oz. Parmesan, finely grated, dividedPreparationStep 1Preheat oven to 350°. Toast bread in a single layer on a rimmed baking sheet until beginning to dry out but not yet browned, 8–10 minutes.Step 2Meanwhile, heat oil in a 12\" cast-iron skillet over medium-high. Arrange mushrooms in a single layer and cook, undisturbed, until lightly browned, about 3 minutes. Add garlic, season generously with salt and pepper, and cook, tossing and reducing heat if needed, until mushrooms are golden brown all over, about 2 minutes. Push to one side and melt 1 Tbsp. butter in center of skillet. Add leeks and season with salt and pepper. Cook, stirring often and mixing into mushrooms, until softened, about 5 minutes. Add kale by the handful, tossing to wilt slightly after each addition, and cook, tossing often, until all of the kale is mostly wilted, about 4 minutes. Transfer kale mixture to a medium bowl. Let skillet cool slightly, then wipe out and coat with remaining 1 Tbsp. butter.Step 3Whisk eggs, mustard, 1 tsp. salt, and ½ tsp. pepper in a large bowl until no streaks remain, then whisk in milk. Arrange half of bread in skillet. Cover with half of kale mixture, then top with half of Gruyère and half of Parmesan. Top with remaining bread and kale mixture; pour egg mixture over. Press down on strata with a spatula to help bread absorb egg mixture. Scatter remaining Gruyère and Parmesan over.Step 4Bake strata until golden brown and no liquid seeps out when a knife is inserted into the center, 35–40 minutes. Let cool slightly before serving.Step 5Do Ahead: Strata can be baked 3 days ahead. Let cool completely; cover and chill.How would you rate Cheesy Kale and Mushroom Strata?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI happened to have all of the ingredients on hand except for the bread. But I did have a bowl of leftover rice in the fridge, so I used that instead. And it was absolutely delicious! The combination of flavors make this dish a real winnerChristineSan Jose , CA3/10/2022Oh, god, yes, it's just so good. This has gone into our regular rotation. There's something really lovely about slicing the garlic here. I especially love that there aren't many dishes involved, and they're fairly straightforward, mostly budget-friendly ingredients without too much waste or leftover stuff. Definitely flexible—sometimes we switch out a cheese, or use 2% when it's what's on hand, or throw in smoked paprika or parsley if I've got some to use, etc etc. AnonymousWashington5/15/2021Really great! I was looking for a recipe to use up frozen shiitake mushrooms I panic-bought last March, and since this recipe uses a lot of mushrooms I attempted to make it happen. I would recommend NOT doing that if that's what brought you here, too... I think that there is just no getting past how waterlogged they get and they're definitely the least good part of the recipe. As written, I imagine it would be great with either curly or lacinato kale. I also punched up the garlic and added red pepper and paprika because I am not making this for children. IT gets a super scrambly eggy texture with a crispy (not burnt) edge around the skillet, which is just great. I will have to try it again with fresh mushrooms as intended!BreeHouston, TX1/24/2021This recipe is super flexible, which makes it a keeper. I used about 3/4 of the leeks (still like....1.5 cups). Also subbed in about a cup or so of aqua fava instead of the eggs, and just whisked it a bit extra. It won't come out custardy like I assume it would with eggs, but it kept it moist and the flavor was still delicious, with the mustard coming through beautifully. Don't be shy about toasting the bread until it is just shy of browning - the drier it is the better the end result. Also splurge on good cheese - the smell will knock you over and the flavor brings everything together to perfection.Ashley AILinköping, Sweden1/22/2021Yum! This recipe has been added to our list of go to meals. We tried this recipe during a month long vegetarian diet. It was the first time my boyfriend had tried kale. I have chickens so we are always grateful for recipes which help use up eggs. I would recommend this to anyone. We didn’t miss the meat. I followed the recipe exactly. Anonymousmaine4/7/2020I love this recipe, I've made it several times and it's always a big hit. I do have several changes that I always make that I believe make a big difference:\n- use Maitake mushrooms if available, or some other tasty mushroom variety\n- add 1/4 teaspoon smoked paprika to the egg mixture\n- brown ~6 oz of breakfast sausage in the skillet at the start, then melt some butter and cook the mushrooms in that. add the sausage back in along with the kale mixture between the two layers of bread\n\nThe last couple of times I've used the BA's Best Breakfast Sausage recipe for the added sausage and it's been delicious (make the rest into patties and put them in the freezer) burkejohnSan Francisco1/10/2020Super easy and filling. Hard to go wrong with bread, cheese, eggs, and veggies. I ended up using raclette cheese and parm, which added a little funk to the whole thing. Nothing revolutionary, still, a solid weekday meal in January. Nashville, TN1/7/2020It's really just baked stuffing. IF I made this again, I would add more kale and mushrooms, and also maybe some vegetarian sausage.AnonymousSan Diego, CA1/6/2020Delicious!  Definitely feeds a crowd.  I added more garlic, used Asiago cheese (all I had), half-n-half, homemade Challah and homemade Honey Wheat Bread cubes.  I tossed everything in a large pan like I would do bread pudding and put it in a 9x13 dish to bake as I don't have an oven-going 12-inch skillet.  Next time, I would reduce the bread by an ounce just to be a bit more moist.Bowie, MD6/23/2019This was wonderful (as usual with Deb's recipes). I added more mushrooms the second time I made this, and it came out great. It feeds a crowd, and I would definitely make this dish again. AnonymousMendon, MA 11/18/2018Sorry but no. It was a lot of work for little payoff. Kids didn’t like it and husband and I were eh on it. Kids will eat kale in a classic sausage and potato soup. Not this.KGreen11Columbus OH11/8/2018Made this for my family last night and it was a big hit! The 3-year-old exclaimed (unprompted), “this is good Mommy!” and the 2-year-old that goes on intermittent hunger strikes cleaned her plate. This recipe will definitely go into the rotation!AnonymousWood River, IL11/4/2018I was surprised at how much flavor this packed in for the relatively simple ingredient list - always a bonus for a Monday night supper!  My 5yo ate everything but the kale; my 2.5yo ate nothing but the kale... so, win?  The grownups loved it, and the kids ate more of it than other meals I’ve cooked lately!  Thanks, Deb!  I’m looking forward to future installments of your new column.kelliluKennett Township, PA10/30/2018Explore Bon AppétitEggKaleLeafy GreensVegetableMushroomGruyèreCheeseOne-Pot MealsWeeknight MealsMainVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Deb Perelman"]}