{"id": "4684260798a493eaf267bdd6ed4ac73e", "url": "https://www.bonappetit.com/story/emma-cardarelli-stop-restaurant-toxicity", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Emma Cardarelli Couldn’t Change Kitchen Culture as a Line Cook, So She Opened a Restaurant of Her Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Couldn’t Change Kitchen Culture as a Line Cook, So I Opened a Restaurant of My OwnIt took years for Emma Cardarelli of Montreal’s Elena restaurant to unlearn the toxicity the industry had taught her. With help, she eventually found the way.By Emma Cardarelli, as told to Joanna FoxOctober 16, 2020FacebookTwitterEmailPhoto by Dominique LafondFacebookTwitterEmailWhen Montreal chef Emma Cardarelli first conceived of Elena—the acclaimed 65-seater serving natural wine, handmade pasta, and wood-fired pizza in Montreal’s Saint-Henri neighborhood—she was ready for change. After 20 years working in restaurants, she was tired of its abusive culture where yelling, drinking, drugs, late nights, and pushing physical and emotional boundaries was the workplace norm—behaviors she’d even adopted herself. With the help of partners and staff, Cardarelli set out to find a better way to run a restaurant. What resulted is a kitchen and crew committed to maintaining a healthy environment with caps on hours, insurance benefits, and earlier nights—and a well-executed menu that we captured in these winter feast recipes last year. With a tangible undercurrent of good energy, Elena stands as a model for positive restaurant culture, a place for employees to learn and grow while recovering from the industry’s toxicity. And as the restaurant has had to constantly shift to survive the pandemic, now focused on takeout only, continuing to prioritize employees’ health—physical, mental, and emotional—has never been more important. Here, Cardarelli explains how Elena came to be and where it’s going. —Joanna FoxOn my first day ever in a professional kitchen I was sexually harassed. I was bending over, cleaning a lower shelf in a fridge, when a guy came up behind me and said, “I could get used to this.” That kind of sexism was prevalent when I was just starting out in the early 2000s. The male staff was constantly making inappropriate comments about the very few women working in kitchens. Little did I know there would be a lot more where that came from.My next job was at one of Montreal’s top restaurants at the time. It was the kind of place where I could work my way up, learn a lot from the chefs, and forward my career. I thought I was lucky. But I saw everything during my years there. The waitresses were encouraged to sit down with clients and got paid extra to hang out with important people. They had to pay for barely-there uniforms and work all night in high heels. I saw serious drug abuse, rampant alcoholism, anger-management problems, sex in the restaurant. Somebody even had sex on my workstation—the used condom was casually tossed in my garbage.As a young, idealistic feminist, I was constantly arguing with my male coworkers and bosses about the environment and how the women were treated like objects. I would try to explain why certain behavior or words were problematic, but no one wanted to hear it. Maybe I wasn’t the only one it bothered, but I was definitely the only one who was vocal about it. I was disliked and unpopular. The management called me a cancer in the kitchen. So eventually I shut my mouth. For years. Because I was afraid of being labeled an angry woman—which I was—and I wanted to work.Just once I hung out after work. I had one drink from a table of guys who’d bought bottle service. Within 20 minutes I went from sober to incoherent. A friend immediately took me home. The next day, when I told the manager what had happened, he blamed me. He didn’t believe I could have been drugged and said I probably couldn’t handle my alcohol. Shortly after, I quit. Then, as a power move and to show the staff who was in charge, they fired me.Not every job was the same. Some were a lot better than others, but there were themes: sexism, harassment, unprofessionalism, homophobia, substance abuse. I can count on one hand the women chefs I worked under: One. And she was a sous-chef. Kitchen culture used to be very much a boys club. It takes its toll on everyone, but for a lot of women, like me, it was grating. Either you hardened, like a callus, so you didn’t feel it anymore, or were totally bitter and beaten down.A member of the Elena team posts up at the wine island.\nPhoto by Dominique LafondI had known early on that I wanted to be my own boss. I also knew I needed to find a front-of-house person because that was definitely not my domain. When I met Ryan Gray, I knew he was my guy. Eventually, after working together for about three and a half years, Ryan, his girlfriend at the time, Lisa McConnell, and I made a plan: We would open our own place. I would run my own kitchen, create food that was simple and delicious, and have a more reasonable work environment. And a four-day work schedule. We borrowed some money, set out on our own, and opened Nora Gray in 2011.I had a lot of hopes. But running a restaurant was really f*#%ing hard.One of the biggest issues was that I micromanaged—nothing could be done without my approval. I had a vision but difficulty conveying it. I didn’t know how to trust people. My initial idea to have a four-day work schedule was impossible. I was overworked, which made me angry, frustrated, and overtired. I became quiet, snappy, and intimidating.No delegation plus lots of pressure and stress meant partying after service to blow off steam. Ryan was drinking heavily at that point, and I was trying to keep pace. Everything started to spiral. We were both brought up in a restaurant culture where we were the abused and then became the abusers. We had unrealistic, unfair expectations.Eventually Ryan’s drinking got completely out of hand. I didn’t see it at first—it’s easier to hide in an environment where people are drinking all the time—but Lisa knew. When Ryan went to rehab, it was a serious reality check that made me examine my own behavior. The partying stopped, and I came out of a haze.Six weeks later, Ryan came back to work. It was a slow reentry, but that’s when things started to turn around for us. We spent a lot of time talking about being able to express ourselves properly and how to communicate. Not everyone instinctively knows how to be a boss. It’s something you have to work at. It was a new page in our relationship and our business.We started thinking about Elena a year after we opened Nora Gray. Shortly after Ryan became sober, he started talking about it with friend, film producer, and restaurateur Marley Sniatowsky, now co-owner. Like Ryan and me, Marley was sick of the late nights, the partying, and the restaurant industry status quo. We all wanted to do things differently, which meant breaking the patterns of aggression, anger, verbal and substance abuse, bigotry, and general unprofessionalism. We wanted to build something new.The first step was hiring two strong people who could take charge: Janice Tiefenbach to run the kitchen as chef and Ellen Eamon to run the front-of-house as general manager.Janice had worked with me at Nora Gray, and I knew she was ready to be a chef. Cooking wasn’t her first profession, so she had the workplace ideals of a regular job: create a nice environment and a happy staff by instilling confidence in both their work and in themselves and maintaining a sustainable work-life balance—no more than four 10-hour shifts a week.Ellen had previously worked at Lawrence for many years—a beacon in this city for fair treatment—so we knew she was like-minded. She introduced transparency, which was a revelation to me. She was adamant about making tips aboveboard so everyone could see what others were making, eliminating speculation. Our staff responded well.We also implemented insurance for all staff and have a retirement savings plan in the works. If you want adults to work for you—adults who are responsible and will stick around, even when they have a family—you want a job to be attractive to them.Cardarelli, at the oven\nPhoto by Dominique LafondWe have a big team now and have to make a concerted effort to create a positive, safe environment where everyone feels included and respected. Above all, we never push people until they’re angry, frustrated, or want to throw things. We’ve learned that trust, not fear, is the way to manage people. Ellen and Janice are fully in charge. They do an amazing job, and I completely trust them. That’s huge for me and shows how far I’ve come in my own personal growth. The restaurant is way more successful because of it.My transition from being in total control to handing over the reins wasn’t easy, but it has allowed me to focus on other things, like choosing to have a baby as a single mother. I recently returned from maternity leave—being in Quebec, we’re lucky to have subsidized day-care and childcare benefits—and the good news is that during that time, I did not not lose my mind about the state of my business. It would have been really hard if I weren’t in the situation and headspace I’m in now.I’ve been very fortunate in my career. I’ve chased and taken opportunities as they came to me. Looking back, I really regret one thing, which was compromising my feminism. I held my tongue when people were making derogatory and inappropriate comments because [speaking out] wasn’t popular. I have worked very hard, personally and professionally, to build businesses where no staff member is ever put in a position to have to make the kinds of compromises I did.Not too long ago, I was called out on social media, anonymously, about how I would resort to “bullying and humiliating/shaming tactics.” It wasn’t untrue. Before I decided that things needed to change, that I had to change, I was drinking too much, exhausted, and overextended. I was angry for being overworked and—when I wasn’t my own boss—I felt underpaid and taken advantage of. That led to me snapping at others and making comments that came off as belittling. Yes, back then, it was a different culture and that was how I was taught, but now it’s important for me to own up to my past behavior and do something about it. The pandemic has reaffirmed our commitment to the heath and well-being of our team. We were among the first restaurants in our city to shut down indoor dining at the start of the pandemic out of concern for the safety of our team and our community. Since then we have continued to let all our decisions be guided by science and the best interest of our employees. Our number-one priority since we reopened in April has been to bring as many of our employees back to work as possible, as safely as possible. We’re doing takeout only for all the restaurants as mandated by the local government, and we have tried hard to create and maintain a safe and positive work environment throughout. We understand the immense mental toll that the pandemic is having on people. We have long believed that the status-quo approach to running restaurants is archaic; operating a restaurant during a global pandemic has underscored this belief. We believe compassion is the antidote to the status quo. We have found and practiced even more compassion with our staff since the pandemic. It took a long time for me to realize that there’s another way, but I’m thankful that I did, for myself, my staff, and the future of this industry, which is already struggling just to survive. There’s no reason why working in a restaurant should be different from working in any other field. It’s about time our industry catches up.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-16", "author": ["Condé Nast", "Emma Cardarelli", "As Told To Joanna Fox"]}