{"id": "469057f254ea26fff8bc2580e8357ec0", "url": "https://www.bonappetit.com/recipe/farro-vegetable-hash-with-chermoula", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Farro-Vegetable Hash With Chermoula Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueFarro-Vegetable Hash With ChermoulaBy Ashleigh ShantiApril 14, 20204.7(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintThink of this as breakfast fried rice but with nutty-chewy farro instead for maximum texture. If you aren’t up for making the chermoula, we won’t judge if you use store-bought green hot sauce instead. This recipe is from chef Ashleigh Shanti at Benne on Eagle in Asheville, NC.Ingredients4 servingsChermoula1tsp. coriander seeds1tsp. cumin seeds1tsp. black peppercorns2cups (lightly packed) cilantro leaves with tender stems2cups (lightly packed) parsley leaves with tender stems1cup (lightly packed) mint leaves2tsp. lemon zest1Tbsp. (or more) fresh lemon juice¼cup extra-virgin olive oil1tsp. crushed red pepper flakesHash¾cup whole farro2medium sweet potatoes (about 1 lb.), scrubbed, cut into ½\" pieces4Tbsp. extra-virgin olive oil, divided3bacon slices, coarsely chopped1medium sweet onion, coarsely chopped1Tbsp. thyme leaves2garlic cloves, thinly sliced1cup brussels sprouts, leaves removed, cores thinly sliced1Tbsp. toasted benne or sesame seeds, plus more for sprinkling4over-easy or fried eggsSpecial Equipment:A spice mill or mortar and pestlePreparationChermoulaStep 1Toast coriander seeds and cumin seeds in a dry small skillet over medium-high heat, tossing occasionally, until fragrant and just beginning to take on color, about 3 minutes. Transfer to a spice mill or mortar and pestle and let cool. Add peppercorns and finely grind; set aside.Step 2Purée cilantro, parsley, mint, 1 Tbsp. lemon juice, and ¼ cup water in a blender, adding more water 1 Tbsp. at a time if needed, until a coarse purée forms. Transfer to a small bowl. Add oil, lemon zest, red pepper flakes, and reserved spice mixture. Season chermoula with salt and more lemon juice if needed.HashStep 3Cook farro in a large saucepan of boiling salted water until al dente, 30–40 minutes. Drain farro well and let cool slightly.Step 4Meanwhile, preheat oven to 375°. Toss sweet potatoes on a large rimmed baking sheet with 2 Tbsp. oil to coat; season with salt. Roast, tossing halfway through, until lightly browned and tender, 12–15 minutes.Step 5Heat remaining 2 Tbsp. oil in a large skillet over medium. Add bacon and cook, stirring occasionally, until browned and mostly crisp, 7–9 minutes. Add onion and thyme and cook, tossing occasionally, until onion is softened, 6–8 minutes. Add garlic and brussels sprouts and cook, tossing occasionally, until garlic is softened and brussels sprouts are bright green and crisp-tender, about 5 minutes. Add farro, sweet potatoes, and 1 Tbsp. benne seeds. Cook hash, tossing occasionally, until farro is warmed through, about 3 minutes; season with salt and pepper.Step 6To serve, divide hash among plates and top with eggs. Spoon chermoula over and sprinkle with benne seeds.How would you rate Farro-Vegetable Hash With Chermoula?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleHad to make some seasonal veggie subs but altogether this turned out much tastier than I expected. The chermoula is worth making - it adds some grassy, citrus zip to brighten up the plate. Lots of reviews suggesting it takes 2 hours - definitely possible with lots of veg prep but I think if you're a bit efficient with multitasking and ensure veggies (especially longer cooking ones like sweet potatoes) are chopped small enough, it can be done in just over an hour. Don't get disheartened! :)\n\nAJLondon, UK9/2/2021The flavors and textures were excellent. I used steel cut oats instead of farro to make it gluten free, and about half the oil that the chermoula called for and it came out lovely. It does take a long time; 2 hours is a good estimate (wish I'd read the other reviews before I started in on prepping)! AnonymousSacramento, CA12/14/2020We really enjoyed this but not for breakfast, for dinner. I made the chermoula and roasted the sweet potatoes in the morning, prepped everything else and when it came time for  dinner it all went together exactly as it was supposed to. The only thing I did differently was to crack the eggs right on top of the hash, put the lid on the pan and in a few minutes it was done. The chermoula was awesome, I could eat it on anything. Yum.pisces47Florida7/12/2020Excellent. The hash itself has a great combination of textures and the balance of sweet, savory and salty flavors is very pleasing. The chermoula is complex and complements the hash well. I maybe added a teaspoon too much lemon juice. So stick to 1 Tbsp. \n\nThis dish definitely took at least 2 hours to cook, but it made a lot of food and was definitely worth the effort. \n\nChanges - cooked the farro in chicken broth. Instead of 1 Tbsp of Thyme, did 1 Tsp thyme and 1 Tsp marjoram. Used sesame seeds. Can't find benne seeds in Texas.a.goekler7491Denton, TX7/8/2020First time trying farro and this was excellent! Lots of steps, but well worth it. If you want to save some time, make the sauce ahead of time.AnonymousCharlotte, NC5/30/2020Made the hash today (sans the chermoula) and it was so good. Delightful flavors and textures. My boyfriend and I ate a ton of it. (We also put a little Cholula on it for kicks and that was tasty too.) It took a long time to make, mostly because I'm a fairly new cook and still pretty slow, but honestly it was worth it. I'll be making it again in the near future.aliciamageeMaryland5/14/2020 This recipe was a hit with the whole family. It took two hours from start to finish so a bit lengthy for morning breakfast but it would be very easy to make each component the day before and reheat in the morning with fresh over easy eggs. In fact the leftover hash was just as good a couple of days later! I was a little concerned that the chermoula was very bitter when tasted by itself. However with the hash it was perfect. (Though it does make a lot - you could easily cut the chermoula ingredients in half.) I've already shared the recipe with friends and family and will make again!TXHuskerTexas5/5/2020We loved it! Such a nice balance of savory and healthy. We  don't have a pestle and mortar so we used ground spices instead and it still came out great. AnonymousBrooklyn, NY5/5/2020This was all right. It just came out tasting a little flat after everything that went into it. I just thinly sliced the entire brussel sprouts, cores and leaves together, because it seemed unecessarily fiddly to separate the leaves.AnonymousNew York5/3/2020This was delicious. A little time-consuming, so I took a few shortcuts: instead of toasting and grinding the spices for the chermoula, I just used pre-ground spices. I was short on parsley and cilantro and didn't have mint, so I added some dill to the chermoula that I had on hand. The combination of farro, sweet potatoes, and brussels sprouts, plus the herby chermoula, was fantastic. Anonymousnew haven, connecticut4/24/2020So, so good. I'll definitely be making this again for breakfast. I roasted the sweet potatoes for closer to 20 minutes, but that might just be a quirk with my oven. Realistically, the only way I deviated from the recipe was using a pestle and mortar instead of a blender to make the chermoula and it still turned out amazingly well. AnonymousVancouver, BC4/21/2020Subbed ~1/2t of smoked paprika for the bacon to make vegetarian, and accidentally-on-purpose let it go a little long after adding the farro to crisp it up. Absolutely delicious. Might increase the sprouts next time.AnonymousChicago4/21/2020This was super yummy and filling!! Highly recommend! But I did do a few things differently (cue groans). I didn't have brussels sprouts but I did have kale. I didn't have parsley or mint but I did have carrot greens. And then, I don't have a blender so I couldn't get the chermoula to exactly the right consistency in my food processor, and although it was tasty it was a little bitter for me (probably the carrot greens). So when I added the farro to the frying pan, I mixed the chermoula in and cooked it a little before putting in the sweet potato. Also, I didn't feel like I needed the oil in the pan because the bacon grease did the job by itself, but I was also only blanching kale rather than brussels sprouts so that might not work for everyone. The flavor profile here was awesome and the mix of textures is perfect! emonydaxwisconsin4/18/2020Explore Bon AppétitFarroRice & GrainsCilantroHerbs & SpicesParsleyBaconCured MeatMeatSweet PotatoPotatoVegetableEggBrussels SproutFallEasyMainNut-FreeDairy-FreeHealthyishSautéBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Ashleigh Shanti"]}