{"id": "46b5934d5a00870975d537763dd849ef", "url": "https://www.bonappetit.com/story/be-the-hero-at-the-picnic-heres-what-to-bring", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Be the Hero at the Picnic: Here's What to Bring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredBe the Hero at the Picnic: Here's What to BringBy Stacy's®August 7, 2018FacebookTwitterEmailFacebookTwitterEmailFew things punctuate summer like a good old-fashioned picnic. Except in today’s world, we’ve elevated the al fresco experience to an art form. What’s the temperature going to be this weekend? Hold please. What to drink? I’ve got Chablis or a rosé from the Douro region. How to prep? Let me count the ways! Grab an oversize blanket and your tote. You are about to win at picnicking. With minimal effort and a few crowd-pleasing essentials in your arsenal, you can be everyone’s hero.See What's in SeasonNo matter the time of year, the farmer’s market is your oyster. In the thick of summer, enjoy newly plucked strawberries, cherries, blueberries, and peaches—and snag a pint of crispy snap peas while you’re at it. If you’re stargazing come fall, pick up pears, apples, or a pomegranate for everyone to share. Whether you make a habit of perusing your local vendors every weekend, or need a last-minute drive-by, your local farmer’s market will be overflowing with pints of fruit your friends will thank you for.Say Cheese...But forget the cheese plate. This picnic is about living one’s best, fuss-free, on-the-go life. There is no time for lugging large cutting boards through a park! Instead, opt for the new Stacy’s® Cheese Petites. You know Stacy’s®, the most popular baked Pita Chips brand. Now they’ve come out with a new product for Cheese Lovers. They launched two flavors of Cheese Petites: Romano with Garlic Pepper and Parmesan with Rosemary. They’re made with real cheese (they’re not skimping, either—it’s the first ingredient). And for your buddy who just came from the gym? Stacy’s® Cheese Petites have six grams of protein per serving, so tell ‘em to eat up. For a limited time, snag 20% off with the promotion code we found at stacyssnacks.com.Embrace the Seltzer BoomWe don’t think you should bring seltzer to a picnic because it’s all the rage right now (even though it is). We think you should bring seltzer because it’s refreshing, delicious, and is a satisfying alternative to regular ole H2O—sipped alone or mixed with a rosé! Add your own slice of citrus or opt for a lightly flavored version. Either way, you’re elevating your hydration game.Rosé Your WayWe believe that rosé season is one worth celebrating, and there is no greater occasion to do so than at a picnic. Everyone’s favorite alternative to a light, crisp white wine can be dry and mineral-y or more fruit-forward, though with just a little extra time at the grocery, you can whip up this hyper-refreshing rosé sangria. It’s full of easy-to-find ingredients, and that extra effort will win you major points.Make it HomemadeSure, you could take hummus. You could pick up a premade tabouli from the market, a couple of plastic forks, and a napkin the size of a chess piece. Or, with just a little bit of planning, you could whip up a homemade masterpiece, like these go-anywhere cold miso-sesame noodles, the ultimate afternoon refresher (and belly filler). Up the heat index with Fresno chiles, refresh with cool cucumbers, and bring it home with lime, scallions, and a punchy miso mixture. Everyone will love it; you will have won the picnic.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Stacy'S"]}