{"id": "46c24eb158d3920fc9e8e5cbe18e2ff9", "url": "https://www.bonappetit.com/story/get-the-most-out-of-sommelier", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "How to Get the Most Out of Your Sommelier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Get the Most Out of Your SommelierAsk a lot of questions, don’t be afraid to send back wine you don’t like, and more expert advice from somm Martin Ho.By Marissa A. RossMay 29, 2018FacebookTwitterEmailTed CavanaughFacebookTwitterEmailPLOT TWIST: I am not a sommelier. I know, everyone assumes I am or was because I write about wine for a living, but nope. That’s not to say I’m anti-somm though. I’m 100 percent anti-elitist-wine-bullshit, but the days of sommeliers correcting your pronunciation of Bourgogne with a snide laugh or trying to upsell you on an insanely priced trophy Cabernet are mostly behind us. There are snobs in every industry, so I can’t promise you won’t ever get one of those. The good news is that most sommeliers are totally nice people who just want to help you pick out a good bottle of wine.That doesn’t mean talking to a sommelier is easy. Even I get flustered sometimes, when the sommelier is standing over me and I end up with a random, super oaky red blend because I mumbled “I do love Arbois,” and it sounded like, “I do love armoires.” But it doesn’t have to be this way. With a little confidence and conversation, a brief encounter with a sommelier can lead to a bottle you love—and learning something new too.Martin Ho is one of the world’s great sommeliers. Totally self-taught, Ho worked as sommelier and general manager at Kødbyens Fiskebar in Copenhagen, as well as in Paris’ Roseval and Tondo (now closed). Ho’s knowledge of wine is only rivaled by his curiosity of it, keeping him constantly learning, humble, and relatable to his customers. Add a positive attitude and a love for natural wine, and there’s no one else we’d rather be talking to.Marissa Ross: Sommeliers can be intimidating. Any good icebreakers or words of wisdom to quell the anxiety?Martin Ho: I think a classic: ‘Hi, I was wondering if you could help us find a wine for tonight?’ or ‘We are looking for a red/white/rosé/(whatever) for this evening. Can you guys maybe help me find a wine?’I think it’s very important to remember while there is a factor of intimidation due to fact\nthat a sommelier may have way more knowledge than you, at the end of the day a good sommelier’s job is not to belittle you or to sell you the most expensive wine possible, but to find a wine that you want to drink.When choosing a bottle, what’s more important: personal taste or the restaurant’s cuisine?ABSOLUTELY ALWAYS PERSONAL TASTE. PERIOD.I often get questions such as: What is good with the menu? Or what would you drink? While those are very charming questions, wine is extremely subjective, and if you blindly go for the sommelier’s choice you should be ready to be open-minded, otherwise you could be in for a bad ride.It is also important to remember that pairing wine with food is such a small aspect of the enjoyment of drinking wine. While wine can enhance the food experience it also carries the same weight in devaluing and ruining the experience.No one likes talking about money, but isn’t it essential to choosing a bottle? Any sneaky tips on how to let a sommelier know your price point without admitting in front of your date you’re damn near broke?A good sneaky way to go about it is to ask about 3-4 bottles of wine from the list at the price range you’re looking for and then point at the wines you are inquiring about—but point towards the price—and ask for ‘something similar.’ It helps to make eye contact with the sommelier here. A good sommelier should understand and be a good wingman/woman without selling you out.But joking aside, a good sommelier will always ask you for a price point. If the question is not prompted, be proactive and always be honest and upfront. You don’t really need to be sneaky about it.Also, if your date doesn’t like you when you’re broke, your date sure as hell doesn’t deserve you when you get your paycheck. Just saying.So, we’ve decided on a bottle, or between a few options. What questions should I ask to learn more about them?My personal approach to wine is more holistic than anything else. The one thing I enjoy the most, and that helps me understand the wine the most, is the story behind the grapes and the person behind the wine. Every winemaker has a personality and I do my best to know and meet them all. Having had the luxury of being from Europe and having worked in France for 5 years you get a chance to be close and personal with many of the small-scale winemakers. More often than not, their personalities and philosophies absolutely transfer over to the end product.Find out more about skin-contact wines (aka orange wines) here.\nPhoto by Marissa A. RossWhat are your favorite questions to get from customers?Any questions are great.  I really enjoy people who are curious and willing to learn. What is the different between white and red wine? What is ‘orange wine?’ What makes it natural? Why natural over conventional? I love discussions like that. I think it is important for us sommeliers to act as conduits or guides or translators instead of being perceived as this snobby grumpy workforce that’s there to demean you. We may not know everything but we will try our best to help out for you.What questions do you wish more customers asked?‘Hi! Excuse me, we actually do not like this wine that much, mind if we switched that to something else?’This happens so often. Either the guests blind orders a bottle of wine and they dislike it, or I recommend a wine they don’t like. It happens. But what I always try to stress both for staff and for guests is that life is too short to sit through a dinner with a wine you don’t feel like drinking.I try to approach guests when I notice they drink slowly or it looks like they’re not enjoying it, but even then, it is difficult for a customer to feel like they are making a complaint; they don’t want to be troublesome. But a good sommelier will not judge. A good sommelier will understand.There are no stupid questions, but which is your least favorite?‘What’s your favorite wine?’ Even if I tried, I honestly couldn’t answer that.Should you ask the sommelier about their astrological sign, or nah?Why not? I like a good conversation as much as the next person. If it feels right and you are interested, why not?Read more: 5 Questions to Ask When You're Buying Wine (And Know Nothing About Wine)Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Marissa A. Ross"]}