{"id": "46cf1bd945e9986d27f7b9e774b0058a", "url": "https://www.bonappetit.com/story/onda-opening", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Running a Restaurant Is Hard, Chef Partnerships Are Even Harder. Can Onda Get It Right? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleRunning a Restaurant Is Hard, Chef Partnerships Are Even Harder. Can Onda Get It Right?By David TamarkinOctober 29, 2019FacebookTwitterEmailFacebookTwitterEmailWhen Gabriela Cámara and Jessica Koslow began planning the menu for their new L.A. restaurant, Onda, they started with a pair of lists: one had Cámara’s must-have dishes, the other had Koslow’s. The idea was that they’d take these dishes and, one by one, filter them through Onda’s influences: Mexico, California, Cámara-style classicism, Koslow-style whimsy. “Onda is not a Mexican restaurant. It is rooted in Mexican food.” In the four months I spent talking to Cámara and Koslow this summer and fall, they both used this line to describe what Onda’s food would be like. For a while, it seemed to be as far as they had gotten.Slowly, they made some progress. When Cámara wanted a gin and tonic on the cocktail list, the women decided that Onda would make the tonic from scratch, and they ran that tonic through the California filter: It would be seasonal based on the fruits and herbs sold at the nearby Santa Monica farmers market. And when Koslow wanted corn nuts on the menu (she grew up eating small ranch-flavored bags after school), they were put through a Mexico lens: tossed in salt made by dehydrating Onda’s house-made hot sauce and sauerkraut.But when it came to the the fritto misto, things came to a halt. Cámara envisioned a classic dish, something like what you’d find at Cala, her San Francisco restaurant, or Contramar, her destination restaurant in Mexico City. But “classic” is something Koslow can’t wrap her head around. “I’m not going to make a fritto misto that everybody else is making,” she thought.While Cámara tended to her restaurants in Mexico and San Francisco, Koslow and Onda’s culinary team, chef de cuisine Balo Orozco and pastry chef Jessica Stephens, worked on that fritto misto during their twice-weekly tastings. They tried all manner of fish. They dipped in all manners of batters. Nothing stuck.Onda translates to English as “wave,” and Cámara and Koslow are quick to say that the name, in part, refers to them being on the same wavelength. But they named the restaurant before the real work began, before they knew how much they would get hung up over a fritto misto. “Gabi’s food is elegant and clean and minimal,” Koslow says. “Mine can be technical and heavy.” The fritto misto, she said, “was plaguing us.”For Healthyish’s first cover, we went to L.A. to see how two uncompromising and visionary chefs are making it work under one sleek, sun-drenched roof.Koslow tells a version of Onda’s origin story that essentially goes like this: When the Proper Hotel suggested to Koslow that she open a second location of Sqirl—her Silver Lake café that launched a new era of California cuisine and a thousand imitators—in their Santa Monica location, the first thing Koslow did is tour the space. Walking around the Spanish colonial building, seven blocks from the ocean, Koslow says she found herself thinking, This feels so much bigger than just Sqirl. It feels like a conversation. That conversation, she thought, could be between two sister cities, places whose cuisines have intertwined for centuries: Los Angeles and Mexico City.And for that, she wanted a partner. Koslow knew Cámara from doing events with her; they were friendly, but they’d never even remotely talked about opening a restaurant together. Still, Koslow thought Cámara made sense: She, like Koslow, was very young when she opened her first restaurant, Contramar. And Contramar, like Sqirl, has become a symbol, a message to the rest of the world about the food in a particular place. Contramar serves beach food but is a four-hour drive from any beach; hadn’t Cámara talked about wanting to actually open on the ocean? The partnership made sense logistically too: At the time, Cámara lived just a quick plane ride north in San Francisco.The women struck a deal in the summer of 2018. Since then, the city has waited. When the Proper opened in June, Onda was still a construction zone. In July, word was Onda would open in August. In August, an opening date was set in September. From there, the delays continued. It was construction-related—Koslow and Cámara had insisted on redesigning the space—but the infrastructure delays gave cover to more existential questions: What kind of restaurant—and whose kind of restaurant—should Onda be?“I shouldn’t be doing this,” Cámara told me over lunch in late June. We were sitting at a table on Sqirl’s sidewalk patio, the famously long line a little shorter now that it was after 2 p.m. Cámara’s life is too full, too busy, she said; opening another restaurant is “crazy.” She’d felt that way when Koslow called her in 2018, but now the insanity of the situation was on a new level. Earlier this year, Mexican president Andrés Manuel López Obrador appointed Cámara to a Council for Cultural Diplomacy, and Cámara decided she would move back to Mexico City. Twenty-four hours after our lunch, she’d be in Mexico City looking for a new school for her 10-year-old son.Cámara doesn’t quite know what she’ll actually do in Mexico City. The government appointment made multiple headlines, but in retrospect they were all premature. “Everybody is so excited about this that they insist on making it bigger,” Cámara said, rolling her eyes. When asked exactly what her governmental duties will be, she threw her hands up. “Who knows? I don’t know.” (She did say she's planning a food festival in Mexico City for 2020.)Nevertheless, she is leaving California, a change that neither she nor Koslow anticipated when they agreed to work together. Over lunch, she spun this as a positive development. “I’m really happy to be letting go of certain things,” she said, though she did not elaborate on which things exactly.Talking to Cámara is like playing a game of Space Invaders—the thoughts come all at once, faster and faster until you give up trying to catch them all. As she talked, she took bites of Koslow’s food. We’d accidentally ordered two of Sqirl’s greatest hits: the sorrel bowl and an inch-and-a-half-thick slice of toasted brioche spread with nut butter and jam. If she were any good at social media, she’d take a photo and post it, she said. I pointed out that Contramar has its own Instagram stars: the much-copied tuna tostada and the grilled snapper, which is served butterflied and painted with red salsa on one half, green on the other.“I know certain things that do work and certain things that I intuitively know will not work,” Cámara said. “And I feel that Jessica and I meet at that point. We really want to make something that’s popular.”Still, she said, looking at the food on the table, “I think that Onda’s going to be a little too hipster for me.”An hour later, Koslow, Cámara, and various members of their teams sat in Koslow’s office, a sweeping white space above Sqirl that also functions as a photo studio. The subject of the meeting: timelines. The hotel wants its signature restaurant, Koslow explained. And the current timeline they were working with had the kitchen becoming available just a few days before the restaurant opened to the public.Cámara saw disaster. “We need much more time than that,” she said. Her chatty energy was now leaning toward agitation. She pointed out that Onda took first place on Eater LA’s Most Anticipated Restaurants of Summer list. (A few months later, still unopened, Onda would make the fall list too.) “We cannot mess this up.”Across from Cámara, Koslow responded by sitting upright in her chair, blinking purposively, and speaking to the table in the soft, calming tones of a second grade school teacher. A few days later, Koslow would describe this to me as her duck mode, “where you don’t know that my feet are moving really fast underneath.” Overhearing this from across the room, Sqirl’s creative director, Scott Barry, offered a correction. “Duck” is too mellow, he says. Koslow is more like a full jungle. (“From overhead, a jungle is quiet.”)“There’s no chill,” Koslow agrees. “Like, no chill.”If you know where to look, you can see Koslow’s jungle at work. At the meeting, her toe nervously tapped the air at a steady EDM pulse. And as the meeting went on and anxieties about opening dates and kitchen layouts were expelled, Koslow surreptitiously started replying to emails on her laptop while still managing to make eye contact with people in the room so that they felt heard.Koslow is used to meetings like this. In early 2018, after two years of planning, designing, and talking to the press, Koslow’s anticipated second restaurant, Tel, fell apart after its main investor abruptly pulled out. Slated to be an all-day restaurant, art space, and bagel bakery, Tel would have been something of a stake in the ground for Koslow—proof that she can do more than breakfast and grain bowls, that she can be successful more than a seven-minute drive from her home on the Eastside.“I think there’s a lot of questions in people’s heads about whether Jessica Koslow can open a dinner restaurant,” Koslow says. “And maybe that was a question in my own head.” The stakes she felt at Tel are now the stakes of Onda, and the goal is the same: It’s about taking on the entire city, not just her corner of it. It’s about being a chef in Los Angeles, not just a chef in Silver Lake. It’s about giving the city something they haven’t seen before: “a new food for Los Angeles,” as she describes it.As Onda continued to get pushed back, from a summer opening to the fall, Koslow and Orozco, Onda’s chef de cuisine, worked on the fritto misto. “I can’t have dishes on this menu feel ‘basic’ and ‘normal’ under any circumstances,” Koslow told the chef. Cámara, who wanted the fritto misto in the first place, was not around. Between July and September, Koslow says, Cámara was rarely in Los Angeles. The restaurant that is “not Mexican but rooted in Mexican food” has had to more or less move forward without one of its roots.It was always understood that the partnership between the two women would not necessarily be equal; Cámara never pretended that she would move to L.A. But everybody thought that Cámara would be a 90-minute trip away, not a four-hour flight that involves going through customs. The move to Mexico—and the stress of packing up her life so that she could move—meant that many of the most crucial decisions about the restaurant, everything from who will work at Onda to what they will wear, fell on Koslow.“The reality is that this is more of a consultancy,” Cámara told me a few weeks ago. There was a hesitancy in her voice, and I didn’t know if it was because she wasn’t sure how much to reveal about her role, or if she was unsure herself what that role is. When I asked if she saw herself doing more consultancies of this nature, she sounded almost pained.“I know many chefs do restaurants in hotels and consult that way, and I know it’s a global tendency for quote-unquote star chefs to put their faces to projects that they aren’t necessarily close to physically. But, I don’t know...we’ll see. If you’re asking me if I have a project opening in Dubai, Vegas, and Hong Kong? No.”In June, when Cámara mentioned Onda on a podcast with David Chang, she described it as “in a hotel—talk about corporate.” Later in that same podcast, she was audibly annoyed when she admitted that Onda would have to handle the food in the hotel’s lobby. (Executives from the hotel heard the podcast and immediately texted Koslow, asking what Cámara’s problem was.)But if one of Onda’s restaurateurs is uncomfortable with going global, the other is leaning in. In the next 12 months, Koslow will not just open Onda, but also Sqirl Away, a to-go version of Sqirl that she is opening with Sophie McNally, the daughter of restaurateur Keith McNally, in East Hollywood. She will also expand the original Sqirl with a wine shop and take-away counter, and she will release her next cookbook, The Sqirl Jam Book, in July. She is matter-of-fact about her ambitions to bring Sqirl global; she describes Sqirl Away as being intentionally scalable, and compares it to Pret A Manger, the British sandwich chain that now has almost 500 locations in Hong Kong, Europe, and the U.S. “A big thing that I always say is that in order to keep a restaurant sustainable, you have to feed your neighborhood,” she says. “And you have to feed the world.” So while Koslow opened with Proper because she saw an opportunity to make another neighborhood restaurant, it would not be out of the question for her to open in Proper Hotels in Santa Cruz or Boston or Minneapolis—you could see Koslow opening a “neighborhood restaurant” in every neighborhood in the country.Last night Onda opened with fritto misto on the menu. But it isn’t called fritto misto. Instead it’s listed as “Fish Hiding In Kelp,” a pretty straightforward description of a dish that is mostly seaweed and Meyer lemons that have been battered in house-made masa and fried with fried chunks of anchovies and other small fish nestled here and there. It appears on a menu alongside jackfruit that’s been tossed in a 54-ingredient mole and piled onto a sope. And a quesadilla that is served inside-out, a house-made tortilla tucked inside an envelope of crispy cheese. And a chocolate molten cake spiked with canela (Mexican cinnamon) and chile that is so molten it’s basically pudding, served with a salted orange-whey ice cream. And a pig ear salad that Cámara says “could be Mexican or could be Vietnamese or could be Thai.”Koslow and I talked again last week, a few days before Onda opened for friends and family. She described the restaurant as a child. “It really needs to develop, just like any child does. So we’re in the biggest growth period, trying to figure it out.”There was relief in Koslow’s voice—she was proud of her child—but she admitted that menu development had not been easy. “There was a lot of failure,” she said. The ambition was to make every dish feel like an L.A.–Mexico City collaboration, but what Onda ended up with is a menu of recognizably Koslow-style food that looks to Cámara for inspiration—and sometimes finds it. “It’s not what we started out trying to do, but it's what ended up happening,” Koslow said.Koslow and Cámara still use the word borderless when they talk about Onda; they still describe it as a place where the food veers from California to Mexico and back. But over the summer, as Onda took shape, the central conceit of the restaurant evolved. It’s no longer just about the style of two restaurateurs or two cities, but about finding a style that transcends them. Koslow was still looking for that voice when she called me from the restaurant. “What does it mean?” she asked herself out loud. “What does it mean to be Onda?”Editor: Amanda Shapiro, Photography: Alex Lau, Prop Styling: Julie Ho, Creative Direction & Design: Michele Outland, Chris Cristiano, and Christa Guerra, Production: Aliza Abarbanel and Michelle Heimerman, Social: Rachel Karten, Copy & Research: Brian Carroll and Susan Sedman, Special thanks to: Carey Polis and Adam Rapoport.Explore Bon AppétitHealthyishLos AngelesChefssqirlessayRead MoreLifestyleWe Left Our Dream Jobs to Open a Restaurant Across the Country. What Could Go Wrong?By Emily Fiffer and Heather Sperling Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-29", "author": ["Condé Nast", "David Tamarkin"]}