{"id": "46f9d335f0caf01eb9afeb7503162ada", "url": "https://www.bonappetit.com/story/pink-peppercorn-feud", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Make Minty Limeade This Weekend (Tequila Optional) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake Minty Limeade This Weekend (Tequila Optional)The Test Kitchen went clamming, and more highlights from the week.By Alex BeggsAugust 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Maggie RuggieroFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.With friends like these...We had a blast handing out minty limeade (in compostable cups) and tiny produce-themed pins at the Union Square Greenmarket last weekend to promote Healthyish’s Farmers’ Market Challenge. Some stoppers-by shared their thoughts on the limeade: “Toooo sweet!” “Too tart!” “Just sweet enough!” And then the bear family came home and scared them all away. Just kidding. It was a man on his cell phone, telling the person on the other line: “I can’t believe they have that [ADULT WORDS FOR POOP AND BUTT] Bon Appétit magazine here!” He looked into my eyes and enunciated “PA-THE-TIC” and walked away. Strollin’ and trollin’!Get the recipe: Minty limeade (feel free to add sugar to your preference)Photo by Rick MartinezPostcard from Cape CodCarla, Claire, Andy, Brad, Rick, Molly, and Christina went clamming while shooting [REDACTED] in Cape Cod this week. Claire and Rick turned out to be the most skilled, while Carla and Chris “supervised.” They dug up enough clams with their feet and then steamed them with white wine, ginger, garlic, shallots, and sriracha. “You get so disgusting clamming,” Christina told me. “The mud and dirt had arranged itself on my body in such a way, it looked like I had chest hair.” Back at the hotel, Chris would send the whole team a text every morning announcing his coffee pop-up, Café du Morocco, was open. Yes, Chris Morocco brings his own hand-grinder, electric kettle, and Intelligentsia beans on vacation. He made everyone a strong cup of Aeropress, leaving his room door propped open for the incoming sleepyheads.Want this letter before it hits the website? Sign up for our newsletter!Courtesy of A24See this movieLast weekend I finally saw The Farewell. All food-loving people, and people-loving people, will love it.  I won’t give away the plot, but it will make you laugh your face off and wipe away tears with your popcorn napkin. But as Jenny G. Zhang wrote for Eater, the scenes of the Chinese family gathered at a huge round table of seemingly endless food mirror the ways families share grief as if it too is being spun around on a lazy susan. Go see this movie! And then listen to our interview with director Lulu Wang on the Bon Appétit Foodcast next Wednesday.And one moreIf you can, schedule your weekend around finding a theater playing The Pieces I Am, the inspiring and phenomenal Toni Morrison documentary. It has nothing to do with food, EXCEPT that the unmatched American author, who died this week, was known to make an incredible carrot cake (especially for her authors when she was an editor at Random House—can you imagine?!). I don’t have the recipe, but in the doc, she does reveal it was heavy on the carrots. Maybe one day we’ll learn the rest.Recipe comment of the weekGet the recipe, bad boys: Tomato GaletteSummer pigeonsIf a seagull is inching toward your big ass beach hoagie this weekend, stare him dead in the eyes until he backs off, according to Munchies. It’s called “gaze aversion,” a practice I’m all too familiar with.Unnecessary food meme of the weekUnnecessary food feud of the weekI called the Test Kitchen crew as they journeyed back to New York in a big passenger van driven by...Brad Leone. “So what’d I miss this week?” I asked van-rider Christina Chaey. She said that Carla Lalli Music was eating a mini Kind bar that’d been sitting in a hot van for two days. Things were getting savage. But the biggest feud in Cape Cod started when Carla poo-pooed pink peppercorns in an upcoming recipe because they’re “funny.” “To me, pink peppercorns feel like peak 1984,” she said. Andy Baraghani has nothing against their flavor and mellow heat, but “there are other ingredients that have a prettier color that don’t remind of clothes from ’90s Wet Seal.” Pick a decade, people! Others were apathetic. “I would use pink peppercorns if I had them leftover from a Williams-Sonoma gift basket or something,” said Meryl Rothstein. It was Brad who advocated for the pink pep, saying he “just really digs them—they’re floral and fruity.” And if anyone else says another word against them, he’ll turn this car around…Explore Bon AppétitBeggs NewsletterRead MorecultureWhat My Dream Grocery Store Looks LikeBy Alex BeggscultureCook the Cover! It’s FoolproofBy Alex BeggscultureAdmit It: You Love MuffinsBy Alex BeggscultureThere’s a Snow Cone in the Weekend ForecastBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-10", "author": ["Condé Nast", "Alex Beggs"]}