{"id": "46ff61c24c51400944560cf0d17d412b", "url": "https://www.bonappetit.com/story/rent-week-crunchy-veggies-white-rice", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "I Happily Eat This Crunchy Rent Week Veggie Recipe at Least Once a Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Happily Eat This Crunchy Rent Week Veggie Recipe at Least Once a WeekSteamed rice topped with crunchy, gochujang-dressed veggies never leaves the menu.By Alex DelanyApril 25, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhoever coined the phrase \"variety is the spice of life\" was probably just trying to impress someone.I get it. But you know what the real spice of life is? Comfort. Consistency. Guaranteed, low-risk, high-reward pleasure. I’ve become a person that has no problem accepting the fact that variety stresses me out sometimes. I go to the same coffee shops and restaurants and bars over and over again because I know that I like them. Sure, I sprinkle in new spots occasionally, but I’d rather eat at a place that I know for a fact will make me happy. And while a younger me would probably look at this predictability as offensive and boring, I have grown to realize that this is just me becoming more confident in what I want for myself. I want to grow to be the old man that sits at the same table at the same restaurant every Sunday evening, until he or the restaurant calls it quits.And that same thought goes for dinner at home. You might be thinking, This guy is an editor at a food magazine! Every night his dinner is a wonderful adventure! How lovely and exciting and romantic it must be! Well, it is lovely and romantic for me, but an exciting adventure it is not. I’m the type who discovers a thing I really enjoy eating or making and then I make the hell out of it over and over again. That’s how I’ve found myself eating this month’s Rent Week recipe—a dead-simple dinner of crunchy, raw vegetables tossed in a spicy dressing served over hot white rice—at least once a week for the past couple months.Predictable? Sure. Flavorful, affordable, quick, and satisfying? Absolutely. Guaranteed to make me (and hopefully you) happy? Damn right. This dish is the poster child of Rent Week dining. It does not fail to make me smile every time I eat it. And in the interest of maintaining that chilled out, comfortable vibe, I made this Psych-ish Spring playlist (filled with psychedelic tunes and absolutely free of charge) for you. So smash the play button and get ready to be dropped into a blissful, delicious state of existence.The first thing you need to do is toast some sesame seeds. Pour about ¼ cup of raw sesame seeds into a non-stick skillet, spreading them across the entire pan, and heat them over medium. When the seeds start to take on a golden color, give the seeds a stir and continue to cook them until they start to turn a deep, golden brown. (Just make sure to pull them before they're all dark; they'll continue to brown as they cool.) Transfer them to a dish. This whole process should take about 5 minutes.Now you have to make a pot of white rice. Measure your grains. Rinse your grains. Measure your water. And then proceed to make rice in whatever way you usually do. Everyone has their own method, but if you’d like a little refresher, we’ve got you. While the rice is cooking, you can tend to your vegetables.Crunchy Bois (Trademark Pending)\nPhoto by Chelsie CraigAnd this dish is all about those crispy, crunchy vegetables. Their texture is what makes this whole affair both interesting and refreshing, and for that reason radishes and cucumbers are my vegetables of choice. Both have high water content and a pleasant texture, exactly what you want to be coated in a spicy sauce.Wash and trim the greens off of 12 radishes, and chop them into quarters. Any kind of radish will do, but red radishes will be the easiest to find. Next, slice 1 large English cucumber lengthwise into quarters, so you’re left with four long spears. Chop across the spears, so you have a bunch of 1” wedges. These should be big enough to eat in one bite. You’re going for a streamlined consumption process. Finely chop a handful of cilantro leaves and tender stems. You’ve taken care of the fresh stuff. Great job.It’s time for sauce, which is admittedly the most involved part of this otherwise straightforward recipe. And it really isn’t that involved at all. The sauce we’re going to coat these vegetables in is spicy, sweet, toasty, fresh, salty, and umami-forward. It brings literally everything to the table. And if you don't already have all of these ingredients in your fridge/pantry, consider changing that—think of it as your Rent Week arsenal, ready to bring big flavor to the table when you're making dinner out of odds and ends.This is what my Monday or Tuesday or Wednesday or Thursday night looks like.\nPhoto by Chelsie CraigStart with 3 Tbsp. of gochujang in a large mixing bowl. (If you can’t find gochujang, you can use a substitution of 1 Tbsp. miso and 2 Tbsp. sambal oelek.) Grab a microplane and grate 2 cloves of garlic. Add 1½ Tbsp. honey, 3 Tbsp. rice vinegar, 1 Tbsp. toasted sesame oil, a couple pinches of kosher salt, and half of the toasted sesame seeds from earlier. Finally, stir in the chopped cilantro.Grab those chopped radishes and cucumbers and throw them into your mixing bowl, tossing them so they’re coated with the sauce. Scoop up a bit of that steamed white rice, spoon some of the crunchy vegetables over top, and sprinkle some toasted sesame and chopped cilantro over it all. The bite that follows will be a flavor journey that is especially intense because of the dish’s simplicity.Do you taste that? That’s the taste of a routine being formed. That’s the taste of comfort and predictability and guaranteed satisfaction. That’s the crunch of vegetables that will always be there for you. That’s the spice of life. Actually, it’s possible that the spice is just the gochujang.Not in a crunchy vegetable mood? Fine. How about quesadillas?This Rent Week Chipotle Chicken Quesadilla Recipe Is All Grown UpForget the dorm room quesadillas of your past. There's a new sheriff in town.View StoryExplore Bon AppétitBasicallyRent WeekRiceCucumberRadishgochujangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Alex Delany"]}