{"id": "470552e018b6535b8810a753c8c5d9df", "url": "https://www.bonappetit.com/recipe/smoked-fish-chowder-2", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Smoked-Fish Chowder Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSmoked-Fish ChowderBy Claire SaffitzFebruary 13, 20184.3(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe love Bar Harbor clam juice, which has no salt added and a gentle, briny flavor, for this chowder recipe. It’s a good stand-in for when you don’t want to bother making fish stock (i.e., most of the time).Ingredients4 servings2Tbsp. unsalted butter4oz. bacon, chopped1medium onion, chopped1medium leek, halved lengthwise, thinly sliced crosswise2celery stalks, chopped2bay leaves1lb. small red potatoes, scrubbed, quartered4cups no-salt-added clam juiceKosher salt, freshly ground pepper1lb. hot-smoked trout, skin removed, flesh broken into small pieces1cup buttermilk, room temperature½cup heavy cream, room temperatureTrout roe (for serving; optional)PreparationStep 1Heat butter in a large Dutch oven or other heavy pot over medium-low. Add bacon and cook, stirring often, until brown and crisp, 8–10 minutes. Increase heat to medium and add onion, leek, celery, and bay leaves; cook, stirring often, until onion is translucent and softened, 8–10 minutes.Step 2Add potatoes and clam juice to pot; season lightly with salt and generously with pepper. Bring to a simmer and cook, uncovered, stirring occasionally, until potatoes are tender, 10–15 minutes. For a thicker texture, smash several pieces of potato against the sides of the pot. Add trout and buttermilk and simmer about 5 minutes (to give flavors time to blend together). Taste and season with more salt and pepper as desired. Remove from heat and stir in cream.Step 3Ladle chowder into bowls, top with trout roe, if desired, and season with coarsely ground pepper.Step 4Do Ahead: Chowder can be made 2 days ahead. Let cool; cover and chill. Reheat gently over low before serving.How would you rate Smoked-Fish Chowder?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThe buttermilk made it a tad too tangy for my liking. I’d do 1/2 c. Buttermilk and 1 c. heavy cream next time. Apple PaltrowBoston, MA 10/17/2021Wonderful flavor and it came together beautifully.  Couldn't get no salt added clam juice, so i eliminated adding any salt at all.  I did use smoked sable fish as well as the smoked trout to mix it up and the combo of textures was really a nice contrast.  Definitely will make this again.Deb C4/2/2021Question: does it have to be smoked trout or may I use baked trout?R. Marquez, MBA CPAIdaho5/25/2020Explore Bon AppétitChowderSoupSoups and StewsAmericanButtermilkOther IngredientsPotatoVegetableSmoked TroutTroutFishSeafoodRed Skin PotatoOne-Pot MealsStarterNut-FreeGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}