{"id": "470a25ded158657bbc71beb45d082a8f", "url": "https://www.bonappetit.com/story/my-new-go-to-pancake-recipe", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "My New Go-To Pancake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy New Go-To Pancake RecipeIs vegan, gluten-free, and refined sugar-free too? (I can’t believe I’m writing that.)By Sarah JampelJanuary 14, 2022FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susan Ottaviano FacebookTwitterEmailWhen the fridge is bare—like, butt-naked—and the pantry is also slim-pickins (who put back that empty box of cereal…), I find solace in knowing there’s always pancakes. But Sarah, you’re asking yourself, what about eggs and butter and buttermilk? And to that I answer: As long as I have a couple of bananas (and really, I only need one) and some rolled oats, I can make a short stack, no eggs or dairy required.These pancakes are bound, thickened, and sweetened (signed, sealed, and delivered) with two main ingredients: rolled oats and banana. The oats are blitzed up in the food processor so that they break down into starchy, sawdusty particles that can then unite the rest of the roster: a banana (for sugar and moisture), baking powder (lightness, lift), olive oil (savory suppleness), plant-based milk (or dairy milk, even), ground cinnamon, and salt. Purée it all together, then stir in more rolled oats (for additional texture) and optional-but-not-really chocolate chips. Let the batter rest to thicken up, and that’s it—you’re ready to heat up the stove. Plop a few thin slices of banana onto each pancake before you flip and they’ll soften and caramelize when they hit the hot skillet.The pancake recipe is simple, but in my testing—and retesting—I’ve learned how to make them as great as possible:1. Let your batter rest. The ground oats need a bit of time to absorb the liquid and, in turn, to thicken the batter. I’ve found 15 minutes to be the sweet spot. Don’t skip it.2. Get the pan hot before you add the batter. When you add pancake batter to a hot pan, rather than a lukewarm one, it sets immediately, thereby preventing your batter blob from spreading out too thin. I recommend adding the batter to a hot pan—it should sizzle!—and then lowering the heat so that the pancake can cook through without burning. And remember: The first pancake is always the worst, so consider your premier to be a tester.3. Use the “optional” chocolate chips.The batter, with no added sugar and a savoriness from the olive oil, isn’t sweet. So throw in a generous amount of chocolate chips (make sure they’re dairy-free if these pancakes are intended to be vegan) and douse your serving in maple syrup.4. Double the recipe. This recipe makes 6–7 pancakes, enough for two fairly hungry people. But I recommend doubling it and storing any extras in the fridge. Reheat them in a toaster (or toaster oven), or just eat them cold in between meals (that’s what I do).5. Make the batter your own. There’s flexibility here. Use any milk (plant-based or otherwise) you have on hand; swap in canola oil for the olive oil if you prefer a neutral flavor; switch up the ground cinnamon (ground cardamom and ginger would also be good); and play with the mix-ins: While I can’t, in good faith, suggest leaving out the chocolate chips, you could use chopped walnuts or shredded coconut in place of the additional rolled oats.Admittedly, these are never going to be ultra-buttery, indulgent fluffsters. They’re not diner pancakes—they’re dense and wholesome yet utterly satisfying. And the best part? You really can make them on a weekday—just hop in the shower (or back in bed) while the batter rests. Once you (and the batter) are feeling refreshed, make yourself a tiny stack of pancakes and be glad you didn’t have to crack any eggs to get here.Now have some pancakes!Vegan Banana-Oat PancakesLike banana bread in pancake form, these pancakes have crisp edges and tender centers with big banana flavor.View RecipeExplore Bon AppétitPancakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-14", "author": ["Condé Nast", "Sarah Jampel"]}