{"id": "4711cdbb6f7ef7bf6ed5107b27bd37cd", "url": "https://www.bonappetit.com/recipe/pineapple-pork-adobo", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Pineapple Pork Adobo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPineapple Pork AdoboBy Louiie VictaMarch 15, 20214.5(116)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintAdobo, a beloved and popular Filipino dish, is commonly made with chicken or pork that is traditionally braised in vinegar, soy, and garlic. There are many variations to the recipe based on each cook’s individual style and taste preferences. Some add coconut milk, others add spices, some use salt instead of soy sauce. I’ve even tried a version that is fried. But the most distinguishing feature of this dish is a rich sauce that perfectly balances acidity, saltiness, and sweetness. In this version, I included puréed and caramelized pineapple, inspired by my childhood trips to Tagaytay, a city South of Manila, where the air is cool and sweetly fragrant fields of this tropical fruit are plentiful. It’s a festive way to spruce up adobo yet keep it simple enough for a weeknight meal.Ingredients4–6 servings1large ripe pineapple2Tbsp. plus 2 tsp. vegetable oil2lb. boneless pork shoulder, cut into 1½\" cubesKosher salt, freshly ground pepper½white onion, thinly sliced6garlic cloves, thinly sliced⅔cup cane vinegar (such as Datu Puti) or unseasoned rice vinegar½cup Datu Puti soy sauce or ⅓ cup other brands soy sauce (such as Kikkoman)2Tbsp. oyster sauce1Tbsp. black peppercorns5dried bay leavesSteamed white rice and thinly sliced scallions (for serving)PreparationStep 1Peel and core pineapple. Cut half of pineapple into bite-size pieces (about 1\"); set aside. Chop remaining pineapple into small pieces and transfer to a small saucepan. Cook over low heat, stirring occasionally, until very soft and broken down and nearly all juice is evaporated, 15–18 minutes. Transfer to a blender and add ¼ cup water; purée until smooth.Step 2Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Lightly season pork with salt and pepper. Working in 2 batches, cook pork until well browned on all sides, 5–8 minutes per batch. Transfer to a plate.Step 3Reduce heat to medium-low and add onion and garlic to same pot. Cook, stirring often, until fragrant and softened, about 5 minutes. Return pork to pot and stir in pineapple purée. Add vinegar, soy sauce, oyster sauce, peppercorns, bay leaves, and ¾ cup water and stir to combine. Bring to a simmer and cover pot. Reduce heat so adobo is at a very gentle simmer and cook until pork is tender, 45–50 minutes.Step 4Meanwhile, heat remaining 2 tsp. oil in a large skillet over medium-high. Cook reserved bite-size pineapple pieces, tossing occasionally, until golden brown all over, 5–8 minutes. Transfer to a plate.Step 5Uncover pot and skim off any fat from surface. Increase heat to medium and cook, uncovered, until sauce is thick and shiny, about 15 minutes. Gently stir in caramelized pineapple. Remove and discard bay leaves.Step 6Serve pork adobo over rice, topped with scallions.How would you rate Pineapple Pork Adobo?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleI will make this again. Used the rice wine vinegar and soy sauce substitutes. Cooked for way longer than the recipe called for, just because I was in a holding pattern until I was ready to serve. Tasted great! Too sweet for my husband but nothing a little Sriracha can’t fix. Added charred white onion and bell pepper for some crunch. Sticky rice, green onion, and done!Jenna C. Los Angels, CA3/11/2022I made this dish this weekend and it was divine! I reduced the water to 1/2 cup as other reviewers mentioned and I cooked it in the oven at 300F for about 45 minutes and then 275F for another 15-30 minutes. The meat was tender and delicious. I didn't have to thicken/reduce the sauce on the stovetop as it had reduced enough in the oven. My pineapple was really ripe and delicious. I didn't find the dish to be overly sweet at all. I used the Datu Puti vinegar and soy sauce, so maybe that makes a difference in overall sweetness and color (my dish was dark like the image shown). Great recipe! Will definitely make again.StephanieGeorgia2/28/2022This is so, so good. Followed the recipe exactly except I was lazy and cooked it in the oven for just over an hour in a 160 oven (Celsius)then finished it off on the stove. Such depth and complexity and the vinegar made for the most tender pork ever! I will be making this over and over again! Miranda Perth, Australia.1/15/2022This is one of the best BA recipes I've ever made. I made this almost exactly as written. The only changes were from helpful commenters below; 1/2 cup water instead of 3/4 cup; ground pepper in place of whole peppercorns to save our teeth, and a hefty sear on the pork (without burning it). The flavor was incredibly good, with no one ingredient overpowering the other.  The pineapple complemented the dish perfectly, too. I'll be making this one over and over again until the end of time. It's that good! Thanks, Louiie & BA!!AnonymousColorado11/15/2021This was absolutely fantastic.  So richly flavored.  I was a bit perplexed trying to brown the pork cubes.  They became way overdone.  Searing them was very dicey for me.  I didn't use a heavy dutch oven.  Just a regular dutch oven.  Maybe I needed to use my cast iron frying pan?  Any suggestions?   I wanted them to be rich and brown and carmel-ly but not so over done.  My husband told me at least ten times...\"This is delicious, but the pork is over done.\"  Help?  Of course we ate it happily and will eat the leftovers tonight.  So good.  Mmmmm. Charlotte GusayLos Angeles10/1/2021I was so eager to make this recipe.. I love pork. I couldn't find datu puti.. but substituted it for the unseasoned rice vinegar (as the recipe suggested) .  I did not like it at all.. I found myself having to add brown sugar when caramelizing the pineapple as the sauce was too tangy for my taste.. I will not be making this one again.. so sad..CarmenNew York9/29/2021Outstanding.  So so so so good.\nRelatively easy to make for so much flavor.\n\nNotes:\n\n— Get a hefty sear on the pork for good color!\n\n— I added sriracha to get a little heat in there to balance the sweet\n\n— It was a bit watery at the end of the suggested cooking time, even with the reduction. Not a problem.  I took out the meat and cooked down the sauce another 5-10 minutes.  I seasoned the sauce to my taste with a bit more ground pepper. \n\n— I didn’t have oyster sauce so i used a tbsp of fish sauce and a tbsp of black garlic umami sauce. \n\n— I didn’t add the caramelizad pineapple chunks.  Instead I took the other half of the pineapple, sliced it, grilled it. Served it with some Valentina hot sauce and vanilla ice cream. \nMedic6408NYC, NY8/17/2021Great flavor and interesting balance of sweet and savory, but the sweetness was just too much. Each time I got a bite of pineapple it was just far too sweet compared to the sauce.\n\nI'd make it again, but I'd cut the bite-size pieces of pineapple smaller and use more like 2/3 to 3/4 of the pineapple for the puree instead of 1/2.AnonymousSeattle8/2/2021Delicious! I actually forgot to add the 3/4 cup of water in step 3 and it turned out perfect, so I can definitely see why other folks found it too watery. I also cracked my peppercorns instead of putting them in whole. Only had about 1 T of oyster sauce left in my bottle so added a dash of fish sauce as well.  I took the comments advice and cut the pork into fairly large cubes so I could put a super hard sear on them. I would definitely make this again, and I can easily see it doubling nicely for a dinner party. AnonymousBerkeley, CA5/20/2021This recipe is incredible. I followed it to the letter but for I did chunk up my peppercorns in a mortar and pestle. Not that it matters, but my end result looked like the picture, and for people who wished it did I would say to not be afraid to sear the crap out of that pork. If you've cubed up a shoulder, that meat can take it. I took mine to a nearly-burnt stage and it paid off. Small batches in a wide pan. Everything in this recipe is going to take longer in your wonky home-kitchen than stated in this recipe. Totally fine and super fun if you have time and maybe want to take time and have a couple of drinks between stages. There is a deglazing step missing from this recipe but I think it's intuitive. To the reviewer who switched out gochujang paste for oyster sauce, I honestly think that's the move and will do that next time, although culturally speaking it's probs no longer adobo at that point. All the stars, loved this. As is 10/10.JessaminRaleigh, NC5/15/2021I would love to know which magazine this iteration of adobo is actually in. The March 2021article is by Melissa Miranda and is a completely different Oven-Roasted Chicken Adobo, so basically completely different ingredients, prep and, method. It would be great if you could accurately site this actual recipe creator. Thanks!Anonymous5/2/2021Wonderful recipe! I followed the recipe per instructions, a little time consuming but so worth it. My end result was a little saucier than I had hoped, but I dind’t want to try and reduce it more than the 15 minutes, as I was afraid to over-cook. And even though I browned the meat nicely, with a long simmer in the sauce, the color of the meat didn’t look like this. It was a lighter color and not caramelized in appearance. I’m not sure how I feel about biting into a whole peppercorn. That part of the recipe is a little perplexing to me. With all that said, thanks so much for an absolutely delicious and special pork meal. I loo forward to leftovers today and I’ll be making this one again. Great recipe for entertaining.LeaDenver, CO4/14/2021Excellent recipe. Never had adobo before and now, I think I'm addicted. Really great flavors. I followed the recipe exactly as written.MaxB4/12/2021Disappointing.  All we could taste was the pineapple, it lacked complexity.  Not horrible, we will still eat the leftovers of which we have plenty. I will not be making this agai n.ACMSan Antonio TX4/9/2021This might be my favorite iteration of adobo, though the one with the coconut milk is also good. \n\nAnd for those asking, if it's too saucy, then just crank up the heat and let it evaporate until it gets to your desired consistency. Even if you've followed the recipe to a tee, the pot and cover that you used, plus the level of heat could change the time it takes to reduce the sauce. It's basic science 🤷Anonymous4/8/2021Explore Bon AppétitFilipinoSoutheast AsianAsianPork ShoulderPorkMeatPineappleFruitOne-Pot MealsMainGluten-FreeDairy-FreeNut-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-15", "author": ["Condé Nast", "Louiie Victa"]}