{"id": "4711be9944dfa4ca9232934860e11f72", "url": "https://www.bonappetit.com/story/global-seed-vault-martha-stewart", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Martha Stewart Thinks a Global Seed Vault Could Save Us From Global Warming | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMartha Stewart Thinks a Global Seed Vault Could Save Us From Global WarmingIn the northernmost town in the world is a vault with almost one million seeds that could save the world—and Martha Stewart wants to take you there.By Alyse WhitneyJanuary 23, 2018FacebookTwitterEmailHeiko Junge/AFP/Getty ImagesFacebookTwitterEmailIf the apocalypse hit tomorrow, Martha Stewart is confident we’d be prepared. Instead of stockpiling canned goods or dried pasta, she’s putting her faith in the Svalbard Global Seed Vault, a massive international seed storage unit built into a mountain near the North Pole. The nearly 900,000 samples inside are provided by almost every country in the world, safeguarding seeds from natural disaster, war, mismanagement, and other crop-destroying circumstances. Think of it this way: The Global Seed Vault is like the cloud, storing up to 4.5 million backups of heirloom (non-hybrid) seeds ranging from African wheat and rice to European eggplants and potatoes. If global warming destroys all the corn in the Midwest or the avocados in Mexico, we'll be able to access those seeds and restart crop populations without them going extinct.Stewart has been an advocate for the Global Seed Vault since its inception in 2008. \"It's very kind of mysterious and kind of exciting, but it's also terribly serious to do this, and seriously important to do,\" she told me over the phone. Her friend Dr. Cary Fowler is an advisor for The Crop Trust and helped found the vault, and she is about to finally see it in person. In February, she’ll lead a tour with two prizewinners through the vault on the remote Norwegian island, exploring the -18°C space and speaking to scientists. (You can enter to be her guests on Prizeo with a $10 donation to The Crop Trust.)The Svalbard Global Seed Vault is in a remote town only 1000 meters from the North Pole.\nDaniel Sannum Lauten/AFP/Getty ImagesThere are 1,700 genebanks of seeds around the world now, but none are protected as intensely as the Svalbard Global Seed Vault. The vault is 120 meters inside the entrance of the building with multiple levels of security and cameras monitoring every move. No one works inside it on a daily basis, so the seeds are rarely handled—they're stored inside moisture-proof, triple-ply custom foil packages. The vault is on neutral ground (in collaboration with the Norwegian government and the Nordic Genetic Resource Center), so it can remain free of political issues that could impact its safety. In 2015, Syria became the first country to take seeds from the bank when civil war caused a national genebank to move from Aleppo to Beirut and many crops were lost. “The vault is a major humanitarian effort, and with all these countries working together, we can protect every crop that’s out there,” Stewart explained. \"If the vault didn't exist, there would be no backup plan.\"Viewed from an online 360° tour of the vault, the vault looks like a cross between an underground bunker and an Amazon warehouse. Permafrost and thick rock ensure that everything remains frozen—even if the power goes out—guaranteeing that the world’s food supply will be safe for centuries. “Just in case we have to start farming on Mars or escape from a nuclear disaster, we can take our seeds with us,” Stewart added. “They have 5,000 plant species already and there are thousands more to collect, so you can survive well on what's going to be preserved in the vault.”This is just a small glance at the hundreds of thousands of seeds currently stored in the vault.\nJacqueline Pietsch/AFP/Getty ImagesStewart's concern for the climate extends beyond seed-saving. “I wish I were more active—and I wish the United States government were more active—in the problem of global warming. Our appointees in the Environmental Protection Agency are not the correct people to handle the problems that we're facing, and they’re not taking it seriously,” she said. After Svalbard, she'll travel to the South Pole to investigate melting ice caps and glacier cracking.Stewart jokes that she could have some of her own seeds stored in the vault one day, but it isn’t that farfetched: She grows 40 types of tomatoes every year and collects other heirloom vegetables like Brandywine tomatoes, \"the sweetest red\" Valentine rhubarb, Green Arrow peas, Austrian finger potatoes, and Rouge Vif D'Etampes pumpkins. If these are the vegetables we'll be eating after the apocalypse, the future doesn't look so bad.Explore Bon AppétitHealthyishSeedVegetableInterviewsRead MoreWhere to eatA Farm For Burmese Refugees to Plant the Seeds of HomeGallery11 SlidesBy Olivia Rae JamesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Alyse Whitney"]}