{"id": "4717d183b5700ae649c5d3273fe05cb1", "url": "https://www.bonappetit.com/story/oven-dried-strawberries", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Oven Dried Strawberries Are the Dessert for People Who Can’t Bake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Strawberry Dessert for People Who Can’t BakeWhen life gives you strawberries, cook them.By Carla Lalli MusicMay 30, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Last week my esteemed colleague Sarah Jampel gifted me one berry from her market sojourn that morning. It was, as she said, “not that good,” and she 100 percent gave it to me because she needed me to complete a task (it worked), but the bribe was enough to get my appetite going. Since that starter berry, I’ve been looking forward to the day—coming soon—when the berries from all of the states in my tri-state area are at their peak. And sure, I can stand here at my stand-up desk and tell you all the things you should make when that happy time comes: Bon Appetit’s ultimate strawberry shortcake, this swirly semifreddo, an epic strawberry pie, or maybe you’d be into Amy Schumer’s husband’s recipe for strawberry and basil shortcakes. You could put your strawberries into this ice cream pie, or make an Eton mess, or you might like to try something really off-the-wall like a salad with strawberries in it (I wouldn’t).Carla Makes Strawberry Shortcake\nWant this letter before it hits the website? Sign up for our newsletter!But maybe, just maybe, you’re a purist. Maybe you’re not a baker. Maybe you had big ideas and grand ambitions that fizzled out when you got home and realized you didn’t have butter or flour, or basil or cream or eggs or frankly anything you’d need to make any of those recipes. Not even watercress for the wackadoo salad!Photo by Laura MurrayThe great thing about me is that even then I have a recipe for you! I see you, you non-baker who just spent $40 on strawberries but has nothing in the house. You ate as many raw strawberries as you care to, and you will not let the other ones go to waste. You, my friend, are going to slow-roast those berries on the lowest possible temperature setting, and you’re going to like it. The strawberries will release their juices and concentrate their flavor in the process, becoming the berriest they’ve ever been. When they come out of the oven, you can put them in yogurt, or spoon them onto toast, pancakes, or waffles. They’d be a great seasonal topper for a dish of ice cream, slice of poundcake, or a bowl of store-bought lemon curd. Once cooked, they’ll keep in the fridge a lot longer than fresh ones would, and they’ll take up less space, too.This is one of those rare times and even rarer recipes when being lazy is going to pay off. Make the most of it—especially if that means buying more strawberries than you can eat.Get the recipe:Oven-Dried StrawberriesHere’s your opportunity to use up berries that are slightly past their prime.View RecipeExplore Bon AppétitCarla NewsletterStrawberryRead MoreLifestyleHow to Make a Killer Fruit Salad No Matter the Time of YearBy Carla Lalli MusiccookingGet Lost In the Swirls of This Strawberry-Coconut Ice Cream PieBy Alex BeggscookingEton Mess Is Summer’s Easiest DessertBy Carey PolisshoppingThis Is What Strawberries Are Supposed to Taste LikeBy Brad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-30", "author": ["Condé Nast", "Carla Lalli Music"]}