{"id": "471ee56499b2db284440e0a400c71da0", "url": "https://www.bonappetit.com/story/time-for-peach-crisp", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "You’ve Got Time to Make Peach Crisp  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt's September and a Ripe Peach Is Hard to FindBut this crisp is the best thing to bake at the end of stone fruit season.By Dawn DavisSeptember 16, 2021FacebookTwitterEmailPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyFacebookTwitterEmailWelcome to You’ve Got Time for This, a column where Bon Appétit’s editor in chief Dawn Davis highlights recipes from our archives that are delicious and accessible and work every time.One time my husband talked me into trying a fast. The hour in which we were allowed to break the 72-hour fast coincided with a slow hike we were taking up Mount Tamalpais, a mountain in Northern California that, as Jack Kerouac rhapsodized, was “as beautiful a mountain as you’ll see anywhere in the world.” Hubby thought we’d enjoy Mother Nature more if we were calorie-deprived...something about heightened senses. But in an attempt to dodge my hangry wrath, he brought two California peaches with which to break our fast. That peach was the singular most flavorful and delicious thing I’d ever eaten, so juicy that the fuzzy membrane, once broken, couldn’t hold its sweet nectar. It ranks as one of my best food memories to this day.Now I live in the Northeast, where soft, ripe, and juicy peaches are nearly impossible to find and super expensive when you do. They don’t even seem related to those prized versions from Georgia or the Golden State. So what’s a peach-loving girl to do when these crimson and gold-hued lovelies call from the produce aisle and the farmers market?Bake with them.I’ve searched the archives looking for a recipe to share, and they all look so good! While one recipe might promise a sweeter filling, another offers a crunchier crisp. After some deliberating, I settled on pitmaster Bryan Furman’s Cinnamon-Oat Peach Crisp. It filled the house with the irresistible aromas of sugar, butter, and cinnamon, and it garnered raves, especially from the bakers in the family. Some commenters claim that the recipe calls for a tad too much sugar. If I were a betting person, I’d say those cooks were from the West Coast or the South, where the fruit is so sweet, it hardly needs any sugar to shine.With the last of the summer peaches (or the stone fruit of your choosing) at the ready, you’ve definitely got time for this.Cinnamon-Oat Peach CrispThis dead-simple oat topping can be repurposed for ANY fruit. All of the fruit! Any ol’ fruit!View RecipeExplore Bon AppétitYou’ve Got Time for ThiscookingPeachRead MorecultureAn Easy Weeknight Grilling Strategy for Lazy Cooks (Me)By Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-16", "author": ["Condé Nast", "Dawn Davis"]}