{"id": "471ff4465a77b47a6c9c3ebc9203f2ce", "url": "https://www.bonappetit.com/story/what-is-coconut-cream", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "What Is Coconut Cream Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Coconut Cream Anyway?If you've ever asked \"What is coconut cream?\" while standing in the supermarket aisle, this article is for you.By Emma WartzmanJanuary 31, 2018FacebookTwitterEmailFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.When senior food editor Andy Baraghani was developing this brothy green curry with rice noodles, he knew he wanted something vibrant and light, but not too watery, so he added coconut cream. But what is coconut cream, exactly, and how is it different from coconut milk?The difference between the two is similar to the difference between dairy milk and cream: They're made from the same ingredients (coconut, water, and sometimes guar gum for stabilizing), but coconut cream has a higher fat content than coconut milk (less water, more coconut), therefore it's thicker. Coconut milk and coconut cream taste very similar, so which you use is really all about the consistency that you want to get. Take that green curry: \"The problem with a lot of green curries,\" Baraghani explained, \"is that as they cook down, they turn a sort of sad, swampy, beige-y color. I wanted mine to be bright, but there was so much water and clam juice in there, it needed thickening up, too.\" In this case, a small can of coconut cream was the perfect solution, adding more body than coconut milk would have. \"I wanted it to be brothy, but not watery,\" said Baraghani.Photo by Alex Lau, Styling by Emily EisenNow that you know what coconut cream is, you're ready to go forth and buy some. The test kitchen likes Native Forest, but you can also buy it from Thai Kitchen. It's excellent in the curry, of course, but also for this Coconut-Chocolate Mousse. Makes sense, right? You want more fat content to get the creamy, luxurious texture of mousse. You can find coconut cream in many grocery stores, in full-sized or mini (5.4 oz) cans, but, if you don't find it, you can use the cream that rises to the top of the coconut milk can; just know that you'll probably have to buy a couple cans to get the amount of cream you'll need.If it's coconut milk you're after, there are a few options. Goya's coconut milk is on the thinner side, so use it for something like Aromatic Wilted Greens with Coconut Milk, when the milk is used more as a broth than a thickener.Thai Kitchen's coconut milk is the test kitchen's go-to for most other recipes. This coconut milk has more fat, which makes it thicker and perfect for curries and soups. Try it with Baked Eggs with Coconut Milk and Cilantro or Curried Lentil, Tomato, and Coconut Soup.And whether you're using coconut milk or coconut cream, you'll want to shake well before cracking open that can: the liquid separates from the fat in both varieties.Go forth with your newfound coconut cream knowledge:The Greenest Coconut Curry with Clams and Rice NoodlesCoconut cream gives this soup velvety richness.View RecipeCoconut-Chocolate MousseChoose a chocolate that does not exceed 64% cacao for a mousse with the smoothest texture. If you want the mousse to be fully non-dairy, look for a vegan chocolate bar, though the flavor may differ slightly.View RecipeFluke with Coconut Rice and Pickled OnionsThe key to buying fish for this recipe is asking your fishmonger what she would eat raw. Red snapper or black bass are good subs for lean, mild fluke.View RecipeExplore Bon AppétitCoconut CreamCoconut MilkHealthyishRead MorecookingThe Simplest Coconut-Chocolate Mousse Just So Happens to Be VeganBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Emma Wartzman"]}