{"id": "4739e5448aa5220801f2ed9a102bce43", "url": "https://www.bonappetit.com/story/how-long-to-marinate-meat", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "How Long to Marinate Chicken (and All Meat) for Maximum Flavor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Long to Marinate Chicken (and All Meat) for Maximum FlavorYou're probably marinating your meat for too long. This is how long to marinate chicken, beef, and pork so that you get the most bang for your buck.By Alex DelanyJanuary 16, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailMarinating meat is like stretching. Stretching is important. You know, before going for a run or playing in your coed rec soccer league that you definitely don’t take too seriously. (Sarah needs to pick up the slack though. Everyone’s been talking about it. We shouldn’t have lost to the Lightning Bolts. Just saying.) But you can actually stretch too much, and when you do, your muscles get all messed up. The same goes for meat. You can marinate chicken, steak, pork, and lamb for too long. And the meat doesn’t like that at all.Generally speaking, you shouldn’t marinate meat for more than a day. Yeah, probably shorter than you thought. For some reason, people (more specifically, dads) find some kind of perverse satisfaction in making declarations like, “These steaks have been marinating for five days.” Maybe it’s impressive? Maybe it shows a misplaced commitment to the meat? We’re not sure, but we can certainly say that it’s not doing those steaks any favors.Marinades usually consist of some type of sugar, salt, and acid, along with a variety of other flavor enhancers. Salt and sugar both break down muscle fibers to some degree (in the same way a brine does), but acid is the real culprit in this scenario. We like a little bit of tenderizing with meat, but when your chicken thighs are exposed to lemon juice, lime juice, yogurt, or vinegars for too long, the texture of the meat turns from tender to mushy and stringy, two words that have never been used in tandem to describe something pleasant.Soy-marinated pork gets a juicy kick from a quick marinade.\nPeden + MunkAt the heart of this this whole overexposure is a common misconception about marinating. The point of marinating isn’t to get flavor into the center of the meat. In fact, a marinade will never really penetrate much past the surface of the meat—and that's OK! The purpose of a marinade is to be the first thing that cooks when the meat hits the pan or grill. The heat develops the flavors of the salt, sugar, and acid in the marinade and helps to create a nicely caramelized crust. You can definitely develop big flavor on the outer layer of the meat this way, but it will never truly reach the center of the protein.Regardless of what type of protein dinner happens to be, make sure to keep your marinating period under 24 hours. And when we say under 24 hours, we’re also talking way under 24 hours. Marinating chicken, lamb, pork, or steak for just 15 or 20 minutes actually makes a huge difference. And now you know what to do. Marinate responsibly. And live with perfectly textured, flavorful meat for the rest of your days.Want to go for crispy instead of marinated? We have that too.One-Skillet Roasted Sesame Chicken ThighsBone-in, skin-on chicken thighs are the dinner gods’ gift to home cooks everywhere. Each one is its own perfect portion of crispy skin and juicy meat that’s pretty impossible to overcook. Just make sure you cook them thoroughly on the skin side first to render out as much of the fat as possible and ensure maximum crispiness.View RecipeExplore Bon AppétitBasicallyChickenPorkSteakLambMarinadeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Alex Delany"]}