{"id": "47462372ab3755d2570141a653278306", "url": "https://www.bonappetit.com/story/disco-di-sale", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "These Salt Disks Take the Guesswork Out of Seasoning Your Pasta Water | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingMaking Better Pasta Is As Simple As a Jar of Disco di SaleBland noodles? I don’t know her.By Tiffany HopkinsJanuary 27, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It’s “easy” to salt cooking water. It should be salty like the sea…except when it shouldn’t be. And don’t forget that some salts are saltier than others, so pay attention when you’re using sea salt, as opposed to kosher salt. Confused yet? I know I am—I’ve made my fair share of bland pasta and too salty beans. But no matter how many times I screw up dinner by miscalculating my water’s salinity, I can’t bring myself to pull out a measuring spoon for such a simple task. I blame my pride! I like to think my pinching precision is as good as Salt Bae’s, but really it’s hit or miss. That’s why I now keep a jar of Jacobsen Salt Co.’s Disco di Sale by my stove.“Yeah, that’s a lot of salt, I know.”\nThese salt disks each contain exactly 10 grams of compressed Italian fine sea salt and take the guesswork out of seasoning a pot of water. The first time I put them to use, I simply followed the directions on the jar and tossed three disks into four and a half quarts of boiling water, then dropped in a pound of spaghetti. The giant pot of water tasted less like the sea and more like the base of a well-seasoned broth. That night I ate the most flavorful red pesto pasta I’d had in years. Apparently, my fear of oversalting my cooking water meant that I’d been criminally undersalting it (something I didn’t even realize until I used Disco di Sale).Photograph by Isa ZapataJacobsen Salt Co. Disco di Sale$12 at Jacobsen Salt Co.$15 at Williams SonomaThese quarter-size disks have since become my secret weapon for all things big-batch boiling. I use them to season everything from par-boiled potatoes for crispy hash browns to make-ahead blanched greens. When I’m cooking in smaller batches for, say, quick lunchtime noodles for two, I opt for one disk. They’re insanely easy to use and they make my food taste better, but mostly I like that they make me feel like a more confident cook, no measuring spoons required.Explore Bon AppétitHighly RecommendShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-27", "author": ["Condé Nast", "Tiffany Hopkins"]}