{"id": "4751d2401e54dae8a6da042dbc1250bf", "url": "https://www.bonappetit.com/story/where-to-eat-nyc-answer", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "100 NYC Restaurants for Every Scenario | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture100 NYC Restaurants for Every ScenarioPeople always ask me where to eat. Now I have an answer.By Adam RapoportJuly 23, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“Where should we eat?”I get that question a lot. From friends, colleagues, relatives, and, more and more, from all sorts of folks who DM me on Instagram.I’m always happy to answer back; I love talking restaurants. But you can expect some questions.Like...is this a date? And if so, do you want some place loud and lively, or a spot you can actually hear what your date is saying?Uptown or downtown?Old school or new?Dining is situational. It’s about who you’re going out with, what kind of vibes you’re after, how much you’re willing to pay, what experience you want.Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex LauWhich is precisely the concept behind our recently-launched NYC100—a guide to not necessarily New York’s “best” restaurants, but the best restaurants for pretty much every single scenario.Spearheaded by associate editor Alex Delany, the project marshals the support of our entire staff—a team of editors who hits the town an astounding amount (at least in the eyes of a certain editor in chief, who smacks his alarm every morning at 6:47 a.m. to get his kid ready for school).As particular as these editors are about which brand of kosher salt you should swear by, or why you should never, ever dump your pasta water, they’re even more exacting when it comes to where they spend their time and money when they’re off the clock. Which, truth, be told, they never really are. They’re always taking notes, snapping photos, and compiling mental lists for every occasion. And now those tallies have joined forces to form one, super-informed actual list, the NYC100.It’s easy to navigate (one long scroll), with just enough photos (but not too many), nothing clunky to load (no WiFi required!), and most of all, it’s as fun to read as it is useful.Whether you’re a die hard New Yorker or visiting for a long weekend, it’s got you covered. For instance, it serves up...All the meats from Hometown Bar-B-CuePhoto by Alex LauThe Place to Escape the Saturday-Night Chaos of the Lower East Side, While Still Going Out on the Lower East Side(That would be the chic Japanese-inspired watering hole, Bar Goto.)The Place When You’re Near Madison Square Garden and About to Just Give Up(Upside Pizza, an oasis in a truly dismal dining stretch of Manhattan.)The Place for Convincing Your Southern Friends that NYC Does, in Fact, Have Phenomenal Barbecue(Hello, Hometown BBQ, which is legit. No, really!)The Place for When Some People Want to Drink and Other People Want to Have a Nice Dinner(Achilles Heel, a personal favorite of mine for birthday get-togethers, drinks with an old friend, and where I end up in Brooklyn when I want a drink and a snack but not a full-on meal.)So, you get the point. It’s a list you can use. Because finding a place to eat or drink or caffeinate in a city as overwhelming as New York is always a challenge. The NYC100 makes it just a bit easier.See the full list:The NYC100 - March 2020 EditionThere are restaurant lists with rankings. And there are restaurant lists with purpose. This is the latter.View StoryExplore Bon AppétitAdam NewsletterRead MorerestaurantsThe NYC100 - March 2020 EditionBy The Bon Appétit StaffcultureThese Restaurants Define New York for MeBy Amanda ShapirorestaurantsThe Ten Bells Is the Best First Date Bar in NYCBy Rachel KartenrestaurantsThe Backyard at Saturdays Is My One Way Ticket Out of NYC’s Gnarly Summer HeatBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Adam Rapoport"]}