{"id": "4753ca5bd6858ab4f01c994cd14d1f71", "url": "https://www.bonappetit.com/story/never-fail-garlic-broth", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "This Garlic Broth Slays My Sunday Scaries | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Garlic Broth Slays My Sunday ScariesFuzzy slippers, a mud mask, and two heads of garlic in a pot are my religion.By Emily SchultzDecember 7, 2018FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.At approximately 5:54 p.m. every Sunday, I do a few things. First, I cover my face in a really intense mud mask, the kind where you can’t actually move your mouth once it dries. (This one, in case you were wondering.) Then, I put on the pair of grandma slippers that senior staff writer Alex Beggs gifted me. (They’re a spa for your feet!) And then, once I'm good and cozy, I CRAVE soup.It literally doesn’t matter if it’s July or February, I always crave soup on Sundays. It may have to do with the fact that it’s so comforting, or that I have a hangover I need to sweat out, but trust me when I say that a bowl of broth-y, noodle-y soup on a Sunday night is the most perfect thing. The problem? That soup craving also coincides with the realization that I spent way too much money over the weekend to justify ordering it on Seamless, which is honestly what I would usually prefer to do. I have to make it. Which is the point where this garlic broth slyly waltzes up and asks to buy me a drink.In case you don't know me, I'm not the kind of person who has old chicken bones lying around to make stock with, and I'm also NOT leaving my apartment to go get some, which is why this aforementioned garlic broth is so clutch. The basis of this broth is just a TON of garlic (2 whole heads!), but everything after that is up to you. I often add in ginger and scallion, but have done it with yellow onion and celery, too. Got a carrot? Sick! Throw it in. Then I’ll add in whatever tender herb is wilting in the crisper, mostly always cilantro and oftentimes parsley too. When I’m feeling saucy—which, TBH, is most times—I like to whisk a tablespoon of miso and a tablespoon of Sriracha into water to dissolve and then stir that in. It gives the broth a lot of structure and flavor, and makes it look like swamp water! Cool! You let it get all simmer-y while you wash your face mask off, boil some noodles and maybe make an eight-minute egg. I'll strain the broth, season it with plenty of salt, and then build bowls with noodles, broth, eggs, and maybe a sprinkling of sesame seeds if I'm in the mood. I like to make too much, so I have soup for the week, or freeze it in my silicone ice trays for next Sunday’s craving.Get the recipe:Garlic BrothThis back-pocket broth is hardly even a recipe, but it's the most soothing soup we can imagine for sick days, cold nights, and any other time you need a little extra comfort. View RecipeExplore Bon AppétitBasicallyNever FailGarlicBrothSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-07", "author": ["Condé Nast", "Emily Schultz"]}