{"id": "475846c704b75c1a8a30d23f83e87cb4", "url": "https://www.bonappetit.com/story/etxebarri-spain", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Etxebarri Was the First Meal in Ages That Made Me Cry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEtxebarri Was the First Meal in Ages That Made Me CryFrom tiny grilled peas that taste like caviar, to a quenelle of smoked-milk ice cream—I was left in tears after this once-in-a-lifetime meal.By Christine MuhlkeJuly 5, 2018FacebookTwitterEmailPhoto courtesy of Christine MuhlkeFacebookTwitterEmailCrying while you eat is a good thing. Really. Maldon has nothing on tears of joy when it comes to adding that perfect finishing element to a dish. At least, that’s how I felt during several points of my meals at Etxebarri.The dining room of the once-humble asador, or tavern-meets-grill, in the foothills of Spanish Basque country is still in the same rustic stone building it’s been in since the ‘90s, before the restaurant began appearing on all the right lists and TV shows over the last 15 years. When you have welcome snacks on the terrace, you’re surrounded by mountains and farms speckled with sheep and horses, just as the town of Axpe has looked for centuries. But there have been some upgrades inside Etxebarri: now there are thick linens, fine handmade ceramics, and ikebana floral arrangements gracing the well-spaced tables set beneath the wooden roof, and the 15-course tasting menu costs 176 euros. While the fancy, list-ticking gestures are there, the spirit remains humble, the food pure. You could set any of the dishes in front of the old ladies playing cards in the ground-floor tavern in the late afternoon and they wouldn’t think that little Victor (Bittor in Basque) Arguinzoniz had gotten some crazy ideas into his head since he took over this building with his father and uncle.Victor, the self-taught chef—who’s in his late 50s, by the way—has gotten some ideas into his head, but they’re all about how to coax the most flavor out of the region’s ingredients by using only the fire, live coal, and embers from oak and grapevines to cook them. A row of six custom grills crank up and down as needed, whether it’s to caramelize the crust of a steak basted with smoked butter, or to give the freshest prawns from Palamos a minute per side before they’re rushed upstairs by family members to diners who quickly abandon their silverware to pick up the head and suck it clean. The hand towel that appears is used both to clean fingers and dab away tears: How could something so simple taste like a fifty-fold manifestation of itself?Arguinzoniz grilling the prawns.\nPhoto courtesy of Christine MuhlkeIt’s something I wondered as I ate a bowl of very early peas. Bordering on microscopic, they popped gently as I ate them, bursting with sweetness napped in smoky butter. Better than caviar. The peas, Arguinzoniz later told me, had been picked from his garden and grilled in the pod for 30 seconds before he gave them to the cooks standing around a metal table. (He has only five cooks and five pastry chefs, most of whom are from other countries, such as the Senegalese woman who attends the local culinary school.) Two days later, I had a version of this dish at a high-end molecular restaurant in the region, and it literally paled in comparison, overcooked and overworked.Photos courtesy of Christine MuhlkeA bowl of grilled squid the size of your thumb tasted of a woodsy sea, buoyed by a pimentón oil. A quenelle of smoked-milk ice cream floating in summer-sweet beet juice. The food wasn’t trying to be anything other than it was. There were only two sauces in the tasting, both Basque—no quotation marks. And that steak was served unaccompanied. How could a potato, or even a slab of bone marrow, compete? Sure, there were some dishes that I couldn’t love, like a tartare of housemade chorizo, briefly seared on the edges but raw in the center, as well as a dessert made from local pumpkin. But I figured that I didn’t have the context for them. Maybe I should have asked those ladies downstairs.Grilled squid.\nPhoto courtesy of Christine MuhlkeI dined at Etxebarri twice in three days—like winning the lottery twice. (Had I known about the rustic Sunday lunch served in the downstairs tavern, I would have taken the half-hour taxi ride from Bilbao again.) For the first dinner, I reserved months in advance, as I was there during the World’s 50 Best Restaurants awards. For the second lunch, I scrapped plans for a boat tour of Bilbao to be able to spend four hours at the table with several of the chefs who would take bows later that night. They, too, were silenced by emotion evoked by those prawns, those peas, that steak—all reminders of the beauty of simplicity and honest cooking, served with neither razzle nor dazzle.As we were leaving, I told Arguinzoniz, through a translator, that I hoped he had a good suit to wear over his black T-shirt in a couple of hours. In my mind, at that moment, this was the world’s best restaurant. He shook his head shyly and laughed*.*Etxebarri was No. 10.Related: Tour de Basque: 295 Miles, 26,200 Calories, 8 Meals—1 Insane Dream TripExplore Bon AppétitRestaurants + TravelBasqueSpainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-05", "author": ["Condé Nast", "Christine Muhlke"]}