{"id": "475deb91b7d16ed74395a5f117fc23c3", "url": "https://www.bonappetit.com/story/how-to-cook-holiday-ham", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "How to Cook A Ham That Can Be the Handsome, Mouthwatering Centerpiece on Your Holiday Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Bone-In Glazed Ham, the Holiday Meat to Rule Them AllOn this table, it’s all about the pork.By Amiel StanekNovember 23, 2021FacebookTwitterEmailPhotograph by Emma Fishman. Food Styling by Pearl Jones.FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.A great holiday spread doesn’t need multiple carbohydrates, a display of cookies, a green vegetable, or—gasp!—a beautifully bronzed bird holding court. The real centerpiece is a bone-in glazed ham, which can redeem any small talk you’re required to make with third cousins. Learning how to cook ham takes, well, almost no learning at all—as is the case with many of the best foods, the payoff is disproportionate to the prep. As long as you seek out a high-quality ham and make a delicious sauce to coat and flavor it—a brown sugar glaze is always a crowd-pleaser—you’ll be rewarded with a handsome piece of meat that can happily serve 12 of your closest friends. It’s a hands-off process you can do entirely in your oven with minimal equipment—you don’t need a slow cooker or even a roasting pan. Whereas a turkey begs to be dry-brined for several days, a cooked ham, as long as you remember to thaw it from frozen, requires almost no thinking ahead. And the leftover ham you will make your way through the whole week after might be even better than the ham itself?Below, we’ll cover what ham even is, what distinguishes a holiday ham from a regular ham (hint: it’s not just a ham wearing its ugliest sweater), and how to cook ham to perfection.Wait, though: What is ham, anyway?The word ham refers to the hind leg of a pig, usually one that has been preserved or cured, whether by salting, drying, smoking, or some combination of the three. Before widespread refrigeration, pork was processed this way to prevent the growth of harmful bacteria and extend its shelf life; these days we still do it because, well, it tastes amazing.So what’s a holiday ham then? When we’re talking about the crackly, glazed, rosy-fleshed joint of meat that anchors many a Thanksgiving, Christmas, or Easter table, we’re usually referring to what’s known as a city ham—that’s the haunch of a pig that’s been cured in a saltwater brine and then typically smoked and fully cooked. (A fresh ham, on the other ham hand, has not been preserved: It is uncured, unsmoked, uncooked piece of meat that must be prepared according to a different process.)Sold! Now how do I buy a great holiday ham? To get your hands on the best ham possible, follow these four steps:1. Order aheadWhile most local butchers and even some grocery store counters will be able to hook you up with a quality specimen, we love the security of having reliably excellent mail-order sources up our sleeve. Both Snake River Farms and D'Artagnan offer Kurobuta half hams (Kurobuta is the same as Berkshire pork, which you can think of as the Wagyu of pork). Snake River's run smaller, so they're a good bet for more intimate holiday gatherings.5.5-lb Korubuta Bone-In Ham$125 at Snake River Farms8-10 lb Berkshire Pork Bone-In Spiral Half-Ham$126 at D'ArtagnanIf you're feeding a crowd, Heritage Foods sells maple-sugar-cured half hams of up to 16 pounds from Paradise Locker Meats in Missouri. 12-14 lb Maple Sugar Cured Heritage Ham$234 at Heritage FoodsPorter Road's hams come from pasture-raised pigs that are cross-bred from 3 heritage breeds (Duroc, Berkshire, and Chester White). Although we usually go for a bone-in ham (more on that below), this is a great option if you prefer boneless.4.5-6.5 lb Half Ham$84 at Porter Road2. Choose bone-inThere’s nothing wrong with buying a boneless ham, but we usually get one with the bone intact. There’s just something festive about a bone-in piece of meat! But aesthetics aside, a leftover bone with bits of meat clinging to it is the key to a truly transcendent pot of beans or split pea soup.3. Buy halfUnless you’ve got an army to feed, you probably don’t need a whole ham, which can weigh around 20 pounds—one reason why most purveyors cut them in half for you in the first place. A half ham clocking in at 8–10 pounds is plenty for a plated entrée for 12 with leftovers, and it will serve many more as part of a snacky holiday buffet.4. Slice it yourselfWe generally like the flexibility of getting to slice a ham ourselves. That said, a spiral-sliced ham (that is, a bone-in ham that the butcher has sliced into, you guessed it, a giant spiral), falls apart into tidy pieces and is a safer option if the idea of carving a hulking piece of meat—or allowing your tipsy guests to try their hands at it—makes you uncomfortable.This stunner is glazed with a reduction of pineapple juice, vinegar, and brown sugar.\nI’ve got the ham, but how do I cook the ham?The beauty of cooking a ham is that, well, it’s already cooked—all you really need to do is heat it up without drying it out, hit it with a tangy glaze right at the end, and serve it in style. Essentially, you’re following a two-part cooking process: Warm the ham, covered, on low or medium heat, then increase to high heat to crisp the surface with a shellacking of sweet, spiced glaze. Here’s how to cook the ham in five steps:1. PrepIf your ham is frozen, make sure to budget 2–3 days for it to slowly thaw in the fridge. Before cooking, let ham sit out at room temperature for at least an hour to take some chill off. And, if you opted for an unsliced ham, as we recommend, use a sharp knife to score the fat side of the ham in a crosshatch about ½\" deep. This diamond pattern will maximize crispy bits and create lots of nooks and crannies for the glaze later on.2. BakePreheat oven to 300°. Wrap the ham tightly in foil (this prevents it from drying out) and place it on a wire rack set inside a sheet pan or roasting pan. The wire rack helps to stabilize the ham and encourage air circulation. You can also bake the ham unwrapped on a wire rack in a roasting pan, but be sure to add a couple cups of water, which prevents the ham drippings from burning and generates the steam to keep the meat moist. Bake until an instant-read meat thermometer registers at least 125° for the internal temperature of the thickest part of the ham (avoid hitting the bone). This will take about 15–20 minutes per pound. (Remember: A bone-in ham will take longer to warm through than a boneless one.) If your ham is 10 pounds, then you want to account for about 3–3½ hours of total time for it to be warmed through.3. GlazeOnce the ham is warmed through, take it out of the oven and increase the heat to 425°. Meanwhile, make this easy glaze: Whisk together 1½ cups whiskey, ¾ cup honey, ¼ cup mild-flavored (light) molasses, 1 tsp. chile flakes, and a few cranks of black pepper. Mess with the glaze recipe all you like—as long as you have something boozy, something sweet (that could be honey, maple syrup, brown sugar, cranberry sauce, or even reduced orange juice or pineapple juice), and something spicy (that might be Dijon mustard, horseradish, Calabrian chiles), your ham glaze will be a well-balanced counterpart to the rich meat. Remove foil from ham, brush with glaze, and bake, basting with more glaze every 5 minutes or so, until deeply browned, 15–20 minutes total.4. RestLike any cut of meat, a baked ham needs to rest before serving to be its best, juiciest self. Give it at least 20 minutes or resting time.5. ServeIf ham is the main dish at a sit-down dinner, you want sides that balance out its rich sweet-saltiness—think simply dressed greens, scalloped potatoes, or roasted brussels sprouts. But if it’s part of a holiday party spread, meant to be supplemented with many other side dishes, the path forward is well-trodden and clear: Set out some Martin’s potato rolls, tangy pickles, mayo, and good Dijon mustard and watch that ham disappear.Wait, what about all those other types of ham? Just because a brined city ham will always be our holiday ride-or-die doesn’t mean we aren’t equally enamored of the many and storied styles out there. We’re particularly fond of these drier air-cured varieties that want to be sliced thinly and served as charcuterie. Country Ham: America’s esteemed entry into the pantheon of dried pork, country ham is a Southern tradition. Salted, typically heavily smoked, and air-dried, it is eaten both cooked and, sometimes, sliced thin as charcuterie—our favorite way to experience its smoky, funky flavor.Prosciutto di Parma: While prosciutto can come from many parts of Italy, the stuff from Parma is arguably the finest. Salted and air-dried for many months, and sometimes years, it’s delicate, supple, and sweet.Speck: Denser and brawnier than prosciutto, this style of Italian ham gets big flavor from the addition of aromatics like juniper, bay, and pepper to the cure, along with a light smoking.Jamón Serrano: Originally hailing from the mountains of Spain, and usually made from specific breeds of pigs, Serrano is mildly salty, nutty, and complex, with a distinctly porky finish.Party meat:1 / 30ChevronChevronLow-and-Slow Rib RoastView RecipeExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Amiel Stanek"]}