{"id": "4761167b47689cdebfa95776afb0991a", "url": "https://www.bonappetit.com/story/what-is-harissa", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "What Is Harissa, the Spicy, Peppery Condiment We Will Never Quit? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat is Harissa, the Spicy, Peppery Condiment We'll Never Quit?If you're not riding the harissa train, you're missing out, bud!By Alex DelanyJuly 11, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailIf you’ve read Basically or Bon Appétit for even a short period of time, you’ve certainly seen us mention harissa. It’s a peppery condiment that—to put it mildly—we have quite the liking for. If you were to peek into the fridges of any of our staff members, you’d find a jar or two hanging out on the door. But what is harissa, this condiment we use with such frequency and gratitude? Great question.Harissa originally hails from Tunisia and has become a cornerstone of many Tunisian, Israeli, Moroccan, Libyan, and Algerian dishes. It’s a chile paste made from a variety of dried chile peppers (ranging from very hot to mild) that are rehydrated then blended with olive oil, spices (usually toasted for a more intense flavor), and, sometimes, garlic. Harissa varies widely: Sometimes it's smoky from the addition of roasted fresh chiles; sometimes it's sharp and tangy from citrus juice and/or vinegar; sometimes it's loose saucy; other times it's thick and pasty.Photo by Chelsie CraigWhile you can certainly make harissa at home, it’s also widely available at grocery stores. But before you grab a jar off of the shelf, there are a couple things to keep in mind. First, many brands that make harissa have hot and mild varieties. You obviously already know what these distinctions mean: If you want more spice, go for the hot. If you want sweeter, more floral pepper flavor with minimal heat, go for the mild.But within each brand, the hot and mild versions will have different levels of spice. There isn’t an industry-wide unit of measurement for how spicy harissa is. The best way to control for spiciness is to find a brand you like and use it exclusively (within reason, of course). If you find yourself face to face with an unfamiliar brand, taste it before you add it so that you don't end up with a dish that's inedibly hot (or more mild-mannered than you'd prefer).Second, look for brands that list peppers as the first ingredient. Harissa can sometimes be cut with tomato product, and that's not what you want. (When in doubt, we go with the brand NY Shuk.)Harissa loves chicken. Chicken loves harissa. Perfect.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesOkay so now you have harissa. What the hell do you do with it? Short answer: Use it in any way you’d use chile paste, fresh chiles, or hot sauce.Longer and more useful answer: Stir it into scrambled eggs. Add it to marinades. Stir it into sauces. Mix it into yogurt for a spicy, peppery dip. Toss roasted and grilled vegetables in harissa or plop a spoonful on top of your hummus. Stir it into softened butter and slather it on boiled corn. Spread it on sandwiches. Sub it for ketchup!The applications are as limitless as our love for that beautiful, peppery flavor.Explore Bon AppétitHarissaCondiment/SpreadPepperIngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Alex Delany"]}