{"id": "476afd59621c28564cde8deec2ada5ae", "url": "https://www.bonappetit.com/story/adarra-restaurant-richmond-virginia", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Someone Please Stop Me From Eating All the Gildas at Adarra | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSomeone Please Stop Me From Eating All the Gildas at AdarraFat anchovy + briny olive + sharp guindilla pepper = perfection.By Elyse InamineAugust 20, 2019FacebookTwitterEmailPhoto by Nick AytcheFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m that person who always orders too much food at a restaurant. Maybe it’s because I’m indecisive. Maybe it’s because my eyes are bigger than my stomach. Or maybe it’s because the abundance of options awakens a deep survivalist instinct, urging me to amass as many nutrients as possible. (Yeah no, probably not that last one.) Regardless, whatever table I’m at is the one where the plates quickly pile up.So naturally, when associate visuals editor Emma Fishman and I pulled up to the bar at Adarra in Richmond, Virginia, we got not one, not two, but SIX gildas—the iconic Spanish skewer of fat white anchovy, pickled guindilla pepper, and one briny green olive. (A word to the wise: each order comes with a glass of Emilio Hidalgo fino sherry.) And this was before Emma and I even got started on the rest of the menu. But I have no regrets.Wait, I actually do. We should have ordered a dozen more, because that’s just how good chef Randall Doetzer’s gildas are—perfectly salty, buttery, lip-tinglingly sour, and just a tiny bit spicy, the kind that makes you want another.This perfection comes from tinkering with the three ingredients to strike the right balance of fat, acid, and salt. But because they’re all either seasonal or available at the whim of an importer, Doetzer has to regularly search for new ones to swap onto the skewer. Sometimes it’s a mild, fruity Castelvetrano olive, other times it’s two Picholine from Morocco. On occasion it’s a guindilla pepper from Basque country with a sharp, super acidic flavor; other times it’s one that’s a bit mellower. Since he first put the dish on the menu a couple months ago, he guesses he’s gone through three different types of pepper, four kinds of olives, and two varieties of tinned anchovies.While constantly having to source new ingredients sounds like a logistical nightmare, it’s all part of the fun for Doetzer. “It would be kind of boring if we had an indefinite supply of perfect olives—it would never ever change,” he explained. The only thing I’m looking to change? The number of gildas I order next time I’m there.Go there: AdarraExplore Bon AppétitHighly RecommendRestaurantsSpanishRichmondRead MorerestaurantsThe Wine Store in Barcelona Where Wine Nerds Just Want to Share the LoveBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-20", "author": ["Condé Nast", "Elyse Inamine"]}