{"id": "476e74b2f90789cdd11aded45a55e912", "url": "https://www.bonappetit.com/story/sweet-potatoes-navratri-fast", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Sweet Potatoes Are the Star of My Festival Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSweet Potatoes Are the Star of My Festival SeasonThey’re easy, delicious, and fasting-friendly.By Sonia ChopraOctober 21, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery Tuesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.It’s Navratri this week, a Hindu festival celebrating the changing season and, like all my favorite Hindu holidays, a triumph of good over evil (in this case, a restoration of dharma). Most years I keep at least a portion of the nine-day Navratri fast, but with new job busyness and all this staying at home, I missed the familiar signs of festival season—bouquets of bright marigolds popping up in bodegas, friends making garba plans, displays of fast-friendly ingredients like sabudana in Indian stores—and just did not get it together in time to prepare.I had pretty much decided to skip the fast altogether this year, but then I read a couple of really lovely stories about how some people found solace and community during this spring’s Ramadan—a different fasting holiday—and wondered if I was giving up too easily. And then a friend came by with fresh curry leaves from her new plant (a luxury here in Brooklyn!) and I took it as a sign to shape up and get my Navratri fasting plan—which is actually all about cooking, since the fast is more of a restrictive diet—in order. The list of forbidden foods is predictably long (table salt, garlic, onions, warming spices like garam masala and turmeric, lentils, staple rices and flours, eggs, meat, alcohol, coffee, and so on), but there’s also a whole range of special, delightful meals that are eaten during Navratri, using the “approved” ingredients, which are easy to find in every corner market and utilized across restaurant menus—if you’re in India.Want this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie Craig, Food Styling by Pearl JonesHere in New York, for someone like me who is behind on, well, everything, it’s all about sweet potatoes, coupled with the permissible dairy, fruits, nuts, and sweeteners like honey and sugar. As my grandmothers are quick to remind me, the sweet potatoes we get most easily here in the U.S. are miles away from the white-fleshed ones in India, but they’re still allowed, and they’re cheap, versatile, delicious, and accessible to me without hopping on a train or two to get to an Indian grocery store. For the rest of the week, you can find me charring them to eat with hot honey butter and lime or roasting them to top with hazelnuts and yogurt. With the curry leaves, plus some ghee and cumin, I’ll make a tadka to drizzle over them, and I might play around with chaat preparations with whatever else I have on hand. I’ll drink nimbu pani all week, and once I get sick of savoryish sweet potatoes, I’m also going to try these sweetly caramelized plantains called maduritos.Whether you’re fasting for Navratri or not, I’d love to hear what you’re cooking this week, and if you have any favorite quick ways to punch up tubers. And if you’re better at planning ahead than I am, please check out Bon Appétit’s election series and make sure you have a plan to vote (if you’re able), or visit this great Epicurious Thanksgiving recipe finder to start meal-prepping for that big holiday, which is coming up faster than I’m ready for. BA’s November issue, all about the ways we’re celebrating this year, should be hitting your mailboxes soon too. You can subscribe to the magazine through this link and reach me, as always, at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-21", "author": ["Condé Nast", "Sonia Chopra"]}