{"id": "4777790efad08748c3f207264016ec67", "url": "https://www.bonappetit.com/story/baked-spaghetti-pie", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Baked Spaghetti Pie alla Norma with Eggplant and Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBaked Spaghetti Pie is a Pasta Lover’s FantasyIt’s everything you love about pasta, only more.By Sarah JampelSeptember 21, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailI live in a house divided.For one of us, no phrase could be more beautiful than baked spaghetti pie; the ultimate diet is pasta for every meal of every day; and the grand fantasy is to live in the children’s book Strega Nona, in which a town is overtaken with macaroni and a little boy named Big Anthony has to eat it all.Oh, you want red sauce?The other one of us (fine, it’s me) would prefer to eat sweet potatoes every night and have pasta once or twice a month.But that changed when I met this new recipe from senior food editor Claire Saffitz for Baked Pasta alla Norma—saucy, cheesy, and hiding bits of tender eggplant, with a Medusa vibe and an irresistible, fight-over-it crust.  (It’s called Norma, if you’re wondering, because its excellence is comparable to that of Vincenzo Bellini’s opera by the same name.) It’s got all of pasta’s best qualities—lots of carbs, a fun eating experience, an inherent comfiness—but it’s more an ooh-ahh, must-have-that spectacular than a bowl of noodles.Photo by Alex LauAnd it doesn’t take much more effort. While you wait for the pasta water to boil, you’ll make the “alla norma” part of the recipe by roasting eggplant, cherry tomatoes, and smashed garlic in a big skillet the oven. Make sure that the tomatoes burst: Their juices, when combined with a heap of grated Parmesan, a couple beaten eggs, and a squeeze of tomato paste, form the sauce that coats the spaghetti and keeps it from drying out. Once the vegetables are out of the oven and the pasta is cooked—use any shape you’d like (campanelle, conchiglie, rigatoni), though the drama of long, swirly noodles is unbeatable—all that’s left to do is toss everything together, press the pasta back into that big skillet, and bake for 30 to 35 minutes, until the top is golden brown.Now normally I turn my nose up at such a long wait time, but it actually affords the opportunity to do the dishes, which means I can get into bed sooner after the meal is over.Beyond that, spaghetti pie, rather than ordinary spaghetti, is less time-sensitive. Whereas most sauced pastas are demanding (especially the eggy and/or cheesy variations, which will lose their creamy sheen in a matter of minutes), this pie is stable: You don’t have to rush to serve and eat it, and it’s even better the next day.Photo by Alex LauYou may lose those coveted crispy edges, but I recommend heating some olive oil in a heavy skillet and frying up a thick slice until the crust is brown and glistening.  Maybe sizzle an egg while you’re at it. Pasta pie for breakfast? I must be a true convert.Get the recipe:Baked Pasta alla NormaCheesy, saucy baked pasta is even more fun when you can slice it into wedges.View RecipeExplore Bon AppétitSpaghettiPastaEggplantTomatoRead MorecookingThis Spaghetti Pomodoro Recipe Is a Pasta Master ClassBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-21", "author": ["Condé Nast", "Sarah Jampel"]}