{"id": "477cdc16ea360dba5604fc2af5d717f4", "url": "https://www.bonappetit.com/recipe/new-and-improved-greek-salad", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Greek Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueNew-and-Improved Greek SaladBy Andy BaraghaniJuly 9, 20194.9(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThe method for marinating the feta is also a good trick for other fresh cheeses—try goat, mozzarella, or paneer.Ingredients4 servings¾cup extra-virgin olive oil, divided1small lemon, thinly sliced into rounds, seeds removed8oz. feta1Tbsp. chopped oreganoKosher salt, freshly ground pepper4Jimmy Nardello or other sweet Italian frying peppers1small red onion, very thinly sliced1large Japanese or Armenian cucumber or 2 medium Persian cucumbers, peeled, cut into 1½\" pieces1lb. small tomatoes (such as Sun Gold and/or cherry), some halved, some left whole2Tbsp. red wine vinegarPreparationStep 1Heat ¼ cup oil in a large skillet over medium-high. Add lemon slices and cook until lightly charred around the edges, about 2 minutes per side. Transfer lemon slices to a medium bowl. Set aside skillet with oil.Step 2Break feta into large pieces and add to bowl with charred lemons along with oregano and remaining ½ cup oil; season mixture lightly with salt and generously with black pepper. Toss very gently to coat and set aside.Step 3Set reserved skillet over medium-high heat and add frying peppers. Cook, shaking pan occasionally, until skins are lightly charred and flesh is tender, 6–8 minutes. Transfer peppers to a cutting board and let cool slightly, then cut in half lengthwise.Step 4Toss onion, cucumber, tomatoes, vinegar, and a large pinch of salt in a large bowl. Add frying peppers and lightly toss again to combine. Transfer salad to a platter and scatter marinated feta with lemon slices and oil over.How would you rate New-and-Improved Greek Salad?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSo sorry…this is neither new, nor improved. Across Greece there are myriad variations of ‘xoriatiki’ or Greek salad. ‘Xoriatiki’ literally just means ‘village style’ so whatever village you’re from determines the type of variant of tomato/cucumber/feta salad you eat. In my family there’s a long-standing debate whether to use red wine vinegar or lemon as the acid…so guess what…we use both. My aunt grows her own peppers, tomatoes, and GOOD cucumbers, so guess what, we use all of that. Also, that’s not nearly enough olive oil. Just sayin. #greeklikemeAnastasia GreekLikeMeGreece6/29/2021Improved Greek Salad???? - sorry Andy Baraghani but I believe you should call it \"a different kind of Greek Salad\" Since the traditional Greek Salad consists of tomato, cucumber, green pepper, onion, olives, feta cheese, dry origano - In some parts of Greece they add capers as well.lexeeGreece9/5/2020Easy and nice twist on the classic Greek salad.Anonymous8/22/2020After spending a lot of time in Crete, it seems like sacrilege to claim you can \"improve\" on horiatiki - but this is damn good. Pull out your best olive oil and go to town; I could've eaten a plate of the charred lemons alone. I will absolutely make this again once cherry tomatoes are ripe and bursting. \"Healthyish\"? Not really, but what a recipe!janemontgomeryWashington DC6/7/2020Greek salad sans lettuce is actually authentic greek village salad- it's called horiatiki! Love the charred pepper and lemon updates to the orig nonetheless. Yum!AnonymousLake Geneva, WI10/10/2019As with all recipes deliciousness hinges on the quality of your ingredients. Full of flavor feta, fresh veg, and tasty oil are vital. I made as a Fri night dinner so I felt it needed more substance and added a bed of fresh mixed lettuce plus olive garnish and warmed pita bread. Everyone agrees this is a repeater. Would have given it 5 stars if it was quicker with less clean up.snowdayCharleston, WV9/21/2019Explore Bon AppétitSaladFetaCheeseCherry TomatoTomatoVegetableCucumberPaneerSummerQuickEasyWeeknight MealsSideMainGluten-FreeNut-FreeVegetarianKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}