{"id": "478ad89c95bd850f52b6113556bd2963", "url": "https://www.bonappetit.com/story/best-bone-broths", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "The 5 Best Bone Broths You Can Buy Off the Shelf | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe 5 Best Bone Broths You Can Buy Off the ShelfWe tried 22 bone broths to pick the most flavorful, closest-to-homemade options.By Alyse WhitneyJanuary 5, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This article was originally published in 2018.The best bone broths are a labor of love. To reap the benefits of the warming elixir—improved gut health and immune system, stronger joints, nails, and hair—you’re looking at least a full day of blanching, roasting, and boiling bones until they transform into a gelatinous, collagen-rich stock. But not all of us have 8 to 24 hours to commit to making such a fortified stock, and there are dozens of bottled, jarred, boxed, and bagged bone broths on the market now. But how do you know which bone broth is actually worth buying?We tried 22 chicken and beef bone broths, comparing them to the flavor and body of a great homemade stock, and found just five worth your time and money.A note on nutrition: “There is no concrete evidence that shows whether chicken is healthier than beef bone broth,” explains registered dietitian and nutritionist Charmaine Jones (M.S., RDN, LDN). She suggests adding 4 to 8 oz. of any variety of bone broth to your diet each day, which can help with healing wounds, improving skin, hair, and nails, and strengthening bones.Kettle & Fire Chicken Bone BrothThis shelf-stable bone broth didn’t smell like much of anything, so we were surprised that it tasted “SO CHICKEN-Y” and homemade. It had a nice body and the mouthfeel of a home-cooked broth, which was surprising since it didn’t have to be refrigerated or frozen like most of our other picks. It was packed with a lot more vegetables than other bone broths: roasted poblano peppers, and all organic green peppers, scallions, tomatoes, celery, onion, carrot, garlic, and assorted herbs. The use-by date was a full two years after we sampled it, which makes it a great pantry-friendly version of chicken bone broth.Photo by Alex LauKettle & Fire Chicken Bone Broth$8 at Kettle & Fire$52 at Amazon (Pack of 4)Brodo Beef Bone BrothChef Marco Canora started brodo out of the kitchen window of his NYC restaurant Hearth in 2014, and its 18-hour simmered broth is now frozen and shipped nationwide. We thought it had a “surprisingly clean, yet also very intense beef flavor.” There were some notes of “sweetness and brightness,” and it coats your palate in a very comforting way, like mom’s homemade soup. It has a lot of strong, beefy umami flavor, so it’s best sipped in small doses.Photo by Alex LauBrodo Beef Bone Broth$13 at Brodo$130 at Amazon (Pack of 10)Bare Bones Beef Bone BrothThis was a “very drinkable” bone broth that had a thinner texture than expected, but a “pleasant, well-rounded flavor” that we went back to for a few more sips. It was surprisingly shelf-stable with a use-by date 10 months from the date we purchased. Ingredients included beef bones, tomatoes, organic vegetables and herbs (onion, carrot, garlic, parsley, thyme), sea salt, bay leaves, and black pepper, and any flavoring was subtle and not overpowering.Photo by Alex LauBare Bones Beef Bone Broth$17 at Amazon (Pack of 2)$7 at HiveBonafide Provisions Beef Bone Broth“This broth has a very clean and light aroma—no trace of barnyard,” remarked one taster. It was a “definitely drinkable” broth but was a “little bland” and in need of some flavor enhancers. We noted this could be a good one to cook with, whether for soup, brothy beans, or a batch of quinoa.Photo by Alex LauBonafide Provisions Organic Beef Bone Broth$140 at Amazon (Pack of 12)$13 at Bonafide ProvisionsSwanson Chicken Bone BrothThis was our surprise late addition supermarket pick. Swanson had more body than we expected from a shelf-stable stock and a little bit of a spicy black pepper note. There’s a good chicken flavor that is a step above the bouillon-y taste you typically get from a mass-produced stock and an herby note that reminded us a little of Thanksgiving stuffing. We may not drink big mugs of this, but in a pinch, it’s the least expensive decent-tasting option you can find at almost every grocery store across the country, and it will last in the pantry for a year.Photo by Alex LauSwanson Chicken Bone BrothEditor’s note: We tested the organic version, which is no longer available. \n$4 at Target$57 at Amazon (Pack of 12)Explore Bon AppétitHealthyishShoppingRead MoreLifestyleWhat Is Collagen, the \"Beauty Food\" You're Seeing in Everything?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-05", "author": ["Condé Nast", "Alyse Whitney"]}