{"id": "4797215a2221be61e256fa1561d45459", "url": "https://www.bonappetit.com/story/nutritional-psychiatry", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "What Is Nutritional Psychiatry? For Starters, It's Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Nutritional Psychiatry? For Starters, It’s DeliciousHow to eat for a better mood, according to the experts.By Lisa RulandJune 9, 2021FacebookTwitterEmailPhotograph by Danny KimFacebookTwitterEmailIt had been a dark winter. Not early-sunset, cozy-sweater dark. I mean the black hole variety. I spent much of this December and January trapped in an emotional vortex, shuffling around in sweats (“athleisure” is too generous), crying at random, and snapping at my spouse. I baked cookies. I made pasta. Both helped, but only temporarily. In other words, I—like an outsize proportion of Americans—felt depressed.On a frigid, blank-skied afternoon in mid-February, I forced myself on a walk. When I passed the local library, I noticed a book, This Is Your Brain on Food, in the window. The book was all about the connection between food and mood, written by nutritional psychiatrist and trained chef Uma Naidoo, M.D., who directs the Department of Nutritional and Lifestyle Psychiatry at Massachusetts General Hospital and serves on the faculty at Harvard Medical School. I headed inside, stepped up to the plexiglass-encased librarian, and borrowed the book.In truth, the book confirmed what I already suspected: a carb-heavy diet was making me sad and sluggish. So, the next time I dragged myself to the supermarket, a wool beanie pulled low over my mess of hair, I filled my cart with color. I bought avocados, bright pink wild salmon, perky bunches of curly kale, walnuts, fat sweet potatoes, shiitake mushrooms, and fresh spinach. I splurged on seriously overpriced, out-of-season blackberries. I knew I’d make some good meals from my haul. But Dr. Naidoo had me thinking I might also find some happiness.Many people benefit from medication and talk therapy, the most common interventions for mental health conditions like depression and anxiety. But the emerging field of nutritional psychiatry I’d been studiously reading about utilizes food and diet to improve mood and mental well-being. Multiple medical studies show that food plays a critical role not just in physical health but in mental and emotional health too. Nutritional psychiatry leverages the connection between healthy food and healthy minds, and offers real—and appetizing—help.Meals like bright broiled salmon with super-garlicky spinach did make me feel noticeably better, physically and mentally. In my kitchen these days, lentils have replaced lasagna—and you’ll find more carrots than cookies. (Well, most of the time at least.) I’ve since returned my library book, but I know I’ll be bringing my new grocery lists into our post-pandemic world.If you’re thinking nutritional psychiatry might be for you, here’s what you need to know:First, what is nutritional psychiatry?Working from the premise that what we eat impacts our mood, nutritional psychiatrists, unlike regular psychiatrists, incorporate food into their overall treatment plans. Nutritional psychiatry leans on certain nutrient-packed foods—those filled with vitamins, minerals, antioxidants, fiber, pro- and prebiotics, and protein—while cutting way back on nutritionally “empty” foods (sorry, sugar). These adjustments are designed to reduce brain inflammation, better regulate serotonin and dopamine, and influence a host of other mood-boosting reactions.What does the brain have to do with our gut?The brain connects to the gut through the vagus nerve. This “wandering nerve” acts as a two-way highway, constantly sending signals and chemicals back and forth between the brain and gut. One of these chemicals is serotonin, our natural mood regulator. We produce over 90 percent of our body’s serotonin outside the brain, in the gut—precisely where our food is digested and broken down into vitamins, minerals, and other nutrients. This enables a natural symbiosis between food and the body’s brain chemistry.So, what should we eat to feel better?Good mental health depends on a well-nourished brain. Doctors offer several main guideposts for building a diet that supports a healthy mood. Bear in mind, though, that “well-nourished” does not mean “perfect.” So don’t stress about eating that juicy cheeseburger or occasional bowl of pasta.“We are human,” Dr. Naidoo says. “Instead of judging yourself if you have a piece of cake, enjoy it and move on. People should not get hung up on diet war rules like ‘you can never eat bread or a piece of cake,’ or whatever it is.” In other words, Pizza Fridays will not make or break your body’s microbiome—and should definitely not break your spirit. That said, here are some actions you can take to support a healthy food-mood connection.Limit sugar (including artificial sweeteners) and processed foods.Many processed foods combine “empty” calories with other chemicals and additives, like dyes, preservatives, fillers, and sugary ingredients that can cause inflammation, which “makes our brain depressed, anxious, and unfocused,” says Drew Ramsey, M.D., a practicing clinical psychiatrist, professor, author, and nutritional psychiatry expert. “That’s pretty clear at this point.”A gut microbiome fed by sugar craves more sugar. Sugar causes inflammation and is linked to lower levels of BDNF, a protein that helps our brain adapt to stress. Artificial sweeteners like aspartame and saccharin are on the no-go list, too, due to potentially toxic effects on mood-regulating neurotransmitters and brain chemical synthesis. I’m sad to say that simple carbohydrates, like white rice and pasta, fall into the sugar category; they break down quickly into glucose (sugar) in the body. Much of their nutritional value, like fiber and vitamins, has been removed as well.Add lots of colorful vegetables, legumes, and leafy greens.You might already know the old adage: “Eat the rainbow.” Replace unhelpful inflammatory or nutritionally neutral foods with dark chocolate, bell peppers, citrus, berries, leafy greens, lentils, asparagus, broccoli, berries—you get the idea. These foods contain microbiome-healthy fiber and mood-boosting vitamins and minerals, like iron, folate, magnesium, zinc, and the A and B vitamins.Incorporate probiotics.Our digestive tract is home to around 100 trillion bacteria and microorganisms, which play a major role in our health. Eating active cultures helps crowd out unhealthy microorganisms and increases the healthy flora in our microbiome, which improves mood and our overall health. Foods like kefir, yogurt with no added sugar, kimchi, sauerkraut, miso, tempeh, and buttermilk all contain important, gut-healthy bacteria. Probiotics are best supported by prebiotics: foods like oats, alliums, garlic, apples, and beans.Take advantage of omega-3s, limit saturated fats, and opt for lean protein.Fish like sardines, salmon, tuna, and mackerel are loaded with omega-3 fatty acids, which reduce inflammation in the brain, and can be a great source of vitamin D. Avocados and olive oil help round out the roster of nutritionally-rich fats. Lean beef, shellfish, and poultry are rich in iron, a mood booster. Grass-fed beef, chia seeds, and nuts also contain omega-3s. In fact, “nuts are a perfect mix of carbohydrates, protein, fiber, and fat,” Dr. Ramsey says.Nutritional psychiatrists also recommend limiting saturated fats, like shortening and margarine, and eliminating trans fats altogether. Cut back on alcohol and caffeine.Both play a role in anxiety, Dr. Naidoo writes in This Is Your Brain on Food. “People who are anxious sleep more poorly if they drink alcohol regularly,” despite the fact that “drinking may make them relax in the moment.” This means no more than one drink per day for women and two per day for men.Caffeine, despite that morning perk-up, overstimulates the brain’s threat-processing region and lessens function in the area that helps regulate anxiety. Instead of ditching your brew altogether, cut back and try incorporating calming chamomile or turmeric tea into your beverage roster. Also, make sure to drink plenty of water: around four to six glasses a day, more if you’re sweating and exercising.How does food complement other mental health treatments?Nutritional psychiatrists integrate food into broader treatment plans, which may include medication, talk therapy, acupuncture, yoga, exercise, and the like. “It’s really about putting all those pieces together,” Dr. Naidoo says. In other words, food helps, but it should not be viewed as a silver bullet.“If someone’s saying that celery juice can cure depression, that’s not helpful,” agrees Dr. Ramsey, who has seen numerous patients harmed because they thought their very restrictive diet was going to heal them. “That said, I think that every physician and psychiatrist in America agrees that it would be better if our patients ate really healthy, unprocessed food. Not that this will cure all mental illness, but this certainly helps improve brain health and mitigate symptoms.”Explore Bon AppétitHealthyishSelf CareHealthyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-09", "author": ["Condé Nast", "Lisa Ruland"]}