{"id": "47ac7f386c0eeaa731f125759f0c0b3c", "url": "https://www.bonappetit.com/story/canned-beans-weeknight-pasta", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "The Secret Ingredient Your Weeknight Pasta Is Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret Ingredient Your Weeknight Pasta Is MissingEditor in chief Adam Rapoport uses this pantry staple for a creamy wannabe bolognese on a Monday night.By Adam RapoportJanuary 15, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.You should put beans in your pastaIt was so cold on the East Coast last week that I told myself I could eat whatever I want. Like a furnace, in sub-30° temperatures, I would just burn it off. (That’s how it how works, right?)I wanted my pork and beans pasta.Ever since I happened upon this dish a year ago, I keep coming back to it. Partly because it’s so damn easy. I swing by the market after work and grab two Italian sausages, a jar of cannellini beans (though, any canned white beans would do), and a bottle of puréed tomatoes.Want this letter before it hits the website? Sign up for our newsletter!I make the sauce in one big sauté pan, in not much time at all. First, I remove the sausages from their casings and brown the meat in some olive oil. Then in goes some smashed garlic, till gently browned. And then the beans.Do you ever add beans to your pasta? You should try it. Canned or cooked from dried, they lend a creamy richness to your sauce that’s deeply satisfying.After the beans and sausage and garlic have had a chance to hang out for a while and come to temperature, I hit the mixture with a splash of puréed tomatoes. Thanks to the creamy beans, the sauce turns an alluring pink, more vodka sauce than tomato sauce.Finally, in goes a ladle of pasta water and a knob of butter. When the sauce is at a full simmer, I add the al dente pasta (about 8 oz., aka half a standard box or bag). Toss and toss, and finish with some grated Parm.Photo by Alex LauWhen I’m in the mood for a “healthier” version of this pasta (liberal use of air quotes here), I’ll make Basically’s rigatoni with sausage, beans, and greens. Same technique, but I skip the tomato purée and throw in a large bunch of nutrient-rich kale, which gets all wilty and glossy and gorgeous.If you make either of these pastas—and I highly suggest you do—you’ll realize that beans, even pantry-friendly canned ones, absolutely belong in your pasta arsenal. No matter the weather outside.Get the recipes:Pork and Beans PastaRigatoni with Sausage, Beans, and GreensExplore Bon AppétitAdam NewsletterWeeknightPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-15", "author": ["Condé Nast", "Adam Rapoport"]}