{"id": "47b7e0dfd881f36a28ddffa6cbdbe170", "url": "https://www.bonappetit.com/recipe/rum-soaked-fruit-sundaes", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Rum-Soaked Fruit and Coconut Crisp Sundaes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueRum-Soaked Fruit and Coconut Crisp SundaesBy Chrissy TraceyMay 25, 20214.1(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintRum-soaked fruit is a staple of so many desserts from Jamaica, my homeland—from pineapple cake to rum cake to spiced bun. Typically the fruits used are dried, and the soaking process long, but ripe, in-season berries only need a few minutes to mingle with booze and sugar before they become something dazzling: a syrupy topping for a not-so-typical summer sundae that allows me to escape to the tropics, even for a few moments. You can also serve this boozy no-cook sauce on top of cornmeal pancakes or French toast, alongside hot buttered biscuits, or over slices of pound cake. Or add a teaspoon to sparkling wine for an easy brunch cocktail. —Chrissy TraceyRelated: The Case for Quitting Meat with Sarah Jampel and Chrissy TraceyContentThis content can also be viewed on the site it originates from.This recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Rimmed Baking Sheet$28 At AmazonMedium #40 Cookie Scoop$16 At AmazonMedium Bowl$17 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 ServingsBerries1lb. strawberries, hulled, quartered12oz. raspberries⅓cup raw sugar¼cup spiced rum, orange liqueur, or fresh orange juiceKosher saltCoconut Crunch1cup unsweetened coconut flakes½cup sliced almonds1Tbsp. pure maple syrupKosher saltAssembly2pints vegan or dairy vanilla ice creamVegan or dairy whipped cream (for serving)PreparationBerriesStep 1Toss strawberries, raspberries, raw sugar, rum, and a pinch of salt in a medium bowl, mashing some of the berries with a spoon. Let sit until fruit is partially softened, about 10 minutes.Coconut CrunchStep 2Preheat oven to 325°. Toss coconut flakes, almonds, maple syrup, and a pinch of salt on a small rimmed baking sheet to combine. Toast, stirring once or twice, until golden brown and crisp, 8–10 minutes. Let cool, stirring every minute or so to prevent sticking, 5 minutes.AssemblyStep 3Scoop ice cream into small bowls. Top with berries, followed by whipped cream and coconut crunch.How would you rate Rum-Soaked Fruit and Coconut Crisp Sundaes?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleFantastic! Can’t wait to make this again. Erik Ofgang Bethel, ct 6/3/2021Those berries were so delicious!Anonymous6/3/2021Explore Bon AppétitFruit DessertDessertSundaeFrozen DessertJamaicanCaribbeanStrawberryBerryFruitRaspberryRumAlcohol & Other DrinksCoconutSummerEasyGluten-FreeVeganDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Chrissy Tracey"]}