{"id": "47bfeacff75f480c684c02087920b2e7", "url": "https://www.bonappetit.com/story/frozen-spinach", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Frozen Spinach Is Always In My Freezer For Quick Weeknight Meals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFrozen Spinach Is My Weeknight Flotation DeviceI breathe deeply knowing it's in the freezer, right near the ice cream. By Emma WartzmanNovember 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailOh, the frozen food aisle, keeper of conveniences. I find myself there often, snatching up dumplings for dinner emergencies, ice cream for emotional emergencies, and frozen spinach. Yep, that’s right: One of the frozen foods we endorse here at Basically is spinach. Don’t get us wrong, we still like its fresh counterpart for some things, but sometimes frozen is, in fact, better.Frozen spinach can be subbed in pretty much any place you’d normally be cooking raw spinach. And since raw spinach is watery, you’ll probably need to cook it down anyway—otherwise, it’ll release its water and change the texture and flavor of your finished dish. Since frozen spinach is blanched (that is, boiled briefly in very hot water and then submerged in cold water to stop the cooking and retain the color) before it’s packaged, it's like a shortcut.Frozen spinach is also space efficient (have you ever tried to cram two pounds of the fresh stuff into your fridge?) and it lasts for months. Whether you’re whipping up a dip for last-minute guests or you want something nutritious (that is, green) to add to your omelette, frozen spinach is there for you.Okay, so you’re convinced. You're practically Popeye! But now you need to know how to use frozen spinach. The cooking instructions on the back of the package can be misleading, asking you to re-boil or microwave the greens for an inordinate amount of time. And if the greens are already cooked, do you need to thaw them at all?In the case of soup, no. A little extra water never hurt a broth. But when it comes to pretty much everything else—be it eggs, quesadillas, or skillet pizza—moisture is the enemy, so you’re going to want to let the spinach thaw. Then grab it by the fistful, squeeze out all the water (it helps if you wrap it in a kitchen towel), and add it in.Even with the extra step of thawing, nothing beats delicious greens at arms reach. Just make sure you leave room for the ice cream you’ll inevitably grab when you’re in the freezer section.Get the recipe:Spinach and Feta Tarte SoleilThe most impressive appetizer to “casually” pull out of the oven when your friends come over (and it also happens to make a nice Thanksgiving snack for while the turkey rests—just sayin').View RecipeExplore Bon AppétitSpinachRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Emma Wartzman"]}