{"id": "47e8ec1a3d4c64dbaa2f996278c677f5", "url": "https://www.bonappetit.com/story/apeel-natural-barrier", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "This Apeel Invisible Peel Will Save Good Avocados from Going Bad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Invisible Peel Will Save Good Avocados from Going BadWhen it comes to preserving your produce, Apeel has figured out a way to one-up Mother Nature.By Dawn DavisMay 18, 2021FacebookTwitterEmailPhotograph by Heami Lee FacebookTwitterEmail“There are solutions that will save everybody.” The message, painted a robin’s-egg blue and outlined in red, is scrawled across the wall of the makers lab of a school I’m touring with my son. I don’t hear another word the guide says. I’m too mesmerized by hope, the idea that the various messes in which we find ourselves are not the endgame. For an afternoon, a week, a month, I’m an island of optimism. Of course, it doesn’t last. Bad news pierces the bubble. The most recent decade saw more greenhouse gas emissions than the one before; the curve is going in the wrong direction. But I return again and again to this notion: There are solutions that will save everybody.James Rogers, founder of the produce preservation company Apeel, must believe it too. He didn’t have a makers’ lab when he was in school, but weekend trips to the local hardware store were enough to fire his imagination. At first, his visions centered on the democratization of clean energy, but then one day, driving past some particularly lush farmland, he thought about the magnitude of food waste and how hard it is for “growers to optimize their harvest practices, so that produce can stay on the vine longer in order to reach full nutritional and flavor potential,” as he puts it now.It was then that he had his lightbulb moment: Nature had it right, it was just a bit parsimonious. The idea is one you’ll be familiar with if you’ve peeled citrus, sliced open a perfectly green avocado, or shaved the tough part off a stalk of asparagus. If so, you’ve observed how skins naturally preserve fruits and vegetables. The problem is that for most produce, the protective layer doesn’t last long enough for the way we live now. Take English cucumbers, for example. You buy a couple on your weekly trip to the grocery store and if you don’t use them by the end of the week, they’re so mushy you have to toss them.Rogers didn’t come at this problem from the perspective of a frustrated home cook but rather as a scientist. “What causes produce to go bad? Water going out and oxygen going in,” he explains. Thinking back to his undergraduate days at Carnegie Mellon University, where he learned about how steel reacts to oxygen in the air and rusts, he recalled how elements like chromium or nickel can form an oxide barrier that physically protects the steel from further oxidation. “I thought if food goes bad in the same way, could we put a little barrier around it that would slow down perishability? And could that help put a dent in the hunger problem?”What if we could make this barrier out of food? Then we’d be using food to preserve food, and that would be something worth building.Of course, nobody wants chemicals on their food, but at the same time, Rogers says, “water is a chemical. Food is a chemical. Wait a minute—everything we eat is a chemical! So what if we could make this barrier out of food? Then we’d be using food to preserve food, and that would be something worth building.”Apeel’s technology uses plant-derived materials to make a tasteless, odorless, invisible “peel” that is then applied directly to produce including limes, avocados, mandarin oranges, and apples. This extra skin keeps moisture in and oxygen out, delaying the time it takes for the produce to go bad. The proof is undeniable: An apple treated with Apeel will stay fresh two to three times longer than one that hasn’t been treated. It also works on cucumbers, a win not only for retailers and chefs, but for anyone looking to decrease plastic usage. According to Rogers, treating English cucumbers with Apeel’s technology rather than plastic wrap saves the equivalent of 85 million straws.All of this is a boon for consumers and for grocery stores, which have to throw away 43 billion pounds of food each year. According to its own internal research, Apeel has saved over 5 million avocados at grocery stores from going to waste since 2018, which in turn has saved enough water to fill 427 Olympic-size swimming pools.As for consumers, Apeel offers a minimal-effort way to reduce food waste—and financial waste too. Imagine one of those nights when you’re all set to go home and make dinner with the fresh produce that’s been languishing in your crisper drawer (I highly recommend Fat Choy’s Smashed Cucumber Salad). But then a friend spontaneously snags a reservation at an in-demand restaurant. If you’ve got Apeel veggies in your fridge, you can go out to dinner without worrying about them going bad.Of course, Apeel isn’t operating in a vacuum. There are other forward-looking companies addressing the staggering amount of food wasted in the U.S., which is estimated to be as high as 40 percent of the food supply. Biodegradable coffee pods, reusable silicone storage bags, sustainable alternatives to deforestation-causing palm oil. Other tinkerers, other visionaries. One might not yet be 14, on her own tour of a makers lab, her imagination ready to be set afire. Ready to come up with new solutions that just might save everybody.Explore Bon AppétitHealthyishTechnologyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-18", "author": ["Condé Nast", "Dawn Davis"]}