{"id": "47f65a1384d8b5eae19292aa7fbfcdd1", "url": "https://www.bonappetit.com/story/make-an-elaborate-sandwich", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Make Yourself an Elaborate Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMake Yourself an Elaborate SandwichIf it fits between two slices of bread, it belongs in a sandwich.By Christina ChaeySeptember 5, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,I came back from my most recent trip to the farmers market with a LOT of good bread, which is a very me thing to do (I also obviously left with almost more vegetables than I could safely transport home via bike). It was my first visit to the incredible Lost Bread Co. stall in a while, so I went a little nuts, leaving with a few canelés, a big slab of whole grain focaccia studded with green olives, and a bag of milk bread buns that were tall and round, burnished on the outside with fluffy middles, and covered in sesame seeds. Those buns were, in short, the perfect bread for an elaborate sandwich or two (yes, there is a pic below).The best way to define an elaborate sandwich is to start by explaining what it is not: PB&J. Tomato. Tuna salad. The turkey sandwich I grew up eating every day of my life (shout out to my mom <3). No shade to the legends, but on the rare occasions when I crave a homemade sandwich, I pull out all the stops. The more layers required (a flavored mayo, a quick pickle, a roasted vegetable element), the more likely I am to go for it.At the same time, I’m not trying to spend half a day making a sandwich. So when the craving strikes, I rely on some tried-and-true shortcuts to keep my kitchen time minimal. I always try to build a sandwich using a couple of existing building blocks, a.k.a. leftovers. Any roasted veg (like cauliflower or sweet potato) is immediately fair game. Same goes for any leftover exciting sauce, like a tonnato or salsa verde from last night’s dinner. The quick pickles I wrote about last week will add crunch and tang to virtually anything between two slices of bread, and they keep in the fridge for months.A meat-free banh-mi-inspired lunch: seared tofu, pickled vegetables, mayo, Sriracha\nPhoto by Christina Chaey The quickest shortcut I know is to start with good bread whenever possible. When your foundation is high quality, it’s easier to bring disparate components together in a way that makes sense. Tuck a slice of cold leftover frittata or tortilla española into a roll with mayo mixed with chopped olives, capers, a squeeze of lemon, and a handful of parsley. Schmear salsa verde on two slices of whole grain and pile it high with every green thing you’ve got (sliced avocado, arugula or spinach, cucumbers, romaine, herbs) along with a fat slice of mozzarella. Smash leftover chickpeas with chopped hot pickles, celery, and a scoop of mayo, and tuck into a pita with diced cucumbers and tomatoes.You get the point here: If it fits between two slices of bread, it’s a sandwich. And you likely already have everything you need to make a great one. Stay tuned for a future installment of Tales of the Sandwich™, at which point I will probably be dry-brining, oven-roasting, and slicing my own turkey breast (please send help).Until next week,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreLifestyleHow I’m Making Summer Last ForeverBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-05", "author": ["Condé Nast", "Christina Chaey"]}