{"id": "47f9aff1cbffce4aa01f67986c7b6b27", "url": "https://www.bonappetit.com/story/partake-boxed-brownies", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "I Never Thought I'd Recommend a Vegan Brownie Mix—But Here We Are | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Blondie And Brownie Mixes Are Really Good—And, Oh Yeah, Vegan and Gluten-FreePartake’s dairy- and gluten-free baked goods made me a boxed mix convert.By Sarah JampelDecember 30, 2021FacebookTwitterEmailPhotograph by Emma Fishman. Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. Up next, Sarah Jampel writes of her love for Partake gluten-free and vegan brownie mix.Once upon a time I baked whatever I wanted, whenever I wanted. I made cinnamon buns on a weeknight, muffins at 5 a.m., and croissants over a long weekend, and life was good. Then I had a baby. Life is still good, but I have less time; I have to be super quiet for multiple hours of the day (she’s particular about her nap environment); and—here’s the real kicker—I’m off dairy, eggs, and soy (the baby, she is sensitive!).When I added all these new limitations to my general baseline-level exhaustion, my desire to bake took a sharp plummet. My desire to eat desserts, however, remained constant (or, if anything, increased). My challenge now is to find vegan- and soy-free sweets I can bake while the baby is distracted by (the tag of) her latest stuffed animal—about 10 minutes.Happily, I found the answer in the blondie and brownie mixes from Partake, which are free of the top eight allergens and therefore ideal for accommodating as many eaters as possible at potlucks, bake sales, or school events. They’re also made from ingredients us laypeople can pronounce, and all you need to bake is one bowl, a neutral oil, five minutes, and a square baking pan.Partake Blondie Mix$8 $7 at Thrive Market$24 at Partake (3-Pack)And—because none of my preamble would matter if this were not the case—they taste good. Like so good that my parents, when served the brownies at my apartment, did not even think to ask if they came from a mix before taking half home for their own consumption.The vegan brownie mix produces chocolaty squares that are gooey, rich, and decadent, but I might even prefer the blondies, which lie somewhere between chewy and cakey, with a toasty caramel flavor that reminds me of graham crackers. I cut either tray into two-bite pieces and stash them in the fridge or freezer, where they solidify into fudgy morsels. Because I can’t help but fuss, I’ve zhuzhed up both mixes with extra chopped chocolate and a final flourish of flaky salt; they would take well to similar additions, like ground cinnamon, chopped-up peppermint patties, crystallized ginger, toffee bits, or blobs of jam.Partake Brownie Mix$8 $7 at Thrive Market$24 at Partake (3-Pack)I’ll return, sprinting, to soy, dairy, and eggs when the doctor gives the okay. But that won’t stop me from keeping my pantry stocked with Partake vegan brownie and blondie mixes for when the need for something sweet and delicious suddenly strikes.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-30", "author": ["Condé Nast", "Sarah Jampel"]}