{"id": "480141b73a2d54ed9e847baa75acea31", "url": "https://www.bonappetit.com/story/when-cooking-is-a-compulsion", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "When Cooking Is a Compulsion | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen Cooking Is a CompulsionReading recommendations, Instagram obsessions, and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroFebruary 7, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,You probably already know about COOK90, Epicurious digital director David Tamarkin's personal-challenge-turned-cookbook. But I bet you didn't know the full story of why he started cooking every day back in January 2016. Well, this is the story. Tamarkin writes about using cooking to face his obsessive compulsive disorder with more honesty and humor than I could ever muster, and I love every line of it.Also on Healthyish This WeekSarah Jampel looks into what happens when you halve the sugar in your favorite chocolate chip cookie recipe. Spoiler: No one can tell. And Lauren Schaefer developed a recipe that makes us actually want to eat tiny pieces of cauliflower like we're eating rice. Confession: I still don't totally understand what makes something a pilaf, but I love this cauli rice pilaf recipe all the same.What I'm Watching, Reading & Listening ToNew seasons of Broad City and High Maintenance: How did we get so lucky?! Esther Perel's Mating in Captivity, which I'd been meaning to read ever since I devoured her couples-therapy podcast, \"Where Should We Begin?\" Layla Saad's Me and White Supremacy handbook. And, when I had insomnia last weekend, this high-school dance documentary was everything I could've possibly wanted at 2 a.m.NYC says buh-bye to CBD (in your food, at least). This article on how protein bars became America's favorite snack food made me check my snack drawer and, yup, it's full of protein bars. Also sports drinks are kind of pointless. Ban these songs from your restaurant's playlist.Who I'm FollowingMennlay Golokeh Aggrey, author of The Art of Weed Butter, Melissa A. Fabello, Human Sexuality PhD and all-around smart person, Evette Dionne, Editor in Chief of Bitch Media, and The Fly, because I cannot wait for this new chicken-centric spot from the Hart's/Cervo's crew to open.What I'm CookingThis weekend, I kinda, sorta meal-prepped! That involved steamed sweet potatoes, marinated lentils, and some marinated beets, which I turned into various salad-y lunch bowls. For dinners, chicken and rice soup, coconut chicken, and a big pot of freaky greens. On for tonight: Ramen with Miso Pesto, and—if the gluten gods are willing—a loaf of Sourdough No-Knead bread.Send me good vibes,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyish NewsletterHealthyishessayRead MoreLifestyleCooking Every Day Was a Compulsion. Then It Was My Cure.By David TamarkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-07", "author": ["Condé Nast", "Amanda Shapiro"]}