{"id": "481682ca279eb61dd6b5eaa026386e53", "url": "https://www.bonappetit.com/story/massaging-kale", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "What's the Deal with \"Massaging\" Kale? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's the Deal with Massaging Kale?In some cases, massaging kale is an important step on the road to kale salad perfection. But when do you need to do it, and when do you not?By Alex DelanyJanuary 2, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailHot stones. Pleasant scents. Wooden rollers. Deep breaths. Getting that stupid knot out of your shoulder. A massage sounds nice. Massaging kale? That sounds kind of…weird. What’s the deal with massaging kale anyway? Why do we do it?Great questions. Glad to see you’re so interested in the field of leafy green education. Of all the greens we like to consume, kale is definitely the most stubborn. Not in its opinions on politics or nineties sit coms. We’re talking about its texture. Regardless of variety, raw kale is kind of tough, which is why we love cooking it—it holds its own and maintains integrity even in long-cooked soups, stews, and braises. But we also love eating it raw in salads, which is where that massaging process comes in. Working those greens with your hands a bit takes the edge off, and renders them tender enough to eat without cooking. You don't always have to do it—more on that later—but if you're going to, here's how to do it.No stems, no problems.\nLet’s start with the stems. And by start, we mean throw them the hell out. Kale stems are tough and fibrous. We don’t need that. You can slice them out with a knife or rip them out by running you fingers along either side of the stem. It’s less precise, but it works.Now, we massage. Hit those leaves with a pinch of salt and a squeeze of lemon or a splash of vinegar, and then start crunching them between your hands. The trick here is not to over-massage. You know what’s worse than tough kale? Mushy kale. Over-massaged kale loses that texture we love so much. Rub the kale leaves together between your fingers, until they just start to wilt. The way to tell if you’ve hit the right point, as it is with most things, is to taste. You want to massage the leaves to the point where it you can feel a crisp and resistance in the bite, but aren’t struggling to tear away or chew. It should feel more crispy than rubbery.If you're shredding your kale, like in our Winter Crunch Salad, you don't need to massage it.\nPhoto by Heidi's Bridge, styling by Molly BazSo when do you need to massage kale, and when should you not? By and large, we only massage kale for salad when we're working with big, leafy pieces, for a salad we're planning on serving immediately. If the kale is getting shredded into thin pieces or chopped to bits, you don't need to work it over before serving it raw—whatever dressing and tossing you're doing already should render it tender enough. Also, if you're going to dress a salad well ahead of time and let it hang out in the fridge, massaging isn't necessary. Acids like citrus juice and vinegar break down the cellulose in kale in the same way that massaging it does. That means that if you aren’t serving your salad immediately after dressing it, you shouldn’t massage it. Just let it hang out in a bowl with the dressing. And if you're working with tender baby kale, the kind you find packed in plastic tubs with the salad greens, you definitely don't need to massage it—that stuff is delicate enough to eat on its own, and massaging it will just wilt it in a gross way.You need to love your kale before it loves you. Or you love it? Or you love yourself? Whatever. Just give the stuff a massage if it needs it, OK?Winter Crunch Salad time is now, no massaging necessary:Explore Bon AppétitBasicallySaladKaleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Alex Delany"]}