{"id": "48186918b271b72c1abcfef71cd70436", "url": "https://www.bonappetit.com/recipe/whole-fish-ssam", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "Whole Fish Ssam Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWhole Fish SsamBy Sohla El-WayllySeptember 21, 20204.7(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown, Small Bowls by Meilen CeramicsEmailPinterestPrintEmailPinterestPrintIn Korean, ssam literally means “wrapped”—set the fish in the center of the table and pull the meat off the bones, using chopsticks to fill lettuce wraps along with radish salad, ssamjang, kimchi, and rice. Roasting a whole fish—skin, bones, and all—is surprisingly easy, and the flesh stays moist and flavorful even if you overcook it a touch. Preheat your baking sheet for extra insurance against sticking and to keep the sesame seed crust clinging tightly to the crisp skin.Ingredients2-3 servings3Tbsp. vegetable oil, divided1large egg whiteKosher salt12½–3-lb. head-on whole white fish (such as branzino, snapper, or fluke), cleaned8scallions, thinly sliced on a diagonal, divided5garlic cloves, 4 thinly sliced, 1 whole2serrano chiles, thinly sliced, divided4Tbsp. plus 2 tsp. sesame seeds¼cup doenjang (Korean soybean paste)2Tbsp. gochujang (Korean hot pepper paste)1Tbsp. honey2Tbsp. unseasoned rice vinegar1bunch radishes, trimmed, halvedKimchi, cooked white rice, and lettuce (for serving)PreparationStep 1Line a rimmed baking sheet with parchment paper and coat evenly with 1 Tbsp. oil. Place rack in middle and top third of oven and set baking sheet on middle rack. Preheat oven to 375°.Step 2Whisk egg white, a pinch of salt, and 1 tsp. water in a small bowl until frothy. Pat fish dry inside and out with paper towels. Season fish all over, including cavity, with salt. Stuff cavity with one fourth of scallions, half of sliced garlic, and half of chiles.Step 3Place fish on a large plate or another rimmed baking sheet, brush with egg white mixture, and sprinkle with 2 Tbsp. sesame seeds, patting gently to adhere. Turn over and repeat on opposite side, with egg white and another 2 Tbsp. sesame seeds. Transfer fish to preheated baking sheet, drizzle with 1 Tbsp. oil, and season with more salt. Bake until mostly cooked through and the tip of a paring knife easily slides through flesh, 20–25 minutes.Step 4Meanwhile, toast remaining 2 tsp. sesame seeds in a small skillet over medium-high heat until golden and fragrant, about 4 minutes. Transfer to a medium bowl and add doenjang, gochujang, honey, and remaining 1 Tbsp. oil. Finely grate in 1 garlic clove and whisk to combine. (This is your ssamjang.)Step 5Whisk vinegar and 2 Tbsp. ssamjang in a large bowl. Add radishes and remaining sliced scallions, garlic, and chiles. Toss to combine.Step 6Remove fish from oven; heat broiler. Broil fish on top rack until sesame seeds are golden, about 4 minutes. Remove fish from oven and gently turn over by sliding fish to one side of baking sheet and using parchment and a fish spatula to turn it. Season other side of fish with more salt and broil until sesame seeds are golden, about 3 minutes. Transfer fish to a platter and serve with ssamjang, radish salad, kimchi, cooked rice, and lettuce for making wraps.How would you rate Whole Fish Ssam?Leave a ReviewTell us what you thinkReviews (2)Back to TopTrianglethis recipe looks great and also very original and unusual, and it also seems quite simple to prepare.\nI love the idea of guests sharing it and sandwiching it in lettuce and rice and salad and condiments Rivka MisoudaIsrael1/8/2022Sucks that Sohla probably didn't get paid for this but a great recipe nevertheless. Made this exactly as specified except I brushed the ssamjang back on the fish for the broiling part because I didn't want sauce on the side and it came out almost perfectly. I forgot to oil the parchment paper so the skin stuck as I flipped it but after I covered that side up with the ssamjang so no one was any the wiser.AnonymousMy house1/12/2021Explore Bon AppétitKoreanEast AsianAsianFishSeafoodScallionOnionVegetableBranzinoSnapperMainHealthyishRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-21", "author": ["Condé Nast", "Sohla El-Waylly"]}