{"id": "481ff6c7813dd3b4a7f81871732c96e7", "url": "https://www.bonappetit.com/story/hubigs-pies-new-orleans-fire", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Hubig's Pies: The New Orleans Bakery That Might Never Return | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHere's to Hubig's: The New Orleans Bakery That Might Never ReturnHubig's Pies survived the Great Depression and Hurricane Katrina, but after a fire in 2012, it's become a part of New Orleans lore. Writer and illustrator Sophie Lucido Johnson remembers her first—and last—Hubig's pie.By Sophie Lucido JohnsonJanuary 23, 2018FacebookTwitterEmailIllustration by Sophie Lucido JohnsonFacebookTwitterEmailIn high school, in Portland, my best friend and I skipped school a lot to go to the market and buy hand pies. The grocery store brand were two for a dollar. If you’re picturing something quaint, like you’d find in a small-town bakery, you couldn’t be further off: These were starchy white pockets of pure chemical. The wrappers had colorful pictures of blackberries or cherries on them, but one bite into the factory-nondescript crust and all assumptions of real fruit vanished. Each pie contained a layer of bright goo that barely moved when shaken.That was the year I decided that pie was my number one favorite food. I may have been a little embarrassed to be more specific, but I will reiterate to you now: I longed for deep fried hand pies from the grocery store.I went to college in Washington State, and when I finished, I decided to move to New Orleans to be a special education teacher. This was two years after Hurricane Katrina, and I had this naïve sense that it was my civic duty to go.I didn’t really want to move. I felt I was supposed to.For my birthday, just before I took off for New Orleans, my boyfriend at the time gave me the perfect present to quell my discomfort about moving:There was a detail in the guide book about pie. The most famous pies in New Orleans were from Hubig’s, but they used lard in their crusts, so, my boyfriend was sorry to say, I couldn’t eat them. (See above, about being a vegan.) But these were deep fried hand pies—my all-time number one favorite food.New Orleans wasn’t, in general, a great place to be a vegan. I never ate out; I learned to buy vegetables on Sundays and make all my meals a week in advance.Hubig’s Pies were wrapped in the greasy white paper, and they had this little man on the front who was as earnest as a mascot could be. He balanced an inexplicably full-sized pie on one hand; the other hand seemed to be beckoning you to eat the pie. It felt almost rude to keep refusing him. His name, I learned later, was Savory Simon. It’s a misleading name, because Hubig’s has never made any savory pies.Simon Hubig opened the first Hubig’s Pie storefront in Texas in 1922, and did pretty well for himself—ultimately owning nine bakeries throughout the South. The New Orleans location also opened in 1922, and it was the only one that survived the Great Depression.The first time I happened to walk past this bakery was the same day that the boyfriend who’d made the Guide to New Orleans dumped me. I strolled along Dauphine Street, openly sobbing. I was headed to a friend’s house to be comforted; New Orleans is small enough that everywhere is conceivably walkable from everywhere else.\nThat day, I hated everything about the city.The first thing I didn’t hate all day was the smell wafting from 2417 Dauphine Street.I saw the blue-and-red Hubig’s Pie sign first, and then a Hubig’s Pie delivery truck. There wasn’t a way to get into the bakery; it must have been like the white bread factories in Oregon where you could watch the loaves going into the plastic sleeves from big glass windows, but you couldn’t buy actual bread. I walked a few blocks to a gas station food mart looking for a Hubig’s. They only had pineapple.Hubig’s Pies spokesmen said they continued to use the original 1920s recipe—a hot water dough made with flour, salt, and beef lard; fruit filling sweetened with cane sugar and thickened with starch; and then all of that was deep fried and coated in sugar icing. The wrapper I still have also lists sodium metabisulfite, sodium propionate, and sorbic acid (all preservatives that didn’t really exist in the 1920s) as ingredients. The resulting pie tasted wonderfully bad for you; the crust chunked off and the “fruit\" inside was a glossy gel. The lard left an oily film on the roof of my mouth.From that day on, I secretly ate a Hubig’s pie whenever I had a shitty day. I ate a lot of them. I didn’t want to face the wrath of my vegan friends, so I never told anyone. I was having an affair, and it all seemed like it would be fine, so long as no one got hurt.I had been wrong about New Orleans, by the way. For one thing, white out-of-towners like me (and including me) typically did more harm than good to the community. We gentrified neighborhoods where families had lived for generations, and we imposed our values without seeking the input of local New Orleanians. Despite the fact that my motives had been damagingly ignorant, people in New Orleans showed me nothing but kindness and warmth. Neighbors sat for hours chatting on the porch, telling me stories about their lives. There were parades in the streets literally every week. The people of the city belonged to each other; they cared for each other; and they celebrated each other.And Hubig’s Pies seemed, too, to belong solely to the New Orleans community. Tourists gobbled up beignets and king cakes, but no one who ever came from out of town to visit asked to eat a Hubig’s pie.Hubig’s had re-opened just four months after Hurricane Katrina—the city was so relieved to have their fried pies back that the New York Times wrote an article about it. I liked Hubig’s because they made fried hand pies; I loved Hubig’s because I’d fallen in love with New Orleans.On July 27, 2012, I had three Hubig’s apple pies hidden in the bottom drawer of my desk—you know, for emergencies. I woke up that morning at 4:45 a.m., which was normal for public school teachers in the New Orleans, where the school day often started at 7:00. It was the first week of school. By the time I got there, the hallways were already buzzing with the news:Here’s what we know about this fire:And a year later, Ramsey told NPR that Hubig’s would be back. The people of New Orleans bought Savory Simon merchandise en masse to support rebuilding efforts.But in 2015, the New Orleans Advocate announced that disagreements between the owners had stagnated things, and five years after the fire, it doesn’t look like Hubig’s will return. I tried to get in touch with someone from Hubig’s, or with anyone who knew anyone from Hubig’s, to no avail. Their official website is down. Their Facebook page hasn’t been updated since 2013.On July 27, 2012, when I got back from school, I opened the bottom drawer of my desk to double-check that I still had my pies—And then immediately, I had no idea what I was supposed to do with them.I gave him two of my pies.The third I ate on Sunday night, with the solemnity of a person at a normal, non-jazz funeral. I taped the wrapper into the back of my diary.In 2016, I left New Orleans. I visit a few times a year; it seems that another bakery, Haydel’s, has started manufacturing fried hand pies. The ingredients are basically the same, but the packaging is much less charming.I bought one to take back to Chicago. I put it in my suitcase, and when I got home, I put it in the fridge. A week later, I knew I’d never eat it. It was one thing to cheat on my veganism with Hubig’s; it was quite another to cheat on Hubig’s. I threw the pie away.Sophie Lucido Johnson is a writer and artist in Chicago; her illustrated memoir, Many Love, will be out in June 2018.Explore Bon AppétitNew OrleansPieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Sophie Lucido Johnson"]}