{"id": "482489c12e6c537e624b8ca478e1bb57", "url": "https://www.bonappetit.com/story/fideos", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Fideo Noodles - How to Cook, Use, and Eat Fideos  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLong Noodles Are Great, But Have You Tried Fideos? They're small but mighty—and you don't even need to boil them. By Jesse SparksNovember 18, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl Jones FacebookTwitterEmailRamen. Soba. Rice. Spaghetti. Egg. Vermicelli. There’s room in our hearts for all of the types of noodles in the world—and fideos are no exception.Simply put, fideos means “noodles” in Spanish. But the word actually refers to a particular kind of noodle—short and golden, with vermicelli-like thinness—as well as to specific dishes. In parts of Mexico and the U.S., fideos are typically prepared in sopa de fideo, a brothy noodle soup, whereas in Spain—and Catalonia, in particular—fideos are featured in a drier, jammier dish called fideuà. In this application, fideos are not boiled at all, but rather simmered in a rich, flavorful broth for a finished product that’s similar to paella in that it’s smoky, tomato-y, and umami-packed, with various protein and vegetable add-ins. .When assistant food editor Sohla El-Waylly set out to develop a recipe that would capture off-the-charts flavors and textures of Catalonian fideos in a weeknight-friendly package, she first tackled the noodles: Because not all grocery stores sell designated fideos, Sohla calls for  scrunching thin spaghetti into ½-inch to 1-inch pieces, which makes for a pretty good approximation. (Regular spaghetti will also work in her recipe, but stay away from angel hair—it’s so thin that it will cook too quickly.)Then, Sohla thought about how she was going to get big flavor while bypassing the typical saffron, squid ink, or seafood. The answer? Building in stages. She first renders the fat from chicken thighs, then uses what’s left in the pan to toast the makeshift fideos. Not only does this impart a nutty flavor to the noodles, but it also ensures that they’ll withstand the relatively long cook time.Once the noodles are a deep golden-brown, Sohla makes a soffritto—a slow-cooked mixture of onion, garlic, and tomato paste—and bolsters it with anchovies and lemon juice. The anchovies provide the umami jolt and the lemon brings brightness. All together, this flavor-packed base forms the foundation of the fideos, replacing seafood, chicken, or vegetable stock.After the chicken thighs and noodles go back in the pan, Sohla sends the skillet into the oven, for a gentle, even cook and a crunchy, spiky top. When you serve the fideos, don’t be surprised if your guests (slash roommates) fight over those crispy, browned noodles. But sit back and let them have at it: You’ll know that underneath lies the jammy, tomato-y, super savory, tender noodles that just might be the best part.Get the recipe:Fideos With Chicken Thighs and KaleWith a crispy, toasted top hiding saucy, tomato-y noodles, this one-skillet broken spaghetti dish is anything but one-note.View RecipeExplore Bon AppétitNoodleSpanishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-18", "author": ["Condé Nast", "Jesse Sparks"]}