{"id": "482ae64d0a2c590dcc73970285ed1bc6", "url": "https://www.bonappetit.com/story/sustainability-helps-restaurants", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Restaurants Are in Trouble. Sustainability Hacks Can Help. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRestaurants Are in Trouble. Sustainability Hacks Can Help.Sustainable practices help Hunky Dory’s Claire Sprouse keep the (energy-efficient) lights on.By Claire Sprouse, As Told To MacKenzie FeganAugust 4, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailClaire Sprouse is the owner of Hunky Dory, an all-day café and bar in Brooklyn’s Crown Heights neighborhood. Before moving to New York, Claire bartended at ABV and Rickhouse in San Francisco during a period of drought so intense that water was served only on request at restaurants and bars in California. She began developing tool kits and resource lists to help the service industry reduce its carbon footprint and started consulting with bars and restaurants around the world on sustainability. Here she talks about how smart practices aren’t just an issue of morality but of good business too.I was really looking forward to 2020. Hunky Dory would be celebrating its first birthday, and I was going to be consulting for a hotel project. It was supposed to be this opportunity to bring sustainable hospitality models to scale.And then, of course, COVID-19 happened. The first month Hunky Dory was closed, I was at a loss in terms of my own personal and professional mission around climate change. Like, who cares in this moment? How can businesses think long-term about sustainability when our industry has been devastated? But as time passed, I realized that just because life is on pause doesn’t mean that climate change is going away. Ultimately the decade between 2020 and 2030 is going to be critical, and we can’t put off action because of the virus. We need to readjust what we think our capacity is. We need to make a lot more room because so many of the issues COVID has laid bare—from workers’ rights to racial justice to climate change—cannot wait.I’ve learned in these last few months that as a business owner, I need to be proactive about building a safety net for my employees and for myself. We can’t keep being reactionary. So many of us in the industry were not prepared for a bad month, let alone a bad quarter, let alone a bad year, and you see restaurants closing for good as a result. We need to shift our mentality, make a plan, and try to get out in front of climate change. Okay, that might be impossible—womp womp, we are so far behind!—but the more work we do now, the more we set ourselves up for success in the years to come.Everything is Hunky Dory.\nPhoto by Laura MurrayI just launched a project called Outlook Good with the goal of becoming a hub for resources around climate justice for the bar and restaurant industry. Our first initiative was a recipe book called Optimistic Cocktails meant to build awareness around food waste and offer tips for how to turn scraps otherwise destined for the trash into delicious drinks. For example, at Hunky Dory, we make simple syrups from herb stems. (A recipe using this technique made it into the book.) We also dehydrate the celery leaves we can’t juice for our house-made Bloody Mary mix to create a celery salt to rim cocktails. Even the trimmings from root vegetables get pickled and turned into something delicious that we can sell.There’s a considerable amount of risk taken on by workers at every level of our supply chain to get food on our plates. It starts with farmworkers, who are often from the most marginalized communities and have the least security and protections. Then there’s the people working in grocery stores for very low wages, the delivery people, and now, as we start to reopen, the restaurant workers. One way I can show my thanks and appreciation for those essential workers is to maximize the potential of that food.Plus, all those things we created? That’s free money. Most people hear the word sustainability and they think it means buying expensive metal straws and installing solar panels, but reducing waste also means saving money. And that doesn’t just apply to food.The Outlook Good cocktail features a simple syrup made with herb stems and scraps.\nHunky Dory's water bill is around $200 a month; for a 60–70 seat restaurant, it would normally be closer to $1,000. A single Edison light bulb, the ones that broadcast “speakeasy,” costs something like $44 a year in electricity. The LED version is less than $5. Changing the faucet head on your sink or switching light bulbs may not be a very sexy way to talk about sustainability, but those little things have a huge impact—both on your carbon footprint and on your bottom line. It was already incredibly hard for restaurants to make ends meet, but now it’s even harder. Sustainable practices help me stay in business.There’s a historical and cultural precedence for sustainability; it’s not some new thing dreamt up by cool kids on a mission. Look at communities around the globe that traditionally have had limited access to water, or island cultures that have had to rely only on what they could grow locally. Sustainability is about survival, and it’s not only “for” certain types of people or certain types of businesses. I want to inspire action from all the neighborhood places on my street, not just the precious cocktail bars with the fancy bulbs.My goal with Outlook Good is to make sustainability initiatives more accessible. So yes, that means thinking a lot about language justice—knowing that presenting all this info in different languages means I can reach more business owners—and taking a step back from all the cool little gadgets I have. (Although I would still argue that a $50 investment in a dehydrator is money well spent!)People discredit singular human actions, but all those singular actions add up. Individuals do have the ability to make an impact, and that might be our biggest chance at combating climate change.Explore Bon AppétitBrooklynSustainableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-04", "author": ["Condé Nast", "Claire Sprouse", "As Told To Mackenzie Fegan"]}