{"id": "483e0e5b83c3ea3db767f873f097c4ef", "url": "https://www.bonappetit.com/recipe/alguashte", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Alguashte Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueAlguashteSeptember 22, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“Squash and pumpkins are huge crops in El Salvador, and the seeds never go to waste—they get toasted and ground to create alguashte,” says chef Anthony Salguero of Popoca in Oakland. Toasting pumpkin seeds brings out all of their untapped flavor, so be sure to take them to a deep golden brown color. You can use any variety you like, though the cook time may vary, so keep an eye on them as they toast. You can also sprinkle the seasoning on fruit with lime and hot sauce, vanilla ice cream, popcorn, even scrambled eggs, or try it in this seafood stew. Ingredients1½cups raw pumpkin seeds (pepitas)¾tsp. kosher saltPreparationStep 1Preheat oven to 350°. Toast pumpkin seeds on a large rimmed baking sheet, tossing halfway through, until golden brown, 20–25 minutes. Let cool.Step 2Transfer pumpkin seeds to a food processor, add salt, and pulse until very finely ground.Step 3Do ahead: Alguashte can be made 4 weeks ahead. Store airtight at room temperature.How would you rate Alguashte?Leave a ReviewTell us what you thinkExplore Bon AppétitSalvadoranCentral AmericanLatin AmericanPumpkin SeedSeedEasyVeganVegetarianGluten-FreeDairy-FreeRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}