{"id": "483e4590f4ac0c37c345d7ae5e29e06b", "url": "https://www.bonappetit.com/story/caramelize-onions-in-the-oven", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Make Caramelized Onions in the Oven, Save Yourself From Stirring and Sweating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Caramelized Onions in the Oven, Save Yourself From Stirring and SweatingAn easier route to golden-brown onions.By Sarah JampelMay 17, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailI don't love babysitting (to those I've babysat: It's not you, it's me!), which is why I rarely make caramelized onions on the stovetop. The process, while rewarding and worthwhile, takes vigilance, patience, and optimism—three virtues I cannot claim on any given weeknight (or, um, any day of the year).What I can do with much greater success is caramelize onions in the oven. While this method produces onions with a bit more variance—some pieces will be browner than others—it doesn't require as watchful an eye. It also frees up my hands (and my stove) for other tasks, like simmering pasta or rice, which makes multitasking possible.Hands, as usual, are the best tool for even tossing.\nTo caramelize onions in the oven, heat the oven to 400° and line a rimmed baking sheet with parchment paper. Toss a big pile of thinly sliced onions with olive oil and a splash of water (which will help them to steam and soften), season with salt, then roast until golden-brown and shrunken, stirring every 10 minutes or so, for 40–50 minutes.What you're looking for!\nFor Andy Baraghani's Slow-Roasted Onion Dip, he simultaneously roasts sliced onions (a mix of red, sweet, and yellow) and unpeeled garlic cloves (their skins protect them from scorching or drying!), then chops it all up and mixes the two with yogurt and lemon juice. And in Sohla El-Waylly's Squash with Yogurt Sauce and Frizzled Onions, she roasts thinly sliced red onions on the oven's lowest rack (near the heating element) to the point where they have crunchy edges, then uses half of them to offer textural contrast to tender winter squash and creamy yogurt dressing (the other half go in the dressing, lending it a deep savory flavor).Will your oven-caramelized onions ever be quite as homogenous in color and texture as your stovetop onions? Probably not. But you know what I always say about caramelized onions? Don't let perfection be the enemy of the good. Come to think of it, that's also what I say about babysitting—which might explain why I'm not always invited back?Dip into this:Slow-Roasted Onion DipLike the one you make with the packet of soup mix, but with no weird chemicals and 1,000 percent tastier.View RecipeExplore Bon AppétitOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-17", "author": ["Condé Nast", "Sarah Jampel"]}