{"id": "484f81da6f5c4c01dcfa6bcc2478c018", "url": "https://www.bonappetit.com/recipe/summer-salmon-nicoise", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "Summer Salmon Niçoise Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSummer Salmon NiçoiseBy Claire SaffitzJuly 31, 20184.6(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintWe love a classic Niçoise salad made with fancy oil-packed tuna, but using warm, slow-roasted salmon instead makes the whole thing feel a little more special. About that slow-roasted salmon: It is, hands down, the most foolproof way of achieving tender, perfectly-cooked fish we have ever come up with, no hot pan or sizzling oil necessary.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketRimmed Baking Sheet$20 At Bon Appétit MarketForkMedium Saucepan with Lid$36.99 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonPlatter$29 At AmazonPaper Towels$13.45 At AmazonTongs$13 At AmazonWhisk$10 At AmazonIngredients4 servings8Tbsp. extra-virgin olive oil, divided1lb. skinless salmon filletKosher saltFreshly ground pepper8oz. green beans1cup cherry tomatoes1small shallot1head of butter lettuce4large eggs, room temperature1Tbsp. Dijon mustard1Tbsp. red wine vinegarA pinch of sugar½cup Niçoise or other black olivesPreparationStep 1Arrange a rack in center of oven; preheat to 300°. Pour 1 Tbsp. oil into center of a rimmed baking sheet, then arrange 1 lb. salmon over oil. Season salmon all over with salt and pepper, then drizzle with another 1 Tbsp. oil.Step 2Roast salmon until flesh flakes in the thickest part of the fillet with pressed gently, 30–35 minutes. Meanwhile, fill a medium saucepan three-quarters full with water. Add several generous pinches of salt and bring to a boil, covered, over medium-high heat.Step 3While salmon is cooking and water is coming to a boil, focus on the rest of your salad prep. First, trim stem end off of 8 oz. green beans.Step 4Cut 1 cup tomatoes in half.Step 5Peel and finely chop 1 shallot. Transfer to a medium bowl; set aside.Step 6Separate leaves from 1 head of lettuce and arrange across a large platter. Cover with damp paper towels and chill until ready to serve.Step 7When water is boiling, add green beans and cook until tender but still retain some snap, about 2 minutes. As you wait for the green beans to cook, fill another medium bowl halfway with ice water. Using tongs, remove green beans immediately (but leave boiling water right where it is) and transfer to bowl with ice water. Leave green beans there for 15–20 seconds, or just long enough to chill them completely, then remove from water and pat dry; set aside. Keep the ice water for cooking the eggs.Step 8Add 4 eggs to saucepan and cook exactly 8 minutes. Transfer to ice water bath and let cool 2 minutes. Peel eggs, keeping them submerged in ice bath as you work. Pat eggs dry and transfer to cutting board.Step 9Time to make your dressing: Add 1 Tbsp. mustard, 1 Tbsp. vinegar, and a pinch of sugar to bowl with shallot; season with salt and a generous amount of pepper. Whisking constantly, slowly stream in remaining 6 Tbsp. oil until you have a thick, emulsified dressing.Step 10Remove platter with lettuce from fridge and drizzle with about one-third of dressing. Arrange green beans, tomatoes, and ½ cup  olives over lettuce. Cut eggs in half and tuck into gaps on platter.Step 11Using your hands or a fork, flake off large pieces of salmon and arrange over salad.Step 12Drizzle platter with remaining dressing. Season with salt and pepper.How would you rate Summer Salmon Niçoise?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI made this for dinner tonight and had to immediately leave a review. It's delicious and perfect and beautiful to look and crazy easy and I will never cook salmon another way again. Kudos.BentKneeeChicago8/24/2021Easy and impressive at the same time.  The only thing I did differently is made the dressing with less oil , less dijon (just 1 teaspoon) and more vinegar. I do about a 50/50 ratio of oil to vinegar - it's how my family prefers dressings. And we don't like as strong of a dijon mustard flavor.  But the slow-roasting of the salmon makes it delectable!\nI don't find it difficult to print from this site, it's just that the way the page is formatted takes up far too much space and is almost always 2 pages or more.  It would be nice to not have the equipment listed before the instructions, so maybe it could be on one page.karen nelsonUSA8/18/2019I agree with the person who posted how difficult it is to print a recipe from this site!  it's possible to simplify this process--I know, because AllRecipes does it. and they let you 'save' a recipe to somewhere in the ether.  suggest you get with the program.judyzum035489utah8/17/2019Looks delicious, but why can't I ever print the recipes on this site. I like to print to .pdf and save on my Google drive so I can pull up on my devices and not have to search through emails or the website every time. cpm-yes7834Louisville, KY 8/16/2019Explore Bon AppétitSaladFrenchEuropeanSalmonFishSeafoodGreen BeanVegetableOliveOther IngredientsEggSummerEasyMainDairy-FreeGluten-FreeKetoRoastLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Claire Saffitz"]}