{"id": "484fdaea964ee9e002c4191f5e1709a4", "url": "https://www.bonappetit.com/recipe/dan-dan-pappardelle", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Dan Dan Pappardelle Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDan Dan PappardelleBy Diana YenApril 14, 20214.6(90)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThe flavors of Chinese dan dan noodles meet Italian pasta in this spicy crossover dish. Wide ribbons of pappardelle are ideal for clinging to a hearty five-spice-scented pork ragù, showcasing a wide spectrum of salty-sweet-creamy-spicy flavors. Freshly ground Sichuan peppercorns give the dish its distinctive tongue-tingling character while chile crisp adds heat and extra texture.Ingredients4 servings1tsp. Sichuan peppercorns2Tbsp. Chinese sesame paste or tahini1Tbsp. black (Chinkiang) vinegar or unseasoned rice vinegar2tsp. sugar3Tbsp. homemade or store-bought chile crisp (such as Fly By Jing or Lao Gan Ma), divided2Tbsp. plus 1 tsp. soy sauce1Tbsp. vegetable oil10oz. ground pork½tsp. five-spice powder4garlic cloves, finely chopped1lb. pappardelleKosher saltCrushed unsalted, dry-roasted peanuts and sliced scallions (for serving)Special equipmentA spice mill or a mortar and pestlePreparationStep 1Toast Sichuan peppercorns in a small skillet over medium-high heat, tossing often, until slightly darkened and fragrant, about 2 minutes. Transfer to a spice mill or mortar and pestle and let cool; finely grind.Step 2Stir ground Sichuan peppercorns, sesame paste, vinegar, sugar, 2 Tbsp. chile crisp, and 2 Tbsp. soy sauce in a small bowl to combine; set aside.Step 3Meanwhile, heat oil in a large skillet over medium-high. Add pork, five-spice powder, and remaining 1 tsp. soy sauce to pan, breaking meat up into pieces with a wooden spoon. Cook, undisturbed, until it begins to brown, about 3 minutes. Stir and continue to cook, breaking up meat into smaller pieces, until cooked through, about 2 minutes. Add garlic and cook, stirring, until fragrant, about 1 minute. Remove from heat and add Sichuan peppercorn mixture; set aside.Step 4Cook pasta in a large pot of boiling salted water, stirring occasionally, until 1 minute short of al dente. Using tongs, transfer pasta to skillet with sauce and pour in ½ cup pasta cooking liquid. Bring to a simmer and cook, tossing gently, until sauce is creamy and clings to pasta, about 1 minute. Drizzle in remaining 1 Tbsp. chile crisp.Step 5Divide pasta among plates and top with peanuts and scallions.How would you rate Dan Dan Pappardelle?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleAmazing recipe! I make this vegan by pulsing a combo of walnuts, mushrooms, and cauliflower in the blender in place of the pork. SO flavorful, we don’t miss the meat. I add lemon when serving as I like some added acidity. The tingly peppercorns are everything, do not skip!Mel BDenver, CO3/14/2022FANTASTIC!   A total flavor bomb.   Following the advice of many of the reviews, I doubled the sauce, increased the pork to a pound, and used 12oz of noodles.   Cannot give this recipe enough praise! Both the tahini and unseasoned rice vinegar are completely good substitutes. JamesNYC2/22/2022Agreed with others, doubling sauce way to go.  Substituted venison for pork and this is now on the rotation. Anonymous2/21/2022Agree with others either double sauce or cut pasta in half. This recipe is great on its own. Only change I made was used hot honey instead of sugar because I had it.Owen CarterColumbus, OH1/9/2022Wish I had read the reviews before I made this, my only complaint was it absolutely needed more sauce! Everyone seems to be in agreement here lol. Pasta was delicious and I added more meat than it called for but ended up having to add an extra tbsp of chili crisp and it still was not nearly as saucy as I wanted. East and great recipe though!Jessie PNew York, NY1/8/2022Followed the recipe and readers' suggestions to double the sauce. Will make again! Lisa SteinNew York, NY1/4/2022This was A-MAZING!!!  I tripled the sauce, only added 1/4 t of the ground Sichuan peppercorns because we are spicy-hot wimps though I think I could've used more and it would've been ok - next time because there WILL BE a next time!!  I only had a 1/2lb of ground beef so I roughly chopped up about 6 oz of mushrooms and cooked them with the meat so that there were lovely little crispy bits of mushroom in there.  YUMMY and made the meat go farther; a good trick to stretch your food budget.  Also, I didn't add the noodles to the pan, just some of the pasta water because we weren't going to finish the whole pan and I don't like soggy, mushy noodles.  This is the best Chinese dish I've ever made.KellyOklahoma10/15/2021Another vote for more sauce! The flavors were excellent and the substitutions suggested for more everyday ingredients one might have around the kitchen (tahini, rice vinegar), were helpful. Next time I would try it with less pasta and more liquid. Added almost 1 cup of pasta water this time but it wasn't enough and made the flavors less pronounced. Loved the peanuts for texture and the scallions for freshness. Also would add more peppercorns.LaurenLos Angeles, CA7/28/2021The best spaghetti and meat sauce I have ever had--and there is not a no. 2 iwhich is close!David RosenthalOakland, CA7/27/2021We absolutely loved this..but agree needs more sauce so made the whole recipe but only used 9 oz of Rana pasta Pappardelle..actually think you could triple the sauce ..but it was amazing! Definitely making again..Drunkinchef Middletown NY5/10/2021This recipe was certainly better than I expected! As other reviewers wrote, doubling the sauce is a must if using 1lb of the pasta. Honestly, doubling any good sauce is a must. Will definitely add this recipe to my list. MissMeganEastampton NJ5/8/2021Awesome..made the sauce and recipe as is but only used 9 oz of fresh pappardelle Rana..awesome dish..paired it with a salad with Carrot ginger dressing like you get at the Japanese restaurant...will definitely make again 😋AnonymousMiddletown NY5/7/2021As other reviewers said, double the sauce to coat 1lb pappardelle. I also added 1 inch grated ginger and 2 tbsp of the five spices powder (by mistake) to the sauce mix , and it tastes good. Will definitely make the recipe again.PatarLos Angeles, CA5/7/2021I'm generally not in the \"double this, double that\" club, but in this case it fits (as others have said). In my case I just reduced the pappardelle to 250g (a bit more than half a pound) which made three reasonably sized portions. Kept everything else the same. Even with half the noodles it still had less meat per plate than what you see in the illustration. So yes, either reduce the noodles or increase everything else. Otherwise, really good and it comes together very quickly. Will definitely put in the rotation. (BTW, I think this would work just as well with ground chicken or turkey, especially if it was ground dark meat.)BlorkMontreal5/1/2021This recipe is perfect IF you just use half the mount of pasta (serving2).  Tried it last night with my boyfriend and we were both very into the numbing Sichuan peppercorns.  Absolutely delicious; going to try it next with impossible meat!Christine Mai NguyenLos Angeles, CA4/28/2021Explore Bon AppétitPastaPappardellePasta & NoodlesGround PorkPorkMeatTahiniCondiments, Sauces & PastesQuickWeeknight MealsMainDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-14", "author": ["Condé Nast", "Diana Yen"]}