{"id": "4861ece48cb4b5a74f7b71e29e511267", "url": "https://www.bonappetit.com/recipe/soy-and-ginger-steamed-fish", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Soy and Ginger Steamed Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSoy and Ginger Steamed FishBy Christina ChaeyMarch 7, 20194.4(61)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYou can use this foolproof steaming method to cook any sturdy fish—salmon, snapper, black cod, or arctic char would all be great in place of the black bass. The kombu, though optional, adds a subtle layer of umami flavor to the delicate broth.Ingredients4 servings26–8-oz. skinless black bass filletsKosher salt14x3\" piece dried kombu (optional)2Tbsp. sake2Tbsp. soy sauce1Tbsp. mirin (sweet Japanese rice wine)¼large or ½ medium head of Napa cabbage, stems thinly sliced crosswise, leaves torn if large (about 5 cups)4oz. mixed mushrooms (such as shiitake, oyster, beech, and/or maitake), torn into pieces12\" piece ginger, peeled, cut into thin matchsticks1Tbsp. toasted sesame oil2scallions, thinly slicedCooked rice (for serving)PreparationStep 1Slice fish into six pieces; season all over with salt.Step 2Combine kombu (if using), sake, soy sauce, mirin, and ¾ cup water in a medium donabe or Dutch oven with lid. Bring to a boil, then reduce heat to low. Layer cabbage stems, then leaves in pot. Scatter mushrooms and ginger over, then place fish over mushrooms. Cover pot and steam until fish is opaque and just cooked through, 8–10 minutes.Step 3Drizzle with sesame oil and top with scallions. Serve in shallow bowls with broth spooned over and rice alongside.How would you rate Soy and Ginger Steamed Fish?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI have made this with shrimp, with tilapia and with cod, and it’s always wonderful. Thanks to all the comments, I always double everything but the seafood. This especially makes sense when it comes to the cabbage-get a small head and you won’t have unused cabbage in your crisper. And I use white vermouth instead of sake because it’s what I have. Such a delicious, nutritious and easy dish!AnonymousTampa3/14/2022I did not have sake, and I use, Sharo Xin wine ( Chinese cooking wine).. lets see how it turns out.\nAnonymousSingapore10/4/2021Really delicious! I used cod fillets, doubled the broth, and used bonito soup stock instead of kombu. I wish I had doubled the whole recipe!KateLos Angeles, CA4/10/2021Fish didn't cook at all when the heat was on low after boiling. Think the recipe should be clearer and maintain that the water should continue to be boiling for the steaming process to cook the fish!RainNew York, NY12/14/2020Quick, easy, not a ton of ingredients, healthy and delicious! The perfect mid week meal. Will be remaking this a lot.Megan GLos Angeles, CA11/10/2020This took me 20 minutes including prep, which in and of itself is amazing, but the flavors that were produced in such a short amount of time really knocked this one out of the park. Surprisingly to me, the cabbage was the star of the show. I served it with rice and it was perfect. lgehgaAustin, Texas9/24/2020Make this recipe all the time and have experimented a bit. Note: If you make it with the ingredients here, it will not look like the photo! Double the amount of broth for more liquid. We like to add a few dried chiles to the broth for some subtle heat. And we don't have kombu so we add strips of dried nori. Other than that, it really doesn't need any extra flavors...it's very umami and warming. AnonymousCalifornia8/2/2020Great recipe, SO easy! I used barramundi. Didn't have sake so used white wine.AnonymousSingapore6/18/2020My husband and I both loved this! I made the recipe as written to serve 4 except used only enough salmon to serve two because we like the extra vegetables and broth. Used beech mushrooms and rehydrated shiitakes. Although we tend to prefer strong flavors, we  thought that the subtle nuances in this broth were perfect. I couldn't imagine wanting to muddy up this dish by adding other ingredients.vetterlCalifornia5/22/2020One of the best recipes I've tried from BA so far!! Love it so much thanks Christina <3 cloze9Australia5/19/2020Anon from the future is I think mistaken. Kombu is seaweed. I think you're thinking of dashi which is seaweed and bonito flakes. #protectChristina #listentotheasians #iamasianAnonymousa better future5/13/2020Such a simple recipe. It is also very humble and can be modified to suit your taste/what you have. I ad no access to cod but had some frozen pollock which worked nicely. Comes together really quick for a humble and warming meal! Love it Christina :)AnonymousNew Jersey4/15/2020Ok, this is SUCH A GOOD RECIPE. I made this tonight, on a damp, blustery, frigid Canadian spring evening amid the godforsaken Covid-19 crisis and it was the perfect, delicate remedy my fiancé and I needed! I doubled the broth batch for an extra soupy turn out and used fresh cod along with Napa cabbage, broccolini and shiitake mushrooms. Took about 15 -17 minutes, as my fish was quite thick, but the end result was heavenly. We served it On white rice topped with scallions, toasted sesame and a bit of chili oil. Such a gentle, heartwarming, filling and incredible dish. 10/10 would recommend. Give me more recipes like this <3 Sbarber3Ontario4/13/2020This recipe needs help.  First kombu is technically seaweed but for anyone other than a dictionary it usually refers to a broth made with bonito flakes and “kombu” seaweed.  I highly recommend using kombu broth (BA has a good recipe).  Second, as described the fish is raw.  You either need more liquid or a higher heat.  Third this recipe as others have noted was quite bland.   If I ever made this again I would cook the cabbage and mushrooms separately in some kombu broth with sake and soy then drain the broth into a pan and cook the fish covered for a few minutes.     Then combine.  Enjoy. AnonymousThe future4/3/2020This is a fantastic and simple recipe. You must use Kombu (easy to find in a Japanese grocery) as that is what makes this taste like you are a pro chef. I used salmon and subbed spinach for the cabbage/mushrooms. Everyone ate it all up including my picky eater who said it was great after one bite. AnonymousSanta Monica, CA4/1/2020Explore Bon AppétitSalmonFishSeafoodSnapperGingerHerbs & SpicesShiitake MushroomMushroomVegetableOyster MushroomMaitake MushroomBlack CodBassEnoki MushroomOne-Pot MealsMainDairy-FreeKetoHealthyishSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-07", "author": ["Condé Nast", "Christina Chaey"]}