{"id": "48656719972d2bef7dcd3298c94c827c", "url": "https://www.bonappetit.com/recipe/rhubarb-custard-cake", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Rhubarb Custard Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueRhubarb Custard CakeBy Claire SaffitzMarch 26, 20184.7(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis cake is designed to be mixed by hand. Using an electric mixer works more air into the eggs, which lightens the batter and makes it less dense, so the fruit is more prone to sinking. Also, make sure you leave the stalks whole, as chopped rhubarb is more likely to be swallowed up by the batter and sink to the bottom.Ingredients8 servings4Tbsp. melted unsalted butter, cooled, plus more room-temperature for pan1cup all-purpose flour, plus more for pan¾tsp. baking powder½tsp. kosher salt2large eggs1large egg yolk1½cups sugar, plus more for sprinkling¼cup sour cream2Tbsp. dark rum2tsp. finely grated lemon zest13oz. rhubarb stalks, halved lengthwise if thickSpecial EquipmentA 9\"-diameter springform panPreparationStep 1Preheat oven to 350°. Butter and flour pan. Whisk baking powder, salt, and 1 cup all-purpose flour in a medium bowl. Whisk eggs, egg yolk, and 1½ cups sugar in a large bowl until very pale and thick, about 1 minute. Whisk melted butter, sour cream, rum, and lemon zest in a small bowl. Whisk butter mixture into egg mixture just to combine. Add dry ingredients and fold in until batter is smooth; scrape into prepared pan. Chill 10 minutes to let batter set.Step 2Arrange rhubarb over batter however you like, trimming as needed. Don’t press fruit into batter—just place over top and let it rest on the surface. Sprinkle with more sugar and bake until cake is golden on top and browned around the sides, 45–55 minutes. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Slide a knife around sides of cake to loosen and unmold. Slide directly onto rack and let cool completely.Photo by Alex LauStep 3Do Ahead: Cake can be baked 1 day ahead. Store tightly wrapped at room temperature.How would you rate Rhubarb Custard Cake?Leave a ReviewTell us what you thinkReviews (52)Back to TopTriangleA nice if not incredible cake. A few notes: I reduced sugar by 1/2 as other suggested and it was quite sweet enough. It’s quite a runny batter - definitely more of a “pour into the pan” than “scrape” as the recipe notes. Also I don’t think you can effectively “fold” flour into this much liquid batter - the gentle action just doesn’t remove the lumps. If I make again I will try to beat some liquid into the flour until smooth and then fold this into the remainder of the liquid batter. I chopped the rhubarb up small and it didn’t sink. Mine cooked through in 50 mins but the top wasn’t brown so I put it under the grill/broiler to brown up the top and that worked well. Jessica LouiseSydney Australia 9/17/2021I've been making this for years and finally decided to try the refrigerated batter method, as directed. I prefer it a bit lighter than this result.  And I will return to doing a batter that goes directly into the oven. It was just tooooo dense.AnonymousToronto8/29/2021I have made this so many times since it was printed. Then learned that  rhubarb loves to create kidney stones. Whoops.\n\nI love it, used to love it; it is so easy to make and foolproof.  I've made it with peaches. Almost as good a the rhubarb. I like to whip the bjimineys out of it with the KA.  That's what I pay it for. I prefer it light and a bit airy.AnonymousVictoria, BC8/7/2021Yum! My new go-to rhubarb dessert recipe. Simple and delicious - it was gone within a day between two people. I did reduce the sugar by 1/4 cup, which was perfect. Anonymous7/11/2021Absolutely amazing. Making it again.JuliaCanada6/14/2021This was incredible!! Made it w strawberries since I couldn’t find rhubarb, and omitted the extra sugar on top since the berries were already v sweet! Used one cup of sugar after reading some other comments, and it was the perfect level of sweetness. Mine was more spongey than custardy, delicious anyways! This is a great base recipe, I plan to experiment w diff fruits and spices!AnonymousNYC5/24/2021Awesome! But, you forgot something....Step 1: Pour rum into beautiful glass and sip throughout remaining steps. Stephanie5/22/2021Just started to make this and am kind of shocked there are no metric measurements. I've become accustomed to weighing everything now for baking  and it's so much easier plus thought much better for outcomes. Curious why not offered here?\nMarissaNorCal5/10/2021I have made this cake at least 8 times and it  has been delicious every single  time. I have made it with plums as well, and mi substitute  sambucca instead of rum. \nMy cake has never been cooked enough after 55 minutes, having to increase cooking time to 1hr 15minutes. ShelaghPort Dover, Ontario 1/27/2021I have baked this cake twice and will do so next year when the rhubarb season comes again. It's delicious. I cut the rhubarb in smaller pieces too like a lot of the people who commented as it makes for a better eating experience.AnonymousGermany10/20/2020This recipe is amazing. Chewy on top and soft in the middle and still allows the tart rhubarb to really shine through. This recipe will definitely be one I go back to in late spring when the rhubarb is bountifulAnonymousToronto8/13/2020This cake is the bomb. I make it multiple times a summer and it makes all of us happy every time. I'm going to try making it with plums and sour apples this year. AnonymousCalgary8/1/2020This is a lovely dessert. The rhubarb softens more than one would expect, so cutting isn't hard. I wasn't sure why it is a custard cake, but it must be the rhubarb juice making the cake nearby just the slightest bit custardy. It's so festive. I liked it still slightly warm.AnonymousNorwich VT6/14/2020Super yummy! I replaced the sour cream with greek yoghurt, and I added 1 cup instead of 1.5 cups of sugar based on other reviews. It turned out great! I will however next time sprinkle on more sugar on top of the cake and rhubarb before putting it in the oven. The rhubarb was a little too tangy.AnonymousSweden6/5/2020Rhubarb is back at the market!! I made this cake for a second time and it was a huge hit. I'm not usually a rhubarb (or even much of a baked fruit) gal but this hits the spot. \nI didn't make any changes to sugar (I have a sweet tooth but didn't think this was overly sweet as is..) and I cut my rhubarb in ~1-2in pieces and in half lengthwise because they were pretty thick. I let is set in the fridge for about 25 mins and the rhubarb didn't sink at all after baking! My springform was a 10\" sadly so it was a bit thinner but still dense and moist and delicious. \n\nI wonder if it would benefit from switching the sour cream for mascarpone? Things to try next time... Indianapolis, IN5/25/2020Explore Bon AppétitCakeDessertRhubarbFruitSpringNut-FreeBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-26", "author": ["Condé Nast", "Claire Saffitz"]}