{"id": "489850ed863f1e129fa252c353ba33ad", "url": "https://www.bonappetit.com/story/afropot-henry-life-hotel", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "I Will Fight You for the King Crab Legs in the Afropot at Henry at Life Hotel  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Will Fight You for the King Crab Legs in J.J. Johnson’s AfropotIt’s an entire seafood boil in miniature and I’ll share it—if I must.By Alex BeggsMay 16, 2019FacebookTwitterEmailPhoto by Bea da CostaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are plenty of places in New York to get a pot of mussels in some white wine whatever broth and a side of fries. There aren’t nearly enough places to get a pot that overfloweth with so much seafood it’s nearly jumping out of the broth trying to get back to where it came from. At Henry at Life Hotel, the Afropot is such a thing.It comes to the table in a wide serving bowl with bright red King Crab Legs mid-showgirl kick. It’s 3.5 pounds of whatever seafood is in season—lobster, crab, mussels, clams, giant prawns with their beady little eyes. Your hands get messy, things get grabby, that’s the whole point. It’s an entire seafood boil in miniature, with spicy coins of Chinese sausage and a fragrant, chuggable, mustard-colored broth.And oh the brothhhhhhhh. It steams and spreads its perfume, and makes everyone around the table scoot closer and start snatching legs and shells and prawn whiskers. The flavor is seafood forward, shrimp and lobster-y, backed up my fragrant lemongrass, ginger, garlic, and bird’s eye chili (the real stuff from West Africa, per chef J.J. Johnson), and perfectly balanced.“Everybody is oohing and ahhing,” Johnson says about diners’ reactions to the pot—that would be me, when sharing it with two other friends recently. “People might think of a clambake, a seafood boil in the south, someone from Nigeria or Senegal can taste that dried seafood flavor and it brings them back home.” For Johnson, the dish was inspired by a fish broth he drank at the Ghana fish market every morning before he went shopping.And while the menu at Henry changes each season, Johnson makes a promise: “That dish isn’t going anywhere.” I promise right back that I’ll keep coming for it.Go there: Henry at Life HotelP.S. Johnson’s cookbook Between Harlem and Heaven just won a James Beard award. Cool! Buy it on Amazon for $22.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendRestaurantsSeafoodNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-16", "author": ["Condé Nast", "Alex Beggs"]}