{"id": "48a1ed1368fa4400663d6ea79866e2f3", "url": "https://www.bonappetit.com/story/chocolate-sables-cookies-party", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Bake These Chocolate Sablé Cookies and Upstage Any Holiday Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBake These Cookies and Upstage Any Holiday MealLet them make pie. You’re bringing scene-stealing cookies.By Carla Lalli MusicNovember 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Why make pie when you can have cookies?Judging by the listener questions about Thanksgiving that we got on this week’s holiday special Foodcast, those of us who aren’t hosting this year are actively trying to figure out how to upstage the person who is. Reverse Holiday Hosting Revenge Mania, if I had to put a low-key psychological diagnosis on it. And no, you can’t bring an “extra” turkey, or a pie that no one asked you to bring, or a different recipe for mashed potatoes because you don’t approve of your aunt’s mash.Want this letter before it hits the website? Sign up for our newsletter!You can, however, bring a cookie—a non-threatening offering that may give you the final word. Ideally, this cookie will be chocolate, since no one thinks about chocolate at Thanksgiving, thereby handing you an available-flavor opportunity with no foreseeable competition. A box of cookies presented to the hostess could even be construed as a “for you to enjoy anytime” offering, but if she’s gracious, she’ll of course put them out on the dessert buffet. That was so sweet of you, Dear Reader, to bring cookies, look at how cute they are.Dinner unfolds as your plans coalesce. You and your chocolate sablés are hunters; like big cats, you wait to pounce. By holding off until dessert to make your move, you avoid all the noise. Shouldering in on the main part of dinner would leave you exposed—the stakes are too high, the field too crowded, the dishes too entrenched! (You didn’t really want to be one of three stuffings in an elimination heat, did you?)Eventually, it will be pie time. Pumpkin, surely. An apple thing (like this new naked apple tart). A caramel-and-nut tart. Lemon meringue. And then the hostess will remember your cute little cookies.Our new naked apple tart is also a good party option.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensNow is your time. If everything goes as planned, a plate with your cookies will be passed around, choices will be made. Trust me, there’s something about the excess of four pie slices on a person’s six-inch dessert plate that will make an innocent-looking cookie seem utterly attainable. “Oh, they’re nothing,” you say, when someone asks what you brought. “Just some simple chocolate slice-and-bakes.” Pause.“Cool recipe, actually. They’re made with date sugar.”Sorry, was that the sound of the needle coming off the record? Did all conversation just come to a halt? Quiet enough to hear a fork drop! You’ll now have everyone’s attention as you confess that it is indeed possible to make a dessert with dehydrated pulverized dates instead of white cane sugar.“So...these are good for me,” your brother’s new girlfriend will say in disbelief. Oh, are they.“Why are they so tender?” your uncle’s business partner will ask. That’s from creaming the sugar until it’s very light and fluffy, plus there’s barely enough flour to hold them together.“What’s the salty stuff on top?” your niece wants to know. Crunchy seeds and flaky salt, you say, to balance out the rich chocolate.“Why does it seem like they’re melting?” your dad asks. That’s the grated chocolate holding them together—the cookie is actually melting.I’m just saying: everyone has had pie before. It’s great, it’s familiar, it has to be there. But not-too-sweet chocolate cookies with salted crunchy toppers? The healthyish sablé may not have been on the original invite list, but this year, they’re the chic, understated friend-of-a-friend who snags a seat and then quietly slays with brutally witty insights all night long. There are some dishes, and people, that you only need to see at the holidays. This cookie is more than welcome to show up at dinner parties all year long.Get the recipe:Chocolate Sablés with Date SugarExplore Bon AppétitCookieCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Carla Lalli Music"]}