{"id": "48a4274ebb01f9e409c9a6143509c51d", "url": "https://www.bonappetit.com/story/what-are-red-pepper-flakes", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Wait, What Are Red Pepper Flakes Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWait, What Are Red Pepper Flakes, Anyway?In an age when chiles are name dropped on menus everywhere, you gotta wonder: What are \"red pepper flakes\"?By Alex DelanyMay 22, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou'll find a little glass jar filled with crushed red pepper flakes in every nearly every pizza parlor across the country. This stuff is everywhere. But in a time when chiles like arbol and guajillo and ancho and other varietals get called out by name on menus, you gotta wonder: What are red pepper flakes? They're just...red pepper? You’ve shaken that little jar over a slice of pizza or some penne alla vodka or chicken parm at least once in your life (and hopefully more than that). But for an ingredient that is so widely and commonly used, what does the average person actually know about red pepper flakes? Not much at all.Sure: Red pepper flakes are made from peppers. But how are they made? What type of peppers are used? How are they different than chile flakes? Are all crushed red peppers the same? Are those...seeds in there? We have the answers to life’s most pressing questions. (Well, at least these red pepper questions.)Red pepper flakes are made from a mix of peppers from the capsicum annum family. Don’t get confused by the latin. You know these guys. We’re talking peppers like jalapeño, bell, Fresno, and Anaheim peppers. But the most commonly used pepper for crushed red pepper flakes is the cayenne pepper. The majority of red pepper flakes will be a mix of peppers, with cayenne taking up the majority of the share. The makeup will change, depending on which brand or company you end up purchasing.And that’s the big difference between crushed red pepper and chile flakes. Chile flakes are generally made from a single type of pepper and used to express that pepper’s flavor. Aleppo chile flakes. Chipotle chile flakes. Urfa biber chile flakes. All single varieties used for spice and distinct secondary flavor notes. Crushed red pepper is more of a one-dimensional flavor. The primary use is to achieve heat.All red pepper flakes. All different mixes of peppers. All spicy.\nPhoto by Chelsie CraigAnd you can tell that just by looking. Chile flakes will usually be a uniform color because the seeds of the peppers are discarded. But in a jar of crushed red pepper flakes, you’ll see the lighter-colored seeds mixed in with the dried red flesh of the peppers. And those seeds add a serious kick of heat.So how does this mix of peppers and seeds end up in this bottle, after they’re picked fresh? Well, they’re dried and pulverized. Where some smaller batch chile products are dried in the sun to slowly develop sweetness and flavor, most of the peppers that become crushed red pepper flakes are dried in an industrial oven in the instance of time and efficiency. You’d need a lot of outdoor space to do it any other way. Crushed red pepper flakes are single-varietal chile flakes' rough-and-tumble cousin—not a lot of subtlety there, but they're cheap, spicy, and ready to rumble.After the peppers are dried, they’re pulverized (seeds and all) and dumped into plastic containers, which are shipped to restaurants and pizzerias, which pour them in little glass jars. And then you walk in and order a pepperoni slice and look around the table and say, could you pass the crushed red pepper?Red pepper flakes are also good in pasta:Shrimp Scampi PastaButtery, garlicky, irresistible shrimp scampi—but make it pasta.View RecipeExplore Bon AppétitBasicallyRed PepperChileIngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-22", "author": ["Condé Nast", "Alex Delany"]}