{"id": "48ab2009d68a9090ff495a215dc8543e", "url": "https://www.bonappetit.com/story/never-fail-spiced-nuts", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Spiced Nuts Are a Necessary Cocktail Party Snack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt Should Be Illegal to Serve Drinks Without These Spiced NutsDon't invite me over for cocktails in December unless there's a bowl of spiced nuts on the table, okay?By Amiel StanekDecember 14, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Oh, you want to invite me over for cocktails? How nice! How festive! 'Tis the season, after all. I'd love to. That sounds lovely. You'll be serving the spiced nuts, of course, won't you? Which spiced nuts? Hahahahahaha. Cute. The Sweet-and-Spicy Mixed Nuts, obviously! What's that? You wouldn't dream of hosting people for alcoholic beverages without serving The Nuts? I always knew you were a good egg.Alright: This is not an actual conversation that I have with people who are inviting me into their home to drink and hang out—but I wish I did. I wish I could bully my friends and acquaintances into making this exact recipe for spiced nuts pretty much whenever they're serving up cocktails. Partially for my sake: These crunchy, sweet-salty-spicy nuts are a true delight, and are exactly what I want to nibble on when I'm sipping an icy martini or nursing a boulevardier—substantial enough to keep one afloat without spoiling the appetite. But also for the sake of my hosts, because these spiced nuts are pretty much the most simple, throw-together homemade snack imaginable.Making a batch of these bad boys is about as difficult as reheating store-bought tater tots. You preheat the oven to 350°. You mix together three cups of mixed nuts—the recipe calls for almonds, walnuts, and pecans, but you can use whatever you've got lying around in whatever ratio—and a handful of pumpkin seeds (but sesame or sunflower seeds work great). You toss them with some olive oil, maple syrup, fresh rosemary, smoked paprika, and salt. Spread it all out on a sheet pan, pop it in the oven, and 20 minutes later you've got The Nuts—beautifully caramelized from the maple syrup, addictively spicy, and rosemary-fragrant. Try to wait until they're cool enough to eat. Just try.All the nuts that's fit to mix.\nPhoto by Ted CavanaughIf you need more convincing, The Nuts are not without pedigree. Like many of my favorite simple, perfect, \"Oh, this? It's nothing!\" recipes for entertaining, it comes to us from the brilliant Alison Roman, the same person who brought  us The Cookies and, now, The Stew. But unlike those other viral recipes—which are immediately, almost-ubiquitously recognizable—these are under-the-radar enough that you can set them out confidently, slyly, as if that's just What You Do when people come over. Make them your own—I'm sure Alison won't mind. Just don't pour me a drink this month without putting a dish of these in front of me first—that I mind.Get the recipe:Sweet-and-Spicy Mixed NutsView RecipeExplore Bon AppétitNutappetizerNever FailCocktail PartyEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Amiel Stanek"]}