{"id": "48b6bfdb360e70ffa863a05a1a886df7", "url": "https://www.bonappetit.com/recipe/gyeran-mari", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Gyeran Mari Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueGyeran MariBy Susan KimFebruary 9, 20214.6(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintChef Susan Kim sells Korean to-go lunch boxes filled with beautifully prepared vegetables and various banchan, or small side dishes, through her NYC-based pop-up Eat Doshi. We were so enamored of these beautiful doshirak that we asked Kim to teach us how to recreate a home-cooked version that includes these savory rolled-egg omelet slices filled with toasted seaweed snacks and a secret ingredient: Parm shavings. They’re equally good enjoyed on their own as a little snack, as a side dish to a larger meal, or sliced and served with a bowl of rice. Kim uses sheets of toasted seaweed snacks from brands like Seasnax or gimMe, which come pre-seasoned with sesame oil and salt. Get the recipe for the celery and turnip pickles, also featured in the box.Ingredients2 - 4 servings5large eggs2Tbsp. mirin½tsp. white or regular soy sauce½tsp. kosher salt1Tbsp. vegetable oil2oz. Parmesan, shaved with a vegetable peeler6seasoned toasted seaweed snacksPreparationWhisk eggs, mirin, soy sauce, and salt in a 2-cup measuring glass. Heat oil in a medium nonstick skillet over medium-low. Pour in one third of egg mixture, rotating skillet to evenly distribute. Cook until egg is mostly cooked, about 1 minute. Scatter one third of Parmesan over and shingle 2 seaweed snacks vertically down the center. Using a rubber spatula and starting from one side, fold egg up and over itself to roll up tightly; push to one side. Repeat cooking process with half of remaining egg mixture, Parmesan, and seaweed snacks, then flip existing egg roll over onto flat egg and roll up again. Repeat one more time with remaining ingredients. Transfer gyeran mari to a plate and let cool 5 minutes. Slice into ½\"-thick pieces.How would you rate Gyeran Mari?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIs there a recipe for the rice?!AnonymousSan Francisco 9/15/2021Pretty good, but the parmesan came through a bit more strongly than I would have liked--next time I'll use about half as much as the recipe calls for.Anonymous4/6/2021Explore Bon AppétitKoreanEast AsianAsianEggSeaweedOther IngredientsEasyQuickSnackSideNut-FreeGluten-FreeVegetarianKetoHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Susan Kim"]}