{"id": "48bedd6c7067d0333f968090776bf939", "url": "https://www.bonappetit.com/story/nora-seaweed-snacks", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Nora Seaweed Snacks Put All Other Seaweed Snacks to Shame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Seaweed Snacks Put All Other Seaweed Snacks to ShameCrumby keyboards won’t stop us now.By Alyse WhitneyJanuary 15, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailA few months ago, an unassuming box arrived at my desk filled with seaweed snacks from a company called Nora. Curious, I grabbed a bag of original tempura flavor, popped it open, and started passing it around to my colleagues. Next came a wave of audible crrrrrunches, and then a bunch of gasps. These potato-chip-sized, tempura-fried, salty-sweet pieces of roasted seaweed coated in white pepper, cane sugar, and onion and garlic powders were the best seaweed snacks we had ever tried.“It has the addictiveness of snacking on cereal—but it is salty which makes it even more addictive!” said contributing editor Priya Krishna.“These are one of those snacks that’s probably not as healthy as I think it is but addictive enough that I don’t care, like, at all,” associate editor Hilary Cadigan concurred.In three minutes flat, the first bag was gone.The “spicy” version just has a little heat from chili powder.\nPhoto by Chelsie CraigSo we opened the next one. This “spicy” version came coated in the same tempura shell, dusted with a little chili powder. With the pleasant kick still lingering on the back of our tongues, we dubbed this the best bar snack you could have anywhere, anytime.“Generally I think seaweed snacks taste like snacking on the ocean’s socks—the brine is overwhelming, and the flavor is all of the worst parts of chard: dirty, wilted, lifeless,” lamented associate editor Alex Delany. “But apparently, if you toss them in tempura batter and season them with a salty, sweet, and spicy powder, they taste amazing.”These double-stacked seaweed strips are fried like chips, so they have a satisfying crunch.\nPhoto by Chelsie CraigThen we noticed a third bag: simple nori strips—the closest relative to the little plastic tubs of dried, roasted seaweed snacks you’ve probably seen before. But these were thicker, less delicate, crispier, and flash fried—and in turn, very easy to eat a lot of. And so we did.“I like that the strip are more substantial than the standard seaweed snacks,” said features editor Meryl Rothstein. “I love those, but I usually plow through an entire pack without satiating my hunger. These taste similar but actually fill me up.”Then they were gone too, and we mourned the loss of such delicious snacks.Up close and personal with the seaweed strips!\nPhoto by Chelsie CraigUntil a week later, when a big box of each flavor arrived. People hoarded bags at their desks, smuggled them home, some even went so far as to share them with other people. And so the addiction spread.“I couldn’t stop eating hunks of crispy, flavorful curls—bags and bags and bags,” admitted e-commerce assistant Zoe Sessums. “I snacked on them at work, I snacked on them when cooking, I sometimes even threw them on a soups and scrambles. I knew I needed to cut myself off, so I gave a few bags to a friend. He texted me one day to say, ‘They’re like if pork rinds were a dead plant.’ That kind of perfectly describes them.”Call them the chicharrónes of the sea. Call them algae rinds. Call them whatever you want—just get your own bag. We’re not sharing any more of ours.Buy it: Nora Seaweed Snacks, 3 Flavor Variety Pack (Pack of 12), $40 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitSnackStaff PicksShoppingSeaweedRead MorecultureI'm Obsessed With This Very Specific Yuzu FurikakeBy Rachel KartenshoppingThe New Salty Seaweed Snacks We Can't Stop EatingBy Alyse WhitneycookingWhy Are Kids So Obsessed with Seaweed Snacks?By Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-15", "author": ["Condé Nast", "Alyse Whitney"]}