{"id": "48c118ab1d97d5e784b67ce436617dde", "url": "https://www.bonappetit.com/story/fall-in-love-kansas-city-red-sauce", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How I Got My Booth: Falling in Love at Missouri’s Most Romantic Red Sauce Joint | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I Got My Booth: Falling in Love at Missouri’s Most Romantic Red Sauce JointMeet Laura Hartley Maxey and Scott Maxey, one of many couples who got engaged at V’s Italian Ristorante.By Liz CookApril 16, 2019FacebookTwitterEmailPhoto by Steve PuppeFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.In Independence, Missouri, just ten miles from downtown Kansas City, the Totta family has been entertaining guests at V’s Italiano Ristorante since 1963. It’s a place that’s inspired dozens of couples to get romantic over the years (official restaurant slogan: “Since 1963, a Nice Place to Fall in Love”), and nearly every one of the snuggle-up booths bears a plaque engraved with all the names of people who got engaged at the table. Laura Hartley Maxey, a part-time teacher, and Scott Maxey, a transportation manager in Kansas City, had seen those plaques before. Both were born nearby and grew up eating at V’s with their families. But when they got engaged at the restaurant—getting a plaque of their own—they started a new tradition that bloomed into a multigenerational love story.Get engaged at this table and you too will get a plaque.\nPhoto by Steve PuppeLaura: We met in April of  ’91. I was finishing my student teaching, and he was a naturalist at Burr Oak Woods Nature Center in Blue Springs.Scott: We did school programs, and she brought her second grade class out. We met on the trail and saw a dove on a little tree sitting on eggs. So she wrote and asked me to call her when the eggs hatched to let her know how the birds were doing.Laura: Smart, right?Scott: So I had to call her.Laura: It was literally three days later. Our first date was April 11, and we got engaged here at V’s on June 20.Scott: Our rehearsal dinner was here, too, on October 25. The food here is consistently good.Laura: The Italian rum cake is to die for. My mom gets them for my birthday every year.Scott: When we got engaged, I did a dumb thing. I was excited and couldn’t wait, so I gave her the ring at the beginning of the meal. I reached under the table and held her hand and slipped the ring on her finger. She didn’t hardly eat.Laura: I couldn’t eat! We had talked about getting married, but I was completely surprised. We brought his parents here three days later to tell them, which was going to blindside them, because they had just met me! So, you know, you’re extremely nervous. We went through the appetizer, the salad, the dinner, the rum cake…and I was like [she nudges Scott], When are you going to do it? It was a looong meal.Scott: After we got engaged, we made a point of letting V’s know, and the plaque was on the wall. All we had to do was write our names down and the date.Laura: Of course, we have everyone’s birthdays and graduations here. We have five girls.Scott: They’re all girls.Laura: We had our oldest daughter, Ceanne, in ’93. That summer, I started getting really sick—it turned out I had colon cancer. By the time I started chemo, I had an eight-month-old, and Scott worked three jobs so I could stay home. Our big celebratory party for the end of my chemotherapy was here. And Ceanne had her college graduation party here. My mom’s the emphatic instigator of parties at V’s—any time there’s something big to celebrate, we’re here. And it just continues. Our 16-year-old, Chloe, had homecoming recently, and her date said, “Where do you want to go eat?” “V’s!”Scott: Like, “Duh!”Liz Cook is the restaurant critic for The Pitch in Kansas City.Explore Bon AppétitRestaurantsItalian AmericanRed SauceKansas CityRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Liz Cook"]}