{"id": "48ca34f6e0359a8070f0d0a8c9c1770c", "url": "https://www.bonappetit.com/story/grocery-store-manti", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "These Store-Bought Turkish Dumplings Are Nostalgic (for My Boyfriend) and Easy (for Me) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Store-Bought Turkish Dumplings Are Nostalgic (for My Boyfriend) and Easy (for Me)A bowl of mantı slathered in salty yogurt is the antidote to homesickness.By Devin FullerJuly 20, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve been told more than once that the quality of a bowl of mantı is determined by how many can fit in a soup spoon. This is to say that if you’re making these traditional Turkish dumplings for a Turkish person, they need to be small—ideally hazelnut-size—or you’ll lose their respect at first glance. When I set out to make them for my Turkish person, my boyfriend Can, I had the naive self-confidence of a food professional who tests recipes for work and makes sourdough bread on a regular basis, so I thought I had a fairly good chance of success.It had been well over a year since Can had been able to visit his family in Adana, and I dreamed that making him his favorite childhood dish would alleviate his homesickness. I was familiar with the mantı-making basics: The dough must be rolled as thinly as possible and cut into perfect squares. A spoonful of onion and spiced meat is laid on each square, and each individual piece is folded into impossibly small pyramids. I knew that mantı is notoriously tedious to make and fittingly reserved for holidays, where the entire family gathers around the table to help. In other words, Turkish grandmas are essential, but I was determined.With no Turkish grandma of my own, I watched YouTube videos, read blogs, consulted my Turkish culinary encyclopedia (Musa Dağdeviren’s The Turkish Cookbook), and ignored Can as he told me more than once that my “fun date night activity” was a terrible idea. He was right. Our dumplings were too large yet understuffed, mostly lopsided, and took what can only be described as forever. As we sat down to eat a well-intentioned but mediocre meal at 9 p.m., I bowed my head in defeat.Unwilling to throw in the towel, I turned to the internet for help. I found everything from grandmothers selling their culinary wares on Etsy to dried packaged mantı on Amazon to entire marketplaces dedicated to bringing Turkish foods to homesick expats in the U.S. I tried many, and while most were better than mine, there were two that hit the right combination of nostalgic (for my boyfriend) and easy (for me): beef-filled frozen mantı from Moda and dried vegetarian mantı from Irem, no rolling and cutting and stuffing and folding required.Photo by Emma FishmanShop Mantı:$14 at Amazon (Irem brand)$10 at Select Foods (Moda brand)I’ve since stocked up, and premade mantı has quickly replaced frozen pizza as our go-to meal when we don’t feel like cooking—and a far superior one at that. I simply throw a package into boiling salted water, slather the cooked dumplings with salty, garlicky yogurt and frothy Aleppo pepper-seasoned melted butter, and finish it all with a sprinkling of dried mint and sumac. (Alternatively, check out Refika'nın Mutfağı—“Refikas Kitchen”—for a slightly fancier version. I could spend all day watching her instructional how-to videos on cooking Turkish cuisine.)Though Can won't admit it, I know the Turkish food I cook for him is never quite right. I can rarely find the ingredients of his childhood home, a lush plain about an hour inland from the Mediterranean sea, and I’m just not his mother or grandmother. As delicious as any recipe might turn out—and as happy as it makes us both—there’s still that nagging feeling that it’s not the same. But, when we first tried Moda’s frozen mantı, he had the joyous, eyes-closed moment I had spent so many hours trying to achieve—except this time, it took me all of 20 minutes. What started as an attempt at a special occasion dinner turned into something much better: a simple, weeknight meal that brings a small piece of home to the person I love.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-20", "author": ["Condé Nast", "Devin Fuller"]}