{"id": "48d6758b23b0e9674d0e1f24d97a1d2c", "url": "https://www.bonappetit.com/story/can-you-swap-fish-in-a-recipe", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Can You Actually Swap Fish In a Recipe? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan You Actually Swap Fish In a Recipe?Yes. But you best know the three crucial fish categories.By Emma WartzmanAugust 1, 2019FacebookTwitterEmailFacebookTwitterEmailThere are a lot of fish in the sea. No, we’re not talking about your dating life. We’re talking about real fish. The kind that swim. The kind you eat.So why is it that most people rely on salmon? No shade to our pink-fleshed friend (we love it here, too), but there are so many other types. For the sake of avoiding weeknight dinner fatigue, it’s time to introduce some variety. The best way to go about doing that is to divide fish into three groups and swap within said groups. This is by no means an exhaustive list, but it includes many of the common types you’re likely to run into, most often cut into those large filets you see at the fish counter.Let’s start with the fattiest, most full-flavored fish. That’s where salmon lives, along with arctic char and trout.Next up are the still oily, though slightly-less-so fish. Here we have bass (either sea bass or black bass), snapper, branzino, sea bream, and dorade.Finally, there’s flaky white fish, the least oily of them all. We’re talking cod, haddock, hake, pollock, and halibut. In this recipe for Family-Style Fish Tacos, we don’t even call for a specific one. The choice is in your highly capable hands.Across the board, as long as you stay within those categories, swapping is not only possible, but encouraged. But you need to make sure you start with quality fish. Buying fish is like buying produce: You want it to look and smell fresh, especially if you’re shopping at a grocery store and not at a local fish market where, well, pretty much everything is fresh. The fish should have a bit of a glisten to it and seem plump and firm. Sad fish that’s past its prime will be somewhat matte and dry, sometimes falling apart a bit at the seams. When in doubt, and we’ve talked about this before, frozen is better than previously frozen and then thawed.You can use any flaky white fish for these slow-roasted fish tacos.\nPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolBut trust your gut and use your swapping know-how. If the halibut isn’t looking so hot, try hake. If you’re trying not to break the bank, opt for cod. Just make sure that no matter what, you’re following the recipe instructions for the form the fish comes in, be it skin-on or boneless and skinless, one big piece or several smaller cuts.One more important note: When swapping, slightly different cooking times may apply. Don’t let that freak you out, though. Essentially, you’re cooking to indicators instead of an exact minute. (This is honestly the best way to cook in general, regardless of what you’re making.) When it comes to that flaky white fish, it’s ready when the thickest part begins to flake away in big pieces with a small amount of pressure, and has turned from translucent to opaque.See? Not so difficult—and your dinner routine just got a whole lot more interesting. Now dive right in, switch and swap your fish, and change up your tried and true fish recipes.This seems like a good place to start:Family-Style Fish TacosNo grill, no deep-fryer, no problemo. Our summery tacos rely on our go-to fish-cooking method—slow-roast, baby—for all the flavor without the fuss.View RecipeExplore Bon AppétitFishtechniqueSalmonCodHalibutSea BassRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Emma Wartzman"]}