{"id": "48d97809a1782aa0c930d20b2b70f223", "url": "https://www.bonappetit.com/story/belated-queer-boyhood", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "I Ate Like a Boy to Avoid Being a Queer Man | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Ate Like a Boy to Avoid Being a Queer Man Prolonging childhood allowed me to exist comfortably stunted in the safe margins of straight life.By Logan SchererMarch 9, 2021FacebookTwitterEmailIllustration by Derek AbellaFacebookTwitterEmailOn my 25th birthday, I declared a second adolescence. I ate to be a boy again: half a banana for breakfast, a mini bag of Doritos for lunch, one slice of American cheese for dinner. Whenever I felt faint, I’d chew a piece of candy-flavored gum. I went through packs of Juicy Fruit Starburst and Stride Sour Patch Kids like a chain-smoker. All morning and night, in my adult onesie, I’d maniacally blow sweet magenta bubbles while watching reality shows about middle-aged beauty pageant contestants and Mormon sister wives, counting down the hours to my next slice of American cheese.When I’d moved to Michigan three years prior for grad school, I’d hoped for a different kind of transformation. I came out of the closet at 19 but had been too timid back home on Long Island for a full queer self-awakening. In Ann Arbor, where I knew no one, I should’ve been ready to finally cultivate relationships with other queer people and possibly even find love. Instead, unformed, lost, and in need of comfort and familiarity, I went wildly back in time.I grew up facilitating other kids’ dreams. At recess, I helped girls spin convoluted love plots and basked in their princess fantasies under the monkey bars. My pleasure wasn’t vicarious. I didn’t want the happily-ever-after for myself. I cherished my role as the matchmaker, the mingler, the fun-loving gay sidekick.Back then, when I was an actual boy, I didn’t enjoy eating. The only foods that excited me were grilled cheese sandwiches and french fries dipped in Russian dressing from the diner around the corner from my house, but I’d never finish my plate. More than the typical pickiness of a tween coddled by, and addicted to, the bland cuisine of white American suburbia, I found a twisted pleasure in consuming as little as I could.Always the smallest kid in my grade, and determined not to feel inadequate for my size, I’d learned early on to embrace my tininess. I let boys pick me up and throw me around. I let girls marvel at how much taller they were than me. My smallness became so tied to my identity, I eventually feared growing up.I was Peter Pan, only my pixie dust was Cheez-Doodle powder, my Neverland suburban Michigan.So I decided I’d need to stay the smallest, cutest kid in my class for eternity. Becoming a vegetarian at 19, incidentally the same year I came out of the closet, made it even easier to limit my consumption. I lived off Tofurky slices, pretzels, chocolate soy milk, and Tofutti-slathered mini bagels.I kept my prepubescent physique throughout most of grad school, vowing never to go above a certain number on the scale. Still vegetarian, I began using kiddie treats for meat replacements. The food from my childhood was a balm, a reassuring indulgence I turned to instead of seeking new connection. The nights I could’ve attended the “homo potlucks” hosted by a queer classmate, I opted out and lost myself in Teddy Grahams and Kraft singles. I kept my social circle small and normative, going to Thursday happy hours in straight spaces, where I returned to the sidekick role I knew and loved. With mac ’n’ cheese and infinite variations on nachos at every bar, Ann Arbor was the ideal place to subsist on orange-colored snacks. I was Peter Pan, only my pixie dust was Cheez-Doodle powder, my Neverland suburban Michigan.Prolonging boyhood allowed me to exist comfortably stunted, just as I had as a child, on the margins of straight life. But there was actually a place for my scrawny body in the gay imagination. On Grindr, the twink is a sought-after commodity—an 18- to 22-year-old slim boy-man who will let you do to him whatever you want. I’d unwittingly become my own almost-celibate twist on the twink. I wasn’t actively dating. I lived alone in a tiny apartment that resembled a Gymboree more than a bachelor pad. I ate with the irresistible puckishness of an eight-year-old at a never-ending slumber party—pink and red Starbursts and frozen mozzarella sticks. I was grooming myself to be a boy-man who no one else was allowed to enjoy.Meanwhile, the subject of my own joy was too daunting to even broach. It scared me to think of the vulnerability I’d have to confront to achieve pleasure. Remaining small and boyish wasn’t just easy: It seemed like my only option. As long as I could remember, I’d never been able to envision a future as an adult gay man. I couldn’t think beyond the present, because I had no models for long-term queer happiness.For all my time in the fratty bars of Ann Arbor, I’d managed to build a profound connection with a queer classmate. K felt more like me than anyone I’d ever met. Over my first few years in Michigan, we bonded over our shared pasts as band nerds and our unironic love for the musical Cats. We spoke the same language of withering sarcasm and quiet but unwavering warmth.After turning 26, I moved in with K. We spent a magical year sitting around finishing our dissertations on weird women writers, watching Barefoot Contessa on glorious loops. Far from a sidekick, I was her sister and she was my confidante. I cried to her when my dad had open-heart surgery, told her how lost I felt in navigating my future. I watched her develop a mature romantic relationship with a woman she loved deeply. K cooked for us: lasagna and vodka sauce and brownies and chocolate pudding and cheddar-dill scones. And I let myself eat well. Before leaving Michigan, I’d caught a glimpse of what my life could be.At 33, I live in Brooklyn now, with a generous, nurturing, queer surrogate family. They share with me heavenly lentil soups and cheddar-onion-potato pizzas and vegetable pot pies. Though I don’t cook much myself, I do assemble a hummus sandwich every day for lunch, which I eat with snack-size bags of Cheez-Its. Sometimes I observe the swirls of orange cheddar dust on my still-boyish hands, like a palm reader. I see zigzag paths of intimate friendship. I see cackling parties. I see risks I don’t yet know.Explore Bon AppétitHealthyishSnackessayRead MorecultureWonder Bread, Government Cheese, and the Comfort of My Foster Mom’s KitchenBy Nicole JohnsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-09", "author": ["Condé Nast", "Logan Scherer"]}