{"id": "48e21c7d2d258cbbe35367bc742fe93a", "url": "https://www.bonappetit.com/recipe/egg-and-merguez-wraps", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Egg and Merguez Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueEgg and Merguez WrapsBy Molly BazNovember 20, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIt’s a wrap griddled in sausage fat until the outside is crispy and warm. Need we say more? Just keep the sausage intact at first rather than crumble it into pieces—this helps the meat develop a nice crust.Ingredients4 servings8large eggs1cup plain whole-milk Greek yogurt2Tbsp. fresh lemon juice1garlic clove, finely gratedKosher salt2Tbsp. extra-virgin olive oil1lb. merguez sausage, casings removed4lavash or large flour tortillas½small red onion, halved, thinly sliced4dill pickles, sliced crosswise ¼\" thick3cups mint leavesPreparationStep 1Bring a medium pot of water to a boil. Carefully slip in eggs and cook 8 minutes. Transfer to a bowl of ice water with a slotted spoon; let cool. Peel eggs, then slice each crosswise into 5 pieces.Step 2Meanwhile, mix yogurt, lemon juice, and garlic in a small bowl; season yogurt sauce with salt.Step 3Heat oil in a large skillet over medium-high. Add sausage and press down on it with a wooden spoon or heatproof rubber spatula to flatten; cook, undisturbed, until browned underneath, about 4 minutes. Turn sausage over; break into smaller pieces with spoon. Cook until cooked through and crisp, about 3 minutes. Transfer sausage along with drippings to a medium bowl. Reserve skillet.Step 4Lay out lavash on a work surface. Spread ¼ cup yogurt sauce over each, leaving a 1\" border. Top with sausage, dividing evenly. Top each with 10 egg slices in a single layer, then with red onion, pickles, and mint. Fold in 2 sides of lavash and, starting at an unfolded edge, roll up tightly.Step 5Set reserved skillet over medium heat and cook 2 wraps, undisturbed, until golden brown and starting to crisp underneath, about 2 minutes. Turn over and cook until golden brown and starting to crisp on the other side. Transfer to a cutting board. Repeat with remaining wraps. Cut wraps in half crosswise.Photo by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiHow would you rate Egg and Merguez Wraps?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSO GOOD. The flatbreads I got from Trader Joe's were a tad too tiny to roll but they were still great as tacos nonetheless. Will definitely recreate this with all kinds of different sausages, the formula is spot on, and if you already have hard-boiled eggs in the fridge for the week, even easier. alexbeggsBA.com 12/14/2018Explore Bon AppétitWrapSandwichBurritoEggSausageMeatEasyFryBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Molly Baz"]}