{"id": "48e2436a864948ef822741e3209cdeeb", "url": "https://www.bonappetit.com/recipe/lobster-refreshed-with-coffee-and-lime", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Lobster Refreshed with Coffee and Lime Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDLobster Refreshed with Coffee and LimeSponsored by NespressoFacebookPinterestTwitterEmailCAVANAUGH2 servingsLobster in a zesty, savory sauce gets a high-intensity kick with Nespresso Variations Paris Exotic Macaron coffee in this recipe from chef Daniel Rose.PrintIngredients1 lobsterFor the sauce:1 Tbsp. honeyZest of lime2 Tbsp. lime juice¼ cup brewed and chilled Nespresso Variations Paris Exotic Macaron coffee2 Tbsp. arbequina olive oil (green fruit profile)Recipe PreparationWhisk the all the ingredients for the sauce in a small bowl and set aside.Bring a large pot of heavily salted water to a boil. Separate the claws from the body of the lobster.Boil the body and tail section for 3 minutes and the claws for 5 minutes. Transfer the lobster to a bowl with ice water. Shell the lobster, transferring the meat to a tray.Prepare a charcoal grill. Gently season the lobster with salt. Grill the lobster for only 1-2 minutes, just until the edges are slightly charred. Transfer to a tray or plate and let cool.Slice the lobster tail into pieces. Place all the lobster meat on a serving plate and drizzle with the reserved sauce. Garnish with extra lime zest and freshly ground pepper.Recipe by chef Daniel RoseSponsored by NespressoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}