{"id": "48f22f72ec24f48b9a914edb843046a4", "url": "https://www.bonappetit.com/story/nyc-mutual-aid", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "These Brooklyn Mutual Aid Groups Are Charting a Future for Food Justice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhere Does Mutual Aid Go From Here?Twenty months into the pandemic, mutual aid networks are tackling a decline in funding and interest.By Isle McElroyDecember 17, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailIn January 2021, 10 months after the pandemic effectively shut down New York City, I signed up to pack groceries for Equality for Flatbush’s Brooklyn Shows Love (BKSL), a mutual aid project offering free groceries to Brooklyn residents affected by the pandemic. On a chilly weekday afternoon, I rang the buzzer at a nondescript storefront and waited for Imani Henry, the director of Equality for Flatbush, to let me inside.Within the distribution center, rows of industrial shelving units jutted out from a pair of white walls. Henry, who is also an artist and writer, played an obscure Spotify mix over wireless speakers. Nonperishable groceries as well as cleaning and feminine hygiene products loaded the shelves. The majority of BKSL grocery recipients were people with Caribbean heritage; when packing canned vegetables, Henry reminded me to include callaloo or candied yams—instead of generic options like green beans or peas. There was no point giving people food they weren’t excited to eat.My first day at the distribution center, it took nearly an hour to pack a grocery kit from start to finish: methodically filling carts before transferring food to a table, sanitizing each item, placing them into canvas bags light enough for community members to haul up their stairs. During my final shift in October, however, I finished each kit in less than 15 minutes. This isn’t because I’ve become an expert at packing; rather, over the past year, a combination of rising food prices and fleeting financial support have forced the Brooklyn Shows Love Mutual Aid Project to close. The full shelves I encountered on that first day are now nearly barren. At the end of October, BKSL delivered its final grocery kit.It’s not just the Brooklyn Shows Love Project that’s been struggling. Two prominent mutual aid groups in Brooklyn, Bed-Stuy Strong and Crown Heights Mutual Aid, went on hiatus over the summer. These projects did not pause because the community no longer needs aid. In September, BKSL grocery requests were especially high—the backlog ran about five to six weeks. In fact, the federal government’s recent decision to lapse enhanced unemployment benefits means that even more people will likely need assistance over the coming months.Twenty months into the pandemic, mutual aid groups have been suffering from a decline in funding and interest. People who lost or quit their jobs have since returned to work and had less time to volunteer; those who still haven’t regained their jobs can no longer budget for financial assistance. Compassion fatigue has set in. The many feel-good stories and op-eds about mutual aid networks that emerged in the early days of the pandemic seem stale now. The pandemic is no longer a temporary crisis but a way of life, and sustaining financial and volunteer support beyond the start of the crisis can be a tough sell in America. We are, perhaps, in the midst of a true test of Americans’ commitment to our neighbors. How will we act when aid efforts lose their novelty? What does sustained assistance look like long after a crisis first appears?In Brooklyn, mutual aid networks are trying to chart a path for the future that the rest of the country might be able to follow. Bed-Stuy Strong, a mutual aid group founded in March 2020, has shifted its focus away from home food delivery to other models of assistance, and they recently hosted a Winter Free Market to give away “groceries, holiday food, coats, winter gear, hygiene items, and baby essentials.” Other mutual aid groups have taken a similar approach over the 20 months, attempting to establish lasting networks of support.Photography by Isa ZapataAnna Moccia-Field, a global public health strategist and member at Clinton Hill Fort Greene Mutual Aid (CHFGMA), says the group has sustained its reach in the community even as funding diminished. Moccia-Field credits community organizations that emerged after Hurricane Sandy for creating the infrastructure many mutual aid groups founded in the pandemic relied on. The “make a request, respond to a request” online format, in which community members were able to easily ask for assistance, was already in place, for instance. Building off of those established networks was vital for the early success of CHFGMA. Today, the group continues to offer financial assistance for grocery shopping—$50 for one person, $100 for families. They have relied on fundings through recurring monthly donations from members of the Clinton Hill and Fort Greene community, rather than the bursts of assistance that may arrive after crises.Elsewhere in New York City, established food justice organizations are navigating how best to continue activism that began long before the pandemic. Kimberly Chou Tsun An, a collective member of the food activism group FIG, which started in 2014 as a sustainability study group for chefs and food business leaders, says that throughout the pandemic, FIG relied on its network of chefs and restaurant owners to expand into grocery assistance for New Yorkers in need. It partnered with Colectivo Intercultural TRANSgrediendo, a trans-run collective based in Queens, and worked out of restaurants run by collective members to create a grocery distribution initiative across New York.In order to maintain its long-term operations, FIG has instituted strategic breaks from outward-facing work, which Chou Tsun An refers to as “chrysalises.” Collective members use this time to reflect on past work and strategize how to make the most meaningful impact in the future. Chou Tsun An doesn’t believe in the demand to be constantly working. She says the organization survived throughout the pandemic, a time when many members struggled with their own restaurants, because they took moments to study how FIG can continue its influence once things return to something like normal.Some mutual aid events are returning—while mindful of the city’s safety guidelines, of course. The mutual aid group Food With Fam recently hosted a food distribution event outside Locals BKNY in Fort Greene. The previous night, they’d held a gratitude dinner featuring seared scallops and whole branzino for its volunteers. Unlike other mutual aid groups, which tend to focus on select neighborhoods, Food With Fam holds distributions across the five boroughs. They go where they’re needed.I arrived at Locals BKNY two hours before the distribution was set to begin at 2 p.m. They planned to set up on the sidewalk in front of Locals, but a COVID vaccination bus had beaten them to the spot, so they moved to the median across the street. On a pair of white folding tables, they set out boxes of fresh carrots, onions, sweet potatoes, thyme, pears, eggs, spinach, and beans. A half hour before the event, a line had already formed.Photography by Isa ZapataMany people in line hadn’t known about the distribution until they stumbled upon it. Kaylan Gray, a self-taught baker and mother of two, has periodically relied on food assistance from mutual aid groups to help her family throughout the pandemic. The first time she received groceries, she cried. Before that, she “didn’t think anyone cared about people like me,” she told me as we stood in line. Charmaine Breckette, a hair stylist, told me that, although it was her first time at a Food With Fam event, she sometimes received similar forms of grocery assistance two times a week. Most of the people I spoke to that afternoon lived in the neighborhood; they included retirees, childcare workers, college students. Talking to them reminded me of making grocery calls back in January for Brooklyn Shows Love. The calls were often monotonous—I read from a list of items, marked yes or no regarding the recipient’s request—but at the end, also deeply personal, when the community member thanked us or mentioned how grateful they were for the groceries.By 3 p.m., the team had given away all food and had started breaking down boxes and folding up tables. The event didn't have a set end time—“til food runs out,” the flyers said—and a person passing this corner after the hour, a person no less in need of groceries than anyone else who had waited in line, would never have known this giveaway happened. This is not an indictment of Food With Fam; it’s an indictment of various levels of governments for failing to provide its people the assistance they need to lead healthy and dignified lives. People shouldn’t have to be in the right place at the right time to have their basic needs met—but that is, too often, the grim reality of life in America.This reality—which long predates the pandemic—is what has made mutual aid so vital in the first place. In the absence of public-sector support and safety nets, community members have often taken it upon themselves to help each other. These projects are created by neighbors for neighbors, and they allow those who give aid to also receive aid, and vice versa.Andrew Ceneus, a founding member of Food With Fam, told me the group is currently trying to rebuild sustainable food practices—like CSAs and composting—that were wiped out of New York neighborhoods by food apartheid. The eventual goal “is to get a space where we could do consistent hot meals and consistent distributions,” he says. “A place for folks to come do community activities and community think tanks, not only about food, but in all types of ways to elevate our neighborhoods.” Mutual aid networks might no longer prominently feature in media and everyday conversations—where they play into America’s beloved narratives of heartwarming stories papering over the state’s failure to adequately care for its citizens, as Jia Tolentino has put it. But the flexibility and perseverance of food justice and direct action organizations in New York are great reminders that even in the continued absence of systemic support, many are not waiting for the next crisis to arise. They are, instead, already reaching out a hand.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-17", "author": ["Condé Nast", "Isle Mcelroy"]}