{"id": "48f3b5d9b2541ec28e6e58218abb2fe9", "url": "https://www.bonappetit.com/recipe/tea-totalers-toddy", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Hot Toddy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueTea-Totaler’s ToddyBy Anna Stockwell and Sohla El-WayllyNovember 19, 20194.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintNo booze required for this soothing green tea toddy. But if you do want an extra dose of warmth, we like this with smoky mezcal.Ingredients10–12 servings6jasmine green tea bags¾cup honey12sprigs mint, divided6lemons, divided12oz. mezcal (optional)PreparationStep 1Bring 3 quarts water to a boil in a medium pot. Remove from heat and add tea bags, honey, and 6 mint sprigs. Cover and let sit 8 minutes. Using a slotted spoon, remove tea bags and mint, gently pressing with a spoon to extract as much liquid as possible.Step 2Meanwhile, slice 4 lemons in half and squeeze juice into a small bowl. Slice remaining 2 lemons into rounds; remove seeds. Add lemon juice, lemon slices, and remaining 6 mint sprigs to hot toddy. Ladle into mugs and spike with 1 oz. mezcal if desired.How would you rate Tea-Totaler’s Toddy?Leave a ReviewTell us what you thinkExplore Bon AppétitHot DrinkDrinks AllCocktailGreen TeaAlcohol & Other DrinksMintHerbs & SpicesLemonCitrusFruitMezcalWinterFallDrinksVegetarianNut-FreeDairy-FreeGluten-FreeNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Anna Stockwell", "Sohla El-Waylly"]}