{"id": "48f4cfb21e90a444f37794950e6a074b", "url": "https://www.bonappetit.com/story/chai-tea-sadef", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "This Is the Only Chai Tea I'll Ever Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Only Chai Tea I'll Ever DrinkThe chai tea I grew up on is nothing like the milky, cinnamon-y stuff you find at most cafes.By Elaheh NozariFebruary 22, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailMy first month of college is a blur of water bottles filled with bottom-shelf vodka and Crystal Light, awkward group projects, and unlimited access to the dining hall, but I vividly remember the moment I found out what chai tea was.A friend and I were taking a study break at the campus coffee shop when she ordered it. I was taken aback—I had never seen anyone who wasn't Iranian drink chai, or order it in a coffee shop, and if my new friend at this small college in the middle of upstate New York had just ordered the tea I grew up drinking, we were destined to be best friends. She offered me the first sip, as best friends do, so I did, then I spit it all over the counter. Guys, this was not my understanding of what chai was.\"Chai\" means \"tea\" in Farsi, and until that formative moment in college, I thought it solely referred to one particular brand of Persian tea: Sadaf. I grew up in New Jersey, where the lack of a Persian community meant my family had to procure our Middle Eastern staples from Toronto and the Bay Area, two places where a) we have family and b) there are enough Iranians to warrant grocery stores that don't have dedicated \"Exotic Food\" aisles. One such staple, perhaps more so than the saffron my mom uses to make her experimental \"saffron chicken\" and the dried limes for the beef-and-kidney bean stew known as gormeh sabzi, is Sadaf tea.My parents always buy two types of Sadaf tea, Earl Grey and Cardamom, which they combine in a single tin because, as my dad says, the Earl Grey gives the aroma and the cardamom brings the flavor. They no longer have to stuff their suitcases with the green and maroon boxes because, like most things in the world, it's sold on Amazon, which means I too can order the tea straight to my apartment. I do as my parents and combine the two types—I find the flavor of cardamom too strong on its own (something about it reminds me of fennel), and the citrusy bergamot of Earl Grey balances it out. Because I like to combine the flavors, I buy individual boxes of loose tea, but you can also get them in tea bag form.There's no set time for how long the tea should brew, though my grandmother used to say that, if you can see your reflection in a cup of tea, it's too strong. I brew the tea in a pot, then pour it into a mug until half-full (that's usually when I start seeing my reflection), then I add hot water. A cup of that, usually unsweetened but sometimes with a sugar cube if I'm feeling really Persian, is what I've always understood to be chai—not the milky, gingery, cinnamon blend my friend ordered, which, though good, is not the drink that gives me the comfort of home.Buy Sadaf Tea Earl Gray Flavor ($16) and Cardamom Flavor ($18) on AmazonExplore Bon AppétitShoppingRead MoreshoppingThe Only Tea Bag For Loose-Leaf Tea LoversBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Elaheh Nozari"]}