{"id": "4918cbd74bc4c80b9e3838413c8eb00e", "url": "https://www.bonappetit.com/story/guide-to-your-best-pie-yet", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "How to Make the Best Pie Dough, According to a Pie Dough Expert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Pastry Chef’s Extremely Detailed Guide to Your Best Pie EverMelissa Weller has all the tricks up her sleeve. By Melissa WellerNovember 17, 2020FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen Kaminski FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There is a lot of subtlety that goes into making a good pie crust, the types of intuitive moves or small tips that you learn in a professional kitchen (or by baking with an experienced relative).Below, as well as in my book A Good Bake, I have attempted to address all of those points—from making the pie dough to baking it to perfection—so that you can apply them to make delicious and professional-looking pies, no matter what recipe you’re following.Here’s your step-by-step guide:1. Plan ahead.In a professional bakery, pie dough is prepared up to several days in advance. I suggest you set yourself up the same way at home. Making the dough in advance gives the gluten time to relax, which prevents shrinkage in the crust when baked. It also ensures that the dough is properly chilled. Chilled dough with relaxed gluten will simply be easier to roll out. Also, it’s convenient to have the dough chilled and ready to roll when you go to make your pie. You can make pie dough up to one month in advance; wrap it well, store it in the freezer, and defrost in the fridge the night before you plan to use it.2. Start with great pie dough.A pie is only as good as its crust. I use a few different recipes for pie crust, but my basic pie dough recipe is pâte brisée. Brisée means “broken” in French, and in this dough, the butter is “broken” into the dough, creating a layered, flaky crust. Pâte sucrée, by contrast, means “sugar dough.” It contains sugar and egg and is prepared like a cookie dough, with the butter and sugar creamed together.3. Choose between butter and lard.The essential ingredients in pie dough are flour, water, a pinch of salt, maybe a very small amount of sugar, and some fat. Many traditional American pie dough recipes call for lard, which is rendered pork fat and makes for a flakier crust. Lard became taboo because of health trends, although it’s currently making a comeback. I love it, but quality lard is not always easy to find, so I use good old-fashioned butter to make my pie and tart crusts. As long as you’re using the best technique to make you pie dough, you can achieve just as much flakiness and get that great buttery flavor.4. Make sure your chunks of butter are big and cold.Many pie recipes call for you to cut the butter into ¼\" cubes. Instead, I start with sticks of butter and cut them into largish ½\" chunks. After cutting the butter, I place the chunks on a plate and put them in the freezer for 10 minutes so the butter gets as cold as can be without freezing. I like to start with these larger pieces because when they are mixed in with the flour, some big chunks remain. When the dough is rolled out, those chunks form striations of butter in the dough, and when baked, the water in the butter evaporates, resulting in microscopic flaky layers—and a light, tender, flaky crust.5. Use cold water.Lots of recipes will call for you to add ice water to the dough. I find that cold water from my refrigerator works fine. Since I make sure that the butter is very cold, I don’t think it is necessary to add ice-cold water. That said, if you want to use super-chilled water, it certainly won’t hurt.It’s important to understand why water is added only after the flour and butter are mixed: When the water joins the party, gluten starts to form. Gluten toughens the dough, making the finished crust heavy and solid rather than light and flakey. But by mixing the flour with cold butter before you add the water, the butter coats the proteins in the flour, thereby impeding the interaction between the water and the flour and reducing gluten development.6. Don’t overmix.Even if you’re tempted to mix it until it completely comes together, like cookie dough, resist. Mix it only until the dough begins to come but not all the way. When you transfer the dough to the counter, it should still be a bit crumbly and shaggy, with small, observable chunks of butter. Dry bits will hydrate in the fridge and come together when you roll out the dough.7. Let the dough rest.After bringing the dough together, I shape it into a round disk or brick, depending on the shape I will be rolling it out to. Then I wrap it in plastic wrap and run a rolling pin over the dough to flatten it out before putting it in the refrigerator to rest.It’s important to let pie dough rest before rolling it out. By giving the dough a good rest, the flour is able to fully absorb the water so that the dough can come together completely. Resting the dough also allows the glutens to relax, which, as I mentioned earlier, makes it easier to roll out and less likely to shrink in the oven.8. Roll out the dough with confidence and SPEED.Take the dough out of the refrigerator, put it on your counter, and let it sit until it feels pliable but still firm, 10 to 15 minutes, before rolling it out. The goal is for the dough to be just pliable enough to roll but not so soft that it starts to stick.In the meantime, make space and have your rolling pin ready, as well as anything else you might need, such as a bench knife, cookie cutter, straightedge, pastry wheel, knife, and flour (or in some cases sugar) for dusting your work surface. Whatever is going to happen with the dough after it is rolled, make sure that is ready, too, whether it is a baking sheet lined with parchment paper, or a pie plate or pan that you’ll be lining with dough. You don’t want to be lining a baking sheet with parchment paper, or washing and drying a pie plate, while your rolled-out dough is warming up on the counter.Once you start rolling, move quickly: Even the firmest block of dough is going to start to feel very soft very quickly because it warms up from the friction of the rolling pin and the heat of your hands So just focus and roll. The whole process shouldn’t take more than a minute or two.9. Butter the pie plate.It may be unconventional, but I always butter the pie plate before lining it with dough. The butter helps the dough to adhere to the pan. I smear on enough butter that it is a visible layer on the pie plate. I usually use cold butter for this, but slightly softened also works.10. Shuttle the dough into the pie plate or pan.To “line” a pie plate—that is, to make sure the dough is snugly inside—the first thing you have to do is lift the dough off the surface you rolled it on and place it on the pie plate (or tart pan). There are two ways to do this. You can fold the dough in half and carry it over. Or you can roll the dough onto your rolling pin and carry it over on the pin. I fold the dough if I am lining a round pie plate and roll the dough onto a rolling pin if I am using a jelly roll pan, which requires a larger piece. Use whatever method you find easiest. In either case, carry the dough until it is hovering over the pie plate, tart pan, or jelly roll pan, centering it as much as you can. Then gently drop it onto the pie plate or pan and unfold or unroll it. Adjust the dough so that it’s centered on the pan.11. Line the pie plate or pan.Gently lift the dough with one hand and use your other hand to press it into the pan, working your way around the perimeter. Do this with a delicate touch, and resist pulling the dough, which will cause it to spring back when baked and create thin spots in the crust. Next, gently run your finger along the rim of the pie plate, tart pan, or jelly roll pan to press the dough onto it, just enough to ensure it adheres. This allows you to see how much dough is overhanging. Make sure it is even all the way around and sitting nicely on top of the rim.12. Trim the excess.Use kitchen shears to trim the overhanging dough so there is an even 1\" hanging over the perimeter of the pie plate, tart pan, or jelly roll pan. (Discard the trimmings or smush them together into a disk and refrigerate or freeze the dough to make a pie another day.) If you are making a two-crust or lattice-topped pie, trim the top sheet of dough or lattice so it is flush with the outside edge of the pie plate or jelly roll pan.Quite the crimp on this strawberry-rhubarb number.\nLaura Murray13. Crimp the crust.In piemaking, “crimping” refers to forming the decorative, wavy, crimped edge around the perimeter of a pie. To crimp a pie, first, tightly roll the overhanging dough toward the center of the pie to create a thick lip that rests on the ridge of the plate. If this sounds a little different than what you normally do, you’re right: While lots of recipes call for the excess dough to be folded under, I prefer for it to be folded over, toward the center. When you’re finished, the dough shouldn’t hang over the rim.And the process is the same whether you are making a one- or two-crust pie. For a two-crust pie, you will be rolling the bottom crust over the top crust, thereby sealing the pie closed.As you work your way around the pie and roll the dough over itself to form this edge, use your fingers to shape the edge of the roll so that it is rounded and even. Once you have rolled the entire edge of the pie, place the index finger and thumb of one hand on the edge of the pie and push the index finger of your other hand between those fingers toward the center of the pie to form a V or U shape. Continue around the perimeter of the pie until you have crimped the entire crust.14. Chill the pie. Freeze it, even.There is a lot of chilling when you’re making pie. First, you chill the butter. Then you chill the finished dough before rolling it out. And you’ll also want to chill the pie plate or pan after you’ve lined it with pie dough and again after you’ve crimped it and filled it, just before baking. Chilling the pie after it’s been formed helps it hold its shape better during baking. If you’ve ever wondered why pies in professional bakeries look so much prettier than homemade ones often do, it’s because they are chilled or even frozen before baking.In my kitchens, we often freeze a fruit pie (overnight is best), and bake it directly from frozen. To bake a frozen pie, put it directly in the oven from the freezer and add 10 to 20 minutes to the total baking time, using the visual indicators for doneness in the recipe.15. Don’t skimp on the bake time.With all pies, it’s really important that they bake for enough time. Depending on how cold the pie is when you put it into the oven, and depending on your oven, the baking time might vary, so it’s important to look for visual cues for doneness. The crust needs to be a rich shade of golden brown. For a fruit pie, the filling must be bubbling through the lattice in the center of the pie or the hole in the top. If the filling is not bubbling in the center (not just around the sides of the pie), that means the fruit hasn’t cooked down enough. If you were to take the pie out at this point, you would end up with a pie with too much liquid that weeps when you cut a slice. Custard pies need to be baked until they are set. A set pie will move slightly when you jiggle the pan, but it won’t slosh around like liquid. You want to avoid baking custard-baked pies for so long that they crack on top, but sometimes this is inevitable.Always put a baking sheet under pies before baking. This is particularly important with fruit pies, as this way, the bubbling fruit won’t bubble over the edge of the pan onto your oven floor.16. And blind bake when you need to.Also called pre- or par-baking, blind baking refers to baking the crust before adding the filling. For custard-baked pies, the crust is blind baked before adding the filling, which prevents it from being under-baked and soggy. You will also blind bake the crust for pies or tarts whose fillings are not baked at all, or when the filling takes less time to cook than the crust takes to brown. To blind bake a crust, you line the shaped, unbaked crust with parchment paper and then weigh it down with pie weights (ceramic beads sold for this purpose) to keep the crust from puffing up when baked. Dried beans can also be used as pie weights; just make sure to label them as “pie weights” when you’re done with them, as they will not be good for cooking once they’ve been baked.The crust for a pumpkin pie needs to be blind-baked to prevent the dreaded sog.\n17. Resist the urge to dig in right away.Even if you’re tempted to slice and serve, heed the recipe’s instructions, and take cooling time into account when you’re mapping out how many hours in advance you need to bake. Custard pieces need to set (and, sometimes, to chill in the fridge) and fruit pies need to gel and firm. For beautiful slices that hold their shape, the wait is worthwhile.Buy the book:A Good Bake: The Art and Science of Making Perfect Pastries, Cakes, Cookies, Pies, and Breads at Home by Melissa Weller and Carolyn Carreno$38 at Amazon$37 at BookshopFrom A Good Bake: The Art and Science of Making Perfect Pastries, Cakes, Cookies, Pies, and Breads at Home by Melissa Weller. Copyright © 2020 by Melissa Weller. Excerpted by permission of Alfred A. Knopf, a division of Penguin Random House LLC. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher.Explore Bon AppétitPieBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Melissa Weller"]}