{"id": "491ba938855f4078bc1cd30fa77d7ac6", "url": "https://www.bonappetit.com/story/this-shallow-bowl-is-the-ideal-vessel", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "This Shallow Bowl Is the Ideal Vessel for Every Food I Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Shallow Bowl Is the Ideal Vessel for Every Food I EatMorning oatmeal, late-night ice cream, and everything in between.By Aliza AbarbanelFebruary 19, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI will never be a minimalist. Not that I'm a hoarder, mind you, but catching a glimpse of a tortoiseshell fork or a fluffy teddybear coat lights up my brain like a pinball machine. Nice things are nice, and now that Instagram mainlines e-commerce ephemera into my brain, nice things are everywhere. To set some boundaries, I've been allowing myself to buy just one beautiful (and affordable, because I'm not a millionaire) version of all the nice things I covet. And that's why I have a house bowl.A house bowl works for every eating occasion, from morning oatmeal to late-night ice cream. Mine is from Hasami Porcelain, a Japanese ceramic line helmed by creative director Takuhiro Shinomoto that draws from the Hasami district’s longstanding pottery tradition to marry form and function. The brand’s clear craftsmanship and relatively affordable pricing has made it a mainstay at NYC restaurants like Davelle and Takumen—and my kitchen too.When I saw the shallow glazed bowl on Need Supply (my go-to site for lucite hoops and ceramic mugs alike), I clicked. I’ve had my fair share of failed online purchases (see: shockingly uncomfortable sneakers, way too oversized jeans), but this bowl lived up to the product photos. The blue glaze is rich and glossy, the earthenware exterior is pleasantly matte. Of course, there are other things to love.Sticky tahini easily wipes off the porcelain glaze, which is a blessing, because I don’t have a dishwasher. (For the record, this bowl is dishwasher safe, and microwave safe too.) It’s durable enough for daily use—I’ll admit to dropping it more than once, and while my heart fell into my stomach every time, the surface never scratched. (If only I could say that about my phone.)Best of all, the shallow 7 ⅓ inch mouth is practically plate-sized. I’ve used it for lentil soups, kimchi udon, and too many servings of crispy tofu over rice to count. Most often, however, it’s filled with a hodgepodge of things that collectively can only be described as “bowl food.” A pint container of frozen beans might be excavated from the back of the freezer, sizzled in a pan with an enthusiastic shake of red pepper flakes, and served with sautéed kale and sliced avocado. Or I’ll quickly cook some grains and pile on all the leftovers my fridge holds.Hand-painted terracotta plates are gorgeous, but there’s a quiet sense of satisfaction in using the same bowl day after day. It’s one less decision to make, and one less plate to wash. Of course, that extra bit of free time means I'll probably end up back online, searching for the perfect thing to hang over the kitchen table. Is there such a thing as a house disco ball? It just feels right.Buy it: Hasami Porcelain Round Bowl, Gloss Blue, $36.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishCeramicsShoppingRead Moreshopping4 Ceramic Dishes We're Putting Everything in Right NowGallery4 SlidesBy Zoë SessumsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-19", "author": ["Condé Nast", "Aliza Abarbanel"]}