{"id": "4926e8a4f73e2cbbb0c3182a926aaa82", "url": "https://www.bonappetit.com/recipe/tomato-fried-rice", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Tomato Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueTomato Fried RiceBy Heidi SwansonAugust 13, 20194.3(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintA handful of the tomatoes are cooked with scallions in the rice, while the rest are served on top. But the secret is generously salting the sliced tomatoes before cooking—it concentrates all that tomato flavor and lets out some of the liquid. We have Heidi Swanson, the author of 101 Cookbooks, to thank for this lightning-fast weeknight dinner recipe.Ingredients4 servings4scallions1lb. cherry and/or grape tomatoes of any and all colorsKosher salt2Tbsp. toasted sesame oil, divided3garlic cloves, finely grated1½tsp. finely grated peeled ginger2½cups chilled cooked long-grain white or brown rice3large eggs, beaten to blend1Tbsp. soy sauceExtra-virgin olive oil (for drizzling)Crushed red pepper flakes (for serving; optional)½lemonPreparationStep 1Trim dark green tops from scallions and thinly slice; set aside. Thinly slice white and pale green parts; set aside separately. Quarter any larger tomatoes and halve any small ones. Place about one-quarter of tomatoes in a small bowl; season generously with salt and toss to combine. Set aside.Step 2Heat 1 Tbsp. sesame oil in a large skillet over medium-high. Add reserved white and pale green parts of scallions and remaining three-quarters of tomatoes and cook, stirring occasionally, until softened and any liquid from tomatoes has evaporated, about 4 minutes. Mix in garlic and ginger; cook, stirring constantly, until fragrant, about 30 seconds. Add rice and stir to separate grains. Cook just to heat rice through, about 3 minutes.Step 3Scoot vegetables and rice to 1 side of skillet, then pour half of remaining sesame oil into pan. Add eggs and cook, stirring often, until just set, about 1 minute. Mix into vegetables and rice, then drizzle in soy sauce and cook, stirring, just until well combined.Step 4Transfer fried rice to a large bowl or platter. Drain salted tomatoes, drizzle with olive oil, and spoon over rice. Sprinkle with reserved scallion tops and red pepper flakes (if using) and drizzle with remaining sesame oil. Finely grate zest from lemon over.How would you rate Tomato Fried Rice?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI have to agree with Anonymous from Fort Worth...this was certainly nothing special. I had really high hopes for a bright, tomato-y succulent fried rice, but all I got was an ok dish. (And I know how to season properly, that wasn't it). I also added in some dark soy sauce for color and flavor which did little to help the dish out in the end.\nAll in all, my vegan partner (minus the egg for him) liked it well enough and it was easy to make, but I don't think I'll make it again.Sarah A.Rosslyn, VA5/26/2021This was great! It tasted really light and fresh, and highlighted the tomatoes really well. I had to add some salt to the dish after the fact, so be sure to taste it after you add the soy sauce while it’s still in the pan to see if you want to add more. Otherwise this was a great, easy, delicious recipe.soapnanaChicago9/21/2019This was okay. Served it alongside some steamed green beans and carrots. It was an easy, healthy vegetarian dinner, but not one to write home about. AnonymousFort Worth 9/8/2019I sauteed some chopped bacon and added it at the end.  Also I always put in handful of chopped cilantro in my fried rice.The lemon zest is brilliant. Maybe some chopped celery would give it some crunch. Great way to use cherry tomatoes that are past salad worthy.AnonymousGlendora,  California 9/3/2019This was great! Definitely adding to my dinner rotation!PrinceGanymedeBoston, MA8/20/2019Explore Bon AppétitFried RiceRiceRice & GrainsCherry TomatoTomatoVegetableGrape TomatoSummerQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeVegetarianHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Heidi Swanson"]}