{"id": "4944679d2cb061035ee882ff21fd51e4", "url": "https://www.bonappetit.com/story/vegetarian-chicken-soup", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "This Vegetarian Chicken Soup Recipe Is Everything I Love About Chicken Soup, Minus the Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Recipe Is Everything I Love About Chicken Soup, Minus the MeatI never thought a veg broth could live up to a chicken one—I was wrong.By Sarah JampelApril 20, 2020FacebookTwitterEmailPhoto by Sarah JampelFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.If I were ever to go on a meat bender, I have a mental list of what I’d eat first. (Maybe that’s weird, but is it really so different from keeping a rolodex of celebrity crushes? Not going to happen but fun to imagine?) It’s a short list, really: lobster, duck (it just gets so crispy), chorizo, and chicken. Chicken soup, in particular. As a vegetarian, I feel like I’m missing out every time I smell it. (And if you’re like, “Sarah, why don’t you just eat the chicken soup already?” I respect the question but feel like it’s a topic for another article.)There are few vegetable broths that can achieve that same depth of flavor and body as chicken soup, but this recipe does. In 15 minutes, I’ve got a rich, savory, totally chickenless but chickenesque broth that makes me forget those swampy vegetable brews of the past.Related: The Case for Quitting Meat with Sarah Jampel and Chrissy TraceyContentThis content can also be viewed on the site it originates from.It starts with softening onions in olive oil, then grating in garlic and adding a dollop of miso paste. By smashing the miso paste down into the fat and cooking it until it starts to darken and stick to the bottom of the pan, you’ll draw out moisture, caramelize the sugars, and intensify the flavors, just like you would tomato paste.But now comes the real kicker: steeped nutritional yeast, the idea for which came from the brilliant Andrea Nguyen’s vegan pho. To capture the cheesy, nutty, saltiness of nutritional yeast without making the soup sludgy or gritty, you’ll pour hot water over the nooch, let its flavors permeate the liquid, then pour off the golden top, leaving behind the thick sediment.You can stop here and use the broth as is—it really is good enough to sip and will accommodate any vegetables, beans, or grains you throw at (in?) it. But I encourage you to make the second component of this recipe, too. Inspired by the South Asian dish dharan ji kadhi, chickpea flour fritters stewed in tomato sauce, the dumplings are a simple mixture of chickpea flour (a.k.a. besan), yogurt, and herbs. When simmered in the broth, they puff dramatically, becoming tender but still toothsome, not far from a matzo ball. If you don’t have chickpea flour, you could make matzo balls (am I crazy?). If you don’t have matzo meal, you could make the dumplings from Rick Martinez’s Chicken and Dumplings. Or you could skip the dumplings entirely and add frozen peas and noodles. It’s your game!Yes, maybe I’ll still get a sparkle in my eye when I catch a whiff of chicken stock bubbling on the stove. But now that I have this recipe in my arsenal, I can safely say the meat bender has been delayed for many years in the future.Get the recipe:Chickpeas and DumplingsThis recipe gives off major chicken-soup vibes but is entirely vegetarian—and you don’t have to simmer vegetables or cheese rinds for hours to get there. The lightning-fast broth gets its flavor from caramelized miso and nutritional yeast (a trick we picked up from Bay Area cookbook author and food writer Andrea Nguyen). The gluten-free dumplings are soft on the outside and pleasantly chewy on the inside. View RecipeExplore Bon AppétitThe Not Depressing VegetarianHealthyishRead MorecookingMake a Whole Galette For Yourself Because You’re Worth ItBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Sarah Jampel"]}