{"id": "494efb7ccafec93adbb7d48c60cfc5a1", "url": "https://www.bonappetit.com/story/risotto-whipped-cream", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Want Ultra Creamy Risotto? Try This Delightful, Surprising Trick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesA Delightful, Surprising Trick for Ultra Creamy RisottoRisotto should always be this luxurious.By Sarah JampelSeptember 11, 2018FacebookTwitterEmailPHOTO BY CHELSEA KYLE, FOOD STYLING BY KAT BOYTSOVAFacebookTwitterEmailWhen risotto is good, it’s creamy and satiny,  simultaneously light (like, you could eat three bowls-worth...) and rich (...though you probably would regret it).But when risotto is bad—and this, I admit, is why I often avoid making it at home—it’s clumpy and gloppy, which is especially disappointing after all of the time, stock, and stirring you’ve put into it.That’s why I was excited to learn this trick to make plush, restaurant-level risotto in Emily Weinstein’s corn risotto recipe from The New York Times: Before you take the risotto to the table, fold in whipped cream as your last step. (In Weinstein’s recipe, that’s ½ cup of heavy cream whipped to stiff peaks per 1 cup of arborio rice.) Sure, whipped cream won’t save a gluey or gummy risotto (hey, there’s always arancini), but it will make good risotto even better. In the corn risotto recipe, that means whipping ½ cup of heavy cream to stiff peaks and then gently folding it into the pot.The direction to mix stiffly whipped cream into a pot of risotto—as Weinstein instructs, along with Serious Eats’s J. Kenji López-Alt and mega-chef Thomas Keller, too—is one of those recipe steps that’s both pleasing and puzzling. Like, pour hot water over your cobbler for a shatteringly crisp crust. Or drizzle three cups of cream over torn kale and sliced cheddar cheese for your life’s best gratin. Or fry almonds and then use their oil as the base for a toasty, nutty pasta sauce.Another way to make your risotto really dang creamy? Slap it with mascarpone.\nBut here’s why this crazy tip works: Just as whipped egg whites add levity and bounce to sponge cakes (and even pancakes and omelets), whipped cream fluffs and loosens risotto, all while making it silkier and even more luxurious. Yes, the foundational creaminess of well-made risotto should come from the starches that the grains release slowly over the cooking process—but a bit of actual cream doesn’t hurt, either.Make sure to season the risotto with salt after you’ve added the whipped cream. Adding whipped cream, like adding any significant amount of dairy, will mute some of its flavors. And while eating a bowl of whipped cream doesn’t sound like the worst dinner in the world, we’re guessing it’s not exactly what you were going for.Another creamy dinner idea:Explore Bon AppétitRisottoCooking TipsWhipped CreamRead MorecookingMake This Risi e Bisi Just So You Can Say It Over and Over AgainBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Sarah Jampel"]}