{"id": "49578311631ac5b2acd9edc018a26431", "url": "https://www.bonappetit.com/story/everything-you-need-to-host-a-proper-dinner-party", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "The (Affordable!) Platters, Bowls, and Utensils You Need to Host a Proper Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe (Affordable!) Platters, Bowls, and Utensils You Need to Host a Proper Dinner PartyBecause food served from a proper platter just tastes better.By Alex DelanyNovember 30, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailYou’re past paper plates and plastic forks. By this point you’ve been cooking (and eating) long enough to know that the platters, bowls, and utensils used to serve a meal are (almost) as important as the food itself—and even more so when you're having people over. The real-real? You need to invest in some gear if you want to up your dinner party game.But you don’t need to have a ton of stuff! Or even expensive stuff! You can get by with a pretty lean list of dinner party essentials. Oh, you’re curious as to what might be on that list? Yeah, we’ll share. Here’s everything you need to throw the raddest dinner party your friends have ever been to:Chelsie CraigA Salad BowlYeah, you know about vegetables. Your friends know about vegetables. So you’re definitely going to serve a salad at your dinner party. Salads are easy! And a great way to get some brightness and color on the table. The salad bowl you’re serving out of should be big. You want enough room to dress the salad in the bowl before you serve it. We like a wooden bowl with a finish, which protects that beautiful wood grain from your acidic (but delicious) dressing.Buy It: Providence Wooden Salad Bowl, $49 from Williams Sonoma.Chelsie CraigA PlatterWhether you spent twenty minutes or three hours on your main course, you want it to look good. Which means you want it on a platter. The world is full of platters, but we gravitate towards a simple white platter with enough of a lipped edge to contain the tasty sauces hanging out under whatever you’re serving for dinner.Buy It: Black Clay Round Platter, $18 from CB2.Chelsie CraigA Deep Shallow Pasta BowlAnd for the stuff that a platter can’t handle, there’s the serving bowl. We’re mostly talking about pasta here. People love pasta. And we like pleasing people, so you’ll catch us serving pasta at a dinner party pretty frequently, especially something with a simple sauce that comes together quickly.Buy It: White Serving Bowl, $14 from CB2.Chelsie CraigServing SpoonsServing spoons separate the children from the adults. Sure, you could just use the fork that was placed at your seat, but having a spoon that’s big enough to serve chicken thighs and scoop up the juices below will make everyone significantly happier. Plus, your friend is getting over a cold, so let’s keep our germs to ourselves, shall we?Buy It: Stainless Steel 3pc. Serving Set, $8 from Target.Salad TongsRemember when you put that big wooden bowl of salad on the table? Yeah, you need some serving utensils for that nutritious masterpiece, and a normal-sized fork and spoon from the depths of your cutlery drawer won’t do. Grab a pair of salad tongs to pick up those leafy greens.Buy It: Olivewood 2-Piece Salad Serving Set, $24 from Crate and Barrel.Dip Bowls (parm, pesto, dips, etc.)If you’re not dipping something into something else, you’re probably not at a dinner party. Dip bowls hold the dinner party snack hour essential: Dips. Duh. But they’re also good for accompanying sauces and toppings like pesto, chile oil, or grated Parmesan cheese.Buy It: 4 Open Kitchen Dip Bowls, $12 from Williams Sonoma.Candle HoldersCandle holders should really be called vibe holders. That’s what they do. They hold the vibes, especially when dinner is coming to a close and the after-dinner drinks are being poured. Whether you’re going for a short tea or votive candle or a tall tapered candle, having a set of matching holders makes the vibes glow even stronger.Buy It: Bronn Taper Candle Holder, $6 from CB2.Ice BucketRoom temperature beverages are tough to sell. Cold ones? Those fly off the shelves, which is why you need an ice bucket. Whether you’re working with a 30-rack of Budweiser or some naturally sparkling wine (or both!), you want a tub with some serious volume. And please, don’t empty all the ice in and then add the drinks. Fill the tub with drinks, give them space to breathe, and then empty the ice on top, so it fills in all the cracks.Buy It: Hammered Metal Beverage Tub, $24 from Target.Chelsie CraigWater PitcherHydration is key. For health. For life in general. But also for dinner parties. You don’t want people running to the kitchen every time they’re feeling thirsty. Keeping a pitcher of water on the table for easy access is the professional move. A simple glass pitcher is best. If anyone needs ice, they know where the ice bucket is.Buy It: Trap Water Pitcher, $14 from CB2.Chelsie CraigCloth Napkins/Dish TowelsYou don’t have to spring for the ultra-fancy, hand-dyed linen napkins, but you definitely shouldn’t be putting a paper towel next to the plates on your table. Cloth napkins that can double as dish towels? Yeah, that sounds about our speed. Picking up a bunch of multipurpose pieces of cloth on the cheap makes dinner more impressive and cleaning up a hell of a lot easier.Buy It: 30 White Kitchen Towels, $28 from Amazon.Want more kitchen upgrades? These cost less than 25 bucks:25 Kitchen Upgrades for Under $25Because you're worth it.View StoryAll products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitGift GuidesBasicallyEntertainingShoppingRead MorecookingThe Cheap, Chic Glassware You Need for Your Next PartyBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Alex Delany"]}