{"id": "495fe6fb57dd8e72c15601ed04078a6c", "url": "https://www.bonappetit.com/story/the-recipe-i-make-for-my-mom-every-year", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "The Recipe I Make For My Mom Every Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Recipe I Make For My Mom Every YearFor a family with very few long-standing traditions, I’m always surprised this one has stuck. By Christina ChaeyMay 9, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,I have a cheap Belgian waffle iron that I purchased when I was right out of college and back living at my parents’ house in New Jersey. When I moved out, the waffle iron stayed behind—I couldn’t justify space for it in my shiny-but-tiny first NYC apartment. For 364 days of the year, it sits forgotten in a cabinet in my parents’ dining room. I pull it out exactly once a year when my sister and I go home for Mother’s Day weekend and I make us Sunday morning brunch.For a family with very few long-standing traditions, I’m always surprised this one has stuck. Every year, I use the same recipe from our orange plastic recipe binder (Pam Anderson’s Light and Crispy Waffles, which incorporate whipped egg whites into the batter to yield golden-brown grids that live up to their name.) I always take the same photo of my mom before we start eating: posed, smiling, with her fork and knife positioned above her dinner-plate-size waffle covered in berries, powdered sugar, and syrup, the way she likes it. And I always make extras for my dad, who claims he’s going to eat just one but reliably has two and a half.Mother’s Day waffles, two years ago.\nOf course, I’m not going home this weekend, even though my parents live only 25 miles from me and I haven’t seen my mom since February. Since waffles don’t ship particularly well, this year I sent her a small care package (hard plug for the USPS, which did a contactless pickup right from my porch!) I had to fill the box mostly with items scavenged from my apartment, which naturally meant there was a lot of food: a cute old metal biscuit tin filled with homemade biscotti, her favorite coffee hour nibble; fat green olives from Caputo’s, a fine-foods retailer based in Salt Lake City that I love; a baggie of instant yeast for baking experiments; and a homemade “dry mix” for a poppy loaf cake I know she’s been craving, that needs just milk, eggs, and oil to transform it into cake. (And a card I bought five years ago and have forgotten to send in the mail every year since...*grimace emoji*)Claire Saffitz's Grapefruit–Poppy Seed Loaf Cake is always a winner.\nAlex LauBut while the care package is nice and all, it still doesn’t resolve the fact that I can’t give my mom the one food she looks forward to all year: her waffle. For the sake of keeping tradition alive—which seems more important this year than ever—I texted my dad earlier this week: Do you want to attempt to make waffles for a Mother’s Day Zoom brunch? (He recently discovered Zoom and LOVES it, l assume because he’s learned how to use the pretty filter.) I then received a long string of texts from him including: “Not sure where the orange binder is. Lol.” “Oops. Ran out of vanilla extract.” “Also don’t have milk.”But, bless him, he’s agreed to try. I’m not sure I have total confidence in his waffle-making abilities, but I do know I will have a very, very big smile on my face when I get to see my mom eating one on Zoom...no pretty filter needed.Okay, I’m crying now, bye!Christina ChaeyAssociate editorExplore Bon AppétitHealthyishMother's DayWhat's Chaey Cooking?essayRead MorecultureMeal Planning > Meal PreppingBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-09", "author": ["Condé Nast", "Christina Chaey"]}