{"id": "4960d56fa23aabda1031a59aff8efa2c", "url": "https://www.bonappetit.com/recipe/universal-marinade", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Universal Marinade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueUniversal MarinadeBy Chris MoroccoJuly 9, 20194.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFinely grating the aromatics in this Vietnamese-leaning marinade unlocks their flavor without endless chopping.IngredientsMakes about ½ cup2lemongrass stalks, trimmed, tough outer layers removed1serrano chile3garlic cloves11\" piece ginger, peeled1Tbsp. dark brown sugar1Tbsp. extra-virgin olive oil1Tbsp. fish sauce1Tbsp. soy saucePreparationUsing a Microplane, finely grate lemongrass, chile (seeds and all!), garlic, and ginger into a medium bowl. (Alternatively, you can chop very finely, then mash to a paste using the side of your knife.) Add brown sugar, oil, fish sauce, and soy sauce and mix well.How would you rate Universal Marinade?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHow long do you recommend meat sitting in marinade? RonOrange,Ca2/13/2021phenomenal!\nTried it with Chicken and Tofu! it's extremely tasty! Highly recommended!\nMaciej MikutaGermany5/17/2020Explore Bon AppétitMarinadeVietnameseSoutheast AsianAsianLemongrassHerbs & SpicesGingerSerrano ChileChileVegetableDairy-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}