{"id": "4966a272bec69bfa434f9ea3031d71d2", "url": "https://www.bonappetit.com/recipe/coconut-cod-chowder", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Coconut Cod Chowder Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueCoconut Cod Chowder With Seasoned Oyster CrackersBy Molly BazFebruary 11, 20204.8(71)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintToo often fish chowder is heavy, gloppy, and one-note. Not this guy. Coconut milk and lots of zippy aromatics bring life to the dish. And though you may think oyster crackers can’t be improved upon, you’ll change your mind when you try them extra-buttery and smothered in paprika. Ingredients4 servings1½lb. skinless, boneless cod or halibut fillets2½tsp. kosher salt, divided, plus more5Tbsp. ghee or unsalted butter, divided2medium leeks, white and pale green parts only, halved lengthwise, thinly sliced crosswise6garlic cloves, thinly sliced13\" piece ginger, peeled, cut into matchsticks¾tsp. ground turmeric¾tsp. ground coriander½tsp. ground cardamom1serrano chile, thinly sliced12oz. baby Yukon Gold or red potatoes, halved213.5-oz. cans unsweetened coconut milk2celery stalks, thinly sliced, plus leaves for serving (optional)1½cups oyster crackers1tsp. paprika2limes, dividedPreparationStep 1Season cod all over with 1½ tsp. salt; set aside. Heat 3 Tbsp. ghee in a medium Dutch oven over medium. Cook leeks, garlic, and ginger, stirring occasionally, until softened but not browned, about 3 minutes. Add turmeric, coriander, and cardamom and cook, stirring, until fragrant, about 30 seconds. Add chile, potatoes, coconut milk, 1 tsp. salt, and ¾ cup water; bring to a boil (still over medium). Immediately reduce heat so soup is at a bare simmer. Cover, leaving lid slightly askew, and cook until potatoes are barely fork-tender, 10–12 minutes.Step 2Carefully nestle reserved fish into pot, spoon some broth over, and cover, leaving lid slightly askew. Cook at a bare simmer 4 minutes, then stir in celery. Cook until fish is opaque and flakes easily, about 5 minutes. Taste chowder and season with more salt if needed.Step 3Meanwhile, heat remaining 2 Tbsp. ghee in a small skillet over medium-low. Add crackers and stir well to coat. Cook, stirring often, until golden brown, about 5 minutes. Remove from heat and add paprika; toss to evenly coat.Step 4Slice 1 lime in half and squeeze juice into chowder. Taste and season with more salt if needed. Ladle into bowls, breaking fish into large pieces. Scatter celery leaves over chowder if using and top with crackers. Slice remaining lime into wedges and serve alongside.How would you rate Coconut Cod Chowder With Seasoned Oyster Crackers?Leave a ReviewTell us what you thinkReviews (27)Back to TopTrianglelooks and tastes of spring.AnnBerkeley, CA2/22/2022Great soup, full of flavor, quick, and easy!\nSkipped the crackers. Don’t skip the lime!JillPalmer, AK10/30/2021So much flavor for something so simple. Mine turned out pretty pale so purely for aesthetics I’d double the turmeric next time. The celery leaves were a surprisingly perfect garnish. AnonymousChicago, IL10/22/2021This is a solid recipe! We're lactose intolerant in my house so we subbed coconut oil for the ghee. Works with shallots vs. leeks, tastes good with any added veg/protein laying around (we had edamame and spinach, which was tasty). Also tastes great if you swap one can coconut milk for one can fire-roasted tomatoes--that extra bit of acid makes it a bit more like tom kha gai IMHO. Even my toddler is a fan! Ryan Rose NYC7/12/2021The spiced coconut broth in this recipe embraced the delicate cod instead of overpowering it.  I added Thai Basil, Cilantro and Scallions instead of celery, and a small dash of Za'atar.  Delicious.BarbaraMiami Beach, FL5/14/2021One of my favorite recipes so far. Used garam masala instead of cardamom and cumin instead of coriander (just because I couldn’t find them in the store). Used reduced fat coconut milk and a jalapeño instead of Serrano. I already can’t wait to make it again. AnonymousDenver, CO3/15/2021I followed the recipe exactly however I used coconut oil instead of ghee/butter, and I did not include the oyster crackers because that felt like gilding the lily. This is an outstanding chowder!AnonymousBrooklyn, NY3/2/2021Delicious!! I used 2 lbs of halibut and 2 Serrano peppers. The broth was a bit rich so I think I will sub one can with chicken or fish stock next time. The fresh lime squeezes are essential. SindiNew York, NY1/15/2021So stinking delicious AND simple enough to make on a weeknight!! Only changes were substituting 2.5 jalapeños for the Serrano as the store didn’t have any, and adding green beans to sneak in another vegetable. It was a hit with my seven year old. The play of flavors was just remarkable. Don’t forget that squeeze of lime. It really lifted it. I would love to see what it takes like the next day, but not sure I’d be able to wait! KarinWeston, CT1/7/2021Couldn’t find cardamom or oyster crackers at the store - used ma la spice and spicy plantain chips instead. Perfect!AnonymousBrooklyn1/4/2021This dish exceeded our expectations, new staple in our house! SOOOO good! even better the next day as leftovers! yum!AnonymousNew York12/3/2020Very good and a definite repeat. One change I made was jalapeno instead of Serrano and it still could have used more heat.Carrollton, Tx11/5/2020Delicious recipe! I followed the recipe exactly and it turned out really well. I used Cod and would experiment using Halibut next time to see which fish I prefer better. The only thing I would change next time is use a different chile. I ended up adding a little cayenne pepper at the end because I wanted more of a spice flavor and it wasn't enough. Probably would use Habanero next time instead of Serrano. Will definitely be making this in the future!yelenamoveBrooklyn NY5/24/2020This recipe was incredible. It reminds me of Thai yellow curry. It was simple, delicious and filling! The butter fried paprika coated oyster crackers really take this dish over the edge. I served mine with some fresh cilantro. Give it a go!RachelJHCalifornia5/18/2020Amazing light, satisfying meal. Just make sure you let it cool down enough, so all the wonderful tastes come out- the potatoes act like little lava rocks.AnonymousSlovakia5/12/2020Explore Bon AppétitChowderSoupSoups and StewsCoconut MilkOther IngredientsCodFishSeafoodHalibutMainHealthyishSimmerEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Molly Baz"]}