{"id": "4968c9337580bc6e34f7018e23f2c5e9", "url": "https://www.bonappetit.com/story/no-more-cleanses", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "How I’m Recovering From a Lifetime of Cleanses | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I’m Recovering From a Lifetime of CleansesOn finding more sustainable ways to live and eat.By Christina ChaeyOctober 3, 2021FacebookTwitterEmailPhoto by Christina ChaeyFacebookTwitterEmailA few months ago, I wrote about my long term struggle to find a comfortable middle ground between what I’ve always referred to as “extremely healthy” and “extremely unhealthy” eating. I’ve long had a pattern of oscillating between the two, which has reinforced the deep-seated, internalized belief that my worth is defined by what I do (or don’t) eat. This long-held belief explains why I’ve always felt high highs during the “extremely healthy” phases and very low during the “extremely unhealthy” times.I’ve been riding an extreme high this week, buried in one of my favorite cookbooks, Whole Food Cooking Every Day by Amy Chaplin. Desperately seeking a change of pace from a meat/alcohol/sugar/dairy/gluten-filled summer, I spent this week converting into a loyal disciple of the gluten-, dairy-, and sugar-free life the book’s pages present so appealingly. My fridge is positively bursting with soaked beans, soaked nuts, soaked seeds (do you sense a pattern here?), and soaked grains. My days start with apple-citrus chia bircher bowls with homemade almond milk and end with a big bowl of steamed vegetables drizzled with tahini. I snack on homemade gluten-free black rice bread spread with homemade toasted pistachio butter. Raisins are my treat.I’ve done this at least once or twice a year for at least a decade, swearing off entire food groups for an arbitrary (and always temporary) period, and, as always, the payoff this time has been swift: I have more energy. I don’t crave my nightly ice cream. My digestion is as calm as a placid sea. At the same time, I’m aware of another familiar phenomenon creeping in: All my waking thoughts are consumed by what I’m going to cook and eat. I’ve noticed I haven’t been making plans with friends on an otherwise relatively free week because I’m worried about getting hungry during our hang and not having anything “approved” to eat. If I get into bed at night and realize I’ve forgotten to soak nuts/beans/etc. for the next day’s meals, I’ll get out of bed and make sure it gets done. I know how quickly this way of living can become...not ideal for me. This is by no means a knock on any particular book or on special diets at large. And I know I’m extremely privileged to be able to make daily choices about what I’d like to eat or not eat. But the truth is that I still struggle with this cycle of good foods and bad foods, good weeks and bad weeks, and how they feed into my sense of self. It feels endless sometimes, and I’m tired of it.What does a better way forward look like? I’ve been trying to answer that question for years, and I’m only recently starting to find answers. Rather than hang onto those temporary highs for as long as I can before I descend back into “bad food” territory, rinse and repeat, I’m thinking about how I can take certain practices from these so-called “healthy” periods and apply them in a more sustainable way. I might not always have the time or desire to make my own nut butter, but I can definitely find time to whisk storebought almond butter with some grated ginger, lemon juice, and honey into a nutritious sauce for fish or roasted vegetables. If I don’t have homemade dairy-free almond milk for overnight oats, yogurt is fine! Yogurt is great! Yogurt makes me feel fantastic and who cares that it’s technically dairy? If I eat plums poached in coffee and brandy and a little sugar, guess what? That’s still more plums than I would have ever eaten otherwise.At some point during the week, I consciously bent my own rules to make dinner for a few friends who were leaving New York, and I cooked everything on the so-called “forbidden” list: braised lamb with eggplant and yogurt sauce; farro and carrot salad with apricots and whipped ricotta; Little Gems dressed with, essentially, savory whipped cream. I hardly felt guilt about any of it, though, because even though the gang (meat, gluten, dairy, and sugar) was all there, it was also one of the most nutritious and veg-heavy meals I’ve prepared in months. A previous version of me would have called this a one-time thing, would have said I’d get back on the bandwagon tomorrow. Me today is a bit more critical; me today wants to ask: Who said I can’t eat this way whenever I damn please? Tomorrow, I’ll eat rice bread and steam some vegetables—but I might have them with a spoonful of leftover whipped ricotta. It’s like the saying goes: Everything in moderation, including moderation.Hints of Fall:Photo by Chelsie Craig, food styling by Claire SaffitzSlow-Cooked Winter Squash with Sage and ThymeStir-Fried Eggplant with Basil and ChilesCreamy Pasta with Crispy MushroomsSteamed Kabocha With Ginger-Soy DressingApple-Walnut Upside-Down CakeGrape-Tarragon SpritzerExplore Bon AppétitWhat's Chaey Cooking?cookingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-03", "author": ["Condé Nast", "Christina Chaey"]}