{"id": "496db96e9b036d6a8c974cd076bbb4c9", "url": "https://www.bonappetit.com/story/yara-shahidi-grownish", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Yara Shahidi on the Family Meals Worth Deferring College For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYara Shahidi on the Family Meals Worth Deferring College For“Being half black and half Iranian, I’d like to think that I hit the cultural food jackpot.”By Maxwell LosgarMarch 1, 2018FacebookTwitterEmailYara Shahidi, actress and model, at the Democratic National Convention in Philadelphia, Pennsylvania, July 2016.Photo from Getty ImagesFacebookTwitterEmailYara Shahidi, the star of Black-ish and its new spin-off, Grown-ish, might be the only teen who doesn’t want to leave home (and we don’t blame her). She deferred her acceptance to Harvard this year because her family dinners are just that good. Okay, okay, and she’s got a lot of other stuff going on. Here, she talks about her dad’s vegetable garden, her mom’s chocolate chip cookies, and who in the house does the dishes.What’s a typical Shahidi family meal?Being half black and half Iranian, I’d like to think that I hit the cultural food jackpot. Growing up we ate a lot of chicken kebab and my baba—which means dad in Farsi—always kept a vegetable garden, so we also ate a lot of fresh salads. There’s no such thing as a bad meal in our house.What’s in the garden?Basil, carrots, rosemary, mint, snap peas, and avocado. One time we even grew corn! But tomatoes are definitely our biggest crop. We used to grow so many that I would show up to playdates with bags of them for my friends’ parents. And while we haven’t had time for a garden in the past couple of years, because of how busy everything has been, I think just the introduction to fresh foods has left an everlasting impact.You must have developed some high standards as a kid.My uncle made fun of me because one time at a restaurant—I couldn’t have been more than seven—I asked the waiter if the salmon was wild caught or farm-raised.What was your favorite recipe that you guys would put together with the tomatoes?Fresh pizza from scratch! It’s a two-day process: My brothers and I handpick tomatoes and make the sauce with my mama while my baba mixes the dough and watches it rise all day. No one besides him can touch it.What’s the situation with doing the dishes?I mean, we have a dishwasher. But it’s also a collective effort. Home cooked meals for a family of five can really tear up the kitchen, so each person has their own job. One person will set the table, another will clear the table, and one of us will rinse the dishes and put them in the dishwasher. We have a little assembly line.Shahidi's Grown-ish character, Zoey.\nPhoto by Byron Cohen/ABCDoes your mom have a culinary specialty?She’s the baker in the family. We have every crazy contraption you can think of in our kitchen—a doughnut fryer, an ice cream maker, a bread machine. She’s always trying something new, but her chocolate chip cookies are a total Shahidi classic. The other classic is my great-grandmother’s sweet potato pie recipe, which comes out during the holidays and makes my heart warm.Are you ready to take off cooking for yourself when you get to college?Many of my friends started college this year, so I’ve been asking them if they think I’ll have enough space and the ability to prep Blue Apron in my dorm. I’m trying to suss it out. I’m pretty spoiled in terms of ending my day with a home-cooked meal. Right now I have no intention of moving.What will you miss most about living with your parents?Having their soup anytime I’m not feeling well. During the first couple of weeks on the set of Grown-ish, I got really bad allergies and would come home to a different delicious flavor each day. I’ll definitely miss that. But what’s nice is that Cambridge is a university town, so I’ll have lots of options. I’ve been collecting a list of restaurants to go to.Suddenly craving homemade pizza:Explore Bon AppétitCelebritiesRead MorecultureTracee Ellis Ross Has a Potato Chip Technique We All Need to TryBy Elyssa GoldbergtechniquesCast-Iron Skillet Pizza, Where Have You Been All Our Lives?By Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Maxwell Losgar"]}