{"id": "4977de2c148c91dfa4395da36be5c2d4", "url": "https://www.bonappetit.com/recipe/upside-down-apricot-tart", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Upside-Down Apricot Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueUpside-Down Apricot TartBy Alison RomanAugust 13, 20194.5(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA beautiful dessert where half of the work is done for you. That’s right, we’re using store-bought puff pastry. This tart can be made in a cake pan or cast-iron or other ovenproof skillet. While this is meant to be flexible, it’s important that the pastry on top be larger than the circumference of the pan you’re using (you’ll be tucking it into the pan), as the pastry will shrink considerably when baked. This is the dessert grand finale from Alison Roman’s “Steak House Night in America” menu, alongside: Martini Bar, Low-and-Slow Rib Roast, Baked Potatoes Deluxe, and The Greatest Creamed Greens.Recipe adapted with permission from Nothing Fancy: Unfussy Food for Having People Over by Alison Roman (Clarkson Potter, an imprint of Penguin Random House, LLC). Copyright © 2019. Ingredients6–8 servings¼cup honey¼cup sugar½tsp. kosher salt2Tbsp. unsalted butter1Tbsp. apple cider vinegar1lb. apricots (about 6), halved lengthwise, pits removed1sheet frozen puff pastry (one 14-oz. package or half of a 17.3-oz. package), thawed¼cup raw pistachios, finely choppedWhipped cream or vanilla ice cream (for serving; optional)PreparationStep 1Place a rack in middle of oven and preheat to 425°. Cook honey, sugar, salt, and 2 Tbsp. water in a small saucepan over medium-high heat, stirring occasionally, until caramel turns dark amber in color (because of the honey, it can be hard to tell when the color changes; it should look like maple syrup). Remove caramel from heat and add butter and vinegar (be careful; mixture will bubble up). Stir with a wooden spoon or heatproof rubber spatula to incorporate.Step 2Pour caramel into a 9\"- or 10\"-diameter cake, tart, or springform pan or skillet and swirl to evenly coat the bottom.Nikole HerriottStep 3Arrange apricots, cut side down, in pan, letting them overlap slightly if needed. (Depending on the pan you use, you may not need all of them.)Nikole HerriottStep 4Unfold pastry and gently roll out on a lightly floured surface just to soften the creases and corners. Prick pastry all over with a fork. Drape over pan, then, using kitchen shears, trim to make a circle that’s slightly larger than the circumference of the pan (remember, the dough will shrink as it bakes) and tuck into pan.Step 5Bake tart until pastry is puffed and just golden, 15–20 minutes. Reduce oven temperature to 375° and continue to bake until pastry is deep golden brown and fruit juices are bubbling, 15–20 minutes longer. Transfer tart to a wire rack and let cool 10 minutes.Step 6Invert a large plate over the top of the pan. Using a dish towel or oven mitts, flip tart over onto plate. Carefully remove pan. Top tart with pistachios.Step 7Serve tart with whipped cream or ice cream if desired.Step 8Do Ahead: Tart can be baked 4 hours ahead. Leave in pan at room temperature. If caramel has set too firmly to release from pan, heat in a 375° oven 5 minutes to warm and loosen before turning out.How would you rate Upside-Down Apricot Tart?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIs it possible to use canned apricots?bellashere624504/29/2020I used a springform and the caramel leaked out everywhere : ( Luckily I caught most of it with a succession of cookie sheets but I hope there's enough in there when I cut into it.AnonymousNew York9/13/2019Explore Bon AppétitTartDessertFruit DessertApricotStone FruitFruitSummerBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Alison Roman"]}