{"id": "49833310fb367f9e6d714d21f30f0042", "url": "https://www.bonappetit.com/recipe/skirt-steak-with-ba1-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Skirt Steak With BA.1. Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueSkirt Steak With BA.1. SauceBy Chris MoroccoJune 2, 20204.3(9)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintWe adore every steak in the butcher case—but we might love skirt steak the most. (Don’t tell rib eye.) Why? It’s supremely beefy, not outrageously expensive, and, maybe best of all, fast-cooking. It can hold its own but isn’t above being tossed into a roll or stuffed in a taco. And it’s always there when we need it. Oh, and did we mention it goes great with sauce? Sweet, salty, tart, and goosed with secret sources of umami, our new signature sauce is big on flavor, free of weird preservatives, and comes together in about a minute flat. Ingredients4 servings  Sauce2Tbsp. balsamic vinegar2Tbsp. Worcestershire sauce2Tbsp. ketchup1Tbsp. extra-virgin olive oil1Tbsp. vinegar-based hot sauce (such as Frank’s or Crystal)1tsp. Dijon mustard1tsp. honeyKosher saltSteak and AssemblyVegetable oil (for grill)1½lb. skirt steak, cut into 4\"–5\" piecesKosher salt, freshly ground pepperFlaky sea saltPreparationSauceStep 1Whisk vinegar, Worcestershire sauce, ketchup, oil, hot sauce, mustard, honey, and 1 Tbsp. water in a medium bowl to combine; season with salt.Step 2Do ahead: Sauce can be made 2 months ahead. Store airtight at room temperature.Steak and AssemblyStep 3Prepare a grill for medium-high heat; oil grate. Season steak generously with kosher salt and pepper. Grill, turning every 1–2 minutes and moving closer to or farther away from heat as needed to build even color, until nicely charred and an instant-read thermometer inserted into the thickest part of steak registers 125°(juices pooling on top of meat is a fairly good indicator that meat has reached medium-rare), 7–9 minutes. Transfer steaks to a cutting board and let rest 5–10 minutes before slicing against the grain.Step 4Transfer steak to plates and top with sauce. Crack some pepper over and sprinkle with sea salt.How would you rate Skirt Steak With BA.1. Sauce?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleNot outrageously expensive? That may have been true 40 years ago when butchers threw it into ground beef mixes. If I can find it in meat cases or at butchers, I usually pay quite a premium - more than a choice strip or ribeye per #. But my wife and I love it so we do what we now consider a splurge for special occasions. And it makes the best carne asada too!Ed KLos Angeles8/18/2021First, you have to be into steak sauce. I, for one, was not... until I tried this one. BA has paired it perfectly with the Skirt (or Hanger/Flank or even sirloin -- but I suggest keeping it away from the Strip and Filet. Those should be butter, only). I drizzle a little on the sliced steak and let my guests add more to their liking. It's also an easy sauce to \"make your own\". I added a little Garam Masala, to add some warmth, and it was great. I imagine smoked spices (chipotle, paprika, etc.) would also be very nice. AnonymousWashington DC6/24/2020Came out better than I thought. Kinda yummy actually. Made it and the BA recipe for tri tip steak with tiger sauce tonight.  Was a toss up between the two. It lent a nice change to grilled steak. Not your usual steak salad corn dinner. EssieDeeStamford ct6/21/2020Reverse seared 2 thick NY strips over charcoal. After 10 min rest sliced lengthwise, applied the BA.1. sauce, coarse sea salt & pepper, chopped parsley and topped with sauteed crimini mushrooms.  Awesome. Sauce was great; a little different taste from A1 (that's a positive) and without the goop.AnonymousDestin, FL6/15/2020Was the intent for this sauce to be unpleasantly watery? The consistency bears no resemblance to A.1. or any other traditional steak sauce and feels more like a marinade. A waste of aged balsamic. smithgardnerBrooklyn, NY 6/14/2020Explore Bon AppétitSteakBeefMeatSummerEasyWeeknight MealsQuickMainDairy-FreeGluten-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}