{"id": "49aa4e28b647506e1cf8f204b5575851", "url": "https://www.bonappetit.com/story/easy-scotch-cocktails", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "3 Easy Scotch Cocktails Made With Blended Scotch  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Scotch Cocktails That Are For You, Not Your GrandpaKeep your $$$ single-malt Scotch—we'll take the more-affordable, just-as-great blended Scotch, thank you very much. By Al CullitonFebruary 13, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Al CullitonFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.What’s that? You think Scotch is expensive and for old people? Well, I’m here to tell you about blended Scotch, which is less expensive than the single malt stuff and is the perfect base for winter cocktails, regardless of your age.Let’s take a step back: Scotch is a form of whisky and, yes, I am spelling it right: When the whisky is from Scotland (or Japan!) there’s no e before the y. Scotch and its close cousin, Irish whiskey, are two of the western world’s most ancient distilled spirits, a product of Celtic ingenuity paired with a deep love of drink. Whisky comes from the Gaelic for “water of life,” uisge beatha. As with many spirits, Scotch has its own regulations, but most importantly all Scotches must: be made in Scotland, contain malted barley (but can include other whole-grain cereals like wheat, rye, or corn), and aged at least three years in oak. A blended Scotch can include these other grains and can be a mix of different whiskies. Single malts, on the other hand, must be made from 100% malted barley, produced at a single distillery, and distilled using a traditional copper pot still.But here’s one of the coolest things about the story of Scotch: Even though most bars and home drinkers brag about their expensive single malt (non-blended) Scotch, the blended stuff has been popular for a really long time. And you know where that started? Grocery stores. That’s right. Think about the bulk section at the store. Now think about how great it would be if there were barrels of whisky there. Because distilleries weren’t bottling their products (glass wasn’t cheap back then), Scots bought whisky by filling their bottle or jug at their local grocer. But something else started to happen: Grocers began blending various single malts to make a house whisky. Johnnie Walker was a grocer, and so was Dewar, among many others.Today, we’re going to buy a bottle of good-quality blended Scotch and a bottle of the Scotch-based liqueur Drambuie, so you can make three great drinks for your wintry evenings. No bulk barrels or self-blending required.Photo by Laura Murray, Food Styling by Al CullitonYour Shopping ListBlended Scotch (I like the Famous Grouse)DrambuieAngostura bitters (optional)6 limes2 eggsGinger beer (spicy!)Club sodaThe PrepWe’re going to lean on Drambuie’s honey-sweetness and store-bought ginger beer to do what a simple syrup might normally do. All you’ve got to do right now is juice four or five of those limes and you’re golden.1. The Mamie TaylorPhoto by Laura Murray, Food Styling by Al CullitonIn the late nineteenth century, the rise of Broadway was inextricably linked with the cocktail boom. They essentially grew up together. Mayme Taylor was a comedic actress during the Gilded Age and this drink, though not spelled correctly, is named in her honor. The refreshing citrus-and-spice combo will make you feel like you’re at a summer garden party.To make it, pour 1½ oz. Scotch, ¾ oz. lime juice, and a barspoon of Drambuie into a tall glass. Add ice, top with ginger beer, and garnish with a lime wedge.2. The Rusty NailPhoto by Laura Murray, Food Styling by Al CullitonLong associated with bachelor-style postwar drinking culture, the Rusty Nail hasn’t always gotten the respect it deserves. But you know what? It’s a good drink, and if you like Old-Fashioneds, you’ll like this. Instead of sugar or syrup, the Drambuie acts as a spiced honey syrup, and it’s got booze in it, too.To make it, pour 1½ oz. Scotch and ¾ oz. Drambuie into a double rocks glass. (This is my preferred ratio; some of you may prefer more or less of either, and that’s okay!) Add ice and stir right in the glass for about 20 seconds. I like to garnish mine with a couple dashes of Angostura bitters, which reinforces the spice of the Drambuie. Sensing a theme here? Blended Scotch cocktails are pretty easy, no?3. The Scotch FizzPhoto by Laura Murray, Food Styling by Al CullitonThis one’s an original I came up with, but it’s based on one of the great classic cocktail templates: the fizz! A fizz consists of spirit, citrus, sugar (we'll use Drambuie here), and egg white, shaken to froth and chilled, and then strained into a small version of a Collins glass without ice. It's then topped with soda until the head from the egg white reaches the top of the glass. If you’re a dedicated reader of this column, you’ll know that we’ve used egg white before. If you aren’t, don’t be scared—it makes for an impressive and delicious drink!To make it, first separate the yolks from a couple eggs so you have some egg white to work with. For the whites, a squeeze bottle is best, but a small bowl or measuring cup is fine too. Into one of your shaker tins, combine 1½ oz. Scotch, 1 oz. Drambuie, ¾ oz. lime juice, and ¾ oz. egg white. We’re going to “dry shake” first (that means no ice), so seal the tin tightly and shake for 15 seconds, being sure to hold the two halves of the shaker together firmly. Open the shaker back up, add ice, and seal. Shake again for 15 seconds. Into a small Collins glass (8- or 9-ounce capacity), double strain the drink. (That means putting your Hawthorne strainer over the top of the shaker tin, then pouring the whole shebang through a fine mesh strainer over the glass.) Let it settle for a few seconds. Now, slowly pour in soda until the egg white head reaches the top of the glass. Let it settle for a few seconds more, then top off with more soda. Isn’t it pretty?!Now that you know all about Scotch, it’s time to get mixing. Nothing will entice your friends to come over on a cold winter’s night more than the text “I’m making cocktails.” But if they still won’t budge, promise them you’ll wear tartan while doing so.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlScotchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Al Culliton"]}