{"id": "49aa5fb0c5ddbca1decfbab64254fc7d", "url": "https://www.bonappetit.com/story/the-runaway-experience", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Runaway Experience: How Moving to Jamaica Helped This Entrepreneur Launch Her Travel Brand | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Moving to Jamaica Helped This Entrepreneur Launch Her Travel BrandKalisa Martin co-founded The Runaway Experience, a travel agency for people who don't like travel agencies.By Ali FrancisOctober 4, 2018FacebookTwitterEmailFacebookTwitterEmailIn Entrepreneurs Run the World, Ali Francis gets advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Kalisa Martin, co-founder of The Runaway Experience, a travel service that really gets us.Whether I’m surfing in Barbados (while renewing my visa), smearing cream cheese on a St-Viateur bagel in Montreal, tipsy from mulled wine and pierogies in Krakow’s Old Town, or slurping a bowl of Hanoi’s finest phở at 8 a.m., I can’t help but return to the same question: “Could I live here?” And then, more practically: “What would I do?”For The Runaway founders and soon-to-be married couple, Kalisa Martin and Jeff Belizaire, answers to both these questions came while they were on a last-minute getaway to Jamaica in 2014. “We were both at a place in our careers where we were ready for a change and burnt out from our daily grinds,” Martin, a former brand director at Tasting Table, explains. “The location was the perfect place to incubate our idea, and, by the time we left, we were at the beginning of an awesome adventure.”The pair ran a Kickstarter campaign for the first-ever successfully funded B&B, with backers donating almost $47,000 toward the Jamaican island pad. The Runaway concept soon grew into a larger lifestyle agency, offering boutique travel packages around the world. Want to glamp your way around Morocco, learning to make Berber tea and tagine, sampling street foods, and shopping for spices in local souks? How about seven days of self care, sisterhood, and writing? The Runaway’s got you.With her degrees in food science and nutrition from Cornell University, and chef training from the French Culinary Institute in Manhattan, Martin knew that food would be an important pillar of The Runaway brand. “Our goal is always to take guests on a culinary adventure that is at the same time exciting, unexpected, and delicious,” Martin says. “To us, food is a major part of a travel experience, and we never want any guest to have a single bad meal.”Part of Martin’s mission involves using food as a vessel to open people’s minds beyond cultural stereotypes. For example, in Jamaica, she cooked breakfast, lunch, and dinner for her B&B guests using fresh ingredients from local farms. Likewise, in Cuba, Martin walked the entire island in search of destinations that would shatter rumors of “lackluster food.” “During our research, we ate high and low, chatting with locals about their favorite places,” she said.We talked with Martin about monetizing a passion project, staying sane in startup mode, leaving time for self-love, and the morning routine she’ll never give up.I’m always so fascinated by the moment people make the jump and start their own businesses. It’s hard! What was that journey like for you?Exciting, energizing, and a complete leap of faith! Because of our unique approach and perspective on travel, there was no roadmap, no instruction manual, and no success stories we could directly emulate. Fortunately we had a ton of experience with startups and building companies from scratch. So while it was a new industry, we were able to apply the skills we already had to bring our vision to life.How did startup culture prepare you for The Runaway?Instead of being plugged in to a fully formed operation, we were part of teams that created the processes and the foundation that the business needed to run. We saw what worked, what didn’t, and were encouraged to optimize and evolve. We also felt the pressures of answering directly to investors, advertisers, and customers.How do you and Jeff divide and conquer work?I like to say that Jeff is the “What” and I am the “How.” Simply put, he’s more of a big picture creative and I am more of a detail-oriented project manager. While he’s identifying our brand positioning, strategizing on our marketing, and projecting our five-year plan, I’m calculating trip budgets, building research spreadsheets, and coordinating logistics with guests.What’s it like working with your fiancé?Starting a business with my significant other was like bootcamp for our relationship. We have very different working styles, and while couples usually smooth out their communication differences over time, we had to learn very quickly how to give each other space to run with our angles of the business while also collaborating effectively.Real talk: How did you keep paying your bills while starting The Runaway?We both had savings, plus, Jeff took on marketing projects as necessary to keep the lights on as we were building the brand.How did you actually figure out how to start planning trips? Were you calling airlines, etc?I’m a project manager at heart and each trip is essentially a major project, with multiple elements that needs to be planned. We research each market extensively. First remotely, connecting with partners and identifying trip elements, then we spend physical time in the city, walking the streets, meeting with people, eating everywhere, and literally testing out every experience we’re considering including in the itinerary.What is your best marketing asset? In other words, how did people start hearing about you and caring about The Runaway?Social media, press, influencer collaborations, brand partnerships, and definitely word of mouth! Not only do we have great repeat travellers but they also tell their friends.When was your “Oh boy, this is totally a viable thing” moment?Kickstarter was a great way for us to validate the brand from the very beginning. We’ve received such amazing support that we never doubted the concept. The challenge for us was narrowing down all of our “That’s cool!” ideas and focusing on a sustainable, scalable business plan.The first iteration of The Runaway was a bed and breakfast in Jamaica. What was that move like from New York?We’d both been in NYC for several years—and loved it—but we were ready, and honestly thrilled, by the change. In Jamaica, we lived on a hill with views of the mountains and the ocean, walked ten minutes to the beach, and bought our food directly from farmers. Not to mention it was 85 and sunny year-round! When we decided to move back to the U.S. to facilitate research and expansion to new markets, we chose Philadelphia instead of going back to the hustle and bustle of NYC.Can you share any memorable advice you've received as an entrepreneur?“There are a lot of good things you shouldn’t do.” My mom, a medical doctor with her own practice, actually said that to me when I was in college. I was super active in student organizations, sports, and community activities. That was my first major lesson in prioritization. There’s simply not enough time in the day to do everything, even if it’s a GOOD thing to do. This motto, as simple as it is, helps keep us on track as we operate our business.What are the top three foods we'll always see in your kitchen?Since we work from home, I cook most of our meals, and the most exciting thing in the fridge is our weekly farm share. Matcha is a must. I switched from coffee two years ago and ceremonial matcha for home and instant matcha for the road have been essential ever since. [Martin loves The Republic of Tea.] And plain, nonfat Greek yogurt. Top it with some fresh fruit, chopped nuts, seeds, and a drizzle of raw honey—that is my kind of sundae.Best meal you’ve ever eaten on a Runaway Experience trip?Dinner at my absolute favorite restaurant in Cuba: El Partenon. This paladar, or private restaurant, is literally a house in a completely residential neighborhood 20 minutes outside of Old Havana. There’s no menu. They just tell you what’s available and it’s all served in multiple courses, family style. We start with fried yucca that’s been smothered in freshly grated garlic; tostones rellenos stuffed with ropa vieja (shredded beef); fish or shrimp ceviche; and, my favorite, grilled octopus with an insane pesto. Then the mains, desert, and digestifs! Not to mention the BEST frozen mojitos on the island.Do you have any habits that keep you grounded and on track?My morning routine. I keep my water bottle next to my bed so when I first wake up I drink a ton. Next, I make my morning shake or smoothie and hit the gym, if it’s a gym day. I also tidy up the kitchen so that each day feels like a fresh start. Before diving into work, I make my matcha latte and do my daily devotions.Where and when do you do your best work?When I’m fully rested! I’ve come to terms with the fact that I need 8 hours of sleep. Period. The “where” is usually the office in our apartment. I have my standing desk, a second screen I hook up to my laptop, and a big window to look out of. Since I work from home, it’s important to me that I have a designated work space that’s different from our living space. I try to keep those separate and sacred.What's one thing you wish you knew before starting The Runaway Experience?If you told us where we’d be in 2018 back in 2014 I’m not sure we could’ve fully processed that at the time (laughs). That said, I do think some tailored financial advice would’ve been helpful early on. Tips and tricks on how the money we were already spending could do more for us. For example, how to maximize airline points and the right credit cards to get for our specific kind of business.If you could pick one person's brain about The Runaway Experience over lunch, who would that be?Anthony Bourdain. I’ve always looked up to him as a pillar in the food, travel, and content space. He had a very clear point of view and never buckled under pressure to stick to the status quo or do what was expected of him.What constitutes a perfect day off for you?Jeff and I do a thing we call “Saturdates” almost every weekend. It’s basically a whole day date that involves doing all of our favorite things: a hike in the park next door to our apartment, picking up our farmshare, exploring a cool neighborhood by foot in our new hometown of Philly, and eating out at a few places along the way. We love Zahav (absolutely worth the wait to get a reservation), Double Knot, which is a secret izakaya in the basement with amazing cocktails, and Reading Terminal Market, the 125 year old indoor market with over 80 restaurants and merchants.Explore Bon AppétitHealthyishTravelEntrepreneurs Run the WorldInterviewsRead MoreLifestyleThese 6 Products Keep Me Healthy Through Every Stage of TravelingGallery6 SlidesBy Nancy Jo Iacoi Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Ali Francis"]}