{"id": "49ae51df42549c4a8fe159c688f658f7", "url": "https://www.bonappetit.com/recipe/short-ribs-with-piri-piri-marinade", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Short Ribs With Piri-Piri Marinade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueShort Ribs With Piri-Piri MarinadeBy Marcus SamuelssonDecember 1, 20204.8(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis dish coaxes its flavor out of the piri-piri sauce, which is popular in South Africa and Portuguese-speaking Africa, in two different ways: first as a tenderizing marinade, which caramelizes in the skillet as it cooks, and then as a finishing sauce, where it adds a bright, acidic note. You may associate short ribs with slow-cooked preparations, but this recipe is a testament to how tender and flavorful they can be when cooked like a steak. If you can’t find boneless short ribs, a New York strip steak will work here as well.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’Ingredients8 ServingsMarinade2large shallots, coarsely chopped8garlic cloves, peeled2Scotch bonnet chiles, stemsremoved12\" piece ginger, peeled, coarsely chopped¼cup fresh lemon juice¼cup vegetable oil4tsp. paprika2tsp. Diamond Crystal or 1 tsp. Morton kosher saltShort Ribs and Assembly¼cup sherry vinegar or red wine vinegar¼cup honey¼cup plus 3 Tbsp. vegetable oilKosher salt, freshly ground pepper3lb. boneless beef short ribsPreparationMarinadeStep 1Pulse shallots, garlic, chiles, and ginger in a food processor until very finely chopped. (Alternatively, pound into a coarse paste with a mortar and pestle if you have one.) Transfer marinade to a medium bowl and stir in lemon juice, oil, paprika, and salt to combine.Do ahead: Marinade can be made 1 month ahead. Cover and chill.Short Ribs and AssemblyStep 2Mix vinegar, honey, ¼ cup oil, and half of marinade in a small bowl to combine; season with salt and pepper. Set piri-piri sauce aside for serving.Step 3Brush or rub each side of short ribs with remaining marinade and place in a shallow baking dish or large resealable plastic bag; cover with plastic wrap or close bag. Let chill at least 4 hours and up to 12 hours.Step 4Remove short ribs from marinade and scrape some of the marinade from surface. Let sit at room temperature at least 1 hour before cooking.Step 5Heat a dry large cast-iron skillet over medium-high. Coat short ribs all over with remaining 3 Tbsp. oil and season generously with salt and pepper. Cook short ribs, turning every 3–4 minutes, until deeply charred on all sides and an instant-read thermometer inserted into the thickest part of meat registers 130° for medium-rare, 13–16 minutes total. Transfer short ribs to a cutting board and let rest at least 10 minutes.Step 6Slice meat against the grain ¼\"–½\" thick and serve with piri-piri sauce.How would you rate Short Ribs With Piri-Piri Marinade?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleLuscious, and tantalizing to the taste, a delightful dish to serve as an appetizer to guests that love ribs. I'm a fan of ribs and sauces to accommodate the exciting and flavorful texture associated with ribs, especially those ribs that are cooked on the grill.AnonymousUpstate, New York7/15/2021This was so enjoyable and different. McKenzieWillmar, MN3/14/2021Can I substitute red chili peppers for the scotch bonnet? jonbrooklny ny3/2/2021Explore Bon AppétitShort RibBeefMeatMainNut-FreeGluten-FreeDairy-FreeSautéPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}