{"id": "49af35a087d66651407666840ddb8261", "url": "https://www.bonappetit.com/recipe/kimchi-toast", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Kimchi Toast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKimchi ToastBy Andy BaraghaniOctober 17, 20184.6(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintIf we had to give this toast a bunch of random personality traits, we’d describe it as a rule-breaking hothead with a softer side. Spicy, pungent kimchi plus smooth cream cheese, topped with a scallion salad—on toast. It works.Ingredients4 servings4oz. cream cheese, room temperature¾cup finely chopped kimchi; plus more for serving (optional)2scallions, thinly sliced on a diagonal1cup cilantro leaves with tender stems½limeKosher salt4¾\"-thick slices country-style bread, grilled or toastedChili oil and toasted white sesame seeds (for serving)PreparationStep 1Mix cream cheese and ¾ cup kimchi in a medium bowl. Toss scallions and cilantro in a small bowl. Squeeze in juice from lime, season salad with salt, and toss again to combine.Step 2Smear kimchi cream cheese on toasted bread. Top with scallion salad and more kimchi, if using. Drizzle with chili oil and top with sesame seeds.How would you rate Kimchi Toast ?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleLove love love! We had this as a late, light dinner; it was exactly the thing we needed! Couldn't find the cilantro I thought I had, so used a combo of mint and basil from the garden — just fine. Grilled homemade ww sourdough in cast iron pan w/ mix of butter + olive oil; “lady sauce” chili crisp on top = perfection. (Only wish I had thought of adding a slice of avo like another commenter did — next time!)typeforbreakfastNew Haven, CT7/9/2021More than the sum of its parts. No scallions, but put a slice of avocado on top of each slice, after plain cilantro, then sprinkled with lime juice, sea salt, chili oil and toasted sesame seeds. Made a great lunch alongside a salad. FranMexico3/13/2021Wow just what I was looking for. AnonymousKent, England12/28/2020One of my favorites. I make the kimchi mix first, then pan-fry my bread in olive oil and top with a poached egg for a heartier breakfast. Chili crisp like Lao Gan Ma or even Trader Joe's brand goes so well on top. So freaking good. jelfersSan Francisco, CA11/6/2020Liked but didn’t love. Giving five stars anyway because I think the fault may well be with me not having all the ingredients (no chili oil or sesame seeds) or the ones I used not being in their prime. I recommend starting with a quarter lime and no salt on your salad and trying it, I found those flavors a little overpowering. I had it on a poppyseed bagel and think it would’ve been even better on garlic, everything, or sesame. Gonna get myself over to H Mart so I have chili oil and sesame seeds for next time. BananaMartiniElkins Park, PA 10/29/2020Andy strikes again. This is a quick meal I whip over lunch and I usually have most of the ingredients on hand already (win-win). I find it a nice recipe to brighten up the ongoing WFH dayzzz. I can see these as cute little crostinis for sharing too.stephaniedarcy14527Seattle, WA8/18/2020I love kimchi and am honestly always looking for a way to eat as much as possible and call it a meal. Can’t wait to make this again.kyliedixonVancouver5/26/2020I find myself craving this often. Such a good, adaptable recipeAnonymousRedondo Beach, CA5/25/2020I was a bit skeptical at first but then I thought eh wth. Turns out it was sour, and spicy, and creamy, and he's right, it somehow works. Even though my dumb*ss stirred the salad in the kimchi cream cheese mixture 😑 it was still tasty. The only thing I would give advice on is that if it's recently fermented kimchi you can follow the recipe as is, but if your kimchi has been fermenting long maybe cut back on the amount a little bit unless you can handle the sourness.munirahalhabshiKuala Lumpur, Malaysia8/27/2019I add kimchi to an otherwise boring turkey sandwich . . . and maybe some radish sprouts.  I confess I read but have not tried the recipe.  Same idea so I give it 5 stars.SuraWLoa Angeles, Ca6/23/2019just schmear some crunchy p.butter (almond buttah works too) on the toast/bread, top with kimchi -- munch, crunch away together.AnonymousSeoul6/23/2019Oh my gosh, this recipe is so good!! I had been looking for something that I could eat for breakfast that was not a donut or something similarly sweet but also wasn't just eggs and this turned out to be perfect. Definitely recommend!AnonymousFargo, ND1/7/2019I subbed the cream cheese for smashed avocado and it was delicious. Can't stop making it, plus it makes it dairy-free for those of us who avoid it.AnonymousDurango, CO12/3/2018This is an awesome recipe but I highly suggest making this creme cheese at least one day in advance so the flavors meld together. It would have made the toast so much tastier!caitlin57Napa, CA11/20/2018Explore Bon AppétitToastCream CheeseCheeseEasyQuickSnackHealthyishBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Andy Baraghani"]}