{"id": "49b00b9a8a4fa71d4336cdfbf72124ec", "url": "https://www.bonappetit.com/story/5-delicious-desserts-with-1-secret-ingredient", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "5 Delicious Desserts with 1 Secret Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Delicious Desserts with 1 Secret IngredientBy Colavita® March 14, 2019FacebookTwitterEmailFacebookTwitterEmailWhen it comes to wellness, you already know that olive oil is a central ingredient in the Mediterranean diet. One of the reasons is because the good fat in olive oil makes it an optimal replacement for butter, making it a nice alternative for desserts, too. As a general rule, 1 Tablespoon of butter in a recipe is equivalent to 2 ¼ teaspoons of olive oil. For larger measurements, 1 cup (or 2 sticks) of butter is equal to ¾ cup of olive oil. The next time you’re baking up a batch of sweets, swap out the butter for rich and smooth olive oil. They’ll taste even sweeter knowing you’re nourishing your body too. Here are a few recipes to get you started.Olive Oil Bundt Cake with a Tangerine GlazeOlive oil cake is, in itself, a deliciously moist and easy-to-make pastry. Add a citrusy, tangerine glaze to this classic cake, and it just may be sheer perfection. Colavita® Olive Oil perfectly complements the tangy, orange-flavored icing, which lends just the right amount of sweetness.Peanut Butter and Jelly SquaresTurn an everyday standard into a craveable snack with this recipe for sweet, crumbly Peanut Butter and Jelly Squares. Colavita® Olive Oil adds extra richness. We love using whole peanuts in this recipe for an extra-crunchy texture and while grape may be the traditional jelly go-to, use your favorite flavor of jam to make it your way.Cranberry, Pistachio, and Orange SconesWhether it’s for breakfast, lunch, or afternoon tea, this flavorful twist on the traditional scone is a crowd pleaser on any occasion. A mixture of butter and olive oil do double duty on moistness, while an icing made of freshly squeezed orange juice and powdered sugar is the perfect finish.Pumpkin WafflesPut a healthy twist on breakfast with these all-season Pumpkin Waffles made with oats and wheat flour, cinnamon, pumpkin purée, and of course, Colavita® Olive Oil. Add a little extra Colavita® Olive Oil right on the waffle iron before pouring in the batter to ensure a crisp outer crust––the perfect foundation for a little drizzle of maple syrup.Strawberry Cheesecake with Olive Oil CrustWhether it’s for a special occasion or simply a weekend made for baking, this Strawberry Cheesecake gets its flavorful, easy-to-make graham cracker crust from Colavita® Olive Oil.  Blended with walnuts or pecans, graham crackers, sugar and olive oil, this crust becomes a doughy foundation for a great filling. Want to save time? Pick up store-bought vanilla meringues to add as a topper for a deceivingly impressive yet dazzling finish.A Butter to Olive Oil Cheat-Sheet:Discover more recipes at colavitarecipes.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Colavita"]}