{"id": "49c5f26e723f75d49cacd2e53d721a6c", "url": "https://www.bonappetit.com/story/black-vinegar", "year": 2021.0, "month": 5.0, "day": 5.0, "content": "Black Vinegar Doesn't Just Season a Dish–It Transforms It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBlack Vinegar Doesn’t Just Season a Dish–It Transforms ItIt’s umami in a bottle, baby.By Clarissa WeiMay 29, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailMany vinegars are used to cut through fat, to add sharp counterbalance to oil in a dressing, or to amp up the sour notes in a complex sauce. But black vinegar is far more than just a blade of acid. With hints of licorice and malt held together by a distinct umami earthiness that permeates the whole condiment, it’s transformative, providing both acidity and complexity to round out a dish.“Black vinegar is more aromatic. White vinegar is just sour,” says chef Theresa Lin, the food stylist for Ang Lee’s Eat Drink Man Woman, one of the most iconic Chinese food films in history.In northern China, spoonfuls of black vinegar are draped over thick, belt-like noodles with a touch of soy sauce, served with slices of meat, onions, or wood ear mushrooms. In southern China, it’s added to a slow-braise of pork ribs and sugar to create a sweet-and-sour appetizer. In Japan, it’s used to coat glossy cubes of chicken in a sizzling clay pot. In Taiwan, a drop or two of Taiwanese black vinegar (pictured above) is used to flavor thick squid soup.Black vinegar, along with soy sauce, salt, sugar, and cornstarch, is the base of this tangy cabbage stir-fry.\nPhoto by Laura Murray, Food Styling by Pearl JonesSo what is black vinegar and how is it produced?The global lineup of vinegars is extensive, but the way they’re made is fundamentally the same. It’s a two-step fermentation process: First, alcohol is made by combining yeast with grain or fruit. The yeast converts the sugars in the grain or fruit into ethanol. Then a bacteria converts that ethanol into acetic acid, which is the main component in vinegar.Black vinegar is a broad umbrella term for a grain-based vinegar—sometimes aged for years and sometimes infused with flavor. Most black vinegars are aged for at least six months and up to several years, which gives them their signature color. Traditionally, they’re made in a similar process to balsamic, where the vinegar is aged in a container for years so that it develops a distinct level of complexity. The longer that it sits, the more complex the flavors become. The key differences between black vinegar and balsamic are that black vinegar is made with grains instead of grape juice and aged in clay pots instead of barrels. And whereas balsamic vinegar is made using liquid-state fermentation (only the grape juice is fermented), Chinese black vinegar is made by fermenting whole steamed grains.“Black vinegar is black due to a chemical reaction called the Maillard reaction,” during which carbohydrates react with amino acids, explains Su Nan-Wei, a professor at National Taiwan University’s department of agricultural chemistry. “The point is that the main ingredients are made with grain.” Grain gives the vinegar a malt-like base flavor, and the Maillard reaction is responsible for bringing out umami notes.Black vinegar varies based on where, how, and by whom it’s made.Chinkiang vinegar is made with sticky rice.\nAlex LauChina is the birthplace of cereal-based black vinegar, and the process eventually spread all across Asia and took on a life of its own. Generally speaking, there are four major regional types in China: the northern Chinese province of Shanxi is known for vinegar made with sorghum, wheat, and barley. The city of Zhenjiang in southern China makes its, more commonly referred to as Chinkiang vinegar, with sticky rice. Sichuan has a black vinegar made with wheat bran and seasoned with a pungent medley of Chinese medicine spices. And finally, the province of Fujian in eastern China makes a glutinous rice vinegar infused with a special fungus that gives the final product more of a dark red hue than black.Outside of China, Japan and Korea use brown rice as the base starch for their black vinegar. Taiwan’s black vinegar, which starts with sticky rice, is the most divergent from the batch in that it’s actually more similar to Worcestershire sauce in production. Worcestershire is made by steeping a malt vinegar base with ingredients like molasses, anchovies, garlic, and tamarind extract. Taiwanese black vinegar is similar in that much of its flavor comes from infusion. First, a basic vinegar is made with sticky rice. “Then we add carrots, onions, vegetables, mushroom, tomatoes, etc. It’s steeped for a minimum of one year,” says Cindy Cheng, a spokesperson for Kong Yen, the largest industrial black vinegar factory in Taiwan. Wu Yin Vinegar, another major Taiwanese vinegar brand, makes its rice vinegar with Taiwanese sticky rice and malt. “It’s inoculated with a starter that we’ve had for over 100 years for about eight months,” says Kao Chi-ting, owner of Wu Yin Vinegar, before it’s infused with licorice and caramel.Taiwanese black vinegar smells simpler, fruitier, and cleaner, says Ivy Chen, a cooking teacher in Taipei. “Chinese vinegar, because of the aging process, is deeper and has more flavor,” with a funkier aroma.Because recipes for black vinegar are wildly divergent—by country, region, and company—the rule of thumb is to take cues from the region where the vinegar comes from and the dishes that the area is known for. “Shanxi vinegar is good on noodles. Zhenjiang vinegar is good on salads,” Lin advises. In Taiwan, vinegar is used sparingly—a drop or two on a finished soup. And in China, it’s most often used in conjunction with soy sauce. But if all that is too confusing, you can’t go wrong with a universal dressing made up of equal parts soy, vinegar, and oil.“Add a tiny bit of salt, garlic, and sugar. This is a very basic sauce that can be put on salads, noodles, or even used as a dipping sauce,” Lin says.Black vinegar + watermelon:Watermelon and Snap Pea SaladTake sweet, juicy melon into the realm of dinner with a hit of Taiwanese black vinegar. (Chile crisp, fish sauce, and fried shallots help, too.)View RecipeClarissa Wei is an American freelance journalist based in Taiwan.Explore Bon AppétitVinegar GuideVinegarChinaTaiwanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-29", "author": ["Condé Nast", "Clarissa Wei"]}