{"id": "49ca94cebe97870a8a67de72a64dc1a2", "url": "https://www.bonappetit.com/story/lella-alimentari-brooklyn", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "My Version of Self Care Is Going to Lella Alimentari | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Version of Self Care Is Going to Lella AlimentariIt’s my favorite way to chill out on a Saturday afternoon in Brooklyn.By Emily SchultzSeptember 13, 2019FacebookTwitterEmailPhoto by Baramee ChindavongFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve always admired the people who spend their Saturday mornings in an intense kickboxing class or doing downward facing dog in a 104ºF room. I’m not one of those people. My Saturday self care routine involves a one-mile stroll from my apartment in Brooklyn to Lella Alimentari.Lella is a hybrid of a third-wave coffee shop and a teensy grocery store plucked off of a vicolo, or small alley, in Italy. The shelves are stocked with imported goods—cans of tomatoes, beautifully packaged olive oil, bags of dried pasta—while the walls look like something a nonna decorated, down to the children’s dolls. My friends refer to Lella as “ciao,” which is how the Tuscan baristas greet you as you breeze through the doors.Lella is never not packed, but somehow my friends and I always hold court at the long white-washed table that runs down the middle of the cafe. It’s our version of the Central Perk couch. More often than not we’ll be nursing hangovers with a large iced coffee and a piadine, an Italian flatbread sandwich that’s stuffed with prosciutto cotto, speck, stracchino cheese, arugula, and radicchio. The bitter greens paired with the warm, melty cheese, and the salty cured meat makes me feel like I’m eating a balanced meal—it’s texturally balanced so that counts. Plus, everyone knows the best hangover cure is carbs, cheese, and meat. Sometimes we’ll moonlight as people who have it together, coming in earlier before the crowds roll in and catching up over breakfast salads of egg, shishito pepper, and avocado. All the shades of green remind me of what’s in an actually balanced meal.No matter the breakfast order, a visit to “ciao” is the perfect way to start my Saturday, no boxing gloves or smelly gym locker rooms needed.Go there: Lella AlimentariExplore Bon AppétitHighly RecommendCoffeeBrooklynRead MorerestaurantsThe Backyard at Saturdays Is My One Way Ticket Out of NYC’s Gnarly Summer HeatBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-13", "author": ["Condé Nast", "Emily Schultz"]}