{"id": "49d7efa7aef601e62e876e157ccefb8f", "url": "https://www.bonappetit.com/story/homax-steel-wool", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Homax Steel Wool Is The Only Kitchen Scrubbing Pad That Matters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Only Kitchen Scrubbing Pad That Matters Is Homax Steel WoolFor the gunkiest stuff on my pots, pans, Dutch ovens, and baking sheets, I count on these steel wool pads.By Carla Lalli MusicMarch 24, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When it comes to doing the dishes, steel wool is the big bad bully on the block. Steel wool is a scrub pad on steroids, a bristle brush with a vendetta. I have been using fine-grade steel wool as my kitchen sink strong man ever since I realized I could de-gunk everything from my cast-iron pans to my Dutch ovens with them. These days, I keep a 12-pack of the ubiquitous Homax brand permanently stocked alongside my dish soap.You can find steel wool at the hardware store or online, where you’ll be faced with many choices. Steel wool is essentially a sponge made of steel filaments that are wound together, and it comes in various grades from super fine (#0000) to heavy duty (#4). The higher the number, the more abrasive the pad. For my indoor dish-doing, I like to use #00, which is scratchy enough to remove truly baked-on, caked-on particles that are fused to a cooking surface but won’t damage my cookware. I’m talking about the juices of a fruit pie that overflowed onto a rimmed baking sheet during baking and carbonized there, or the ring of oily gunk that adheres to the edge of a saute pan after cooking a pork chop on high heat. I soak the pan in soapy water, then go in with the steel wool to dislodge and loosen whatever is stuck. Works like a dream.I also use #00 to polish the outside of my stainless steel kettle, the undersides of my Dutch ovens and baking sheets, and my stove’s griddle. Be careful what you use steel on—it can leave scratch marks on glossy finishes (i.e. a highly polished stainless fridge door), but for cast-iron, stainless-steel, or enameled cookware, I’ve never had a problem (but test an inconspicuous spot first if you’re concerned). For truly tough stuff—oven racks, grill grates, stovetops, the inside of your oven—get yourself some #2 steel wool, which will coarsely cut through thick layers of scuzzy schmutz like an industrial street sweeper.I find for most jobs, each pad is a single-use item. They are not expensive. Once the clean-up is complete, generally so is the wool. But if you want to use it more than once, shake out all the water and keep it in your under-sink cabinet to prevent rust. However, if rust happens, just rinse it out, since it won’t impact the scratchiness of the strands themselves. One final note: Those steel filaments are very coarse and can be murder on your hands. Wear a pair of dishwashing gloves to protect your digits!Laura MurraySteel Wool, 12 Pads$6 at AmazonExplore Bon AppétitShoppingToolsCleaningRead MorecultureI Didn’t Know a Fancy Kitchen Towel Could Bring Me This Much JoyBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-24", "author": ["Condé Nast", "Carla Lalli Music"]}