{"id": "49e22124e0b1325d9de0294a5b72762c", "url": "https://www.bonappetit.com/story/spruce-creek-provisions-kittery-maine", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Maine Wine Shop That Makes Going Home Even Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Maine Wine Shop That Makes Going Home Even BetterSpruce Creek Provisions has all the natural wines I need.By Bryan FountainOctober 24, 2019FacebookTwitterEmailPhoto by Pierce TwohigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Since moving to New York City, I make it to my home state of Maine a few times a year and I love visiting for many reasons. First, my parents live near the beaches. Second, maybe you heard already, but there is a budding food scene in Portland and the Kittery/Portsmouth area, with chefs who relocated from Boston and NYC to open relaxed spots with food on the same level as any major city. One thing I don’t always love? Schlepping natural wine by the case from Brooklyn because I refuse to drink Canyon Road White Zinfandel at restaurants or the Whispering Angel at our local Hannaford!Lucky for me, that all changed after a recent trip, when I found the solution to my wine woes: Spruce Creek Provisions, an unassuming mercantile next to a Subway sandwich shop in the middle of a sprawling outlet mall in Kittery, Maine. My mother had recently been told by a friend that it has great Maine beers and a make-your-own-six-pack situation, something my father quickly got behind. However, I was still doubtful that I’d find anything I liked and followed them in.No sweeter sight than this.\nPhoto by Pierce TwohigTo say I was pleasantly surprised would be an understatement. The wooden crate shelves are lined with all kinds of local hooch and many natural wines that are my go-to’s in New York, like the tart and punchy Poderi Cellario É Rosato and the minerally, floral Mariotti ‘Smarazen’ Bianco. I was like a (drunk) kid in a candy shop, quickly scanning for all my favorite bottles and stumbling upon some new ones like No Es Pituko, an organic and unfiltered Chilean chardonnay that smells like a foot but tastes like heaven. It’s become the only white wine kicking around my Brooklyn apartment, ready to pop open for guests or bring to a friend’s house.The price points here are another game changer. I find the bottles to be a few dollars cheaper than in NYC—and when it comes to buying a case, those dollars add up! Now Spruce Creek Provisions is not only a mandatory stop on my way to my parents, but on my way back to the Big City too. Clearly, Spruce Creek Provisions has brought the light to southern Maine. And I’m bringing a piece of it back to New York.Go there: Spruce Creek ProvisionsExplore Bon AppétitHighly RecommendWineMaineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-24", "author": ["Condé Nast", "Bryan Fountain"]}