{"id": "4a03c18992c9281539287736413ee02e", "url": "https://www.bonappetit.com/story/buttermilk-summer-pasta-recipe", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "If You’re Not Using Buttermilk in Your Pasta, You’re Missing Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Not Using Buttermilk in Your Pasta, You’re Missing OutThis new recipe uses buttermilk in a tangy-creamy pasta sauce that we never saw coming.By Alex DelanyJuly 16, 2018FacebookTwitterEmailFacebookTwitterEmailMy pasta sauce portfolio is expansive. Egg-based sauces. Tomato-based sauces. Cheese-based sauces. Butter- or wine- or olive oil-based sauces. I love them all. But in my years of cooking pasta at home, I’ve never considered a buttermilk-based sauce. That is, until I made senior associate food editor Molly Baz’s new recipe for orecchiette with buttermilk, peas, mint, and pistachios. Now, I am 100 percent onboard with the creamy, tangy attitude that buttermilk pasta sauce brings to the summer table.Most pasta sauces that seem like they need something usually need acid. That little bit of zip makes each bite tantalizing, and makes you go back for more. Sometimes that tang comes from vinegar or tomatoes or lemon juice or maybe even raw garlic, but I’d never thought of using buttermilk as the source of that flavor. Now it makes perfect sense. Buttermilk provides both the creaminess and the zing in the sauce. Two birds. One stone, as the saying goes.But this pasta hits more than two birds. It grabs the whole flock. You get a toasty, nutty flavor from the pistachios (which take you less than ten minutes to toast and crush). Then the freshness of mint cools the whole thing off. To be honest, the mint in this pasta made me reevaluate my whole approach to herbs in pasta. Basil? Huh? What ever happened to that guy?And the leeks and peas balance the multitude of flavors with some sweetness. Plus, I love peas. We need more peas in our lives, generally.Yes. This is the good stuff.\nLaura MurrayAnd for all it has going on, this recipe is surprisingly easy. There’s no advanced pasta technique here. No heavy, expensive machinery. You toast nuts. Boil pasta and peas in the same salted water. Cook some leeks, garlic, and mint in butter. Add buttermilk and pasta water to create a glossy, luxurious sauce. Mix that al dente pasta right in the pan to lacquer it up, right before you top it with pistachios and fresh mint.Buttermilk might make this an unexpected summer pasta, but don’t question it. It all makes sense. The ingredients. The flavors. The simple technique. Why haven’t you been making this dish for years? Never mind that. You can start doing it now.Get the recipe:Orecchiette with Buttermilk, Peas, and PistachiosWe’re throwing this pantry pasta all-star a “Welcome to Summer” party with peas and mint.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast", "Alex Delany"]}