{"id": "4a0aa9f0d6f380cb1d0e2f1a232fcd79", "url": "https://www.bonappetit.com/story/mandy-lee-hong-kong", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Mandy Lee's Confessions of an Escapist Cook in Hong Kong | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAs Protesters March in Hong Kong, I Cook to EscapeMandy Lee cooked as a way to relieve the pressure of living under authoritarian rule in Beijing. Now, protestors are marching for democracy in her current home, and she wonders if escapism cooking is enough.By Mandy LeeOctober 7, 2019FacebookTwitterEmailPhoto by Willie Siau/SOPA Images/LightRocket via Getty ImagesFacebookTwitterEmailThe rain had just begun to batter the island of Hong Kong on a sweltering afternoon. I stood in my kitchen, feeling quiet and stagnant, trying to decode the golden ratio for brewing a cup of silky, Hong Kong-style milk tea, a legacy of the city’s British colonial past. The typical breakdown is 30 percent orange pekoe black tea leaves for a nice fragrance, 30 percent broken orange fanning leaves for intensity, and ten percent tea dust. It is, after all, a people’s drink. The last 30 percent is evaporated milk. They say that millions of cups are brewed each day, and have been for decades. So long and so ingrained in the culture that it’s as much a part of Hong Kong as the distinctive people who inhabit it.The silence was abruptly broken by the screeching cry of my kettle. I rushed to turn off the burner. Across the room, the TV showed a black blanket of soaking wet protesters numbering over a million, stretched down Hennessey Road as far as the eye could see.As I was wandering in Hong Kong’s past, they were marching for its future. Democracy is what’s on their table.I felt an unease creeping up my chest. I tried to ignore it by flooding the small nest of tea leaves trapped in the bottom of my tea pot, watching them tumble and roil hopelessly. “Focus,” I said out loud. I couldn’t distract myself from the troublingly familiar predicament. The very reason I am in Hong Kong is because I couldn’t live in mainland China—precisely what Hong Kong is set to become, and what it is fighting against.In 2008, shortly after the titanic economic crash that would later come to be known as The Great Recession, I left New York with my husband who had been offered a job in what was at the time a more stable market, in Hong Kong. About a year and a half later, for reasons no less pragmatic, we again moved to Beijing. Stability, it seemed at the time, was a smart if not inevitable choice.Little did I know, the move to Beijing marked the beginning of a very difficult period of my life. Living under China’s increasingly ruthless authoritarian rule was, to say the least, extremely hard. It is a country where the personal surrender of liberty is made painfully apparent every day. You are constantly reminded of what you are and aren’t permitted to watch, listen to, and say. Where even access to VPN (the “virtual private network,” required to bypass the strict censorship) is closely controlled by the moody mercy of the Chinese government. Most of the VPN providers are inaccessible in China, and even the remaining couple become difficult if not completely unreachable several times a year—during “sensitive” holidays such as National Day or Chinese New Year, anniversaries like the 1989 Tiananmen Square protest on June 4th, or during major government meetings and events. Frankly, sometimes it’s for no apparent reason at all.Surely, as many would argue, if you just accept it—or take it lying down—the daily functions of life can and do go on. But I couldn’t take the constant psychological bullying. Worst of all, I couldn’t escape the thought that by accepting the oppressive reality in exchange for economic stability I was in some way complicit. After all, I had been brought up to uphold the principles of democracy and civil rights. The very act of living in Beijing became an emotional collision.I couldn’t escape the thought that by accepting the oppressive reality in exchange for economic stability I was in some way complicit.But I didn’t leave. I made dinners. I abided.Then one night, as mundane and miserable as any other, it was as if something in me snapped. It was a neurological event. Perhaps triggered by the salted sting of watching happier people living happier lives in Rome on TV, or the toxic cocktail of Beijing life, I found myself drifting into the kitchen in resolute silence. I cleared the counter and laid down my subjects, one by one, in almost pathological orderliness: Unbleached flour with 9% protein, free-range egg yolks, water, and salt. I remember plunging my hands into the mixture, squeezing, choking, and tearing until the unruly coagulation transformed into a cohesive globe. After allowing it to unwind, I forced the dough-body through the cold, unrelenting steels of the pasta machine, watching the malleable mass extrude under pressure in a pristine sheet of silk. I paused momentarily to relish its form, then I robotically drove incisions into it until its severed parts lay in uniform strands on my bare countertop.I stood for a while looking down on my hands encrusted with dried dough, mildly confused about what had just happened. I felt consoled, and my anger had subsided.Two weeks later, after a staggering number of dough casualties—as well as RMBs spent on imported Italian flours and enough egg-white omelets for dinner to threaten my  marriage—I finally emerged from the kitchen bearing a bowl of perfect, fresh tonnarelli. The quintessence of cacio e pepe. It was the first time in my almost 20 years of cooking, and three-plus decades as a quitter of most things I didn’t immediately succeed at, that I had refined a recipe to perfection. Something exactly as I wanted it to be.I had become what I now like to call an escapist cook.Two years after moving to Beijing and not too long after my perfect tonnarelli, I started a food blog. It became a sanctuary as well as a sentence, where I retreated in desperate, sheepish, and self-loathing isolation: cooking, whisking, and documenting as I felt the fight inside me slowly dribble away.Then in 2016, not driven by a resurgence of moral commitment but instead crushed by the deaths of my “son\" and “daughter—a 15-year-old toy cup Maltese and nine-year-old brindle French bulldog—I finally fled Beijing. I simply couldn’t accommodate it anymore. My husband and I moved back to Hong Kong as emotional refugees. I even wrote a cookbook about it.Although often projected as city of modernity, Hong Kong was never a democracy. After its return to China in 1997, Hong Kong, a former British colony, was granted a semi-autonomous status, allowed to retain a separate governing and judiciary system with freedom of speech and press that is otherwise an impossibility in mainland China. People are allowed to roam free on the internet, retain rights to information, and Netflix and chill. And yet, Hong Kong does not grant universal suffrage.Call it a gluten-free bread; it’s something, just not the best part.China has slowly kneaded this island to fit its authoritarian model, attempting to introduce “patriotic education” in public schools and eroding Hong Kong’s judicial independence, readying it for the steel jaws of mainland life.I had watched from afar as a resistant, pro-democracy movement arose, highlighted by the yellow umbrella movement in 2014. And in the spring of 2019, a million people in this city of only seven million took to the streets.At the time China had made its boldest advancement yet on the erosion of freedom in Hong Kong: A proposed bill that would allow extraditions from Hong Kong to mainland China, something China was in fact already doing illegally. A few years ago, for example, five anti-China book publishers in Hong Kong vanished overnight only to resurface three months later in Chinese custody, “apologizing” for their misconduct. The new bill would only make these kinds of arrests easier.The protests started as peaceful rallies. But as the public voice fell on deaf ears, a small number of protestors eventually turned to violence, pushing back against the riot police and garnering international attention. After three months of unrest, the government agreed to withdraw the bill. Yet it has since become clear that the protesters will not be satisfied with anything less than real democracy. For those of us who remember (all too well) the bloody massacre in Tiananmen Square, this is a dangerous stance to take. If we die, well, we were going to die anyway.Right or wrong, hopeful or disillusioned, in the sun, in the rain, through the teargas and the rubber bullets; under the batons of the police who have been thrown in the middle of this messy political sandwich, people keep marching.I watched in awe, and with a sadly familiar shame. As a Taiwanese, like so many others from democratic countries, my democracy is an inheritance prepaid by the lives of a generation long before me. I realized I had spent my life in the luxury of forgetting that it came at such a high price.I twisted my thoughts back to the loose black tea leaves inside my teapot. Despite being small and scattered, their hickory essence had spread, infusing the entire body of water––slow, organic, resolute. A bittersweet transformation. A foolish hope, maybe. But all the best kinds are.Explore Bon AppétitHealthyishChinaessayRead MoreLifestyleHow Cooking Made Me See My ADHD as a Talent Instead of a ShameBy Isabelle O'CarrollRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Mandy Lee"]}