{"id": "4a198457e21158be9b71aa624cf64ae2", "url": "https://www.bonappetit.com/story/never-fail-aioli-topped-jammy-eggs-recipe", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "There Is No Lazier, More Impressive Snack Than Aioli-Topped Jammy Eggs  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Is No Lazier, More Impressive Snack Than Aioli-Topped Jammy EggsThese are what I make when I'm too tired to prep an appetizer—but not too tired to invite my friends over for dinner.By Sarah JampelJune 14, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.With even the smallest amount of TLC, a boiled egg goes from the most boring snack on the face of the planet to a thing of beauty worth fawning over. So when I'm feeling kind of tired but I've done the thing where I invited people over without realizing just how tired I would be (helloooo, Friday night), I turn to these jammy eggs. Smoky, spicy, briny, and bright, they're just one notch more advanced than boiling eggs, but you'd never know it from tasting them.You only need to do three things to make these halved boiled eggs (...yawn) into a we're-having-company-over appetizer. First, there's the way the eggs are cooked. Follow this method and you'll get easy-to-peel eggs with gooey, sunshine-yellow yolks every single time. Just gently lower the eggs into boiling water (starting them in hot water makes them peel like a dream later on—no clingy shells!), set a (loud!) timer for 8 minutes, and fill a big bowl with ice water. As soon as your timer goes off, transfer the eggs to the ice bath to halt the cooking and preserve that still-soft center.Then, there's the silky sauce that makes the eggs taste even creamier, a.k.a. \"paprika aioli.\" Please, feel free to continue referring to it as paprika aioli to your friends, but who are we kidding? It's mayonnaise seasoned with smoked paprika. Sometimes, if I've got a little more juice, I'll add a teaspoon of lemon zest, a clove of grated garlic, a splash of hot sauce, or a generous grind of black pepper to the sauce.The final touch is \"pepperoncini salsa,\" which is a fancy way of saying parsley plus jarred diced pepperoncini. The peppers are already tangy, which saves you from having to add vinegar or lemon juice for brightness. I don't usually keep pepperoncini around, so I often swap in something else that's salty and/or pickled: olives, capers, an actual pickle—you get the idea. And in parsley-scarce times, basil, cilantro, and dill have stood in as the herb. Would I use a couple of celery leaves or a wriggly arugula in a moment of need? Just watch me!When I present these eggs to my friends, ooh-ing and ahh-ing, I alone know the truth: These took me all of 10 minutes to make—and I kinda sorta very much wish I could eat the whole plate myself.Get the recipe:Jammy Eggs with Paprika AioliLike deviled eggs—but faster, easier, more delicious, and fancier-sounding.View RecipeExplore Bon AppétitNever FailEggRead MorecookingDeviled Eggs Are a Waste of Time. There, I Said It!By Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Sarah Jampel"]}