{"id": "4a1bd4102b899130976c596902b4f13c", "url": "https://www.bonappetit.com/story/6-of-our-favorite-healthyish-approved-pizza-spots-on-caviar", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "6 of Our Favorite Healthyish-Approved Pizza Spots on Caviar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored6 of Our Favorite Healthyish-Approved Pizza Spots on CaviarBy Caviar October 18, 2018FacebookTwitterEmailFacebookTwitterEmailThe evolution of pizza, much like the progression of ordering delivery, has made great strides in the last decade. Today there is a pizza for every mood, attitude, and food preference. Thanks to the Healthyish-approved restaurants on Caviar, you can get wholesome, healthful pizzas (yes, pizza!) delivered right to your door.Whether you’re ordering a veggie-covered ‘za from the Caviar app on your cab ride home or clicking on a classic pepperoni with gluten-free crust from the comforts of your couch, it’s never been easier, tastier, or more healthful to order pizza. In D.C., NYC, L.A., and Chicago, these are some of our top delivery picks for every kind of pie lover, from traditionalists to trendsetters.Chicago Goes Beyond Deep DishWhen you think of Chicago pizza, you probably think of deep dish pies. Perhaps you recall a particular skit in which some sports fans, dressed in Chicago Bears regalia, huddle round a table overflowing with fast-food favorites while interjecting “Da Bears.” Thanks to the passage of time and the invention of Caviar, it doesn’t have to be this way anymore!At Doc B’s Fresh Kitchen, purists can opt in to a margherita, traditionalists may prefer plain pepperoni, and if you want a Healthyish spin on on your ‘za, there are a wealth of options. Try the Kale and Goat Cheese Pizza, the Shrimp and Arugula Pizza, or get all your good fats in one sitting with the Avocado Pizza, which is covered (quite literally) in sliced avocado with pickled jalapeno, cotija cheese, and “frenched” onion.Variety in The DistrictWhile the District of Columbia may not be making headlines for its pizza (they’ve got a few other things going on), the city is a notorious melting pot of cultures and cuisines. Take, for example, Timber Pizza Co. While it was started by two guys who loved pizza and basketball, it now boasts Daniela Moreira as its executive chef. Daniela, an Argentinian native, brought her impressive resume (which includes Eleven Madison Park) and native global flare to the kitchen.In addition to tasty empanadas, the pizzas get flavorful upgrades, too. Bring the heat with The Bentley, which features cured chorizo, sopressata, and Peruvian sweet peppers with spicy honey and hot sauce, or try a unique combo with The Penelope, which has pesto, fresh mozzarella, mushrooms, bacon, and paprika.NYC Pie with an Artisanal TwistLike Chicago, New York City has a reputation to uphold when it comes to pizza––especially delivery. It’s a quintessential part of living in The Big Apple, like getting on the wrong train and going in the opposite direction by accident or getting caught in an rainstorm without an umbrella. It just comes with the territory. Thankfully, New York City also has a reputation for offering its inhabitants almost anything they want, at any time, anywhere. So that homemade pie you’ve been craving with guanciale and pecorino? Yep, you can get that at home, too.Over in Brooklyn, Ops Pizza is shutting down woodfired-pizza haters one pie at a time with their unbelievably fresh, artisanal sourdough pizzas. You could embrace your inner Italian (we’ve all got one) and order the Rojo Pizza, covered in a sheet of mortadella, with peppers and cresenza. Non-meat eaters might consider the Iron Age with mushrooms, mozzarella, Parmesan, and herbs. Or you could err toward a more traditional NYC style with the Square Pie, which has tomatoes, house mozzarella, olives, oregano and basil.Surprise! L.A. Delivers Healthy PizzaSometimes it’s hard to believe that the wellness gatekeepers of Los Angeles allowed pizza into the city at all. But what makes L.A. so great (among sunshine and matcha lattes) is the culinary revolution that has swept the entire city. Today’s L.A. marries its long-standing zeal for wellness-friendly ingredients with everyone’s favorite food, pizza.Downtown at Zinc Cafe (delivering only on Caviar) they’re mixing things up with options like a breakfast pizza, piled high with mushrooms, harissa, eggs, leeks, and shallots, or the shaved asparagus and quail egg pizza made with ingredients that might as well be Kryptonite, like bechamel, burrata, garlic confit, and lemon rind. For the less adventurous pizza eater, there are creative standards, too: A pesto pizza made with homemade pesto, roasted peppers, sun-dried tomatoes, and toasted pine nuts, or a funghi pizza for mushroom lovers.Over at fresh-is-best locale Ostrich Farm in Echo Park, husband and wife duo Jaime Turrey and Brooke Fruchtman may not be doling out pies, but there you’ll find pizza’s distant cousin, the flatbread. There’s oil, herbs, and sea salt, but we recommend keeping it as close to actual pizza as possible with cherry tomato confit, basil, and burrata. (That’s basically a margherita pizza.)If you really want to out-L.A. yourself, however, there’s Jewel LA in Silverlake, where chef Jasmine Shimoda is taking a decidedly modern approach to fresh pizza with crusts made from activated charcoal (the health-related kind, not the grilling kind). The Market Pie has squash blossoms, basil pesto, and almond ricotta, whereas the Black Amber combines kabocha squash, kale, and caramelized onions with chili, almond ricotta, salsa verde, and mint.You want the best, Healthyish-approved pizza? Caviar's got it.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-18", "author": ["Condé Nast"]}