{"id": "4a35c0d4219e3d7da7c35f0551e63f3f", "url": "https://www.bonappetit.com/story/junes-mesh-bag", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "I Can Schlep Without Worry, Thanks to This Mesh Tote | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can Schlep Without Worry, Thanks to This Mesh ToteIt folds up tiny, and can hold up to 45 pounds without the strap digging into your shoulders!By Aliza AbarbanelJuly 23, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Like many New Yorkers, I am a schlepper. In the summer, I wander the city like an overheated turtle, carrying overdue library books, water bottles, and dangerously juicy peaches. So it’s no surprise that I’ve amassed a prodigious collection of tote bags, but they’ve all been banished to one corner in my closet after this mesh carry-all came into my life.I first fell for June’s smaller Mexicana bag last summer, but this year I’m all about its roomier mesh totes. Made in partnership with an independent women’s sewing cooperative in Juárez, the lightweight polyester tote is designed to hold up to 45 pounds—and without the straps digging into your shoulders, I can confirm. Plus, there are two deep interior pockets to safely stash cash, keys, and other essentials that usually get trapped at the bottom of the bag.Sure, the breezy gold mesh fits right in with my summer moodboard (think: beige linen pants and mini bottles of Tajín), but I’m most impressed by its durability. An incomplete summary of things I’ve carried in this bag includes: three wine bottles plus a small watermelon for a picnic, groceries for a six-person dinner, a borderline irresponsible amount of farmers’ market produce any given weekend.Best of all, the whole tote folds up into a card-deck-size roll. On days when I opt for a small purse (okay, it’s really a fanny pack), I stash this bag in a spare pocket for any impromptu purchases. Now I can shop and schlep to my heart’s content.Buy it: The Mesh, $20All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecultureThe Take-Anywhere Plates I’m Using Instead of DisposablesBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Aliza Abarbanel"]}