{"id": "4a3d9a214560d5ac3979a5a247de9c7f", "url": "https://www.bonappetit.com/recipe/rum-cake-with-sticky-maple-glaze-and-coconut", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Rum Cake With Sticky Maple Glaze and Coconut Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueRum Cake With Sticky Maple Glaze and CoconutBy Ayesha CurryNovember 23, 20213.5(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Eva Kolenko. Food styling by Susie Theodorou. Set design by Kira Corbin. On set producer: Jennifer Thomas.EmailPinterestPrintEmailPinterestPrintRum cakes are classic across the Caribbean. Inspired by the cakes she grew up with at the holidays, this version from cookbook author Ayesha Curry gets its cheery flavor from two kinds of rum: spiced rum in the cake batter and dark rum in the maple glaze that finishes it off. The glaze is sticky enough to help toasted coconut flakes adhere for a final touch of texture, but still soaks into the cake to make it moist and delicious.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronNordic Ware Anniversary Bundt 12 Cup, Gold$38 At AmazonElectric Mixer$40 At AmazonWire Cooling Rack$17 At Bon Appétit MarketSilicone Spatula$13 At BA MarketSmall Saucepan$155 At AmazonIngredients12 ServingscakeNonstick vegetable oil spray or unsalted butter (for pan)3cups (375 g) all-purpose flour, plus more for pan13.4-oz. box instant vanilla pudding2tsp. baking powder½tsp. baking soda½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1tsp. ground allspice1cup (2 sticks) unsalted butter, room temperature1½cups (packed; 300 g) dark brown sugar4large eggs½cup vegetable oil½cup spiced rum2tsp. vanilla extract1cup sweetened shredded coconutGlaze and assembly½cup dark rum½cup pure maple syrup4Tbsp. unsalted butterWhipped coconut cream or creamwith finely grated lime zest and/or ground cherries or fresh berries (for serving; optional)special equipmentA 12-cup Bundt panPreparationCakeStep 1Place a rack in upper third of oven and preheat to 350°. Generously coat pan with nonstick spray, then dust with flour, tapping out excess. Whisk pudding mix, baking powder, baking soda, salt, allspice, and 3 cups (375 g) flour in a medium bowl to combine.Step 2Using an electric mixer on high speed, beat butter in a large bowl until light and smooth, about 1 minute. Gradually add brown sugar, mixing to combine after each addition; beat until light and fluffy, about 5 minutes. Add eggs, oil, rum, and vanilla and beat until incorporated.Step 3Reduce speed to low and gradually add dry ingredients in 2 additions, beating just until combined after each addition and scraping down sides of bowl as needed (be careful not to overmix). Scrape batter into prepared pan and smooth surface.Step 4Bake cake until golden brown and a tester inserted into the center comes out clean, 50—55 minutes. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Turn cake out onto rack, loosening with a small offset spatula if needed and let cool completely.Step 5Meanwhile, toast coconut in a single layer on a rimmed baking sheet, stirring occasionally, until golden brown and crisp, 8–10 minutes. Let cool.Glaze and assemblyStep 6Bring rum, maple syrup, and butter to a simmer in a small saucepan over medium heat and cook until thick enough to coat a spoon, about 8 minutes. Transfer glaze to a small bowl.Step 7Transfer cake to a large plate. Drizzle glaze over and sprinkle coconut on top.Step 8Cut cake into slices and serve topped with whipped coconut cream with lime and/or ground cherries if desired.How would you rate Rum Cake With Sticky Maple Glaze and Coconut?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleMade this for my husband for Valentine's Day. He loved it! Would double the glaze recipe and serve some on the side to drizzle over individual slices. AnonymousChicago, IL2/15/2022Absolutely delicious! Moist, subtle rum flavor, gorgeous cake..everyone raved!! Very easy recipe too!!Jennifer OLas Vegas, NV12/29/2021Explore Bon AppétitCakeDessertMapleCoconutFruitMaple SyrupBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ayesha Curry"]}