{"id": "4a3e5c7c70ee9726d41aa6412bc08369", "url": "https://www.bonappetit.com/story/frying-mistakes-and-how-to-avoid-them", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "5 Things That Can Go Wrong When Frying (and How to Avoid Them) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopeffed it up5 Things That Can Go Horribly Wrong When Frying (and How to Avoid Them)A pot of scalding hot oil? Sounds kinda scary. But we'll get you through a deep-fry without a drop of sweat (or oil) on your brow.By Claire SaffitzMay 23, 2018FacebookTwitterEmailFacebookTwitterEmailThe first time I ever deep-fried something, I was terrified. I was making yeasted jelly donuts, and I was so nervous that I fried them, unblinking, with a pounding heart and sweaty palms. The potential for disaster seemed huge. But now, about a thousand trips to Deep-Fry Town later, I know it’s not a big deal—as long as you follow the right protocol, that is. So if you’re a hesitant first-time deep-fryer with crispy fried chicken sandwich dreams, read on for all the common pitfalls and the best ways to avoid them.Your Pot of Oil Bubbled Up and Spilled Over the Sides of the Pot and Onto Your StoveAlways deep fry in a nonreactive, heavy pot with high sides, like an enameled Dutch oven. A heavy pot ensures even heating which means more even cooking. As soon as food hits the hot oil, the heat from the oil starts to drive off the moisture from the surface causing all sorts of tiny steam bubbles to escape. If you add too much to the pot at once, the volume of bubbles could cause the oil to rise up and over the sides of the pot—THIS IS NOT GOOD. So never fill the pot more than two-thirds full with oil to account for displacement and bubble action.The Thing You Fried Got Too Dark on the Outside While the Inside Was Still RawThis means your oil temp was too high, which caused the surface of the food to overcook before the inside is ready. Deep-frying properly requires you to keep the oil at a precise temperature range depending on the food. If you’re frying in more than an inch of oil you really should invest in a deep-fat thermometer so you can monitor the temperature and know when to adjust the heat. When you add cold food to hot oil, it will cause the temperature to drop, so you need to compensate by increasing the heat. Using a thermometer is the only way to make sure you’re keeping it constant.The Thing You Fried Came Out Unappealingly Limp and Greasy.Your oil probably wasn’t hot enough. Generally speaking, the higher the temperature the less oil is absorbed by the food and the crispier the result. (See above about using a thermometer to monitor oil temperature.) Also, make sure that you are transferring the food to a paper towel-lined tray or a wire cooling rack directly from the frier so that it can cool properly and any excess oil can drip off.Lower food in slowly and confidently. No splatters at all.\nThe Oil Splatters When You Add the Food.Annoying, potentially hazardous splatter occurs when water droplets hits hot oil (oil and water don’t mix, kapeesh?). If your fry oil is flying out of the pot and hitting you on the arms or in the face, it’s probably because the thing you’re frying wasn’t patted dry. To avoid oil burns, carefully and gently lower the food into the oil with your hands or tongs, and make sure that it drops away from you. Yes, this requires getting close to the hot oil, but it’s actually safer than tossing something in from far away.Neutral oil, being...neutral.\nMitchell FeinbergI May Have Used the Wrong Type of OilAlways fry using a neutral oil with a high smoke point such as vegetable oil (which is what we consider the best oil for frying), peanut, or rice bran oil. Because deep-frying requires a high volume of oil, it’s okay to reuse the oil a couple of times for economy’s sake. When the color or smell of the oil starts to change, it’s time to discard. Dispose of the oil by letting it cool, pouring it back into the empty bottle, sealing the cap, and tossing. The next time you crack a fresh bottle of the neutral stuff, you'll know what you're doing.You know how to fry. Now do it.The Basically Fried Chicken SandwichEverything you want in a crispy chicken sandwich, with none of the fuss.View RecipeExplore Bon AppétitBasicallyDeep-fryOilFried ChickenEffed It UpRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Claire Saffitz"]}