{"id": "4a40e4ea189036079d415db628a222e9", "url": "https://www.bonappetit.com/story/blistered-green-beans", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "A Blistered Green Bean Recipe That Everyone In the Family Will Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Blistered, Garlicky Green Beans You’ll Want to Eat Like FriesFulfill your need for a fast, weeknight green thing.By Alex BeggsJanuary 23, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailOnce I got an email from a Bon Appétit reader who said her husband is a picky eater, and listed all of his likes and dislikes. He likes vegetables, in small amounts, but NO GREEN BEANS. Of all things. Green beans! I’m going to venture he was traumatized by canned ones microwaved with margarine and iodized salt like the ones I grew up with. Or frozen ones, steamed to flavorless mush, also probably in the microwave. Green beans have had some rough times in the efficiency era. So I sent the reader some green-bean-less recipes, and hoped for the best. But we really needed Chris Morocco to help us rebrand* weeknight green beans. Help us, Chris!And he did, because Chris Morocco is a professional. Maybe you’ve had Gan Bian Si Ji Dou before, or can recognize those wrinkly-wonderful green beans by sight from across a crowded dining room. That Sichuan dish of dry-fried string beans, Sichuan peppercorns, chiles, ginger, garlic, and maybe some pickles (among other variations), inspired Chris’s recipe, which replicates that texture, with otherwise pared-down ingredients. The goal was to fry beans that end up concentrated with flavor and this blistered, almost crunchy texture that is, to your brain, potato chips. YUM.Let’s make them together, through words.Heat oil in a cast iron pan until it’s shimmering, then add a ton of green beans that you’ve hopefully dried completely, otherwise you’re in for SplatterTime. Let them brown, almost like you’re making ground meat, for around three minutes, no touching. Turn them with tongs to brown the other side, then the other side, and then the other side...well you get what I mean. They’re round, do your best. Get them wrinkly and blistered to near-burnt. Flavor arrives in the final minute.The final minute!!!This is when you add six sliced garlic cloves, a handful of capers, salt, and red pepper flakes. That simple combo will bring you a slap of flavor. Yeah, it slaps. The garlic will brown quickly, like a minute, and—hurry!—transfer everything to a bowl before it burns. Once you’re eating them all, with your fingers, you’ll realize that you can follow this recipe with any otherwise traumatically blah weeknight green you’ve been avoiding. Brussels sprouts, broccoli, all of those vegetables called out in cartoons when kids won’t finish their plates. Give ‘em another go!Get the recipe:Blistered Green Beans with GarlicGreen beans are shriveled and browned into delicious submission before receiving a flavor bomb of garlic, red pepper flakes, and chopped capers.View Recipe*Let us help YOU rebrand a vegetable for a quarter of the price of any advertising firm. Email staff.bonappetit@gmail.com with your sad vegetable inquiry!Explore Bon AppétitWeeknightGreen BeanSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-23", "author": ["Condé Nast", "Alex Beggs"]}