{"id": "4a5754551bea677ad7b00ccf6f0154f7", "url": "https://www.bonappetit.com/story/pietros-feels-like-coming-home", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How I Got My Booth: For the Tuesday Night Boys, Coming to Pietro’s Feels Like Coming Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I Got My Booth: The Tuesday Night Boys at Pietro’sJason Hochman, Larry Zakarin, and their friends have been coming to this iconic NYC Italian steakhouse for 15 years and counting.By  Eric GinsburgApril 16, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Jason Hochman cut short his first date with future wife Lisa Laforte. He enjoyed her company and would propose years later, but that evening, long-standing plans took precedence. For 15 years, Hochman and six close friends have spent nearly every Tuesday gathered around a corner table at Pietro’s Italian restaurant in midtown Manhattan. Several of them are second-generation customers at the family-run institution, which opened in 1932. Dozens of plaques with phrases like “Meatball brothers” and “Fry it well, son” line the restaurant’s walls, marking booths dedicated to the most loyal regulars. Hochman and his friends have a table by the bar with a plaque that reads: “The Tuesday Night Boys.” Here, where they’ve lingered to watch the Mets in extra innings and marked personal losses and triumphs, Hochman and his longtime friend Larry Zakarin explain what their tradition entails.Who are the Tuesday Night Boys?Larry: I grew up with a couple of the guys from 13 years old, and Jason’s been my best friend since 19. We met at a keg party.Jason: It’s unusual to have friendships that are that long.Larry: Probably one of the most unique things about it is that we have become friends with our friends’ friends. We’ve really intermingled our lives.Jason: We don’t go outside of the circle.Larry: We’ve had some guys fall in, we’ve had some guys fall out. Once you come, you’re always invited.Why did the group start, and why Tuesdays?Larry: The dinner really started because we wanted a guys’ night out. When I got married, I wasn’t seeing my friends a lot. We had to find a night that nobody cared about, that the wife didn’t care about, a night that was kind of always free, and it ended up being Tuesday night.Why did you choose Pietro’s?Larry: It was a special place. We would go out to nice restaurants, and we would spend a lot of money. The food and the service was always okay. When we came to this place, we got treated well.Jason: Consistency. The one word for the whole story is consistency. You have consistency in the restaurant, and you have consistency in the friendship. When you come to Pietro’s for 15 years every Tuesday night, you feel like you’re coming home.Come every Tuesday? Bring your own plaque.\nPhoto by Emma FishmanYou’ve clearly become close with the people here.Larry: When I lost my dad about seven, eight years ago, I wasn’t coming out on Tuesday nights as much. They all kind of harassed me to come. I came down here, we went to dinner, and [owner] Billy [Bruckman] Sr. found out what was going on. He came over to the table, gave me a hug, bought us all dinner. It was a good feeling. They care about us. They definitely do.Jason: I don’t call for reservations. I text.Larry: We’ve brought people from around the world here. When you come with clients, and you don’t have a menu and you order for the table, and they bring out all the delicious food, people think you’re Tony Soprano.What do you order?Larry: The order for Tuesday nights is usually chopped salad and Caesar salad, and everybody gets half-and-half on their plate. We get cottage fries that we order early because it takes 30 minutes to make them. Salami and cheese, always. And for dinner, we get chicken Pietro, which is Italian fried chicken. We get steak, medium, sliced; we get chicken Parmesan; we get shells a la nat [pasta swimming in a rich veal marrow sauce].Jason: We only do family-style.How did you get your names on the wall?Jason: I said, “Billy, we’ve been coming here long enough, I don’t have a plaque on the wall.” He said, “You make it, I’ll put it up.” That’s exactly how it happened.Larry: That night was so great, putting it up. We’re the youngest crew in the whole place. When we first started coming here, we would have to wait for a seat.Jason: I earned this table, babe.Eric Ginsburg is an independent journalist with a soft spot for chicken parm.Explore Bon AppétitRestaurantsItalian AmericanRed SauceNew York CityRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Eric Ginsburg"]}