{"id": "4a584211a77d9033e9faf3a90a8ac160", "url": "https://www.bonappetit.com/recipe/sweet-and-spicy-cucumber-salad", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Sweet and Spicy Cucumber Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueSweet and Spicy Cucumber SaladBy Yia VangApril 14, 20204.3(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintSpicy, funky, and sweet, this side dish plays on the vibrant flavors of Thai papaya salad with the unexpected addition of tamarind. This recipe is from chef Yia Vang of Union Hmong Kitchen in Minneapolis.Ingredients4 servings½bunch cilantro1small shallot, finely chopped1garlic clove, finely grated2Thai chiles, finely chopped¼cup tamarind concentrate2Tbsp. fresh lime juice2tsp. fish sauce6medium Persian cucumbers or 1 large English hothouse cucumber, some peel removed in thin alternating strips, halved lengthwise, thinly sliced on a diagonal1cup cherry tomatoes, halvedKosher saltStore-bought fried shallots and coarsely chopped salted dry-roasted peanuts (for serving)Ingredient Info:Tamarind concentrate, often labeled “concentrate cooking tamarind,” can be found at Asian and Thai markets or online. We like Tamicon Tamarind Concentrate ($7; thespicehouse.com).PreparationStep 1Thinly slice cilantro stems until you have about 2 Tbsp. and place in a large bowl. Coarsely chop remaining cilantro; set aside for serving.Step 2Add shallot, garlic, chiles, tamarind concentrate, lime juice, and fish sauce to bowl with cilantro stems and mix well. Add cucumbers and tomatoes, season with salt, and toss until everything is nicely dressed.Step 3Transfer salad to a platter and top with reserved chopped cilantro, then fried shallots and peanuts.How would you rate Sweet and Spicy Cucumber Salad?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleAgree with the other reviewers. Way too much tamarind in the recipe, which made it nearly inedible. Ben B.Seattle, WA11/12/2021Tasty with some heat. Based on other reviews, I cut back the tamarind to 2 Tbsp. I agree that the description mentioned sweet as part of the flavor profile and sweet is lacking. Next time I’ll add some coconut or brown sugar.  I only had lemon on hand, which worked fine. And I used a Kirby from my garden, which I seeded. I’ll use two cucs next time. Went nicely with our Thai leftovers from last night’s dinner. LIMamaLong Island8/8/2021It's a loooot of tamarind. We ended up putting some agave to add sweetness and some avocado to mellow it out. The mix of components are a good idea but the proportions seem way off.AnonymousBrooklyn, N Y5/3/2021Where does the sweet come in? I\"m not seeing any ingredients that would offer a sweet taste? I followed the recipe and found the sauce overly bitter, so I'd love to sweeten it up.AnonymousMinnesota8/22/2020Honestly, this is the best salad in the world. It is simple and so flavourful. I make this once a week and crave it even more frequently. I couldn't find tamarind and did extra lime juice + brown sugar. I dream about this salad.HighlightergirlToronto7/25/2020This is so good wow. Didn’t have fried shallots the second time I made this and still so good. Subbed serranos for Thai Chile’s. Will be in my summer salad rotation for sure AnonymousSan Francisco6/19/2020Can this be made ahead of time? Or will it get mushy? Made it right before serving and it was the perfect blend of flavor! AnonymousChicago 5/25/2020This is the most delicious salad I've ever made in my life. Perfect for a hot LA day. Like I said before, don't skip the crispy fried shallots or peanuts. I can't edit my last review but I meant to leave 5 stars not 4. 15/10 would make again.lifeis_shortLos Angeles, CA4/22/2020Note the crispy fried shallot and crushed peanut toppings are not included in the ingredients list, they are only mentioned at the very end. If you can't find any crispy fried shallots at the store, BA has a separate recipe for crispy fried shallots from Molly Baz. Make sure to get some peanuts to crush up too. The toppings really make it a great salad with different dimensions. The wording of this recipe needs to be updated to include the crispy fried shallots and peanuts in the ingredients list.lifeis_shortLos Angeles, CA4/22/2020Explore Bon AppétitSaladSoutheast AsianAsianCucumberVegetableCherry TomatoTomatoTamarindCondiments, Sauces & PastesEasyQuickSideDairy-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Yia Vang"]}