{"id": "4a8212ed798f08144f840f05a85e7e58", "url": "https://www.bonappetit.com/story/charlie-max-nude-cooking", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Charlie Max Thinks We Should All Be Cooking Nude | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCharlie Max Thinks We Should All Be Cooking NudeThe model and OnlyFans creator talks about her naked dinner parties and how being in the buff helped her feel safe in her skin.By Jack RieweMay 26, 2021FacebookTwitterEmailPhotograph by Maya BachmannFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Charlie Max, a multidisciplinary artist and model who melds nude, plant-based cooking with body positivity.In an Instagram video from March 14, 2021, Charlie Max is blending a smoothie in a tropical setting. The montage is relaxing and dreamy and the narration is rhythmic and centering. It cuts to her on a breezy balcony, slicing juicy peaches, and then eating a snack in a sunlit windowsill. The video would be nothing out of the ordinary for #foodInstagram, except that Max is doing all of this stark naked. “‘Loving yourself’ goes beyond loving your external self,” she writes in the caption. “It means truly honoring yourself by constantly filling your life with conscious and beautiful things.”The post is quintessential Max; each of the divine-looking vegan dishes she shares on Instagram—or, uncensored, on her OnlyFans account (NSFW)—are served in the nude, alongside an easy-to-follow recipe and a healthy dose of uplifting wisdom. Max created @fude____ (food + nude, naturally) in March 2020 as a way to encourage her stressed and cooped-up followers to take care of their bodies. And also to get more folks cooking naked, an experience that’s helped her heal from feelings of negative body image. Though it’s developed into something even more meaningful: “I didn’t realize how much the food world was meant for me,” Max explains. “I’ve become hyper aware of my purpose and mission, to create experiences that help people feel safe and confident within themselves.”I called up Max on Zoom to chat about nude dinner parties, the power of plant-based cooking, and why taking care of our bodies is more important than ever.I used to be so insecure about my body… that I would wear oversize clothes to hide it. I have a dance background and negative body image is so common in that world. Dance fetishizes “thin,” and surrounding myself with those toxic ideas inevitably influenced my mindset. I would find myself staring at my body in the mirror every single day, analyzing myself and comparing my body to others.Nudity helped me… dive into a journey of self love. Our bodies are our true homes. And when I was able to strip down and feel safe and confident in my own skin, those feelings carried over into whatever I was doing in my everyday life. Combining that with plant-based cooking felt like the organic coming together of two pure states.I started hosting host nude dinner parties… and at first it would be a little uncomfortable for everyone involved, but then eventually they would start to open up. They would feel more comfortable because I created an atmosphere that takes the sexualization out of nudity. Finding comfort, support and acceptance in being nude around my friends allowed me to feel confident in my body.Becoming plant-based was a natural consequence… of educating myself on the food industry. About five years ago I looked further into what I was consuming. I wasn’t really aware of the environmental and negative health effects of things like butter and dairy, and the more information I gathered, the more I was like, “Yeah, no.”Growing up and through college I didn’t have a lot of money… and so it’s always been my mission to take whatever I have and make something gorgeous with it. At five I would cook mashed potatoes or mac and cheese and then add colorful spices to make it cute. When I was living with my best friends in New York, even if all we had was rice and one vegetable, we’d make it delicious and lovely.My favorite herb… is dill. I love it because I have positive memories of eating dill as a kid. So now when I cook, I find ways to add a little. Cooking your own meals can help you tap into your past; those meals and experiences and flavors that are specific to you can become this amazing moment you can share with people.My need for exercise and good food went out the window… after I stopped dancing and got into fashion. Then the pandemic hit and it was a big eye-opener for me to shift my habits and take care of my body because I realized I wasn’t living healthily. I’ve found that the benefits of plant-based food reach beyond my physical body. My mindset is stronger, my body is stronger, the environment is being preserved and it's a wonderful cycle that continues to reap benefits on every level.Giving back is so important… to me. For every recipe made and reposted by my followers I donate to No Kid Hungry because they are on a mission to make sure that every child in the U.S. has the nourishment they need, and Appetite For Change, because everything they do extends beyond the individual and has a broader social and systematic impact. When my followers cook one of the meals, they get to put nutritious foods in their bodies as well as make a contribution to someone else; it's a win-win.I’d love to do a nude, vegan cooking show… in the future. Manifesting: That will happen. Otherwise, I want to keep using my account to encourage others to be more conscious of what they’re eating. I really believe that will start to help people and the planet in both big and small ways.Explore Bon AppétitPerson of InterestInterviewsHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-26", "author": ["Condé Nast", "Jack Riewe"]}