{"id": "4a9a676668bff8777aa0d3d6d54fb32a", "url": "https://www.bonappetit.com/story/how-to-grow-all-the-things", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Learning How to Grow Anything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI'm Growing All the ThingsNotes from senior food editor Christina Chaey on seedlings, sourdough starter, and more.By Christina ChaeyApril 24, 2021FacebookTwitterEmailPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasFacebookTwitterEmailYou know what they say: When life still refuses to give you ’gus even after weeks of patiently waiting, go plant some vegetable seeds and pretend like you know what you’re doing. Or something. At least that’s how I ended up planting a micro veggie garden of Swiss chard, shiso, and edible flower seeds this week. They’re sitting in little pots on my bathroom radiator and I’m praying to Mother Earth that they will sprout seedlings. Did I mention I have no idea what I’m doing? I’m voraciously reading anything I can get my hands on related to gardening for dummies (including Gardening for Dummies). I’m loving this newbie’s guide to vegetable gardening with advice from Jeni Afuso, but also taking any and all recs for your favorite IG gardeners, books, resources, etc.Speaking of trying to keep things alive while having no idea what I am doing, I have a new pet: a sourdough starter I got from my friend and baker extraordinaire Claire Saffitz; I have unofficially named it Claire Too. Maybe everyone else has tired of the at-home sourdough craze that took hold around this time last year, but it’s a whole new world for me, and I am enthralled. I keep Claire Too out on my kitchen counter where I feed her twice a day and stare at her all day long from my office (the dining table six feet away). The bacteria and yeast inside that sticky little quart container have very dramatic lives that play out over the course of a single day as they feast on the flour and water, and I love how it feels like both everything and nothing is happening in there. (It’s a metaphor for me inside the quart container that is my apartment during a global pandemic, get it!)A few more things worth sharing from my little corner of the universe:What I’m cookingIn the May issue of Bon Appétit, you’ll find a story I worked on about food waste and all the micro and macro ways it affects our lives. There’s a very thoughtful guide to composting (even if you’ve never done it before!) written by Aliza Abarbanel, my personal phone-a-friend for all things eco-minded. And there are a handful of recipes too, which we developed with the goal of reducing and/or creatively repurposing our food scraps, such as this Orange Peel Chai that brilliantly works citrus peels into a throat-soothing tea. Or these Stir-Fried Noodles With Chicken, which welcome the random carrot and hanging-by-a-thread scallions hiding in the back of your crisper drawer.What I’m eatingNext week I’ll be checking out events at ADDED VALUE, a collaborative fundraising series happening now through May 2 in NYC and the Hudson Valley featuring all kinds of pop-up dinners, block parties, menu specials, and more with a roster of very cool restaurant partners including Kitty’s, Ha's Đặc Biệt, The Four Horsemen, and more. It’s a joint collaboration between the nonprofit Sky High Farm and grassroots collective FIG, with all funds going to their work toward community-controlled food systems. I couldn’t think of a better way to ease into an extremely special (and safe-but-social) spring than by eating something extremely delicious made by people who are banding together in support of a more just food system.I’ll be back with a report on seedling activity and Claire Too in two weeks.Spring into these recipes:Photo by Gentl & HyersRicotta Dumplings with Asparagus and Green GarlicPea and Ricotta Potstickers With Homemade Dumpling WrappersChicken Breast With Peas and CroutonsFried Rice with Spring Vegetables and Fried EggsSpring Hot-and-Sour SoupBA’s Best BreadExplore Bon AppétitHealthyishWhat's Chaey Cooking?SpringessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-24", "author": ["Condé Nast", "Christina Chaey"]}