{"id": "4ab765cdbdc9a308e4a12bf66838382c", "url": "https://www.bonappetit.com/recipe/shrimp-and-crispy-rice-with-citrus", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Shrimp and Crispy Rice With Citrus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueShrimp and Crispy Rice With CitrusBy Kendra VaculinNovember 23, 20214.7(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food Styling by Pearl Jones. EmailPinterestPrintEmailPinterestPrintHere’s an idea inspired by tahdig, socarrat, and other forms of crispy, crusty scorched rice prized ’round the world: use a hot, oil-slicked pan to impart a delightful crunch to a fresh pot of rice—or skip step 1 and use a few cups of leftover rice straight from the fridge! Here, that rice is paired with rounds of juicy citrus, sliced avocado, and tender sautéed shrimp. For the most striking presentation (and the widest range of sweet to tart flavors), choose a mix of fruits, like blood oranges, grapefruits, and Cara Caras. Tinned tuna dressed in olive oil is an easy swap for shrimp.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMesh Sieve$13 At AmazonMedium Saucepan with Lid$36.99 At AmazonMicroplane Grater$16 At AmazonLarge Nonstick Skillet$50 At AmazonCitrus Juicer$7 At AmazonParing Knife$10 At AmazonWhisk$10 At AmazonIngredients4 Servings1cup medium- or long-grain white rice½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more12oz. mixed citrus (such as Cara Cara oranges, blood oranges, and/or grapefruit)2garlic cloves, finely grated2Tbsp. fresh lime juice4Tbsp. extra-virgin olive oil, divided½tsp. mild chile flakes, plus more for serving1lb. shrimp, peeled, deveined, tails removed1avocado, sliced1small red onion, thinly sliced3cups arugulaPreparationStep 1Rinse rice in a fine-mesh sieve until water runs clear. Place in a medium saucepan; add ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and 1¼ cups water. Stir well, then bring to a boil. Cover with a lid and reduce heat to lowest setting. Cook, undisturbed, 15 minutes. Remove from heat, uncover, and fluff rice with a fork.Step 2Meanwhile, slice an orange in half and finely grate in zest from 1 half into a large bowl. Squeeze juice from same half through a fine-mesh sieve into bowl; discard seeds (if using grapefruit, use 2 tsp. zest and 3 Tbsp. juice). Whisk in garlic, lime juice, 2 Tbsp. oil, and ½ tsp. mild chile flakes.Step 3Meanwhile, remove peel and white pith from remaining citrus; discard. Slice citrus into ¼”-thick rounds; set aside.Step 4Pat shrimp dry; season with salt. Heat 1 Tbsp. oil in a large nonstick skillet over medium. Cook shrimp, tossing occasionally, until bright pink and cooked through, about 3 minutes. Transfer to bowl with dressing; toss to coat.Step 5Heat remaining 1 Tbsp. oil in same pan over medium-high. Add rice; press into an even layer with a spoon. Cook, undisturbed, until light golden and crisp underneath, 6–8 minutes. Divide rice among plates, arranging crisped side up.Step 6Add avocado, onion, arugula, and reserved citrus rounds to bowl with shrimp and season with salt; toss well. Spoon over rice; drizzle any remaining dressing on top. Sprinkle mild chile flakes over.How would you rate Shrimp and Crispy Rice With Citrus?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleFor those confused by the \"where do I start if I've got cooked rice?\" question: Since you HAVE cooked refrigerated rice, take it out of the fridge as step 1. Proceed to deal with the citrus per step 2 and so forth, onwards to the end of the recipe. However, since this is a bit like a fried rice, for those cooking their rice as part of the recipe, here's some science from the Food Lab: \"As rice sits after cooking, a couple things happen. First, there's evaporation: The rice gets drier. Second, we've got starch retrogradation: Gelatinized starches that have swollen up and softened during cooking will recrystallize as they cool, turning the rice firm and less sticky.\" Dryer rice = better results when frying. You want the rice to form clumps, so letting it cool down so the starches re-crystalize gives you better cohesion. I'll be making this tomorrow... and making the rice tonight. SuzinsfSan Francisco3/3/2022Tasty lunch for California weather that is already reaching 80° in February. Will make again. Jenna C. Los Angeles, CA2/10/2022This dish will brighten any day. It's important to taste and season the dressing--it needs to slap before anything else is added to it and, depending on the time of year, it will need teaspoons more sugar, acid, and/or salt to balance the flavors. The dressing could also use a small chili (deseeded & diced)--the heat will heighten the cooling effect of the avocado and sweet citrus juices, making everything dance even more.AnonymousSeattle1/4/2022Really enjoyed this salad. It was super easy for a week night and tasted kinda fancy without much effort, so I'd also make it for friends, I think. My only edit is to reduce the red onion; mine was really small and it still was a bit much.AnonymousSioux Falls, South Dakota12/15/2021This was a pretty delicious weeknight winter dinner salad.  I'll definitely make it again; the only edit I suggest is to reduce the red onion, probably by about half. Otherwise, quick and tasty.H.M.Sioux Falls, South Dakota12/15/2021This was yummy!  I added a bit of honey to the shrimp dressing, and made the salad bigger (added kale, radicchio, some thin red cabbage slices).  Will absolutely make this again!SLFNY , NY12/9/2021It says you can use cold leftover rice OR cook the rice according to the recipe.\n\nGreat recipe!Anonymous12/4/2021This is a refreshing, bright meal that is welcome after the heavy holiday food. The avocado provides a smooth bridge between the sweet and tart flavors. It's quick to make and suitable for guests. And, as the description promises, you can make a fresh pot of rice or use leftover if you have it in the fridge. Either way, this is a keeper.RedqueenGainesville, FL12/3/2021I presume that if you use cooked rice you then start with step 5 for the rice.  Hope it still turns out okAnonymousChicagoland 12/2/2021Uhm, the description promises using left over rice (presumably already cooked) but the recipe starts with cooking rice.  What am I missing?Robert in NCCharlotte NC12/1/2021Explore Bon AppétitLunchDinnerCitrusFruitGrapefruitOrangeShrimpShellfishSeafoodRiceRice & GrainsAvocadoVegetableEasyQuick And EasyWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kendra Vaculin"]}