{"id": "4ac4e926f781f98cf1bd0832c110b4cd", "url": "https://www.bonappetit.com/story/curried-peanut-dip", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "This Curried Peanut Dip is My Boyfriend's Latest Obsession | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Boyfriend Is in a Serious Relationship With This Curried Peanut DipShould I be worried? By Emily SchultzFebruary 21, 2020FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Kat BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.A lot of the great works of our time have been ghostwritten. The Count of Monte Cristo. Frank Sinatra’s “Fly Me to The Moon.” And now, this article on curried peanut dip.Okay, let me back it up for a second. This article isn’t technically ghostwritten, it’s just that this ode to Molly Baz’s curried peanut dip is technically from my boyfriend. Don’t get me wrong: I love this dip. I will make it in the Test Kitchen when we’ve got odds and ends lying around that are begging for a protein-packed sauce to turn them into capital \"L\" Lunch, or when friends decide to come over on Friday night after work. But my boyfriend makes it so much I’ve actually had to start sending him other recipes at the beginning of the week, fearful he’s going to max out on peanut butter at any given moment.I get his obsession: It’s only eight ingredients including vegetable oil and salt. Jarred red curry paste and fish sauce give it a quick hit of spice and funk; peanut butter and coconut milk add richness, body, and protein; honey brings the sweetness; and rice vinegar lends a splash of brightness.And talk about something that comes together quickly. After red curry paste is bloomed in a little oil until fragrant, you’ll whisk in coconut milk and bring the whole thing to a simmer. Stir in the rest of the ingredients off heat, then put it in the fridge to set up and cool off, and you’re done. The sauce works drizzled over ground chicken lettuce wraps, as a dip for Persian cucumbers, or thinned out to make a peanutty dressing for salad or rice noodles. The spicy-funky-salty-sweet balance keeps you coming back for more.Don’t ever tell him I think he’s right but maybe my boyfriend is actually onto something here: Curried peanut dip literally goes with everything.Get the recipe:Curried Peanut DipThis creamy, spicy-sweet dip pairs with leftover rotisserie chicken, jammy eggs, cucumber spears, and roasted sweet potatoes for the perfect desk-friendly lunch.View RecipeExplore Bon AppétitNever FailDipLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-21", "author": ["Condé Nast", "Emily Schultz"]}