{"id": "4ad7c1b314e0ec19c3fe3a4c002f98cc", "url": "https://www.bonappetit.com/story/food-social-media-change", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "Can Social Media Be a Force For Good in the Food World? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCan Social Media Be a Force for Good in the Food World?Priya Krishna and Jenny Dorsey discuss how it can be an educational tool for chefs, cookbook authors, and food media at large.By Priya KrishnaSeptember 15, 2020FacebookTwitterEmailPhoto Illustration by Gabriel ZimmerFacebookTwitterEmailThe Internet can be a tiring, noisy place. Jenny Dorsey doesn’t think that should slow you down.Her nonprofit, Studio ATAO, began as a way to provoke thoughtful conversations across a dinner table, but amid the ongoing pandemic, Dorsey moved those conversations online—leaning into virtual learning series, newsletters, and social media, geared toward creating concrete resources that could be shared more widely.Enter Studio ATAO’s downloadable tool kits, which tackle everything from respectability politics to tokenization in media and structural racism in federal policies. Generated from virtual public panels and Experimental Salons—curated discussions led by restaurant industry professionals directly involved in or impacted by the subject at hand—the tool kits are part glossary, part game plan: They’re thorough, informative, and manage to address the thorniest of complex issues in a clear, careful way. I spoke to Dorsey about how to break through the performative noise of social media and use digital platforms to make meaningful change in the food world.Priya: You’re a chef by training, but in 2017 you founded Studio ATAO, an educational nonprofit focused on the intersection between food, art, and social impact. What brought that initiative about?Jenny: My husband and I had initially started a supper club in 2014. The idea was: How do we bring people together? How do we help them form deeper connections? How do we have more intelligent, thoughtful, and vulnerable discourse? The dinners were popular but not for the right reasons. We were saying, “Be vulnerable,” but not giving people the resources to do so. That’s when Studio ATAO happened. We wanted to get people in these smaller spaces, one focused on restaurants, one focused on media, and so on, and also provide accompanying resources.Since the pandemic, you have taken Studio ATAO completely virtual, focusing a lot of your efforts on these downloadable tool kits that have become very popular online. Where did the idea for those come from?This year we started doing these discussion salons where a few people came together to have a panel conversation. We wanted to create safe spaces (initially physically but now virtually) where professionals, especially BIPOC, could be candid and workshop solutions to problems within their industry. It was a way to give voice to issues that are often uncomfortable to say publicly because you would be \"sticking your neck out,\" so as a result they passively continue despite a great need for change. It was really important to us these were private, because the reality is that everything that is public is always performative.We wanted everyone who came to feel like they had an ownership stake in something we were building, and create something we could direct people to. Food should be a vehicle for social justice, but oftentimes when we have panel conversations and conferences, nothing comes out of it because there aren't any implementation resources. People have this enlightened conversation, but then they leave. How do we actively combat that?It spiraled into a collective community effort of pooling knowledge and resources in one place. Instead of all of us having these disparate conversations—you know, when there is a random person in your DMs asking about tokenization and you don’t want to perform the labor of education—you can point them in the direction of the toolkit and they can figure it out. The amount of work we get asked to do as people of color is a lot.How do you decide what to include in each tool kit?We put together tool kits based not only on what we hear in the salons, but what people in those salons want to see more research on. We [Dorsey plus salon facilitators Sarah Hong and Sarah Koff and special projects manager Emily Chen] are currently building a tool kit about unlearning scarcity and cultivating solidarity among Asian American communities. I'm a first gen Chinese American, so Asian American topics are important to me. Creating Asian in America was really cathartic in exploring who I was personally, and trying to find space within the larger AA identity. [Ed’s Note: Asian in America was a dinner series Dorsey created to examine Asian American identity.] This tool kit about unlearning scarcity & cultivating solidarity seemed like a really natural next step to encourage AA's to collectively reflect and understand how complex—sometimes painful, but also very beautiful and special—being Asian American is. As the majority of our team is AA, we talked about the themes we wanted to explore within the AA psyche, especially in context to what's happening in the U.S. right now, in the wake of COVID and Black Lives Matter. Being able to link academic research with what people are experiencing helps to give context to and validate what people are doing in terms of showing solidarity. We aren’t going to capture everyone in the diaspora, but it’s about having enough touch points that you can apply your own variations and find it useful for your community.Jenny Dorsey started Studio ATAO as a way to provoke thoughtful conversations across the dinner table and online.\nPhoto by Daniel NguyenStudio ATAO has been particularly great about creating versions of these tool kits for social media, where each issue is broken down into these text-driven graphics. They feel very shareable.It’s easy to put out platitudes that social justice people like to hear—it’s harder to be educational. It’s like how people say that food writers write for other food writers. The same is true for activism: Activists post for activists, not for people who need to know more. We want to find that middle ground. You want it to be accessible, so you want to cover the basics, but when you start from zero, you leave so much on the table. So we made the conscious decision of assuming people are at 35 [percent familiarity] and taking them as far as they can go. It was a conscious part of wanting to create a tool kit that felt additive. [Ed's Note: Community manager Claire Mosteller runs Studio ATAO’s Instagram.] It’s so easy to just like something on social media and for it to be performative. But at the same time, it can be an entry point for people to become radicalized enough to do something—so we have to keep doing it.What’s the difference, in your eyes, between performative posting and more conscious, thoughtful posting?When I flip through my own stories, I ask, Is someone learning from this or is it promotional material? If they are learning something, what are they learning? Is it balanced learning? Liberal media can be propaganda, too!What, then, is the responsibility of chefs, cookbook authors, and food writers with large social media platforms?Don’t post the metaphorical useless stuff. When we post, we are often trying to get clicks and likes, but we also want to show that we are doing hard work. But what if every time we posted something, it was meant to be educational? If that were the goal, social media content would look different. I think it would pave the way for people to have deeper conversations. The next two phases of our toolkit for tokenization is to conduct more private salons with leadership at major food media companies to candidly talk about implementation metrics; that's step one for editors in chief, managing editors, and so on to at least talk to each other and have the peer pressure, so to speak, of holding each other accountable. Then we will be following one to two of these companies for the next 12 to 14 months with monthly check-ins to track their performance against internal KPIs of better representation and publish an industry white paper about what worked and didn't work at the end of 2021. We hope this white paper will not only provide step-by-step guidelines for other orgs looking to make big changes, but also signal to the larger industry that these other media companies are making a concerted effort and so should they.The amount of change that needs to happen in the food space often feels really overwhelming to me. I worry that people won’t care beyond just these past few months. How do you handle that?Social change has to be one by one. I don’t think it happens any other way. Policy change requires fighting uphill for decades, for centuries. I would like to think that Studio ATAO can help get people into a mentality where they are constantly questioning and thinking a little harder. For example, when we are internally working on a document we have lengthy back-and-forth comments on everything we are writing about—is it centering the right people? Is this the right way to approach this topic? Is this the right framing? Should we be integrating critical race theory here, or over here, or at all? Are we driving at the right purpose with this sort of language? Do we use \"we\" or \"you\"? I think it's so important we continually just turn over all the rocks and examine them, and decide for ourselves how we want to think.When we talk about racism in food media, I'm also wondering, how do we get people to also care about housing segregation and school segregation? Food is an important way we perpetuate privilege. Once that connection is made, I think food lends itself towards linking together many of the other systemic issues we experience in this country—if we look at food deserts, for example, that's a direct corollary to housing segregation; of problematic distribution systems; of how business capital is distributed. Food is a very visceral way to see and understand a bigger problem in the lack of equitable distribution of resources in this country, because food evokes not just a primal instinct—because we must eat—but also so many important emotions and memories that make these issues much more tangible and real. We use that as the gateway to bring people into the fold and help them become more invested in being part of larger change.Explore Bon AppétitSocial MediaRead MorecultureWhen Did Recipe Writing Get So...Whitewashed?By Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-15", "author": ["Condé Nast", "Priya Krishna"]}