{"id": "4ada6d1bda6f54cfbedab7cc82f4a5cd", "url": "https://www.bonappetit.com/recipe/spikedseltzer-summer-crush-cocktail", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "SpikedSeltzer Summer Crush Cocktail Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishCrisp & Refreshing Summer Crush Cocktail featuring SpikedSeltzerSponsored by SpikedSeltzerFacebookPinterestTwitterEmailCrisp & Refreshing Summer Crush Cocktail Featuring SpikedSeltzerPrintIngredients2  ounces Vodka1 ounce Elderflower Liquer2 ounces Grapefruit Juice1/2 ounce Lemon Juice4 Basil Leaves1 can Indian River Grapefruit SpikedSeltzerGrapefruit Wedge, for garnishBasil Sprigs, for garnishRecipe PreparationCombine vodka, elderflower liqueur, grapefruit juice, lemon juice, and basil leaves in a cocktail shaker. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds. Strain cocktail into a Collins glass filled with ice. Top with Indian River Grapefruit SpikedSeltzer and garnish with a grapefruit wedge and more basil sprigs.Crisp & Refreshing Summer Crush Cocktail Featuring SpikedSeltzerSponsored by SpikedSeltzerGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}