{"id": "4adc9c5a074927c24b3dfbe7b0c2fe84", "url": "https://www.bonappetit.com/story/apple-oat-muffins", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "These Gluten Free Muffins Are Peak Fall...And They Happen to Be Gluten Free | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Muesli Muffins Are Peak Fall...And They Happen to Be Gluten FreeTired of sub-par gluten-free muffins, senior food editor Anna Stockwell developed one that’s healthy enough for breakfast, decadent enough for an afternoon treat, and full of fall flavors.By Anna StockwellOctober 22, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Susie TheodorouFacebookTwitterEmailEvery gluten-free muffin I’ve ever succumbed to has disappointed me by being either too sweet, or too crumbly, or weirdly bitter and bean-y from chickpea flour. So, after 12 years of eating gluten-free and missing good, hearty muffins, I decided it was time to make my own.Gluten-free baking takes extra work, time, and tinkering. It took me 6 attempts with slight adjustments in ingredients and ratios to nail these muffins, but, finally, I have a muffin that I actually want to eat—for breakfast or as a grab and go snack any time of day. It’s got some extra protein from almond flour and almonds, and some extra fiber from ground flax seed and rolled oats. Of course it’s gluten-free, but I also made these muffins dairy-free by using coconut oil instead of butter. It’s just sweet enough, and that sweetness comes only from pure maple syrup and grated apples.I call these muesli muffins because they were inspired by bircher muesli, the soaked oat and grated apple breakfast that my mom learned to make as a kid in Germany. Bircher muesli is OG health food: It was developed by the Swiss doctor Maximillion Bircher-Benner in the early 1900s as a healthy breakfast for his patients, who he kept on a diet heavy in raw fruits and vegetables long before raw food was as trendy as it is now. These muffins have all the same flavors—raw apples, rolled oats, sliced almonds, cinnamon, maple syrup—and it’s a comforting taste that reminds me of home.These muffins keep well in an airtight container for at least five days so you can make them on the weekend and enjoy them all week. They’ll be especially useful when the house is full of guests for Thanksgiving and you want something you can hand a hungry kid or relative (or yourself!). It’ll feel like a treat any time of day.Make muffins today:Gluten-Free Apple and Oat MuffinsSpiced with just enough cinnamon and sweetened with maple syrup, these gluten-free muffins are the breakfast treat of the season.View RecipeExplore Bon AppétitMuffinGluten FreeAppleBreakfastHealthy SnacksRead MorecookingBreakfast Cookies Are the Reason We're Getting Up In the MorningBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-22", "author": ["Condé Nast", "Anna Stockwell"]}