{"id": "4aecd8a7fef3a14c07a31dd43e97c3a9", "url": "https://www.bonappetit.com/recipe/tamarind-chicken-thighs-with-collard-greens-salad", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Tamarind Chicken Thighs With Collard Greens Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueTamarind Chicken Thighs With Collard Greens SaladBy Devonn FrancisJanuary 1, 20213.4(104)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintNative to Africa and common in tropical regions across Asia, tamarind lends an unmistakable sour-sweet taste to everything from stir-fries to candy—and it's what gives this chicken its sticky, glossy quality and its unmistakable flavor.  Tamarind is commonly sold as blocks of pulp or in jars of concentrate. This recipe calls for the latter, which is thin and seedless, but if you can find only the pulp, cook it down with equal parts water for 10–15 minutes until it’s the texture of caramel, then strain out the seeds. Brush any leftover tamarind onto whole fish before roasting, or lacquer it onto bone-in pork chops. One commonly available brand is Swad, which you can find at South Asian and West Indian grocery stores, Whole Foods, or on Amazon. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servings8skin-on, bone-in chicken thighs  (about 2½ lb.), patted dryKosher salt2serrano chiles, coarsely chopped12\" piece ginger, peeled,  chopped3garlic cloves⅓cup tamarind concentrate3Tbsp. coconut aminos2Tbsp. agave nectar2tsp. ground cinnamon1tsp. ground nutmeg½cup plus 3 Tbsp. fresh orange juice (from about 2 oranges)3Tbsp. extra-virgin olive oil, divided2medium Japanese sweet potatoes or other sweet potatoes (about  1 lb.), scrubbed, sliced into 1/8\"–1/4\"-thick roundsHalf a bunch collard greens (about 6 oz.), stems removed, leaves cut or torn into bite-size piecesFreshly ground black pepperPreparationStep 1Preheat oven to 375°. Place chicken in a large bowl and season all over with salt; set aside.Step 2Blend chiles, ginger, garlic, tamarind concentrate, coconut aminos, agave, cinnamon, nutmeg, and ½ cup orange juice in a blender until smooth. Transfer to a small saucepan and place over medium heat. Cook, stirring often, until glaze is sticky and easily coats a spoon, 6–8 minutes. Let cool. Pour glaze over chicken and toss to coat.Step 3Pour 2 Tbsp. oil into a large skillet and, using tongs, arrange chicken, skin side down, in pan, leaving excess glaze behind in bowl. Cook, undisturbed, over medium heat, until skin is browned and crisp, 10–12 minutes. Transfer chicken to a plate.Step 4Let skillet cool 5 minutes, then arrange sweet potatoes in an even, slightly overlapping layer in pan. Season with salt and add 2 Tbsp water. Place chicken, skin side up, on top. Transfer pan to oven and roast until chicken is cooked through and juices run clear when flesh is pierced with the tip of a small knife, 10–12 minutes. Let rest in pan 10 minutes.Step 5While the chicken is resting, toss collard greens, remaining 3 Tbsp. orange juice, and remaining 1 Tbsp. oil in a large bowl to combine; season with a pinch of salt and a few grinds of pepper. Lightly massage greens with your hands to soften slightly.Step 6Serve chicken and sweet potatoes with collard greens salad alongside.How would you rate Tamarind Chicken Thighs With Collard Greens Salad?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleI love this recipe!  I've made it 6 or 7 times and it's always a big hit!  I slice the potatoes around 1/8\", microwave them for 1-1/2 minutes with a little water in the bowl.  Once I remove the browned chicken from the pan, I put the potatoes in the pan, then into the oven for 10 minutes before placing the chicken on top of the potatoes.  This gives the potatoes enough time to cook without overcooking the chicken.  The tamarind gives just the right amount of tartness.AnonymousPortland, Oregon6/3/2021After reading the reviews on the meal. I didn't pour the glaze on the chicken until after I crisped the chicken skin. It definitely would've burned. However, with that small tweak it was delicious. I made a single portion and come prefect it throughout the week I think I over cooked the potatoes. I'll have to remind myself to remove them halfway thru. All in all, very good.JasHayward, CA5/12/2021Horrible recipe. Tried to leave one star but it shows 5 and won't change. Unimpressed Asheville 3/11/2021So I'm in agreement with most of the other reviewers here.  The flavors are close to spot on but the technique left me scratching my head.  Sweet potatoes done at 375F for 10 minutes?\n\nTo improve on this recipe I would throw the potatoes in a sheet pan and drizzle a little bit of the sauce on top and roast em for half an hour or so while you cook the chicken.  The chicken could use less time in the skillet as well cuz parts of the sauce burned before the rest was ready.  Id then throw the chicken on top of the potatoes for the final 10 minutes of cook time.\n\nSo far recipe as is is 3/5 stars but with some tweaks it will be a regular weeknight staple.SpencerCleveland2/26/2021I agree with most of the comments here; the instructions, timing, and ordering do not represent bon appétit's finest moment. Before making this, I read the directions below and incorporated the helpful comments. The result was a wonderful dish, even if it was time-intensive to make. Here are the recipe edits I made using the comments in this thread (with special thanks to Michelle from LA) and saved for myself. \n\nINGREDIENTS //\n4 SERVINGS\n\n8 skin-on, bone-in chicken thighs  (about 2½ lb.), patted dry\nKosher salt\n2 serrano chiles, coarsely chopped\n1 2\" piece ginger, peeled,  chopped\n3 garlic cloves\n⅓ cup tamarind concentrate\n3 Tbsp. coconut aminos\n2 Tbsp. agave nectar\n2 tsp. ground cinnamon\n1 tsp. ground nutmeg\n½ cup plus 3 Tbsp. fresh orange juice (from about 2 oranges)\n4 Tbsp. extra-virgin olive oil, divided\n2 medium Japanese sweet potatoes or other sweet potatoes (about  1 lb.), scrubbed, sliced into 1/8\"–1/4\"-thick rounds\nHalf a bunch collard greens (about 6 oz.), stems removed, leaves cut or torn into bite-size pieces\nJuice from ½ lemon\n2 tsp. garlic salt\nFreshly ground black pepper\n\nPREPARATION //\nStep 1\nPreheat oven to 375°. Place chicken in a large bowl and season all over with salt; set aside.\n\nStep 2\nBlend chiles, ginger, garlic, tamarind concentrate, coconut aminos, agave, cinnamon, nutmeg, and ½ cup orange juice in a blender until smooth. Transfer to a small saucepan and place over medium heat. Cook, stirring often, until glaze is sticky and easily coats a spoon, 10-12 minutes. Let cool. Pour glaze over chicken and toss to coat.\n\nStep 3\nPlace sweet potatoes in a bowl and coat with 2 Tbsp. oil and salt. Toss to coat. Line rimmed baking sheet with parchment paper. Arrange potatoes on baking sheet and place in oven for 15 minutes.\n\nStep 4\nPour 2 Tbsp. oil into a large skillet and, using tongs, arrange chicken, skin side down, in pan, leaving excess glaze behind in bowl. Cook, undisturbed, over medium heat, until skin is browned and crisp, 12-14 minutes. Transfer chicken to a plate.\n\nStep 5\nLet skillet cool 5 minutes, then arrange sweet potatoes in an even, slightly overlapping layer in pan. Season with salt and add 2 Tbsp water. Place chicken, skin side up, on top. Transfer pan to oven and roast until chicken is cooked through and juices run clear when flesh is pierced with the tip of a small knife, about 20 minutes. Let rest in pan 10 minutes.\n\nStep 6\nWhile the chicken is resting, toss collard greens, 3 Tbsp. orange juice, juice of 1/2 lemon, and remaining 2 Tbsp. oil in a large bowl to combine; season with 2 tsp. garlic salt, a pinch of salt and a few grinds of pepper. Lightly massage greens with your hands to soften slightly.\n\nStep 7\nServe chicken and sweet potatoes with collard greens salad alongside.Eric M.Birmingham, Alabama2/24/2021We wondered how this recipe had been tested prior to publication.  ?not at all?  if you read the comments there are so many issues with the technique.  For us, mainly this glaze burned in the pan, taking with it the chicken skin and the sweet potatoes (we used the japanese sweet, as directed) took way longer than 10 minutes to cook.  Moreover, I had no problem finding coconut aminos at an organic grocery, but I am unclear as to what the benefit of this is over a quality soy sauce.  Sure, it's a good soy-free, gluten-free alternative - but it's doesn't specifically have much value to my already full pantry.  This recipe did make me feel good about my decision to cancel my subscription to bon appetit.AnonymousVancouver BC2/15/2021This recipe was a lesson for me to read the comments on line in advance. I have never had problems with recipes in Bon Appetit but this one was unexpectedly challenging. I anticipated the inadequate oven time for the sweet potatoes but largely because I've had little success in getting sweet potatoes to crisp up in the oven I opted for 4 yukon gold potatoes sliced thin on a mandolin, oiled and salted and baked for 30 minutes at 400 on a sheet pan lined with parchment paper (flipped over half way through). I took them out before they browned too much and lined the pan over which I placed the chicken. When using a glaze such as this it's important not to heat up the skillet as one normally does to sear chicken skin side down. When I checked after 8 minutes they were scorched black. A warning in advance of this step by the author would have been helpful. Luckily the chicken was salvageable but I had to remove the skin (best part) and reapply some of the remaining glaze before putting in the oven with the potatoes for the final step. Overall, this dish is wonderfully tasty and I will try it again, possibly with the Japanese sweet potatoes!Geoff2/14/2021Nice to know I'm in good company. I, too, found the instructions regarding temperatures and timing off. Ironically, I was leery of the raw collard greens salad, but liked that quite a lot after also adding some lemon.AnonymousBoulder, CO1/30/2021Good flavors. Bad directions. Chicken thighs are fully cooked after 10 minutes of sautéing, but then they go in the oven with raw potatoes and cook for another 12 minutes with the potatoes. Even when cut 1/4-inch thick, they are still firm and hard after only 12 minutes of cooking. The directions made me pause when reading through them before starting to cook, but I decided to ignore instincts because I was so excited to try a recipe by one of BA’s new staff members. I’m bummed by this letdown and whatever testing process failed the new team and me at home! KateBrooklyn, NY1/27/2021The timing of this recipe doesn’t make sense. Potatoes, even 1/4” thick, take so much longer than 12 minutes. I cooked the chicken in batches, the first batch burned, the second came out ok after turning down the heat to medium low. I’m about 50 minutes in and increased the oven to 400...waiting on the chicken to come to temp...This recipe really doesn’t match the usual BA stunners, but can’t win them all. AWBoston, MA 1/26/2021This was our second favorite recipe out of the eight, just after the Chicken Salad With Citrus. This only came in second because I am not a fan of sweet potatoes. I did try them (I also tucked in a small yukon gold cooked in the same way) and way preferred the yukon to the sweet. Since this is my personal preference (and I know I'm in the minority here), I give this recipe 5 stars and almost the top of the list out of all eight recipes. The sauce is to die for! I too followed the recipe as written, but did switch to cooking the potatoes and chicken in the oven on a sheet pan. For the people who burnt the sauce, keep an eye on your pan and the heat. I had a little residue in my cast iron pan, and it cleaned right up with baking soda. Switch to the sheet pan for the oven part and you'll be happy. I agree with the reviewer who said the potatoes cooked with  the chicken came out almost confit-like. Combined with the greens, this is a massive hit.AnonymousSan Francisco, Ca1/23/2021I cooked the recipe as it was written and it came out great. I had to cook the thighs 20 minutes in the oven. If your potatoes weren’t done, they were cut too thick.  My potatoes were cut approximately 1/4 of an inch thick. If your chicken skin burned, your pan was too hot when you were crisping the skin on the stove. My husband, who is a very picky eater, love the recipe also. It will be one of my “go to meals” on a regular basis.E.C.Port St. Lucie, FL1/20/2021Here to offer a dissenting voice. This recipe was amazing, and came out looking just like the magazine pictures! I cooked it exactly as instructed except substituting soy sauce for coconut aminos, and my oven cook time was longer than the 10-12 estimate (but I was using thighs twice as large as called for, so no surprise). The potatoes came out wonderfully flavorful and almost confit-like from the rendered chicken fat and I loved the flavors from the glaze on the chicken. ZachIndiana1/20/2021Note to self: don’t excitedly crack open the mag and cook straight from it without reading the comments first. How on gods green earth do potatoes cook fully in 10 minutes? I read it, questioned it, forged ahead anyway hoping it would work out. Similar to many others the chicken skin with glaze burned to a blackened crisp. Next time I’d try browning thighs first then letting them hang out in the glaze. And getting the potatoes going MUCH earlierAlySeattle1/19/2021Well...I really do like Bon Appetit but this recipe just doesn’t make sense.  How do you cook raw potato on 10-12 minutes in a 375 degree oven.  I knew better but thought I’d just take their word for it.  40 minutes later this meal is still cooking and I’ve got pizza on the way.  Don’t make this folks.... wasted ingredients and time. Matt Jersey City1/18/2021Explore Bon AppétitChicken ThighChickenPoultryTamarindCondiments, Sauces & PastesCollard GreensLeafy GreensVegetableSweet PotatoPotatoMainDairy-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}