{"id": "4b00682d151869169a6e6860309755ee", "url": "https://www.bonappetit.com/story/the-next-level-dishes-you-must-try-while-in-vegas", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "The Next Level Dishes You Must Try While in Vegas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Next Level Dishes You Must Try While in VegasBy Las Vegas March 15, 2018FacebookTwitterEmailScott FrancesFacebookTwitterEmailLas Vegas has solidified its reputation as one of the country’s best culinary destinations, drawing in food lovers from around the globe. Some of the world’s most renowned chefs have restaurants on the Strip, and we’ve narrowed down the latest, greatest, and most noteworthy bites and sips you should try. Whether you’re craving a spin on a brunch tradition that’s reached new heights, extravagant caviar tacos, or world-renowned celeb chef signatures—these are the most Instagrammable, envy-driving dishes you can only find in Vegas. You'll have a chance to try some of these outstanding restaurants during the ultimate culinary weekend at Vegas Uncork’d, May 10 - 13th. Tickets are selling fast so don't miss your seat at the table!Epic Layers of Flavor at Mesa GrillPhoto by Erik Kabik\nDid you hear the news? Chef Bobby Flay’s staple spot Mesa Grill at Caesars Palace has undergone a full menu revamp, featuring  new dishes bursting with his signature Southwestern flavors. The Steamed Halibut served atop a super-tasty guajillo chile posole broth with mint, cilantro, avocado, and crispy blue corn hits all the best notes of creamy, crunchy, and spicy. Still hungry for something fiery? Try the Sixteen Spice Chicken which comes served with piquant garlic-mango sauce, cilantro pesto mashed potatoes, and a kick from a Fresno chile-mango relish.The Ultimate French Toast at Bardot BrasseriePhoto by Kevin J McCullough\nBrunch lovers take note: The epic French Toast at Chef Michael Mina’s Bardot Brasserie at ARIA Resort and Casino is a tower of sweet-tooth perfection. The (almost) one pound cube of brioche French toast stands high, topped with luxuriously creamy vanilla mascarpone and crackle-worthy almond brittle and then drizzled with orgeat syrup. It’s a perfect way to kick off a group brunch or treat yourself to something a little more decadent than usual.A Luxe Mini Bite at Rose. Rabbit. Lie.Photo by The Cosmopolitan of Las Vegas\nFor those who want luxury in every bite, this playful take on caviar is a serious dining experience. At Rose. Rabbit. Lie. at The Cosmopolitan of Las Vegas, these can’t miss mini-tacos are filled with hackleback caviar and hamachi inside a crunchy Yukon Gold potato shell. The modern supper club offers a variety of reinvented American classics on their menu, while guests relax and enjoy live music and incredible performances in their theater.High-End Omakase at Yui Edomae SushiPhoto by Alex Lau\nIt’s not just the Strip that houses incredible dining experiences. Make your way to the chic and elegantly minimalist space from Chef Gen Mizoguchi and find a spot at the exclusive 10-seat Yui Edomae Sushi bar for an excellent omakase dinner. (It’s so good, it made our Top 50 Best New Restaurants in 2016!) For $120, the chef will take you on a personalized sushi journey, featuring the ubiquitous omotenashi-style service where the staff tends to your every need.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Las Vegas"]}