{"id": "4b0dc49fb4431f005d35bfe96dcd6228", "url": "https://www.bonappetit.com/recipe/cold-udon-with-grapefruit-ponzu", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Cold Udon with Ponzu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueCold Udon with Grapefruit PonzuBy Andy BaraghaniAugust 14, 20185.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintCold noodles tossed in a bright citrus and chile sauce are the ideal canvas for jammy roasted tomatoes in this light summer dish. Keep a package of frozen precooked udon noodles on hand for those nights when you don’t feel like spending more than, say, ten minutes on dinner. These chewy wheat noodles are extra thick with a bouncy, springy quality that dried udon just doesn’t have. All you have to do is reheat them in boiling water before they’re ready to slurp.Ingredients4 servings 1grapefruit, halved1lemon, halved1red chile (such as Fresno), seeds removed, finely chopped12\" piece ginger, peeled, finely grated⅓cup unseasoned rice vinegar3Tbsp. soy sauce1tsp. sugar2pints cherry tomatoes1garlic clove, finely grated1Tbsp. extra-virgin olive oilA pinch of kosher salt18oz. frozen udon noodles2medium Persian cucumbers, peeled, very thinly sliced on a diagonalCilantro sprigs, crumbled nori, and toasted sesame seeds (for serving)PreparationStep 1Heat broiler. Squeeze grapefruit and lemon halves into a fine-mesh sieve set over a large bowl; discard pulp (you should have a little more than ½ cup juice). Mix in chile, ginger, vinegar, soy sauce, and sugar. Cover ponzu and chill.Step 2Toss tomatoes, garlic, oil, and salt on a rimmed baking sheet. Broil until tomatoes are soft and lightly charred, 10–12 minutes. Let cool.Step 3Cook noodles according to package directions; drain and rinse under cold water to stop the cooking. Transfer noodles to bowl with ponzu and toss to coat. Divide noodles and ponzu among bowls and top with charred tomatoes, cucumbers, cilantro, nori, and sesame seeds.How would you rate Cold Udon with Grapefruit Ponzu?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleAmazing!! The ponzu sauce is delicious! Next time I wont put the whole chili it was spicy 🌶 Sara Dallas4/27/2021This was great! I made this recipe because I had a few of the ingredients on hand and wanted to use them up, but, contrary to my expectations, this will be making it into my regular rotation.AnonymousCalifornia11/22/2018Love the grapefruit ponzu! So refreshing. This recipe is crazy quick. AnonymousLos Angeles9/6/2018Explore Bon AppétitJapaneseEast AsianAsianUdon NoodleNoodlePasta & NoodlesGrapefruitCitrusFruitFresno ChileChileVegetableCherry TomatoTomatoSummerQuickMainVegetarianVeganDairy-FreeHealthyishBroilLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Andy Baraghani"]}