{"id": "4b1a7d0aba360f1b46248008773a1b34", "url": "https://www.bonappetit.com/recipe/boiled-peanuts-with-chile-salt", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Boiled Peanuts With Chile Salt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueBoiled Peanuts With Chile SaltBy Vivek SurtiSeptember 17, 20193.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrint“I’ve always associated boiled peanuts with road trips,” says Vivek Surti, the chef at Tailor in Nashville, No. 7 on 2019’s Hot Ten list. “I ate cajun-spiced ones from gas stations in the South and my grandma’s version for the five-hour ride from the airport to her home in Gujarat. It’s a snack that exists in America and in India. Here I toss them in chile and coriander, which is very Indian, but it reminds me of those Cajun peanuts.” While fresh, shell-on peanuts are available only at harvest time and are hard to find, unroasted, shell-on peanuts work just as well and can be found in supermarkets and online.IngredientsMakes about 4 cups4cups fresh (green) or raw (unroasted) shell-on peanuts (about 11.5 oz.)4tsp. kosher salt2Tbsp. coriander seeds, divided1Tbsp. flaky sea salt1½tsp. red chile powder, preferably KashmiriPreparationStep 1Combine peanuts, kosher salt, and 1 Tbsp. coriander seeds in a medium saucepan. Pour in water to cover and stir to combine. Let peanuts sit in brine, stirring here and there, 3 hours.Step 2Bring peanut mixture to a boil over medium-high heat. Reduce heat, partially cover pan, and simmer, adding more water as needed to keep peanuts covered, until peanuts are tender with no crunch left at all, 2 hours if fresh, 4–4½ hours if raw. Drain; let cool.Step 3Meanwhile, lightly crush remaining 1 Tbsp. coriander seeds with a mortar and pestle (or gather on a cutting board and crush with a skillet). Mix in a small bowl with sea salt and chile powder.Step 4Transfer peanuts to a bowl and toss with about three-fourths of spice mixture. Serve peanuts with remaining spice mixture alongside for sprinkling over.How would you rate Boiled Peanuts With Chile Salt?Leave a ReviewTell us what you thinkExplore Bon AppétitIndianSouth AsianAsianPeanutNutSnackVeganVegetarianDairy-FreeGluten-FreeHealthyishNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}