{"id": "4b234e1ecbac1db103ecb823c40dd7d6", "url": "https://www.bonappetit.com/story/kid-friendly-halloween-snack", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "The Halloween Snack to Feed Your Kids Before Trick-Or-Treating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Halloween Snack I Feed My Kids Before Trick-Or-TreatingYes, they’re allowed to have candy. Yes, they need something else in their stomachs first.By Carla Lalli MusicOctober 31, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue LiFacebookTwitterEmailOf all the holidays to embrace and celebrate after becoming a parent, Halloween is pretty far down on my list. One year I got egged; I hate those Ghostface masks from Scream; and as a parent, the evening is an emotional roller coaster of anticipation, hysteria, and sugar-induced chaos.My older son has aged out of the whole trick-or-treat situation, but years of practice have afforded me a few battle-earned strategies on how to survive the evening. By strategies, I mean rules that help smooth out the edges, and by now my nine-year-old knows the drill. He must actually say the words “trick or treat” and “thank you.” He can have one piece of candy per five city blocks, and then one a night till the haul is gone. Most important, though, he has to eat something “real” before heading out.What kid doesn’t love peanut butter?\nPhoto by Alex LauSince this kid loves crunchy vegetables and is motivated by the promise of future rewards, if I throw together a plate of what we call “dips” while he’s getting into costume, he will definitely chomp it up. This isn’t dinner, exactly, but it’s a decent foundation, and it supports one of my tenets of the balanced kid diet: If you offer children vegetables when they’re hungry, they’ll be way more likely to eat them. Plus, it’s easy. Into a blender add 1 cup creamy natural peanut butter and add ¼ cup fresh lime juice, 4 oz. silken tofu (yes, for protein, but it also helps make the dip super creamy), 1 Tbsp. soy sauce, and 2 Tbsp. honey. Then I peel and finely grate a 2\" knob of ginger, place it into a little sieve, and press on it with a spoon to release the juice into the blender too (discard the solids). I blend this on medium-high speed, along with about ¼ cup hot tap water to get things moving. Taste and season with some salt. If I’m serving with veggie and fruit spears, I’ll keep it thick. For drizzling over crunchy romaine hearts, I’ll thin it out a little more. Kids eat with their eyes probably more than anyone else—an extra drizzle of honey or handful of seeds or nuts is my way to add flair. This dip keeps for several days in the fridge, and considering my son is also a vegetarian, it’s good to know there’s a filling, protein-boosted condiment on hand for any other afternoon.It takes five minutes to make this, and another five to cut up some cucumbers, carrots, and apples. If I’m smart, I’ll make sure to eat some too. It’s going to be a long night.Get the recipe:Silky Peanut Butter DressingAdding silken tofu to the base of this kid-approved recipe both enriches it with a little added protein and lends it a satiny texture.View RecipeExplore Bon AppétitHalloweenPeanut ButterDipRead MorecultureAlmond Joy or Almond Despair?By Alex BeggscultureThe Spookiest Food Horoscopes YetBy Catherine UrbanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Carla Lalli Music"]}