{"id": "4b2cc1966ae5e4cf5713f215051ff131", "url": "https://www.bonappetit.com/story/top-50-best-new-restaurants-2018", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "The Top 50 Nominees for America’s Best New Restaurants 2018  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Top 50 Nominees for America’s Best New Restaurants 2018From a natural wine–fueled French restaurant in New York to a temple to all things masa in Austin, these are the contenders for this year’s Hot 10.By Andrew KnowltonJuly 31, 2018FacebookTwitterEmailFacebookTwitterEmailEach year I kiss my loving family goodbye (both the one at home and the one at the office) and hit the road for weeks at a time, crisscrossing the country and eating everything in sight, in search of the Hot 10: our annual list of America’s best new restaurants. This year I stumbled upon a beachy ramen-ya in Venice; a lakeside retreat with crispy whole flounder; not one but multiple Jewish-style delis reinventing the genre; and bowls upon bowls of Cambodian, Vietnamese, and Japanese noodles. These are the 50 eclectic, inspiring, and very delicious nominees for America’s best new restaurants. Make sure to check back on August 14, when we’ll reveal which of these spots earned a place in the Hot 10.The Top 50Bavel (Los Angeles)Better Luck Tomorrow (Houston)Bitter Ends Garden & Luncheonette (Pittsburgh)Brenner Pass (Richmond, VA)Bywater American Bistro (New Orleans)Cadence (Philadelphia)Cafe Roze (Nashville)Call (Denver)Carnitas Lonja (San Antonio)Cervo’s (New York City)The Charter Oak (St. Helena, CA)Che Fico (San Francisco)Drifters Wife (Portland, ME)Driftwood Oven (Pittsburgh)Ellē (Washington, D.C.)Felix (Venice, CA)Flowers of Vietnam (Detroit)Folk (Nashville)Freedman’s (Los Angeles)Frenchette (New York City)Hearthside (Collingswood, NJ)Hello, Sailor (Cornelius, NC)JuneBaby (Seattle)Kado no Mise (Minneapolis)Kamonegi (Seattle)The Lakewood (Durham, NC)The Line - A Rake’s Progress, Brothers and Sisters, and Spoken English (Washington, D.C.)Majordōmo (Los Angeles)Marisol (Chicago)Maydan (Washington, D.C.)MTN (Venice, CA)Nimblefish (Portland, OR)Nonesuch (Oklahoma City)Nyum Bai (Oakland, CA)Palmar (Miami)Pammy’s (Cambridge, MA)Proud Mary (Portland, OR)Robin (San Francisco)Rose Foods (Portland, ME)RT Rotisserie (San Francisco)Sorrel (San Francisco)Sour Duck Market (Austin)Suerte (Austin)Suraya (Philadelphia)Talat Market (Atlanta)Tempesta Market (Chicago)Ugly Baby (Brooklyn)Vespertine (Culver City, CA)Wa’z  (Seattle)Yume Ga Arukara (Cambridge, MA)Explore Bon AppétitRestaurants + TravelHot 10Hot 10 2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Andrew Knowlton"]}