{"id": "4b526d0f6603a0f659719fd2968bb7db", "url": "https://www.bonappetit.com/recipe/pullman-sandwich-loaf", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Simple Sandwich Loaf Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSimple Sandwich LoafBy Bryan FordOctober 11, 20204.7(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintIf you’re looking for a simple recipe for a tender sandwich bread—the kind of loaf that’d be great turned into a grilled cheese or crunchy croutons—this is it. This recipe from Bryan Ford is his Master Bread Dough, rolled into a tight log and baked until golden brown. We recommend slicing any bread you’re not going to eat and then freezing it in a resealable plastic bag or airtight container for instant toast. Even if you’re going to eat it later in the week, freezing it right away preserves the taste and texture.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLoaf Pan$15 At AmazonPastry Brush$9 At AmazonIngredientsMakes one 8½x4½\" or 9x5\" loafExtra-virgin olive oil (for pan)Bread flour (for surface)Master Bread DoughFlaky sea saltPreparationStep 1To make this recipe, start by preparing one batch of the Master Bread Dough.Step 2Liberally coat an 8½x4½\" or 9x5\" loaf pan with extra-virgin olive oil. Lightly flour work surface with bread flour and turn out Master Bread Dough onto surface. Roll dough over onto itself, applying pressure with your fingers to seal closed and tighten log. Use your fingers to roll ends of log against surface to close. (Click here to see Bryan's motions.) Place dough in pan and brush with more extra-virgin olive oil. Cover with a kitchen towel and let dough rise until about ½\" above edge of pan, about 2 hours.Step 3Preheat oven to 425°. Sprinkle top liberally with flaky sea salt. Bake until golden brown, 35–40 minutes. Transfer to a wire rack and let cook in pan 5 minutes. Turn out bread onto rack and let cool completely before slicing.Step 4Do ahead: Bread can be baked 3 days ahead. Store in a paper bag or a bread box at room temperature, or slice and freeze up to 1 month.How would you rate Simple Sandwich Loaf?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleOne of the comments complained that mixing for the amount of time in the recipe overkneaded the dough. This is very unlikely. You're not going to overwork the dough with 5 minutes of mixing in a home stand mixer. If the bread didn't rise, there was some other reason.\n\nStill, you shouldn't mix based on time; you need to learn to use the windowpane test to discover when the gluten in the dough has been fully developed. That's going to take more than 2-3 minutes on low speed.\n\nAlso, I'm baffled by the leftover poolish question. Use it all!Greg Esres1/9/2022Excellent recipe ... However, be cautious with the stand mixer. Twice my mixer has over kneaded my dough when following the timing on the recipe, resulting in a firm and tight dough that struggled pretty epically with rising. I find that my dough comes together in 2-3 minutes top at low speed. Also, i used all purpose flour the first time and it came out great! Using bread flour now and excited to see if there's a difference. Overall, the bread tastes delicious even if my dough did not rise much ... but it's the holidays and no one has a problem with some extra salted butter on some dense-ass toasty bread in the morning after an obscene amount of cocktails and cheer. Good luck! AnonymousPortland Oregon12/18/2021I've made this loaf a lot. I love it. Sometimes I take out 100g of bread flour and add 100g of whole wheat, or white whole wheat flour just to change it up. DarvoidGray, Maine9/12/2021I LOVE this bread.  I used the remaining Poolish to make a second loaf - glad I did because my family devoured the first one within a few hours. \n\nI would cut the poolish ingredients in half if I only wanted 1 loaf, or I’ve read that others refrigerate the remainder and use another day.  ViktoryaSan Francisco, CA12/16/2020This bread was delicious, just what I like although I overdid the external olive oil on the first try. Since I was reluctant just to throw away the unused poolish, I made a second loaf from it several days later and it worked just fine. Now I'm dividing the poolish in half, and keeping the second half covered in the fridge until I'm ready.AnonymousLos Angeles, CA11/18/2020I I agree with other comments, that this is confusing because this is only the baking instructions for a recipe from a separate post. I don’t know what the point is in doing this, it seems to make absolutely no sense at all unless the entire point of this was for Bon Appetite to entirely confuse its readers, then it succeeded spectacularly.\n\nThat being said, if you do go the the Master Bread Recipe by clicking on the link in step 1, the. You will be very happy with the results. It’s a lovely bread with a moist and soft crumb and a crunchy crust. It is a great bread once you get past the stupidity of separating the baking instructions and actual recipe.BabsChicago 11/15/2020This didn't turn out so well for me.  Not sure what went wrong, but my loaf ended up dense and just ok in flavor. I made over the course of 2 chilly California days, so had to prove longer than instructed.  Not sure I will try this one again or look for another recipe.  Also a bit annoyed with left over poolish and lack of better instructions or video BA typically provides.KarenGranite Bay, CA11/13/2020Please tell what to do with the leftover poolish..  It's a lot to waste if there's no way to save and use it.  Or why not just reduce the amount to produce the 100 grams needed to make the bread?Anonymousnew york11/1/2020Whassup? Only ingredients listed, no instructions\nI have the Master Bread Dough ready to use and want to proceed!\nPlease reply asap!\nThanks!West Chester PA10/31/2020The crumb was lovely, soft, yet sturdy. An excellent sandwich medium. I made mine with whole grain bread flour and whole wheat flour so it came out a little denser and didn't quite get the same rise as stated in the recipe, but I used all the poolish from the Master Recipe to make two beautiful loaves. My BLTs thank you.Ottawa10/18/2020Do you have print friendly version of this recipe?AnonymousCanada 10/15/2020@Garvan: My apologies—we were having some technical difficulties earlier this morning. I hope it works for you now!! The reason there are no quantities is because this recipe starts off with a 1x batch of Bryan's Master Dough, which is linked in the headnote, ingredient list, and step 1 of the recipe.Sarah  Jampel10/14/2020The recipe is blank, just as reported by Anonymous below. I can see the ingredients, and there is nothing under RECIPE PREPARATION. This is a web page fault. I am using Google Chrome browser and Windows 10.Garvan10/14/2020Also, a Pullman Loaf is necessarily required to be cooked in a lidded bread pan, which would give the loaf a rectangular cuboid shape (i.e. all sides, including the top, would be flat).  Pullman Loafs are named after the Pullman railway cars, and were supposed to have conserved space for storage.  Odd they wouldn't mention that here.gabriBend, OR10/12/2020@ janine sylvestre and Anonymous saying it's an empty recipe\n\nDid both of you miss this at the beginning? \n\"To make this recipe, start by preparing one batch of the Master Bread Dough.\"\n\n\nandyhp84Burbank, CA. 10/12/2020Explore Bon AppétitBreadBread FlourFlourYeastOther IngredientsVegetarianVeganDairy-FreeNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-11", "author": ["Condé Nast", "Bryan Ford"]}