{"id": "4b679b44d344f332ff60737877f85526", "url": "https://www.bonappetit.com/story/wilted-greens-in-tomato-bacon-broth", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "In the Wilting Summer Heat, Make These Wilted Greens in Tomato-Bacon Broth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIn the Wilting Summer Heat, Make These Wilted Greens in Tomato-Bacon BrothIt’s sweet. It’s sour. And it’s extremely delicious.By Rachel KartenJune 18, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailThe bone broth diet was cool. But puts marketing hat on have you guys heard of the tomato-bacon broth diet? It’s easy. You make this wilted greens in tomato-bacon broth recipe, find every excuse to dip a spoon in to “make sure the broth is building flavor nicely,” and then promptly devour four of the eight servings by yourself. Still waiting to hear back on the results, but one participant (me) said, “It was so simple! I plan to make it all summer long. Plus, I was on a bacon high for three days after.” Sold? Let’s get to it.This new summer side dish developed by Claire Saffitz is a modern take on traditional grilling sides, like stewed greens (see also: this kimchi slaw). Here she amps the greens up with bacon, obviously, as well as a Fresno chile, a bit of honey, and a much-needed tangy splash of red wine vinegar. Bacony-spicy-sweet-salty-acidic—it’s got it all. Plus tomatoes.The recipe kicks off the way that all recipes should kick off: “Heat 1 Tbsp. oil in a large saucepan over medium-low. Add [chopped] bacon and cook, stirring often, until brown and crisp around the edges, 5–7 minutes.” Once your kitchen starts to smell like the Le Labo candle you actually wanted, add in one small chopped onion and four smashed garlic cloves. Let those go for about five minutes, until translucent. Next, you’re turning the heat up to high and adding your tomatoes. (I used a mix of Sun Gold and cherry, would recommend.) Let those roll around and get all bursty and charred (about five minutes).Now comes the Important Broth Moment. You mix in two tablespoons of red wine vinegar (or sherry vin), two teaspoons of honey, and one and half cups of water. Season the whole thing with salt. And that’s your MFing broth. So easy. Let the whole thing simmer for 8-10 minutes. Turn up the the Bon Appétit Foodcast #notspon. Taste your broth every two minutes (not in the instructions, but you do you) and wonder how you built this sippable sweet and sour creation in less time than it takes to motivate yourself to shower.Okay, you’re in the home stretch. Once your broth has been built, add in your torn greens one handful at a time. I used escarole because I like the way it gets kind of soft and translucent, but might add in something hardier next time. Because checks if marketing hat is still on always be optimizing, right? Once everything is wilted and submerged, let cool, and transfer over to your favorite serving dish. Give the whole thing a generous drizzle of olive oil and top with thinly sliced rings of Fresno chile. There! You’ve done it. Welcome to tomato-bacon broth diet fan club. We’re glad to have you.Get the recipe:Wilted Greens in Tomato-Bacon BrothThe summer side dish you didn’t see coming—and the tomato-bacon broth you can’t stop eating.View RecipeExplore Bon AppétitSummer SidesTomatoBaconEscaroleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-18", "author": ["Condé Nast", "Rachel Karten"]}