{"id": "4b7590065f0de86c7df9b3b19fd46fd0", "url": "https://www.bonappetit.com/recipe/guava-grapefruit-possets", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Guava-Grapefruit Possets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueGuava-Grapefruit PossetsBy Shilpa UskokovicFebruary 8, 20223.5(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintSimmer cream with sugar, add citrus juice, and then wait for chemistry to kick in. The acidity in the citrus juice works to gently thicken and set the cream into a rich and velvety pudding. With no distracting eggs, cornstarch, or gelatin needed to thicken the possets, you get pure dairy richness primed to showcase the flavors of your choice—in this case, zingy grapefruit and sharp but floral guava. Reducing the cream on the stovetop is not optional—it helps remove excess moisture for perfectly set possets (i.e., spoonable and just barely bound).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan$60 At AmazonWhisk$10 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonMesh Sieve$13 At AmazonSmall Saucepan$155 At AmazonIngredients4 servingsPossets2cups heavy cream½cup (100 g) sugar1Tbsp. (packed) finely grated grapefruit zest¼cup fresh grapefruit juice¼cup fresh lemon juice¼tsp. kosher saltJelly and assembly4oz. guava paste (preferably Goya or La Fe), cut into small pieces1tsp. fresh lemon juiceFlaky sea saltPreparationPossetsStep 1Bring cream, sugar, and grapefruit zest to a simmer in a large saucepan over medium-high, whisking occasionally, and cook (still whisking from time to time) until sugar is dissolved and cream is reduced by about a quarter (mixture should be just shy of 2 cups), 8–10 minutes.Step 2Remove pan from heat; immediately add grapefruit juice, lemon juice, and salt; whisk vigorously just until combined. Strain mixture through a fine-mesh sieve into a large measuring glass or a small bowl or other container with a spout.Step 3Pour into 4 glasses, dividing evenly (about ½ cup each) and chill until set, at least 3 hours.Do ahead: Possets can be made 2 days ahead. Cover and keep chilled.Jelly and assemblyStep 4Cook guava paste and ¼ cup water in small saucepan over medium, whisking vigorously, until paste is melted and mixture is smooth, about 4 minutes. Remove from heat and add lemon juice, whisking well.Step 5Spoon jelly over set possets (about 1½ Tbsp. per portion) and smooth surface with a spoon. Chill until jelly is cool, 10–15 minutes.Step 6Just before serving, sprinkle tops of possets with salt.Do ahead: Possets with jelly (but without sea salt) can be made 1 day ahead. Cover and keep chilled.How would you rate Guava-Grapefruit Possets?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThought this was an amazing dessert: Simple yet beautiful and bursting with flavor. I did my posset base with blood orange rind and juice and used a grapefruit marmalade thinned with a hit of lemon juice for the jelly. So many possibilities! I suggest simmering the cream longer for a more custardy base; mine was rather thin but still delicious. Loved it!Cat SPacifica, CA3/5/2022Explore Bon AppétitDessertFruit Dessert5 Ingredients or FewerEasyGluten-FreePuddingNut-FreeGrapefruitCitrusFruitGuavaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Shilpa Uskokovic"]}