{"id": "4b793b5d8583232ba7cd47480cfdb7b6", "url": "https://www.bonappetit.com/story/a-sex-shop-owners-favorite-toy", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "The Lelo Sona Is A Sex Shop Owner’s Favorite Toy for Going It Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersshoppingA Sex Shop Owner’s Favorite Toy for Going It AloneIt’s like doing yoga for orgasms.By Nenna Joiner, as told to Aliza Abarbanel April 10, 2020FacebookTwitterEmailFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. This one is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.When you say “sex toy,” people always think of vibrators. But in the past couple years, a few clitoral suction products like the Lelo Sona have come out, and it's a game changer. You know that saying, “If a tree falls in the forest and nobody’s there to hear it, did it make a sound?” This toy is a tree falling in the forest without making a sound. It’s not too loud or intrusive, but I can achieve multiple orgasms within a 10 minute window.It’s a nice product for people who don’t like the intensity and noise of a vibrator, or who just want to experience their body in a new way. I think of it like doing yoga for orgasms. Once you retrain your body from going from a Hitachi Magic Wand to a suction product, you’ll reimagine what pleasure looks like for yourself. It’s off the charts: I always heard people talk about quick orgasms, but I couldn’t get there. Now I can pop off an orgasm in 5 minutes, which is great because I’m a real get-up-and-go person. When I go to the office to sell sex toys to others, I want to be as happy as possible! –Nenna Joiner, owner of Feelmore Adult in Oakland, CABuy it: Lelo Sona Cruise, $115 at feelmore510.com or $118 at lelo.comAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItHealthyish Guide to Being AloneShoppingRead MoreshoppingA Tiny Pot That Every Solo Cook Should OwnBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-10", "author": ["Condé Nast", "Nenna Joiner", "As Told To Aliza Abarbanel"]}