{"id": "4b9927182f225f6bf3d37be89965a7a7", "url": "https://www.bonappetit.com/recipe/slow-cooked-green-beans-with-harissa-and-cumin", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Green Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Cooked Green Beans with Harissa and CuminBy Claire SaffitzAugust 14, 20184.8(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintToss green beans with tons of olive oil and aromatics and surrender the whole thing to your oven for an hour or two until it becomes impossibly soft and caramelized.Ingredients6 servings1lb. green or other snap beans, trimmed½head of garlic½cup extra-virgin olive oil1Tbsp. harissa paste¾tsp. cumin seeds¾tsp. kosher salt1Tbsp. sherry vinegarPreparationStep 1Place a rack in middle of oven and preheat to 350°. Toss green beans, garlic, oil, harissa, cumin seeds, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast vegetables, tossing 2 or 3 times, until golden brown and very tender, 60–70 minutes. Let cool slightly, then add vinegar and toss to coat.How would you rate Slow-Cooked Green Beans with Harissa and Cumin?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI'm seriously addicted to these beans. I could eat a whole pot to myself rn and I'm trying my best not to! Agree with the other reviewers that you could make this with a lot less oil and it would still be perfect. I think a quarter cup would be sufficient next time. AnonymousLondon, UK12/31/2021Made this for Thanksgiving.  Everyone loved it!  I will use less oil next time, and 60 min was plenty of time.  50 probably would have been fine.  I used crushed garlic instead of a whole head.  Jill GNorth Carolina11/27/2020This was excellent! I cut squash in the half for roasting then I scooped squash out and mixed with aromatic oil and goat cheese. Wow. Great taste! briggitazFlorida11/23/2018These are amazing! Don't have harissa so I use sambal oelek. Soak up all the oil with some naan and drift off to food heaven.Anonymoustexas9/27/2018Didn't have harissa, so I mixed 1/2 teaspoon each of chili powder, cumin, and coriander.  Very tasty.  Used less oil that the recipe calls for, and forgot the vinegar, and it was just fine.  Beans (home grown pole beans) had an interesting texture - not soft even after 70 minutes.AnonymousVermont9/21/2018This dish is amazing!AnonymousSeattle WA9/3/2018Explore Bon AppétitAfricanNorth AfricanGreen BeanVegetableHarissaCondiments, Sauces & PastesSideVegetarianVeganDairy-FreeNut-FreeGluten-FreeHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}