{"id": "4ba591284ea8cabd9c58249a78a345f8", "url": "https://www.bonappetit.com/story/kimchi-fried-grains", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Kimchi Fried Rice And Grains Will Show You the True Power of Sunday Meal Prep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKimchi-Fried Grains Will Show You the True Power of Sunday Meal PrepThis healthyish twist on fried rice comes together in minutes.By Aliza AbarbanelMarch 28, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailOut of all the meal prep tips we’ve amassed over the years, making a big batch of grains on Sunday is a tried-and-true favorite. It’s the fastest way to a winning weeknight dinner, and an excellent base for days on days of lunch al desko.  Case in point: This easy stir-fry, which combines a flexible mix of whole grains with kimchi and a riffable array of toppings.These kimchi-fried grains are so trustworthy, they’re part of BA’s New Essentials, a.k.a. the 29 recipes that define how we cook now. Having a bunch of precooked grains lying around may sound far-fetched, but our favorite one-size-fits-all method for big batch grain cooking makes having extra farro on-hand surprisingly realistic.  Senior food editor Claire Saffitz, who developed this recipe, says: “I rarely make kimchi fried rice because it feels white starch-heavy, but this recipe is a very quick and healthy weeknight meal that repurposes those extra whole grains.”Stir fries go fast, which is why they’re so great for weeknights. That quick cook time comes down to two bits of prep: chopping your ingredients in advance and sticking to an order of operations (more on that below). No need to freak out over the Top Chef-perfect mise en place—just chop your kimchi, carrots, and scallions, then scoot them into little piles on the side of your cutting board.The Stir-Fried Grains Order of OperationsStart with a few lacy fried eggs, because you can take them out of the pan and set aside to top with later. Raw vegetables (in this recipe’s case, carrots) go in the pan next, as they take the longest to cook, followed by scallions and kimchi. This technique is about rehydrating grains, so save them for last so they won’t dry out. Almost any grains you have lying around will do, from farro and quinoa to barley and buckwheat. And yes, kimchi-fried rice also works.The final step: Add soy sauce, sesame oil and reserved kimchi juice for two minutes—long enough to soften the grain’s bite. “You’re not frying so much as rehydrating, because whole grains get an outside bran that’s heavy and tough,” Saffitz says. “Add liquid so they soften and steam.” And the next thing you know, dinner is done.These grains are a true pantry meal—you can customize it with almost anything. Top with fried eggs, nori, and sesame seeds, or reach for whatever specialty condiment you picked up as an impulse buy last week at the store. Go for scrambled eggs instead of fried, or bulk it up with roasted chicken, flaked salmon, or leftover roasted vegetables. Does dinner taste better when it comes together in less time than an episode of The Office? Maybe, but an extra splash kimchi juice can't hurt.Grab that kimchi jar:Kimchi-Fried GrainsThis easy stir-fry, combined with the trusty #putaneggonit, is irresistible.View RecipeExplore Bon AppétitHealthyishKimchiGrainsRiceRead MorecookingSteak Salad with Rice Noodles Is the Weeknight Dinner We Could Eat ForeverBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-28", "author": ["Condé Nast", "Aliza Abarbanel"]}