{"id": "4ba75794433913af71dcd924df8e54ce", "url": "https://www.bonappetit.com/story/vegetarian-wedding", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "A Vegetarian Wedding Menu That Doesn't Suck  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy It’s Terrible to Be a Vegetarian at a Wedding (And How to Make It Better)If I see one more \"veggie stack,\" I'm going to scream.By Sarah JampelApril 30, 2019FacebookTwitterEmailIllustrations by Bryan FountainFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.When I* was planning my wedding this past fall, I had only a few wishes: that my dress not be strapless; that we keep the first dance as short as possible; that we not be introduced as “the new Mr. and Mrs.”; that no elderly relative take a tumble on the dance floor (it happens); that no one tell that story from when I was seven; that I not trip down the aisle; and, highest priority on the list, that no vegetarian guest be subjected to a “veggie stack”—the sort of leaning tower of roasted vegetables that’s often presented as the entree for herbivores.I got almost everything on my list. My dress had straps, and my 90-year-old grandma made it through the ceremony and the party, no face-to-floor contact. I did stumble down the aisle and, as painful as it is for me to admit, my vegetarian (and vegan, and gluten-free) friends and relatives were served a veggie stack. (For what it’s worth, some told me they enjoyed it. Were they just being nice? A question I’ll have to wrestle with forever!)Why did I want to avoid the veggie stack like the plague? At almost every large sit-down dinner I’ve attended in my entire life, I’ve opted out of the chicken, beef, and fish and been faced, instead, with a plate of vegetables cooked to varying degrees (raw, cooked, overcooked, somewhere between raw and overcooked I never thought was even possible) or a pasta primavera situation with floppy noodles, limp mushrooms, roasted red peppers, and a few sad thyme leaves.I don’t mean to complain: I just mean to express how jealous I have been of my neighbors’ roast chicken. Not because it’s roast chicken but because it looks like a full, satisfying meal. It’s not that a plate of roasted vegetables is the worst thing in the world—it’s just that it doesn’t compare to chicken thighs plated with a mound of mashed potatoes and a pile of steamed green beans. (And don’t get me started on the tofu “steak.”)Just to make sure I wasn’t alone, I texted a few vegetarian friends the question “What is the best/worst vegetarian entree you’ve been served at a large event like a wedding?” Friend one said, “I don’t like roasted vegetables”; friend two said “def like a stack of grilled vegetables with nothing else on the plate” (yes, I did point out that this was exactly what we served at our wedding); friend three didn’t respond but I won’t take it personally—she’s very busy. After that, I ran out of friends.It’s so hard to come up with a non-pasta main that leaves vegetarians full but ready to dance. The way I usually eat at home—various vegetables supplemented with a random protein-forward add-on like tempeh crumbles or spicy tofu or marinated lentils—doesn’t easily translate into a cohesive plated dish that a caterer can efficiently cook and serve.Our catering company, a truly excellent Baltimore institution, did present plenty of options: grilled tofu with stir-fried vegetables; chef’s seasonal lasagnetta (yes, an individual-sized lasagna with winter squash and, inexplicably, craisins); and wild mushroom risotto. We’ve already covered how I feel about tofu slabs, the lasagnetta tasted as weird as it sounded, and my mom ruled out risotto categorically, reasoning that there was no way it could be good (“It’ll be gummy!” she insisted. We never were able to prove her wrong).So we were left with the veggie stack.Being a food snob and a generally Compulsive Person, I pitched a few ideas to the caterer before the tasting: how about a warm grain salad, I piped up, with farro, seasonal vegetables, and cheese? Or a vegetarian galette, with cheese and roasted root vegetables? I even sent a reference photo, being the insufferable human being that I am. But when we arrived to taste our way through the menu (tip: you don’t need to try the mashed potatoes with every entree if they’re the same each time), we were presented, nevertheless, with the Vegetarian Napoleon “Tower,” with no galette or grain salad in sight. That’s 1 for grilled vegetables, 0 for Sarah Jampel.To find out what could I have done to avoid the Tower of Doom, I checked in with Jamie Erickson, the owner and creative director of Poppy’s Catering in Brooklyn. She explained to me that Poppy’s often recommends family-style meals in order to keep a wide range of guests happy: People can try a lot of different dishes, and vegetarians, in particular, have the opportunity to get something protein-y and something carb-y, along with plenty of vegetable sides. Poppy’s spring menu options include olive oil-poached vegetables over herby pumpkin seed spread, turmeric couscous with chickpeas and leeks, pea shoot and radish salad with burrata, grilled za’atar flatbread, asparagus and spring onions, and smashed new potatoes with snap peas. None of these would constitute a meal on its own, but that’s the beauty of mix-and-match.For those forgoing family-style, there are options for vegetarian entrees besides the stack: herby polenta with spring vegetables and a poached egg, and a mushroom galette (yes, this was redeeming to learn, thanks for asking) with lovage pesto (can you even believe it?) and shaved comté, both of which sound infinitely more appealing than a plate of roasted vegetables.If you can’t find a caterer like Poppy’s, you can still make moves to ensure vegetarian guests are happy and well-fed: Pick a lot of veg-friendly appetizers or devise some sort of cheese-dip-crudite station that your friends can graze on throughout the night. If none of that is a possibility, just remember this: Your friends and fam are ultimately there for you, not the food (meaning that you’re more worried about it than they are). My friends who said that a pile of  grilled vegetables is the worst vegetarian wedding food? Neither remembered that that was exactly what we served at my wedding.And fellow vegetarians (or picky eaters), here’s a word to the wise: It’s okay—smart, even—to anticipate your hunger and have a snack beforehand (I even know some carnivores who pre-eat before veg-heavy events—it goes both ways!). If that doesn’t work out, locate a pizza place where you can stop on your way home. There’s nothing quite like eating a slice in a tux or gown.*By “I,” I mean my mom. Thanks again, mom.Explore Bon AppétitThe Not Depressing VegetarianVegetarianWeddingHealthyishessayRead MoreLifestyleTempeh Crumbles Are My Weeknight WingmanBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-30", "author": ["Condé Nast", "Sarah Jampel"]}