{"id": "4ba8a2cb7880a5f2ee9dadd511bd0742", "url": "https://www.bonappetit.com/story/deep-dish-pie-dish", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The Case for the Deep Dish Pie Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSummer Pies Should All Be Deep DishYou get more pie. It just makes sense. Here’s our favorite equipment for the job.By Alex BeggsJune 18, 2019FacebookTwitterEmailFacebookTwitterEmailThere are situations and scenarios in which you need more pie. Ha ha, just kidding. THAT’S EVERY PIE SCENARIO. Which is why we the people of Bon Appétit, in order to form a perfect pie union, advocate for the deep dish pie dish.First, you get more pie—more filling and crust for ALL. (Slab pies, which are essentially bars, don’t cut it, we deserve that exterior wall of crust.) And visually, it’s stunning. Tall and dramatic, dense with fruit. When it’s sliced, you get generous wedges that look like cartoon slices of pie.The one for the job.\nPhoto by Chelsie CraigThe Bon Appétit Test Kitchen uses the Pyrex 9.5\" pie plate because the clear glass means you can peek at the bottom of the pie to see if the crust is browning. For some reason, none of these pie plates actually call themselves “deep dish”—it’s confusing. So look for any 2\" tall pie dish—I have this cute ruffly Crate and Barrel one, for example. In comparison, a regular pie dish is only around an inch high, giving you lots of crust in every bite but not as much fruit. That’s fine for a custard or chocolate cake, but in the summer when berries and stone fruits are at their peak, we need deep dish.Laura Murray, styling by Anna BilingskogExhibit A:It’s blueberry season. When the good, limited-edition fruits are in season, you need to consume them in gigantic quantities to make the most of it. (It = life). A blueberry pie should overfloweth with berries (did you see that beauty above?). Cornstarch, lemon zest, some sugar, and let those eight cups of blueberries sing within the walls of buttery, flaky crust. This recipe is so good, to make it in an average pie dish would be woefully unsatisfactory: people would come back for a second slice because they only got like, ¼ cup of blueberries in their first slice. They want more! And what if you run out? Deep dish pie dish is the serving slice size that gets the job done.Get the recipe: BA’s Best Blueberry PieExhibit B:Strawberry-rhubarb pie. Same story. This rhubarb ain’t gonna be here much longer. Maximize its potential by maximizing your pie.Get the recipe: BA’s Best Strawberry-Rhubarb PieGentl & HyersExhibit C:Apple pie. Apple season, according to me, is year-round. Others in the BA offices feel it is late August to early September. No matter what, deep dish apple pie is a county fair–winning American delicacy. Readers always think the four pounds of apples called for in this recipe is a misprint. It isn’t.Get the recipe: BA’s Best Deep Dish Apple PieEvery pie can be a deep dish if you so desire. I suggest this deep dish-ready apple pie crust as your base—and honestly, that’s a good pie dough for any occasion because it rolls out generously so you never have that stressful moment when the dough comes up short inside the pan, or gets rolled so thin it tears. Most pie recipes call for enough filling to fit in a deep dish, but if you’re worried it’s looking skimpy, up the fruit filling by 50 percent, mounding it on top like a fruit mountain. (And always bake on a foil-lined baking sheet to catch fruit juices bubbling out.)Now, I’ve met a single person, named Christina Chaey, who prefers a crust-heavy ratio in her fruit pies. She wants nothing to do with deep dish pies. She prefers a slice of pie that’s closer to a Pop-Tart it’s so crusty. Okay, fine. I guess both kinds can exist in this world. But if you’re coming over to MY house, with MY rules, we’re diving into the deep dish.Buy it: Pyrex Easy Grab 9.5\" Glass Pie Plate 2-pack, $13 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsPieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-18", "author": ["Condé Nast", "Alex Beggs"]}