{"id": "4bb022c0f5a7af0773ebdb2fbfb17260", "url": "https://www.bonappetit.com/recipe/salted-watermelon-margarita", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Salted Watermelon Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Watermelon MargaritaBy Molly BazJune 26, 20184.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintIf a classic margarita on the rocks with salt is undeniably perfect for you, then this watermelon version will exceed all your notions of cocktail perfection. It’s refreshing, naturally sweet without added sugar, and just look at that color.IngredientsMakes 1Kosher salt1lime wheel3oz. Salted Watermelon Juice or fresh watermelon juice1½oz. tequila blanco¾oz. fresh lime juicePreparationStep 1Place some salt on a small plate. Rub rim of an old-fashioned or rocks glass with lime wheel (reserve for serving); dip in salt.Step 2Combine watermelon juice, tequila, and lime juice in a cocktail shaker. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds. Strain cocktail through a Hawthorne strainer or a slotted spoon into prepared glass. Garnish with reserved lime wheel.How would you rate Salted Watermelon Margarita?Leave a ReviewTell us what you thinkReviews (3)Back to TopTrianglereally tasty... my husband was hoping for something a bit more sweet, so we did the tequila and lime juice as directed and added 1/2 oz Cointreau and then topped off with the salted watermelon juice... it was equally as delicious and gave him the bit of sweet he wanted.APAnoka, MN6/1/2021Delightful.  Could easily just drink these down to excess.  The salt is a masterful touch.  Beautiful color.PaulTexas5/31/2021What's the over/under on using Mezcal for this recipe?AnonymousMichigan6/18/2019Explore Bon AppétitCocktailDrinks AllMargaritaMexicanLatin AmericanWatermelonMelonFruitTequilaAlcohol & Other DrinksSummer5 Ingredients or FewerDrinksFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Molly Baz"]}