{"id": "4bb403de2e7d94e86d0be0ba2b5b0f6f", "url": "https://www.bonappetit.com/story/burger-deluxe-summer", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "The Burger Recipe That Makes Me Forget About Smash Burgers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Burgers Make Me Forget About Smash BurgersA weekly dispatch from Bon Appétit's editor in chief.By Adam RapoportJuly 31, 2018FacebookTwitterEmailFive ingredients and five steps will get you to burger heaven.Romulo YanesFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The only way to make a classic burgerThe other night, I did something I rarely ever do: I grilled burgers.I know, I know! What kind of person never grills burgers? Just hear me out.For one, as I wrote a few weeks back, I’m trying to expand my grilling game this summer, firing up everything from Korean-style short ribs to charred cabbage. And over the past several summers, when I do grill burgers, I’ve been making smash burgers, wherein I place a cast-iron skillet on my Weber, and I pretend I’m a short-order cook at Shake Shack. See, just look here—video proof!But every now and then, I really want a classic, charcoal-grilled burger: plump, glistening with fat, kissed with smoke and flame. It tastes just like summer.Want this letter before it hits the website? Sign up for our newsletter!Here’s my technique.Eighty-twenty ground beef is non-negotiable. That is 80 percent meat, 20 percent fat. Anything leaner and it’s going be dense and not nearly as juicy as you want it to be. So when you’re at the grocery store meat counter, steer away from the blend that says 85 or 90 percent lean.Next, grab and handful of ground beef and pack it as loosely as possible, so it’s just holding together. If you want, you can use your thumb to form a dimple on the top side. Our friend Bobby Flay says this prevents it from turning into one of those bulbous burgers your dad used to grill up.Now, lay the patty onto a well-cleaned grill over medium-high heat. Basically, this is as hot as a gas grill will go, or if using charcoal, you want glowing orange coals. A sprinkle of salt on the burger. And then don’t touch it. Just let the fire do its thing, imbuing the patty with flavor and smoke, and imparting a dark brown, crispy sear. Maybe five minutes, depending on how thick it is. Flip it gently, and then add another sprinkle of salt. Top with cheese. I like the gooey glossiness of American, but if you’re the cheddar type, go for it.At this point, once all your patties are cheesed up, put the top on, vents open, and let it go for about a minute until the cheese fully melts. Done. Medium rare. If I’m feeling ambitious, I’ll toast the buns (potato rolls, preferably). Condiments? Not much. Special sauce is never not a good move. Otherwise, I’m okay with straight mayo. I’m not going to argue with a sliced, ripe avocado. Maybe some crisp bibb or butter lettuce. Tomatoes, only if it’s August.The only problem is, one burger is never enough, but two is too much. So make sure you’ve got a partner, and go halfies on the second one. I mean, why not? It’s summer. And, really, how often do you grill burgers?Get the recipe:The BA Burger DeluxeView RecipeExplore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Adam Rapoport"]}