{"id": "4bdd4cc115b6ac80e17529d503e6de60", "url": "https://www.bonappetit.com/story/what-is-powdered-sugar-and-can-you-make-it", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "What Is Powdered Sugar and How To Make It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Powdered Sugar (a.k.a. Confectioners’ Sugar) and Can You Make It Yourself?What it is, what it’s good for, and what to do when you don’t have any.By Molly BazDecember 6, 2021FacebookTwitterEmailAlex LauFacebookTwitterEmailPowdered sugar, confectioners’ sugar, icing sugar, 10X—what does it all mean?! A whole lot of the sameness, as it turns out. Whatever you call it and however you use it—to coat doughnuts, marshmallows, or chocolate-covered cereal, to cover up an unsightly lemon square, to sweeten angel food cake batter (hey, some people must like it…), to mix into cream cheese frosting—powdered sugar is an invaluable ingredient in many bakers’ pantries.But what is it, when do you need to use it (versus swapping in the regular stuff), and can you make powdered sugar yourself if the circumstances require it? That’s what we’re here to find out.Let’s get it out of the way: Is confectioners’ sugar powdered sugar?Yes! Powdered sugar, confectioners’ sugar (including confectioners sugar and confectioner’s sugar too), icing sugar, and 10X (a reference to the size of the particles) are all the same.Okay, so what is powdered sugar?Simply put, powdered sugar is granulated white sugar that’s been pulverized to a fine powder. Whereas granulated sugar is sandy and coarse, powdered sugar is so fine that it feels almost chalky. Commercial powdered sugar is also mixed with a small but mighty amount of cornstarch that acts as an “anti-caking agent,” preventing the coagulation of large clumps.So if powdered sugar is that close to granulated sugar, what's the big deal? When is it essential and when can you say, \"Who cares!\" and just use the regular stuff?What is powdered sugar used for?Even though powdered sugar is only a single ingredient away from regular sugar (a one-generation difference, if you will), it plays a very different role in baked goods.First and foremost, powdered sugar affects the texture of what you’re making. You’re probably familiar with the notion of creaming butter and sugar together when making cookies, cakes, and pastries. When beaten with butter, granulated sugar creates millions of tiny little air pockets in its wake, which result in doughs that are light and airy in texture. But when you cream powdered sugar with butter in the same manner (as we do in these ridiculously simple Brown Butter Wedding Cookies), the finer texture of the sugar is unable to generate those same air pockets, leaving you with a denser, crumblier (but by no means inferior!) cookie texture. All this to say, if you’re going for an ultra-tender, crumbly, melt-in-your-mouth shortbread type of situation, look for recipes that call for powdered sugar. If a crisper, crunchier cookie (think chocolate chip) is more your thing, well, you already know which direction to head.Unlike granulated sugar, powdered sugar dissolves easily at room temperature, with no real agitation needed. That makes it great for glazes, buttercreams, frostings, icings, mousses—basically anywhere where the mixture won’t be cooked or where a smooth texture with no hint of graininess is especially vital.Some of our most beloved royal icing and glaze recipes, in fact, are simply a combination of powdered sugar and a small amount of liquid. Sometimes that liquid is milk or cream or buttermilk, other times it’s water or lemon juice or strong coffee or tea. When you whisk these two ingredients together, a marvelously viscous, shiny, pourable glaze forms, aided by the thickening, gelatinizing power of cornstarch, one of two essential ingredients in powdered sugar. (Ever played the Ooblek game and made that mysterious cornstarch-and-water concoction? Well, some genius put all those childish science experiments to use and invented The Glaze. Props.)Powdered sugar is what brought you the glaze on that lemon pound cake. \nPhoto by Caleb AdamsPowdered sugar also comes in handy in no-bake candies (fudge or Buckeyes, for example), where it brings that melt-in-your-mouth sweetness, and you’ll also see in some meringue recipes, where, thanks to the cornstarch, it acts as a stabilizer.How to make powdered sugarNow to answer the burning question: Can you make your own powdered sugar if you don't have any lying around? The answer is YES!To make homemade powdered sugar, you’ll need two ingredients: granulated sugar and cornstarch. The magic ratio is 1 cup granulated sugar to 1 tablespoon cornstarch. Combine the two in a high-powered blender like a Vitamix, a food processor, or spice grinder, then blitz away until you have a soft, powdery consistency—the total time could be several minutes, depending on the power of your machine.I wouldn’t recommend using a spice grinder to make larger batches of the powdery stuff, as it can get a bit messy, and in most instances where you’ll need several cups, it’s probably worth it to go get yourself a box from the grocery store. But when you only need a few tablespoons for dusting over brownies (yet another great use for the powdered stuff), this trick will save you from an unnecessary trip.Can you use granulated sugar in place of powdered sugar?In most cases, no. If you’re making a recipe in which powdered sugar is a vital ingredient (cookie dough, for example), stick with powdered sugar or risk getting a final product that doesn’t meet your expectations. But if you are going to try your hand at substituting, you’re more likely to get decent results if you substitute by weight rather than by volume. (Powdered sugar weighs 113 grams per cup whereas granulated sugar weighs 200 grams.)One last thing! You can absolutely forego powdered sugar altogether for sweetened whipped cream. I don’t know about you, but my mother always swore by adding powdered sugar to her cream before whipping it. And as is the case with most mothers, she is always right, so I never gave it another thought. Until one day I grew up, started to use all my powers of critical thinking, and realized that there is absolutely no reason granulated sugar doesn’t work just as well when whipping cream. Assuming that you're going to Whip It Good, there’s no chance the granulated sugar will remain undissolved, and therefore will sweeten your cream just as well as powdered. I promise.So yes: You need it. Sometimes. And yes, you can you forego in some situations. AND you can make it yourself if you have to. Now you have all the answers. So what're you waiting for? Go make those outrageously good Brown Butter Wedding Cookies already!The cookies in question:Brown Butter Wedding CookiesSix-ingredient cookies for people who don't think they can bake cookies.View RecipeThis article was originally published in 2018 and was updated by Sarah Jampel in 2021.Explore Bon AppétitBasicallyPowdered SugarBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Molly Baz"]}