{"id": "4be70b8dff9199c3b008686486e5400b", "url": "https://www.bonappetit.com/recipe/strawberry-wild-rice-tartlets", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Strawberry and Wild Rice Tartlets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueStrawberry and Wild Rice TartletsBy Rivianna ZellerApril 20, 20213.5(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jaida Grey Eagle, prop and food styling by Rose DanielsEmailPinterestPrintEmailPinterestPrint“Wild rice is such a staple and you can do so much with it,” says Rivianna Zeller, a sous-chef at Gatherings Cafe inside the Minneapolis American Indian Center. They come from the Bad River Band of Lake Superior Ojibwe and have been making desserts for elders in the Minneapolis community as part of Gatherings Cafe’s meal delivery. Zeller didn’t want to rely on dairy, processed sugars, and flour, because those aren’t native ingredients, so they came up with this simple (and vegan!) dessert: a palm-size tart crusted with crispy wild rice and brimming with berries.Zeller loves Native Harvest wild rice for its consistent high quality and exceptional softness; the grains are grown in the lakes of northern Minnesota and hand-harvested by Ojibwe tribe members. The wild rice forms the shells for this dessert, which are topped with dried cherries that are rehydrated in hot water to soften them as well as add body and sweetness to the strawberry filling.IngredientsMakes 12Vegetable oil (for pan)Kosher salt1cup wild rice8oz. dried tart cherries1lb. strawberries, hulled, plus halved \tstrawberries for servingSmall mint leaves (for serving)PreparationStep 1Heat oven to 350°. Brush the cups of one standard 12-cup muffin pan or two standard 6-cup muffin pans with oil. Bring 6 cups lightly salted water to a boil in a medium saucepan. Add rice, cover, and cook until water evaporates and grains split open, about 1½ hours. Spread out rice on a large rimmed baking sheet and let cool. Reserve pan.Step 2Return rice to pan and, using your hands or a potato masher, smash until rice looks like a chunky mash and grains stick together.Step 3Working one at a time, scoop about 3 Tbsp. rice into each muffin cup and, using an oiled spoon, press rice across bottom and all the way up the sides of each cup to create a hollowed-out shell. Bake until rice is darkened in color and sides of shells are crisped, 25–40 minutes. Let shells cool in pans, then, using an offset spatula, carefully transfer to a platter.Step 4Combine cherries and 2 cups cold water in a clean medium saucepan and bring to a simmer over medium heat. Cook until soft and plump, 5–7 minutes. Drain and let cool.Step 5Transfer cherries to a blender and add 1 lb. strawberries; pulse until a chunky purée forms. Use filling immediately or transfer to an airtight container, cover, and chill until cold, at least 1 hour and up to 5 hours.Step 6To serve, fill each shell with about 1 Tbsp. plus 1½ tsp. filling. Top with a strawberry half and a leaf or 2 of mint.How would you rate Strawberry and Wild Rice Tartlets?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleInedible. Gonzo Phillips Austin, Texas 5/5/2021Explore Bon AppétitFruit DessertDessertStrawberryBerryFruitRiceRice & GrainsGluten-FreeDairy-FreeNut-FreeVeganBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Rivianna Zeller"]}