{"id": "4be7cb455989652d5071e85d784bd292", "url": "https://www.bonappetit.com/story/give-raisins-a-chance", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "I Beg You, Please, Give Raisins a Chance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Beg You, Please, Give Raisins a ChanceWe can all agree that they're a terrible snack food, but cooking with raisins is a different story.By Alex DelanyFebruary 27, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf eight-year-old me heard present-day me say that I love raisins, he’d probably be confused and angry. Raisins? The dried up grapes that come in a little cardboard box? The ones that you squish into the corner of said box and pull out as one purple-brown gummy clump, when all you wanted was a single raisin? The world’s worst lunchbox snack? Yes. Ex-grapes. Raisins. That is what I’m talking about.Because while raisins are absolutely the world’s worst snack food—you will not convince me otherwise—they're actually an incredible ingredient. They have a lot to offer. There's a chance that, after years of opening your lunch box to the face of that woman in a red bonnet, smiling hopefully at you from a box of dried fruit, you haven't thought to give raisins the time of day. But I think it's time you opened your heart and gave these little guys a chance.But wait. Why the hell do I like raisins if they’re no good for snacking on? Well, raisins are sweet. You probably know that by now. And they also have texture, unlike sweeteners like honey or sugar which dissolve into whatever you add them to. This means that raisins possess a very nice two-for-one value. And I’m not talking about desserts. I’m talking about adding raisins to savory dishes.We recently published an extremely foolproof fish with spiced chickpeas recipe, and while I do love the fish and the chickpeas, the best part of this recipe is the condiment. Want to guess what’s in it? Yup. Mint.  And shallots. And vinegar. And a bunch of raisins. It’s a tangy, fresh, sweet condiment that I’d throw on just about anything, and a very good example of the flavor profile that raisins are so good at creating, a tantalizing sweet and sour combination that the Italians call agrodolce. When it comes to acid-based condiments, mixing in some chopped raisins is a sure-fire way to get that sweet-and-sour flavor bomb.There are raisins in that condiment. And it rules.\nPhoto by Chelsie Craig, Food Styling by Rhoda BooneBut there are so many non-condiment situations in which raisins excel. They find their way into just about every pilaf that I make, balancing the crunch of nuts and the savory element of the spices and rice. And I love it when they're incorporated into a heavily-marinated salad, where they soak in the acidity of a vinaigrette to create that irresistible agrodolce flavor we talked about earlier.My favorite move though, the one that really does it for both me and for raisins, is to stir some into a braise. When I’m braising chicken legs or short ribs, I’ll throw in a handful of whole raisins right into the stewing liquid. (You could chop them if you want them to be less noticeable.) The raisins add sweetness and a depth of flavor to the sauce, and they actually rehydrate while they cook, transforming into delightfully-squishy deflated grapes. That sounds weird, but when you get one in the same forkful as a bit of shred-y, tender lamb shank, well, that's just a beautiful thing.What I’m saying here is not necessarily that your distaste for raisins is wrong. I’m just asking that you reexamine them with an open heart. If you hate snacking on raisins, cool. I do too. But I don’t hate raisins. When it comes to cooking, I love them. And maybe you do too.Now, here's that fish I was talking about:Foolproof Fish With Spiced ChickpeasJust about the most approachable at-home fish cooking method there is.View RecipeExplore Bon AppétitBasicallyRaisinGrapeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-27", "author": ["Condé Nast", "Alex Delany"]}