{"id": "4bf36d5d2ee58274b37ca7c005f0278e", "url": "https://www.bonappetit.com/story/storing-tomatoes", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "How to Store Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt Turns Out, You Can Store Tomatoes in the FridgeWell, sometimes, that is. Allow us to explainBy Sarah JampelSeptember 1, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere’s much debate about the best way to store tomatoes. Some maintain that storing them in the refrigerator turns them mealy and unpalatable; others say it doesn’t make any difference at all. But when you’ve gone through all the trouble of picking out the finest specimens at the farmers market, keeping them at their best is crucial. Turns out that there’s one guiding principle to follow: Where you should store your tomatoes depends on their state of ripeness. Below, we outline how to store tomatoes to ensure you enjoy them at their ripest and most flavorful.Underripe TomatoesThis is the situation when you definitely don’t want to store your tomatoes in the fridge—chilling them will prevent them from ripening and developing flavor. Instead, place them stem side down in your pantry or on your countertop to reduce moisture loss so they stay juicy and wrinkle-free, and make sure to keep them in a single layer to prevent bruising. Keep them at room temp until they’ve reached your desired level of ripeness.Ripe TomatoesThe fridge is your friend, not your foe in this scenario. Supermarket tomatoes have already been refrigerated in their journey to you, so a little more chill-out time won’t hurt them. And unless you’re eating them immediately, ripe, locally grown tomatoes will also last longer in the fridge; eat within a few days. Store ripe tomatoes in your fridge stress-free and enjoy them within a couple days of purchasing.Cut TomatoesYou’ll want to eat cut tomatoes later that same day, or stash in an airtight container in the fridge to use up within the next day or two. Any longer and they’ll lose flavor, develop a dry “skin” on the cut flesh, and just not taste their best. If you happen to forget about them at the back of your fridge, toss them into your next stir-fry or soup, or dress them in a zippy vinaigrette to revive them instead of letting them go to waste.And if you’re going to refrigerate them...Cold temperatures tend to dull flavors, so if you’re going to store your tomatoes in the fridge, just make sure to let them come up to room temperature before serving them to make sure they taste their best. Pro tip: Slicing or cutting them into smaller pieces will help the tomatoes warm up faster than they would if they were left whole.Store, Eat, Repeat:Picnic TomatoesLet the dressed tomatoes sit an hour or so before serving so they can soak up maximum flavor.View RecipeExplore Bon AppétitcookingStoringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-01", "author": ["Condé Nast", "Sarah Jampel"]}