{"id": "4bfcb67d7a8a8c8c534da2cf7a082050", "url": "https://www.bonappetit.com/story/dawn-davis-march-2021-issue", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Dawn Davis Is Happy to Be Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Happy to Be HereBon Appétit's new editor in chief, Dawn Davis, looks back at her first print issue for March 2021.By Dawn DavisFebruary 25, 2021FacebookTwitterEmailPhoto by Jeanna Shepard (@jeannashepardphotography)FacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what's on her mind by taking over our newsletter. You’ll find recipes she's cooking, stories she's loving, where she's been eating, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I collect friends who love to eat like a serious wine enthusiast collects rare vintages. If you don’t want to plan the day around what you’re eating next, I’m not sure we can hang. When my friends and I aren’t hunting down reservations, we’re cooking for one another. Sometimes the meals are elaborate, sometimes they’re simple. Passed down like family heirlooms, the recipes come from binders overflowing with clippings, from cookbooks, and from magazines, especially Bon Appétit, a favorite and trustworthy source for me. So when the call came to leave book publishing to take the helm at this storied magazine as it reckoned with racial and cultural equity, it was impossible to resist, even if that meant working with my beloved authors—and other storytellers—in a different way. As a publisher I worked on all kinds of books, from a diverse group of storytellers and in a variety of genres: history and memoir, fiction and reportage. I’ll bring that same ethos and variety to these pages, striving to always be food-forward and to cover the ways in which food is central to almost everything we touch.One year into the pandemic, as so many of us bounce between Zoom meetings and monitoring our children’s homeschooling, there’s so much focus on lunch, as in, Oh no, not again. “What’s for Lunch?” comes to our rescue with a wonderful suite of recipes that make the midday meal something to look forward to. And on the intertwined subjects of lunch and the pandemic, how could we not acknowledge essential workers in food, like Ravon Jones, a cafeteria manager at a school in Alabama who makes sure students get a good meal? By sharing their stories my hope is we’ll appreciate them more, even post-pandemic. We also hear about one cafeteria supervisor whose life was cut short when he was gunned down by the police: Philando Castile. The work his mother, Valerie, is doing in his name to reduce lunch debt moves me deeply.Chef Melissa Miranda’s adobo chicken, garlic fried rice, and winter greens laing.Photograph by Chona Kasinger, Prop styling by Callie MeyerI’m excited to introduce two new columns. With “All on the Table,” cultural figures explore personal moments transformed by the force that is present when we engage over a meal. Civil rights leader and the veep’s sister, Maya Harris, takes the reins this month. And in “Dream Dinner Party,” the legendary Cicely Tyson, who died at 96 right after our March issue went to the printer, revealed who she’d most like to invite over. Of course, we’ve got food galore. Andy Baraghani reveals how spices can transform food, and in a world where travel is limited, we bring the world to you. Chef Melissa Miranda of Seattle restaurant Musang has a flavorful oven-roasted adobo chicken recipe that had us all raving.Finally, we have a piece featuring women entrepreneurs. Women-owned businesses helped pull us out of the 2008 recession. As we recover from the ravages of COVID-19, we need this kind of leadership more than ever.That’s it for my first issue, one in which I hope you’ll come for the food and stay for the inspiration.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-25", "author": ["Condé Nast", "Dawn Davis"]}