{"id": "4c00cd33143b97532a637425d36ba78a", "url": "https://www.bonappetit.com/recipe/bean-confit-with-lemon-saffron-and-all-the-alliums", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Bean Confit With Lemon, Saffron, and All the Alliums Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBean Confit With Lemon, Saffron, and All the AlliumsBeans cozy up with spring alliums and plenty of olive oil.By Asha LoupyMay 16, 20214.5(65)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintMy favorite way to eat these super lemony, saffron-tinged beans is spooned over a deeply toasted slice of sprouted rye slathered with some kind of creamy cheese like ricotta, fromage blanc, or fresh chèvre. If you want something a little heftier, these beans are the ideal mate for a variety of add-ins. You could stir some shrimp in during the last few minutes of cooking, nestle a salmon fillet into the beans during the final 7–10 minutes in the oven, or toss in loads of baby kale, letting the residual heat wilt the greens, and top with jammy 6-minute eggs. If you can’t find jarred gigante or corona beans, make it a choose-your-own-bean adventure—cannellini, borlotti, navy, or chickpeas are good. If you can’t find spring onions, try doubling up on the leeks or using whole scallions (don’t halve them). —Asha LoupyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet with Lid$40 At Amazon8-Inch Chef's Knife$47 At AmazonTongs$13 At AmazonColander$11 At AmazonWooden Spoon$6 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketIngredients4 servingsBig pinch of saffron threads2lemons, divided1medium leek (about 8 oz.)2–3spring onions (6–8 oz. total)1–2green garlic stalks or 1 head of garlic1cup extra-virgin olive oil, divided2bay leaves, preferably fresh112–15.5-oz. jar or can white beans (such as gigante, corona, cannellini, or navy)¼cup dill fronds¼cup mint leavesFlaky sea saltCrusty bread (for serving)PreparationStep 1Preheat oven to 375°. Place a big pinch of saffron threads in a small bowl. Cut 1 lemon in half and squeeze juice of 1 half over saffron. Let sit 15 minutes. Meanwhile, slice remaining lemon half and remaining 1 lemon ¼\" thick; remove any seeds. Set lemon slices aside.Step 2Using a chef’s knife, trim dark green tops and roots from 1 medium leek; discard. Slice white and green parts into ¾\" rounds; place in a colander and rinse well to remove dirt (try to keep intact). Pat dry. Trim dark green tops and roots from 2–3 spring onions; discard. Slice onions in half lengthwise. Thinly slice 1–2 green garlic stalks or trim top quarter from 1 head of garlic to expose cloves.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat ¼ cup extra-virgin olive oil in a large skillet over medium-high. Arrange leek in a single layer in skillet and cook, undisturbed, until starting to turn deep golden brown underneath, about 3 minutes. Using tongs, transfer leek to a plate, keeping rounds as intact as possible. Arrange spring onions, cut side down, in skillet (if using head of garlic instead of green garlic, add to skillet, cut side down, too). Cook, undisturbed, until dark golden brown, about 2 minutes. Transfer to plate with leek.Step 4Reduce heat to medium. Add green garlic and remaining ¾ cup extra-virgin olive oil to skillet and cook, stirring often, 30 seconds. Remove from heat and add saffron and lemon juice, reserved lemon slices, 2 bay leaves, and 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt. Drain one 12–15.5-oz. jar white beans (such as gigante, corona, cannellini, or navy) in a colander and rinse under cold running water. Add beans to skillet and gently stir to coat in flavored oil. Nestle leek and spring onions (and head of garlic, if using), browned side up, into beans. Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Cover skillet and bake in oven until alliums are starting to soften, about 20 minutes. Remove skillet from oven, uncover, and gently stir beans to ensure they are mostly submerged. Re-cover skillet and continue to bake until alliums are meltingly tender and lemons are soft and jammy, 15–20 minutes more. Uncover and let sit 5 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Serve straight from skillet or transfer to a shallow bowl. Top with ¼ cup dill fronds and ¼ cup mint leaves and sprinkle generously with flaky sea salt. Serve with crusty bread for sopping up oil.How would you rate Bean Confit With Lemon, Saffron, and All the Alliums?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleMade the recipe exactly as written, but used a light dusting of fennel pollen instead of the dill fronds for garnish.  Added two salmon fillets in the last eight minutes as recommended...absolutely sublime!DNHonolulu, HI11/15/2021It was too bitter for us and I even added chicken stock to make it more broth-y. Maybe my lemons were just extra sour? They were on the larger side...AnonymousBrooklyn, NY10/26/2021I've made this about a 1/2 dozen or more time now and I find adding some \"better than bullion chicken flavor\" with some water - about 1/3 cup, and some more EVOO, and a pat of butter BEFORE putting it into the oven yields amazing results. Creamy and rich beans in a sublime 'gravy'. Yum. \nShazzizNYC9/14/2021SO GOODAnonymous8/5/2021I didn't expect to be blown away by beans on toast. I thought it would be a perfectly fine dinner. I added shrimp as suggested for a heartier meal and served over a griddled piece of toast from a loaf I bought from a bakery a day or two prior. It was so so good. Will make this again for sure. My husband couldn't stop raving over it. DanielleSan Francisco, CA6/24/2021Great recipe! Next time I may separate the leeks after they bake, as I found myself doing that anyway to smush them onto bread… forgot the herbs at the end, but eating it now with some good bread and a jammy egg! Delicious!Kate L.New Orleans, LA6/21/2021This one didn't do it for me. It's possible that the beans I used weren't the best option (Greek giant beans) but they didn't cook all the way through and I ended up wasting the whole dish. The saffron was a first for me and I enjoyed the flavor but was disappointed to have wasted it on this dish. This was the first time I made a recipe I didn't like from basically.AshleyNew York, NY6/10/2021Loved this!! My husband gave it a 10 and that is not a rating given easily! Used leek, green onion and a bulb of garlic. I also used a generous pinch of saffron after reading another's review. Towards the last 10 minutes of cooking, I stirred in thin ribbons of dino kale and then nestled a large salmon fillet in the middle between the confit. Gorgeous, luxurious texture of all items, and perfectly done salmon. A winner!!Steffanie San Rafael, CA6/4/2021This was fabulous! \nWe had to use a head of garlic as garlic stem are not readily available here. The only suggestions I would make are a) use preserved lemons instead of regular lemons. Cut back on the lemons overall and some of the salt as well as preserved lemons are more intense and saltier than plain lemons. Also, if using a head of garlic instead of garlic stems, I would give the garlic head a head start in terms of roasting. I did feel that the saffron got lost somewhat. I might consider adding a little heat with some Aleppo peppers or Urfa Biber instead of saffron. \nBut I just always want to fiddle with a recipe. This recipe as written was fabulous.nlbknitterSan Francisco Bay Area6/3/2021These were genuinely the best beans I've had in my life and really easy as well! Substituted the dill for tarragon and served them spooned over a white risotto and it was perfect.EllieCambridge, UK6/2/2021incredible. worth the work. Anonymous5/24/2021Had great success with this one! Didn't use garlic heads (housemate is allergic) or the saffron (too expensive for me), also added some fennel seeds in stage 5 (just because). Tasted fantastic with some nice bread! One piece of advice, this recipe was just enough for two people, if you're cooking for more consider upping the recipe.DarcyMelbourne, Australia5/18/2021Explore Bon AppétitSaffronHerbs & SpicesLemonCitrusFruitWhite BeanBeanVegetableLeekSpring OnionOnionGarlicSpringSideMainDairy-FreeNut-FreeVeganVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-16", "author": ["Condé Nast", "Asha Loupy"]}