{"id": "4c1c2dff52f320414bcf26b788bb88b6", "url": "https://www.bonappetit.com/story/alex-wagner", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "For The Circus Host Alex Wagner, There’s No Such Thing as Food Without Politics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFor The Circus Host Alex Wagner, There’s No Such Thing as Food Without PoliticsThe cohost of Showtime’s hit documentary series talks identity, eating on camera, and that time she breathed Sriracha beef bites on Joe Biden.By Hilary CadiganFebruary 6, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Alex Wagner, co-host of The Circus, Showtime’s hit political documentary series.There’s almost no way Alex Wagner didn’t realize I had a total crush on her the moment she breezed through the door of the shockingly-empty-for-Manhattan-at-lunchtime cafe in which we met for an interview late last fall. I almost knocked over the table trying to greet her. But can you blame me? At a time when national politics feels like one of those rigged carnival games where you lose no matter what, having someone as smart and thoughtful and engaging as Wagner explain everything that happened at the end of each week—like she’s done for the past two years on Showtime’s hit documentary series, The Circus—is a special kind of blessing. Especially when she’s doing so in the perfect pair of oversized tortoiseshell Warby Parker frames with a mouth full of banana split. Iconic!As a host of The Circus (as well as, somehow, a CBS News correspondent, a contributing editor at The Atlantic, and author of the critically acclaimed book Futureface), Wagner spends each week zooming around the country, covering everything from the Mueller investigation to the impeachment trials to whatever the fuck just happened with the Iowa caucuses.The point of the show, she says, is taking viewers directly to the heart of the action, rather than talking about it from the air-conditioned confines of a newsroom. And a big part of this action revolves around food. Bagel shops in New York, taco stands in Texas, diners in the Midwest—these are the places where people naturally talk about politics, and The Circus is genius at using food both to break tension and heighten the drama. Wagner and her co-hosts, journalist John Heilemann and political advisor Mark McKinnon, kick off each episode chatting about the week ahead over a meal in a restaurant that establishes exactly where they are (which is, in turn, the epicenter of whatever’s going on in politics at the given moment). The food sets the scene with no shortage of style: Think toasty tortillas poofing on a comal, cheese oozing over the sides of a burger, and sushi masters cutting through wedges of slick tuna with slo-mo Chef’s Table precision.But the point of all the food, says Wagner, is not just symbolic. It’s a way of pointing out a very important fact: That food is always political, whether we like it or not.Over avocado toast (sorry) and lots of coffee, I talked with Wagner about her first food memories, the benefits of bringing up politics at the dinner table, and that time she breathed Sriracha beef bites on Joe Biden.My clearest memories of my family are… over food: My mom and grandmother making Burmese noodles and talking about their childhoods in Burma. My dad, who was a political consultant, coming home late and sitting down at the dinner table (four hours after the rest of us) to bemoan the state of a campaign. It’s a cliché, but the family table is where so much action unfolds. The fights, the arguments, the discussions—all of it happened over food.When I was 12… I was sitting at the American City Diner in D.C. My dad [who was white] went to the bathroom and I was left alone at the counter. The short order cook looks at me and says, “Are you adopted?” That was really a turning point, a “rosebud moment” as my editor calls it. That guy slinging hash made me realize that the way I saw myself was not the way everybody else saw me.My book, Futureface, is about… exactly this. It’s a search for my identity couched in the broader struggle we’re having in this country over who belongs here and who doesn’t. Politics at this moment is animated by some of the same questions. Who gets to be an American and what does that look like? For the book, I traveled the entire world to get answers, and came out of it a more empathetic, curious person. Politics remind us of the big divide between different parts of the country, but also that we all have to run this ship together. We’re all married to one another and there is no divorce happening.Most of the time you hear about politics on the news, it’s… from the confines of an air-conditioned studio somewhere in a major city. But politics happen out in the world, and with The Circus, we want to show you that world. Every episode begins with me and my co-hosts eating somewhere and talking about what’s happening. We want to place viewers in the middle of our insane American political landscape, and the way people tend to discuss politics is over a meal.My weakness is… arriving to shoots hungry. I am that fool. There is  all of this delicious food, so I am always caught trying to shovel it in my mouth and then make a deep point about, you know, our existential American drama. With my mouth full of taco. Today I was trying to eat a beignet on camera. You can’t do that. You can’t even eat a beignet on a date, let alone in front of an audience of a million people. I still haven’t learned my lesson. They’re constantly showing me the first edit of the show, and I say, “You guys, we need to get another shot where I’m not eating.” And they say, “Alex, you’re eating in every shot.”We try to shoot the food in a way that… gives you a sense of the energy of the place, wherever we are. So you get the slo-mo steak sizzle, the cheese pull—the food porn. Funny enough, we get more audience feedback on the food than anything else. Food is another character on the show, and like politics, reminds us of the bigness of this country. Whether we’re eating tacos at a roadside stand outside of Houston, or having barbecue somewhere down south, or beautiful fried eggs in New York City, they’re regional specialties that remind us of the history of this country, and the bounty it has to offer.The hardest part of working on The Circus is… that we have literally no idea what’s going to happen next, which is both exhilarating and downright terrifying. On television they always write the cliffhangers, but on our show we have no hand in the script-making. We start shooting on a Sunday or Monday, continue through the week, edit furiously over the weekend, and air it on Sunday night. Which means you never know when your next meal will be.In my bag, I always carry… a lot of RX Bars. Small packs of almonds. Organic unsweetened dried pineapple, which I buy in bulk on Amazon. And EPIC jerkies: chicken jerky and beef jerky and Sriracha jerky bites. I was with Biden in Iowa over the summer, and it was blistering 95-degree Hades heat. I was in the corner of the press gaggle just eating Sriracha beef bites to stay alive. And then getting close to him, breathing Sriracha beef bites. Horrible! I’m sorry, Mr. Vice President.I believe that food is… inherently political. The choices you make of what to eat or what not to eat; the people making your food; the way immigration plays out in the kitchen. Politicians don’t expect the argument of the day to infiltrate restaurants, but of course they do, because we’re all human beings. In 2018, during the ongoing controversy at the border, Kirstjen Nielsen and Sarah Huckabee Sanders were both accosted at restaurants. Tensions are very high, passions are inflamed, and with this administration there’s a sense that the traditional channels of outrage haven’t worked. So you see citizens saying, “Well, I’m taking it to your front doorstep.” That’s a new frontier in American politics.A lot of people say not to talk politics at the dinner table, but… I disagree. Now is the time to have those difficult conversations. Airing your viewpoints and making known your gripes, your biases, your outlook? That’s the only way you get through it. It may be hell to talk about your political views with your Uncle Jack, but we’ve got to start putting a human face on the struggles. America needs to sit down on one big therapy couch. Food is a form of that couch.Explore Bon AppétitHealthyishPerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-06", "author": ["Condé Nast", "Hilary Cadigan"]}