{"id": "4c1ec6a510923d2f89f8a4531050321e", "url": "https://www.bonappetit.com/story/marinated-greens", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "This Meal Prep Trick Makes Eating My Greens So Easy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Meal Prep Trick Makes Eating My Greens So EasyAnd saves fridge space too.By Lukas VolgerSeptember 7, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailWhen I get home from the farmers market—weighed down with bags brimming with yardstick-length leeks, carrot tops wafting in the wind, and bunches of Swiss chard the size of shrubs—I often find myself playing an elaborate game of Tetris trying to fit everything into my fridge. But one trick that helps me every time is setting all of the hearty greens aside, wilting them, and marinating them lightly before they ever pass the fridge door threshold. Not only does it drastically reduce the amount of real estate they take up, but it arms me with an important building block for the rest of the week’s cooking.Here’s how it works. Clean and de-stem about a pound (usually 2 or 3 bunches) of “hearty greens” like kale, mature spinach, Swiss chard, or collards. Then, tear the leaves into manageable pieces and cook them down until they’re soft. This can be done by quickly sautéing them with a splash of oil in a wide skillet or Dutch oven, or by steaming them over a little bit of simmering water in a pot. The greens should be wilted and tender but still vibrantly green. Once they’re just right, use tongs to transfer them onto a cutting board to cool, then grab them by fistfuls and squeeze out all the excess liquid over the sink, which keeps them from tasting waterlogged (extra important if you steamed them). Get them back onto the cutting board for a coarse chop, and then it’s time to marinate: Dress the greens with several glugs of olive oil and a few pinches of salt to taste. You want them to taste great, but remember that these marinated greens are more of a building block than a standalone recipe. Packed up in an airtight container, they’ll keep for at least a week, ready to be deployed at a moment’s notice.Once you have the basic idea down, you’ll understand just how flexible this method is. It’s a great way to quickly make use of bushy beet, turnip, and kohlrabi greens, and really whatever leafy thing you’ve got lying around. (Just remember that every green has a different cooking time, so make sure to cook each one separately before combining and seasoning them.) As for the marinade, you can add as much character as you’d like: lemon or orange zest, a drizzle of toasted sesame oil, whole spices like cumin or coriander, a splash of rice vinegar, or dried chile flakes will all add pizzazz. I tend to keep it simple, though, because that allows me the most flexibility later on in the week—you can always add flavorings to your marinated greens, but you can’t take them away. And once you’ve packed them away into the fridge, you’ll find that there are endless quick ways to incorporate them into your weeknight meals. Here are a few of my favorites.Sandwiches, Tacos, and CrostiniThese marinated greens make a satisfying and substantial sandwich filling; pair them with nut butter and sriracha, or fontina and roasted mushrooms for a grilled cheese. Or add them to tacos or tostadas along with cooked beans, salty cheese, shredded cabbage, and spritzes of lime juice. If you’ve got marinated greens, you also have a quick appetizer at the ready—smear a crouton or crostini with your favorite creamy cheese, pile on some greens, and top it all with a shower of lemon zest.Omelets and ScramblesA dinner-worthy omelet comes together in minutes when you have marinated greens to fill them with; add a dollop of yogurt or sour cream and a sprinkling of chiles and you’re all set. Or simply fold them into your scrambled eggs or tofu scrambles along with whatever bits of leftovers you have hanging out in the fridge.Bowls, Soups, and MoreIn any “modular” style meal—where building blocks like cooked grains, roasted vegetables or tofu, poached or boiled eggs, brothy beans, toasted nuts, and pickles come together somewhat spontaneously—these marinated greens are your best friend. They make a natural addition to a grain bowl, or can be folded into cooked grains with your favorite vinaigrette for a quick, make-ahead salad. Throw some into a soup to add extra heartiness and nutrition, or stir-fry with pasta or rice noodles. Once you see just how vast the possibilities are, you’ll start to feel lost without a container of marinated greens on hand.Sliding that smart, dense little container of possibility into my fridge—all those greens, a fraction their original size—always brings me great satisfaction. But the payoff always comes a few days later, when I get to thank my past self for making all those sustaining, on-the-fly meals possible.Throw some into this frittata, why don't ya?Spiced Chickpeas and Greens FrittataWhen in doubt, frittata.View RecipeExplore Bon AppétitcookingMeal PrepRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-07", "author": ["Condé Nast", "Lukas Volger"]}