{"id": "4c3207f788b5e47e6066f8acb2c5eac5", "url": "https://www.bonappetit.com/story/puerto-rican-thanksgiving-pavochon", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "There’s No Such Thing as Bland Food in a Puerto Rican Household. Case in Point: Pavochon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere’s No Such Thing as Bland Food in a Puerto Rican Household. Case in Point: PavochonA mash-up of pavo for turkey and chon for lechón, pavochon is the spice-lavished centerpiece of my family's Thanksgiving meal.By illyanna MaisonetOctober 28, 2020FacebookTwitterEmailPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioFacebookTwitterEmailMost everyone in our family had a key to Nana’s house. But it was impossible to sneak in, even when the Sacramento sun was rising and the late November light was still soft—robbin’ hour. As soon as I’d turn the key in the door and push it open a few inches, I could hear her penetrating campo intonation: “illy?” I’d assure her it was me and listen as the melody of her coughs mingled with the creaking of her white enamel bed and then each stair step as she made her way down to the microscopic kitchen.There Nana would open the refrigerator door to reveal the turkey, already on its roasting throne. She’d start her coffee, preheat the oven to 350 degrees (because that’s the chosen Fahrenheit of our ancestors), and run the coffee through the colador I mistook for a sock my entire life. Then, when the kitchen felt as hot as being under a San Marcos blanket emblazoned with La Virgen de Guadalupe, she’d send the turkey in and start on the dressing. (Who knows how Nana came up with this combination of buttery boxed cornbread mix and salty salami, but when placed on a fork with a piece of turkey and rich gravy, it’s the perfect bite.) Soon the house would be full of people and the sounds of dominoes clicking, music tumba’ing, bodies writhing, drinks flowing, and fists throwing.I’m still not sure why Nana would wake at the crack of dawn, put the turkey in the oven, go back to bed, and take it out seven hours later. My mom was so used to turkey cooked within an inch of its life that when I went to culinary school and tweaked Nana’s recipe, she was skeptical at my claims of doneness after just three hours. I grew up with the type of turkey I hear most people complain about: dry. But never flavorless. There’s no such thing as bland in a Puerto Rican household.Pavochon, both the word and the dish, is one of Puerto Rico’s many Spanglish creations. A mash-up of pavo for turkey and chon for lechón, it’s become the centerpiece of a Puerto Rican Thanksgiving. Come November, supermarket shelves across Puerto Rico hold all the classic components: cranberry sauce, stuffing, dinner rolls. The diaspora became accustomed to these items Stateside and brought them back to the island—which could be how pavochon was born. Nana herself had never seen a turkey before she came to California; once here, she used the knowledge she had to season an unfamiliar bird, lavishing it with cumin, oregano, and garlic, just as she would our country’s cherished spit-roasted pork dish.Because some people in the Puerto Rican countryside still have outdoor kitchens—using wood-fueled fogóns instead of ovens—putting the turkey on a spit and slowly roasting it until golden seems like the obvious route. But looking through my massive collection of Puerto Rican cookbooks, I find no trace of the word pavochon—or any turkey recipe at all—until the late ’90s, in the Cocina Desde Mi Pueblo companion cookbook from the popular Puerto Rican television series. What we do know is that turkey’s introduction is definitely American, one of the few favorable things that came out of colonialism.Nana has been gone since 2015, and in her absence our extended family has ceased to exist. There aren’t any more gatherings. There aren’t any more conversations. For the past five Thanksgivings, I’ve purchased a turkey from a local turkey farm and cooked it with my mom in her half-plex in Sacramento, a mile down the road from Nana’s old house. This year, once again, it will be just the two of us, sheltering as a pod. I’ll purchase the same turkey from the same turkey farm. Together we’ll turn it into the same pavochon.Get the recipes: PavochonPavochon, a mash-up of pavo for turkey and chon for lechón, is the centerpiece of a Puerto Rican Thanksgiving.View RecipeCornbread and Salami DressingButtery cornbread and salty salami, when placed on a fork with a piece of turkey and rich gravy, is the perfect bite.View RecipeExplore Bon AppétitThanksgivingTurkeyFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-28", "author": ["Condé Nast", "Illyanna Maisonet"]}