{"id": "4c3a7ab5fbf8abc7fad323651d9edc41", "url": "https://www.bonappetit.com/recipe/cauliflower-steaks", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Cauliflower Steaks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueCauliflower SteaksBy Claire SaffitzMarch 20, 20184.5(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintBecause cauliflower steaks are held together by the piece of stem at the base of each head, you can really only cut two thick steaks per cauliflower. Save the trim of making cauliflower rice or roasted florets.Ingredients2 servings1medium head of cauliflower3Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepperPlain whole-milk Greek yogurt and Coconut-Turmeric Relish (for serving; optional)PreparationStep 1Preheat oven to 400°. Remove the toughest outer leaves from cauliflower (leave the tender inner leaves) and trim stem. Resting cauliflower on stem, cut in half from top to bottom, creating two lobes with stem attached. Trim off outer rounded edge of each piece to create two 1½\"-thick steaks; reserve trimmed off florets for making cauliflower rice or roasted cauliflower.Step 2Heat 2 Tbsp. oil in a large cast-iron skillet over medium-high. Cook cauliflower, gently lifting up occasionally to let oil run underneath, until deep golden brown, about 5 minutes. Add remaining 1 Tbsp. oil to skillet, turn steaks over, and season with salt and pepper. Cook until second side is golden brown, about 3 minutes, then transfer skillet to oven. Roast just until stems are tender when pierced with a cake tester or toothpick, 8–12 minutes. Let cool slightly.Step 3If using relish, swipe some yogurt over each plate and place a steak on top. Spoon one-quarter of relish over each. Season with more salt and pepper.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Cauliflower Steaks?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleP.S.  The flavor profile is from the coconut-turmeric relish - must use with the roasted cauliflowerAnonymousBloomfield Hills4/29/2020This recipe was a surprise homerun!  Such a wonderful flavor profile.  Easy to make as a main course vegan dinner or would make a great app too.  Loved it.AnonymousBloomfield Hills4/29/2020Explore Bon AppétitCauliflowerVegetableEasySideStarterGluten-FreeVegetarianVeganNut-FreeDairy-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}