{"id": "4c3ff0dc5d41f2a467c340faae5626be", "url": "https://www.bonappetit.com/recipe/cauliflower-tacos-with-cashew-crema", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Cauliflower Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCauliflower Tacos With Cashew CremaBy Andy BaraghaniDecember 26, 20194.8(149)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintEven when roasted at a high temperature, cauliflower takes time to get properly charred and crispy around the edges. Don’t worry if it shrinks a lot—the flavor will be that much more concentrated. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronKüchenprofi 12-Inch Stainless Steel Tweezer Tongs$13 $12 At AmazonLarge Skillet$84 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketSmall Bowl$13 At AmazonIngredients4 servingsSauce1green chile (such as serrano), finely grated1garlic clove, finely grated¼cup cashew or almond butter3Tbsp. fresh lime juiceKosher saltAssembly3garlic cloves, finely grated¼cup grapeseed or vegetable oil2tsp. ground cumin2tsp. smoked paprika2medium heads of cauliflower, cut into 1\"–2\" floretsKosher salt126\"-diameter corn tortillas1small white onion, thinly slicedSliced avocado, sliced radishes, cilantro leaves with tender stems, and lime wedges (for serving)PreparationSauceStep 1Using a fork, mix chile, garlic, cashew butter, lime juice, and 3 Tbsp. water in a small bowl to combine; season with salt. Set aside.AssemblyStep 2Place a rack in lowest position; preheat oven to 450°. Stir garlic, oil, cumin, and paprika in a small bowl to combine. Arrange cauliflower on a rimmed baking sheet and pour spiced oil over. Season with salt and toss to evenly coat cauliflower. Roast, undisturbed, until dark brown and crisp on the bottom, 15–20 minutes. Remove from oven and turn florets over. Continue to roast until second side is dark brown and crisp, 15–20 minutes longer.Step 3Heat a large skillet over medium-high. Working in batches, toast tortillas in a single layer, turning halfway through, until warmed through, about 1 minute total. Transfer to plates.Step 4Spread each tortilla with some reserved sauce; top with cauliflower. Garnish with onion, avocado, radishes, and cilantro. Serve with lime wedges for squeezing over.How would you rate Cauliflower Tacos With Cashew Crema?Leave a ReviewTell us what you thinkReviews (84)Back to TopTriangleMade for the first time tonight. It came out great. I used natural peanut butter (the only nut butter I had) and the sauce made the taco. Had to talk my self out of the third one. My Serranos were large so I only used one, guts and all. It was the perfect heat level. Based on other reviews, I doubled the cauliflower rub. And I only had 1 small cauliflower. Definitely made the traveling team. Looking forward to the leftovers. J Wayne Alexandria, VA1/15/2022We love this recipe! We have it at least once a week. No alterations-we did try wheat tortillas over corn(because the grocery store was out)and definitely prefer the corn-the substance of this recipe rocks! Thank you! AnnStratford, Ontario1/14/2022Made this last night with half cauli and full spices and twas absolutely delicious! The lime is a stand out zing and the serrano is perfect.  Used microgreens and loved it! As a new vegan, I'm so appreciative of simple, delicious yet filling recipes!! AnitaSpringfield, MO1/12/2022Made this last night with homemade corn tortillas. It was amazing. I pickled red onions which gave the tacos a yummy  zestiness. I didn't have a serrano pepper and can see where that would add a little more spice. So will add one next time. Will definitely make this again.MichelleLos Altos, CA11/17/2021Still one of my fave recipes from the covid shut down. Found chick pea and cilantro tortilla shells (by Teasdale) and they add a bit of protein and a lot of complimentary flavors. Like others, I use peanut butter, double the spices. In the oven now with some poblano pepper strips (from the last of the garden) mixed in. Probably the 10th or 12th time we've had it and delicious each time.MonaCentral PA11/9/2021I have made this multiple times and love it, but my sauce is different based on what I had the first time I made it. I use a small can of diced green chilis and raw cashewsKristin HealyRidgefield, CT10/10/2021I learned something new about grating peppers into a sauce! All the flavors and textures come together well though it's carb city.SummerChicago9/8/2021This was amazing! I made the dish tonight using half a cauliflower head.  My husband and I were left wanting more. I didn't half the spices although I used half the cauliflower which leads me to believe and agree with everyone else who says the spice recommendation is not enough.  If it was enough for my recipe then you definitely should at least double the spices if using the whole head. I didn't have cashew crema so I used someone else's recommendation which was to instead, mixed Greek yogurt with turmeric, cumin, some cayenne pepper, garlic and lemon juice the sauce. Follow the rest of the recipe.  Will definitely add this to my rotation.  Yum!AnonymousBrooklyn,  NY4/26/2021These are incredible. New family favourite.AnonymousOntario2/18/2021The roasted cauliflower was amazing. I didn’t have cashew butter. Instead, I mixed Greek yogurt with turmeric, cumin, some cayenne pepper, garlic and lemon juice for my sauce. Turned out amazing Hoa TranPhiladelphia, PA2/4/2021The roasted cauliflower is excellent - I did what others did below and increased the spice 2x, and then in the halfway toss I re-seasoned with salt and cumin and it came out AMAZING!!! \nOn the other hand the combination in the taco wasn't 100% - this very much could be because the cashew butter I used was too strong. The whole thing was also a bit dry, I dolloped some plain yoghurt to counter this but yeah, the taco wasn't excellent, but it was good enough. This could just be my prep though!\n\nTry the cauliflower without making the taco if you're keen, it's super worth it as a snack, dipped in chutney/dips! AnonymousAustralia12/6/2020We made this tonight and absolutely love it. agree with some of the comments below I think you could add a little bit more spice and coating to the cauliflower. Also you definitely need more of the cashew crema sauce. I would make a double batch of that or at least a batch and a half. For us it made at least eight of the small corn tortillas. ... Ran out of the crema sauce. MarieKansas City, Missouri11/22/2020My partner and I LOVE this recipe! It is our go-to recipe to make for guests! Always a hit!!!AnniePortland, ME11/8/2020This recipe is really tasty, but unfortunately, the recipe calls for too little spice. I almost tripled the amount of spices I added to the cauliflower. I recommend for a really flavorful, fulfilling meal, make the cauliflower very flavorful so it becomes to center of the dish.Emmy BBoston, MA11/6/2020Made this tonight for family Taco Tuesday - we all loved it! Including my sometimes picky 11yr old daughter. Including me who typically prefers an el pastor or a de cabeza taco. Though we were a little reluctant about the cashew crema, it was great with the spiced cauliflower. I had to sub sunflower butter for the cashew. I also quick pickled the onions & radishes which gave it a nice extra zest. The avocado & cilantro are a must too. fitzrobAustin, TX8/5/2020Explore Bon AppétitTacoCauliflowerVegetableEasyWeeknight MealsMainVeganVegetarianDairy-FreeGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Andy Baraghani"]}