{"id": "4c4246679132efd00782b3528808d268", "url": "https://www.bonappetit.com/recipe/grilled-shrimp-with-turmeric-mojo-sauce", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Shrimp with Turmeric Mojo Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Shrimp with Turmeric Mojo SauceBy Andy BaraghaniMay 21, 20195.0(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintShrimp, unlike chicken or steak, can take on the flavors of a bright, acidic marinade in minutes, making it a good choice for last-minute grilling. You actually don’t want to let shrimp sit in the marinade for too long because the acid in the citrus will start to firm up and cook the flesh.Ingredients4 servings6garlic cloves, smashed2habanero chiles, seeds removed, chopped13\" piece ginger, peeled, thinly sliced⅓cup fresh lime juice⅓cup fresh orange juice1Tbsp. sugar2tsp. unseasoned rice vinegar½tsp. ground turmeric⅓cup vegetable oil, plus more for grillKosher salt1½lb. large shrimp, peeled, deveinedCooked short-grain white rice (for serving; optional)Flaky sea saltPreparationStep 1Prepare a grill for medium-high heat. Pulse garlic, chiles, ginger, lime juice, orange juice, sugar, vinegar, and turmeric in a food processor until combined and almost smooth. With the motor running, gradually stream in ⅓ cup oil and process until emulsified.Step 2Pour half of the sauce into a small bowl; season with kosher salt. Set aside for serving. Transfer remaining sauce to a medium bowl and add shrimp. Season with kosher salt and toss to coat.Step 3Clean and oil grate, then immediately arrange shrimp on grill. Grill until bright pink and lightly charred, about 1 minute per side. Divide shrimp among bowls. Spoon reserved sauce over; sprinkle with sea salt. Serve with rice if desired.How would you rate Grilled Shrimp with Turmeric Mojo Sauce?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleSuper quick and easy with tons of flavor. Will make this often!AnonymousNiwot, CO2/2/2022Quick, easy and delicious! Served ours over couscous, it was garlicky and flavorful!Anonymous7/5/2021Delicious and pretty easy. The sauce is good, but it is thin so definitely serve with rice or something else to help soak it up. Two habaneros had just the right amount of kick for me, but if you’re not a fan of spice I would recommend only using one or using a milder pepper. AnonymousSan Francisco, CA5/30/2021this was great! served with pearl couscous and a cucumber salad, topped with green onion.AnonymousToronto, CA3/24/2021My family really enjoyed this! We cut down to one habanero which was at the top of the spice limit for us (seeded and de-veined). I added a bit more lime, sugar, and about 1/2 teaspoon of fish sauce. Also some chopped cilantro for serving. \n\nFor the reserved sauce, I put it in a sauce pan and added a little bit of heavy cream to thicken and reduce for extra dipping for the table. \n\nButtered jasmine rice, broccolini, and a side salad made this an excellent meal!Alexandra RabeLafayette, CA11/29/2020This is one of my favorite BA recipes!!! Sweet, spicy, tangy, garlicky! Serve with jerk chicken and coconut rice for a showstopper meal Luna Miami, Florida 10/28/2020This was awesome. Instead of habaneros, I used a poblano that I roasted on an open flame first to blister off the skin.  Easy and delicious. We served it over fresh greens From our CSA that we dressed with the sauce.AnonymousSeattle, WA6/24/2020I'm a good cook, and my boyfriend said that this is his favorite dish that I've ever cooked. I made no changes to the recipe, served over rice and it was lick-the-plate good.AnonymousDetroit, MI8/22/2019SUPER delicious sauce! Must serve with rice to soak up every bit of it. Has been saved into our recipe book. Yum!soundsofsilencesNew Jersey7/17/2019Super easy to pull together and very tasty.  To be on the safe side, I removed all seeds and ribs from the habaneros, and it wasn't very spicy at all, so you may want to keep some of those in if you prefer spicier.  Served with basmati rice and grilled asparagus.  The sauce adds flavor and doesn't overpower whatever it's on.  It was so AMAZING on the rice, we started making us wonder what else it would be good on.  Made it again this past weekend and soaked some smoked pulled pork in it, served on grilled Hawaiian rolls - amazing!  A friend asked for the recipe and plans to make it with pulled chicken.  We'll be keeping the recipe handy for future meals!TXHuskerTexas7/16/2019Wonderful flavor! Citrusy with a kick, I followed the recipe to the dot, and love it! But the sauce is a little thin, would love to know if anyone has any ideas how to thicken it up to serve with the shrimps? AnonymousAnaheim, CA 6/28/2019Delicious dish for a summer evening. We paired the shrimp with basmati rice, a nice salad of fresh local greens and vinaigrette and sweet corn. We'll definitely make it again for company!AnonymousMinnesota6/3/2019This is my new favorite shrimp recipe! Excellent, I love the sweetness/tanginess and the spicy flavor. Will definitely be making this again!nick016NYC6/2/2019This recipe is wonderful. It's like a tropical curry sauce, super flavorful and oh so fresh, and it comes together in minutes in the blender. I made it with both shrimp, as recommended here, and chicken for my shrimp averse boyfriend, and served it over sushi rice. It was great with the chicken too, but has to spend more time marinating. It was a huge hit all around. Can't wait to make this again.AnonymousAL5/30/2019Explore Bon AppétitShrimpShellfishSeafoodTurmericHerbs & SpicesGarlicVegetableHabanero ChileChileSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Andy Baraghani"]}