{"id": "4c45924cb531ab690b987fb8e106ad91", "url": "https://www.bonappetit.com/story/ashwagandha-root", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "What Is Ashwagandha Root, the Chill-Out Adaptogen in Everyone's Supplement Stash? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Ashwagandha Root, the Chill-Out Adaptogen in Everyone's Supplement Stash?It feels like we're all taking ashwagandha, but what does this gnarled root actually do?By Aliza AbarbanelJuly 25, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailIt’s our job to track wellness trends, hunting for the truth about activated charcoal or the healing potential of under-the-radar cannabis terpenes. But sometimes interest is so obvious, it would be impossible not to notice it. This is the case with adaptogenic herbs, and most notably with ashwagandha.Ashwagandha root is undeniably the most prolific adaptogen, thought to strengthen the body’s ability to cope with stress. Who wouldn’t want that? Unsurprisingly, our shelves overfloweth with ashwagandha products. Still, all-time interest doesn’t always translate into knowledge. What exactly does ashwagandha do, and how do we ensure we’re taking it right? Read on and chill out.What are adaptogens?Adaptogens are often called “ancient herbs,” but the idea of an \"adaptogen\" is fairly modern. Adaptogenic plants like ashwagandha and rodhiola have been used for hundreds of years around the world, but the term itself was coined by Soviet toxicologist N. V. Lazarev in 1947. He aimed to describe substances with “non-specific” resistance to adverse influences like stress—in other words, plants that keep us calm. For more information on adaptogens, check out our primer here.Okay, what is ashwagandha?Ashwagandha is an adaptogen that’s a member of the nightshade family, and thus a distant cousin to tomatoes and eggplants. It also goes by Withania somnifera, Indian ginseng, and winter cherry. Herbal medicine commonly uses gnarled ashwagandha root, which is turned into powders, tinctures, and even added to moon milk for an added dose of doze.Ashwagandha root from Furnace Creek Farms.\nPhoto by Alex LauWhat does it do?Ashwagandha has been used in medical practices like Aryuveda,\na medical system that originated in India over 3,000 years ago, to fight stress, boost endurance, and promote a general sense of calm. While science is limited, modern studies reinforce ashwagandha’s potential to reduce stress and anxiety in adults. The ability to adapt to the stress of daily life has undeniable appeal, but that doesn’t mean we all should be dosing up on ashwagandha before wrestling with the subway in rush hour.“I’m careful to make sure this is the right plant for the person,” says holistic health practitioner Rachelle Robinett of Supernatural Cafe at WOOM Center.“It’s one of the more calming adaptogens, which can be great if we’re overstressed and over-producing cortisol and adrenaline, but for people who have low energy it might be counterproductive and that’s often under-communicated.”How should I take it?If you do decide to try ashwagandha, start out by looking for a good product. Tinctures and capsules make it easy to ensure you take the right dose regularly, but Robinett recommends using powdered ashwagandha root if you can. “I like to stay as close to the whole form as possible,” she says. “When taking pills we start to lose the relationship with the plant—we don’t know what it tastes like, we don’t know what color it is, or what it smells like.” Ashwagandha products can be found online, at herbal medicine stores, and even at some farmers' markets. (For New Yorkers, Robinett recommends buying from herbalist Grace Galanti of Furnace Creek Farms at various greenmarkets.)Robinett recommends taking half a teaspoon of powdered ashwagandha root daily, but it’s important to check any product’s packaging as concentrations can vary. Like multivitamins or CBD, it’s important to take measured doses of ashwagandha regularly for long periods of time. “When you take it in a tea here and there, it’s not doing the things you think it’s doing. That’s more for fun,” says Dr. Amy Shah, MD. “I think that if you really want to have noticeable benefit you would take it every day for about three months.”Over time, you should expect to feel changes like an increase in calm, extra energy, or bolstered endurance. Effects can vary, and increase over time. “[Ashwagandha] isn't meant to be used as a spot treatment, it’s meant to be used consistently and regularly,” says Robinett. “Give it a long runway. People don’t notice change until something drastic happens in their life or day they realize they responded it a more tranquil manner than they might have otherwise.”When should I stop?Ashwagandha is one example of an herb that can be taken for long periods of time, but that doesn’t mean you should plan to lace your morning oat milk latte with ashwagandha for the rest of your life. Robinett recommends taking a break from ashwagandha once you’ve been taking the herb for about a year, to check in with your body and assess your needs. “The goal with plant-based medicine is to repair our system and get back to a place where we’re balanced on our own,” she says. “It’s not to be dependent on 15 herbs every single day in order to function.” To learn more about ashwagandha, adaptogens, and other healing herbs, make an appointment with an herbalist near you.Cook with ashwagandha:Steamed Fish in Clay PotAngela Dimayuga of Mission Chinese Food likes using whole dried ashwagandha root in this clay pot dinner.View RecipeExplore Bon AppétitHealthyishTrendsRead MoreLifestyleWhat Are Adaptogens, and Why Is Everyone Talking About Them?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Aliza Abarbanel"]}