{"id": "4c47300735b36d7fe45dfba9e3e67f24", "url": "https://www.bonappetit.com/story/what-is-soba", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "What Are Soba Noodles And How to Buy And Cook Them  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Cook Perfectly Slurpable Soba NoodlesGoodbyeeeee gumminess. By Jesse SparksOctober 30, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailSo you want to buy soba, those slippery, slurpable noodles you’ve been dreaming of eating in soups for days. You’ve hyped yourself up: You’re wearing your good sweatpants, the ones with the good elastic. You’ve got Lizzo bumping in your ears, reminding you that can do anything. You didn’t even have to take a DNA test to know that you are 100 percent that cook.* (*You know the lyric.)You head to the grocery store, saunter over to the noodle aisle, and then you realize you’re not exactly sure where to start. Don’t worry. We’ve got you.First, know the basics. What are soba noodles? Soba is a Japanese noodle made from buckwheat flour and water, and sometimes a bit of whole-wheat flour to keep the noodles from deteriorating. Making soba by hand is an intensely complicated process that artisans spend years studying. But while the absolute best soba is made in small batches and sold fresh, soba for your weeknight life is readily available at the grocery store.Then, know what to look for. Generally speaking, buckwheat flour should always be one of the first ingredients on the label, and the list should be relatively short. You’re looking for a high ratio of buckwheat flour to whole-wheat flour: Ideally, the noodles will contain around 70–80 percent buckwheat (this is the nihachi-style). Anything containing a higher percentage of buckwheat is prone to falling apart during the cooking process. But too little buckwheat means your noodles will be prone to gumminess and bloating (and they won’t be as nutty-tasting).This ratio of buckwheat to whole-wheat flour can vary widely depending on the brand and variety. But a good rule of thumb is that the larger the percentage of buckwheat in the soba, the darker gray-brown the color will be.Soba noodles play nicely with creamy sauces and crispy leaves.\nPhoto by Chelsie Craig, Food Styling by Michelle GattonWhile our Test Kitchen editors aren’t particularly picky when buying dried soba, we tend to reach for Hakubaku Organic Soba for a consistent, reliable option without extra stabilizers.Now, cook it carefully. Cook small batches of noodles in lightly salted boiling water right before you’re ready to eat. Soba thrives with space, so make sure to leave ample room for the cooking noodles to swirl around the pot freely so that they don’t tangle into a sticky mess.The thinner the soba, the faster it will cook. Most soba cooks between 3–5 minutes, never longer, but always follow the cooking instructions on the package of your soba. The best way to prevent things from glomming up is to be hyper-vigilant while cooking. Once you’ve thrown your noodles into the pot of boiling water, stay stove-side. This isn’t the time to go grab your phone from another room or daydream about how great you and Jharrel Jerome would look together—even if it is objectively true and the two of you would spend wonderful Saturday afternoons in sweats. Once a few minutes have passed, pull them out and immediately serve your noodles.If things do get gummy, drain the noodles, rinse them under cold water, and plunge them into an ice bath. This will stop the cooking process while washing away some of the starch.Now you’re ready to sip and slurp your way to soba-induced bliss. Whether you’re twirling these noodles into a delightfully chilled noodle salad or topping it with crispy cubes of tofu, go forth with pride, you soba star you.Get the recipe:Soba Soup With Shrimp and GreensDashi is the fastest route to a savory, slurp-able broth—and there are no loooong simmers or bags of chicken bones necessary.View RecipeExplore Bon AppétitSobaJapaneseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-30", "author": ["Condé Nast", "Jesse Sparks"]}