{"id": "4c49f1589ddb6f05a62d86cca8b56880", "url": "https://www.bonappetit.com/story/chai-oatmeal", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "This Chai Oatmeal Tastes Like a Mug of Your Favorite Fragrant, Creamy Tea | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Oatmeal Tastes Like Creamy, Fragrant ChaiWhen your bowl of breakfast and your mug of tea join forces.By Mehreen KarimDecember 8, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of preparing the dishes and drinks we can make with our eyes closed.I should have realized I was destined for a career in food when I found the most interesting part of my fancy-pants D.C. internship to be concocting different flavors of oatmeal in the office kitchen. Each morning, instead of getting ahead of my li’l intern duties, I’d hastily put my belongings down and peep into the kitchen fatefully adjacent to my desk. I marveled at the selection of free things: complimentary tea bags in every flavor Twinings and Lipton had to offer; cartons of milk (including nondairy—score!); and, as mentioned, packets of instant oatmeal.“How can I use ALL the things?” I asked myself, fanning the flames of the frugal fire that’s been slow-burning within me for as long as I can remember. I emptied the powdery contents of a blueberry oatmeal packet into one of the communal Ikea bowls and topped it with glugs of almond milk. The wide assortment of tea bags called out to me. And this might be where your average officegoer, you know, makes a cup of tea. But even though I’m not an avid tea drinker, I’m also not one to pass up a free thing. So I plopped a sachet of Earl Grey into the bowl of wet oats and hoped for the best as it went for a spin in the microwave.The outcome tasted glorious: It was fragrant, novel (to my 19-year-old self, at least), and easy. Seven years later, I’ve perfected the method. I often make this version inspired by doodh patti chai, a traditional South Asian–style chai method in which the tea, spices, and milk boil together in a pot before getting strained into cups. Using this chai method as the foundation for my morning oatmeal seemed like a no-brainer, and the results were just as delicious as I’d expected.Here’s how to make it: Start by infusing the milk. Into a saucepan, measure out however much milk or dairy-free milk is needed for the amount of oats you’re making (for a single serving, for example, you’ll want 1 cup milk), then add an additional ¼ cup. Add black tea bags—one for each serving of oats—and some whole chai spices, like crushed cardamom pods, a cinnamon stick, and star anise. (If you’re hoping to make chai or chai-spiced dishes more often, you can also grab Spicewalla’s chai masala—1 tsp. of that will do!) Add 1 Tbsp. brown sugar to the pot and bring to a vigorous boil over medium-high heat, then continue to cook for at least 3 minutes, until the milk is a deep shade of beige. (The longer you cook, the stronger the flavor.) It should look and smell like chai at this point.Give it a taste. If you like your oats on the sweeter side, add more brown sugar by the teaspoonful. If you’d like an even stronger aroma of chai, add more chai spices or leave the tea bags in the pot while you cook your oats. Otherwise, remove the tea bags, then add the old-fashioned rolled oats and cook them according to the directions on the container. After the oats are done cooking, fish out the tea bags, if you left them in, and the whole spices. Top oatmeal with almonds, fresh sliced fruit, and a sprinkle of cinnamon.As delicious as this two-in-one chai oatmeal is, my original Earl Grey version will always have a special place in my heart. So if you have other flavors of black tea lying around, I highly recommend conducting oatmeal experiments with those too. If you find yourself obsessing over oatmeal in the office kitchenette to avoid doing your real work, however, maybe it’s a sign to change careers…And with the rest of your Earl Grey:Earl Grey Yogurt CakeA tea cake that's true to its name, this loaf harnesses the power of citrusy Earl Grey tea for its distinct flavor. Lemon poppyseed can't hold a candle. View RecipeExplore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-08", "author": ["Condé Nast", "Mehreen Karim"]}