{"id": "4c55c4fa7e7f00b3d0fdd05ff2819f2d", "url": "https://www.bonappetit.com/story/the-best-time-to-eat-olive-oil", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "We're Eating Olive Oil on EVERYTHING Right Now. Here's Why. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNow Is the Best Time to Eat Olive Oil on EVERYTHINGYes, olive oil has a season, and the freshest, most flavorful stuff is on shelves now.By Alison CarrollJanuary 29, 2019FacebookTwitterEmailPhoto by Jay CarrollFacebookTwitterEmailLong before it was a supermarket commodity, olive oil illuminated ancient civilizations, anointed pharaohs and kings, bathed triumphant Olympians, and of course, made food taste good. It’s a real workhorse, one of the few ingredients you’ll find in almost every kitchen, but not many people realize that it's essentially a fruit juice, meaning that, unlike its hardy counterpart, vinegar, it has a shelf life—best used within 18 months of its harvest date.Peak olive oil makes marinated cheese even more amazing.\nAlex LauThis past fall was my fifth harvest of Wonder Valley olive oil. In October, the firm, green olives begins to flush with a light mauve hue. Over the next month or so, they'll continue to ripen through a spectrum of reddish purple, then, if left on the tree long enough, to a final shiny black. At Wonder Valley, we barely let the fruit blush before we plucked them off the trees the first week of November because we favor a bracingly green, herbaceous, polyphenol-packed olive oil. The oil is left to settle for a few days, any sediment is filtered out, then it’s bottled and ready to go.These first few weeks of the year is olive oil magic time. The new harvest oils are released into the world—buy direct from the producer if you can or be mindful of harvest rather than the expiration dates listed on the bottle. Taste alongside different varietals or regions, taste it against that old, oily bottle that’s been lingering in the back of the pantry. You don’t need professional training to taste the nuances of olive oil, the peppery intensity that comes from picking under-ripe fruit or the buttery soft flavors of letting them mature fully.Alison Carroll working on the Wonder Valley harvest.\nPhoto by Jay CarrollI have a bottomless supply of fresh extra virgin olive oil on hand, the most decadent job perk, and I'm constantly getting high on my own supply. While it’s at peak season, I use it in the most humble and simple ways: streamed into bowls of fresh beans and grains and pasta with nothing more than fresh herbs or grated cheese and cracked pepper, or blitzed into sauces like pesto or caper-heavy salsa verdes, or drizzled over sweet seasonal fruits and soft cheese like figs and Roquefort, and forever brightening a bowl of leafy greens.  At my home here in Joshua Tree, we are able to cook outdoors over fire year-round. Sturdier vegetables like eggplant or squash get cooked in the embers, and we fold the caramelized flesh with chiles, olive oil, and tahini while a grill of peppers and carrots need nothing more than a glug of it and salt to shine. I even book-end each day with a small shot of olive oil for maximum polyphenols (free-radical fighting antioxidants), omega 3s, and digestive support, and I’ll take a shot before I start a night of drinking to prevent a hangover (it works!).So, yes, you can use olive oil year-round, but now is the time to go all in. Get the best, freshest batch you can find, and follow my lead.Got your hands on the good stuff? Cook with it.Explore Bon AppétitHealthyishOlive OilessayRead MorecultureThe Joshua Tree Party House Where Olive Oil Is the Drink of ChoiceBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-29", "author": ["Condé Nast", "Alison Carroll"]}