{"id": "4c5843fabd24daf9f52d996f1216ee92", "url": "https://www.bonappetit.com/recipe/whiskey-sweet-potato-pie", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Whiskey Sweet Potato Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWhiskey Sweet Potato PieOctober 1, 20203.8(10)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIn the Guy family household, sweet potato pie is like the halftime show—anticipated sometimes even more than the game day turkey. This year, I’m switching things up a bit with this Whiskey Sweet Potato Pie. What's different? The custard is enriched with coconut cream, extra ginger and cinnamon, a generous pour of smokey whiskey, and, of course, lots of slow-roasted sweet potatoes. Let's not forget the amazingly flaky spelt flour crust and the marshmallow-like whipped meringue that gets carefully swooped on top right before serving. I balance out all this delicious decadence by using Swerve to sweeten the filling and meringue; it's my go-to alternative sweetener when I want to put a healthier spin on a recipe without having to compromise on flavor. It all comes together to create a multi-layered masterpiece! Once it’s out sparkling on the table, you may just start calling it The Pie, the one that steals the show.IngredientsCrust1¾ cups (250 grams) spelt flour1Tbsp. Swerve Confectioners¼tsp. baking powder½tsp. kosher salt¾cup (1 ½ sticks) very cold butter, cut into cubes3-6Tbsp. ice-cold water, plus more if neededFilling⅓cup (70 grams) packed Brown Swerve1cup canned coconut cream, stirred before measured2cups (500 grams) sweet potato puree¼cup (2 ounces) whiskey2tsp. vanilla extract1½ tsp. ground ginger1tsp. ground cinnamon¼tsp. allspice½tsp. kosher salt3large eggsMeringue2large egg whites, at room temperature1tsp. vanilla extract¼tsp. kosher salt4tbsp (70 grams) Swerve ConfectionersPreparationMake the crust: Add the flour, Swerve Confectioners, baking powder, and salt to the bowl of a food processor and blend on high for a few seconds until thoroughly combined. Break the pieces of butter apart with your fingers and add them to the bowl, then pulse the mixture until the butter is the size of peas or a little smaller. Through the feed tube, drizzle in 3 Tbsp. of the water, continuing to pulse until the mixture just begins to clump together. Continue, very slowly, drizzling in more water, about 1-2 tsp. at a time, until the dough is hydrated enough that it stays together when you compress between your fingers. Dump the mixture into the center of a large sheet of plastic wrap, and using the plastic wrap as a tool, mold and compress the dough into a smooth, compact, flat disc, about ½-inch thick and 6 inches wide. Chill for 1-2 hours or overnight.Have a 9-inch deep-dish pie pan (6-cup capacity) nearby.Remove the dough from the fridge (If it’s too hard, allow it to rest on the counter for about 20 minutes to come to room temperature), unwrap it, and roll it out between 2 large sheets of parchment paper into a 14-inch round. Remove the top layer of parchment, and pinch any cracks along the edges of the dough together. Lift the bottom piece of parchment with the crust, and invert it onto the pie dish making sure to position it evenly over top, gently lowering it into the bottom edges of the pan. Peel back the parchment and gently adjust the crust. Pinch any remaining cracks together, tuck the overhanging dough underneath itself to create a thick edge, and crimp the edges using your thumbs and index finger. Transfer the entire pan to the freezer for at least 20 minutes to harden.Heat the oven to 425 degrees and position the oven rack in the middle of the oven.Remove the crust from the freezer and place it on a baking sheet. Take one of the sheets of parchment used for rolling the dough and lay it over the pie. Cover it with pie weights or uncooked beans, spreading the weights out evenly and into the corners. Bake for 25-30 minutes then remove the parchment with weights and bake for another 10-12 minutes, or until the pie is dry and slightly crispy on the bottom. Remove the crust from the oven and allow it to cool to room temperature.Make the filling:Heat the oven to 325 degrees and place the pie crust on a baking sheet and set it aside.Add the Brown Swerve and coconut cream to the cleaned bowl of a food processor, and blend until smooth, then add the sweet potato, whiskey, vanilla, ginger, cinnamon, allspice, and salt, and blend until smooth. Then add the eggs, and blend just until completely incorporated. Pour the filling into the cooled crust and bake for 45-55 minutes or until the pie is brown, set on top and around the edges, but the center still jiggles just slightly when the tray is shaken. Remove from the oven and set aside.Make the meringue topping: Into the bottom of a stand mixer fitted with a whisk attachment add the egg whites and vanilla, and beat on high speed until foamy, about 1 minute. Lower the speed to medium-low and gradually sprinkle in the Swerve Confectioners, stopping to scrape down any Swerve sticking to the sides of the bowl as needed. Once the Swerve is completely incorporated, increase the speed to high and beat the egg whites until stiff peaks form about another 3 minutes. Dollop the meringue over the face of the pie creating peaks and swoops of meringue with the back of your spatula.Preheat the oven to broil, and position an oven rack about 9-10 inches from the top coil. Place the pie back onto a sheet tray and into the oven while the oven is heating. As it starts to broil, watch the pie closely and remove it once the meringue is completely toasted and set across the surface, and the tips of the top peaks have turned dark brown, about 4 minutes. Remove from the oven, and allow to come to room temperature completely, preferably overnight, before slicing and serving.Recipe by Jerrelle Guy of chocolateforbasilWant more? Check out these other holiday recipes showcasing Swerve:Spiced Pear and Bourbon Sparkler Sesame Oat Apple CrispHow would you rate Whiskey Sweet Potato Pie?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-01", "author": ["Condé Nast"]}