{"id": "4c592d7301261ffb8aa277d49a223cf2", "url": "https://www.bonappetit.com/recipe/hot-pink-pearl-onion-pickles", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Hot-Pink Pearl Onion Pickles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueHot-Pink Pearl Onion PicklesBy Andy BaraghaniJanuary 9, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThese sweet and very tangy neon pickles pair best with grilled meats, stews, and braises.Ingredients4 servings 1½cups white wine vinegar1tablespoon sugar2teaspoons coriander seeds2teaspoons dried tarragon2teaspoons kosher salt1teaspoon dried mint8ounces pearl onions, peeled, halved½small beet, peeled, halvedPreparationStep 1Bring vinegar, sugar, coriander seeds, tarragon, salt, and mint to a boil in a small saucepan, stirring to dissolve sugar and salt. Reduce heat to a simmer and add onions and beet. Cook, stirring occasionally, until onions soften slightly, about 3 minutes. Pluck out and discard beet (the onions will continue to take on color as they sit). Transfer onions and brine to a 1-qt. jar or a nonreactive container and let cool. Cover and chill at least 2 hours before serving. The flavor will mellow as it sits.Step 2Do Ahead: Onions can be pickled 3 weeks ahead. Keep chilled.How would you rate Hot-Pink Pearl Onion Pickles?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentPickleMiddle EasternPearl OnionOnionVegetableBeetTarragonHerbs & SpicesEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}