{"id": "4c5b71b2ff69373a92026b7f3be9e7ea", "url": "https://www.bonappetit.com/story/never-fail-creamy-miso-dressing", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "This Miso Dressing Will Liven Up Anything in Your Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Creamy Miso Dressing Will Have You Licking Your Bowl in Front of All Your CoworkersWith very little shame.By Emily SchultzMarch 16, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the miso dressing recipe that associate social media manager Emily Schultz just couldn't live without.A couple of months ago my coworker, Alex Beggs, was ranting and raving in a meeting about “her sauces,\" the ones she makes all the time and keeps in her fridge to doctor up anything from steaks to grain bowls to salads. The thought of keeping a collection of sauces was as intriguing to me as the 4 lb. bag of grandma mints she keeps on her desk—which is to say, VERY INTRIGUING. After that, I made sure that I paid close attention whenever I cooked a recipe that included a sauce to see if it was worthy of becoming one of \"my sauces.\" And then I found my first: creamy miso dressing.I happened on this sauce during the Feel Good Food Plan, which is Healthyish’s two week plan of perfectly crafted dinners as well as lunch and breakfast inspiration. Everything about this recipe is genius, from the roasted tofu technique to the combination of raw and roasted Brussels sprouts. But I'm here to wax poetic about that creamy, salty, irresistible miso sauce. And wax I shall.First off, I’d like to dispel any fear you might have about miso. Real talk: This is the recipe that actually got me to purchase a container of miso. I used to be worried that it was going to be something that I bought once, used once, and then hung out in the back of my fridge with the other misfit toys (like that marionberry fruit spread my roommate brought back from Portland 2 years ago). However, once I bought this miso paste, it opened a whole new world of umami opportunities, because we have more miso recipes than The Shape of Water has Oscar’s. Buy the miso already.This creamy miso dressing would absolutely not suck on this easy roast chicken.\nTime to get to the freakin' sauce already. All you need to get going is a blender, some sesame seeds, lemon juice, water, miso, and hemp seeds. (Quick note: I added about 2 tbsp of tahini instead of hemp seeds because when I went to Whole Foods it was really crowded and I got overwhelmed and forgot the hemp seeds. It turned out super smooth and perfect anyways—yay!) Blend, blend, blend until smooth, and then season with salt. Spoon on the bottom of your bowl, add your tofu and your roast-y cruciferous friends, then drizzle a little more on top because why not. See? Now it's your sauce too.The tanginess, big umami flavor, and creamy goodness of this sauce makes it incredibly versatile, which is why making a big old batch of it and parking it in a king size mason jar right in the door of your fridge is a pro move. It a perfect base for any sort of roasted vegetable situation, but you can also thin it down with a little bit of water to make a killer salad dressing, or even spoon some over some crispy chicken thighs for a little extra pep. This sauce is just the beginning of my sauce collection, and also the start of my transformation into Alex Beggs. Who knows, maybe I’ll even have to order my own 4 lb. bag of mints too.Time to get saucy:Roasted Broccoli and Tofu with Creamy Miso DressingToasted sesame seeds can often be found in the Asian sections of some supermarkets, sometimes labeled Gomasio. If ever there was a time of year to keep a big jar of them on hand, pre-toasted and ready to go, this is it. They are the perfect crunchy topper for everything from salads to soups and roasted vegetables.View RecipeExplore Bon AppétitBasicallyNever FailMisoSauceSalad DressingRead MoreRoasted Broccoli and Tofu with Creamy Miso DressingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-16", "author": ["Condé Nast", "Emily Schultz"]}