{"id": "4c68570c5aa9c818534a0880e792a596", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/vijs", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Vij’s Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverVij’sGame-changing Indian cuisine and hospitality in Cambie since 1994FacebookPinterestTwitterEmailGrant HarderGO HERE: for chef Vikram Vij’s genre-bending Indian food, so popular that even the waiting line is famous. (Not even Martha Stewart could skip it.) Those willing to wait, however, are rewarded with complimentary passed hors d’oeuvres and cups of hot chai while in line and one of the most iconic dining experiences once inside.ORDER THE: ever-popular lamb popsicles; jackfruit in black cardamom and cumin curry; a heaping platter of perfectly charred naan; and whatever else your server recommends based on your tastes. To start, go with a cocktail (bartender Jay Jones's Dark Army No.2 with LemonHart demerara rum, mango, and garam masala is an agreeable choice), then move on to wine—the staff is always ready with a suggestion for pairings with your meal.THE VIBE IS: convivial, with many groups sharing family-style meals. The newer open-concept dining room lacks the intimacy of their former space, so ask for a table near a window or, even better, on their rooftop patio during the summer.PRACTICAL STUFF: Open every day, from 5:30 p.m. and onward until they decide to close. No reservations.—Lindsay AndersonGrant HarderWE ALSO LOVEKishimotoThe Drive’s no-frills standby for impeccable sushiDon’t Argue! Very good pizza and people-watching at this casual Mount Pleasant jointDock LunchMount Pleasant’s best-kept secret for lunch and a little readingExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}