{"id": "4c8d1000ffcbba5939246d88f5fdb650", "url": "https://www.bonappetit.com/recipe/hazelnut-granola-and-chia-pudding-bowls", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Hazelnut Granola Pudding Bowls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueHazelnut Granola and Chia Pudding BowlsJanuary 8, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis honey-sweetened granola and rooibos-tea chia pudding are both worth making and enjoying on their own, but together with yogurt and a swirl of jam they become a breakfast you’ll want to eat on repeat.IngredientsMakes 4Granola and Chia Pudding3cups old-fashioned oats½cup coarsely chopped skin-on hazelnuts or pecans½cup skin-on almonds½cup unsweetened coconut flakes¼cup raw pumpkin seeds (pepitas)¼cup raw sunflower seeds1Tbsp. ground cinnamon½tsp. kosher salt½cup honey¼cup virgin coconut oil1tsp. vanilla extract½tsp. flaky sea salt3cups brewed rooibos tea, cooled¾cup chia seedsAssembly4cups plain Greek yogurt2tsp. honey½tsp. vanilla extract4Tbsp. apricot jamChia seeds (for serving; optional)PreparationGranola and Chia PuddingStep 1Preheat oven to 300°. Toss oats, hazelnuts, almonds, coconut flakes, pumpkin seeds, sunflower seeds, cinnamon, and kosher salt in a large bowl.Step 2Heat honey, oil, and vanilla in a small saucepan over medium-low, whisking until melted and combined, about 2 minutes. Pour over oat mixture and mix thoroughly to coat. Spread out on a rimmed parchment-lined baking sheet and sprinkle with sea salt.Step 3Bake granola 10 minutes. Remove from oven and stir. Return to oven and bake until golden brown and crisp, 8–10 minutes. Remove from oven and stir again. Let cool on baking sheet.Step 4Combine tea and chia seeds in a 1-qt. jar or airtight container. Cover and shake to combine. Let sit 5 minutes, then shake again. Let sit at least another 15 minutes before serving. (You’ll have enough granola and chia pudding for about 16 servings. Keep on hand for making more bowls or other uses (try a scoop of chia pudding in a smoothie!).Step 5Do Ahead: Granola and chia pudding can be made 10 days ahead. Store granola airtight at room temperature and chill chia pudding.AssemblyStep 6Mix together yogurt, honey, and vanilla in a small bowl, then divide among 4 shallow bowls. Top each with ¼ cup granola, ¼ cup chia pudding, and 1 Tbsp. jam. Sprinkle with more chia seeds if desired.How would you rate Hazelnut Granola and Chia Pudding Bowls?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleAbsolutely loved this!!!!AnonymousNew York6/1/2020any ideas what to use instead of rooibos-tea? orange-juice? thanks for inspirations!natterbrandHamburg2/8/2019Explore Bon AppétitGranolaPuddingDessertHealthyishOatRice & GrainsHazelnutNutPecanAlmondCoconutFruitPumpkin SeedSeedSunflower SeedCinnamonHerbs & Spiceshoneycoconut oilVanilla ExtractTeaChiaGreek YogurtJamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast"]}