{"id": "4c8fe684a7c06dbb6be4a897246348d3", "url": "https://www.bonappetit.com/story/the-only-fry-batter-youll-ever-need", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "This Fry Batter Is the Only Fry Batter You'll Ever Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Fry Batter You’ll Ever NeedThis gets-crispy-stays-crispy batter is magic.By Bettina MakalintalNovember 30, 2021FacebookTwitterEmailPhotographs by Emma FishmanFacebookTwitterEmailLet’s get one thing out of the way: I have yet to yield to the air-fryer hype; I believe in deep-frying. So for a recent cocktail party snacks potluck, I decided, why not make the crispy, stuffed fried olives developed by associate food editor Zaynab Issa? The key to my heart is crunchy, golden, and glistening from a dip in hot oil, and these olives seemed a perfect fit.The recipe, as I read it, hit a few crucial notes. It tapped into my later-in-life olive obsession; it had a clear cocktail party vibe; and it was vegan, for my vegan friends. But as I got ready to cook, I realized the fatal flaw in my plan: I’d be transporting fried food in a covered container for at least half an hour, and once I arrived, who knew when we’d actually start eating. As anyone who has ever ordered fries for delivery only to get limp potatoes with not a hint of snap knows, fried things don’t travel or keep well.And yet! My crispy fried olives were a hit. Not only that, but I took a few home, along with excess cheese from the charcuterie board (zero waste!), and the next day, after a whole night in the fridge, my olives were cold but still crispy, with no sad fried leftovers to be seen. This batter, I decided, was magic.It’s inspired, Zaynab told me, by Korean fried chicken, which is known for its shattering crunch. A combination of all-purpose flour, cornstarch, and baking powder yields a batter that’s thick enough to coat whatever you dip it in but that fries into a light crisp. After a dunk in the batter, Zaynab’s recipe calls for a toss in salted panko, which you first crush slightly with your fingers for more textural variation. Since you don’t have to worry about keeping one hand wet and one hand dry as you do during a flour-egg-breadcrumb dredge (and, really, who remembers?), your hands stay comparatively un-grubby. Those craggy crumbles stick to the batter like a dream, forming a consistent coating that stays put in the hot oil so you don’t have to be fussy while flipping.I have since used this batter and panko combination with cubed tofu, meaty hunks of mushroom, and cauliflower florets so good and crispy they’ve put to shame every soggy “cauliflower wing” I’ve ever ordered. With this breading the world is my oyster—I’ll go ahead and fry it.High Time for Fry TimeCrispy Olives With Calabrian Chile SauceTake olives from snack to PARTY snack by coating them in panko and deep-frying them until golden brown and shatteringly crisp.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-30", "author": ["Condé Nast", "Bettina Makalintal"]}