{"id": "4c8f299c9ebff0a4a436d182ac4e480b", "url": "https://www.bonappetit.com/story/virtual-mental-health-resources", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "7 Virtual Mental Health Resources Supporting Black People Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle7 Virtual Mental Health Resources Supporting Black People Right NowWe may be socially distant in this traumatic time, but we're not alone. By Jesse SparksMay 30, 2020FacebookTwitterEmailIllustration by Kenesha SneedFacebookTwitterEmailFor the last few weeks, I’ve been going through it. First there was the constant stream of news about the disproportionate impacts of COVID-19 on Black communities, then came the deaths of George Floyd, Breonna Taylor, and Tony McDade at the hands of police and the wrongful death of Ahmaud Arbery. Meanwhile I’m navigating this pandemic along with everyone else, and trying to figure out how to make a positive impact along the way. It’s been dizzying. And I know I’m not alone.According to Naj Austin, founder of the social community for people of color Ethel’s Club, all of those complex feelings and mixed emotions are normal in times of crisis and collective trauma. Ethel’s Club, which previously offered free mental health counseling for members in its Brooklyn location, has now transitioned to a digital model. “The great thing about a healing space like Ethel’s Club is that it takes our identity, and everything that comes with that, into account. You can’t talk about these complex feelings without talking about Blackness.” The club’s online community is hosting free, hour-long grieving sessions twice monthly.For many Black people practicing social distancing, the need for virtual resources has never been more clear. So, I’ve compiled a list of six more mental health resources, in addition to Ethel’s Club, that are providing virtual support to the Black community right now. However you choose to grieve, process, and/or stand in solidarity, remember that you’re not alone, and that your personhood and wellness still matter.Dive in WellMaryam Ajayi founded Dive in Well, an organization offering digital classes on various wellness practices, to create a more inclusive wellness industry. Dive in Well hosts donation-based digital events like breathwork classes and therapy sessions aimed at centering self care.Sista AfyaThis Chicago-based, community-driven organization provides women from across the Black diaspora with low-cost group therapy sessions, workshops, and free online conversations known as Online Sista Support Groups, which cover topics like managing the stress sparked by consuming news.HealhausFounders Darian Hall and Elisa Shankle created this space in Brooklyn to provide accessible and inclusive wellness to their community. HealHaus is currently closed, but their ethos has continued virtually through live streamed classes, including a healing cypher for men of color.Therapy for Black GirlsDr. Joy Harden Bradford founded this organization to combat the stigma around therapy that might otherwise prevent Black women from seeking care. Now, TBG has become a successful podcast, a directory that aims to connect women with culturally competent therapists, as well as a private community Facebook support group. The organization holds free group support sessions weekly on Thursday nights at 7 p.m. EST.The Nap MinistryPerformance artist and poet Tricia Hersey founded The Nap Ministry to champion Black rest as a form of reparations and resistance against burnout culture and capitalism. While she normally hosts free pop-ups where visitors can take brief naps and workshops in the Atlanta area, Hersey has been using Instagram to provide mini sermons about the importance of slowing down and getting more sleep when you’re a Black person fighting oppression day-in and day-out.Inclusive TherapistsAustin-based therapist Melody Li founded the Inclusive Therapists database to provide therapists with training for racial trauma and connect people of all identities, abilities, and bodies with culturally sensitive care. Li herself, and many other therapists in the Inclusive Therapists network, offer reduced-fee teletherapy options to ensure that financial limitations do not keep people from pursuing care. Decolonizing Therapy and Viva Wellness are two other therapy practices with active online platforms.Explore Bon AppétitHealthyishSelf CareessayRead MoreLifestyleI Run For My Health. Do I Have to Fear For My Life?By Shanika HillocksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-30", "author": ["Condé Nast", "Jesse Sparks"]}