{"id": "4c9bd5b61153005a912a6169847abd79", "url": "https://www.bonappetit.com/recipe/corn-and-chickpea-bowl-with-miso-jalapeno-tahini", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Corn & Chickpea Bowl with Miso-Jalapeño Tahini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCorn & Chickpea Bowl with Miso-Jalapeño TahiniBy Chris MoroccoAugust 20, 20204.8(60)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown, Props by Meilen CeramicsEmailPinterestPrintEmailPinterestPrintA quick sear gives corn kernels caramelized edges and concentrated flavor. Here, they're cooked with crisp chickpeas, then tossed with za'atar and dressed with a mixture of ginger, jalapeños, miso, and tahini. This all-star dinner recipe will work long after corn has gone out of season. In winter, just sub shaved cauliflower or torn kale. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.Ingredients4 servingsTahini1¾-inch piece ginger, peeled, finely grated2small jalapeños, seeded, chopped2small garlic cloves, finely grated1cup (packed) cilantro leaves with tender stems⅓cup fresh lime juice⅓cup tahini1½tablespoons misoKosher saltBowl Assembly3tablespoons olive oil, divided, plus more for drizzling2garlic cloves, lightly crushed114-ounce can chickpeas rinsed, drained3ears of corn, shucked, kernels removed1tablespoon za’atar (another flavorful spice blend like curry powder is great here too)Kosher salt4cups Little Gem or other small lettuce leaves, torn if largeCrumbled feta, lime wedges, and cilantro (for serving)PreparationTahiniStep 1Purée ginger, jalapeños, garlic, cilantro, lime juice, tahini, miso, and 3 Tbsp. water in a blender until smooth. Season with salt.Step 2Do Ahead: Tahini can be made 1 day ahead. Transfer to an airtight container and chill.Bowl AssemblyStep 3Heat 2 Tbsp. oil in a large skillet over medium. Add garlic and cook, turning occasionally, until golden brown, about 4 minutes. Mash garlic with a spoon and stir into oil. Add chickpeas and increase heat to medium-high. Cook, undisturbed, until golden brown and beginning to crisp underneath, about 3 minutes. Toss and continue to cook, tossing occasionally, until golden brown all over, 2–3 minutes more. Add corn along with 1 Tbsp. oil and cook, tossing, until corn kernels are golden around the edges and tender, 5–7 minutes. Sprinkle za’atar over and toss to coat. Season with salt.Step 4Lightly drizzle lettuce with oil in a large bowl and toss to combine; season with salt.Step 5Divide tahini among bowls and top with lettuce and corn and chickpea mixture. Sprinkle with feta. Serve with lime wedges and cilantro alongside.How would you rate Corn & Chickpea Bowl with Miso-Jalapeño Tahini?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleThis was very rich!  I made it as the recipe instructs- no substitutions.  I did choose the largest cloves of garlic I had and it ended up too garlic-ey.  I did not add any salt because the miso is salty enough for my taste.  If I made it again I would use less dressing.  So I recommend using the dressing sparingly.  I would also add sliced cucumber and a tomato from my garden.  And I might put it all in a pita to balance out the richness.  But overall a unique and delicious combo of ingredients.  While I don't regret making it, I would rather try something new than do this recipe again.KitchenetteOregon11/3/2021What if you don't like the taste of cilantro?AnonymousKnoxville Tennessee10/20/2021This review is for the tahini. I used it as a dressing for another grain + roasted veggie bowl I made and this dressing is SO SO SO GOOD. I swapped lemon for lime (cause that's all I had), used light miso, and used a combination of cilantro and parsley. My only mistake was keeping both jalapenos seeded (it ended up being very spicy), but I tempered it with some greek yogurt. IT WAS STILL SO GOOD. THE BEST DRESSING I'VE EVER HAD.SmitaMinneapolis, Minnesnowtah10/2/2021This is just outrageously delicious, and we’re not even close to vegetarian.  Definitely going into the regular rotation.NikkiRhode Island9/16/2021This recipe is phenomenal! The flavor is something that is not to be forgotten. Few recipes have stuck in my memory like this one. A year after being introduced and I’m still making this at least once a month. I’ve skipped on the ginger and jalapeño before and it’s good, but I prefer the dish as is with all the ingredients. I think it’s vital to get yourself a good fresh cheese. Bulgarian sheep’s milk feta is my go to but I could also see some queso fresco going well. I also think a lighter miso works much better with this dish than dark red miso. I found the dark miso to overpower the dressing. Thank you, Chris Morocco! AnonymousSanta Cruz, CA6/30/2021Absolutely 🔥🔥🔥🔥🔥!!!!! Super fresh and summery. I added some avocado and queso fresco for the final bowl and it was super delish! I can see myself munching on this for the whole summer. I did cut back on the pepper for the dressing and added more garlic than the recipe suggested. JillChicago, IL6/16/2021I changed up the dressing after reading some of the reviews. Instead of jalapeno I added two small pickled sweet peppers, about half of a lime,  instead of 1/3 of a cup like the recipe suggests.  I also added water and miso to taste and didn't add salt. Was so delicious. I think the miso, jalapeno and lime and salt was overwhelming. Oh, and I also only used 3 tablespoons of tahini but kept the same amount of cilantro and added about 1/2 tablespoon of olive oil. RosesOakland, CA6/7/2021This was very tasty, but the dressing was a bit too salty and garlicky for me. It needed some sweetness, so I ended up adding some (maybe a tsp?) of honey to the dressing and some quick pickled carrots (leftover from Christina Chaey's summer grain bowls!) to the salad and I felt like it really balanced everything out. MelissaBrooklyn1/12/2021A new family favorite for adults and children alike with only one minor modification, which was one less garlic clove in the dressing. A surprising combination of flavors that come together incredibly. ChristinaBrooklyn, NY1/6/2021Loved this! I had my doubts because it’s a strange mix of flavors and the sauce on its own is very strong, but it all really comes together! BethGlenside, PA12/15/2020Layered and wonderful. A great summertime dish. Highly recommend.AnonymousLos Angeles10/12/2020I made this, in part, because we happened to have almost all the ingredients on hand remarkably—miso, tahini, jalapeños, corn, ginger, even za’atar! Never in my wildest dreams could i have predicted how much my husband and I would love it. Will definitely make this again. AnonymousBrooklyn, NY9/15/2020So good. I also had about a cup of leftover dressing that I will happily use on my next salad. KatiehwalshAustin9/13/2020Love me a good Chris Morocco miso-tahini-veggie-fusion-splosion of a recipe but I just didn't love this one and can't see myself making it again. AnonymousSeattle 9/12/2020Wow.  I wasn’t sure what to expect, but this was absolutely delish!  I used red miso, and some Peruvian chili lime spice mix.  So tasty!  I’m out of lettuce now, but looking forward to having the leftover dressing and corn/chickpea mix over kale for my lunch tomorrow.AnonymousCalifornia9/2/2020Explore Bon AppétitRice and Grain BowlCornVegetableChickpeaBeanMisoCondiments, Sauces & PastesTahiniJalapeñoChileSummerQuickEasyWeeknight MealsMainVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-08-18", "author": ["Condé Nast", "Chris Morocco"]}