{"id": "4c9b5b77c278e1a7c9de48e6e72505d8", "url": "https://www.bonappetit.com/story/let-them-eat-reubens", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Let Them Eat Reubens! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLet Them Eat Reubens!In defense of vegetarian Reubens, and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroMarch 21, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Earlier this week I wrote about how my love for Reubens has nothing to do with the meat. I love the rye bread, the Swiss cheese, the Russian dressing, and I really love the sauerkraut. And that's how this Kale Reuben recipe from Chris Morocco came about. Then we posted it on Instagram, and people got maaaad. ckhayes91 called it \"an abomination.\" kookiescatering went all-out Braveheart: \"Kale will NEVER replace corned beef.\" And sourwench tagged @r_a_d_16 and wrote, simply, \"no.\"On one hand, it's cool that corned beef has so many loyal fans. On the other hand, everyone, including vegetarians and climate dieters and people who don't like salty slabs of beef, should be able to experience the delicious flavors of a Reuben. \"Let them eat Reubens!\" is what I would say if I were an 18th-century monarch and the sandwich somehow existed then.In less divisive recipe news, have you made Andy Baraghani's brothy pasta with chickpeas yet? Actual conversation we had in the Test Kitchen:Me: I love it, but is it pasta or is it soup?Andy: [eye roll] It's brothy pasta.Me: [head explodes] You're a genius.It's brothy pasta. Don't overthink it.\nPhoto by Chelsea Kyle, Food Styling by Michelle GattonWhat I'm ReadingJia Tolentino on Outdoor Voices and the blurring lines between exercise and life. I was at their Austin headquarters last week and can confirm that everyone who works there is exceedingly happy and tan and wearing Outdoor Voices apparel. Tolentino is justifiably skeptical about the brand's mission, which is to \"get the world moving\" by selling what is essentially athleisurewear. But if I could get away with wearing this onesie, to work, I can't say I wouldn't do it.I feel like I've read enough \"How Modern Food Is Killing Us\" articles to, well, kill me, but this one by Bee Wilson is better argued, more relatable, and less judgmental than all the rest. As she puts it, \"Life is deeply unfair and some people may eat every dark green leafy vegetable going and still get cancer. But even if food cannot cure or forestall every illness, it does not have to be the thing that kills us.\"This Week on HealthyishSenior staff writer Alex Beggs hangs out with Anna Konkle, star and co-creator of Hulu's Pen15, at Prune, where Konkle used to wait tables. “Prune was a revelation because it was the first time I wasn't hearing men screaming in the kitchen,” she says. Lizzie Noonan shadows Daisy Orlana Ramli, founder of the Indonesian pop-up Sayang, to see how she preps for one of her dinners. And Julia Bainbridge writes about how alcohol companies are bracing for a much more sober future.What I'm CookingSquash Parmesan forever, or at least until butternuts are firmly out of season. Sesame Chicken with Broccoli from Cook90, Alison Roman's olive-oil fried lentils from Dining In, hummus with spiced lamb from Yasmin Khan's Zaitoun, and pretty much everything from Where Cooking Begins, Carla Lalli Music's new cookbook, which arrived on my doorstep today!Who I'm FollowingSarah Cihat, whose gorgeous, astral ceramics I was ogling at the Mociun store in Williamsburg last weekend. Yosigo for colors and angles. G. Kero for spring wardrobe inspo, and Meme Appetit, obviously.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleToo Many Lines, Not Enough TacosBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Amanda Shapiro"]}