{"id": "4cbb38288a73a165c3bd729506512b94", "url": "https://www.bonappetit.com/recipe/spiked-ginger-mint-lemonade", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Spiked Ginger-Mint Lemonade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueSpiked Ginger-Mint LemonadeBy Bryan FurmanMay 22, 20183.8(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintRefreshing! And potentially debilitating, so be careful. This recipe, from B’s Cracklin’ BBQ in Savannah, GA, (read more about pitmaster Bryan Furman here) was originally made with Lawn Dart ginger-lemon liqueur, but Absolut Citron will work.Ingredients8 servings Syrup½cup chopped mint½cup chopped peeled ginger1cup sugarCocktail and Assembly1750-ml bottle lemon-flavored vodka2cups fresh lemon juiceLemon wheels and mint leaves (for serving)PreparationSyrupStep 1Bring mint, ginger, sugar, and 2 cups water to a simmer in a small saucepan over medium heat, whisking to dissolve sugar. Remove from heat and let sit 1 hour. Strain through a fine-mesh sieve into a large measuring glass or a small bowl; let ginger-mint syrup cool completely. Cover and chill until cold, at least 30 minutes.Step 2Do Ahead: Syrup can be made 1 month ahead. Keep chilled.CocktailStep 3Combine vodka, lemon juice, ginger-mint syrup, and 4 cups water in a punch bowl and stir well.Step 4Ladle spiked lemonade into ice-filled glasses and garnish with lemon wheels and mint leaves.How would you rate Spiked Ginger-Mint Lemonade?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleMade my own lemon vodka with 1 cup vodka and 2 lemons quartered and let sit for a week in cool dark place. More lemony than minty. It was good but too tart.mmoriciJersey City, NJ7/26/2020Tasty but tart.  I added a little sparkling water to top it off.AnonymousLong Beach7/8/2020This was a big hit at our 4th of July celebration. The flavors of mint and ginger made it special, plus my guests appreciated that it wasn't too sweet. Be cautious, though, it will sneak up on you! mrou03Ohio7/7/2018Explore Bon AppétitCocktailDrinks AllCold DrinkSouthernAmericanMintHerbs & SpicesGingerLemonCitrusFruitVodkaAlcohol & Other DrinksEasyDrinksSimmerJuneteenthFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}