{"id": "4cc1f95ff7a4a27d3b1f6f0298cbf688", "url": "https://www.bonappetit.com/story/never-fail-swordfish-steak-recipe", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Swordfish Steak Recipe Is My Favorite Fancy-Seeming, No-Brainer Entertaining Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Swordfish Steak Recipe Is My Favorite Fancy-Seeming, No-Brainer Entertaining DishWhen I've got to cook for a crowd but don't have it in me to make something elaborate, I turn to this hands-off stunner of a swordfish steak recipe.By Sasha LevineApril 5, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.There’s a week every August when I get to pretend that I’m a private chef. I look forward to it like it's a holiday, spending months culling recipes and debating what kitchen tools are actually necessary to schelp with me. When we finally pull up to the rented house in Truro, Cape Cod, all six adults (including one very large one that eats for three) know that I’m in charge of the kitchen—including dinner, and cocktails, and post-beach snacks in between. So I pretty much am a private chef for that week—except my fee is a few thrills on my 11-year-old nephew’s boogie board rather than cold hard cash.This is always very exciting at first. Access to a grill! All the fresh fish! Peak produce! And, well, let’s face it: total control! But after a few days on vacation, it gets harder and harder to stay ambitious. When that day comes, I turn to this swordfish steak recipe, a dish that tastes, and looks, way more impressive than the amount of actual effort required to make it.That starts, for me at least, with the fact that swordfish feels fancy AF. It’s got that beautiful pink hue, a muscle pattern of white concentric circles, and comes in one-inch-plus “steaks,” like it’s some sort of rib eye. That can make it sound intimidating, but because it’s sturdy, meaty (see aforementioned “steaks”), and mild in both smell and flavor, it’s also pretty forgiving.Add to this the news that you barely have to touch it, or worry about it, after you’ve slid it under the broiler for a few minutes with some cherry tomatoes, anchovies, and capers, and it’s pretty much a no-hands no-brainer. The accoutrements are all pantry staples, and the sauce feels like a truncated puttanesca—which, if you know anything about me, then you understand that the addictively briny Italian pasta sauce with a highly questionable name is actually the quickest way to my heart.A can of anchovies always comes in handy.\nPhoto by Randy Harris/Courtesy of Abrams PublishingThe recipe calls for canned cherry tomatoes, but when I make it in the summer, I usually use fresh ones, and give the sauce mixture a headstart in the oven. Once the tomato skins start to char, I’ll make some room for the swordfish and carry on as normal. Having made the recipe the “right way” too, I can assure you that it’s deeply satisfying all year round.It’s only April, but I’ve already got my eye on a few new recipes I’m earmarking for our annual migration north. But when push comes to shove and day four of the trip hits, I know I’ll be reaching for this swordfish steak recipe.Get the recipe:Swordfish Steaks with Cherry Tomatoes and CapersSwordfish, with its meaty texture and strong (not in a bad way) flavor, can stand up to other robust seasonings like these.View Recipehttps://www.bonappetit.com/recipe/swordfish-steaks-cherry-tomatoes-capersExplore Bon AppétitBasicallyNever FailSwordfishCapersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Sasha Levine"]}