{"id": "4cccae0b1df52490fbee4a8034288a78", "url": "https://www.bonappetit.com/story/hedai-offaim-well-crafted-kitchen", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "The Well-Crafted Kitchen: Inside Hedai Offaim’s Stunning Israeli Farmhouse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Well-Crafted Kitchen: Inside an Israeli Chef’s Stunning Farmhouse and GardenHedai Offaim, a chef, writer, and food entrepreneur has an incredible home outside of Jerusalem where he hosts workshops and elaborate dinners.By Jessica SteinbergJune 8, 2018FacebookTwitterEmailPhoto by Eyal Yassaky WeissFacebookTwitterEmailA massive, rough hewn wood carpenter’s bench, reconfigured as a kitchen island, is the center of Hedai Offaim’s cooking universe.It’s where this 39-year-old Israeli chef, writer, and food entrepreneur prepares most of his family’s meals, as well as the massive Sabbath dinners and cooking workshops frequently held in the spacious kitchen of this non-traditional farmhouse. Hedai, who appeared with Michael Solomonov in the documentary, In Search of Israeli Cuisine, has a farm-to-table empire that he and his brother, along with two other partners, created in their southern Negev farm, sustainably raising goats and growing produce for three cafés throughout Israel.“My ancestors were carpenters and I love that,” said Offaim, sitting at what he calls “his seat,” an upright chair at his wide-planked dining room table. Offaim, whose name means branches in Hebrew, built the wooden island himself. It’s longer and wider than a traditional carpenter’s bench in order to serve as a cook’s dream prep station.The kitchen island.\nPhoto by Eyal Yassaky-WeissThe bench centers the kitchen, a spacious, airy, high-ceilinged room with windows running the entire length of the L-shaped counter, overlooking a fruit orchard and leafy eucalyptus tree in the yard, grapevines, a stone-sided swimming pool, and the green Jerusalem hills beyond. The dining room table, which can easily accommodate 20 when opened, is the center of this great room. The space flows into the generous expanse of a living room with moss green walls, which looks out on the same idyllic scene through floor-to-ceiling sliding glass doors.Photo by Eyal Yassaky-WeissThe house, which appears to be a small, typically Israeli farmhouse from the outside, has 125 square meters of space in the great room, and was built by Offaim and his family and friends in three months, eight years ago. It’s located in Moshav Tzafririm, a former farming community in the Ella Valley region between Jerusalem and country’s center, and home to many cottage industries, such as Kakadu, which mades wooden home goods, several local ceramicists and family farms, as well as microbreweries and wineries.“I needed this kind of location,” said Offaim, who grew up in the northern port city of Haifa. He and his wife, Eti Libman Offaim, a lawyer and yoga teacher, were looking for a rustic place to settle with their two children, where they would have room to grow their herbs and fruit; there are dozens of herb bushes and fruit trees—including figs, loquats, olives, lemons and grapefruits—on the 28-dunam (about 7 acres) property.The backyard garden.\nPhoto by Eyal Yassaky-WeissAnd so the kitchen island and the dining room table, or tisch, the Yiddish term for table that Offiam likes to use, is a central part of that experience.It’s the place where he stands and cooks for his family, often joined by a friends, drinking one of the local wines he collects in his basement cellar, using one of the assortment of pots or pans hanging on the nearby wall, a still life of copper and stainless steel saucepans, skillets and stock pots that have become a focal point in this capacious room. (Offaim tries not to keep the pots and pans that aren’t in use, as he’d rather not be too attached to the pots themselves, but what he makes in them.)Photo by Eyal Yassaky-WeissThere are the kitchen’s butcher block counters as well, carefully curated with classic appliances that Offaim allows himself, including a juicer, a massive sandwich maker for the kids, his beloved Arkstrom mixer and Faema E61 espresso machine. There’s no microwave in this kitchen. There’s a mix of sky blue, white and accordion wood cabinetry above and below the counters, and Offaim’s well-used enamelware and handmade pottery. Behind the dining room table is more of Offaim’s collection of glasses and pottery, stored in golden yellow cabinets that serve as a kind of casual breakfront, with olive green wainscotting set between the upper and lower cabinets.On the kitchen island are two burners (in addition to the seven-burner stove a few feet away), a small sink, and a deep, vertical trough running the length of the island that houses five different types of tahini, some cold-milled by an Arab friend in the nearby village of Abu Gosh, as well as an assortment of local honeys, jams, olive oils, and salt.“That trough is what the carpenter’s bench is all about,” said Offaim with a grin. “All my tools are right there, in addition to five to ten wine bottle openers at any given time. We drink a lot of wine around here.”Photo by Eyal Yassaky-WeissOn the other side of the island is Offaim’s impressive cookbook collection, two jam-packed shelves of well-thumbed cookbooks from every kind of cuisine, and continuing into the family library, where there are floor-to-ceiling bookshelves crammed with more books, from children’s picture books and novels to more cookbooks. Winding one’s way back toward the kitchen brings visitors through an inner foyer with a blackboarded wall, scrawled with doodles, quotes, and to-do lists.The porch, a meandering metal widow’s walk that curves around the house and overlooks the yard below—and the location of the dog house—is a space for sipping wine, smoking, moving from inside to outside and back again.“Living in a place like this, and being indoors doesn’t make sense to me,” said Offaim, who has the rumpled, bearded look of an academic. “We wanted the ability to have the indoors and outdoors intervene.”Photo by Eyal Yassaky-WeissOn the desert farm 60 miles away from his home, Offaim and his brother raise goats fed on date leaves, hatch one and a half million eggs each year, and harvest dates, mangoes, vegetables, and herbs. Everything grown is organic, uses solar energy, recycled water, and natural fertilizers. The siblings are completely self-taught; this was their first venture into farming.“We call it seed to table,” he said. “We turned to it as pure poetry, but we also have to sustain our families, if not for generations, at least for decades, and have to do so locally.”Photo by Eyal Yassaky-WeissOffaim’s cooking skills are also self-taught, from stints working in Israeli restaurants, and from reading his collection of cookbooks, a library he cherishes. Now that he writes his own cookbooks, it’s important to Offaim not to repeat anything he’s read or cooked, but to renew and create his own flavors and dishes, like spinal cord of lamb with sweetbreads, onions, and white gazpacho made out of puréed cashews. He doesn’t cook much pork or seafood, as they’re not easily available in this rural part of the country. He’s more of a lamb patties with green tahini kind of guy, seasoned with the herbs right outside the front door.Photo by Eyal Yassaky-WeissMost of his ingredients come from the surrounding Judean Hills region. Offaim’s herbs and fruits come from his front and back yards, his wines are from the nearby Ella Valley, while his organic produce is purchased from a neighbor who runs a local farm for community supported agriculture and his meat is also raised at a nearby farm.“I go to the supermarket twice a year for soap,” he said.Photo by Eyal Yassaky WeissEverything comes together at the rollicking Friday night, family style meals that begin at 8 p.m. and often don’t end until two o’clock in the morning. There are also literary salons and impromptu concerts in his home, when they host Israeli musicians, and sometimes Offaim himself takes a seat at the upright piano.His favorite place in the home is not at the cushioned living room couch, but at his immensely long dining room table, sitting at one end, in an unmatched chair with a straight back.“That’s my seat over there,” he said. “This is the center of the house.”Photo by Eyal Yassaky-WeissExplore Bon AppétitRestaurants + TravelIsraelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Jessica Steinberg"]}