{"id": "4cd6efcd1914b26d053323e0d4ed67f3", "url": "https://www.bonappetit.com/story/summer-canned-drinks", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "The Best Canned Cocktails 2021 for Every Possible Social Situation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur Favorite Canned Drinks for Every Possible Social SituationThe canned booze aisle is a lot right now. Let us help you pick.By Karen YuanAugust 13, 2021FacebookTwitterEmailPhoto by Emma Fishman, styling by Allie WistFacebookTwitterEmailOkay, yes, it’s August, but summer isn’t over yet. You’ll have to pry it out of our sweaty, mosquito bite-ridden hands. We’ve been keeping our ovens off and hanging out in the shade, and, like everyone and their literal mother it seems, drinking booze out of cans.The Cool Drinks Economy is inflated with canned beverages in various colors, flavors, and ~vibes~. So which one should you choose? The BA staff is here to help with a list of our favorite drinks in a can, including some nonalcoholic picks, plus the ideal scenarios to consume them.Check them out, track them down, and bring them to whatever summer activities you’re squeezing in before it’s sweater weather again. And remember: It’s not the size of your cooler, it’s what you fill it with that counts.Photo by Emma FishmanFor the Beach, Post-Salty Ocean DipI am a fiend for sparkling water with the juice of actual fruits in it. And now, I have a new love interest in Sanzo, which features Asian fruits like calamansi, mango, and the undeniable frontrunner, lychee. I like to pack a cooler full of these babies for the beach, as they are not only incredibly refreshing when frosty but excellent for de-salting your mouth after an overlong dip in the ocean. —Hilary Cadigan, culture editorFor Wooing a Date With Your Elegant MystiqueNothing says “I am a person of sophistication and mystery unbound by societal norms” like this canned beverage from Empirical, an extremely out-of-the-box distillery in Copenhagen founded by alums of Noma’s Nordic Food Lab. Like all of Empirical’s offerings, which include spirits flavored with habanero and katsuobushi, Can 01 defies easy categorization. At 10% ABV—somewhere between a double IPA and wine—it’s made with a spirit drawn from beet molasses and Belgian saison yeast and flavored with tart green gooseberry and floral milk oolong. Toasted birch and pomelo zest complete the party. “What is it?” your date will ask. “Shhhh, let’s not define ourselves,” you’ll whisper. —MacKenzie Chung Fegan, senior commerce editorPhoto by Emma FishmanFor Quality Porch Sitting and Murder Mystery ReadingAll I want to do on summer vacation is sit on a porch and read my mysteries. Thanks to the best grocery store in Michigan, Western Market, I was introduced to De La Calle’s Ginger Manzana Tepache, a fermented (and booze-free) Mexican drink I’ll take over kombucha any day of the week. It’s super fragrant with black pepper and cinnamon, but the taste is all spicy ginger and sweet pineapple. I love soda, but this is the low-sugar alternative I needed for the sake of my glucose levels. (BTW: This summer’s thriller is The Girl in the Mirror.) —Alexandra Beggs, senior staff writerPhoto by Emma FishmanFor the Beach That’s Getting a Li’l ChillyYou’re at the beach, the sand is kind of gray and wet, and the breeze has a bit of an autumnal bite to it. But you’re going to have a Beach Day, damn it, and Fishers Island Lemonade is going to help you. The premixed cocktail of vodka, whiskey, lemon, and honey is like distilled summer in a can. It tastes bright and sweet and a little sour—and, at 9% ABV for the original version, festive. For less of a kick, the bubbly Fizz is my favorite at 5% ABV. As the back of the can declares, here’s to summer never ending. —Karen Yuan, lifestyle editorFor the Nice Picnic Where Someone Brought a Charcuterie BoardThe few canned wines and cocktails I’ve tried have felt paradoxically too sweet and too bland. That’s why I was surprised by how much I enjoyed Licence IV’s Blanc. Made from Melon de Bourgogne grapes from the Loire Valley in France, its citrusy notes, balanced acidity, and touch of salinity paired perfectly with the fried-and-salted green tomatoes I snacked on after a run so humid that steam was coming off the roads. I’d be thrilled to catch sight of its trés élégant label in the cooler at my next picnic or backyard barbecue. —Jenna Adrian-Diaz, assistant to the editor in chiefPhoto by Emma FishmanFor the Great Outdoors, Post-Hike or Post-Lake DipAs an elder millennial, I just can’t with the kids and their hard seltzers, spiked kombuchas, and all the other inscrutable cans in my bodega’s fridge right now. Wine in a can, though: That I can get behind. At this summer’s BYOB hangs, I’ve been bringing Nomadica along as my plus one. Curated by L.A.-based somm Kristin Olszewski, the label’s sustainably farmed, low-intervention wines are made to taste fresh and vibrant straight from the single-serving can. I go for the sparkling options—a citrusy white, made from a blend of Albariño and Chardonnay, or the crisp rosé (100% Pinot Noir). And that’s as close to White Claw as I’m gonna get. —Amanda Shapiro, editorial directorPhoto by Emma FishmanFor Nights In When You Just Gotta Order UberEatsWhenever I’m swinging by an H-Mart or putting in my take-out sushi order, I always add a Calpico or two to my cart. Calpico soda tastes like an unnameable, tropical, vanilla-y fruit that I wish I could take a juicy bite of…but for now, I’ll settle for sipping on it in soda form. It’s floral, fruity, and not overly saccharine. There’s simply no other drink I’d rather cleanse my palate with. —Mehreen Karim, recipe production assistantFor the Beach That’s Not IpanemaWhen I first poured one of Novo Fogo’s Caipirinha cocktails into a glass, I was a little shaken. I was expecting the vibrant green color of Brazil’s signature lime-and-cachaça drink, but what I got was a crystal-clear soda that’s more hard seltzer than beachy cocktail. After my first sip, though, my worries were put to bed. The original lime flavor is sweet and almost spicy—like a Dark ’n’ Stormy with less of the stormy darkness. The fruity flavors tasted fresh and real, unlike some of the candy-sweet seltzers I’ve tried in the past, and nothing about its flavor betrayed its 8.2% (!) alcohol content. Sure, it’s not quiiite Caipirinha, but I’m not quite in Rio either, so I won’t feel guilty bringing a few of these half-size cans to the oceanside. Saúde! —Nico Avalle, digital production assistantFor That Brutal 3 p.m. Work SlumpA few cases of Minna’s Orange Mango Black Tea showed up at the office nearly two years ago and I grabbed one in a bid to counteract a particularly vicious 3 p.m. slump. And it was...glorious. The mango actually tastes like voluptuous fresh fruit, while the orange is barely there, in a good way. The snap of black tea, with its refreshing bite of astringent tannins, leaves you refreshed yet always ready for one more sip. —Chris Morocco, test kitchen directorPhoto by Emma FishmanFor Floating on a Giant Inflatable Animal in the PoolNothing says, “POOL DAY!” more than a spritz, and there’s no spritz (according to me) better than this one from Usual Wines. It’s a blend of California brut (a fun ’n’ fancy way to say sparkling wine) and pressed Japanese yuzu juice; the flavor is light, bright, and delightfully citrusy without any of the cloying sweetness that comes with many a mixed drink. The best part: At only 7.25% ABV, I still have my wits about me enough to crush the inflatable narwhal relay. —Ali Francis, associate editorPhoto by Emma FishmanFor Day-Drinking on a Friend’s Parent’s PontoonPontoon drinking is an all-day affair, and that’s when you want a low-ABV thirst quencher that is anything but White Claw (unless there’s only WC, in which case, I’ll still drink it). I’m obsessed with Stillwater Sparkling’s hard seltzers, especially Citrus Haze, which is bright and sunny and juicy. Its seltzers are flavored with hops and not “natural flavors,” whatever that means (eye roll), so if you like craft beer, jump on these. —A.B.Photo by Emma FishmanFor Impressing Coworkers at the Get-to-Know-You Happy HourFew things are better than the sound of cracking open an ice-cold can of beer sake. With a slightly fruity, full-bodied flavor (is that mango? Papaya? Yeasty, fresh-baked banana bread, even?) and a viscous mouthfeel, Kikusui’s 6-ounce cuties are just the right thing when opening a whole bottle feels excessive. I’ll split a can over dinner after work, but I don’t always feel like sharing. (A word to the wise if you go it alone: At 19% ABV, the petite package packs a punch.) And in case you’re wondering: No, the adorable cans were not designed just to pull at your heartstrings. This unpasteurized, undiluted brew is so delicate that the typical translucent glass bottles wouldn’t do. —Sasha Levine, digital directorPhoto by Emma FishmanFor the Backyard Grilling Sesh That’s Getting a Li’l Too HotThe Instagram community is a thing of beauty. Someone had paired the Smooj Piña Colada with my hot honey wings and tagged me in their post. It certainly piqued my curiosity, and I have to say, thanks for a great rec! The drink really is perfect for an outdoor party. Made with pineapple purée, key lime purée and cream of coconut, this hard seltzer smoothie is unlike any other. It is thick and jam-packed with heavily fruited flavors yet light and sparkly. It’s the perfect boozy refresher for a hot grilling day. —Jessie YuChen, assistant food editorPhoto by Emma FishmanFor Retreating Indoors When It’s 90 Degrees OutI cannot help but keep reaching for a can of Kimino’s Ume sparkling water. The Japanese plum juice is sourced from the Wakayama prefecture and the spring water from the Hyogo mountains. It is perfectly bubbly, with a hint of sour, and it immediately quenches me on a hot day. It’s no wonder why I always have a few cans hanging around in my fridge. —Rachel Gurjar, associate food editorExplore Bon AppétitLifestyleShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-13", "author": ["Condé Nast", "Karen Yuan"]}