{"id": "4cd886ecb952b5c88364938ef0eb57a9", "url": "https://www.bonappetit.com/recipe/cod-arracanato", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Baked Cod With Golden Breadcrumbs and Raisins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCod ArracanatoBy Anna GassJanuary 25, 20223.9(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintCod is a lean fish that can need some help in the flavor department. In this twist on baccalà arrancanato, a salt cod dish popular in Molise along the Adriatic coast of Italy, fresh cod gets a boost from a handful of pantry staples such as breadcrumbs, raisins, and lemon. A healthy pour of olive oil gives the fish some needed richness while a splash of white wine helps to create just enough sauciness. A minute or two under the broiler at the end makes the nutty, raisin-studded breadcrumb topping golden, crunchy, and quite delicious. Since fresh cod doesn’t require soaking like salt cod, this recipe is ideal for a weeknight meal served with rice. —Anna GassAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMetal Baking Pan$22 At AmazonMicroplane Grater$16 At AmazonHeat Resistant Gloves$20 At AmazonIngredients4–6 servings¼cup raisins¼cup dry white wine1½–2lb. skinless, boneless cod or other firm white fish fillets1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly cracked black pepper7Tbsp. extra-virgin olive oil, divided½cup breadcrumbs¼cup pine nuts1Tbsp. finely grated lemon zest1tsp. dried oregano1garlic clove, finely gratedParsley and lemon wedges (for serving)PreparationStep 1Preheat oven to 350°. Place raisins in a small bowl and pour wine over (wine should cover raisins).Step 2Pat fish dry with paper towels and season on both sides with salt and pepper. Drizzle bottom of a broilerproof baking dish large enough to fit fish with 3 Tbsp. oil. Arrange fish in baking dish.Step 3Mix breadcrumbs, pine nuts, lemon zest, oregano, garlic, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a small bowl.Step 4Holding back raisins, drizzle wine evenly over fish. Stir raisins into breadcrumb mixture, then spoon mixture over fish, patting to adhere. Drizzle remaining 4 Tbsp. oil over top.Step 5Bake fish until flesh is opaque and beginning to flake, 13–16 minutes.Step 6Heat broiler. Broil fish until breadcrumbs are crisp and golden brown, about 2 minutes.Step 7Scatter parsley over fish; serve with lemon wedges for squeezing over.How would you rate Cod Arracanato?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDelicious.  Substituted dates for raisins and estragon for oregano.  Also drizzled on the olive oil just before broiling … I tend to burn things.  Just right.AnonymousLuxembourg 2/2/2022The raisins were surprisingly good in the dish, but it lacked some defining flavor, in my opinion.AnonymousLos Angeles2/1/2022Will try it soon, but might sub olives for the raisins. Can’t get my mind around raisins here.Elle The Heartland1/30/2022Explore Bon AppétitDinnerWeeknightOne-Pot MealsEasyDairy-FreeItalianEuropeanCodFishSeafoodRaisinDried FruitFruitMainRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-25", "author": ["Condé Nast", "Anna Gass"]}