{"id": "4cd8e3e94f3f6bebe45017f136697d90", "url": "https://www.bonappetit.com/story/eaton-hotel-dc", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Eaton DC Hotel: The Crystal-Filled, $300-a-Night, Social Justice Hotel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat It's Like to Stay at a $300-a-Night Crystal-Filled Social Justice HotelAt Eaton DC, there’s delicious food, a *lot* of crystals, and a sinking feeling I can’t shake off.By Elyse InamineJuly 10, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI checked into Eaton DC around 11 a.m. one spring weekend in our nation’s capital and was given a rose crystal with my room key. Two hours later, I’d counted 152 more crystals in the hotel: 120 marble-size, milky orbs were neatly nestled in the cabinet behind the check-in desk, 26 dotted the entrance of the wellness center, complete with an infrared sauna and Reiki, art-making, and life-coaching sessions. I spotted another three in the beautiful yoga studio as I was folded into downward dog with streams of sweat pooling on the yoga mat. In the hallway to my room, there was a black and white rock that looked like a R2D2-sized musubi. And then there was the very large pink one on the bedside table of my dreamy, cabin-like room that seemed straight out of Moonrise Kingdom.If you couldn’t tell, Eaton DC isn’t like other hotels. It's the second outpost of the Eaton chain—the first is in Hong Kong with more U.S. locations opening up in the future.  In addition to the crystals and the wellness center at the DC hotel, there’s a mini theater showing films like “I’m Not Racist… Am I?”. There’s a radio station that hosts shows like “Risky Behavior,” which breaks down wellness trends (CBD!). There’s a “radical” library where you can check out books like Multiplication Is For White People. The hotel hosts book talks—the rapper Common (!!) swung by to discuss his new work, Let Love Have the Last Word: A Memoir—and conversations with poets like Cleo Wade and activists like DeRay Mckesson.“Our hotel is about making the world a better place and creating conditions for people to be their best selves,” Katherine Lo, Eaton DC’s founder, told me over the phone after my stay. She wanted to build a hotel that wasn’t just focused on hospitality and luxury but also on activism, wellness, and art—things that hotels typically don’t care about. Lo, 37, was a filmmaker and activist in college and is the daughter of a famed hotelier in Hong Kong. She’s frank about what she’s doing: funneling her family’s vast resources into artists, issues, causes, and organizations that matter to her. “I’m using a for-profit model to achieve the same goals as an activist,” Lo explained. “And the main thing we can provide is space.”That means using the hotel lobby for installations (conceptual artist Mel Chin’s Fundred project about the Flint water crisis was on show when I was there), inviting artists to stay at the hotel for residencies (photographer Ayana V. Jackson was the first), stocking the mini bar with Flow water instead of Boxed water since Betsy DeVos, the Trump-appointed Secretary of Education, is associated with the latter, and hosting an opening reception for American University’s first annual Antiracist Book Festival, which was happening during my stay. When I first asked about it at the crystal-covered front desk, no one seemed to know that it was happening. The second time I inquired, I was told it was a ticketed event and not open to the public.Eaton's wellness programming ranges from sunlight yoga to candlelit crystal gong baths.\nPhoto by Jennifer HughesAlongside its activism-focused programming, Eaton DC has the requisite coffee shop (Kintsugi), a quietly ambitious restaurant from local chef Tim Ma (American Son), and not one but two bars (Allegory hidden behind the radical library and Wild Days on the rooftop).When I met him at American Son, Ma explained the story behind the name, how his immigrant mother introduced him to her friends as her “American Son” as a way to indicate that he couldn’t converse in Chinese with them. His hyphenated identity courses through the menu: the pillowiest gnocchi is made, somehow, with tofu, and there’s a clever take on ssam with spaghetti squash, served with big leafy lettuces, tons of little sauces, and crunchy toppings. There’s also a big-ass, bone-in ribeye with chimichurri and smashed potatoes that reminds you this is still a hotel restaurant, a.k.a. one that can pamper its well-paying guests.I couldn’t really shake off a pervading thought: At Eaton DC, activism is the selling point.Of course I enjoyed the steak. And the velvety booth I sat in designed by hot-hot restaurant designers Parts and Labor. And the heavenly Plushbed mattress I slumped into later that night in my room that usually books for $200 a night (rooms range from around $140 to $350 a night). But in the end, I couldn’t really shake off a pervading thought: At Eaton DC, activism is the selling point. It felt a little icky to me, this idea that social issues can be marketing tools—as if paying for a hotel can solve entrenched problems like racism, sexism, and the like.Eaton DC is hardly the only lifestyle brand that’s grafted social justice into its marketing campaigns. From Dove’s body-positive, diversity-focused “Real Beauty” campaign to Nike naming Colin Kaepernick as its athlete of the year to Gillette’s toxic masculinity commercial in the wake of #MeToo, brands are all about appearing radical and inclusive. But their ultimate goal, of course, is profit. And I’ve always believed that activism and capitalism have opposing bottom lines. After seeing Patagonia go after Trump on climate change, you feel better about buying its outdoor goods. You can freely use Lyft, knowing that the ridesharing company now covers $200 of a name-changing fee for its transgender drivers. But all this signaling through advertising doesn’t equate to meaningful action or accountability on these issues. If consumers stopped caring about a problem like, say, climate change, these companies would find a different message to sell us the same stuff.Here, Himalayan salt lamps are standard bedside table fare.\nPhoto by Adrian GautWhen I asked Lo how she’s able to reconcile social justice with commercial enterprise, she didn’t flinch. “I think that there are benefits to merging them because we’re hoping to create a seamless financial model where the company operates with revenue but goes back to support social impact, cultural, and media programs,” she said. “Guests can come and know that by patronizing this they are supporting art and social change.”For activists in the DC area, this seems to ring true. “It’s great to see corporations adopt a mindful and inclusive business model,” Amanda Nguyen told me over the phone. She walks by the hotel all the time—she lives nearby—and is the founder of Rise, an organization that fights for the rights of sexual assault survivors. She’s even hoping that she can work with Eaton DC in the future. “It’s hard for some creatives to get venue space for a talk or a book reading,” explained Christine Platt, an activist, author, and previously the managing director of the Antiracist Center at American University (which put on the Antiracist Book Festival). “I’m not going to make a lot of money doing those things.” Eaton DC partnered with her for the festival, she told me, and offered discounted rooms for the authors and speakers (usually rooms range between $180 and $270 a night). Now she’s there probably once a week, taking meetings and inevitably running into someone else she knows. “The only place we had before Eaton was [the cafe known as a hub for grassroots organizing] Busboys and Poets,” she said. “It’s very much open to the community, where artists, writers, and activists can sit and work for hours even if you only ordered one cup of coffee. I feel like Eaton has become like that in a short amount of time.”Hearing all this, I wondered if I was being puritanical in my own thinking. Nguyen and Platt seemed fine collaborating with a for-profit company on their endeavors—in fact, they were even more enthusiastic because of the opportunities and resources that came with it. Was I naive to think that social justice work could only be effective outside of a capitalist setting? Should I be more cynical, realizing that the lines between activism and capitalism are already so blurred? Here at Eaton DC, you can support art that reminds you of what is (still) going on in Flint, Michigan, and drink Betsy DeVos-free water, and eat a $125 steak all in one go. Is there a problem with that?“Continue to grapple,” Platt told me when I shared my confusion. “That’s where you’ll find a lot of the answers.”The next morning, I waited for a much-needed latte at Kintsugi and headed up to the rooftop with Ma, where he showed me Wild Days and the beds of aji charapita peppers and lemon verbena just planted for the restaurant. Ma looked down K Street, the epicenter of lobbyist gatherings, from our perch. “From the anti-Trump hotel you can see the Trump hotel,” he pointed out with amusement. About 12 hours later, after a round of makrut lime leaf cocktails at Allegory, we ended up at the rooftop again, but the vibe was much different from last time we were there: the White House Correspondents’ Dinner had just ended and people were ready to party. A suited media bro unleashed his belt for a little limbo, and everyone joined in until a bouncer cut off the game. The DJ is coming on, she said. Downstairs, business travelers were ordering that steak dinner, but up here the writers, activists, and artists were cutting loose.Explore Bon AppétitHealthyishWashington, D.C.HotelsTrendsRead MoreLifestyleI Tried 'Wellness Coworking' and It Made Me Feel Profoundly AloneBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-10", "author": ["Condé Nast", "Elyse Inamine"]}