{"id": "4cdb18d4e7174ea3822535270b8f0b61", "url": "https://www.bonappetit.com/story/crispy-gone-soggy", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Crispy-Gone-Soggy Is the Finest Texture of Food There Is, Fight Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCrispy-Gone-Soggy Is the Finest Texture of Food There Is, Fight MeChicken Parm. Nachos. General Tso’s chicken. Need I say more? (Spoiler Alert: I do.)By Amiel StanekMarch 27, 2019FacebookTwitterEmailFacebookTwitterEmailDo you really know anyone if you don’t know what their favorite texture of food is? The thing about working at a food magazine is that you come to know a lot of strange and highly specific things about your coworkers that you would never, ever learn about—or, for that matter, have any occasion to ask of—other human beings. The need to have opinions about all things at all times produces a sort of collective psychosis, the most obvious symptom of which is our tendency to bloviate, unprompted, to everyone and anyone within earshot, about even the most minute, mundane, and obscure aspects of eating and drinking and our “deeply held feelings” about them.I know, for whatever reason, that Molly Baz thinks that cooked carrots are “a stupid food,” and pretty much refuses to include them in a mirepoix. I know that Adam Rapoport will not order his vodka soda at a bar that dispenses seltzer water from a soda gun (too flat!) instead of a single-serving bottle of bubbly water. I know that Sarah Jampel is a vegetarian, but that if she were to eat meat, she likes the idea of duck and lobster the most. Me? Well, everyone on staff here at Bon Appetit knows what my favorite texture of food is. And that texture is crispy-gone-soggy.Simply put, the crispy-gone-soggy (CGS) designation applies to any dish in which an element has been fried, baked, roasted, or otherwise rendered dry and crunchy, and then said crunchiness has been intentionally compromised by a delicious liquid of some variety, usually a sauce or a broth. However, this explanation doesn’t quite do the phenomenon justice. Much like pornography, it is a thing that eludes description—rather, you know it when you taste it.CGS is chicken parm, the craggy breadcrumb coating on a cutlet gently softening under a blanket of tomato sauce and cheese. CGS is chilaquiles, crisp tortilla chips simmered in tangy salsa until they relax and go slack. CGS is, in the context of the Chinese-American takeout canon, General Tso’s/Orange/Sesame-anything, the thick layer of fry surrounding nuggets of protein soaking up sticky-salty sauce like a sponge. CGS is chicken fried steak smothered in gravy. CGS is Buffalo wings. CGS is British beans on toast and Tuscan ribollita, Quebecoise poutine and crouton-topped French onion soup. CGS is pieces of tempura-fried shrimp slowly sinking into a bowl of soba noodle soup like capsizing kayaks. CGS is nachos. Hell: CGS is cereal in milk.CGS is everywhere, everyday, present in just about every cuisine on earth. You know it. You probably love it as much as I do. You just didn’t give it a name.A hot sheet pan of nachos: peak CGS.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensThere are clear and scientific reasons behind CGS’s appeal. Typically, the presence of crispiness indicates that the Maillard reaction—the process by which sugars and amino acids, in the presence of heat, change to produce a range of complex and savory flavors—has taken place. We love fried foods, but we often attribute their addictiveness to texture alone, neglecting the copresence of a whole host of craveable flavors that contribute to their appeal. (It is worth clarifying here that, in the context of CGS, crispiness necessitates human intervention; it does not encompass the natural state of crispness exemplified by, say, lettuce. Soggy salad ain’t CGS.) This is to say that, in the context of the CGS equation, a once-crispy substrate has a lot going for it even after that crunchiness is lost in a generosity of sauce. Right, and: sauce. More sauce, more better. Science!But, to me, CGS foods hold an appeal that transcends the technical—there is something grander, more existential, almost spiritual at play. To experience CGS is to experience process, to access a magical, ephemeral space between here and there, past and present, crispy and soggy. There is a beautiful tension that exists in this liminal space, one that reflects our own ecstatic human in between-ness—to have been born and know that we will die. To experience CGS is to come face to face with our own mortality and the way that we conduct ourselves in that context. To gaze upon a plate of chilaquiles is to stare into the void. Even the crispiest food will become soggy with time—so f&@ it, MORE SAUCE!*CGS is terrifying; CGS is liberating. To appreciate CGS in all its myriad forms is to let go, to cede control, to find the pleasure in the pain of existence and succumb to it wholly. That, my friends, is crispy-gone soggy. And it is everything.What? What do you think about when you eat chicken Parm?Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-27", "author": ["Condé Nast", "Amiel Stanek"]}