{"id": "4ce2dd17b077f38293ea875014e8bfce", "url": "https://www.bonappetit.com/story/no-bar-nyc", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "No Bar: Can New York’s Queer Nightlife Scene Feel at Home in a Hotel Chain? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCan New York’s Queer Nightlife Scene Feel at Home in a Hotel Chain?Helmed by nightlife-fixture and creative director Angela Dimayuga, No Bar at The Standard is one of the first gay bars inside a major hotel.By Priya KrishnaFebruary 22, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe gay bar isn’t what it used to be.In New York, at least, a scene recently dominated by drag nights and disco lights now includes roving dinner series like Queer Soup Night, POC-focused dance parties like Bubble_T and Papi Juice, and Brooklyn bars where you can get your astrological chart read, like Mood Ring—all seeking to make gay nightlife more diverse and inclusive. Meanwhile, traditional gay bars are struggling to survive, not because of lack of demand, but because of rising rents and high overhead costs. The spectrum of options has never been wider.It’s in this climate that No Bar at the Standard East Village opened on Wednesday, one of the first gay bars inside a major national hotel chain. The bar, located just adjacent to Narcissa, the hotel’s high-end restaurant, is aiming to be both a casual hangout and a night club, serving craft cocktails and fancy bar snacks. It’s also the first high-profile project by creative director and former Mission Chinese Food executive chef Angela Dimayuga, who came on board last year to oversee the Standard’s restaurants and programming. Dimayuga has long been a fixture in New York’s underground queer nightlife scene. In 2017, she launched a monthly roving party called Gush, which drew a diverse, primarily lesbian crowd. Now, with No Bar, she’s hoping to bring this subculture to a decidedly mainstream space.Instagram contentThis content can also be viewed on the site it originates from.New York’s first gay bars opened in the 1950s as a response to a social scene that effectively excluded gay people by law. These gay bars were intended to be safe havens, but they were largely owned and patronized by cisgender gay men, a trend that persisted in the gay nightlife community for decades.Oscar Nñ, the founder of Papi Juice, a monthly dance party started in 2013 catering to queer and trans people of color, says that most of the gay bars he visited when he moved to New York in 2011 still fit that description.“We weren’t feeling represented in any part of it, from the music to the vibes to our own beauty and body and skin color,” he says. “I love Madonna, but when I go out that is not all I want to hear.”Stevie Huynh, the co-founder of Bubble_T, a queer, Asian dance party founded in 2017, said that as an Asian man, he was a target of discrimination at gay bars.“There is this saying people will use in the apps: ‘no fats, no fems, no Asians,’ and that translated into parties,” he says. “It is still ingrained in mainstream gay culture.”Instagram contentThis content can also be viewed on the site it originates from.When Dimayuga moved to New York in 2006, she felt alienated by the lesbian bars she encountered. “I think people refer to The L Word a lot, but The L Word isn’t really my scene or my people,” she says. (The characters are primarily white and upper-class.) Other places she found were male-centered, not diverse enough, or simply too far away from where she lived.When Dimayuga took on her role at the Standard in 2018, she noticed that the hotel had plenty of great restaurants, but there were no venues  focused around “the programming and the people that make up the space.” She realized she could essentially recreate Gush in one of the most recognizable hotels in the city. “There’s an opportunity to go to a party maybe once a month,” she says. “But to have a fixed place where you can experience what folks experience in these smaller parties,” but in a more expansive setting, “is exciting to me.”“I brought Angela on board because I respect her vision and abilities,” says Amar Lalvani, CEO of Standard Hotels. “When she presented the idea, it clicked as a natural progression of our culture of openness and inclusivity...a way to connect with not just the LGBTQ community, but the downtown social community at large.”At No Bar, there will be rotating DJs, accessibly priced food like oysters and schmaltz popcorn, and cheekily named cocktails like the Feel the Beet, with vodka, lillet, beet shrub, and lemon (plus an optional five-dollar CBD boost). The décor is best described as “high-low”: cow prints mixed with silk, “buy 10 cocktails, get one free” cards, and rolling papers instead of branded matchbooks. There will be no cover for events, Dimayuga says, and she plans to partner with the Lower East Side Girls Club and Performance Space, a non-profit exhibition space.Instagram contentThis content can also be viewed on the site it originates from.She says the name “No Bar” is a reference to “No Holds Barred,” as in, “there are no rules here.” That said, it’s a hotel bar adjacent to an upscale restaurant in a gentrified neighborhood in New York, so perhaps the “no rules” part is more of a vibe than a reality. And it raises the question of whether Dimayuga can recreate a scene that's thrived in outer boroughs and pop-up spaces into a national hotel chain (albeit a very cool one). Corporate brands have frequently been called out for attempts at “inclusivity”—like stamping your cupcakes with rainbows, like Sweets by Chloe did last year during Pride month. And the Dalloway, a high-end vanity project on the Lower East Side opened by Kim Stolz of America's Next Top Model and Amanda Leigh Dunn of the reality show The Real L Word, closed within a year.Brenda Walsh, the owner of East Village gay bar Phoenix Bar, which just celebrated its twentieth anniversary, said she fears that a bar in a place like the Standard would lack the community feel of more casual, legacy spots like hers, focusing  on profits more than on the people it serves.“A lot of clubs do gay nights because that’s where the money is,” she says. “Some places are only in it for the money, with the high-end food and drinks.”But, as Dimayuga points out, she has spent plenty of time partying with and creating spaces for the very people she wants to patronize her bar. And she doesn’t think there is anything wrong with bringing this DIY scene to a fancy bar. “The Standard is a beautiful place, and we can lean into that,” she says.Huynh agrees. He says the setting of the Standard is exactly what is going to make No Bar effective.“Seeing people of color, queer people and knowing you are taken care of, and the sensibilities that you feel in a luxury space,” he says. “It is like a little wink—like I got you.”Dimayuga acknowledges that this place likely couldn’t have existed without events like Bubble_T and Papi Juice, which paved the way for a new kind of queer night life. She also argues that the hotel setting will allow for even greater diversity because it will draw more out-of-towners and people who may not head to Bushwick for a party. “It could be a 43-year-old woman from Texas that is staying here on a business trip, but maybe also some grandmas, your parents,” she says.“Over time, New York City has become more inclusive, so I think the way we are diversifying has changed,” she says. “Bars should now be more intergenerational, more diverse ethnically. That is the kind of environment I want to offer.”Explore Bon AppétitHealthyishangela dimayugaNew York CityBarsessayRead MoreLifestyleThis Diner Is a Queer Oasis in the California DesertBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Priya Krishna"]}