{"id": "4ceaf85825ce78fa035e3d247878a1f6", "url": "https://www.bonappetit.com/recipe/sweet-potato-cake-with-salted-cream-cheese-frosting", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Sweet Potato Cake With Salted Cream Cheese Frosting Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueSweet Potato Cake With Salted Cream Cheese FrostingBy Amanda MackOctober 20, 20204.2(47)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“During the holiday season, sweet potato is King!” says baker Amanda Mack, the owner of Crust by Mack in Baltimore. It stars in this deliciously moist cake, balanced with a hint of salted cream cheese frosting. Simple in design and traditional in flavor, this cake is ready for Thanksgivings of all sizes this year. If you prefer a less-sweet frosting, use 6 cups powdered sugar.IngredientsMakes one 9\"-diameter cakeCake1½lb. sweet potatoes (about 4 medium), scrubbedNonstick vegetable oil spray (for pans)3¼cups (374 g) cake flour, plus more for pans2tsp. baking powder1½tsp. ground cinnamon1tsp. ground nutmeg½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1½cups (300 g) granulated sugar1½cups (packed; 300 g) light brown sugar½cup (1 stick) unsalted butter, melted, slightly cooled7Tbsp. vegetable oil1Tbsp. vanilla extract5large eggs, room temperatureFrosting and assembly216-oz. packages full-fat cream cheese, room temperature1cup (2 sticks) salted butter, room temperature8cups (906 g) powdered sugar, sifted or whisked to remove lumps1Tbsp. vanilla extract¾tsp. Diamond Crystal or ½ tsp. Morton kosher saltLong orange zest strips (for serving; optional)PreparationCakeStep 1Cook sweet potatoes in a medium pot of boiling water, stirring occasionally, until a tester inserted into centers meets no resistance, 40–45 minutes. Drain and let sit until cool enough to handle. Remove skins, transfer flesh to a medium bowl, and mash with a potato masher or fork. Let cool.Step 2Preheat oven to 350°. Spray three 9\"-diameter cake pans with nonstick spray, then line bottoms with parchment paper rounds. Spray parchment and dust pans with flour, tapping out excess.Step 3Sift baking powder, cinnamon, nutmeg, salt, and 3¼ cups (374 g) cake flour into a large bowl (or just whisk to remove lumps). Combine granulated sugar, brown sugar, butter, oil, and vanilla in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium-high speed until light, fluffy, and no lumps remain, about 5 minutes.Step 4Add eggs to sweet potato purée and mix well. Scrape into sugar mixture and beat to combine, scraping down bowl as needed. Reduce speed to low and with motor running, gradually add dry ingredients; mix just until incorporated. Divide batter evenly among prepared pans. Bake until cakes are slightly risen, tops are set, and a tester inserted into the centers comes out clean, 25–30 minutes.Step 5Transfer pans to a wire rack and let cakes cool in pans 5 minutes. Run a small knife around edges of cakes and turn out onto racks. Remove parchment and let cool completely (rounded side down). Tightly wrap cakes individually in plastic and freeze until thoroughly chilled (this will make cakes easier to frost), about 2 hours.Frosting and assemblyStep 6Beat cream cheese and butter in the bowl of a stand mixer fitted with paddle attachment on high speed until smooth and creamy, about 1 minute. Add powdered sugar, vanilla, and salt and beat on low speed 30 seconds (place a kitchen towel over bowl to capture any puffs of sugar). Increase speed to high and beat frosting 2 minutes. It should be thick and creamy.Step 7Place a cake, right side up, on a large plate or cake stand. Spread one third of frosting on top. Set another cake on top and frost with half of remaining frosting. Repeat process with remaining cake and frosting. For the cleanest slices, chill 3 hours before slicing. Top with orange zest strips just before serving if desired.How would you rate Sweet Potato Cake With Salted Cream Cheese Frosting?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThis cake was a huge surprise hit! My grandson requested a special cake for his birthday and wanted something different. Everyone really enjoyed it. chocletdollMenifee3/2/2022I REALLY like this cake and made it for again for this Thanksgiving after trying it last year. I read others' reviews before making it the second time and they reminded me that I'd experiences similar issues with sweetness, denseness, and overabundance of icing. So, this year I used a variety of purple sweet potato that is known to be drier in texture, halved the icing recipe, and reduced the proportion of sugar in the icing. What a  CROWD PLEASER! The purple sweets made such a pretty violet cake! And the slightly sweet cream cheese icing was such a lovely complement to the sweet cake!HArtistPhilly, PA1/4/2022I’m tempted to not make this with one review saying it was a big sugar blob    Not that this would make a huge difference but it’s sifted icing sugar, not 8c of icing sugar then sift.   And as with flout don’t dip measuring c in storage canisters; again won’t be the right measurement.   I use a large spoon and lightly put in measuring cup.   Just a thought.  LaurieToronto, Ontario 11/12/2021The cake itself was decadent, rich and tasty. I definitely would make this recipe again. However- I agree with everyone else that there was WAY too much sugar in the frosting- it gave us a headache after eating it! I'd definitely drop it down to 6 cups or even less. Sara L Salt Lake City UT12/4/2020Important question. ACTUAL sweet potatoes or yams? I made it with sweet potatoes and it was awesome — lots of satisfied eaters. Did anyone use yams? How is it? I also halved the frosting and it was plenty to cover the whole cake. SLC EBSalt Lake City12/2/2020I was so excited to make this!  But I also did something wrong - it was NOT cakelike!   Its so dense in a congealed way.  Keeping it in the fridge gives it a better taste.  The frosting was wonderful - but I disappointed many by not bringing a cake to Thanksgiving Dinner.Island BakerHilton Head, SC12/1/2020This was a huge hit for Thanksgiving.  Will probably supplant the dinner rolls my family had insisted I make for several years.\n\nAs others have noted, the proportion of frosting is way out of line with the recipe.  I used the reduced sugar variant and wound up with enough frosting, not just for the layers and pictured, but also for the sides of the cake, and I still wound up with enough frosting for another cake (currently in my freezer, hoping it thaws well).  You can easily cut this recipe in half without running short of frosting.Dan11/29/2020I made this exactly as directed and it was delicious - not to mention a visual showstopper. Not too sweet, just a hint of that unique sweet potato flavor combined with warm fall spices and the cool tang of the cream cheese frosting.  In fact, it was requested by my son’s girlfriend for her birthday cake in February.  I agree with everyone that the frosting made double what you could possibly use, so I packed up half of it, popped it in the freezer, and hope it will last until then.  If not, I’ll make a fresh batch, at half scale. JulieCarmel, Indiana11/28/2020Made this for Thanksgiving and I followed the recipe exactly. It was delicious! I'll definitely make it every year.EboniBrooklyn, NY11/28/2020I think I must have really messed up because this cake was almost inedible-- so dense and not at all cake-like. The frosting, however, was delicious. AnonymousWashington DC11/27/2020As everyone else has said, this makes way too much frosting to frost as shown, and the frosting has an insane amount of sugar as written.  I measured out 6 cups of powdered sugar and after I dumped it in, saw how MUCH it was, so removed as much as I could before mixing.  After mixing that, I tasted it, and added a little more until it was just a little sweet.  I'd guess it was around 2 or 3 cups altogether.  That being said, the cake itself was also incredibly sweet, so the total dessert was just a giant blob of sweetness.  Had I realized that cake would basically taste like a sweet cake, I would have left the frosting with less sugar to balance it a bit more.  I put one cup of frosting between each layer, and had leftover frosting even after doing a crumb layer and frosting the entire outside of the cake extremely thickly.  If I were to make it again, I'd put 1.5 cups between each layer.  That being said, I had expected this to have a pumpkiny or spicy taste, but it was just sweet sweet sweet.  While pretty, I'd have to change the spices significantly to make it taste decent, so wouldn't make it again.  Sage CinnamonPortland, OR11/27/2020Wonderful recipe! We halved the frosting and did sugar to taste - rather than doing 4 cups of powdered sugar we did 2 1/3 cups - which was great. AnonymousMammoth Lakes, CA11/27/2020For better or worse, this cake turns out very dense. I wondered if I did something wrong at first, but then I checked the comments and it looks like others had the same issue. I baked it for 30 minutes but it still looked underbaked. I would describe the texture almost like pumpkin pie but more congealed. Definitely not cake-like.TajPhiladelphia, PA11/26/2020Half the frosting recipe!  I ended up with a RIDICULOUS amount of leftover frosting.  We haven't tasted the cake yet.  It will be our only dessert tomorrow after Thanksgiving dinner.  Fingers crossed.  MaggieSonoma, CA11/26/2020I made this cake for a friendly birthday-bakeoff with a few modifications to make 2 layers instead of 3: simply do 2/3 of everything for the cake and 1/2 of everything for the frosting (I still ended up with way too much frosting). Finally, I added half a teaspoon of orange extract to the frosting to help bring out the zest.\n\nGreat reception on the flavor of everything. However, being an amateur baker, I thought I could get away without owning a stand mixer or hand mixer, and blended the cake batter in my Vitamix. I will say it blended it extremely finely and the resulting batter was very smooth. However, the bake was extremely dense – whoops! – and I think I invented a new type of cake that I was not personally a fan of. No doubt the sweet potato puree contributed to this. Will give it a try again with a stand mixer to experience the true texture and crumb intended by the recipe.JordanPhoenix11/16/2020Explore Bon AppétitCakeDessertSweet PotatoPotatoVegetableCream CheeseCheeseFallSnackNut-FreeBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Amanda Mack"]}