{"id": "4cf82b9172bebfdbb826d3c7d2fd64d4", "url": "https://www.bonappetit.com/recipe/yellow-curry-chicken-with-vegetables", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Yellow Curry Chicken With Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesYellow Curry Chicken With VegetablesBy Meherwan IraniSeptember 20, 20214.3(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis comforting curry with spiced chicken and tender potatoes and carrots makes a regular appearance at chef Meherwan Irani’s dinner table. At home, he likes to make double or triple batches of the coconut milk curry (see his recipe for All-Purpose Coconut Curry here) and freeze it in two-cup portions. Then, when he’s ready for dinner, all he has to do is briefly marinate, then sear pieces of boneless skinless chicken thighs, boil the vegetables, and reheat the curry. If you want to prepare this recipe with premade curry, bring two cups curry to a gentle simmer in a saucepan over medium-low heat, then add the seared chicken and cooked vegetables to the pan and simmer until the chicken is cooked through.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonIngredients4 servingsChicken1½lb. skinless, boneless chicken thighs, cut into 2\" pieces1garlic clove, finely grated11\" piece ginger, peeled, finely grated1tsp. fresh lemon juice1tsp. garam masala1tsp. Kashmiri chile powder or ½ tsp. cayenne pepper1tsp. Diamond Crystal or ½ Morton kosher salt½tsp. ground turmeric2Tbsp. grapeseed oil or vegetable oil, dividedCurry and AssemblyKosher salt1lb. Yukon Gold potatoes (about 3 medium), peeled, cut into 1\" pieces2medium carrots, peeled, cut into 1\" pieces3Tbsp. grapeseed oil or vegetable oil1tsp. brown mustard seeds3–4fresh or dried curry leaves (optional)½tsp. asafetida (optional)13\" piece ginger, peeled, finely grated5garlic cloves, finely grated1large red onion, chopped (about 2 cups)1tsp. ground turmeric114-oz. can crushed tomatoes113.5-oz. can unsweetened coconut milk (not low-fat), shaken well, ¼ cup reserved for serving1cup low-sodium vegetable or chicken brothCooked basmati rice, wild rice, or warm naan (for serving)PreparationChicken  Step 1Toss chicken, garlic, ginger, lemon juice, garam masala, Kashmiri chile powder, salt, turmeric, and 1 Tbsp. oil in a medium bowl to coat. Chill 30 minutes.Step 2Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Cook chicken until lightly browned, about 2 minutes per side (chicken won’t be cooked through). Transfer to a plate.Curry and AssemblyStep 3Cook potatoes and carrots in a medium pot of boiling salted water until just fork-tender, 12–15 minutes. Drain and set aside.Step 4Heat oil in a medium Dutch oven or other heavy pot over medium-high. Add a few mustard seeds. When seeds start to wiggle and pop, reduce heat to medium and add curry leaves (if using), asafetida (if using), and remaining mustard seeds. Cover pot and cook spices, swirling, until mustard seeds start popping more gradually, about 30 seconds. Uncover pot and return heat to medium-high. Add ginger and garlic and cook, stirring constantly, until beginning to brown, about 1 minute. Add red onion and a big pinch of salt and cook, stirring often and reducing heat if needed to prevent burning, until onion is golden brown and jammy, 7–9 minutes.Step 5Stir in turmeric, then tomatoes and bring to a simmer. Reduce heat to medium and cook, stirring often, until tomatoes are glossy and darkened in color and oil starts to separate around edges of pot, 5–7 minutes. Add coconut milk and broth and stir to combine; season with salt. Bring curry to a simmer, then reduce heat to medium-low. Cover and cook 10 minutes, stirring occasionally to prevent sticking.Step 6Add chicken and reserved potatoes and carrots to curry. Return to a simmer and cook, stirring occasionally, until chicken is cooked through, 5–7 minutes. Taste and season with more salt if needed.Step 7Divide among bowls. Drizzle with reserved coconut milk and top with cilantro. Serve with rice.Do ahead: Curry can be made 5 days ahead; let cool. Transfer to an airtight container and chill. Curry chicken can be made 3 days ahead; transfer to an airtight container and chill.How would you rate Yellow Curry Chicken With Vegetables?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleTook some time and,  but the heat was just right.  Didn't have gold potatoes,  red onions,  or mustard  seeds, so I used russet, yellow  onions,  and dried mustard.   Also used breast instead of thighs.  Came out  great.Charles  LChandler, AZ2/6/2022I often try to wing it with curries (I lived in India and always think I have a good feel for the food) but following this recipe, my curry was so much better. Not sure what it was, but the proportions of mustard seed, turmeric, lemon, etc must be spot on!HeatherPortland12/20/2021Fantastic. It works with baby yukon gold potatoes too, just make sure you boil them a bit longer.Kelas11/5/2021Absolutely delicious. A new favorite of kids and adults in my house. Takes a bit of time at the stove but well with it.Ray GrantBethesda, MD10/30/2021A splendid dish! The sauce is so good!AnonymousWisconsin 9/29/2021Explore Bon AppétitCurryCoconutFruitPotatoVegetableChickenPoultryDinnerRiceRice & GrainsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-19", "author": ["Condé Nast", "Meherwan Irani"]}