{"id": "4cfa23bd63297e9730fcee8b3994caf0", "url": "https://www.bonappetit.com/story/home-gym", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "My Home Gym Set Up Is Totally Doable To Replicate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Made a Home Gym on a BudgetI call it my DIY-MCABy Alex BeggsJanuary 25, 2021FacebookTwitterEmailIllustration by Marisol MuroFacebookTwitterEmailThis article is part of Healthyish at Home, our expert-sourced guide to making our living spaces feel great.Welcome to my basement gym! To the left I gaze upon the litterbox and dirty laundry pile. The ceiling is low, the concrete floor uneven, and the temperature COLD. Spiders seem to be laughing at me from their webs, which are freaking everywhere. But hey, I’m down here, doing the thing.I used to go to the YMCA on a set schedule; I had a favorite locker and bike and water bottle. I’d spin for a half hour and steam my worries away for 20. Since last March, though, I’ve slowly built my home YMCA—which is missing the locker room gossip (like “when did sweaters get so long!”), the giveaway bookshelf with a rotating array of VHS, and my spin friend, Dan—but it works.Now I’ve got my own low-budget “gym” without the commute/risk of COVID infection. Plus, it gives me reason to shower. Here’s how I did it.Illustration by Marisol MuroEquipmentI bought a Schwinn IC3 stationary bike on sale at Dick’s Sporting Goods because I’m not ready to go into debt for a Peloton (though I can’t figure out how to get it to stop squeaking). Then I picked up some pandemic-surge -priced eight-pound dumbbells. I stacked up stolen sweat towels from the country’s finest Hampton Inns. Dented Bluetooth speaker, yoga mat…check. Instead of the steam room, I steam up my shower. Instead of the locker room gossip, I think about what’s for lunch and where my life is headed. I named a spider on the stairwell Dan (sorry, Dan).Illustration by Marisol MuroWorkoutsThere’s so much on YouTube, but I love Aaptiv spin classes with John (“live your truth and eat your broccoli”), and the Cindy Crawford workout tape from 1992 where she does crunches in jean cutoffs, leg swings on a rooftop, and has her squat form assessed by “fitness expert Radu.” But I decided that any movement counts as going to the gym now, and switching it up keeps things from getting boring in these very repetitive times. Some days I spin for 15 minutes, other days it’s a grueling 35, or a 45-minute yoga class. All of them count! I’m not training for anything other than a sedentary lifestyle. I’ll do bicep-only strength training for vanity. I do not, under any circumstances, jump. I like walking a loop around the neighborhood, checking out everyone’s new yard decor. Still haven’t figured out Pilates.Illustration by Marisol MuroMind GamesThe final piece of equipment everyone ready to work out from home needs is that little push button in your brain that decides I’m working out NOW. This is hard for me—and maybe a universal hurdle for homebound humankind— so I designated three “gym” days a week to be reasonable with myself. I also read that it helps to build a habit if you reward yourself for the workout, whether that’s with a granola scone, a post-workout nap, or a rerun of Sister, Sister. This is training your brain; it’s science. The good news is that this gym is open whenever you need it to be, and towel service is included.Explore Bon AppétitHealthyishHealthyish HomeessayRead MoreLifestyleHealthyish at Home: 7 Ways to Make Your Space Feel GreatBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Alex Beggs"]}