{"id": "4d0f9972577c7abb17c7d57c5d50cbda", "url": "https://www.bonappetit.com/story/best-flameless-candles", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Flameless Candles Are Terrible—Except For These Flameless Candles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingFake Candles Are Terrible—Except for These Fake CandlesThey flicker! They light up my life! They won’t burn your house down!By Hilary CadiganJuly 8, 2021FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I consider myself a candle expert. Go ahead, talk to me about wick trimming (¼ to ⅛ of an inch, every time you burn). Or tunneling (the first time you light a candle, let it burn until the entire top layer liquifies, to prevent that hole-in-the-center situation. And if it DOES start to tunnel because you didn’t heed this advice, put tin foil over the top, with a hole for the wick, to more evenly distribute heat and melt the offending wax walls.)Anyway, I light candles at dinner, during my Zoom dance meditations, and any time people are coming over and I need to pretend I change my cats’ litter box as often as one is supposed to. I love candles for the instant vibe they create, the way they transform my shitty apartment or unkempt back patio into a sexy flickering grotto, ready to seduce both my guests and my own fragile psyche into thinking said space is much nicer than it actually is.But here’s the problem. Or rather, the problems. Candles are expensive. They constantly need replacing. They drip wax everywhere. They release tiny particles into the air that, en masse, aren’t exactly great for your cardiovascular and respiratory health. They put you at risk of burning down your own house. And, when a cat drags his tail through one, it’s a situation.All these issues didn’t exactly deter me from my candle habit, but they did have me seeking possible alternatives to the real thing. Which led me to an additional problem: Fake candles mostly sucked. Like those horrible little white plastic hockey pucks with that sad, frozen facsimile of flame that give off very little light and absolutely no flicker. If these were fake candles, forget it, I'd take my chances with a singed cat tail.Then, during a cabin weekend upstate a few months ago, my friend Paco whipped out a box. “I have a surprise,” he said. “And it’s a very good one.”Out of the box he pulled three white wax cylinders of varying heights. He placed them around the room and pulled out a tiny remote control. Then, with a flourish, he pointed it like a magic wand at each of the candles in turn. And one by one—behold!—each cylinder lit up with a flickering brilliance that looked…well, exactly like a real candle. Had I not seen with my own eyes the wizardly way in which they burst into light at the press of a button, I would have been sure they were real.Waterproof Flickering Flameless Candles$30 $23 at AmazonThe secret behind these magic faux candles is their little moving wicks: a piece of plastic lit from below and loosely balanced on a thin wire so it waves around at random like a real flame. It sounds janky, I know, and the photo that accompanies this article isn’t exactly strengthening my case, but put these ladies in a dark room and prepare to be amazed. They’re battery-operated (opt for rechargeable to keep it sustainable) and will give you 500+ hours of light on a single pair of AAs. You can even adjust the brightness and flicker level by remote.Best of all, they’re waterproof, which, in addition to the fact that they won’t start a forest fire, makes them especially useful for outdoor events (weddings! picnics! the pool party I’ll be hosting soon to celebrate the arrival of my 2-to-4-person inflatable hot tub!). And because they’re less than $20 for a set of three, I can buy many for the cost of a single expensive real candle, getting me closer and closer to recreating that scene at the end of the Baz Lurhmann version of Romeo+Juliet, minus the death part. What vibes!And sure, these candles will not burn away the shameful smell of a less-than-fresh litter box. But they also won’t explode wax all over you and your cat when he knocks them, and himself, into the bathtub while you’re trying to have a romantic night at home alone. Nor will they light his tail on fire, even if he deserves it.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-08", "author": ["Condé Nast", "Hilary Cadigan"]}