{"id": "4d3a7769c74412fe2e6c94f58f814dab", "url": "https://www.bonappetit.com/recipe/allium-confit", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Allium Confit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueAllium ConfitBy Maricela VegaJanuary 12, 20215.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintAlliums thrive in the South almost year-round and are available as a storage crop when not in the ground. Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora, likes to confit them in oil, a simple technique that creates fatty-rich full-on flavor. Garlic, leeks, and chives are all you need to make this savory infused oil, great on its own or as a base for just about any sauce or dressing—including this pumpkin hot sauce.IngredientsMakes about 4½ cups1large bunch of chives, coarsely chopped (about ½ cup)1large leek, white and pale green parts only, coarsely chopped1½cups coarsely chopped green garlic or whole garlic cloves4cups vegetable oilPreparationStep 1Bring chives, leek, green garlic, and oil to a simmer in a large saucepan over medium heat (this will take some time—be patient!) and cook 2 minutes. Let cool (alliums will soften and finish cooking as they sit).Step 2Transfer to an airtight container; cover and chill.Step 3Do ahead: Alliums can be cooked 1 week ahead. Keep chilled.How would you rate Allium Confit?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentGarlicVegetableChiveHerbs & SpicesEasyGluten-FreeDairy-FreeVeganVegetarianNut-FreeHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}