{"id": "4d5b944458e82823099e3e7233c8ac70", "url": "https://www.bonappetit.com/recipe/creamy-shrimp-risotto-with-mascarpone", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Creamy Shrimp Risotto  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueCreamy Shrimp Risotto with MascarponeBy Claire SaffitzFebruary 13, 20184.9(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you can’t find head-on shrimp for this risotto recipe, buy an extra 8 oz. large shell-on shrimp and add to the stock along with the shells from the initial pound.Ingredients4 servings4Tbsp. extra-virgin olive oil, divided1lb. head-on shrimp, shells and heads removed and reserved, shrimp cut into 1\" pieces2Tbsp. tomato paste⅔cup dry white wine, divided1medium carrot, scrubbed, halved crosswise1celery stalk, halved crosswise6large sprigs thyme1tsp. whole black peppercorns2large onions, peeled, halved through root end, divided1head of garlic, cloves separated, peeled, dividedKosher salt1½cups arborio riceFreshly ground black pepper1lemon2Tbsp. unsalted butter6oz. mascarpone, room temperature, divided2Tbsp. thinly sliced chivesPreparationStep 1Heat 2 Tbsp. oil in a large saucepan over medium-high. Add shrimp heads and shells and cook, stirring occasionally, until shells and oil are bright red and shells are very fragrant, 5–8 minutes. Use a potato masher to press down very firmly on heads to release their juices. Stir in tomato paste and cook until it starts to brown and stick to bottom of pot, about 1 minute. Add ⅓ cup wine and cook, scraping up brown bits, until almost completely evaporated, about 3 minutes. Add carrot, celery, thyme sprigs, peppercorns, 2 onion halves, all but 4 garlic cloves, and 8 cups water. Toss in a generous pinch of salt and bring to a boil over medium-high. Reduce heat and simmer until stock is reduced by one-quarter and very fragrant, 60–70 minutes.Step 2While stock is simmering, finely chop remaining onion and garlic cloves.Step 3Remove stock from heat and strain through a fine-mesh sieve into a medium saucepan; discard solids. (You should have about 6 cups.) Taste and season lightly with salt. Keep warm over low heat.Step 4Heat remaining 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Add chopped onion and garlic and cook, stirring often, until onion is translucent and softened, about 5 minutes (do not let it take on any color). Add rice and cook, stirring often, until grains are almost entirely translucent and starting to stick to bottom of pot, about 3 minutes. Stir in remaining ⅓ cup wine and cook, stirring, until wine is almost completely evaporated. Ladle in about 1 cup warm stock and cook, stirring, until liquid is absorbed. Repeat process, adding more stock as each addition is absorbed, until rice is tender but not mushy, 25–30 minutes. The risotto should be loose, creamy, and saucy, but thick enough that you can see bottom of pot when stirring; if you run out of stock before rice is tender, add water ¼-cupful at a time until rice is cooked and desired consistency is achieved. Season risotto with salt and pepper and stir in shrimp. Cook, stirring, until shrimp are cooked through, about 2 minutes. Remove from heat and finely grate in lemon zest. Add butter and 4 oz. mascarpone and stir until incorporated.Step 5Spoon risotto onto warmed plates and dollop remaining mascarpone; top with chives. Cut lemon into wedges and serve alongside for squeezing over.Step 6Do Ahead: Stock can be made 2 days ahead. Let cool; cover and chill, or freeze 1 month ahead.How would you rate Creamy Shrimp Risotto with Mascarpone?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI made this for our New Year’s Eve dinner.  I found head-on shrimp at Costco and made the stock a day ahead.  It was delicious and indulgent.  The lemon zest is a must.  VickyMedia PA1/2/2022I am no chef but I made this recipe a year ago and it was one of the best things to have ever come out of my kitchen.  Creamy and rich while aromatic and bright. Making it again tonight and am counting down the minutes until it is ready. Takes a few hours but god is it worth it.vburkeUSA6/29/2019Fantastic recipe, risotto comes out very rich and creamy with nice depth of flavor. Making the stock using head-on shrimp adds some effort, but the results are worth it.Anonymous6/24/2019Fabulous recipe! Huge hit with the family. Added a little parmesan bc when is it ever not appropriate to add parmesan?AnonymousGermany1/10/2019Explore Bon AppétitRisottoItalianEuropeanShrimpShellfishSeafoodMascarponeCheeseRiceRice & GrainsMainNut-FreeGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}