{"id": "4d613451bc7c33c49873913d8359cea6", "url": "https://www.bonappetit.com/story/nude-figure-drawing-in-isolation", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "How a Virtual Nude Figure Drawing Class Changed the Way I Think About Intimacy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureHow a Virtual Nude Drawing Class Changed the Way I Think About IntimacyA spirit of boldness led me to join the class, and I'm taking that attitude with me. By Grace KennedySeptember 2, 2020FacebookTwitterEmailIllustration by CépéFacebookTwitterEmailNew York City in March was, well, quiet. The typically raucous sounds of the city had been reduced to ambulance sirens and a lone car driving up and down the streets blasting “New York, New York” and “Empire State of Mind.” The weather was cold, the news was ominous, and I was lonely. So, for about two months, I logged on to Zoom every Monday night and prepared to get naked.My friend Talia started our virtual nude figure drawing group right after New York’s lockdown began as a way to break up the monotony of quarantine. Many figure drawing classes bring in professional models, but Talia wanted everyone in class to draw and pose. In normal times I may have hesitated, but the strangeness of quarantine had made me bold. Maybe I’d discover a latent talent! Mostly I wanted to see my friends.On the evening of our first class, I logged on to Zoom with my pen, paper, and wine at the ready. Talia started us off with a series of one-minute poses to get our hands warmed up. We then moved on to other “models,” who posed in increasing increments: three minutes, five minutes, then 10 minutes. I had signed up to pose for five minutes, and my heartbeat rose as others went before me. One friend took off her robe, lay backward on a chair, and flung her legs up. Another strategically fit her body into a door frame.When my turn came, I was no longer feeling quite so bold. I gingerly took off my clothing and lay on my bed diagonally. I crossed my legs, threw my arm over my shoulder, and tilted my chin up in a way that I do when I am trying to seem confident. And for five minutes I lay like that, trying to remember to breathe, unclench my jaw, and let my belly soften. My heart rate eventually slowed, the timer went off, and I sat back down to draw the next model.When the hour ended, I was surprised. While drawing, I’d somehow found the concentration that had eluded me since the start of quarantine—I had been singularly focused on capturing the curve of my friend’s hip and perfecting the shading under her propped up leg.After that first week, our group welcomed friends, friends of friends, and mothers of friends. The only requirement was that you were not a man, and we even considered doing away with that rule toward the end—why put any limits on a space that felt so open? Our numbers hovered around 15 to 20 people with some new and some old faces each week. The poses were playful, architectural, and cozy. We had props of cowboy hats and tulips, and backdrops of childhood bedrooms, candlelit libraries, and living rooms brightened by the California sun.Each week, we concluded the hour by sharing our work, basking in the display of our Botticelli Bodies (a term coined by my friend to remind us that 21st century beauty standards have not always been the norm). My drawings tended to resemble the pieces my mother proudly framed from my fifth-grade art class, but that was beside the point.At the height of New York’s lockdown in the spring, I had become numb to seeing my friends and family through a screen. I found myself FaceTiming less and less, exhausted by the prospect of highlighting just how far away we all were. Figure drawing was different. Our collective nudity was able to break through the screen more than any clothed conversation, bringing an intimacy that felt otherwise impossible to attain online. Somehow, Monday nights felt like the closest we could get to actually seeing each other.Now, with New York City tentatively reopening, I no longer need those Monday nights on Zoom to see some of my friends/classmates. We can gather “in real life”—albeit six feet apart and clothed. Our Zoom group has since disbanded, but I’ve kept a few of the drawings from class saved on my desktop. Looking at the images now, I am reminded of the spirit of boldness that led me to say yes to a nude figure drawing class in the first place.The solitude required by the pandemic forced me to rethink how I create and sustain connection in my life—to search out new avenues for intimacy when all the typical lanes had closed. And though I no longer disrobe every Monday night, I’d like to hold on to that attitude.When the city reopens in full, I hope my friends and I will revive our figure drawing group—this time huddled together in one of the candlelit living rooms we posed in alone back in March.Explore Bon AppétitHealthyishessayRead MoreLifestyleBurning Out on America...and My “Perfect” Wellness RoutineBy Rose Truesdale Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-02", "author": ["Condé Nast", "Grace Kennedy"]}