{"id": "4d82c9385425ddcc8d434094b7e8f2a1", "url": "https://www.bonappetit.com/recipe/cornbread-stuffing-with-sausage-and-corn-nuts", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Cornbread Stuffing  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueCornbread Stuffing With Sausage and Corn NutsBy Rick Martinez and Chris MoroccoOctober 16, 20214.9(48)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhether your family calls this cornbread stuffing or dressing, this recipe goes beyond the traditional, with heat from Thai chiles and an extra hit of corn flavor from corn nut magic dust. (We bloom the pulverized corn nuts like a spice to bring out all their earthy, funky, wonderful corniness.)There are distinct bites of toasted bread on top and an almost-but-not-quite-custardy interior. You can absolutely use store-bought cornbread, or this recipe we developed specifically intended for stuffing. If the stock pools in the dish when you pour it in, don’t panic, it will get absorbed in no time. This cornbread stuffing recipe can take a lot, absorbing tons of flavor and staying moist and vibrant, even when made as many as three days ahead. You can even use it to make stuffing fried rice with the leftovers like we did.See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Editor’s note: This recipe was originally published October 15, 2019.Ingredients8–10 servings3lb. cornbread, cut into ¾\" pieces (14–16 cups)1½lb. breakfast sausage, casings removed if needed1cup unsalted butter (2 sticks), plus more for pan2medium onions, chopped4celery stalks, choppedKosher salt3garlic cloves, finely chopped2Thai chiles or 1 jalapeño (with seeds), chopped¾cup corn nuts, finely ground in a food processor, blender, or mortar and pestle (about ½ cup)¾cup dry white wine1Tbsp. finely chopped sage2tsp. finely chopped thyme3large eggs3½cups turkey stock or low-sodium chicken brothFreshly ground black pepperPreparationStep 1Preheat oven to 325°. Divide cornbread evenly between 2 large rimmed baking sheets and bake, tossing occasionally, until dried out and lightly browned around the edges, 40–50 minutes. Let cool at least 10 minutes. Increase oven temperature to 350°.Step 2Meanwhile, cook sausage in a large skillet over medium-high heat, stirring and breaking up with a spoon, until lightly browned and cooked through, 6–8 minutes. Transfer to a plate.Step 3Reduce heat to medium and melt butter in same skillet. Add onions and celery; season with salt. Cook, stirring occasionally, until softened but not browned, 8–10 minutes. Add garlic and chiles. Cook, stirring once, until very fragrant, about 1 minute. Add corn nuts and cook, stirring often, until very fragrant and vegetables are starting to brown around the edges, about 3 minutes. Add wine and cook, stirring occasionally, until almost completely evaporated, about 3 minutes. Add sage and thyme and toss to combine. Remove from heat.Step 4Combine cornbread, sausage, and vegetable mixture in a large bowl. Whisk eggs and stock in a medium bowl until very well combined. Pour over cornbread mixture and let sit, gently stirring every minute or so, until cornbread has absorbed all or virtually all of the liquid. Season with salt and pepper (about 1 Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt).Step 5Lightly butter a 3-qt. or 13x9x2\" baking dish. Transfer stuffing to dish and tap dish lightly against counter to distribute and compact stuffing. Cover tightly with foil and bake until stuffing is very hot throughout and bubbles appear around sides, 40–45 minutes. Increase oven temperature to 425° and remove foil. Continue to bake stuffing until top is lightly browned, 15–20 minutes longer.Step 6Do Ahead: Stuffing can be baked at 350° 3 days ahead. Let cool, then chill. Reheat in a 350° oven before increasing temperature to 425° and removing foil.How would you rate Cornbread Stuffing With Sausage and Corn Nuts?Leave a ReviewTell us what you thinkReviews (36)Back to TopTriangleI have been using this recipe for the past three years at my family’s thanksgiving and it’s always been a hit. I have noticed since making it that using sweet cornbread is really the way to go with this recipe, I find that sweetness blends really well with the other ingredients. I also don’t add the corn nuts and Chile since my younger family members don’t like spicy foods and the corn nuts make it to crunchy. Overall this recipe is really good and this is just my take on it, but I think it makes it even better. AnonymousMassachusetts 11/24/2021Good, not incredible, but I also made a few mistakes so it could be my bad. But at least the recipe is forgiving. Leaving a review to answer some questions / give my experience on some issues others described below:\n- I halved the recipe but I accidentally used the full recommended amount of salt (1 tbsp). Surprisingly I thought the saltiness level was perfect, not too salty at all. I have a salty palate, but even so would recommend generously seasoning throughout so that the 1tbsp at the end is the right amount and doubling it would actually be a mistake. 1 thai chili (after halving, that's the full amount) was slightly too spicy for me, but chiles do tend regionally to vary so maybe mine was on the spicy side?\n\n- To the person who asked if the recipe could be done with less butter: I literally forgot to add the butter and it was fine. I cooked the onion and celery only in the sausage fat (I used a standard pork breakfast sausage from Whole Foods, since the recipe doesn't specify what type of meat and in the vid they make homemade pork sausage). The vegetables browned a lot faster and the corn nuts powdered stuck to the pan basically right away and thus probably didn't toast enough, but it wasn't a huge setback. I only realized I forgot to add the butter only after mixing everything (stock, cornbread, etc). I melted about 1/2 of the butter needed (which because I halved the recipe was 1/2 a stick) and mixed it right into the mixture. I bet things would have tasted better if they were cooked in butter, but it didn't seem to affect the texture at all because the end result was not dry or bland or anything. Given this, I think you can easily half the amount of butter.\n\n- Texture was the textbook stuffing texture, soft but distinct cubes on the inside, nice crispy top. It was not dry or mushy at all, which I've heard are the two extremes of cornbread stuffing. I used a 1/4 recipe of BA's cornbread recipe (linked above), and about a 1/2 recipe of Claire Saffitz's brown butter corn muffins from her book. That was about 1.5 lb cornbread, which wasn't too much or too little, as I've seen reviews before mention (one said they had too much cornbread, another said they needed more). I found BA's cornbread on its own INCREDIBLY bland, but in stuffing it wasn't noticeable. Claire's muffins are delicious on their own, but so soft/tender they were hard to cut up, and they were pretty sweet for a stuffing base, but I liked the pops of sweetness and the fresh corn, so would not discourage people using a sweeter cornbread and/or one with fresh corn.AnonymousLos Angeles, California11/30/2020So the recipe came out delicious. But a lot of the instruction are very vague. First off the cornbread should be already be made when starting this recipe. Second you should cut your cornbread into pretty big square pieces before baking because it will break apart as you are tossing it around while baking it again to get it crisp. The corn bread needs to be pretty crispy and golden  almost dried out before mixing everything together so it can soak up all the liquid. I think you could add a little more stock to the mixture as well. But came out very delicious full of flavor. MarkDallas, TX11/26/2020I've never been much of a stuffing person but I've always wanted to like it. With this recipe, now I LOVE it!\nThe flavors are just incredible in this recipe. It's everything you would want out of a decadent Thanksgiving side dish. I made it last year and have already had multiple requests from family to do it again. This is a new Thanksgiving staple in our house!AnonymousBoynton Beach, FL11/24/2020I must've done something wrong, because I did NOT love this. It was thoroughly \"meh\". The bread turned into complete mush and it was kind of tasteless. I typically LOVE Bon Appetit recipes but this one ... ugh. I might have to re-make it based on all the great reviews here!RachLowDetroit, MI11/16/2020I've been wanting to make this recipe ever since seeing the \"Making Perfect\" series. This truly blew my socks off.\n\nThe recipe has a lot of small parts working together, but the greatest ones are the homemade sausage and the chili oil. These have been the two takeaways that I consisntently make, even when they are not going into this recipe.Simmered_Downsimmereddown.com5/4/2020As soon as my husband saw this recipe in the video, he HAD to make it, and man, am I glad he did!  This recipe has quite a few steps, but the effort is well worth it in the end.  I've personally never really enjoyed corn bread stuffing, as the few I've had have been so dry and flavorless.  BUT.  This stuffing has reformed me.  It had such a depth of flavor, a wonderful texture, and it has been months since we made it and I still think about it.  I'm really looking forward to making this again!  nowinlivingcolorSacramento, CA3/30/2020Worth it. Love the texture and all the flavors that come through.ohmystarsNew York, NY12/9/2019This was delicious.  Huge hit with the family.  I added more chilis and had no complaints on heat. Went with the homemade cornbread.  For this recipe, I did 1.5x batch of the cornbread. \nI prepped it ahead of time and reheated on the day - some parts got a bit burnt on top,  so I'll watch for that next time.AnonymousCosta Mesa,  CA12/6/2019Lived for this take on stuffing. The cornbread was my favorite and the flavor hit all the right notes. I couldn’t find corn nuts (live out of the country), but want to try that texture out next time I make it.EnoughpotentialNorway12/5/2019Made this for my thanksgiving yesterday. Did it a couple days ahead of time like it said. Cooked and cooled well. When it came time for reheating, it still never came up to temp despite being in the oven over 2 hours, so that was weird. We all also noticed that when we were eating it, it smelled/tasted like it had giblets in it (which it didn't obviously) and we were kinda turned off by that. Deduced it was likely the wine for some reason. If I make it again, it'll be without the wine and only half the sizeAnonymousUS12/3/2019I have relatives who can't eat spicy foods at all and I personally prefer a sweeter stuffing so I replaced the jalepeños & chiles with golden raisins and replaced the corn nuts with toasted pine nuts. Everything else, I used the exact recipe. Absolutely delicious 😋 it was the best thing on the table this year.Philly PhillyPhiladelphia12/2/20195 stars. Couldn't find corn nuts in Georgia though, so I just skipped that part. It came out amazing, still! Definitely making this again. AnonymousGeorgia 12/1/2019this was stupid good. i never cared for stuffing, this was my favorite thing i ate this thanksgiving. i can’t stop eating the leftovers. my sister and i ate it with fried eggs for breakfast, we toasted some and used it for croutons in a salad. it’s an excellent recipe. Anonymousbrooklyn, ny12/1/2019We loved this recipe.  Pretty much followed the instructions, but we used corn bread mix (3 boxes).  Next year, I'll make my own corn bread, but this recipe will become a staple.eaglesfanintnMt. Juliet, TN11/30/2019Explore Bon AppétitStuffingAmericanSausageMeatSideNut-FreeThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Rick Martinez", "Chris Morocco"]}