{"id": "4d92b66f63b70c4ceab2a5d1e87d10cd", "url": "https://www.bonappetit.com/recipe/iced-cafe-de-olla", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Iced Café de Olla Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueIced Café de OllaBy Rick MartinezAugust 18, 20204.9(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Rick MartinezEmailPinterestPrintEmailPinterestPrint“I love the flavor of orange zest and spices in a café de olla,” says Rick Martinez, who was working on his cookbook on regional Mexican food while quarantining in Mazatlán, a city on the Pacific Coast of Mexico. “So I created a concentrated syrup that is ready on demand to flavor any cold brew. Use coconut milk to add richness and even more tropical flavor.”IngredientsMakes 5-8¾cup grated piloncillo or (packed) dark brown sugar13\" canela or cinnamon stick5cardamom pods, cracked5allspice berries1tsp. black peppercornsPinch of kosher salt3wide strips orange zest5–8cups cold-brew coffeeUnsweetened coconut milk or half-and-half (for serving)PreparationStep 1Bring piloncillo, canela, cardamom, allspice, peppercorns, salt, and 1 cup water to a boil in a small saucepan. Reduce heat, cover, and simmer 15 minutes. Add orange zest; let cool.Step 2Strain spiced syrup through a fine-mesh sieve into a measuring glass; discard spices. (You should have about 1 cup.)Step 3To make 1 drink, pour 1 cup cold-brew coffee into an ice-filled glass. Stir in 2–3 Tbsp. spiced syrup; top with 2–3 Tbsp. coconut milk.Step 4Do ahead: Syrup can be made 1 week ahead. Cover and chill.How would you rate Iced Café de Olla?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleFantastic flavors. Steve7/11/2021This was so amazing. I don't even like sweet coffee drinks, but this was my favorite drink of the year!bluesweaterSan Diego10/4/2020Oh man - this is perfection!  I will be making this syrup weekly.  Perfect balance of sweetness and spice with a hint of citrus.  I love it!AnonymousMelbourne10/1/2020Explore Bon AppétitCold DrinkDrinks AllMexicanLatin AmericanCoffeeAlcohol & Other DrinksCinnamonHerbs & SpicesCardamomOrangeCitrusFruitDrinksNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}