{"id": "4da06527e5aa21d47d19106c01d8a47a", "url": "https://www.bonappetit.com/story/food-people-best-of-s1", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "'Food People,' Bon Appétit's Podcast: The Most Mouthwatering Episodes From the First Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Most Mouthwatering Episodes From Food People’s First SeasonThe best way to grill a chicken, why air fryers are worth the hype, how a Bon Appétit issue gets made, and more.By Nico AvalleFebruary 18, 2022FacebookTwitterEmailFacebookTwitterEmailIt’s a wrap: The Bon Appétit team just finished the first season of our podcast Food People, a weekly show made by, for, and about people who love food. We’ve covered a lot of ground: the complications of opening a restaurant during the pandemic, debates over dinner parties, and rom-com-level meet-cutes over meals. The world of food offers plenty of hot topics and even more interesting people to talk us through them.Now, at the end of the season, we've put together a few of our favorite episodes. In each one host Amanda Shapiro chats with BA staffers, celebrity chefs, food influencers, and more food people, all of whom are obsessed with all things delicious. If you’re new here, think of it as a starter pack. Otherwise, use it as a walk down the memory lane to sate your appetite while you wait for more tasty conversations.What’s the best way to grill a chicken?In Food People’s first episode, we go all in on grilled chicken. Food editors Andy Baraghani and Jessie YuChen come in hot with juicy tips, spicy takes, and enough humor to keep this poultry-focused episode from drying out.ContentThis content can also be viewed on the site it originates from.What does “healthy eating” even mean?Joined by senior food editor Christina Chaey, Shapiro focuses this episode on diet culture. The two dive deep on New Year’s resolutions, health trends, and the recipes that are redefining what “healthyish” means to them in 2022. Come for the insider insights, stay for the noodle-making tips.ContentThis content can also be viewed on the site it originates from.Are air fryers just a bunch of hot air?Whenever a new, buzzy kitchen appliance hits the scene, BA staffers are usually…skeptical. But contributor Alex Beggs’s love for the air fryer is no joke. She’s reviewed the best types for our website, dropped countless convection-friendly Trader Joe’s snack hacks for us, and in this episode, hopped on a soap box to explain why this cooking tool is worth the hype. If you can make it through without ordering your own, you are stronger than two thirds of our team.ContentThis content can also be viewed on the site it originates from.Is the martini the best cocktail of all time?Listening to a good podcast feels like catching up with a few friends over drinks, which allegedly was exactly how this episode was recorded. Shapiro, Beggs, and Chaey are joined by BA contributor Amiel Stanek for a discussion on the most iconic yet divisive cocktail of all time: the martini. Listen in for pub trivia, some fierce olive opinions, and a healthy dose of cocktail shaker ASMR. Don’t forget to stir one up for yourself.ContentThis content can also be viewed on the site it originates from.Why are pop-ups popping off?Even before the pandemic, pop-up dining experiences had us reconsidering what it really meant to be a restaurant. With the help of Los Angeles–based pop-up owners Rashida Holmes and Brandon Gray, this episode takes you inside their world as they share the promises and challenges they found along the way.ContentThis content can also be viewed on the site it originates from.What happens when you use TikTok to cook?For some of our editors, TikTok seems…perplexing. Others, like Bettina Makalintal and Zaynab Issa, are longtime contributors on the app. But FoodTok fans and skeptics alike ask the same question: Are any of these viral, camera-ready recipes actually any good? To find out, Chaey and BA’s head of video June Kim spent a day cooking the algorithm’s most popular recipes for breakfast, lunch, and dinner. Whether you’re on the app or not, this episode offers a glimpse at what’s going on within one the most hyped spaces in the food world, and whether it’s worth peeking in.ContentThis content can also be viewed on the site it originates from.Why are people obsessed with Trader Joe’s?If you like Trader Joe’s, odds are that you really like Trader Joe’s. Sure, plenty of supermarkets have devotees (shout out to the Publix sandwich stans), but few of them match the cult status achieved by TJ’s. To figure out how America’s quirkiest grocery chain did it, Shapiro and Beggs break down what sets it apart. The result is a blend of business chat and goofy fun that’ll feel familiar to fans of Planet Money, with a focus on food and wealth of culinary knowledge that’s distinctly Bon Appétit.ContentThis content can also be viewed on the site it originates from.How does a Bon Appétit issue get made?The season finale is for the BA stans out there, pulling the curtain back on Bon Appétit’s editorial process. You’ll hear a real pitch meeting, a conversation with recipe developer Asha Loupy on how she takes a dish from idea to execution, and insights from food director Chris Morocco. It’s a rare look at how we get a story idea from an editor’s imagination to readers’ screens. And it’s 30-plus minutes of absolute nerds geeking out over food—and if that’s not your thing, well, I don’t know why you’re here.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitCulturePodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-18", "author": ["Condé Nast", "Nico Avalle"]}