{"id": "4da9bc98ea3453c02e07b34314480bd1", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/tonki-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Tonki Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoTonkiDeep-fried pork cutlets, with no frills or fussFacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for a taste of what Tokyo used to be. In the 79 years that Tonki has been in operation, very little has changed. While tonkatsu has certainly evolved a great deal in the last eight decades, here the recipe is the same, and flavors are simple, meaty, and comforting. Dinner at Tonki is a trip home, even if you’ve never been to here before.ORDER THE: rosu katsu  (sirloin), for a thick, fatty cut, or the hire katsu (tenderloin) for a leaner flavor. Everything comes with rice, pickles, and tonjiru (a pork and miso soup). They will ask for your order as soon as you walk in, so just tell them what you want and find a seat while you wait. Watching a kitchen this old and practiced is a theater unto itself.THE VIBE IS: an Ozu film you can eat. Even though it’s minimal in aesthetic, the shop drips with the history of the generations of Tokyoites that have dined here. It’s a place of family dinners, devoted regulars, and stories still being told.PRACTICAL STUFF: Open Wednesday to Monday from 4 p.m. to 10:45 p.m. Closed on Tuesdays, and the third Monday of the month. The staff does not speak any English, but an English menu is available with the basics. The nearest subway station is Meguro.Photo by Xavier Girard LachaîneGenerations of Tokyoites have eaten at Tonki in its 79 years.\nPhoto by Xavier Girard LachaîneThe best seats in the house have a view of the masterfully-moving kitchen.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}