{"id": "4dbcc5cb29ec85ed7163c72f3260e045", "url": "https://www.bonappetit.com/story/running-demons", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "I Run to Silence My Demons | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Run to Silence My DemonsHow a simple exercise, repeated, nudges me from the abyss.By Sandy AllenJuly 10, 2018FacebookTwitterEmailIllustration by Karl-Joel LarssonFacebookTwitterEmailI am not a good runner. I can’t go very long. I stop when I’m tired. I don’t stretch before or after; I’m sure that’s bad. My form is probably wrong. People have told me how to run the right way before, but I haven’t remembered.I don’t calculate my distance. I’m guessing I do two or three miles, about 30 minutes. This is one of the many reasons I prefer running outside to running on treadmills: I don’t want to see stats on a display. I’m someone whose head monologues all the time about how I’m terrible. A good strategy, I’ve found, is depriving myself of information like numbers. It’s been a long time since I owned a scale.A few months ago I realized it had been years since I bought new running shoes. That, I know, is bad, running for years on old shoes. I was on the road and found a running store not far from where I was staying.A salesperson asked if I was there to pick up a marathon bag. I said I was there to buy shoes. He had me walk on a treadmill, then showed me footage of my stride.“You training for something?” he look at his clipboard, “Or you just want to stay fit and active?”I didn’t answer honestly. I didn’t explain about my head, what it’s like to live inside it, and how running is one of the small things I’ve figured out to do to keep myself okay.“I…just want to stay fit and active,” I replied, figuring it wasn’t the time or place for demons.I’d flung myself here, a town on the bottom of the planet where\nundergrads burned sofas in the streets and there were penguins on the\nbeaches.I mostly avoided sports as a kid. I did a season of softball at 12. I was a daydreaming right fielder, praying to get walked each time I was at bat. A teacher once tried to get me to join track because I was decent at hurdles. I was too consumed with theater and getting perfect grades so that I could get into a great school and escape my father’s furious house. And I did.But the great school didn’t go how I expected. I was withering there and felt tremendous shame about this. So at 19 I impulsively moved to New Zealand, following an older guy I met working at a café. I enrolled at a university four hours south of him, in Dunedin. I lived in an uninsulated flat with a few other Americans and two Kiwi men who’d drink 30 beers and then go out. Other Americans I met tended to be geology majors and really into hiking. My first few weeks I got decent at pretending I was also in the country for outdoorsy reasons. I liked hiking alright.My real reasons for being there were confusing to me, therefore I didn’t talk about them with anyone. I felt that the world and I were incompatible in a fundamental and hard-to-place way, and that it was going to best me. I felt that I was drifting toward an end. I’d flung myself here, a town on the bottom of the planet where undergrads burned sofas in the streets and there were penguins on the beaches. On weekends I took a bus four hours up to my boyfriend. The rest of the week I wondered all the time what I was doing.One fall afternoon one of my roommates said she was going for a run. I asked if I could join. I didn’t tell her I’d never put on gym clothes just because, never run around just because.We headed out, past idling lorries redolent of sheep, and veered toward a neighborhood I’d never seen. My understanding of the city had been confined to my circuit between our flat and the uni and the library coffee shop. When I was home, I mostly hid in my room, crying; I’d become practiced at crying quietly at college.Guidebooks about Dunedin boast that it’s home to Baldwin Street, apparently the world’s steepest. I now realized we were approaching it. A little booth at the base sold trinkets. My roommate announced she was going to run up. I was too, I said, my confidence as ever fake.We began ascending. It was preposterously steep. After only a few paces I was gasping. She glanced back at me and continued up. I started walking and then turned around and got back to earth. She reached the summit and returned. She didn’t ask me to run with her again. Without telling anyone, one afternoon not long after, I went for a run on my own.In the sheep's eye I saw the terror of expectant death. I laughed,\nstartling myself with my sound.In Dunedin it was always about to rain. I’d finish runs damp. Some days the air stank from a big commercial coffee roastery nearby. I’d pass chip and kebab shops and gaggles of teens in uniform smoking cigarettes. I’d run through the botanical garden’s rows of roses and the public aviary where the cockatoo had a Kiwi accent. I began to feel like I understood where I was a little better. I felt my vague and throbbing sadness lifting.After a run I felt good. I’d lope around, barefoot, languid, a sheen on me, then dry, crusty. Rarely did I feel comfortable in my own body. Rarely was I so idle. I can be a Roomba of a human, ever powering forward, clearing, tidying. After a run, I’d meander toward a shower. I’d gulp water. For a while my head would be mercifully quiet.That winter I lived with my boyfriend in a Christchurch neighborhood that was a surfer’s enclave, dead for the season. I worked at a slow café, failing to know the names of various pastel-colored lolly cakes, hiding by the dishwashing machine when I needed to cry. Afternoons I didn’t work, I cried by myself at his condo. Or I ran.For some years I’d felt alone and hated feeling alone. Running, I found myself enjoying aloneness. I listened to these things, new to me, called podcasts—someone had told me about This American Life, and I gorged on it in awe.One bright day I ran along the ocean down a long grassy hillside. Down where one hill met another, close to the trail, were three fat grazing sheep. For many minutes I approached them, them and me being the only things around other than grass and sea. But they didn’t notice me at all, not until I was upon them and they, shocked, threw themselves into fleeing up the hill, one so fast it fell on its back with a blubbery thud. In its eye I saw the terror of expectant death. I laughed, startling myself with my sound.Afterward, when I’d glide around, turn on the shower, my head would\nquiet. The effect would last a day or two, then dissipate like the\nsoreness in my thighs.After seven months I went back to college, convinced I needed to try again. I lived off campus and worked in a restaurant, and during the afternoons I ran. One street in my neighborhood became more familiar, then another. Before, Providence had seemed like only asphalt and brick. Now I forced myself to find nature; I ran routes down green meridians, routes along the water.I learned where I might find a dog to say hello to, or a cat, especially the kinds who’d stretch across a sidewalk and demand your time. I liked the relative anonymity of being a runner, the way people sort of ignored you, the way it didn’t matter if you were red or drenched or heaving. Every few runs some man would yell or stare in a way he wanted me to notice, or I’d have to run through a group of men and I’d wonder whether this was my end. Still this was less than I was harassed every other time I walked in public.A friend in my improv group once remarked he’d seen me out running. I felt a surge of embarrassment—my habit was a purely private one. He said I looked good.“I don’t run to look good,” I told him. “I run to silence my demons.”My own words surprised me. Never before had I told anyone about my constantly negatively monologuing head, never had I referred to it as “demons,” a word that sounds melodramatic when I write it now. To me, then, it felt like the truest thing I’d ever said.I moved from college to grad school in Iowa City. Those first weeks I paced around my studio crying. My head yammered, fixated on how insignificant I was in this big unknown place, how if I went missing, it’d be days before anybody would try to look for me. One afternoon I finally tied on running shoes.The August day had swelled to its hottest. I turned right out the front door. The air was thick as terry cloth and loud with chirring bugs whose name I didn’t know. I ran until I couldn’t and then, in an ice cream parlor, begged a guy for a cup of water. I walked all the way back, glad when I managed to find my own address.I tried again a few afternoons later. Then I ran again and again. Some days it felt like those 30 minutes were the only ones when I wasn’t crying. And afterward, when I’d glide around, turn on the shower, my head would quiet. The effect would last a day or two, then dissipate like the soreness in my thighs.The truth of demons is they never really leave.Over the years I grew to know and even love Iowa City; I visit friends there still whenever I can. It was there, too, that I finally knew I needed actual help, and found the woman who’s still my therapist. Our seven years of intermittent conversation have helped me finally admit and better understand the nature and origin of my demons—and how to live despite them.I’ve also since become a writer whose work focuses a great deal on what’s often called “mental health.” I’ve learned for example about the physiological reasons that exercise is thought to help those diagnosed with depression. I’ve also read enough about psychiatric diagnoses to have greatly mixed feelings about them. I know some people find such labels oppressive; others believe in their life-saving utility.For me, having a word like “anxiety” can help on the hardest days—like a few months ago on book tour in Minneapolis, when for for several hours I gasped for air, convinced I was choking, convinced my heart was going to stop. My husband and I sat on a hotel bed and I tried to breathe. It was helpful that night, having language like “panic attack.” A truth about demons, I understand now, is it doesn’t matter what your life looks like to others, or how your past self would assess your present achievements. The truth of demons is they never really leave. At least they’ll eagerly return.Having now read a great deal about these topics and spoken with all kinds of people about them—some of whom live with greatly challenging minds—I do find myself less interested in fights about language. I am wary of anybody who’s too dogmatic, anybody who believes, for example, in a magic bullet that will fix all broken heads. I do think what matters is if individuals, especially those of us who’ve survived trauma, are given access to meaningful ways to help ourselves. Whether that’s talking with a professional or a support group or a spiritual guide. Whether that’s watering a plant or knitting or playing music or baking a pie—or going on a run. I’ve grown to believe in the power of small acts, repeated, that help nudge a psyche away from its abyss.Sometimes I’ll forget to run for weeks. Sometimes I’ll start a run and make it not five minutes before I turn back. When such stuff happens, I try as hard as I can to not beat myself up. Another day, I tell myself, I’ll try again.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureWhy We Learned to FightBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Sandy Allen"]}