{"id": "4dbd3268dddbf0a949694152a50f7276", "url": "https://www.bonappetit.com/story/schoolhouse-electric-trays", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "I Like My Things (Sorry, Marie), and These Schoolhouse Electric Trays Keep Them Organized | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Like My Things (Sorry, Marie), and These Trays Keep Them OrganizedSomehow they make all of my serums, soaps, and bitters stand with purpose instead of appearing haphazard.By Emma WartzmanSeptember 24, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.We may be living in a Marie Kondo world, but I refuse to change my ways. I like things—tchotchkes, knick-knacks, call ‘em what you will. They really do bring me joy! However, that doesn’t mean I don’t want to appear neat and tidy. My solution: these perfectly simple, utilitarian-but-still-cute trays from Schoolhouse Electric.In my bedroom, I have one that holds my serums, sunscreen, and moisturizer. In my kitchen, another keeps the hand soap and sponge in place on the side of the sink. On my bar cart, you’ll find little bottles of bitters and wine openers that might otherwise get lost behind bigger bottles of alcohol, nicely grouped together on, yep, one of these trays. That’s the magic of these Schoolhouse Electric pieces. Suddenly, all of my things stand with purpose instead of appearing haphazard.I have a collection of trays (like I said, I like my things!), but what I particularly love about the Schoolhouse ones is their neutral tones and small but sweet size. I use all three colors (army green, off-white, and dark turquoise) and swap them around my apartment without fear that they won’t look good or fit in a given space. Oh, and did I mention they’re super easy to clean? They’re made from fiberglass, so after some neglect, one quick wipe down has them sparkling like new again.I may never be able to downsize my things to Marie’s liking—but with these trays, I don’t even want to.Buy it: Mini Compartment Tray, $10 at Schoolhouse ElectricAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-24", "author": ["Condé Nast", "Emma Wartzman"]}