{"id": "4dbe1695d0b79c3ef673f83f9981526c", "url": "https://www.bonappetit.com/recipe/turkey-etcetrazzini", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "Turkey Etcetrazzini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurkey EtcetrazziniBy Cal PeternellNovember 15, 20214.5(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige Hicks.EmailPinterestPrintEmailPinterestPrintTetrazzini—a classic homey pasta dish usually made with chicken—gets the Thanksgiving treatment with this recipe adapted from chef and cookbook author Cal Peternell’s latest book, Burnt Toast and Other Disasters. Even the driest, overcooked turkey can be revitalized when added to a rich bath of mushrooms, heavy cream, and white wine. The result is a luscious sauce for coating a pot of pasta, as well as any “etceteras” from your holiday table: roasted brussels sprouts, sautéed green beans, cooked greens, and even cranberry sauce all make great additions.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronHeatproof Measuring Cup$18 At Amazon2-Quart Baking Dish$8.65 At AmazonLarge Skillet$84 At AmazonPepper Grinder$16.99 At AmazonIngredients6 servings2Tbsp. extra-virgin olive oil or vegetable oil2Tbsp. unsalted butter1medium onion, coarsely chopped1lb. mushrooms (any kind), torn or chopped into bite-size piecesFreshly ground black pepper1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more6sprigs thyme, leaves picked1bay leaf½cup dry white wine1½cups heavy cream3cups shredded leftover roast turkey meat1lb. short pasta (such as farfalle, fusilli, or orecchiette)2cups leftover Thanksgiving sides (such as roasted brussels sprouts, sautéed green beans, or cooked greens; optional)2oz. finely grated Parmesan (about 1 cup), dividedPreparationStep 1Preheat oven to 375°. Heat oil and butter in a large skillet over medium-high. As soon as butter is melted, add onion, mushrooms, plenty of pepper, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt. Cook, stirring occasionally, until onion is soft and mushrooms are browned, 10–15 minutes. Stir in thyme and bay leaf, then pour in wine; cook, stirring, until reduced by a third, about 1 minute. Stir in cream and remove skillet from heat. Stir in turkey.Step 2If your skillet is ovenproof, transfer to oven; if not, transfer turkey mixture to a 2-qt. baking dish. Bake until browned on top and bubbling and turkey is very tender, 50–60 minutes.Step 3Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup of pasta cooking liquid. Return pasta to pot.Step 4Stir turkey mixture, leftover sides (if using), three quarters of Parmesan, and ¼ cup pasta cooking liquid into pasta to combine. Cook over medium heat, stirring often and adding more pasta cooking liquid as needed, until saucy, about 2 minutes.Step 5Divide among bowls. Top with remaining Parmesan and more black pepper if desired.Adapted from ‘Burnt Toast and Other Disasters: A Book of Heroic Hacks, Fabulous Fixes, and Secret Sauces’ by Cal Peternell. Copyright 2021 by Cal Peternell. Reprinted by permission of William Morrow, an imprint of HarperCollins Publishers.\n\nBuy on Amazon or Bookshop.orgHow would you rate Turkey Etcetrazzini?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI love using my leftover turkey in a hearty, Italian dish such as this!  Heavy enough to serve with a red wine, as well.  Delicious!CJ LewisTroy, ID12/29/2021This recipe was a great way to use leftovers! Lots of compliments on the creative way this incorporated leftover grilled turkey and duck. I added most of a container of fresh spinach, leftover grilled brussel sprouts, leftover roasted garlic and cubes of roasted butternut squash. This recipe is definitely going to be repeated & shared! I did not bake it the full 50-60 min. I probably removed it from the oven at 40 min...very bubbly at this point.  Really a crowd pleaser!JKBadger21Eagle River, WI11/29/2021Carol Y and I think the same way. I too was wondering why so long in the oven ? I would put it under the broiler until brown and bubbling....that should do the trick. Recipe sounds interesting though.Big JoeMontreal, Canada11/19/2021If the turkey is leftover and already cooked, why would you need to bake it for 50-60 min?  Carol YBoise, ID11/19/2021Explore Bon AppétitTurkeyPoultryMushroomVegetablePastaDinnerGreen BeanEasyWeeknightThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-15", "author": ["Condé Nast", "Cal Peternell"]}