{"id": "4dc2cd3bdb5e29892d6b9268a31b7839", "url": "https://www.bonappetit.com/story/cbd-olive-oil", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "A CBD Olive Oil That Lives Up to the Hype | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA CBD Olive Oil That Lives Up to the HypeThe CBD acts like a flavor turbo-charger, exaggerating the olive oil’s sharp, fruity characteristics.By Chris MoroccoJune 8, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!In this CBD-saturated age, combining olive oil and CBD might seem like fodder for the masses constantly craving the next big wellness thing. And there would be no magic in combining a crappy olive oil with inferior CBD. But when one of our favorite olive oil producers teams up with one of our favorite CBD brands, we listen up.Combining beautifully intense olive oil with full-spectrum CBD actually makes a lot of sense. Quality olive oils are high in polyphenols, that peppery bite that grips the back of your throat when you taste them, and CBD’s dynamic aroma comes from terpenes. The grassy, peppery intensity of Wonder Valley’s olive oil meshes perfectly with the pine resin and citrus notes of Lily’s CBD.This isn’t an olive oil to use in your Tuesday night vinaigrette though. It’s intense. The CBD acts like a flavor turbo-charger, exaggerating the olive oil’s sharp, fruity characteristics beyond even the brightest, greenest, most peppery oil. It craves a bit of fruity sweetness, so drizzle it over a bowl of stone fruit with flakey salt, lemony avocado toast, or ice cream. Think of it as the olive oil equivalent of aged balsamic; to be used sparingly and with intention.Buy it: Wonder Valley x Lily CBD Olive Oil, $39 for 100 ml.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishCannabisOlive OilShoppingRead MoreLifestyleThis Jarred Sauce Changed Our Grain Bowls For GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-08", "author": ["Condé Nast", "Chris Morocco"]}