{"id": "4dc5584f175182eee95cd30d6eae0cc5", "url": "https://www.bonappetit.com/recipe/stir-fried-brussels-sprouts", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Stir-Fried Brussels Sprouts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueStir-Fried Brussels SproutsBy Molly BazOctober 16, 20183.7(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSeparating the leaves of each tiny cabbage may sound tedious, but you'll be crowned a true hero once your crowd gets a taste of the sweetest, tender-crisp brussels sprouts they've ever had.Ingredients8 servings½cup walnuts2lb. brussels sprouts8Tbsp. extra-virgin olive oilKosher salt, freshly ground pepper½lemon1Tbsp. walnut oil or 1½ tsp. sesame oilPreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool, then coarsely chop.Step 2Using a paring knife, remove cores from brussels sprouts through stem ends; discard. Peel off leaves all the way down to the very center.Step 3Heat 2 Tbsp. olive oil in a large skillet over medium-high. Add a quarter of the brussels sprout leaves and cook, tossing once or twice, until bright green and deeply charred in spots, about 4 minutes. Season with salt and pepper; transfer to a platter. Repeat process 3 more times with remaining brussels sprouts and olive oil.Step 4Finely grate lemon zest over brussels sprouts, then squeeze juice on top. Scatter walnuts over and drizzle with walnut oil. Finish with a few cranks of pepper.Step 5Do Ahead: Brussels sprouts can be cored and leaves separated 3 days ahead. Wrap in damp paper towels and store in resealable plastic bags; chill.How would you rate Stir-Fried Brussels Sprouts?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleNext I make this I will add a little crumbled blue cheese just before serving. Denice MVirginia Beach, VA11/27/2020Explore Bon AppétitBrussels SproutVegetableWalnutNutFallWinterSideDairy-FreeGluten-FreeVegetarianVeganKetoHealthyishFryThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}