{"id": "4dc9d9bc6cad72e69d482369ac28f21a", "url": "https://www.bonappetit.com/recipe/pork-marbella", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Pork Marbella Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssuePork MarbellaBy Adam RapoportMarch 22, 20194.7(74)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Simon AndrewsEmailPinterestPrintEmailPinterestPrintWe took the classic, beloved Chicken Marbella recipe from The Silver Palate Cookbook and made it weeknight-friendly by using quick-cooking pork tenderloin instead. The meat is marinated and then cooked in those same delicious juices, which get turned into a luscious sweet-and-sour pan sauce.Ingredients4 servings21-lb. pork tenderloins2tsp. kosher salt1cup dry white wine½cup pitted prunes, torn in half⅓cup (packed) light brown sugar¼cup capers, plus 1 Tbsp. caper brine½cup pitted Spanish green olives¼cup red wine vinegar4garlic cloves, peeled, smashed2bay leaves1Tbsp. dried oregano¼cup plus 1 Tbsp. extra-virgin olive oil1Tbsp. unsalted butter¼cup chopped parsleyPreparationStep 1Season pork with salt. Let sit 15 minutes while you prepare the marinade.Step 2Combine wine, prunes, brown sugar, capers and brine, olives, vinegar, garlic, bay leaves, oregano, and ¼ cup oil in a large resealable plastic bag. Add pork, seal tightly, pressing as much air out of bag as possible, and turn to coat. Chill at least 2 hours or up to overnight.Step 3Place a rack in center of oven; preheat to 325°. Remove pork from marinade and pat dry; reserve marinade. Heat remaining 1 Tbsp. oil in a 12\" skillet over medium-high. Cook pork, turning occasionally, until golden brown all over, 6–8 minutes.Step 4Remove pan from heat and let cool 1 minute. Pour reserved marinade over pork. Transfer pan to oven and bake, basting pork once with its sauce halfway through, until an instant-read thermometer inserted into the thickest part of tenderloin registers 145°, 22–26 minutes, depending on thickness.Step 5Transfer pork to a cutting board and let rest 10 minutes. Return pan to medium-high heat. Add butter and cook, swirling pan occasionally, until slightly reduced, 3–5 minutes. Stir in parsley.Step 6Slice tenderloin crosswise against the grain. Transfer to a platter and spoon pan sauce over.How would you rate Pork Marbella ?Leave a ReviewTell us what you thinkReviews (37)Back to TopTrianglePer the suggestions, I cut the sugar back from 1/2 a cup to 1/3 and found it just as good. I made this recipe all the time for friends, family, and myself and it’s a home run each time. Measure the temp at 21 minutes to really monitor how well done you want it. 23 minutes seems to be the sweet spot for me. I love a salad with vinaigrette, a side of rice, or mashed potato’s works well. LindseyDenver12/11/2021Very good recipe. Well balanced. Sweet with hints of dry aroma. Marinade overnight did it job. EmilWarsaw, Poland10/14/2021Wow, this is really good!  We have tried a number of recipes with olives and they all were too salty.  This one was perfect.  Complex flavors and balanced.  Will definitely do again.   Marinated the pork overnight.  Pjay99Clifton, VA9/27/2021So simple but so divine! Marinated the pork the night before, followed everything as written and it was wonderful!! This would be a great dish for company as well, definitely making it again!J.C.9/23/2021Made this tonight & it is a winner - I like the sweet with the savory - very rich, complex flavours.  Temp for the pork tenderloin was perfect - The tenderloin had a hint of pink which keeps it tender & moist.  Will be adding this as a family favorite.Sharon ROttawa, Ontario5/24/2021Definitely a keeper. I add lots mire prunes and olives. We’re big fans. My daughter in-law sent me this recipe. It’s a company favorite. I serve it with couscous and a big salad.  Susan Boulder, Colorado 4/7/2021I made and marinated this as written - all day.   I grilled the meat and simmered the marinade.   I do not recommend it this way -- you need some of the pork fat (altho tenderloin doesn't throw too much) in the sauce.  This might also work with chops - pan sear and then use the marinade as a braising liquid.  Served with oven smashed baked potatoes - super crispy.  GloryNJ4/7/2021I have made this twice, and it is a keeper for sure.  I don't like sweet and savory together very much, so I cut back on the sugar.  The prunes and olives are a great combo.AnonymousWoodbury, TN11/20/2020Loved the idea of this because my family adores the original Chicken Marbella. However, the reason it's too sweet is because, unlike the OG recipe, the sugar is in the marinade here (the wine isn't in the OG marinade either). Originally you would marinate overnight, place the chicken pieces in the pan with marinade surrounding it, add the wine to the pan and then sprinkle the sugar over the tops of the chicken pieces to caramelize. Next time I make this I will omit the sugar and wine from the marinade. I plan to sear the pork tenderloins (which won't burn as easily without all the sugar in the marinade), deglaze the pan with the wine, add the reserved marinade and sprinkle with sugar before placing in the oven.  \n\nAlso, check the pork at 16 minutes. AllisonAustin, TX11/20/2020Boy, did this ever repay the absolutely minimal effort involved! An easy weeknight supper with big flavors that’s fancy enough for company? I’ll make this again for sure. AnonymousLongview TX6/19/2020I backed off on the sugar a little based on the reviews  (1/4c instead of 1/3) and it was fabulous! Easy, but still impressive enough for company. Yum!! AnonymousDc 5/4/2020Looooooved this! I might halve the sugar next time, but still really enjoyed it. Will definitely make this again!AnonymousCalifornia 4/10/2020I had to change it up since cooped in the house during the corona pandemic so I used what I had and it was still delicious.  I used dates in place of prunes, no sugar caper or olives.  Everything else exactly as stated and it was wonderful.  I can’t wait to try it with all the ingredients.  I am sure it will be very different but what I made was worth making again exactly the same also AnonymousKansas4/1/2020I made this for dinner last night and, although good flavor, it was WAY over done in 22 minutes. I would say 12 to 15 minutes max. The sauce was great but didn’t save the dry meat. I need to try this again.AnonymousKarenfar@ymail.com3/23/2020My husband and I really enjoyed this dish and both loved how the olives, capers, and prunes all went together with the pork. I did cut the sugar in half to reduce for a dietary need and found, as others have commented, it really didn't need the full amount. Will definitely be making this again and it will also make a great meal to have with friends over. AnonymousTexas3/11/2020Explore Bon AppétitPork TenderloinPorkMeatPruneDried FruitFruitOliveOther IngredientsMainDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Adam Rapoport"]}