{"id": "4dd73dee599eceef579d3241d32f2032", "url": "https://www.bonappetit.com/story/cheese-slicer", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "I Always Thought a Cheese Slicer Was Unnecessary—Until I Owned One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Always Thought a Cheese Slicer Was Unnecessary—Until I Owned OneThe genius built-in blade can do it all.By Megan ZhangJuly 6, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The tool drawer in my parents’ kitchen houses a Norwegian cheese slicer that is older than I am. As a youngster I gave little thought to the funny-looking mini-spatula with a rectangular hole. It wasn't until a cheese basket arrived one holiday season from some friends in Wisconsin that I understood its utility, watching my mother shave perfectly symmetrical hunks and arrange the neatest cheese plate our kitchen had ever seen. Needless to say, Mom always knows best, and I am now the proud owner of a very similar, equally funny-looking cheese slicer.Though any blade is capable of cutting cheese, this gadget solves many of the pitfalls you might encounter with a regular knife, like pieces sticking to the blade, or slices turning out uneven (leaving you with a grilled cheese that’s molten in some parts and still cold in others). It was the Norwegian carpenter Thor Bjørklund who first dreamed up the design in 1925, finding inspiration in his own carpentry toolkit: the planer, which was adept at neatly cutting uniform pieces of wood. Bjørklund patented the design, and now, nearly a century later, his practical and dynamic ostehøvel is a common sight in Scandinavian kitchens.The built-in blade is where the genius lies. Position the sharp edge on your chunk of cheese (medium-hard varieties work best), and gently bear down to carve thin, equal pieces. The sliding-away motion of each cut feels natural and streamlined, while protecting your soon-to-be cheese-plucking fingers. Once sliced, the cheese is already balanced on the spatula, ready to melt in a panini, adorn a charcuterie board, or wrap inside prosciutto.But don't make the mistake of assuming the cheese slicer is a single-use gadget. It can do much more than its name proposes—and faster than your average paring knife, too. I use it to slice stickier foods, like cold butter for warm pancakes and potatoes for crisping up evenly in the air fryer. I also whip it out to achieve shapely pieces of boiled egg, banana, and mango (don’t be surprised when your kiwi tart at the summer potluck impresses all your friends). In a pinch, I even use The Gizmo, as I’ve come to call mine, to slice cucumbers for salads and zucchinis for roasting. The slices are always shipshape, and I’ve never accidentally cut myself. Can any of us say the same about a knife?Years after I first witnessed Mom’s ostehøvel in action, the ingenious design still tickles me every time I fashion a snack platter, slice fruit for a bowl of oatmeal, or shave brunost (Norwegian brown cheese) onto crisp toast. But there is one caveat. Without fail, I always wind up eating waayyy more cheese than I intended. It's just fun to use, okay?Photo by Emma FishmanBoska Cheese Plane$10 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Megan Zhang"]}