{"id": "4df0e90a26f113e615d942a8a2b5e9ac", "url": "https://www.bonappetit.com/recipe/pork-shoulder-steaks-with-grilled-mustard-greens", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Pork Shoulder Steaks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssuePork Shoulder Steaks with Grilled Mustard GreensBy Molly BazMay 22, 20184.7(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintNormally you want to braise a pork shoulder—but we’re making a case for throwing it on the grill, with a hell of a spice rub. Like a rib eye, pork shoulder has lots of intramuscular fat, and like strip steak, it has satisfying chew. This recipe shows how slicing it thickly and grilling it swiftly maximizes the enjoyment of both.Ingredients4 servingsPork2Tbsp. fennel seeds1Tbsp. yellow mustard seeds1½tsp. black peppercorns1tsp. crushed red pepper flakes1tsp. ground cinnamon4¾\"-thick boneless pork shoulder (Boston butt) steaks (about 2 lb.) or pork blade chopsKosher saltGreens and AssemblyVegetable oil (for grill)1lemon, halved2Tbsp. extra-virgin olive oil, plus more for drizzling2garlic cloves2bunches mustard greens, leaves torn into large piecesKosher salt, freshly ground pepper½tsp. crushed red pepper flakesFlaky sea saltSpecial EquipmentA spice mill or a mortar and pestlePreparationPorkStep 1Toast fennel and mustard seeds in a small saucepan over medium heat, stirring occasionally, until fragrant and mustard seeds are just beginning to pop, about 4 minutes. Transfer to spice mill or mortar and pestle and let cool. Add peppercorns and red pepper flakes and finely grind. Transfer to a small bowl and mix in cinnamon.Step 2Season pork steaks generously with salt and rub all over with spice mixture. Cover and let sit at room temperature 1 hour.Step 3Do Ahead: Pork can be seasoned 1 day ahead. Cover and chill. Let sit at room temperature 1 hour before grilling.Greens and AssemblyStep 4Prepare a grill for medium heat; oil grate. Grill steaks, turning occasionally, until an instant-read thermometer inserted into the thickest part registers 145° for medium, 5–7 minutes. Transfer steaks to a cutting board, squeeze a lemon half over, and drizzle with olive oil. Let rest 10 minutes.Step 5Meanwhile, grate garlic into a large bowl and whisk with 2 Tbsp. olive oil. Add mustard greens and toss to coat; season with kosher salt and pepper. Spread out greens over grate (save bowl) and grill until lightly charred and just wilted, about 45 seconds per side. Transfer back to bowl and squeeze remaining lemon half over. Add red pepper flakes and toss to coat.Step 6Transfer greens to a platter. Thinly slice pork against the grain and place on top of greens. Drizzle any accumulated juices left on your cutting board over and sprinkle with sea salt.How would you rate Pork Shoulder Steaks with Grilled Mustard Greens?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleA Bon Appetite recipe from 2018 shows up on my Facebook feed with a recipe for pork steaks? St Louis has been grilling pork steaks for at least 50 years. Oh, I’m sorry, we’re low brow flyover space; why would you know what we’re doing?Amy B.St. Louis, MO11/22/2020This recipe will be saved to the tried-and-true log. What an easy, elegant, and delicious dish! Even my anti-greens dad, husband and son enjoyed this one.  The pork was to die for, though I used loin instead of shoulder. I substituted flat leaf kale for the mustard greens and it was delicious. I served it with a side of quinoa salad. This a fantastic summer grilling meal. All my dinner guests raved about how delicious it was.EmilyB91180Miami, FL7/29/2018Yes. Pork shoulder is great but stop telling everybody, will you? Oh, and by the way, dry rub is the way to go if you want that spicy brown crusty exterior.fnielson925867/26/2018Pork shoulder is, by leaps and bounds, the best cut of pork. Grab a few pounds and slice the steaks yourself, and hit them with any number of SE Asian marinades, and you're set. Big ups BA, keep the fatty chard bits coming!AnonymousSan Francisco7/10/2018Explore Bon AppétitPork ShoulderPorkMeatMustard GreensLeafy GreensVegetableEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}