{"id": "4e08631109bc09045dcb2fdfdb36e6a3", "url": "https://www.bonappetit.com/story/kitchen-organization", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "The Best Kitchen Organization Tips, According to a Professional | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow To (Re)Organize Your Kitchen, According to a Professional OrganizerFaith Roberson is here to restore order to our overworked, undercleaned kitchensBy Emma WartzmanJanuary 25, 2021FacebookTwitterEmailIllustration by Marisol MuroFacebookTwitterEmailThis article is part of Healthyish at Home, our expert-sourced guide to making our living spaces feel great. When you’re cooking nearly every meal, it’s easy to let chaos creep into the kitchen. Expired food lurks in the back of the fridge; grains hide behind cans in cabinets. But it’s a new year, and professional organizer (and former personal chef) Faith Roberson is here to help make (then keep) things tidy and thoughtful.Sure, you can tackle kitchen organizing anytime, but Roberson believes there’s no better moment than right now to reassess what we have versus what we actually need—both in the form of plain old stuff and our shopping and storing habits. “I recently dropped off a load of canned goods at the nearest food shelter because I bought too much in a panic last spring,” she says. “It only recently hit me, we’re still here Faith, and some people need food now. It felt empowering to go into the new year with a kitchen I could maintain—one catered to my diet, not my fears.”Everyone’s life is different, so there’s no one way to go about getting organized. Maybe you need a single improvement, like taking everything out of your pantry and donating what you don’t need or, as she suggests below, committing to a small-but-permanent storage upgrade. Or perhaps your cleaning routines need an upgrade to meet the never-ending demands of three meals a day (plus snacks and dessert). “Without a shadow of a doubt, the kitchen is the heart of the home,” Roberson says. “It’s energetic and transitory because food and people are always coming in and out.” The key is to find what works and stick to it. Here, Roberson shares five tips to help you get your space together.Illustration by Marisol Muro1. Go MultipurposeEmbrace multipurpose tools to free up your shelves and your budget. Use a salad spinner insert as a colander, or mason jars for drinking, canning, and storing dried goods. You can use a pitcher for iced tea, of course, but you can also use it to hold cooking utensils next to your stove, or flowers on your table (just not all at once).Illustration by Marisol Muro2. Use That Wall SpacePut up hooks on a free kitchen wall to hang pots and pans. Your most-used kitchenware will be at the ready, and you’ll free up precious cabinet space for bulkier, less attractive equipment like that clunky blender. Roberson likes these steel ones, which look industrial without being boring.Illustration by Marisol Muro3. Just Add TurntablesTurntables can maximize space in cabinets, under the sink, and—game changing!—inside your refrigerator. For those mostly hidden spaces, Roberson likes this clear one from the Container Store. It’s easy to clean and you can remove the dividers to make the compartments wider to accommodate bigger items. Just be sure to measure your shelves before heading to the store to ensure your turntable will fit, then never lose a jar of mustard in the back of your fridge again.Illustration by Marisol Muro4. Relocate the Junk DrawerOf course, you should make sure your junk drawer is not...full of junk (yes to a flashlight, spare keys, matches, and Wi-Fi info; no to stretched-out rubber bands and the goody bag your kid took home from the dentist). But you should also consider moving your junk drawer out of the kitchen entirely. There’s no reason all the aforementioned stuff can’t live in the entryway or even the garage, freeing up precious storage space where you need it most.Illustration by Marisol Muro5. Clear Out The FridgeBe honest: When was the last time you wiped down your fridge? Before you grocery shop, try taking everything out and giving the inside a good clean. This way keeps surfaces glistening, of course. But you also see what has expired (that flavored mustard you were never going to eat anyway), what needs to be consumed ASAP (that lingering slice of leftover pizza), and what you actually need to stock up on.Explore Bon AppétitHealthyish HomeHealthyishRead MoreculturePlant Kween Is Here to Help Our Houseplants ThriveBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Emma Wartzman"]}