{"id": "4e092f75ce0767a475711fe340d67773", "url": "https://www.bonappetit.com/story/what-is-garri", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Garri Is My Family’s Favorite Food Tradition. Here’s How to Make It Yours | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGarri Is My Family’s Favorite Food Tradition. Here’s How to Make It YoursMade from granulated cassava, this West African staple is both my comfort and my fuel.By Chisom Peter JobAugust 20, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailMy grandma dips a spoonful of brown beans into a bowl of the cold, thick porridge made from cassava and brings it to her lips. This is her favorite food: garri and beans. “This is how I used to eat it with your grandpa when he was alive,” she tells me.Grandma grew up in Item, Bende LGA in the Abia state of Nigeria. As the first child in the family, she became a second mother to her younger siblings after the death of their parents, and the sole breadwinner once again, years later, after her husband died during Nigeria’s civil war. “Things became hard after his death,” she says, talking about how the family went from rich to poor after the Igbo massacre, how it took years to get back everything they lost. “We drank garri without sugar because we couldn’t afford it. Garri was the easiest thing to get at the time.”My mom drinks garri with a mixture of cooked peanuts when she’s tired of cooking. It also does the work of satisfying her between meals, and she began serving it to me when I was barely two. Maybe this is why my grandma sometimes calls my mom her favorite daughter-in-law; despite being born in different generations, the two of them have been eating garri for decades, and never miss an opportunity to sit down together over a pair of bowls.What is garri?Garri, pronounced gah-ree,, is made from granulated cassava, a root vegetable that’s poisonous unless you peel and cook it first. Commonly found in West Africa, there are two types of garri: yellow and white. The flavor depends on how long it’s been fermented and the presence of palm oil.Originally native to South America, cassava was introduced to West Africa in the 16th century by Portuguese colonizers. Garri became popular in Nigeria in the 19th century after formerly enslaved people began to return from Portugal and introduced a method for processing cassava. Today, garri is found in homes throughout the country, and, because it’s typically affordable and rich in fiber, and contains important trace minerals, has been described by many as a lifesaver when times are lean. When I was a student living in Lagos, garri was a means to an end for me and my classmates, there to fuel us while we studied for exams in the middle of the night or early morning. It has also served as the go-to food for me whenever I come home tired and hungry, with no strength whatsoever to prepare anything. Its subtle flavor and smooth texture makes you want more and more, until your plate is empty.How do you make it?Garri can be served hot and savory, cold and sweet, or as a creamy chilled pastry. On its own, it doesn’t have much flavor, so how you prepare it makes all the difference.Cold: Mix 1 cup garri with 1 cup of cold water, honey or sugar for sweetness (add a pinch of salt to enhance it further),a splash of milk, and something for texture, like peanuts, groundnuts, or broken-up biscuits. I like to use Oxford Cabin Biscuits from Nigeria, along with both sugar and salt, milk, and ice.Hot: Pour 2 cups of boiling water into the bowl, followed by 1 cup of garri, then mix the two until smooth and lump-free, and shape the substance into a doughy ball. Serve with soup—anything from a classic vegetable broth to a thick West African soup like egusi. Garri is perfect for dipping.Pastry: Add 2 cups of garri to 2 cups of cold water, and stir it to make a paste. Then add at least 3 tablespoons of granulated sugar and half a cup of room temperature butter and stir until smooth. In a separate bowl, mix 3 tablespoons of powdered milk, 2 tablespoons of powdered chocolate or two drops of strawberry flavoring, then add it to the first bowl, stir until smooth, pour it into a cake pan and refrigerate for 1-2 days. Want to make it look pretty? Decorate it with butter, which you can put in a piping bag and use to create flowers and other patterns. The result is known as garri cake, slightly sweet and very creamy. It is made for occasions such as birthdays or picnics.Where can you get it?You can find garri at African import stores or online (Amazon sells it in its raw, granulated form so you can prepare it however you like). Want to eat it hot and pre-cooked? Check out your local West African restaurant.In my family, we eat garri with our dinner five days a week. Coming home to the aroma of warm soup with a side of hot garri—this is our tradition. For generations, garri has been our lifeline. Maybe it can be yours too.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-20", "author": ["Condé Nast", "Chisom Peter Job"]}