{"id": "4e0fb2562f7eeac5a270cc487844e98c", "url": "https://www.bonappetit.com/story/sophie-heawood-motherhood", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "When I Accidentally Became a Single Mother, I Had to Learn to Feed Us | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen I Accidentally Became a Mother, I Had to Learn to Feed UsThe loving came easy, but cooking was a different story.By Sophie HeawoodMay 7, 2021FacebookTwitterEmailPhotograph by Harold M. LambertFacebookTwitterEmailThe worst thing about accidentally becoming someone’s mother is that you have to feed them. The happiest moments of the first few years of my daughter’s life were spent in cafés, where I would regularly go over my credit card limit paying someone else to feed us, in a place that was warm and structured but that would eventually close—and then we’d have to go home. Home was less of a fixed shape in those days.We’d leave the café, with its fries and sausages and tuna steaks and lasagnes, and come back to a place where I was never sure if the four walls were holding us together or holding us down. Where the kitchen asked me a question I couldn’t answer. Can you do this, it seemed to be hissing at me. Yes I can, I’d reply, looking the other way, ignoring its mess, my failings.I had become a mother after getting pregnant while living in Hollywood, hanging out with celebrities in a fantasy life that turned out to be at least semi-real. Parties were where I felt most myself, most alive. Or perhaps I mean most warmed by alcohol and then by the thrill of others, warm bodies, electric lights in dark gardens, strangers, laughter, smoking areas, newness, endless newness.The first Saturday night I had ever stayed in, by myself, was the night I realized that I was nine days late for my period and should really go down to the drugstore and buy a pregnancy test. Reality had finally crept within earshot, first as a whisper and then, after the test was positive, as something rather louder. I had known the baby’s father for some years but he said no to this unplanned family life. Everybody else, though they loved me and blessed me, said what the hell are you doing, and then I was on my own.A great many Saturday nights staying in would follow, along with all the other days of the week, although I was never alone again. I moved back to my native England and had the baby in London, the city where I used to work the door of nightclubs and then dance until four in the morning, even on Mondays. Especially on Mondays. Now I was up at four in the morning again, seeing those same early hours from the inside of the house looking out, a baby on my breast, a tug of joy and heartache going through me as I peered from the window to see clubbers coming home.The kitchen scared me in a way that no cliffhanger, no adventure, no travel, no journalistic assignment ever had.I found the loving part easy, as we gradually became a team of two against the world, or even with the world—we enjoyed the world. Playing with a child came naturally because I was a child. A 35-year-old one. I had lived inside made-up stories all the way through my adulthood, so it wasn’t hard to create make-believe for my girl. But the kitchen scared me in a way that no cliffhanger, no adventure, no travel, no journalistic assignment ever had. It was supposed to be a friendly room, but kitchens look like places that families live, and I was never sure if two of us could actually be one. The very space of it seemed to compound our solitude.The author and her daughter.\nPhotograph by Louise AndroliaTo cheer the place up, I bought colorful cookbooks, but never found a recipe aimed at someone whose fear of cooking wasn’t about the temperature at which it’s safe to serve meat or messing up a roux. I think I was frightened of knowing what I was missing—resistant to learning more sophisticated cooking methods because it would only heighten the loneliness of my dining partner being a three-year-old. Following a recipe felt like accepting that nobody else was coming to rescue me from adulthood. And so I warmed up frozen food, such as fish sticks and things that had once been potatoes, and I heated up real salmon and I cooled down over boiled pasta, and sometimes we were good and ate apples and broccoli and had crunching competitions for who could make the most disgusting noise while eating a raw carrot. The rest of the time we went out, including on a holiday to Italy, where my kid asked for plain pasta, no sauce, at every meal, every day.The last time I had cooked a proper meal for someone else, before having a child, was a man I had been dating a couple of years before in Los Angeles. It would take a long time to explain why I fried carrots in a wok with hot oil and then added squeezy honey, thinking this was what honey-glazed carrots meant. Or why I then added a packet of tofurkey that I found on the shelf, thinking all proteins were the same. Or why I then, looking around for something to serve it in, and not being in my own home, thought a lovely artisan bowl type thing, clearly bought on vacation, with some kind of decorative ceramic ridge that swooped up and down around the edge of it, looked ideal.“Why,” the man asked me, after trying to eat a few mouthfuls of the oil and sugar and orange vegetation that I had apparently glued onto some fake meat, “did you decide to serve this in an ashtray?”My daughter will turn 10 this year and has developed the personality of a small Joan Rivers fan. We make ourselves hysterical by seeing who can outwit the other with sarcastic one-liners. She rolls her eyes at me a lot, having not had life handed to her on a silver platter. Perhaps because it still takes me by surprise, for example, that after you buy food once, you also have to buy it again. This system seems deeply flawed. The other day we got up for breakfast and realized we had run out of milk to have on cereal. She offered to eat it dry, but it turned out we didn’t actually have any cereal either. I said she could have toast, but we looked and found only the dry ends of the loaf of bread remained. I tell myself that it’s resilience training, that I’m stopping her from becoming a brat, that it’s all about resourcefulness. She looks at me like I could have sorted this shit out a long time ago.Last Friday night she wanted her customary pepperoni pizza from the big, boring pizza chain, something that, even to my untrained mouth, clearly tastes like cardboard. I insisted she finally try a vegetarian pizza from the more adventurous foodie takeaway instead. Cooked by actual Italians. She had no choice.“This would taste better,” she said, as she finished her second slice, “if it didn’t exist.” I wanted to tell her off for being rude, but I’ve always said: If you haven’t got anything nice to say, make sure you have a punchline.When the pandemic hit I panicked, like we all did—if she and I were stuck together in our home with no friends, no family, no cafés, and no school lunches, I wasn’t sure how we’d get through it. So I offered our spare room up to my friends, and one of them, a male friend whom I knew a little, took it. A year has passed and he hasn’t left yet–in fact we all moved into a new house together the other day. My definition of our family, which I had come to proudly accept as being only two people, has expanded to three. He is a man who loves to cook, loves to spend hours stirring and adding and tasting and perfecting. Loves to cook for me, loves to cook for my daughter. Loves to cook for friends. A man to whom you can send a text first thing in the morning saying, if you’re in the kitchen, I can’t get out of bed, pls bring scrambled eggs and a cup of tea, and he will actually do it.So you could say that someone did come to save us—and that it was another accident, perhaps, as the best things in my life seem to be—but the fact is that I still hate cooking and I still hate the kitchen. I hate the new kitchen an awful lot less, especially when it has all three of us, and our family dog, and his dog, laughing and barking in it. The man pointed out recently that it doesn’t matter if you hate cooking, as long as you love eating. I never thought of it like that. I still hate cooking, but I definitely love eating. My daughter loves eating too. We all love eating very, very much indeed.Sophie Heawood is a London-based writer and the author of The Hungover Games, a memoir about what happens when you accidentally become someone’s mother.Explore Bon AppétitMother's DayHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-07", "author": ["Condé Nast", "Sophie Heawood"]}