{"id": "4e240c5f127e927de4b6ef4c17050fd4", "url": "https://www.bonappetit.com/story/doodh-soda", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Doodh Soda is a Refreshing Punjabi Drink That's Creamy, Sweet,  Fizzy, and Thirst-Quenching | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Iftar Table Isn't Complete Without Doodh SodaCreamy, sweet, fizzy, and thirst-quenching, all in one.By Haneen J. IqbalApril 16, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Growing up, I spent summers in Lahore, Pakistan, with my grandparents. The days were always hot and humid, but that never deterred my brothers or me from playing on my nani’s rooftop terrace or front lawn from morning to dusk. Every few hours we would hear her soft-as-silk voice floating out the open kitchen windows, summoning us back inside for a cold beverage. Sometimes the drink of choice was nimbu pani; other times it was frothy mango lassi. But whenever we saw three metal cups lined up in a row on the counter, beads of condensation running down each, we knew it was doodh soda.Doodh soda is one of those combinations that sounds wrong until you’ve tried it. A mixture of lemon-lime soda (like 7-Up or Sprite) and milk, it’s creamy, sweet, slightly fizzy, and highly thirst-quenching. I like to think of it as the naughtier Punjabi cousin to Persian doogh (which is made with yogurt and club soda). I was four or five the first time I tried it, so I didn’t need any particular convincing. Milk? Good. 7-Up? Even better. Mix the two and now we’re talking.The drink is a staple across the provinces of Punjab in both Pakistan and India. In Lahore, dairy shops and roadside cart vendors sell it at all hours of the day during the hot months. Its popularity skyrockets especially during the month of Ramadan, with Sprite and 7-Up airing doodh soda commercials on TV what feels like every hour. Many household iftar tables feature a large jug of doodh soda, with grandmothers often touting the drink’s “recuperative” qualities before handing you a glass. The two main ingredients of the drink are separately beloved for their supposed medicinal properties, so it makes sense that, when combined, they become an almost super-drink.Sodas, especially lemon-lime sodas, are often prescribed by Punjabi grandmothers as home remedies for gastrointestinal ailments. At my nani’s, gas meant normal Sprite, nausea meant Sprite with a little salt, and an upset stomach meant flat Sprite. I often asked her, in jest, if she was secretly being paid by soda companies; she would reply that soda was how her mother’s mother had been fixing stomach aches since “angraaizon ka zamana,” which roughly means since the days of British colonial rule.Milk is another exalted beverage in many South Asian households. It’s seen as an end-all-be-all for healthy development and wellness from infancy into late adulthood. Even suggesting yogurt or cheese as a replacement to your daily glass of milk is almost sacrilegious because, as my mother loves to say, “Nothing can replace the benefits of a glass of milk!”It’s easy, then, to see why doodh soda is so popular during Ramadan. Fasting for upward of 16 to 18 hours a day takes a toll on the body, and whether you believe the folklore and medicinal claims behind the drink, it’s undeniably delicious. After just a few sips it’s easy to forget that you haven’t eaten or drank anything all day. Your thirst disappears, the creaminess satiates you, and the sudden surge of sugar makes you feel alert.To make it, fill a glass about ⅓ of the way with crushed ice, add milk until the glass is ⅔ full, and finally add 7-Up or Sprite to fill the glass to the top. To make a pitcher, the basic ratio is two parts milk to one part soda. If I’m feeling fancy, I like to add freshly grated lemon and lime zest. If you want to make it fizzier and less creamy, you can switch the ratio of milk and soda to 1:1. There is no wrong way to make it and you’ll find that you can add however much of each component to suit your own palate. As a grandmother’s cherished drink, doodh soda will nurture you in any form.Haneen J. Iqbal is a freelance writer based in Toronto.Explore Bon AppétitIt's That SimpleRamadanPitcher DrinksSummer DrinksSodaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-16", "author": ["Condé Nast", "Haneen J. Iqbal"]}