{"id": "4e2c5a085e286142e96c97a51f1224d8", "url": "https://www.bonappetit.com/story/dry-fried-green-beans", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Dry Fried Green Beans Are the Only Fry I need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Deep Fry When You Can Dry Fry?These Blistered Green Beans with Garlic are all the convincing I need.By Carla Lalli MusicApril 4, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.My favorite Test Kitchen tastings are always the ones when I eat well and I learn something. The time I had Blistered Green Beans with Garlic was one of those occasions.This recipe is Chris Morocco’s riff on a classic Sichuan preparation for dry-fried green beans, which was where my cooking education started. Yes, I’d had the blistered and aromatic wok-fried beans before—albeit in New York City Chinese restaurants and unfortunately not in China. I knew that when I ordered dry-fried beans (gan bian si ji dou), I’d get a plate of green beans (or long beans) with browned, slightly shriveled skins and snappy, juicy middles, with toasty bits of shallots, Sichuan peppercorns, garlic, and ginger sprinkled about.Want this letter before it hits the website? Sign up for our newsletter!What I didn’t know, and frankly hadn’t bothered thinking about since I was always so busy eating my green beans, was what “dry fried” actually meant. That is, until the day Morocco presented his version of the dish and Carey Polis and I asked him. Here is a slightly fictionalized account of that conversation.Chris: Hey guys, here are the dry-fried green beans for BA dot com.Carla: [Drools; serves self first]Carey: These look amazing! Wait, I’ve always wondered about this, why are they called dry fried?Molly Baz: [Walking by] Yeah, great question. He deep fried them.Carey: Wait… deep fried?Carla: [Helping herself to seconds] Mmmmm, I love fried stuff.Chris: Yeah, so, funny story: Dry-fried doesn’t mean that there’s no oil in the pan, or that they are charred, even though it sounds like that.Photo by Alex LauCarey: Yeahhhhh…Chris: It’s actually a technique where you blanch the beans in oil until the skins blister and split, and then you finish them with a bunch of aromatics. There’s no thick sauce, no wet stuff added.Carey: How much oil are we talking about?Chris: Uh. A good amount.Molly: [From across the kitchen] Enough to cover! Ask him!Carla: Enough to cover?Chris: Listen. A typical recipe for these, they’d be submerged. Could be a cup, even two cups. I pulled it back to about a third of a cup, which is enough to generously surround the beans and do the business of cooking them right. But it’s not so much that you would have to drain the oil before the next step. You just add the aromatics and keep going.Carla: [Fishing around in her plate] Is this a fried crispy caper? You wild man, you.Carey: I’m loving the flavors, but this is not Sichuanese, this dish.Chris: No. I love the method, and I channeled zippy, savory, spicy finishers. Capers, garlic, crushed red pepper flakes.Carey: Cool.Carla: Ship it!If you are making this at home, and I highly recommend that you do, heed the recipe well. The oil is not going to overflow the pan, unless you get too handsy. Turn the beans with tongs in the hot oil, do not attempt to sauté-flip them up in the air. Once you add the garlic, capers, and chile, the clock is ticking—one minute goes by quickly. You want all those toasty bits, but you might not want all the oil, so serve with a slotted spoon.Get the recipe:Blistered Green Beans with GarlicGreen beans are shriveled and browned into delicious submission before receiving a flavor bomb of garlic, red pepper flakes, and chopped capers.View RecipeExplore Bon AppétitCarla NewsletterGreen BeanRead MorecookingHere’s What Makes BA’s Best Risotto Recipe So Damn PerfectBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Carla Lalli Music"]}