{"id": "4e2dc5cbe636248df73bf14f2b5bc6f5", "url": "https://www.bonappetit.com/story/dumpling-folding-guide", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "How to Fold Dumplings, Whether You're a Novice or an Expert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Fold Dumplings for Novices and ExpertsWith videos so that you can actually understand.By Hetty McKinnonApril 11, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Folding is the part of the dumpling-making process that takes the most practice. In fact, in many parts of the world, it’s an art form. At the cult Taiwanese restaurant chain Din Tai Fung, famous for its xiao long bao dumpling (soup dumplings), every morsel is made with surgical precision: Each piece of dough weighs 5 grams and is filled with 16 grams of filling, and each finished dumpling must have at least 18 delicate folds twirled to a close at the top. Luckily, at home we can be less precise.There are many ways to fold a dumpling, and while some are incredibly intricate and can take years of practice to master, simple techniques can also produce attractive homemade dumplings. If you are new to dumpling-making, start with less filling and the simpler folds and, as you advance, gradually increase both the amount of filling and the intricacy of the folds.Crimping or pleating dumplings takes practice and perseverance. Folding is personal, and you have to find the rhythm which feels right to you. Sometimes it might be more comfortable to pleat with your non-dominant hand, or perhaps you want to pleat the side of the dumpling furthest away from you (rather than closest, which is what I prefer). I encourage you to try it all and find the method which feels most comfortable to you. Also, I recommend consulting videos online for pleating tutorials; these have been hugely helpful for me when learning new folding techniques. And something that I always remind dumpling beginners: The pleats are mostly aesthetics, so even if they don’t look amazing, the dumplings will still taste delicious.Here are seven different folds, ranging from beginner to more advanced, that will give you a logical path to developing your dumpling-folding techniques. Apart from the gok jai pleat, which I learned as a child, these are the folds I practiced most on my own dumpling-making journey. Remember to try them out to see what feels most comfortable to you.The following folds are for round wrappers, unless otherwise specified. As a rule, store-bought wrappers need to be moistened around the edges with water, while homemade wrappers have enough innate moisture that they can be sealed without additional water (the exception being if they have been dusted with lots of flour. In that case, it may be necessary to dab with water to get them to seal).Entry-level:The Half-MoonThis is the simplest fold but produces a very nice dumpling. Place the filling in the middle of the wrapper, fold over and seal. Done! If you are planning on cooking them like a potsticker, press the bottom onto a flat surface to form a flat “seat” so they can sit upright.Silver IngotThis fold starts off like the half-moon and is similar to a tortellini. Place the filling in the middle of the wrapper, fold over and seal. Bring the two corners together to form a rounded bonnet shape and seal by pressing the corners together firmly.You can also use square wrappers here: Place the filling in the middle of the wrapper. Moisten the edge of the wrapper with a dab of water and carefully fold one corner over the filling to the opposite corner to form a triangle—make sure you enclose the filling tightly to avoid any air pockets. Bring the two base corners together, dab one with water, then overlap them and press to seal.This shape is particularly good for wontons (often served in broth, they also tend to be made with thinner skin), while the other folds are better for dumplings.When you gain more confidence:The Two-PleatPlace the filling in the middle of the wrapper, fold over, and seal in the center only. Now we are going to make one pleat on either side of the seal. Holding the side of the dough closest to you, use your thumb and forefinger to make one fold towards the center seal on the left-hand side. Do the same on the other side. Press along the top to ensure it is well sealed.The Four-PleatThis is the more advanced version of the two-pleat. Place the filling in the middle of the wrapper, fold over, and seal in the center only. Now we are going to make two pleats on either side of the seal. Holding the side of the dough closest to you, use your thumb and forefinger to make two folds towards the center seal. Do the same on the other side. Press along the top to ensure it is well sealed.A bit more challenging, but do-able:The One-Directional PleatThis one may take some practice but once you get it, it’s not too difficult. Place the filling in the middle of the wrapper, fold over, and seal on one of the bottom corners (it can be on the left or right, depending on what feels most natural to you). Holding the dough in your non-dominant hand, use your thumb and forefinger on the dominant hand to create pleats, one at a time, next to the sealed corner, pleating until you’ve reached the other end. Press along the top to ensure it is well sealed. When you pleat, you can pleat either the side of the dough closest to you or the side further from you. This is personal preference and the result will be almost identical.Gok Jai PleatGok Jai are a traditional dumpling from Guangdong Province in China, where my family is originally from, and this is the first fold that I learned growing up. Place the filling in the middle of the wrapper, fold over, and seal it all the way around, as you would with the half-moon fold above. Now, starting on the right-hand corner (or left, if that feels more natural to you), perform diagonal folds, almost like a twist, one after another, all the way around to the other side. The edge will look like a twisted rope.BaoThis fold is often used for xiao long bao (soup dumplings) or momos and requires pleating and twisting. You'll need homemade wrappers for this (store-bought wrappers are usually too small). Holding the wrapper in your non-dominant hand, place the filling in the middle of the wrapper, and make pleats with your dominant hand, rotating the wrapper as you go and bringing the dough together to look like a “moneybag.” When you get to the end, seal the wrapper by twisting the top.Time to try it!Pea and Ricotta Potstickers With Homemade Dumpling WrappersMaking fresh dumpling wrappers isn't hard when you have Hetty McKinnon to guide you. (But we won't tell if you use store-bought.)View RecipeTo Asia, With Love$43 at AmazonPartially excerpted from TO ASIA, WITH LOVE by Hetty McKinnon. Copyright 2020 by Hetty McKinnon. Published by Prestel, an imprint of Penguin Random House. Reprinted with permission.Explore Bon AppétitHow-ToDumplingsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-11", "author": ["Condé Nast", "Hetty Mckinnon"]}