{"id": "4e2f3417772de63ef6c8d74cb11dea2c", "url": "https://www.bonappetit.com/recipe/salt-and-pepper-pork-with-crispy-rice-cakes", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Salt-and-Pepper Pork With Crispy Rice Cakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSalt-and-Pepper Pork With Crispy Rice CakesBy Andy BaraghaniAugust 18, 20204.0(22)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYou’ll find Korean rice cakes, tteok, in all kinds of shapes and sizes—from long cylinders to thin, oblong rounds. While their flavor does not change according to shape, textures do. Thin rice cakes work well for this stir-fry, as they quickly absorb flavors and soften into crispy, chewy coins.Ingredients4 Servings8oz. Korean rice cakes2Tbsp. (or more) vegetable oil8oz. ground pork, turkey, or chicken12\" piece ginger, peeled, finely chopped2garlic cloves, thinly sliced4scallions, white and pale green parts only, thinly slicedKosher salt, freshly ground pepper2Tbsp. unsalted butter, cut into pieces1Tbsp. soy sauce1tsp. toasted sesame oilPreparationStep 1Place rice cakes in a medium bowl and pour in cold water to cover. Let soak 10 minutes. Drain, rinse, and pat dry.Step 2Heat vegetable oil in a large skillet over medium-high. Add pork and cook, undisturbed, until browned underneath, about 2 minutes. Break up with a wooden spoon or a spatula and continue to cook, stirring and breaking into large pieces, until browned all over but still pink in places, about 2 minutes more. Add rice cakes, ginger, garlic, and half of scallions; season with salt and plenty of pepper. Cook, stirring occasionally, until pork is cooked through and rice cakes are browned in spots, about 4 minutes. If pan looks a bit dry at any point, pour in a little more oil. Remove pan from heat; add butter, soy sauce, and sesame oil and toss to coat.Step 3Transfer pork mixture to a platter and top with remaining scallions.How would you rate Salt-and-Pepper Pork With Crispy Rice Cakes?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis was good. I had the thicker rice cakes so I parboiled them, drained and then fried/browned. I followed the rest of the instructions and added the browned noodles back in. Served with chili crisp.RobMcDPhoenix, Az12/1/2020My husband and kids (9 and 11) loved this (they love rice cake). I do add chili garlic sauce which I think makes all the difference. Making it again tonight for the 3 time - it is now requested often. AnonymousWynnewood, PA10/26/2020My first experience with rice cakes, I was skeptical, but it seemed like a recipe I could put together fairly quickly on a weeknight. I had to consciously remind myself not to stir. I'm a stirrer, so it was killing me to let it sit and crisp up. My wife loved it, but we both agreed it could easily be augmented with some other veggies, carrots or bok choy, a skinny Asian pepper. Still, we enjoyed it and will make it again. My fancy wife wishes to thank BA for my continued culinary exploration. Thanks, Andy, for a repeat-worthy recipe!thejeffersonRGV, TX10/14/2020Yummy! The best way to get the rice cakes crispy is to let them sit, like the recipe says, until they get crispy. Rice cakes are always a bit chewy so some were, but most had at least one nice crisp side. The only downside to this recipe is that it only serves four as a main dish, with accompaniments. We served it with sautéed broccoli and pickled daikon. AnonymousRedmond, WA9/28/2020This was just so-so. A friend who regularly shops at an Asian market had tteok, so brought some for me and they looked exactly like what is pictured in the recipe. This was super quick and easy to throw together - 30 minutes start to finish. The final texture of the rice cakes was definitely not \"crispy, chewy coins\" - chewy, yes. Crispy? Not at all. But we still liked it. I was more bothered by the oiliness. I did have to add a little more to the pan, as the recipe said, since the rice cakes really liked to stick. We also felt like more veggies would help. The homemade daikon kimchi that the same friend brought me was a great accompaniment to add some crunch and flavor. I may try this one again, but with some tweaks.txhuskerTexas9/13/2020Warning:read the directions on the rice cake package! Some types need to be soaked for 10+ hours (or could try pressure cook for 30 min). I learned that the hard way since this isn’t an ingredient I typically use outside of soup. \n\nAlso, I got the feeling this recipe is missing something. Can’t figure out what to add other than straight up MSG/Chicken Bouillion. Tried: Korean red pepper flakes, Japanese red pepper powder, sesame oil, double garlic, furikake LOL, habanero Taijin ROFL. AnonymousLos Angeles, CA9/13/2020Just know what you're getting into with rice cakes. IF you can get them crispy on the outside, they are gummy bears on the inside. I was prepared: I had regular rice on standby, which we used after fishing out the gummy rice cakes. You can even tell by the photo BA used that they are not crispy. Do better, BA.KevinRAtlanta9/3/2020This is a great, simple recipe. We went to our local \"China-Town\" style market to get the rice cakes. It came together easily and had a nice flavor and texture. The crispy rice cakes were awesome.cbruettSalt Lake City, Utah8/28/2020nah that's not how you make nian gao/tteok. try recipes from woks of life and/or maanchi instead.Anonymous8/21/2020Explore Bon AppétitStir-FryKoreanEast AsianAsianGround PorkPorkMeatGingerHerbs & SpicesKorean Rice CakeNoodlePasta & NoodlesQuickEasyWeeknight MealsMainSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Andy Baraghani"]}