{"id": "4e4301e6a07ed8c5dc131fa63669d466", "url": "https://www.bonappetit.com/recipe/poul-ak-nwa-chicken-with-cashews", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "Poul Ak Nwa (Chicken With Cashews) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPoul Ak Nwa (Chicken With Cashews)By Lesley EnstonJanuary 11, 20223.9(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susan OttavianoEmailPinterestPrintEmailPinterestPrintOriginating in northern Haiti where cashews grow abundantly, this aromatic chicken stew is usually reserved for Sunday dinners or special occasions. Simmering the chicken before browning it may seem counterintuitive, but this commonplace Haitian technique infuses the chicken with flavor and moisture. Though not included in this version, another traditional step involves washing the chicken with warm water and lime juice, which removes the raw chicken smell and adds another layer of seasoning from the limes.The chicken is packed with flavor thanks to the mainstay Haitian spice blend, epis (you can read more about epis here). Just as no two sofrito recipes are alike, the same goes for epis—other common epis ingredients include cilantro, cloves, and Scotch bonnet chiles. This recipe makes more epis than you need for the chicken, but the leftovers will keep for weeks in the fridge (or months if frozen in ice cube trays). Use some as a marinade for pork or fish; stir a couple of tablespoons into soup and stew bases; add a spoonful to rice along with the water before cooking; or add a dollop to sautéed greens. —Lesley EnstonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonDutch Oven$80 At AmazonSilicone Spatula$13 At BA MarketTongs$13 At AmazonCitrus Juicer$7 At AmazonSmall Saucepan$155 At AmazonIngredients4–6 servingsEpis1red bell pepper, ribs and seeds removed, coarsely chopped1green bell pepper, ribs and seeds removed, coarsely chopped1small onion, coarsely chopped3scallions, coarsely chopped1cup (loosely packed) parsley leaves8garlic cloves¼cup apple cider vinegar¼cup extra-virgin olive oil2Tbsp. fresh lime juice1tsp. thyme leaveschicken1cup raw cashews2lb. skin-on, bone-in chicken thighs, skin removed2garlic cloves, finely chopped4cloves2Tbsp. fresh lime juice1Tbsp. chopped parsleyFreshly ground black pepper2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus more1Scotch bonnet or habanero chile2Tbsp. extra-virgin olive oil2Tbsp. double-concentrated tomato paste2plum tomatoes, finely chopped1small onion, thinly sliced½green bell pepper, ribs and seeds removed, thinly slicedCooked basmati or jasmine rice (for serving)PreparationepisStep 1Blend or process red bell pepper, green bell pepper, onion, scallions, parsley, garlic, vinegar, oil, lime juice, and thyme in a blender or food processor until smooth (you will have about 3 cups).Do ahead: Epis can be made 2 weeks ahead. Transfer to an airtight container and chill, or pour into ice cube trays and freeze up to 3 months.chickenStep 2Bring cashews and 3 cups water to a boil in a small saucepan. Reduce heat to low, cover pan, and simmer until a cashew crumbles but doesn’t disintegrate when pressed between your fingers, 45–60 minutes. Drain cashews and set aside.Mix chicken, garlic, cloves, lime juice, parsley, thyme, a copious amount of black pepper, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and ¼ cup epis in a large Dutch oven or other heavy pot until chicken is coated. Nestle chile in the center of pot, cover, and set over medium heat. Bring to a simmer and cook until chicken is nearly cooked through and a lot of juices have cooked out, about 30 minutes. Transfer chicken mixture to a medium bowl, scraping any remaining seasonings out of pot with a heatproof rubber spatula.Step 3Pour oil into same pot and increase heat to medium-high. Using tongs, return chicken to pot, leaving juices and chile behind in bowl. Cook chicken, turning occasionally, until browned all over, 5–10 minutes. Reduce heat to medium-low. Add tomato paste and cook, stirring often and adding 1 Tbsp. chicken juice if starting to burn, until paste is slightly darkened in color, about 2 minutes. Add tomatoes and cook, stirring often, until starting to soften, about 4 minutes.Step 4Add cashews, reserved chile, and remaining reserved chicken juices to pot (make sure to keep chile intact; an open chile will add a lot of heat), then pour ½ cup water into bowl and swish around to pick up any seasonings left behind. Pour water mixture into pot. Bring chicken mixture to a simmer, cover pot, and cook until chicken meat is falling off the bone, about 20 minutes. Stir in onion and bell pepper, re-cover pot, and cook until vegetables are softened but still retain some bite, 5–10 minutes. Remove chile from pot; discard. Taste poul ak nwa and season with more salt and pepper if needed.Step 5To serve, divide rice among shallow bowls and ladle poul ak nwa over.Do ahead: Poul ak nwa can be made 1 day ahead. Cover and chill. Reheat over medium-low before serving.How would you rate Poul Ak Nwa (Chicken With Cashews)?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is more of a 4.5. I recommend making this in advance of when you want to eat it. It’s delicious and even better the next day.AnonymousNYC 1/24/2022Sounds good. I can't  wait to try it.AnonymousFlorida 1/19/2022As the previous comment by Matt D said, a step is clearly missing from the recipe. To avoid salvaging a burnt down dish, I added about 1 cup of chicken broth along with the chicken, epis and other ingredients. Plenty of \"chicken juice\" remained after this initial 30min, so I omitted the 1/2 cup of water added later. The result was quite nice and plenty saucy. However, while it is a time consuming (and confusing to follow) recipe to make, I was not rewarded with the flavor bomb I expected even though I double the amount of epis used in the dish. I think I would add triple or quadruple the amount of epis if I were to do it again. The epis on ots own is fantastic, I see a lot of uses for it, would even be good as salsa verde on some tacos. Overall an o.k. dish, long prepping and cooking time - would probably not do again.FelixMontreal1/19/2022I think something may be missing in this recipe. Cooking the chicken for 30 minutes in a Dutch oven at medium heat with minimal liquid  results in a burnt Dutch oven. We still salvaged an edible dish but missed out on whatever juices were supposed to have been created.Matt GChicago,IL1/18/2022While it is common in many cultures, including t beans, to wash and “lime” meat, the practice should not be necessary in North America, and in fact, should not be followed  as it can spread any surface contaminants throughout the bird or piece of meat!\n\nWhile the dish itself is likely very good, cashews sold as “raw” are actually somewhat  processed, as  truly raw cashews contain a toxin.\nAnonymousToronto1/13/2022Explore Bon AppétitDinnerHaitianCaribbeanStewSoups and StewsChickenPoultryChicken ThighCashewNutBell PepperVegetableScotch BonnetChileHabanero ChileMainGluten-FreeDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-11", "author": ["Condé Nast", "Lesley Enston"]}