{"id": "4e608422976252496ac306147e159216", "url": "https://www.bonappetit.com/recipe/buttery-tomato-cinnamon-rice", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Tomato Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButtery Tomato and Cinnamon-Spiced RiceBy Andy BaraghaniAugust 11, 20204.6(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown EmailPinterestPrintEmailPinterestPrintThis Persian rice dish, known as kateh gojeh farangi, is the ideal late-summer comfort food. The cinnamon tames the natural acidity of tomatoes, creating a sweet-savory aroma and flavor. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.Ingredients4 servings3Tbsp. vegetable oil1large onion, thinly sliced3garlic cloves, thinly slicedKosher salt, freshly ground black pepper3Tbsp. double-concentrated tomato paste2medium tomatoes, halved crosswise, seeds removed, coarsely chopped2cups long-grain white rice (such as basmati or jasmine), rinsed until water runs clear½tsp. ground cinnamon½tsp. ground turmeric2Tbsp. unsalted butter, cut into pieces⅓cup coarsely chopped cilantro, dill, or mintPlain whole-milk yogurt (for serving)PreparationStep 1Heat oil in a medium pot over medium. Add onion and cook, stirring occasionally, until softened and golden brown, 8–10 minutes. Add garlic, season with salt and pepper, and cook, stirring occasionally, until garlic is softened and onion is lightly charred around the edges, about 5 minutes.Step 2Stir tomato paste into onion mixture and cook, stirring often, until slightly darkened in color and beginning to stick to bottom of pot, about 3 minutes. Add tomatoes and cook, still stirring, until tomatoes burst and mixture starts to thicken, about 5 minutes. Add rice, cinnamon, and turmeric and cook, stirring, until spices are fragrant, about 30 seconds.Step 3Pour 2¼ cups water into pot, give the mixture a stir, and bring to a boil. Reduce heat to low and cover pot. Let steam until water is absorbed and rice is cooked through, 20–25 minutes. Remove from heat and let sit (still covered) 10 minutes. Uncover, add butter, and fluff with a fork.Step 4Serve topped with herbs and dollops of yogurt.How would you rate Buttery Tomato and Cinnamon-Spiced Rice?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleI'd love for all these recipes to be on 1 page. I love them all but so much printing!\nkathrynnew bern nc11/30/2021I made this shortly after I got the issue. Tomato and cinnamon are a heavenly match...I love it so much!  I found that I could make the tomato-based portion of the recipe and add the cooked rice later.  I packaged up the tomato mixture into 8 oz. containers and froze it. It's a wonderful quick meal if you defrost and add to cooked rice. Last night I pulled one out and added about 10 chopped shrimp I sauteed quickly in a bit of butter. Added them to the base and mixed in the Basmati rice. It was fantastic! I plan to always have some on hand in the freezer. MaryAnn NeblockSE Pennsylvania10/2/2021Brilliant. The flavor combination is just awesome.Anonymous8/25/2021I thought this was really easy to make and rather tasty. I added an extra cup of water and the rice cooked just fine. I added a lot of salt. This is good, but not overly flavorful. John SAkron, OH11/9/2020Ahhh amazing! Made this with Andy's Kohresh Bademjan recipe and it went so well togetherAnonymous10/11/2020This was simple and tasty. Ate it with some baked tofu that I had marinated in a combination of Persian flavors (dill, turmeric, lime juice). I think it would go great with falafels and lemony tahini sauce or yogurt.Montreal10/6/2020Incredible!! Andy B with another home run!!  I halved the amount of rice and water and left everything else the same AnonymousWinnipeg9/15/2020This. Was. The. Best. Thing. I’ve. Ever. Cooked. I went back for thirds!!!!!! I texted my fiancé at his bachelor party to tell him what he’d missed and that despite the fact that I made the full recipe, there might not be any leftovers. Incredible. I used an enameled cast iron and cooked for 22 minutes. Next time I will only go 20. I have a cherry pie in the oven that I might forego just so that I can eat more rice. e_d_gNew Hampshire9/6/2020I think using ripe tomatoes in season is key for flavour here.   I had some beautiful heirlooms and it turned out well.   Easy recipe.AnonymousVancouver BC9/5/2020This dish wasn't flavorful, I think there was too much rice to the other ingredients. AnonymousPhoenix, AZ, USA8/25/2020Delicious! My family gave me weird looks when I mentioned tomato and cinnamon in rice, but they came back for thirds, will make it again!AnonymousVictoria, Australia 8/21/2020how could you adapt this recipe only using fresh tomatoes?  it's a farmers market challenge so shouldn't it focus on fresh ingredients?  I'm sitting on a bumper crop of tomatoes... :) Anonymous481188/17/2020I know it would throw off the authenticity of the dish but would it work texture-wise if I used coconut oil instead of butter for finishing to make it vegan?AnonymousTurkey8/14/2020This was great rice. Made a batch to pair with some pastrami beef ribs and watermelon basil salad. Kept really well and has made good leftovers too. AnonymousSanta Ana, CA8/14/2020I guess I should’ve known better. I make rice regularly and I should have realized that the percentage of water to rice was way off. The dish would’ve been nice except it never cooked, it turned out mushy when I added more water and now I have to throw out my expensive imported basmati rice. I’ve never had a Bon Appétit recipe turn out so badly.AnonymousFlorida8/14/2020Explore Bon AppétitPersianMiddle EasternRiceRice & GrainsCinnamonHerbs & SpicesTomatoVegetableSummerEasySideNut-FreeGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-11", "author": ["Condé Nast", "Andy Baraghani"]}