{"id": "4e6793af33a424f576f7ed8ed44edf09", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/la-banchina", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "La Banchina Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenLa BanchinaGet real R&R in at this Amager Harbor vegetable-focused restaurant with a few surprisesFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for an out-of-the-way magical mini-vacation. This harborside shed, a healthy bike ride out of town (though not too far from Noma 2.0), has two personalities: a stay-all-day spot with a sauna, available year-round, and in warmer months, a swimming spot with natural wines.TAKE IN THE: view! In winter, it’s a café with breakfast, lunch, and a handful of tables for the evening tasting menu, a Nordic affair using Italian ingredients. Regulars bring their bathing suits for the sauna, and during long summer nights, the pier fills with swimmers and natural wine drinkers who dip between sips.THE VIBE IS: casual and incredibly charming.PRACTICAL STUFF: From October through April, it’s open every day: Monday to Friday from 8 a.m. to 4 p.m. and Saturday and Sunday from 9 a.m. to 4 p.m. From May through September, it’s open every day: Monday to Friday from 8 a.m. to 11 p.m. and Saturday and Sunday from 9 a.m. to 11 p.m. Dinner is available during the winter via reservation, Thursday to Sunday from 6 p.m. to 11 p.m.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEAmassHidden in Refshaleøen, an elaborate root-to-stem tasting menuRelæLive a little with the Nørrebro tasting-menu restaurant that’s still making waves Den VandretteGet your L’Anglore fix at this sunny Indre By wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}