{"id": "4e857bc0e63e163411af16502824197a", "url": "https://www.bonappetit.com/story/vegan-chicana-chefs-la", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "These Vegan Tacos Are More Than a Trend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureThese Vegan Tacos Are More Than a TrendFor a growing group of Chicana cooks, eating meat-free is about reclaiming their roots.By Lesley TéllezFebruary 13, 2020FacebookTwitterEmailPhoto by Graham WalzerFacebookTwitterEmailIt’s Friday night on a busy street corner in Los Angeles’s Koreatown, and Denise Vallejo showers a handful of cilantro over a flour tortilla piled high with grilled seitan and her signature melty cassava-flour-and-cashew cheese. Her “Chicali” taco, a vegan version of the carne asada tacos sold across Mexicali, a city in northern Mexico where Vallejo’s family is from, costs $7, on the higher side for the neighborhood.But people line up regardless. They’re drawn to her food and her philosophy: that Mexican cooking can be vegan, and that rooting out animal-based ingredients is actually better for Latinx bodies.Vegan Mexican food as a concept isn’t new in Los Angeles. But for years the cuisine has been positioned in wealthier, whiter neighborhoods on L.A.’s west side, and not the Spanish-speaking communities east of and near downtown. According to the USDA’s Food Access Research Atlas, nearly all of L.A.’s food deserts—low-income areas with limited access to supermarkets—sit in heavily Latinx neighborhoods. Recently, a growing number of Chicana chefs have launched their own niche food businesses, evangelizing the benefits of Mexican vegan food with the city’s Latinx populations in mind.Photo by Graham Walzer Denise Vallejo, Alchemy OrgánicaVallejo, and others like her, push vegan food not only because of its health benefits (Latinx populations/communities nationwide have soaring rates of obesity and diabetes), but also because it’s a way to reject the modern narrative of Mexican cooking as being heavy on cheese, meat, and lard.When she first went vegan in 2008, after her father had a stroke and her aunt was diagnosed with cancer, Vallejo got flack from her Mexican American friends who told her she wasn’t being true to her heritage. Her response was to dig into the roots of Mexican cuisine and create the food that she wanted to eat. “Once you start researching the things we ate before the Spanish invasion, it’s like, ‘Oh, this is what we’re supposed to eat.’” Before the conquest, the average indigenous diet would have included foods like tomatoes, squash, amaranth, corn, beans, and chiles. It wasn’t until the Spaniards brought pork, sugar, and wheat in the 16th century that these ingredients were integrated into indigenous diets. “People are getting sick all the time because they’re eating too many colonial foods,” Vallejo says.A huarache with mashed black beans, tofu queso fresco, crispy mushroom chicharrón, cactus salad, and micro herbs.\nPhoto by Graham WalzerNow she sees more and more people lining up to eat her food at Alchemy Orgánica, which has occupied the same corner, painted with a cartoonish mural of her face, since October 2018. Vallejo, who lives nearby, offers a sliding scale for locals, the elderly, and people with EBT cards. But plenty of customers seek her out from her Instagram account and pay full price. She also hosts monthly multicourse vegan supper club dinners (tickets are $120 apiece) at private spaces around L.A., where she eschews mock meats and focuses on plants.It’s an enticing puzzle to solve: How do you capture the essence of a dish you grew up with and love, without the ingredients that made you love it in the first place? “I’m on my own little mission, my own journey,” she says. “And I’m finding a lot of other people who are joining me on the path.”Photo by Graham WalzerJocelyn Ramirez, Todo Verde“What you’re trying to capture is the nostalgic effect that food has on our body, our brain, our emotions,” says Jocelyn Ramirez, chef-owner of Todo Verde, an L.A.–based vegan catering business and pop-up.Ramirez grew up eating a fair amount of processed food; her immigrant parents worked long days, she recalls, and were often too tired to cook. After struggling with her own health issues and supporting her dad through two bouts of cancer, Ramirez decided to start cooking plant-based meals for the whole family, tweaking her family’s favorite Mexican and Ecuadorian dishes (Ramirez’s father is from Ecuador.). They loved the food so much, they told her she should open a restaurant.In 2015 she launched a line of smoothies at three farmers markets on L.A.’s east side and one downtown. The Brown Power, a mix of raw cacao, oats, kale, vanilla, dates, and almond milk, was an immediate hit; Ramirez said her customers told her it reminded them of Choco-Milk, the fortified Mexican chocolate milk powder ubiquitous in their childhoods. Today Ramirez and her 12-person staff cater weddings and private events and have a stall at Smorgasburg downtown. There, smoky mushroom tinga and jackfruit tacos smothered in her grandmother’s earthy pipián rojo—both served on freshly pressed, organic corn masa tortillas—are the biggest sellers. On the catering menu, Ramirez puts a healthy spin on classic Mexican dishes, swapping in julienned squash for her fideo (a dish usually made with fried noodles), and black rice and golden raisins in her arroz con leche.Clockwise from top: Cremini mushroom tinga, jackfruit al pastor with salsa verde, oyster mushrooms en mole almendrado, and jackfruit with pistachio pipian verde and cashew crema tacos.\nPhoto by Graham WalzerShe says she’s targeting a very specific customer—Latinas from 24 to 35 years old who want to eat consciously but still want the food to taste somewhat familiar.“Prior to the last few years, whenever you looked at the food companies in the health category, they were all geared toward white folks. You haven’t really seen people of color becoming prominent figures within that space,” Ramirez says. That presence—and the food—is striking a chord with her customers. “They’re like, ‘That person looks like me, that person looks like my family member, that food looks like what I eat at home.’ It’s a sense of connection that I think Latinos haven’t felt in a long time.”Photo by Graham WalzerDesiree Flores, Dear Mama LADesiree Flores didn’t initially embrace veganism to be healthy. At 17 she’d watched a documentary about the mistreatment of animals and workers at factory farms, and what she saw convinced her to eat plant-based foods. After becoming vegan, however, she became starkly aware of how few food options were available in her community.She started to make tortas for herself and friends, and then in 2016, she cooked lard-free jackfruit tamales in salsa roja for a local underground supper club, the now-defunct Green’s Center for Plant Based Nutrition. Encouraged by the positive reception, she made a second appearance, with a jackfruit version of her grandmother’s birria, spooned into tacos and topped with a crunchy red cabbage chipotle slaw. She launched Dear Mama LA, her vegan pop-up and catering company, shortly thereafter. Then in August, Flores and some friends created Veganos en East Los, a monthly plant-based pop-up event featuring food vendors and artists across East L.A. and Boyle Heights. The first event drew nearly 300 people, surpassing her expectations.The Mulita de Birria. Two hand-pressed tortillas stuffed with jackfruit and topped with cashew crema, green tomatillo salsa, and black salsa.\nPhoto by Graham Walzer“Hopefully we’re leaving a mark on Mexican food and Mexican traditions, and educating the community that you can still have the food and flavors you’ve always enjoyed, just in a different form,” she says. “It’s still there and it’s still delicious.”Lesley Téllez, born and raised in Southern California, is a writer in New York City. She is the author of Eat Mexico: Recipes From Mexico City’s Streets, Markets & Fondas.Want More Stories From Taco Nation? Right This Way...In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoWhy Are H-E-B’s Flour Tortillas So Dang Good?How the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Cooking in the Midst of a Border Crisis Is About More Than SurvivalThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayAnd so much more!Explore Bon AppétitTaco NationChefsLos AngelesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Lesley Téllez"]}