{"id": "4e88ae2036a86c6c043b173fc108538c", "url": "https://www.bonappetit.com/story/tempeh-crumbles", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Tempeh Recipe Is My Weeknight Wingman | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleTempeh Crumbles Are My Weeknight WingmanGlazed with a sticky and spicy honey-sambal sauce, they’re good enough to eat by the handful.By Sarah JampelApril 3, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.My relationship with tempeh changed when I started to think of it more like bacon and less like steak: Instead of cooking it in big slabs that would take up the majority of the plate, I treat it as an accessory, adding flavor, texture, and the ever-elusive protein to my vegetarian dinners.So while you won’t find me making tempeh burgers, you will find me snacking on walnut-sized crumbles when my plate is particularly vegetable-heavy and protein-light (like, when I’ve taken the time to make pan-roasted romanesco and haven’t thought beyond that). Glazed with a sticky and spicy honey-sambal sauce, they’re good enough to eat by the handful and versatile enough to go on top of what I’ve already put together, like these peanutty noodles.Tem-pay (not tem-pee, as in the city in Arizona) originated in Java several centuries ago and spread to other parts of the world in the twentieth century. Whereas tofu, often uttered in the same breath because it’s also a soy-based protein source, starts with soy milk, tempeh begins with whole soybeans that are partially cooked and fermented, during which time they become bound together in a cohesive, web-like mat (if you want to get sciencey, this “mesh” is the mycelium of the fungus Rhizopus).Tempeh can be sliced and deep-fried, pan-fried, roasted, braised, steamed, incorporated into curries, stews, chilis, stir-fries…I’ll stop but the list goes on. (Sometimes there are grains like millet, barley, and brown rice in the mix, too, which is why you’ll see tempeh labeled as three- or five-grain. I like both 100-percent soybean tempeh and grain-bolstered mixes, and I buy the widely available LightLife brand.) The texture is firm, dense, and not at all watery; the flavor is earthy, nutty, and rich (though not overwhelmingly so).I consider these distinct characteristics to be a head start towards deliciousness. Whereas tofu is a soy chameleon—blend it into vegan frosting, churn it into ice cream, or magic it into creamed spinach—tempeh is distinctly...tempeh. (Yeah, don’t try to blend it.) There’s a lot to work with from the get-go, which also means there’s less risk of screwing up.When I am cooking big pieces, be they cubes or triangles for a stir-fry or curry, I often steam or boil them first to ensure ensures that the tempeh is cooked through, with no lingering bitterness. If I’m riffing without a recipe, I’ll pan-fry those pieces in peanut oil (with a generous sprinkle of salt) until they’re deeply bronzed on both sides, then make a quick sauce to go on top, balancing tempeh’s natural earthiness with bright flavors that are spicy and acidic.But most of the time, I’ll skip the blanching and make faster, easier crumbles instead. (I admit that I make tempeh crumbles even more than I make tofu crumbles, my other great love, since there’s no flipping or pressing involved.) They accentuate any dinner I’ve already planned to cook and make the meals I definitely didn’t plan to cook (half a head of cabbage, braised? seven leftover egg whites from an ambitious ice cream project? peanut butter on toast?) a little more legit.Get your own weeknight wingman:Peanutty Noodles with Tempeh CrumblesTempeh skeptics, this recipe will make a convert of you.View RecipeExplore Bon AppétitThe Not Depressing VegetarianVegetarianVeganEgg NoodleHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-03", "author": ["Condé Nast", "Sarah Jampel"]}