{"id": "4e9270e53a0b31a20686e05baf3e663e", "url": "https://www.bonappetit.com/story/stanley-tucci-thanksgiving", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "What's Stanley Tucci Doing for Thanksgiving? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat’s Stanley Tucci Doing for Thanksgiving?The author and Hollywood star on his foolproof holiday strategy. (Yep, there’s a martini.)By Dawn DavisOctober 26, 2021FacebookTwitterEmailPhotograph by Myles NewFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Who but Stanley Tucci could charm us on social media with his Negroni-making skills, eat his way through Italy for a documentary series, and publish a food-heavy memoir all during a global pandemic? We almost forgot that he’s also a Hollywood star. But what we really want to know: What’s Tucci doing for Thanksgiving?1. First, a Martini“Too many people say too many things, and I wish they’d stop,” writes Tucci about the iconic cocktail’s origins. “The only thing that matters is that the martini exists.” Tucci has been drinking his the same way for ages: gin or vodka (each has its time and place) with just a whiff of vermouth, and stirred not shaken—sorry, 007. It’s “the quintessence of elegance that we all aspire to and believe we acquire when we drink one,” he writes.Do it like Tucci:Stanley Tucci’s MartiniGin or vodka? Tucci’s recipe allows for either, depending on your mood. Just make sure it’s stirred, never shaken.View RecipePhotograph by Emma Fishman2. Don’t Skimp on AppsTucci’s mother was all about the antipasti, even if there’s a big meal ahead. “There’d be cured meats like prosciutto and salami, cheeses, olives, roasted peppers; there might be raw seafood, almost like a ceviche,” Tucci recalls.Photograph by Myles New3. Stay ClassicWhat’s on Tucci’s table? Turkey, of course, and stuffing with water chestnuts and hunks of bread. The cranberry sauce is homemade and the sweet potatoes are baked with butter, honey, brown sugar, and maple syrup (no, three sweeteners is not overkill). For greenery Tucci does brussels sprouts with pancetta, obviously. Leftovers? An open-face turkey and gravy sandwich—cranberry sauce and mashed potatoes on the side.Photograph by Emma Fishman4. Bring Out the Good ChinaWhether he’s hosting a crowd or keeping it small, Tucci sets a formal table: china, flowers, candles, the whole nine. “When I was growing up, my dad, who is an artist, would always make little place cards,” he tells us. One year Tucci drew a cornucopia, then had it printed on his own cards.Photograph by Emma Fishman5. Bear Gifts“My parents never visited their parents without bringing something,” Tucci writes. They were all so focused on generosity that squabbles broke out practically every Sunday, with Tucci’s grandmother trying to pay for a chicken or even return cheese his parents had brought. Tucci “still cannot bear the thought of arriving at someone’s home empty-handed.” Italians often bring olive oil, bread, or salt; Tucci’s go-to is wine.Photograph by Emma Fishman6. A Few Words About Pasta“There’s always a place at the table for pasta” is a Tucci truism. His mom was even known to serve a pasta course before the Thanksgiving meal. But even Tucci admits that was extra. “Sometimes you just knew you had so much food that you didn’t really need the pasta,” he says. However and whenever you want your pasta, here are Tucci’s rules, as he tells it in his memoir, out now.“I feel it must be said that not all wheat flour pasta works with all sauces. The shape of the pasta is as important as the makeup and quality of its ingredients when it comes to the success of pairing it with the appropriate sauce; you might call it a divine coupling. “Italians are very, very, very particular about what pasta goes with what sauce. Only certain salse complement certain paste and vice versa. This is why in any worthwhile Italian cookbook there will be at most three different types of pasta suggested to accompany a specific sauce. There have been times when someone in my household (no names) made a traditional family sauce and served it with a completely incompatible pasta. I cannot describe the feeling I have when confronted with this. First, I am angry at myself for not being able to cook the meal, most likely because I was doing something annoying like acting (an activity that frankly is beginning to wear a bit thin as the years go by), and second, I am confounded that whoever made the choice (no names) does not innately know that, as per example, the combination of star pasta and a meat ragù is an act of heresy. As far as I am concerned, they may as well have just cut out my tongue with a broadsword and danced on the graves of my ancestors. “My suggestion to anyone who eats pasta either with or without gluten is, please pair it with the appropriate sauce and vice versa, because you never know who might be watching. Here are a few wonderful and, for me, acceptable combinations of paste and salse.”Spaghetti: Salsa pomodoro con tonno, carbonara, vongoleRigatoni: Beef-based ragù, all’AmatricianaDitali: Salsa pomodoro con piselli, salsa pomodoro con cozzeWant More Tucci?Taste: My Life Through FoodStanley Tucci is a winsome guide to the food of Italy, and his charm on the page is no less winning than it is onscreen. In his new memoir, Taste: My Life Through Food, Tucci shares his love for food, both Stateside and in Italy, in a wry and conversational tone. And he can’t help but offer some firm opinions on pastas.\n$28 $18 at AmazonExplore Bon AppétitThanksgivingItalianRead MorerecipesThe 69 Best Thanksgiving RecipesGallery69 SlidesBy Nico AvallecookingBehold! Our Easiest Thanksgiving Dinner Menu YetGallery6 SlidesBy Kendra VaculinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-26", "author": ["Condé Nast", "Dawn Davis"]}