{"id": "4e946152dda0ae00bc51bdbf7c195506", "url": "https://www.bonappetit.com/story/nutrition-school-diet-talk", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "I'm In Nutrition School But I Don't Want to Hear About Your Diet. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYes, I'm In School for Nutrition. No, I Don't Want to Hear About Your Diet.I’m not going to tell you what to eat, but I will tell you to stop stressing about it.By Christine ByrneMay 8, 2019FacebookTwitterEmailBy GraphicaArtisFacebookTwitterEmailA few months ago, I was introduced to a woman at a party. The introduction went something like, “Christine’s a freelance food writer, and she’s going back to school for nutrition next fall. Annie is super into nutrition!” Annie’s not her real name, but that doesn’t matter; I recently moved from NYC to North Carolina, which means I’ve been introduced to a lot of people at a lot of parties, and it often plays out this way. And, it makes sense: Wellness isn’t just in the zeitgeist these days, it practically is the zeitgeist—lots of people are really, really into nutrition. The thing is, I’m not.Or rather, I’m not into nutrition the way people expect. I don’t do diets, “biohacking,” green juices, or superfoods. I don’t believe in the kind of wellness that implies a certain way of eating (or doing anything, really) will make you “better,” or the assumption that everyone has the same values when it comes to health. And, almost always, this is the kind of nutrition that people want to talk about.I’m never sure how to navigate these initial conversations, though. Until I decided to go back to school to become a dietitian, my career had been an easy talking point that I took advantage of with new acquaintances. Some asked about my day-to-day—”What does a food writer do?”—and almost everyone wanted to talk about my favorite recipes and restaurants, and theirs. The same thing happens now, only it’s people telling me about their experience with intermittent fasting and waiting for me to weigh in, or turning down an IPA for a tequila soda (because keto) and expecting me to understand or, worse, to do the same.It’s not the conversations themselves that make me uncomfortable, since a non-committal nod and a quick subject change is an easy-enough way to sidestep diet talk. What’s started to get to me is all the things I don’t say. Like, “I know exactly what you’re talking about, because I used to think exactly the same way.” I know how compelling that nutrition stuff can be, but these days I think it’s bullshit. In fact, I’m going back to school in order to help people tune out that wellness-y diet noise.Before you read that as condescending, hear me out on the backstory. My first job after college was as a line cook in a restaurant, and my second was as a digital food editor. As I found my voice as a food writer (or my “brand,” as I’m sure I thought of it then), I also happened to find CrossFit. For a while, food and fitness were just two different things that I was interested in at the same time. Pretty quickly, though, I fell (deep) down the rabbit hole of clean eating and paleo and “good” carbs—bits of diet culture that exist everywhere but are especially prominent in fitness communities. My writing followed suit, and I rode the wave of the millions and millions (literally!) of people who were eager to read about these things.I was still left with no idea how to talk about healthy eating in a way that was actually healthy.I don’t know when exactly, but after a while the diet talk started to feel...icky. For starters, I went out of my way to make sure it didn’t read like diet talk, because I knew, instinctively and from experience, that diets and weight loss were a slippery slope. I wrote about “wellness,” not weight loss, but the fact that it was literally a word-swap was one of the first tip-offs that maybe this wasn’t a healthier way to talk about food. Then there was the fact that, while it was so easy to find research and an expert opinion backing any nutrition philosophy, a lot of these philosophies were in absolute conflict. (If you’ve ever seen low-carb researchers and plant-based researchers going at it on Twitter, you know what I mean.) Skepticism kicked in, and I started questioning everything (and I quit CrossFit—way too much dogma).I pulled back from reporting on trendy wellness diets except to explain why not to try them, and instead wrote about a more accessible kind of healthy eating: Eat vegetables, don’t overdo it on the sugar, and stop worrying about food so much. But even that didn’t feel so great. Sure, it’s in line with the USDA’s dietary guidelines, but isn’t it a little bit hypocritical to give two very specific mandates and then follow them up with, “Oh but don’t worry about it!”? (By now I had settled into a new job at a more health-focused website, alongside people who were asking themselves these same questions.) Not to mention, even this seemingly flexible advice often came alongside pictures food that were gorgeous, expensive-looking, and culturally narrow. At the end of the day, it was still elevating some eating styles over others. And, I was still left with no idea how to talk about healthy eating in a way that was actually healthy.It wasn’t until I finally reached this breaking point that I found a whole other language for talking and thinking about food. Turns out, there’s a growing number of dietitians and other experts who have asked themselves these same questions and come to the conclusion that the healthiest way to talk about nutrition is to talk about nutrition a lot less. Instead of diets, they practice intuitive eating, which encourages people to ignore the nutrition rules and instead trust themselves around food. It’s a simple idea that ends up being pretty complicated, and several months into writing about it, I realized that I didn’t want to just interview experts anymore—I wanted to be an expert.So, yes, I’ll be spending the next two years learning about nutrition and public health. That doesn’t mean I want to know about your diet, or that I think you should care about mine. Nothing kills a conversation like the mention of Whole30—I’ve been that person, and I can tell you that the concept of a sweet potato “bun” isn’t interesting to someone who eats bread. If you want to make food small talk, tell me where I can find a decent bagel outside the Tri-State area. Otherwise, try something that’s not quite so loaded. Politics?Explore Bon AppétitHealthyishessayRead MoreLifestyleIs Your Wellness Practice Just a Diet in Disguise?By Melissa A. FabelloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-08", "author": ["Condé Nast", "Christine Byrne"]}