{"id": "4ea60e368995b1069da362e630ca515a", "url": "https://www.bonappetit.com/story/apteka-vegan-polish-food", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "I've Never Had Vegan Food This Rich, Savory, and...Polish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ve Never Had Vegan Food This Rich, Savory, and...PolishApteka is changing the game. By Allie WistOctober 31, 2019FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I first heard about Apteka during one of the recurring conversations I have back home in Pittsburgh with my mother. The one where she tells me how Andy Warhol came to her small town of Butler, Pennsylvania, in 1949 to say goodbye to his family before his big move to New York City. He was from a Polish family, you know, and his original Polish name was Warhola, which the Polish pronounce “voor-hole-ah”—not “war-hall,” she emphasizes—and oh, speaking of which, there’s a new Polish restaurant called Apteka. And it’s vegan.I was immediately intrigued by the promise of a restaurant simultaneously tied to the city’s long Polish history and rooted in the present (think natural wines, minimal decor with dried foraged flowers). Since the mid-1800s, Eastern European flavors made their way through Pittsburgh and the surrounding former steel county, including Butler, primarily in the form of pierogies, which have since been a staple in old-school delis, church basements, and late-night dive bars.But Apteka’s owners Kate Lasky and Tomasz Skowronski have changed the game with an entirely vegan menu. I was blown away on my first visit. They stuff thick, rough-hewn pierogies with smoky greens; ferment nuts to make creamy yogurts and sauces for tartines; and forage with Skowronski’s Polish parents for chanterelle mushrooms, which they pickle and serve as zakaski, a delicious spread of naturally leavened dark rye bread, fermented beet tops, and mushroom paté. The result is a menu of complex, earthy, meat- and dairy-free takes on everything spanning East of Berlin to Siberia, from traditional Eastern European stews enriched with beer broth to the ingenious gołabki, mushroom-stuffed cabbage. It’s one of the best dishes at Apteka: bundles of cabbage leaves filled with porcini and cremini mushrooms, smoked peppers, and herbs and swimming in a tomato broth. The whole thing is topped with an unbelievably dairy-like “double fat cream,” a rich yogurt made of cashews and almonds cultured with bacteria. It was both intriguing and nostalgic, with the type of comforting richness and complexity that you expect from a hearty stew.After that, I was sold on this whole Polish vegan food concept. Now I can’t stop telling all my friends about Apteka—minus the Andy Warhol part.Go there: AptekaExplore Bon AppétitHighly RecommendRestaurantsVeganPolishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-31", "author": ["Condé Nast", "Allie Wist"]}