{"id": "4eb6dcdb0ff6761b2a37007509f786c1", "url": "https://www.bonappetit.com/story/che-fico-chocolate-budino", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "How to Make Chocolate Budino, Which Is So Much Better Than Pudding  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Make Pudding When You Can Make Chocolate Budino?This new recipe from Che Fico in San Francisco is silky smooth heaven with candied walnuts on top.By Emma WartzmanSeptember 7, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI did something crazy this weekend. Now, before your head goes to all sorts of places it shouldn’t go, I will come right out it and say it: I made a dessert that didn’t involve plums. Or peaches. Or nectarines. Or berries. Nope, it involved chocolate. I’m sorry! But actually, I’m not sorry, because this Chocolate Budino with Candied Walnuts was truly delectable, light and rich, all at once.The dessert (budino is Italian for pudding, FYI) was devised by Angela Pinkerton, pastry chef at the Hot 10 winner Che Fico in San Francisco and streamlined for the home cook by the test kitchen’s Chris Morocco. It’s a bit of a project, though by no means an insurmountable one. The upside is that it tastes and looks like a restaurant dessert, too—so elegant, your guests will be oohing and ahhing and wondering if they’ll ever go out to eat again when instead they can just come over to your apartment.If you want to spend some quality time in the kitchen, you can absolutely do this all in one day. But if you don’t have the time, or you feel like splitting up the work into more approachable parts, make the candied walnuts ahead. As long as a week ahead! They’ll stay good...if you don’t eat them all before you get to the budino.Feel free to serve with gelato.\nPhoto by Alex LauNow about that budino. What makes this recipe so heavenly is its silky-smooth texture. This happens from the combination of chocolate, cream, sugar, and eggs. The eggs thicken the chocolate and cream on the stove, where the flame cooks the eggs just enough so that they create a perfect consistency. Overcook them, though, and your custard will turn lumpy.For this reason, it helps to have a candy thermometer (Morocco endorses this one). You can, in fact, wing it without, but having something to read the exact temperature will ease any doubts (you don’t want it to go over 180°)—or at least it did mine. If you decide to go the wild path, pay close attention and watch for the moment when the custard is thick enough to coat a spoon.Before letting the budino cool and firm up in the fridge, you add a small amount of olive oil, preferably Olio Verde for its decided grassiness, and salt. Suddenly the dessert goes from just plain sweet to something earthier and more complex.And as if that weren’t enough, the final presentation takes it even more beyond. The chilled budino gets topped with the sugared, golden-brown nuts that you definitely didn’t eat, a drizzle more of that olive oil, a sprinkling of flaky salt, and—wait for it—a turn or two of freshly ground black pepper to really push the savory notes, the subtlest hint of spice hitting your tastebuds before the sweet. Suddenly what you have in front of you is layered and nuanced, as if luscious chocolate budino wouldn’t be enough on its own.Get the recipe:Chocolate Budino with Candied WalnutsThis deliciously wobbly pudding is made with chocolate, milk, cream, and eggs and spiked with olive oil and salt. To die for!View RecipeExplore Bon AppétitChocolateDessertHot 10 2018The Hot 10CustardRead Morebest-new-restaurants3 Lessons I Learned Cooking at Che Fico, One of America's Best New RestaurantsBy Chris MoroccocookingThe Secret to the Drifters Wife's Crispy-Skinned Roast Chicken Involves Salt and... Scuba DivingBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Emma Wartzman"]}