{"id": "4f28770e0c0cb43ca45878745f8131c4", "url": "https://www.bonappetit.com/story/travel-cutting-board", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "This Mini Cutting Board Comes on All My Summer Road Trips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Mini Cutting Board Comes on All My Summer Road TripsA travel cutting board will expand your definition of “car snacks.”By Jaime StathisJuly 13, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’m a road trip pro. I’ve crossed the country a dozen times and have lost track of how many passes I’ve made between the Pacific and the Rockies. Stopping for a cup of local Maine chowder or a country store deli sandwich every hour (“to rest”) is a road trip highlight, but in states like Wyoming, Idaho, or Montana, it’s not unusual to have hundreds of miles between towns. On those legs, one must pack snacks. For years I’d pull over, grab my pocketknife from the glove box, and, in lieu of a cutting board, slice up an apple and some cheese on a paper plate, a plastic lid, or even a log if I was in the backcountry. I do not advise this from a safety or hygiene perspective, but for the most part it did the trick. That is, until I came across Piper Handcraft’s roadside cutting board. Now I don’t leave home without it.Photo by Emma FishmanTravel Cutting Board$45 at EtsyThis mini wooden cutting board is four by six inches—smaller than a typical paperback book—and comes in a leather carrying case to protect it from leaky sunscreen bottles and sand in the bottom of your beach bag. It’s also endlessly customizable: the leather case is available in eight gorgeous earth tones ranging from mustardy gold to cypress green, and you can opt to add a sheath for your pocket knife. Don’t have one? Purchase a set that comes with an Opinel knife and choose from a dozen MORE different colors and sizes.“A travel cutting board was something I wanted but couldn’t find, so I made it myself,” says Jen Bohman, the creative force behind Piper Handcraft. Jen sews the leather cases and her husband, John, a fine woodworker, crafts the beechwood boards, which are finished with food-safe lemon and mineral oil. It’s a true family business—their kids even help package orders.I’ve used my portable cutting board to split a food truck burger in half, pit farm stand plums, and quarter lemons and limes for jazzing up campsite cocktails. I’ve sliced tomatoes and onion to make on-the-move sandwiches and pickles and salami for charcuterie on the beach. They’re my go-to gifts for friends setting off on road trips, avid campers, and anyone heading to college, where space in a freshman dorm is tight. When I bestowed one upon my sister, she said, “Oh, great, I can bring it to Yosemite!” to which I responded dreamily, “You can bring it everywhere.” I own several, and while a couple of them migrate from purse to backpack to carry-on tote (sans knife), my original has a permanent home in the car, where it’s always ready for my next adventure.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-13", "author": ["Condé Nast", "Jaime Stathis"]}