{"id": "4f47be3a27ddee1341008c90374ab19a", "url": "https://www.bonappetit.com/story/abena-boamah-acheampong", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Everyone Wants Abena Boamah-Acheampong's Skincare Secrets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLike You Don't Want to Know Abena Boamah-Acheampong's Skincare RoutineThe founder of Hanahana Beauty has clearly figured it out.By  Siraad DirsheJanuary 17, 2019FacebookTwitterEmailPhoto by Jessica SarkodieFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.Hanahana Beauty isn’t just any skincare company, and Abena Boamah-Acheampong isn’t just any CEO. The 27-year-old former algebra teacher sources shea butter directly from female producers in Ghana to create the all-natural, silky smooth balms getting us through winter and beyond.Last summer, Abena Boamah-Acheampong was on a trip to Ghana’s northern city of Tamale when she met a collective of women producing shea butter from the seeds of native shea bushes. Most shea butter in Ghana is sold at local markets or to middle men who sell to large distributors overseas. “This group of women were so passionate about what they were doing, but they weren’t seeing the value they deserved,” says Boamah-Acheampong. After that trip, the 27-year-old returned to Chicago and founded the skincare brand Hanahana Beauty, using shea butter sourced from the same collective in Ghana. Here, the very busy entrepreneur describes what a perfect day looks like, the most important lesson she’s learned from starting a business, and who’d attend her dinner party (hint: Solange is a guest).I got the name Hanahana... my dad after I told him I was thinking about turning my love for making beauty products into a business. It’s actually a Twi (a dialect of the Akan language spoken in southern and central Ghana) word that means “something smooth and malleable.”I’m obsessed with skin care products because… they’re pure energy. They’re absorbed directly into your skin, which is why I’m super intentional about making Hanahana’s with lots of love, care, and good energy.The most important lesson I’ve learned is... to listen. In my personal life and with my business I strive for growth, and the only way I can do that is to listen to those around me, and to be super intentional about what I’m doing.People tend to forget that wellness means... not just the physical things you’re putting on and in your body but also being conscious of who you surround yourself with, what you put into your mind, and what you’re putting out into the world.The perfect day starts with... waking up without my phone, running by the water, praying, meditating, reading my devotional, then having a fresh juice.Being a middle school algebra teacher taught me… the power of taking care of myself. Unless I’m doing the things that make me feel well, I can’t have the impact that I truly want to have on the world.My goal for Hanahana Beauty is to… ensure Black women understand that these products were made with them in mind. So often, we aren’t thought about in the beauty industry, so it’s imperative they understand that we consider everything from our ingredient selection to our marketing with them in mind.Three products you’ll always find in my purse are… Hanahana's Shea Butter, Glossier’s Lip Gloss, and some form of rose water.My dream dinner party…would include Solange, my mom, Ms. Tina (Solange’s mom), Beyoncé, my Godmother, and Deun Ivory (fellow creative and friend), where we would dine on banku, okra stew, and jollof rice.Explore Bon AppétitPerson of InterestprofileHealthyishRead MoreshoppingThese Photos Show the Women Behind the Shea Butter in Your Beauty ProductsGallery5 SlidesBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Siraad Dirshe"]}