{"id": "4f5bf6f6e75b15661ce092cf69874e8b", "url": "https://www.bonappetit.com/story/best-coffee-subscriptions", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "The Best Coffee Subscriptions (2021) to Buy Online So You'll Never Run Out of Beans Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Coffee Subscriptions to Buy Online Right NowNever panic while scraping the bottom of the bean bag again.By Lauren JosephSeptember 24, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Mail-order groceries mean chile crisp anytime you want it, a freezer-stash of steaks come grilling season, and, most crucially for me, the freshest coffee. And the best coffee subscriptions out there not only provide excellent beans; they also fit your level of obsession. They’re great for fanatics who are militant about quality and wouldn’t dream of grabbing a stale bag from the grocery store shelf. But they're also perfect for people who are just getting into coffee, introducing you to different roast levels and origins so you can find your ideal cup.In fact, a rep from online coffee retailer Trade tells me that the most popular brewing method amongst their customers is the good old automatic drip machine. Nor are subscriptions only for those who embrace long-term commitment: all of our favorites come with easy cancellation or hold options, and you can either stick with one bag you love, or rotate in different coffees each delivery.All of the companies below will either roast your beans to order or time their shipments to coincide with a weekly or biweekly roast. We recommend you grind your coffee beans at home for max freshness—I’m partial to this Baratza machine, which is made with quality steel burrs that produce an even grind at 40 different settings and is easy to clean and repair—but many coffee subscription companies will ship you ground beans if you prefer.Read on for the best coffee subscriptions from teensy tiny craft roasters, comprehensive coffee emporiums, and everyone in between.For People Who Think Variety is the Spice of LifeThink of these companies like the general ed classes you took freshman year—you get to try a range of offerings from a variety of coffee roasters so you can decide what you like.TradeIf you’re just dialing in your coffee game, Trade is a one stop shop with hundreds of good options. I’ve long been a fan of Trade for its approachable brewing guides, wide selection of beans from craft coffee roasters, and its commitment to ethical sourcing. To find your ideal bean, you’ll whiz through a speedy quiz that clocks your preferred gadgetry—Chemex, French Press, coffee maker, etc.—before assessing your milk (non-dairy options included) and flavor preferences. Do you favor a light or dark roast? How funky are you willing to go? It ends with the all important question of price. Select a subscription in the $12.50-$14.75 range, or swing for the premium beans at $15-$22 a bag. Regardless, once you select your beans, they’ll be roasted to order and shipped directly from the roaster for maximum freshness. And whatever you choose, you can know that the company is committed to only working with roasters who pay farmers a fair price for their beans.Some of those roasters who work with Trade also offer their own subscription programs (including a few you’ll see later on this list). You’ll find legacy brands like Equator (their Prime Meridian bag was the perfect pairing for my recent AeroPress fixation) as well as tiny operations, like the family-owned crop-to-cup roasters Peixoto and Alma. And for that late afternoon cup? “We have a pretty large collection of really delicious decafs—such as Common Voice’s Perennial or Mother Tongue’s Decaf Fincas Mierisch—that are just as much a part of specialty coffee as their caffeinated counterparts,” says Maciej Kasperowicz, Trade’s Director of Coffee.Trade Coffee SubscriptionShop Now at Trade CoffeeAtlasAtlas’s coffee of the month club is the most affordable subscription on the list—a monthly half bag, which makes about 15 cups of coffee, is $9. It’s also the one for someone who is curious about trying new coffee but not obsessive about their brew routine, as the information included in each box focuses more on destination than on flavor details. Think of it as a thoughtful gift for that friend who is not embarrassed to put ‘wanderlust’ in their IG bio. Each month, Atlas ships out a bag of single-origin beans from a different country, each with a little card about the growing region and brewing tips.Choose whole bean or ground, type of roast, and frequency, then sit tight as your beans are roasted to order in Austin, TX before being shipped out to your doorstep. Tea people are in luck too: Atlas just launched a tea subscription, which sends out two varieties of single-origin tea (that amounts to about 30 cups) for $14/month. When it comes to tea, Atlas works directly with the tea estates to ensure farmers are paid fairly for the leaves.Atlas Coffee Club SubscriptionShop Now at Atlas Coffee ClubAtlas Tea Club SubscriptionShop Now at Atlas Tea ClubMistoBoxMistoBox also curates hundreds of varieties of quality coffees from small roasters around the US. To narrow down those 590 options from 52 roasters, you’ll complete a quiz on your coffee preferences, then choose a subscription that starts at $10.16/bag. Signing up for a larger subscription will snag you a discount—a dozen bags of coffee come at 15% off. Each bag is roasted to order, and either arrives whole or ground. (The grind's fineness is ideal for drip coffee.)Similarly to Trade, above, and Luna, Counter Culture, and Equator below, MistoBox places an emphasis on direct trade coffee—coffee with as short a supply chain as possible so that there are few (if any) middlemen between grower and roaster. There’s no regulating body (or even universal terminology!) within the industry for direct trade, and levels of transparency, sustainability, and frankly, ethics, can vary from roaster to roaster. Still, MistoBox does a good job of setting the bar above that of the mass coffee market. A few roasters on MistoBox to look out for in particular: Olympia Coffee and Onyx Coffee, which both publish annual reports detailing how much they pay farmers for their beans.MistoBox SubscriptionShop Now at MistoBoxFor Those Who Love a Heritage BrandThese are the OGs of coffee roasters. Although you’re committing to a single roaster with these subscriptions, most of these operations are big enough to give you a sizable variety of single origins and blends to sample.IntelligentsiaThis Chicago-based, 26-year-old company is one of the pioneers of direct trade coffee, which means not only have I loved every bag of Intelligentsia coffee I’ve ever tried, but I’ve also felt good about purchasing it from them. Choose from Intelligentsia's Choice subscription, which will send out a rotation of single-origin coffees on a delivery schedule that works for you, or customize your subscription by choosing your favorite blends. The straightforward, milk-chocolate-tinged House Blend is ideal for an automatic drip. Alternatively, try the Black Cat Classic Espresso, with flavor notes of molasses. I’d wake up at any time for a cup.Again, buying whole beans is the way to get the freshest cup of coffee at home. If you’re paying $19 for a bag, treat them kindly! Let them shine! Run 'em through the grinder each morning! But if you really must, Intelligentsia does something handy here for pre-ground coffee drinkers: they accommodate eleven different grind sizes. Chemex, Hario dripper, and even stovetop espresso are accounted for. The site provides quite a bit of hand holding and each bag comes with brewing method suggestions and instructions, so you can really dial in your ideal cup even if you don't have barista-level skills. Subscriptions start at $15/bag and always ship free.Intelligentsia SubscriptionShop Now at IntelligentsiaCounter CultureCounter Culture (a favorite of Chris Morocco) has storefronts in cities like Atlanta, Chicago, Seattle, and New York which, in non-Covid times, double as coffee training centers that host cuppings and tastings. Until those reopen, test out different beans through a subscription.Counter Culture believes in the “any coffee, any brew” idea, meaning they don’t specify which bags are best for espresso, or pour over, etc—although they do tend to roast the single origin beans lighter to showcase their unique flavors, so you may want to steer clear for espresso. (I’m partial to Big Trouble when I want something round and nutty in my espresso machine, FWIW.) Their subscription selection will walk you through flavor profiles of different beans, and how many bags you’ll need (you can select 4 bags/week if that’s your thing!). The starting price, for a single bag a month, is $13.50. Each bag is roasted to order and always shipped whole bean.Counter Culture SubscriptionShop Now at Counter CultureEquatorOne last old timer in the direct trade coffee world: Equator. In 1995, the same year that Counter Culture was setting up shop in North Carolina and Intelligentsia was getting its start in Chicago, LGBTQ-owned Equator was founded across the country in Marin, California. If you’re an espresso drinker, you might like Equator’s eleven dark roast blends, available in a $17/bag subscription. For all other brewing methods, select from a single origin or a blend curation, and let the team introduce you to new bags each week or month, depending on your preferred delivery frequency. I’m partial to the B’Cause Blend—$1 from the proceeds of each bag go to a rotating roster of organizations like the Oakland-based Young Women’s Freedom Center, which supports those impacted by incarceration. Equator has also teamed up with chefs, including chef and fellow Bay Area resident Dominique Crenn, to create specific blends that benefit restaurant relief. Subscriptions start from $14.50/bag and ship free with code COFFEECLUB.Equator Coffees SubscriptionShop Now at Equator CoffeesFor Folks Who Favor An Up-And-ComerIf you spend weekends cooking your way through a slew of somewhat obscure food Substacks, these are the small-batch bean operations for you.LunaHere’s a deep cut. Luna was first introduced to me by our own resident coffee nerd, Chris Morocco, who travels with a bag of their Techno Peach blend. The duo behind this tiny roaster (Laura Perry & Nate Welland) is known for their light, fruity blends and meticulously thoughtful sourcing. Subscribe to Luna’s two bag a month program and you might very well end up spending an afternoon reading the included zine about the differences between Ethiopian and Guatemalan beans, all while sipping a subscriber exclusive blend. It is very much, as Perry puts it, “the weird and wonderful world of coffee nerddom,” but any ingredient-obsessive can hop on board. If you’re counting down till Fat Gold’s November olive harvest, can rattle off where Diaspora’s spices are sourced from, and are a card-carrying member of Rancho Gordo’s bean club, you’ll love the Luna approach.The beans are roasted fresh each week, and subscriptions are shipped out directly after roasting. Subscribers can expect a mid-month shipment of two bags, along with the zine. Choose from two 250g bags for $41/month, or two 500g bags for $62/month, and let Perry and Welland surprise and delight you.Luna SubscriptionShop Now at LunaAlmaBags of beans from Alma, a crop-to-cup coffee producer, can be purchased on both Trade and MistoBox. But if you’ve dated around and decided it’s time to go steady, Alma operates its own subscription service. Alma is certified USDA organic, co-founded by a disabled army veteran and a fifth-generation coffee farmer, and is solely responsible for every part of the glorious coffee process. They own their own farms in Honduras, where all their beans are grown before being sent to their roasting facility, HQ, and coffee shop in Canton, Georgia. Select from eight different types of coffee including Alma’s classic blends, seasonally changing honey and natural process bags, a cold brew option, and decaf. I recommend starting with Passion, a medium-dark, smooth, chocolate single origin. Bags are roasted to order, can be shipped whole or in one of three grind settings (Keurig, pour over, French press), and start at $14/bag when purchased individually or in a 1 bag/week subscription. If you’re looking for a larger subscription, say, for your office, expect discounts up to 15% as you increase the number of bags sent per week. Subscriptions always ship free.Alma SubscriptionShop Now at AlmaKahawa 1893Margaret Kemunto Nyamumbo grew up watching Western coffee companies pay dismal prices for the coffee from her grandfather’s farms in Kenya. Now, her California-based company Kahawa 1893 sources all of its high-quality beans directly from female Kenyan and Rwandan farmers, all of whom are paid above industry standards. (Women make up 90% of the coffee farming labor force in Africa with only a 1% ownership stake, explains Nyamumbo.) From there, the beans are sent to San Francisco where they are roasted twice a week and shipped immediately. Nyamumbo recommends allowing light roast coffee to rest for seven days post-roasting for peak flavor—or, two or so days after it arrives—and a few days longer for naturally processed beans. (Naturally processed coffee, sometimes also called dry processed or unwashed, is dried for weeks in the sun before the beans are removed from the pulpy outer layer. That extra time together usually means a fruitier, brighter flavor than that of washed coffee.)Subscriptions, which start at $15.24/bag, can be made up of one of Kahawa 1893’s 13 single origins and blends on repeat or a rotating selection of beans with the Roaster’s Choice sampler subscription. Either way, you can choose from whole or ground beans—if you go for ground, know that it will ship as a medium grind, best suited to automatic drip machines or pour over. If you’re on the go a lot, scoop up the single serving to-go coffee packs, which steep like tea, for a quick fix in a pinch. And for those who just want the (very) occasional cup, Kahawa 1893 subscription options start at just one 12 ounce bag every 60 days.Kahawa 1893 SubscriptionShop Now at Kahawa 1893Now get to brewing:Explore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-23", "author": ["Condé Nast", "Lauren Joseph"]}