{"id": "4f5b7ec425dabd5d3e798182c6d443da", "url": "https://www.bonappetit.com/story/hiyayakko", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Hiyayakko Tofu Is a Japanese Dish of Silken Tofu Piled With Flavorful Toppings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSilken Tofu Lavished With Toppings Is My Ideal MealHiyayakko is joyful, decadent, endlessly customizable, and no-cook too.By Katie OkamotoFebruary 10, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek Brown FacebookTwitterEmailThis week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.The Japanese dish of hiyayakko can be exuberant, decadent, even sensual. It is also, essentially and unabashedly, a chilled block of silken tofu with toppings. (Hiya means “cold” in Japanese.)When silken tofu is fresh, it can be sublime, with a velvety richness, suppleness, and nuttiness unlike other tofu. Back when it was possible, I would often go to Hibino in Brooklyn just to eat its version of hiyayakko. The house tofu came in a small glass yogurt jar with two tiny spoons for sharing alongside a dish of minced scallions and grated ginger and a decanter of light soy sauce. When I can, I now buy fresh Meiji tofu in Los Angeles to use as my base.Even if you can’t get your hands on fresh tofu, it’s more than okay. Most often I grab a carton of shelf-stable Morinaga soft or firm silken tofu from the back of my fridge, drain out the excess water, and slip the brick into a shallow bowl or a plate with a lip. With a package of silken tofu in the fridge, you will always be ready to make hiyayakko. Actually, you’re already more than halfway there. Traditional hiyayakko is essentially a pantry dish, and there’s no need to even turn on the stove.In Japan, hiyayakko is typically mounded with grated ginger and chopped scallions and drizzled generously with soy sauce or ponzu. Optionally, you could add a handful of katsuobushi (bonito flakes) for more smoky-savoriness and that signature fluff, or toasted sesame seeds for their nuttiness and crunch. Other traditional Japanese toppings include thinly sliced shiso leaf, ume paste (from umeboshi, or salted sour plums), and grated daikon. One of my favorite summertime hiyayakko is a few pods of fresh okra chopped crosswise into thin sections. When drizzled with ponzu and a little toasted sesame oil, the okra gets slippery, a classic Japanese texture that’s extra refreshing with tofu.While hiyayakko is mostly served as an appetizer in Japan, I have made a meal of it between myself and my partner with a bowl of short-grain rice. When I was still inviting people over, it was fun to share with a crowd, encouraging a messy hedonism that’s good for dinner parties; you can’t scoop hiyayakko without making a mess.A composed hiyayakko can go in endless directions, depending on your mood and energy level. When it comes to toppings, it’s all about contrasts. The idea is not to mask the tofu (or heaven forbid, smother it) but to complement its creamy texture, cool temperature, and gentleness. Generally, the toppings should have a strong flavor, bring plenty of salt or soy sauce, and offer textural contrast. They should also be piled high, in my opinion, in a manner befitting a Gibson Girl.From there, the rest is up to you. I personally love the contrast of cold silken tofu with warm, luscious toppings and a little crunch. Try simmering handfuls of fresh cherry tomatoes in mirin and soy sauce until they are bursting and jammy, then pile them on your chilled tofu with caramelized onions and chopped toasted almonds. If you keep Spanish chorizo on hand, fry small cubes until they’re crispy, tipping the whole pan—including the still-sizzling oil—over the tomatoes right before you eat.This summery hiyayakko is topped with burst cherry tomatoes.\nPhoto by Emma Fishman, Food Styling by D'Mytrek BrownIn spring, if I have leftover fresh ricotta in the fridge that needs using, I’ll dollop that on top, cream on cream, and add peas, ponzu, and lemon zest. In the summer, I’ll top my hiyayakko with tender, broiled miso eggplant. To boost the sauciness, I mix tahini with a little sesame oil, rice vinegar, and soy sauce and pour that on top too. A shower of toasted sesame seeds makes it pretty.Perhaps my favorite iteration is with garlic shrimp. It’s not traditional, but it feels like a perfect expression of both my backgrounds, the Japanese and Spanish American sides of me. Grate a lot of daikon or radish and put a mound of it on top of your chilled tofu, with a little dab of yuzu kosho if you have some. Pour what seems like too much olive oil in a heavy-bottomed skillet, get it piping hot, and add a couple handfuls of small or medium shrimp, some crushed red pepper flakes, and as much roughly chopped garlic as you have the patience to prep. As soon as the shrimp has curled and cooked pink, tip them, garlic oil and all, onto the tofu, with some soy sauce.Get a spoon and some chopsticks, distribute the goods, and dig in. I promise, it’s a joy.Katie Okamoto is a freelance writer based in L.A. Explore Bon AppétitIt's That SimpleTofuBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-10", "author": ["Condé Nast", "Katie Okamoto"]}