{"id": "4f6372c2e052a4f4201d86282059429c", "url": "https://www.bonappetit.com/story/carnival-popcorn-bags", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "These Popcorn Bags Are the Best $4 I’ve Spent All Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Popcorn Bags Are the Best $4 I’ve Spent All YearCHEAP HAPPINESS. That’s all I’m after. And in this package of 100 popcorn bags, I’ve found it.By Alex BeggsMarch 1, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When a box of 100 paper popcorn bags showed up at my door, I remembered that I had bought them. I’d tacked them on to an order from Webstaurantstore when I was stocking up on boring necessities like deli containers, squeeze bottles, and a snow-ready doormat. All those things are great—buy ’em, use ’em, reuse ’em, etc. But these popcorn bags make me much much happier on a day-to-day basis, and they’re cheaper than an impulse purchase of Us Weekly in the cashier line.First of all, look at these bags. I believe that classic popcorn bags are some of the best-designed food packages (those big tubs at AMC used to advertise movies don’t count). The look has remained unchanged for decades. The graphics are simple but make the most of their small space. There’s enthusiasm, and stripes! They tell you what you’re gonna get. For further proof that popcorn containers are high art, let me point to Andy Warhol’s popcorn box quadrant, which I much prefer to his splashy Campbell’s soup cans.I’ll never forget the most beautiful popcorn bag I’ve come across, at a car rental office in Houston. (That’s exactly the kind of place where beauty hides. Are you looking for it?) It was red and orange with “Fresh,” “Pop,” and “Corn” on separate lines, and a row of white popcorn dancing on the bottom. You can buy 1000 of those bags for $20 here, which I should note, is a large quantity.The bags I bought, though, are red and tan, with bold vertical stripes and five dancing kernels at the bottom. They’re 1 oz., enough for three-to-four handfuls of popcorn. They read: “Pop Corn, Hot n’ Fresh.” $3.99 for 100 grease-resistant bags. The reviews, all two of them, are glowing.I’ve mostly used them to give away cookies and homemade nut mixes to friends, family, and the mail carrier. Around the holidays, I “wrapped” small presents in them. You could fill your popcorn bags with actual popcorn, take a walk around the neighborhood. If you’re sporty, you can pack your homemade date-and-cacao energy bites in them, tuck it in the back of your bike jersey/ski pants, and never have to worry about the oil staining your spandex. Fill a bag with breadcrumbs, feed some local pigeons—this is your carnival now. Store tampons in your purse in them. Mail your rent check in one (inside a larger envelope) to surprise and delight your landlord. I dunno, get creative!I have so, so, so many popcorn bags.Carnival King Popcorn Bags$4 at Webstaurant Store$11 at AmazonExplore Bon AppétitHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-01", "author": ["Condé Nast", "Alex Beggs"]}