{"id": "4f6d79dcab6ad956ebc050c7f17dc885", "url": "https://www.bonappetit.com/story/zuo-yue-zi", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "I Practiced Zuo Yue Zi From Afar When I Couldn't Be With My Sister After Childbirth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhen I Couldn't Be With My Sister After Childbirth, We Practiced Zuo Yue Zi From AfarI wasn’t supposed to be in charge of my sister’s ritual postpartum recovery. But when my mom couldn’t travel due to the pandemic,  it was up to me.By Charlene Wang de ChenJuly 29, 2020FacebookTwitterEmailIllustration by Lisk FengFacebookTwitterEmailAt 3:57 a.m. on Monday, March 30th, I was woken by a text from my brother-in-law: “Baby girl Ruby was born at 1:09 a.m.” It was my sister’s first baby, and our parents’ first grandchild. After exchanging excited messages with my family in our group chat, I got out of bed and walked to the still dark kitchen. I picked up a piece of ginger and a spoon and, standing over the sink, began doing what newly minted Chinese aunts have done for thousands of years upon receiving news of a birth in the family: I started peeling ginger.There are two cornerstones to observing zuo yue zi—坐月子\"—the ancient Chinese postpartum tradition of caring for new mothers: eating nourishing and restorative foods loaded with specialty ingredients, and confinement. Literally translated, zuo yue zi means “sitting a moon cycle,” and is a tradition that has been documented as early as 960 AD. With confinement pretty much taken care of by COVID quarantine, it was my job to provide my sister with the restorative dishes.The first on my list was ginger fried rice, a dish I was so familiar with I didn’t need a recipe. I used my cleaver to julienne two inches of peeled ginger to the width of matchsticks, and then with the flat body of the cleaver I smashed garlic, easing the dried peels from the cloves and releasing the juices as my mom had taught me when I was first learning to cook. My sister likes a lot of garlic, so I added a bit more than I knew the dish called for.Next up was jujube soup with goji berry and chicken, and two hot drinks, the first made with oats, ginger, and cinnamon, and the second with jujube and goji berries. Unlike ginger fried rice, I had no muscle memory for these things, so I cooked standing in the glow of my phone, carefully following recipes a friend had photographed from The First Forty Days, a book I couldn’t get a physical copy of in time for baby Ruby’s birth but whose guidance had nonetheless been an essential part of my crash course in zuo yue zi.Just a few months before, all I knew about this ritual was that it involved food. I had no idea which foods, let alone how to prepare them.As the reigning matriarch of our family unit, my mom was supposed to be in charge of making the zuo yue zi dishes for my sister, Tiffany, much like my great-grandmother had done for her. The plan was for my mom to fly from her home in California to New York and stay with me for a month to help take care of my sister. But as Tiffany’s due date drew near, and the pandemic unfolded at a furious pace, the number of confirmed cases and deaths mounting daily, the plan had to be scrapped. By late March, when my sister was about to deliver at NYU Langone hospital, New York City was the national epicenter of COVID-19. All non-essential businesses were closed, Governor Cuomo was on TV each day communicating a dire need for ventilators, and grocery stores, once mazes of high-stacked plenty had become chess boards for high-stakes maneuvers; bearing the burden of our collective anxieties about survival, scarcity, and preparedness.Not only could my mom not stay with me in New York City and prepare the zuo yue zi foods, just getting the basic ingredients would be a challenge.I have no experience caring for infants—I have never changed a diaper in my life and do not plan on having any biological children of my own. The responsibility of being my sister’s sole postpartum helper was daunting. But cooking? That I could do. I haven’t met a food challenge I didn’t relish, and preparing zuo yue zi during a pandemic would be the ultimate challenge.My husband Tony’s parents live in Beijing, so our awareness of COVID—and our concern for the health and safety of family—began in January. Tony runs a travel company focused on boutique travel to and from China (educational tours in China; private guides for Chinese travelers in New York City), which meant that our income was also affected starting in January.It was around lunchtime on March 12th that I learned that my building’s doorman had COVID. I’m a set decorator for film and television and that day I was preparing a set for a show filming the second to last episode in a season. By that evening the producers told everyone on the production crew that we were shutting down indefinitely—we could start collecting unemployment. Five days later our building doorman, Juan, died from COVID.With both Tony and me suddenly unemployed, and New York City getting worse by the minute, we considered joining friends who’d invited us to stay with them on their farm outside of Nashville, Tennessee. It sounded perfect. But my sister was pregnant. I couldn’t leave her behind.My sister Tiffany and I have always been close. I helped her buy her first fancy makeup in high school, I've helped her move into multiple apartments, and I helped plan her wedding. When we both ended up in the city––her for a job as an oncology nurse practitioner––it was no coincidence that our apartments were only four subway stops apart, mine in the South Bronx and hers in Harlem. Tiffany is the person I want to call when I’ve got good gossip, she’s who I call when I need to cry.I always assumed I’d have a role in helping her postpartum recovery, but I also assumed that, at least for the first few months, mine would be a supporting role. My mom would be the lead, there to guide my sister through those first and toughest days.By March 17 we’d all agreed it made sense for my parents to cancel their trip to New York. I cried. They were going to miss such an important family event, we wouldn’t be able to welcome Ruby into the world together or celebrate the arrival of the next generation. Like most people in New York City, I’d been riding a rollercoaster of emotions: sadness, grief, anxiety, anger, and helplessness.It slowly dawned on me that my parents not coming also meant that I would be in charge of preparing the zuo yue zi foods.It is hard to describe the exact breakdown of Chinese-ness to American-ness our specific childhood cocktail of cultural influence was. I'm a fourth-generation Chinese American, and we spoke English at home, but I often relate more to the experience of many second-generation immigrant kids.Because of the 1882 Chinese Exclusion Act, Chinese-American families had a hard time immigrating as a unified entity until after 1965, and so the lines of clearly demarcated generations in terms of “second generation” or “fourth generation” are not precise. Both of my parents immigrated to the United States in their teens to finish their schooling and join their parents (or in the case of my mom, her parents and grandparents). A common experience of second generation kids, across cultures, is feeling pressure to succeed on behalf of their family and their sacrifices, which I think my dad felt more than me. Second generation kids often have to translate or act as an advocate and go-between for parents and mainstream American society, which I also didn’t experience. But having different, weird foods and not understanding the same cultural references as classmates; being the first in a family to navigate certain elite institutions were all things I did experience. My parents and I could tell each other jokes in English, but Chinese culture, language, and values often informed my parents in a way that felt foreign to me.My mom, as the youngest in her family, did not know how to make all the right zuo yue zi foods either. She’d been binging YouTube videos to prepare. She was so anxious about leading the charge in fact that she’d repeatedly asked my sister and me to find someone in the New York City area who would come to my sister’s home and do it for us, a service available in the Chinese American immigrant community.By the time I’d taken over zuo yue zi food prep, hiring a stranger to come over and cook was no longer an option. My Yi-Ma (older maternal aunt) called me to sympathize, “Well now you have to be a sister, aunt, mother, and grandmother to your sister!” And my mom started sending me links to the YouTube zuo yue zi Chinese cooking videos.I lamented to one of my best friends, Lyle, that I felt totally clueless. Lyle, whose farm we’d been invited to in Tennessee, also happens to run a fertility acupuncture practice. So even though she is not Chinese-American, she instantly knew the answer: The First Forty Days, a book written in English by a Chinese-American woman named Heng Ou explains zuo yue zi, what it means in a western and modern context, and what’s involved.It was exactly what I needed. But I couldn’t get a copy in time for Ruby’s due date because mail orders were incredibly backed up. While I waited, Lyle sent me photos of key recipes: Ginger fried rice with bacon, chicken soup with jujube and ginger that Ou describes as “a time-tested combo used to boost circulation and enhance inner warmth”; and a jujube goji berry tonic––“the quintessential zuo yuezi drink with its wonder-duo of warming ingredients… a daily must-drink for all moms.”I’d resolved to give myself over to Heng Ou, reverting to the formula that got me straight A’s in high school: carefully studying the textbook and obediently following directions. In hindsight I realize I didn’t even consider doing a test run. My plan was to make everything for the first time when I got word that Tiffany had delivered the baby.Getting ingredients for these dishes was another story. I do not live within walking distance of any grocery stores that carry specialty Chinese ingredients like dried jujubes and goji berries, and a lot of those that did, in Chinatown, were closed anyway. I couldn’t rely on internet sources to deliver herbs quickly enough. And even the large Asian grocery stores––like H Mart in Bayside, Queens––were sold out of poultry. I had to be resourceful.It took a while, but finally I’d collected everything I needed (ordering what I could online; driving to neighboring towns with larger Asian grocery stores). I even had two whole freshly killed and plucked chickens that my husband helped me procure from the halal live poultry shop near us in the Bronx.By the evening of April first, when it was time to collect Tiffany and family from the hospital, all the soups and drinks and tonics were ready—hot and packed.As Tony and I drove through the city we passed the rows of cold storage trailers outside Bellevue and NYU Langone Hospitals, used to manage the abnormally high number of dead bodies emerging due to COVID. It was a haunting sight made even stranger by the fact that because we couldn’t be near the baby, Tony had outfitted the car with plastic drop cloths to separate the front and back seats.We called my sister from the curb and taxied the new family back to their apartment. I met Ruby for the first time through the pane of glass separating the apartment entry from the sidewalk. We said goodbye and watched them carry the tubs of chicken, jujube, ginger, goji berry soup; ginger fried rice; homemade oat milk with cinnamon and ginger; the jujube and goji tonic, and all the love and hope and connection I’d felt as I’d participated in this ancient postpartum food ritual.Over the next 40 days I would continue to box up new and different homemade soups, stews, and tonics in my kitchen, delivering them to the same glass entryway. As the zuo yue zi period progressed, and my anxiety levels rose and fell with the news, I realized that zuo yue zi had become a life raft—I felt useful, and the aroma and tastes of the food brought me closer to my family. The fragrance of ginger and garlic cooking in oil mixed with raw chopped scallions and filled my little kitchen exactly as it had in my grandma’s in Brookline, Massachusetts, and my mom’s in Orange County, California.And though the sound of ambulance sirens rushed by with alarming frequency, insomnia became a new feature of my nights, and I was still unemployed; I knew that despite all that, there was more goji tonic to be made, and more jujube chicken soup, and always more ginger to be peeled.Explore Bon AppétitHealthyishCoronavirusChineseessayRead MorecultureWhat It's Like to Be a Doula Helping People Give Birth Over FaceTimeBy Erica Chidi CohenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-29", "author": ["Condé Nast", "Charlene Wang De Chen"]}