{"id": "4f6dd9aadea263308fbb3327c1e59f0e", "url": "https://www.bonappetit.com/story/best-mothers-day-gifts-2021", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "The 9 Best Mother’s Day Gifts 2021 According To Bon Appétit Editors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Mother’s Day Gifts for Moms Who CookThese are the kitchen tools and appliances we know our moms need—even if they don’tBy MacKenzie Chung FeganMay 3, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The best Mother’s Day gifts, in my eyes, are the ones that make Mom happy and that also make my life a little easier. Like, last year I sent her a Burlap & Barrel spice set. She loved the Vietnamese cinnamon, and I loved that when I baked banana bread the next time I was home, I didn’t have to use spices that expired in the 80s. I know I am not alone here! We love our moms, ummas, and ammis, and many of us learned how to cook at their apron strings—but there are things about their kitchens that drive us nuts. Mother’s Day is the perfect excuse to give them the gift of a kitchen tool upgrade and give yourself the gift of not slicing your finger with a knife that hasn’t been sharpened in a decade. Just make sure to throw in some flowers or nice chocolates too. Here are our editors' picks for the best Mother's Day gifts for 2021.My mother is the true queen of tchotchkes and her kitchen is no exception. Her measuring spoons are a porcelain set with decorative swirls that she absolutely got in the Home Goods clearance aisle (we love a good sale). So cute! So impractical! Which is a shame because aside from being a tchotchke-hoarder, my mom also loves to bake, and any great baker needs a set of functional measuring spoons. This Oxo Good Grips set is what I have at home, and I would love to give my mom a set too. They're magnetic so they stay nested together in their drawer, but they pull apart super easily when you’re ready to use them. Save the trinkets for the living room, Mom! –Emily Schultz, social media managerOxo Stainless Steel Measuring Spoons$11 at Amazon$10 at Bed Bath & BeyondWhenever I want to grate some fresh Parm or zest a lemon at my mom’s house, I am confronted by my old nemesis: a novelty mini-grater about the size of a doll’s hairbrush. Whom is this grater for? Elves? Culinarily inclined babies? Perhaps it’s the perfect size to throw in your purse for Parmesan emergencies, but it is a terrible size for anything else. For Mother’s Day, Mom is getting a Microplane whether she wants one or not. –MacKenzie Chung Fegan, senior commerce editorMicroplane Grater$16 at Amazon$15 at Bed Bath & BeyondMy mom is the kind of environmentally fastidious gal who washes out plastic baggies, composts like a champ, and saves leftover salmon skin for our omega-loving doggos. Her crunchy granola vibes are family lore, which is why her coffee strategy completely baffles me: my mom owns an off-brand Nespresso machine that uses coffee pods. (Yup, I’m talking about those infamous little turtle-choking-single-use plastic cups.) I know she’s only stuck with The Machine because a) she’s fussy about her flat whites and b) technology is foe. I’m confident this adorable Smeg espresso machine will convert her. There aren’t too many bleeps or buttons, and it pulls a nice shot AND froths milk all at the same time. Did I mention it’s also earth’s prettiest coffee maker? –Ali Francis, associate editorSmeg Espresso Machine$490 at Nordstrom$490 at William SonomaWhile I look exactly like my mom, every time I see her use a plastic fork as a whisk I question how we could possibly be related. This Mother’s Day, I’d love to treat her to a real wire whisk that won’t snap under the weight of a thick batter. We may not agree on everything, but I hope she'll see I'm right about this one. –Chala Tyson Tshitundu, assistant editorFrench Wire Whisk$18 at Amazon$15 at Kuhn RikonLike most South Asian cooks, my mom doesn’t own measuring cups. She’s a terrific cook, throwing in a little bit of this and a little bit of that, letting her instinct guide her. The only problem is that because nothing is standardized, it’s hard for me to replicate her recipes at home! For Mother’s Day, I’d like to get her a set of good measuring cups so she can write down her recipes and pass them on to future generations. –Rachel Gurjar, associate food editorOxo Stainless Steel Measuring Cups$21 at Amazon$20 at Bed Bath & BeyondMy mom's black corduroy jacket from the '80s is cool. Her citrus juicer from the same era is not. The behemoth two-piece, cup-and-reamer situation always comes apart in the drawer, and once you've got it together, it produces juice that's speckled with seeds—not cute! So this year I'm upgrading her to a one-piece squeezer, which requires way less effort for a way less seedy result. Even the driest limes and most over-sized lemons are no match for this squeezer's double-lever technology—and its caution-tape yellow color makes it easy for my mom’s Boomer eyes to spot. –Amanda Shapiro, digital editorial directorCitrus Juicer$25 $13 at Amazon$25 at Bed Bath & BeyondI love to cook for my mom whenever I visit, but every time I go to make garlic fried rice, I forget that she doesn’t have a rice cooker. To her credit, there are plenty of other ways to make perfect rice (I usually default to oven rice when I’m back home), and she’s never been one to collect fancy appliances—the more buttons and settings, the less likely she is to use it. But in my eyes, the best Mother's Day gifts are a little luxurious and a little selfish. I’d get her this cute single-buttoned Zojirushi rice cooker so she—and more importantly, I—will always be just a flick of a switch away from the perfect rice. –Nico Avalle, digital production assistantZojirushi Rice Cooker$55 $45 at Nordstrom Rack$53 $48 at AmazonMy in-laws live in Provo, Utah. Elevation: 4,551 feet. I love to cook for them when I visit, but whenever I use their oven, it never goes quite right. It’s mildly mortifying to be known as “the daughter-in-law who works at a food magazine but never knows when her cakes will be done,” so I’m trying to figure out how to adapt my bakes and braises for high altitude. Next time I’m in Utah, I’ll bring a Thermoworks DOT oven thermometer so I can eliminate one variable and adjust the oven temperature with accuracy. –MacKenzie Chung Fegan, senior commerce editorThermoworks Oven Thermometer$45 at ThermoWorksMy parents have a collection of extremely old, yellowed, non-heatproof rubber spatulas. They melt at the very sight of an open flame, and they're so ancient that the rubber has started pilling. Like a sweater. Did you even know that was possible?? The Mother’s Day gift my mom doesn’t know she needs is a Get It Right spatula. It’s made of heat-resistant silicone and is smooth like a dolphin—no pilling in sight. –Christina Chaey, senior food editorGet It Right Spatula$13 at BA MarketExplore Bon AppétitGift GuidesShoppingToolsGiftsRead Moreculture67 Mother’s Day Brunch Recipes for an Easy GiftGallery67 SlidesBy Mehreen Karimrecipes33 Mother’s Day Dinner Recipes to Cook for the Moms in Your LifeGallery33 SlidesBy Nico AvalleLifestyle6 Cute Gardening Gifts, Because Mom Doesn’t Need Any More CandlesGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-03", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}