{"id": "4f7800cd9399dc89f75d8abd323cf7d1", "url": "https://www.bonappetit.com/story/enough-with-the-extra-long-grill-tools", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Enough with the Ridiculous Extra-Long Grill Tools Already! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEnough with the Ridiculous Extra-Long Grill Tools Already!You don’t need the goofy, purpose-built grill tools they’re always hawking at the hardware store—here’s what to buy instead.By Amiel StanekJune 21, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailAs a New Yorker who a) loves to grill food during the summertime and b) lives in a small apartment with no backyard or outdoor space to speak of, I have a lot of experience with Other Peoples’ Grills—OPG for short. And if there’s one thing I’ve noticed after plenty of time spent around OPGs, it’s that people have some goofy-ass ideas about what kinds of tools are necessary to make grilling happen. A familiar scenario: Beaming Grill Dad hauls a brushed metal attaché case that looks like it contains nuclear launch codes out of the garage and opens it proudly to reveal a number of puzzling implements, likelier medieval torture devices than grill tools. “Pretty sweet, huh?” Grill Dad whispers smugly. At which point I fight the urge to raise my palm to my forehead, thank Grill Dad, and wait until he begins mansplaining about craft beers to go rummaging around in his kitchen for the tools I actually need.Here’s the funny thing about the tools you need to cook food outdoors: They’re exactly the same as the ones you use for cooking food indoors. I have never in my life met a purpose-built set of grill tools that performed better than the workhorses that I already keep in my kitchen—in fact, most of the time they perform way worse. This is all to say that, if you‘re in the market for grill tools, you should really check the caddy next to your stove, because you probably already own them—and if you don’t, you need to buy these ASAP.The one tongs to rule them all.\nNikole HerriottTongsWhy is it that every pair of tongs marketed as grill-specific seems to be fully and fundamentally dysfunctional? There are the ones that are way too long, making it extremely hard to move anything around on the grill with any kind of dexterity. There are the ones that, instead of being joined at the base with a simple, time-tested spring-based closure, are comprised of one long, thick piece of bent metal, which makes opening and closing them feel like using one of those weird hand exercisers. And then there are the ones that have bizarre and novel grippers at the ends—weird tiny teeth, serrated triangles, laser-cut mini-spatulas bearing sports team logos—that always seem to either a) mangle the food you’re trying to pick up or b) fail to pick up any food at all. They all suck.You know what don’t suck? Regular sturdy stainless steel kitchen tongs. Just as nobody has managed to make a better mousetrap, no amount of added bells, whistles, or teak handles can make for a better steak-and-hot-dog-picker-upper. I like to keep two pairs of 12-inch tongs by the grill in case I need to flip something big and ungainly like a whole spatchcocked chicken. And if you’re really that anxious about getting your hands too close to the fire, spring for the longer 16-inch version. The best part? THEY ARE ONLY $5.Buy It: Winco 12-Inch Coiled Spring Stainless Steel Utility Tongs, $5 on Amazon.I <3 fish spatulas.\nZach DesartSpatulaWhy would I need a spatula as long as a shovel, so heavy that I need two hands to use it? Why would I need a spatula that has perhaps the most inconveniently-placed bottle opener of all time attached to the end? Why would I need a spatula with a random serrated edge that is not really sharp enough to cut into a steak but is definitely sharp enough to cut my hand while I’m putting it away in the dark and send me to the urgent care for several stitches? The world may never know.But this I know: A fish spatula is the best grill spatula you will ever use, period. It has a low-profile edge that is perfect for getting under stuck-on burgers. It has a tight turning radius, allowing you to quickly and nimbly flip said burgers. And it is small enough that you can easily rest it on a plate or a tray without it falling off and getting covered in dirt or gravel or straw or whatever lives on the ground near your grill. Will you have to get slightly closer to the food you’re grilling than you are used to? Possibly. But it builds character! Also: wear oven mitts! And how much will one of these bad boys set you back? ABOUT SIX BUCKS!Buy It: Winco 6.5-Inch Blade Fish Spatula, $6 on Amazon.No grill brush? No problem. Balled up aluminum foil and tongs will work juuuuust fine.\nPhoto by Alex LauGrill Dad, if you’re reading this, perhaps you’re wondering, What about the two foot-long sharp fork thing? Or the random basting brush with the silicone bristles?? To this I ask you: Have you actually even used those things? I. Didn’t. Think. SO. What about a grill brush??? Well, fine, you kind of need a grill brush. But you can also just use a balled-up piece of aluminum foil and those tongs to clean your grill grates in a pinch. But also: Go ahead and buy a grill brush—but make sure it's sturdy, with wire bristles. You deserve it.No, you don't need mini tools for a mini grill:With a Mini Grill, the World is Your CookoutBuy a mini grill, fulfill all of your summer hot dog fantasies. (So, all of your fantasies.)View StoryExplore Bon AppétitGrillToolsShoppingBasicallyRead MorecookingHow to Work the Vents and Lid of Your Grill: A Quick, Necessary ExplainerBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-03", "author": ["Condé Nast", "Amiel Stanek"]}