{"id": "4f7e3100374337a8b5f029ce10ed37d6", "url": "https://www.bonappetit.com/story/claire-saffitz-gourmet-makes-fan-art", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Claire Saffitz’s ‘Gourmet Makes’ Series Is Inspiring a Lot of Fan Art | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureClaire Saffitz’s ‘Gourmet Makes’ Series Is Inspiring a Lot of Fan ArtShe’s a culinary muse!By Alex BeggsAugust 8, 2018FacebookTwitterEmailIllustration by Jordan JohnsonFacebookTwitterEmailClaire is a living, breathing human being. She is a phenomenal baker. A runner. An Olympics enthusiast. But to the fans of her Bon Appétit video series “Gourmet Makes,” where senior food editor Claire Saffitz recreates classic junk foods (Twinkies, Gushers, Oreos)—she’s worthy of deep, loyal worship. Honestly we all worshiped Claire already (this deep-dish apple pie is one reason among hundreds), but the YouTube series went viral and we realized we weren’t showing it nearly enough.Here are some recent fan art contributions inspired by Claire and her iconic gray streak, her anguish and triumph in moments of culinary travail, her everlasting friendship with Test Kitchen manager Brad Leone.Illustration by Jordan JohnsonArtist Jordan Johnson spent a night bingeing “Gourmet Makes” and “a lightbulb went off—I knew I had to draw Claire,” she told me. “After sticking with Claire in her quest to make Twinkies, as she bakes tray after tray of snack cakes using every tool and technique that she knows, it’s so amazing when she hits the nail on the head and there are actual gourmet Twinkies sitting there on the counter.”Illustration by Ian WorthingtonArtist Ian Worthington “was inspired by Claire’s iconic grey-streaked hair!” He said of his sketch, above. “It’s such a cool and stunning look, I imagine illustrators find it very evocative. I’m also just a big fan of the series and wanted to draw something in tribute.” (FYI, he also sketched Brad Leone of “It’s Alive!” test kitchen fame.)Illustration by Seiji IgeArtist Seiji Ige also took his pencil to both Claire and Brad in this sketchbook on Instagram. “After hitting artist’s block, I generally find myself watching more new things that I had been meaning to watch—Claire’s videos were that thing.” He told me. “I also really connected with her moments of stress and bliss trying to get her recreations of snacks just right.”A few more:Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.A fan even compiled every Claire-Brad moment into this 13 minute video, writing, “I created this for the good of humankind. Don’t be making it weird because two people are friends. Take good care of this and keep it pure.” Thanks for this, Sid Sid:ContentThis content can also be viewed on the site it originates from.Then dive into Gourmet Makes:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-08", "author": ["Condé Nast", "Alex Beggs"]}