{"id": "4f7f5f9d5ab5e19c5ffa84e68be78726", "url": "https://www.bonappetit.com/story/types-of-rice", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "The 3 Types of Rice and How to Pick the One That's Right For Your Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere are 40,000 Types of Rice in the World—Here's How to Pick the One You NeedA super-simplified guide to an incredibly complicated subject. By Sarah JampelJanuary 21, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Yekaterina Boytsova FacebookTwitterEmailIf you’re overwhelmed by the number of non-milk milks at the grocery store, envision the rice aisle, with its impenetrable wall of bags and boxes. And just think, you’re only glimpsing a fraction of what’s available: There are over 40,000 varieties of rice on the planet. 40,000!The good news is that with a fairly rudimentary understanding of how rice is classified, you can pick the type of rice that’s right for the job and make a pot of whatever type you chose. (Just follow this method.)Rice is broadly divided into three categories based on grain length—long, medium, and short. The length of the grain is indicative of the texture of the cooked rice and, consequently, its traditional preparation and use. Since the packaging will often specify the length, all you have to do is remember what it’s used for. Let’s get to it!The three main types of riceLong-Grain RiceFor: dry, distinct grains; examples: basmati, jasmineLong-grain rice is made for pilaf. \nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaLong-grain rice has a length that’s three to five times its width. (Long boi.) One of the most prized long-grain rices is the intensely aromatic basmati, which was traditionally grown in the foothills of the Himalayas. It’s slim, with an elegant curve, and can triple in length when cooked. Aside from basmati, American-grown Carolina Gold and jasmine rice, cultivated primarily in Southeast Asia, also fall into this bucket.While the various types of long-grain rice differ in texture and aroma (jasmine rice, for example, is gummier than basmati, with a greener, grassier fragrance), they are all relatively low in starch content. That means that, when prepared with care (rinse it please!), they should come out light and dry, with distinct grains, making it the best choice for pilaf, biryani, mujadara, tachin—essentially, any place where the goal is individual, discrete grains that won’t stick to your utensil or hands.Short-Grain RiceFor: sticky, starchy clumps; examples: Japanese short-grain, bomba, Chinese black rice, short-grain glutinous riceThis recipe calls for sushi rice, which means short-grain Japanese rice.;\nPhoto by Emma Fishman, Food Styling by Susie TheodorouChubby, round, and starchy, the cooked grains glom together in sticky clumps. It’s typically the sort of rice that’s easy to eat with hands or chopsticks because you don’t have to pick it up piece by piece. Japanese short-grain rice, some varieties of sweet (a.k.a. glutinous) rice, often used in Southeast Asian desserts, and the less-sticky Spanish bomba (often the choice for paella), are members of this group. Where stickiness and viscosity is the point—like for creamy rice pudding, sushi that can prop up a piece of fish, or coconut sticky rice—short-grain rice is key.Medium-Grain RiceFor: creamy moistness without starchiness; examples: Calrose (a type of japonica rice), risotto riceCarla Music declared Carnaroli rice the king of risotto rice. \nPhoto by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsMedium-grain rice is shorter and moister than long grain but not quite as starchy as short. Fluffy right after it’s cooked, it tends to clump up as it cools. Medium-grain japonica rice is often the typical “table rice” in China, Korea, and Japan, whereas medium-grain Italian rice, like Arborio, Carnaroli, and Vialone Nano, is used to make risotto: Cooked slowly, they release their starches to create a creamy, luscious dish that doesn’t leave a sticky coating on the mouth.And now for the moment you've all been waiting for...Can you substitute one for another?Not a great idea. You could be flirting with disaster—use short-grain Japanese rice to make biryani and expect a gummy mess; use basmati rice to make risotto and expect grains of rice floating in broth.Of course, if you’re browsing our recipes, you’ll see that sometimes we use different types of rice to make the same general dish: fried rice with short grain or long grain; congee with jasmine, short-grain, or even leftover cooked rice; risotto with sushi rice or Carnaroli. In these instances, multiple types will work—but to slightly different ends and with maybe slightly different cook times.If you’re confused, just think about your final goal—do you want dry and distinct, starchy and creamy, or sticky and wadded?—then go backwards. And if you don’t love the end result, rest easy knowing there will always be another type of rice to try.Get the recipe:Pork and Shiitake CongeeSince congee can take hours to make on the stovetop, we came up with a clever trick: Rinse the rice and freeze it overnight. View RecipeExplore Bon AppétitRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-21", "author": ["Condé Nast", "Sarah Jampel"]}