{"id": "4f880c5a3bdf2a8e1246b7a176194d9a", "url": "https://www.bonappetit.com/recipe/tequila-beer-and-citrus-cocktail", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Tequila, Beer, and Citrus Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueTequila, Beer, and Citrus CocktailBy Tiffanie BarriereDecember 1, 20203.4(22)Read ReviewsTriangleEmailPinterestPrintPhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“I want a holiday cocktail that brings me to the pool,” says Tiffanie Barriere, drinks educator at The Drinking Coach. “I’m that person (usually joined by all my cousins) who drinks tequila at Christmas. Here I make it even beachier with fresh citrus juice, a little bit of red pepper jelly heat and a generous pour of crisp Mexican-style lager. When it comes to the beer, I’m all about Victoria or Pacifico, but I’ll let you go with whatever brand you like, just as long as it’s light and takes you straight to the cabana.” If you really can’t take the heat (it’s not a lot!), you can substitute whatever marmalade or jam you’d like for the pepper jelly.IngredientsMakes 1¾oz. fresh grapefruit juice¾oz. fresh lime juice½oz. agave nectar2Tbsp. red pepper jelly1½oz. tequila blanco112-oz. chilled Mexican beerLime wedge (for serving)PreparationCombine grapefruit juice, lime juice, agave, and jelly in a cocktail shaker filled with ice and shake until incorporated, 15–20 seconds. Add tequila and shake 10 seconds longer. Fill a tall glass to the top with ice. Pour in beer just to fill the glass halfway. Double-strain grapefruit mixture into glass; garnish with lime wedge.How would you rate Tequila, Beer, and Citrus Cocktail?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleAn extremely satisfying cocktail. As another commenter mentioned, this is better with 2 tsp of jelly, not 2 Tbsp. I used a green chile jam from a local farm, but a jalapeño jelly or similar would taste good as well. For a superior balance with the jelly, trying subbing mezcal for tequila blanco.KitDenver, CO3/14/2022Too sweet for me, but my partner loved it as is. I knocked the pepper jelly (someone gifted us very mild jar with a lot of sugar) and agave nectar down as well as a little less tequila - very refreshing. I'd suggest making a test cocktail and adapting it a little to one's taste. Mason SYreka, CA6/5/2021Used fresh squeeze juice and this was quite sour. Double the agave and still was less refreshing and more tolerable for one. Next time would pass over in favor of a Micheleda. AnonymousConnecticut5/30/2021Where can I get the recipe for red pepper jelly?SilviaMadrid, Spain4/28/2021i made this recipe twice and it was great each time.\nIt is refreshing and the unique flavors blend very well.\nI served it with a Mexican menu and it was a the highlight of the meal.\nI was a bit surprised when I looked at the recipe.  I could not imagine how it would taste.  I was wonderful and my guest, who watched me make it was also delighted by the finished product.\nI plan to make it again  when I have guestsAnonymousAtlanta, GA, United States3/14/2021Typo on jelly?  That’s too much Judymanynames Ca1/29/2021Surely you mean 2 tsp of pepper jelly?  Couldn't finish it as described.DaveVancouver, BC12/13/2020Awesome recipe Randy Miller 1320312/2/2020Explore Bon AppétitCocktailDrinks AllMexicanLatin AmericanGrapefruitCitrusFruitLimeTequilaAlcohol & Other DrinksWinterQuickEasyDrinksSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Tiffanie Barriere"]}