{"id": "4f98d7775c0effb2e8f82d3971e402c0", "url": "https://www.bonappetit.com/recipe/plum-cardamom-crumble-with-pistachios", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Plum-Cardamom Crumble Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssuePlum-Cardamom Crumble with PistachiosBy Molly BazAugust 1, 20184.3(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintOn the rare occasion you need an “excuse” to use up fruit before it goes bad, well, that’s what crumbles are for. All of these juices will overflow a standard pie dish and you’ll end up with burnt fruit caramel on your oven floor. For this crumble recipe, make sure to use a deep pie dish, or an 8x8x2\" baking dish will work well too. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients8 servings 3lb. any variety ripe plums, sliced ⅓\" thick (about 8 cups)2tsp. finely grated lemon zest2Tbsp. fresh lemon juice¼cup cornstarch½cup plus ⅓ cup (packed) light brown sugar1tsp. kosher salt, divided¾tsp. ground cardamom or ground cinnamon, divided¾cup all-purpose flour6Tbsp. chilled unsalted butter, cut into small pieces2Tbsp. coarsely chopped raw pistachiosPreparationStep 1Place a rack in lower third of oven; preheat to 350°. Toss plums, lemon zest, lemon juice, cornstarch, ½ cup brown sugar, ½ tsp. salt, and ¼ tsp. cardamom in a large bowl; let sit until some juices accumulate, 5–10 minutes.Step 2Meanwhile, pulse flour and remaining ⅓ cup brown sugar, ½ tsp. salt, and ½ tsp. cardamom in a food processor to combine. Add butter and pulse until mixture is very sandy and starts to form larger clumps.Step 3Transfer plums and their juices to a 9\"-diameter deep pie dish (all of those fruit juices will overflow a standard one) or an 8x8x2\" baking dish. Scatter topping over fruit, squeezing small fistfuls in your hand to bring it together, then breaking into smaller pieces of varying sizes. Sprinkle pistachios evenly over topping.Step 4Bake crumble until juices are thickened and bubbling and top is golden brown, 40–45 minutes. Let cool slightly.How would you rate Plum-Cardamom Crumble with Pistachios?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis is delicious! It's not too sweet and the nuts made for a nice crunchy addition to the topping. I made mine with some less-than-perfect black plums, raspberries, and almonds instead of pistachios since that's what I had in the house. It's a little juicy but it's perfect over vanilla ice cream. ViaBrusChicago10/9/2019So yummy, topping was great and fruit still had a little bite.AnonymousDayton, OH 9/26/2019Just made this recipe with nectarines instead of plums, cinnamon instead of cardamom, and vegan butter. And I used my fingers instead of a food processor. It was delicious! Though next time I may make more topping because it’s so good. The filling would also be great baked off by itself. Not mushy at all.AnonymousMichigan9/2/2019I made it with only 1.5 lbs of prune plums. If I had 3lbs, I would double the topping and use a larger pan.\nAlso I would omit the cornstarch altogether. I am not sure it was necessary.AnonymousCanada10/19/2018Loved how easy and simple this crumble was to make. The cardamom adds such a delicious, unique profile to the plums!Anonymous9/28/2018This was delicious and so simple! I don't have a food processor so I just rubbed in the butter by hand and it turned out great. Mine baked in 40 minutes, and it wasn't too soggy at all.AnonymousNew York 9/10/2018This recipe is great, and super simple! I didn't have a deep dish pie pan, so I made 1/2 the filling and topped it with the normal amount of topping. I made everything as is, only substituting dairy-free butter for the butter in the crust. Came out great!AnonymousBoston9/2/2018I made this and it was really nice. I had a mix of very ripe and slightly less-ripe plums. They are a European variety, so small and dark, almost deep blue or black. I cut each plum into quarters, and this way it wasn’t too juicy. I tossed a small handful (1/4 cup?) of oats in with the crumble. Baked between 35 and 40 minutes. It is delicious!AnonymousGermany 8/7/2018We liked this recipe. Used ripe but not mushy red plums, cut a generous 1/3 inch. Added oats and cinnamon to the crumble. Baked it in a square dish. Baked for 35 minutes then broiled the crumbled for 2-3 minutes.  Not mushy at all.  AnonymousVancouver, BC8/4/2018This recipe was awesome! made it for a party and it went in seconds. My only problem was I may have picked some plums that were borderline not ripe enough so it turned out a little too tart. This is great for friends with / without teeth! Might try swapping out plums with apples the next time!AnonymousWinnipeg7/29/2018So......even after reading the review below:) I thought I would try it. Well, the review below was not that far off. I don't know if it was the type of plums.....I used Black California Plums. The skin peeled off most of the plums as I was slicing them. There was a bunch of juice in the pan before it went into the oven. I added some oatmeal to the crumble just for fun. My family liked it but it was quite runny. Put some ice cream on top.AnonymousMidwest7/28/201845 minutes of cooking makes a plum mud, yuck.  This was like eating a bowl of jelly, tasty but pasty mush.  Think applesauce sandwich, bleck.  Best for a toothless friend.HighfatherColumbus Oh7/23/2018Explore Bon AppétitCrumbleFruit DessertDessertAmericanPlumStone FruitFruitCardamomHerbs & SpicesPistachioNutLemonCitrusSummerHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}