{"id": "4f9c07d7832481af2eccffd349d120a0", "url": "https://www.bonappetit.com/story/commanders-palace-family-meal", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Commander's Palace Hosts the Most Elaborate Feast in New Orleans That You Can't Get a Reservation For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Most Elaborate Feast in New Orleans Is the One You Can't Get a Reservation ForBefore the choreographed chaos of dinner service begins at Commander's Palace, a staff of nearly 100—from busboys to owners—sit together for a meal that's almost as legendary as the New Orleans restaurant itself.By Brett MartinPhotography by Daymon GardnerFebruary 9, 2018FacebookTwitterEmailPhoto by Daymon GardnerFacebookTwitterEmailAnybody who’s ever worked in a restaurant knows why it’s called family meal. There’s really no other word for the intimate, complicated, occasionally combustible relationship that exists between a team of people who pull together night after night (or day after day) to feed a rotating cast of strangers. And so, every day, in restaurants from Toronto to Timbuktu, the ritual is enacted: the feeders become the fed, the caregivers spend a few moments being cared for.Is it any surprise that in New Orleans the ritual just happens to be a little grander? Family meal has been a tradition at Commander’s Palace, the grand old Creole restaurant in the Garden District, at least since its great matriarch Ella Brennan took over in 1974. Long before Commander’s legendary chef Paul Prudhomme convinced sophisticated Orleanian diners to try cochon de lait and other delicacies of his rural Louisiana youth, he was feeding them to his staff as part of meals served before lunch and dinner service. Likewise, those who worked under Prudhomme’s successor, a young unknown from Fall River, Massachusetts, named Emeril Lagasse, got a twice-daily sampling of the food that would soon be defined by the single syllable Bam!“It’s a way a chef can show what they’re made of,” says Ti Martin, Ella Brennan’s daughter, who now runs Commander’s Palace alongside her cousin Lally Brennan.These days, it’s James Beard Award winner Tory McPhail and his team who preside over the daily meals, held, when weather allows, in the sprawling restaurant’s sun-dappled courtyard. It’s a chance for busboys and managers, line cooks and dishwashers, servers and owners to all sit together fortifying themselves before facing the onslaught of tourists and regulars. The food varies, but on Mondays for lunch, there’s always red beans and rice, and there’s always salad and dessert. On the day we photographed, the menu included grilled barbecue chicken, saffron dirty rice, lamb and plantain casserole, snapper-and-avocado ceviche, coconut flan, and plenty of chicory cold brew. “We all work our tails off here. Let’s take a second, sit down, and actually have some smart, really good, well-thought-out food,” says McPhail. “Happy cooks make happy food. Happy waiters make happy memories for all of our guests.”Below, the restaurant staff and the Brennan family tell us what makes the Commander’s Palace tradition more than a shift meal—and find six recipes to make at home.Executive sous-chef Jason Wells (left) and executive chef Tory McPhail (right) preparing family meal.\nPhoto by Daymon GardnerTory McPhail, executive chef: “We rotate who does family meal. It all comes down to who’s feeling inspired. If I say, ‘Hey man, it’s Saturday night and I am dying for great Vietnamese food,‘ we’ll order some ginger, some lemongrass, whatever we need. We buy ingredients especially for family meal, but we also love utilization. If you buy an 8-oz. piece of redfish to sell a 6-oz. serving, what do you do with the rest? You have to utilize it—in something like family meal ceviche.”Stewarding trainer Alvin Young\nPhoto by Daymon GardnerAlvin “Big Al” Young, stewarding trainer: “The best is fried chicken, because I’m doing that one. Oh man, my fried chicken is amazing. They love it when I fry the chicken. I season it, soak it in buttermilk, put it in the walk-in for an hour or two, then take it out, flour it, and put it back in the cooler. So, it’s a double batter. Extra crispy. [At Family Meal,] everybody greets everybody. Everybody talks to everybody. Some people are having bad days, some people are having good days. Me personally, I try to have a good day every day.”Pastry chef Caroline Cousins (left); evening line cook Lloyd McKissick (right)\nPhoto by Daymon GardnerProduction cook Kristian Madere (left); butcher Bryan Guillerman (right)\nPhoto by Daymon GardnerDottie Brennan\nPhoto by Daymon GardnerDottie Brennan: “We’ve been doing family meal for as long as I can remember, going back to first Brennan’s, on Bourbon Street. Ella and I live right next door, so we eat family meal all the time. We’re the ones who enforce the rules: Make it look good and taste good. I’m not afraid to tell them if I don’t like it. They probably think I’m a pill. Or a bitch. Both of us love hot dog night. I like mine with chili, cheese, onions, and a little sweet pickle. Ella likes hers with [leans in, whispers] ketchup.”Lally Brennan\nPhoto by Daymon GardnerLally Brennan, co-proprietor: “The only disaster is if Dottie and Ella go through family meal and they don’t like it. That’s a disaster. ‘Cause you will hear about it. Taco Night is my favorite. Or when they have fries. I always need to have some fries.”Chef McPhail and staff on the Commander’s Palace patio, where they often eat family meal.\nPhoto by Daymon GardnerAmy Mehrtens, sous-chef: “If you have a particular craving or a homestyle thing you want to make, you raise your hand: ‘I’ve got family meal’ today.’ I’ve done chicken adobo—a Filipino chicken dish with rice and fried garlic. Recently I did yaka mein, which is a local noodle soup down here. We did chicken pot pie the other day. It’s just sort of what we’re in the mood for. We plan for about 100 people per shift, especially on a busy Friday night. You always have to have a protein, a vegetable, a salad, and dessert.”Manager Kenny Meyer\nPhoto by Daymon GardnerKenny Meyer, manager since 1997: “Sometimes you can see new people being trepidatious about the whole thing. They don’t know where to sit or who to sit with. I always try to pull up a chair with them. To put them at ease. It’s sitting down and breaking bread, the same way you’d do with family. There’s something to be said for that. One of my favorites, honestly, is when we do cold cuts. Who doesn’t like a good ham sandwich?”Photo by Daymon GardnerTi Martin, co-proprietor: “In the old days, on the financial statement, it would be called cook’s pot. I’m a total foodie and eat very interesting food, but when I want something for family meal, I just want a ham sandwich. My mom eats bologna. Sometimes employees who aren’t scheduled to work will show up for a meal. Or work men. You’ll be like, ‘Who’s that?’ It’s the plumber or someone working on the air conditioner. The wine people tend to make their deliveries right around family meal.”And now, we feast:1 / 6ChevronChevronCold-Brew Chicory CoffeeView RecipeLearn about another New Orleans legend:Explore Bon AppétitNew OrleansRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Brett Martin", "Daymon Gardner"]}