{"id": "4fa6447b1184350bb7e7f1dc01a5fc8d", "url": "https://www.bonappetit.com/story/brads-favorite-appliance-dustbuster", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Why a Dustbuster Belongs in Your Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Appliance Brad Cannot Live WithoutHe uses it hourly. Hourly.By Alex BeggsNovember 26, 2018FacebookTwitterEmailPhoto by Emily SchultzFacebookTwitterEmailOne day, food director Carla Lalli Music walked over to my desk and said, “WHY HASN’T ANYONE WRITTEN ABOUT BRAD’S DUSTBUSTER ADDICTION?”So here we are.In the Bon Appétit test kitchen—a place where Claire makes gourmet Gushers and where dreams come true—cooking also happens, and so do messes. Which is why test kitchen manager Brad Leone keeps a dustbuster always charged and at the ready. Maybe too ready.“Coffee beans, flour, he’s down there with that Dyson,” Carla told me. Brad clarified: “Whoever said Dyson? It’s Black and Decker.”“It’s Brad’s thing,” added Carla, “It’s hilarious when he goes crazy [vacuuming everything]. When you say, Brad, dustbuster this up? [Carla imitates Brad vacuuming like it’s the Last Crusade.] He likes to get in the shelves, too.”Brad’s one true love.\nPhoto by Emily SchultzIn the test kitchen while he was making some breakfast tacos, Brad told me about all the ways he uses his trusty dustbuster. “You’re chopping onions,” he said, picking up some onions from a bin to show me specifically the vegetable of which he speaks, “and suddenly that stuff’s all over the floor,”—he points to some onion skins on the floor— “it always happens. Or you’re dicing carrots and you get a couple carrots there, and real quick boop-boop-boop, it’s so easy. The filter is washable, a crucial detail. At home, he has a slightly smaller, cheaper model that can hang on the wall so as not to use up counter space.Other things that need dustbusting in the kitchen, according to Brad:“A little spice mixture on the floor.”“Some ground beef. Wait, not like raw meat.”“People are always dropping herbs.”“You get the flour bag out, and boom-boom, there’s always some flour that falls on the ground.”“In the fridge crisper drawer, maybe there’s a green bean dehydrated back there.”“As long as it’s not greasy, in the oven.”“Toaster oven, lift up the little thing and zzing-zzing-zzing.”“Around my coffee grinder, the general coffee station.”Sure, a dustpan could also clean these things, but you never get it all, said Brad, “You need that suction.”You. Need. That. Suction.“It really came in handy when Emily Eisen broke a full jar of dried turmeric INSIDE HER PURSE,” recalled Claire “Half-Sour” Saffitz. “No one asked why she had it in there in first place. But boy, does Brad love that thing.”And it’s a passion he’s passed down to his toddler. “Griff loves it, he walks around like this [imitated baby using dustbuster.] It’s just a really, really, handy tool.”Photo by Emily SchultzBuy it: Black + Decker 16V Cordless Lithium Hand Vacuum, $42 on Amazon (originally $60)Related: A Riveting Conversation with Brad Leone, the Star of It's AliveWatch Brad make kimchi:All products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsCleaningBA RecommendsRead MorecultureZwilling Makes the Best Pan for Eggs We’ve Ever UsedBy Brad LeonecultureCyber Monday 2018: All the Kitchen Deals We're Shopping TodayBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Alex Beggs"]}