{"id": "4fb452845a7489d90c184a9cda9dd02a", "url": "https://www.bonappetit.com/story/sink-foods-essay", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "Everything Tastes Better When You Eat It Over the Sink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEverything Tastes Better When You Eat It Over the SinkTomato sauce pan scrapings! Blender-blade hummus! A very ripe peach! Sink foods are the best, and these are the best sink foods.By Stephen LurieJune 4, 2021FacebookTwitterEmailIllustration by Thomas GaudinetFacebookTwitterEmailSome people consider eating at the sink to be sad, shameful, or undignified. But that’s because some people are cowards. The kitchen sink is exactly the place for the exuberantly juicy and uncontainably crunchy, the rare and the bountiful. Which is to say  it’s the perfect spot for many of the best foods around. So let’s give sink food—glorious, athletic, smart, responsible, intimate sink food—its due recognition. I’ll go first. Here are my inductees to the inaugural class of the Sink Food Hall of Fame.Extravagant Stone Fruit: This all-time fan favorite is a shoo-in. When spending all of my disposable income on produce, lugging bulging bags home from the farmers market, and busting sweat-soaked into my even hotter apartment, no one is going to convince me to scalpel perfect wedges. I’m honoring the juicy dribbles of all those plums, nectarines, and, of course, explosive August peaches. This entry is for my repeated commitment to take on summer face first.Twice-Baked Biscuits: With a deep bow over the sink, each gnaw unleashes a spray of crumbs like a calving iceberg. My left hand is outstretched with a mug of tea; my right cradles a crucible of crunch. A group award here commemorating all the biscotti, mandelbrot, and particularly my mother’s South African–style rusks, which elevate cookie eating to pure drama.The Cucumber Squeegee: I must recognize myself for innovative techniques in salad dressing retrieval. For too long the best part of lunch had been abandoned to the sink after futile fork lines in miso and spoons bumped against Caesar-sheltering bowl curves. But as I pursued the dregs of a particularly outstanding tahini dressing, the sink inspired me to see the potential in a slice of cucumber—ideal for transporting every last ounce of dressing into my mouth.Tomato Sauce Pan Scrapings: This is the crown jewel of sink food: scarce, coveted, and often the target of elaborate heist schemes. But I, the cook, am its rightful owner. And so, even after devouring two times as much pasta as intended, I distract my guests with a dessert, return to the kitchen, and wield my wooden spoon to collect what's mine.XXXL Party-Size Tortilla Strip Gravel: While most sink eating uses a classic forward posture, some sink foods call for creativity. A long beach day full of SPF and ABV can...encourage such creativity. Upon returning home with beach snack leftovers in tow, I face away from the sink and introduce a backbend, allowing myself to capture (almost) all the bottom-of-the-bag chip crumbs I am dumping into my mouth. It is a small act but one that may change the course of sink eating forever.The Entire 11x18\" Roasting Pan: 198 square inches. A seemingly endless galaxy of olive oil studded with crispy bits left over from roasting root vegetables meant for a week (but that I probably ate most of that night). Still, with leftovers packed away and the pan on the brink of being washed down that kitchen black hole, I have the persistence to explore the vast unknown (i.e., use my pointer finger to swipe up all the good stuff), and I can’t help but respect that tenacity.Blender-Blade Hummus: Some sink foods are also dangerous foods, like raw cookie batter from a mixing bowl or cake bits from a hot pan. For true daredevils there’s the hummus stuck to the blade, some accessible by hand, some only by tongue. I have to honor myself for pushing the boundaries of what’s possible (read: advisable) and snatching a little snack before the park potluck.Aggressive Wedge of Watermelon: So you bought a watermelon, big whoop; how much fruit can really be in that orb? Four days later you’re still eating cubes and spheres and slices at and in between every meal. Confronting the final unwieldy pyramid of juice is a selfless act, one best taken to the cheeks directly upon turning from fridge to sink.Leftovers of Leftovers: Could I have sacrificed those strands of asparagus and strings of onion stuck to the Tupperware? Could I have abandoned the remnants of that vindaloo in that take-out container? Sure, if I didn’t want to savor the final moments of an excellent (okay, of any) meal. There’s nothing flashy about this kind of sink food, but there is commitment and comfort. This award, and all future Hall of Fame entries, is dedicated to me and everyone at their sinks appreciating a final uninhibited taste.Explore Bon AppétitCultureCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-04", "author": ["Condé Nast", "Stephen Lurie"]}