{"id": "4fbdf3b2e1b57a04c2a7a31e4a5dbaf1", "url": "https://www.bonappetit.com/recipe/hot-yogurt-and-spinach-soup", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Hot Yogurt and Spinach Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueHot Yogurt and Spinach SoupBy Yasmin KhanApril 20, 20214.3(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTo make this rich and creamy soup, a riff on Yayla Çorbasi from the mountain meadows of northern Turkey, cookbook author Yasmin Khan seeks out the best quality whole-milk yogurt. It’s the star of the dish, so it’s gotta be good! This recipe comes from Khan’s book, Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, and it’s guaranteed to soothe. Heating up the yogurt slowly with the hot rice and broth mixture ensures it won’t split.Ingredients4 ServingsSoup1quart low-sodium chicken broth½cup short- or medium-grain white rice (such as Turkish baldo rice or arborio), rinsed1large egg yolk2¼cups plain whole-milk yogurt1Tbsp. plus 1½ tsp. cornstarch1tsp. dried mintKosher salt, freshly ground white or black pepper7oz. mature spinach, tough stems trimmed, coarsely choppedTopping and assembly3Tbsp. salted butter1Tbsp. plus 1½ tsp. dried mint1½tsp. Aleppo-style pepperPreparationsoupStep 1Bring broth to a simmer in a large saucepan; add rice. Return to a simmer, cover, and cook, adjusting heat as needed to maintain a simmer, until rice is al dente, 12–15 minutes.Step 2Whisk egg yolk, yogurt, cornstarch, and ¾ cup plus 2 Tbsp. lukewarm water in a medium bowl. Add rice mixture a spoonful at a time, whisking after each addition, until combined. Pour back into saucepan; set over medium-low heat. Add mint and season with salt and pepper. Bring to a simmer and cook until thickened, about 5 minutes. Add spinach; cook just until wilted, about 2 minutes. Season soup with more salt and pepper.topping and assemblyStep 3Melt butter in a small saucepan over medium heat; stir in mint and Aleppo-style pepper. Remove from heat. Ladle soup among bowls and drizzle with spiced butter.Adapted from \"Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus.\" Copyright © 2021 by Yasmin Khan. With permission of the publisher, W. W. Norton & Company, Inc. All rights reserved.\n\nBuy it from Amazon or BookshopHow would you rate Hot Yogurt and Spinach Soup?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI have not made this recipe.  I'm sure it's fabulous.  I just want to point out to the people at BA who are doing your categories that this recipe is far from keto, which is one of the tags that you have given it.  The rice and even the cornstarch put it out of reach for anyone following a keto diet.  Jennifer11/14/2021I saw this recipe in the magazine and was so intrigued, I had to try it! I didn’t have Aleppo style pepper so I had to substitute with regular pepper, and some sprinkles of cayenne and chili powder for color and spice. I really like the way it turned out! It’s very warming and soothing, but also doesn’t feel supper heavy either. It came together really quickly as well, so I would definitely make this again. VictoriaUSA 8/15/2021Explore Bon AppétitSoupSoups and StewsTurkishMiddle EasternSpinachLeafy GreensVegetableYogurtOther IngredientsQuickWeeknight MealsGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Yasmin Khan"]}