{"id": "4fc134cf6f8a830d6f97fd752ccb18ce", "url": "https://www.bonappetit.com/story/brothy-pasta-with-chickpeas", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Pasta e Ceci Are Like Healthyish Spaghetti-Os | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBrothy Pasta With Chickpeas Are Like Healthyish Spaghetti-OsNeed we say more?By Aliza AbarbanelMarch 15, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailHi, hello. Welcome to cooking purgatory, also known as March or sprinter. It’s the transitional period between winter and spring, and we’ve lost interest in braising and roasting. We're anticipating fresh farmers’ market offerings (rhubarb! snap peas!)...while bracing for the possibility of one final snowstorm. It’s time for brothy pasta with chickpeas.No, we’re not talking about chickpea pasta, though you could certainly use the gluten-free stuff. Instead this recipe is based on pasta e ceci, a cousin of pasta e fagioli  that swaps white beans for creamy chickpeas. It’s a classic Roman dish from the cucina povera (literally: peasant food) canon, with endless variations that feature tomatoes, anchovies, pancetta, and other flavorful ingredients. The starchy broth lands somewhere between a soup and a pasta sauce, which is a very delicious place to be.“I’ve made a version of pasta e ceci for years and always cook the chickpeas from scratch, so I wanted to make a one-pot version with canned chickpeas that’s less time consuming,” says senior food editor Andy Baraghani. He collab-ed with senior food editor Chris Morocco to create an all-in-one, super-satisfying dinner that comes together in fewer than 20 minutes.The recipe relies on true pantry staples: canned tomatoes, onions, canned chickpeas, and orecchiette. (Ditalini, tubetti, or any other short pasta works great too.) Best of all, it’s a true one-pot meal. You start by sweating down onions and garlic to create a basic soffritto, then layer in flavor with a bit of rosemary and red pepper. In go canned chickpeas and crushed tomatoes, then dried pasta and water. The chickpeas become creamy-tender while the pasta cooks, releasing starch to thicken the broth. Keep the pasta al dente, then stir in chopped parsley and shaved Parm before finishing each bowl with a drizzle of olive oil and several generous cranks of black pepper. The final hit of heat brightens up the whole dish. The recipe is ripe for riffing too: Next time I'll sub in fresh chiles instead of dried or replace the rosemary with sage and thyme.I served this pasta with a small green salad and a hunk of crusty bread for dipping, which was just as delicious as it sounds. It was a welcome break from my usual winter diet of sweet potatoes, although I'll definitely keep making this quick-and-brothy little number when warmer weather (finally) arrives. Seasonal cooking is a wonderful thing, but the allure of chickpeas and pasta is evergreen.Get brothy:Brothy Pasta With ChickpeasThe healthyish comfort food recipe you won't be able to get enough of.View RecipeExplore Bon AppétitHealthyishChickpeaPastaTomatoWeeknightCanned TomatoesRead Morecooking29 Healthyish Chickpea Recipes Here for Your Weeknight DinnersGallery29 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Aliza Abarbanel"]}