{"id": "4fc1e0366894140521694b6ed072ca22", "url": "https://www.bonappetit.com/story/dominican-spaghetti-is-the-perfect-beach-dish", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Hear Me Out: Dominican Spaghetti Is the Perfect Beach Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHear Me Out: Dominican Spaghetti Is the Perfect Beach DishSun, surf, and spaghetti.By Carlos MatiasJuly 14, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Rebecca JurkevichFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.A heap of saucy pasta with a side of fried plantains might not be the first dish that comes to mind when you’re packing for a beach trip. To some, seaside sustenance should be portable and light, and it certainly shouldn’t require utensils. But for me, watching my aunts plop down thick, slick strands of spaghetti onto styrofoam plates is a beach meal swimming with tradition.Dominican spaghetti is a hearty, lush dish consisting of pasta tangled up with yellow and green peppers, onions, olives, capers, and chunks of meat that gets drowned in a creamy combination of tomato sauce and evaporated milk. It’s rich and earthy, shot through with pops of salty, tangy, and sweet. The glowing orange sauce glistens in the sun as my fork dives into the plate like a lifeguard, saving bits of salami from disappearing under waves of pasta.The dish is always accompanied by white rice or tostones or packed between pan de agua and made into a sandwich. Or all three. It’s more conducive to certain beach day activities than others—napping, say, more so than catching waves. It’s also affordable and easy to prepare in large quantities when you need to feed a group. Our family’s recipe has changed over the generations as certain ingredients have become more available, but one thing remains constant: The spaghetti and rice must be transported to the beach and served out of the same pots that the dishes were cooked in. Below is the loose recipe I grew up eating.To start, dice ¼ green bell pepper, ¼ red bell pepper, and ¼ onion and then cube 8 oz. salami while bringing a pot of salted water to boil. Drop 1 lb. spaghetti into the boiling water and cook a little past al dente. Heat a few glugs of olive oil in a skillet over medium-high heat while the spaghetti is boiling, and cook the salami cubes until they start to brown. Lower heat to medium-low, add peppers and onion and cook until the onion becomes translucent. Then add 1½ oz. pitted olives, 1½ oz. capers, 3 diced garlic cloves, 1 chicken bouillon cube, ½ tsp. oregano, and ¼ tsp. black pepper and cook for 2 minutes, stirring occasionally. Add 1 cup canned tomato sauce, ½ cup tomato paste, and 2 Tbsp. olive brine. Stir to combine and let simmer for 4 minutes. Drain the spaghetti and add to the saucy skillet and then slowly pour in ¼ cup evaporated milk. (Make sure you’re not using sweetened condensed milk here!) Stir well until the sauce and dairy are combined.There’s a community aspect in both the preparation and the consumption of beach spaghetti. Sharing food with family and friends is an essential part of Dominican culture, and beach day spaghetti is a collaborative effort. The responsibilities are divided up, with separate households contributing to the beach-bound bounty. My fondest summer memories include watching my family cooking oversized pasta pots and sending my cousins and me on colmado (local convenience store) runs for bread. A neighbor or family would drop by with a pot of steaming hot rice before we were on our way.For me, it just wouldn’t be a beach day without this ritual. Listening to the waves crash, I imagine my tostones are little lifeboats carrying the spaghetti to my waiting mouth, a process I’ll repeat until there’s just enough left on my sandy plate to make into a sandwich. The soft bread soaks up the sauce, and my skin soaks up the sun, and I bury my toes in the sand, completely content.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Carlos Matias"]}