{"id": "4fd7e95c917dab3e6aee3258752bacf2", "url": "https://www.bonappetit.com/story/stop-leaving-brie-rind-behind", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Stop Leaving the Brie Cheese Rind Behind, You Monster | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStop Leaving the Brie Rind Behind, You MonsterAn open letter to anyone who hollows out the wedge of brie, ignoring the completely edible rind.By Alex DelanyApril 25, 2018FacebookTwitterEmailIllustrations by Elliot SnowmanFacebookTwitterEmailI don’t go to parties to get stressed out. Why would anyone do that? I show up at functions to have fun, to relax. But guess what. At most parties I go to, I end up standing silently in front of a coffee table or a kitchen counter, staring at a cheese plate for at least 60 seconds, in a state of absolute rage. It happens. All. The. Time. Because it’s 2018, and we, as a society, have not yet figured out that it is 100% OK to eat the rind on the brie cheese.I’m sick and tired...of being sick and tired...about brie cheese. I’m fine with brie as a cheese. When all is said and done, there are better cheeses, and there are worse cheeses. But I’ve never declined an invitation to eat brie cheese. I’ve also never chiseled my way into the center of the brie, scooped out the creamy interior, and left the rind behind like some unwanted, poisonous garbage.If you are one of the people that engages in this kind of behavior, I am not mad at you. I just want you to hear what I have to say. And change the way you are.Talking About MannersBefore we get into the edible nature of the rind, let’s take a minute to discuss manners. Yes, those things your parents told you about when you were a child. I’m a firm believer that what’s good for the crowd is usually more important than what’s good for you and you alone. You will have a better experience if everyone around you is happy. That’s called human decency. If you remove the paste (the inside of the cheese) from the rind (the outside of the cheese), you are declaring to the rest of the room that your needs are more important than everyone else’s. You’re skewing the ratio of rind to cheese awkwardly in favor of the rind. This leaves whoever happens to be eating brie after you with a disproportionate cheese experience.You wouldn’t take the patty out of a burger and leave someone with the bun. Or take the crust out from beneath the cheese on a pizza, leaving your best bud with a slab of greasy, tomato-stained mozzarella. Right? I don’t know. Maybe you would.But the point is that you shouldn’t. It’s rude. Be a more considerate person. Think about the people you call your friends (or at least the people who happen to be standing in the same room as you).Talking About EdibilityOK, here’s a fun thing about cheese rinds: You can eat most of them. They will not kill you. If you’re thinking, But...it’ssssssss molddddddddddyyyyyyyeeeeeeeeeeeyyyyyyyy. Yeah, some of them are. So what? Have you ever taken penicillin? That’s mold. And it’s saved a lot of people from death. Mold is not always bad. It can actually be quite good.The only rinds you can’t eat are the ones that are plastic or so hard you would break your teeth, like the wax on red wax gouda (yuck) or the hard rind on Parmesan (ouch). A cheesemaker will not package a cheese that is going to kill a human being if they eat it. That would be bad business. Hey, would you like to try some of our cheese? It might kill you! is not a good sell. I would never buy that cheese. Unless I was trying to assassinate someone who liked cheese.Talking About AppreciationBrie is a bloomy rind cheese. That means that cheesemakers inoculate the cheese with edible mold that blooms on the outside of the paste. That mold is then patted down, over and over again, to form the rind. This is a big part of the cheesemaking process, and cheesemakers spend a lot of time doing this. It’s tedious labor, and they’re doing it for you, the person who should be eating the rind and paste together. They’re professionals, and they want you to eat the rind. Don’t let that work go unappreciated.Talking About FlavorWhether brie or some other wonderful variety of cheese, there are worlds of flavor in the cheese rinds. The rind provides variety from and complements the paste simultaneously. When it comes to good brie, the rind tastes umami-forward, with hints of mushrooms sautéed in brown butter. When you pair that with the super-creamy paste, you get a combination that does a faint impersonation of cream of mushroom soup. Sure, cream is great. And mushrooms are great. But together, they’re more than the sum of their parts.Other cheeses might be coated in herbs, washed with beer, or inoculated with cool mold, and the rind holds a flavor all its own. Casting it aside is cheating yourself out of a culinary experience. And if the last time you had brie rind was ten years ago, just give it another shot. Please. If you still don't like it, at least take both onto your own plate and separate them there, instead of burrowing into the wheel on the cheeseboard like some kind of rodent.Talking About YouHey, now it’s time to look inward. We’ve covered the brie spectrum. I’ve made my case. It’s up to you to use this information to grow as a human being. You can be the change I want to see in the world.Or maybe not. Maybe you’ll stay stagnant, in a perpetual state of selfishness. That would be really sad, but if this happens to be the case, please promise you won’t show up at my friend Greg’s party next weekend. I’m trying to enjoy myself, rind and all.Want more cheese content? Yeah, you do.Explore Bon AppétitCheeseBrieCheese WeekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Alex Delany"]}