{"id": "4fdabd07ee0fd97147ee81abfc03a598", "url": "https://www.bonappetit.com/story/bird-of-paradise-tiki-drink", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "A Tiki Drink You Can Make at Home and Pretend You’re on Vacation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Going to Make a Tiki Drink at Home, Make This OneAnd the more garnishes you add, the better.By Emma WartzmanJuly 12, 2018FacebookTwitterEmailKristen Kilpatrick Photography, Kristen Kilpatrick, Austin Texas, Austin Texas Photographer, Pool burger, Bon Appetite, Bon Appetite Cocktail, Tropical Cocktails, Tropical Cocktails Inspiration, Bon Appetite CocktailsPhoto by Kristen KilpatrickFacebookTwitterEmailThere is the kind of drink you make yourself when you get home after a long day at work, like a glass of wine (pouring it into the glass counts as “making”) or a simple vodka soda. And then there’s the kind of drink you make yourself when you’ve got some time, maybe some friends are coming over, or maybe you’re on vacation and want to fully embody the vacation version of yourself. A tiki drink is in order.That drink is the Bird of Paradise, a rum, Aperol, and pineapple juice cocktail from Alex Holder, the assistant beverage director of McGuire Moorman Hospitality and the brains behind the sunset-orange drink served at the tiki-themed Pool Burger in Austin.Chill vibes at Pool Burger in Austin.\nPhoto by Wynn Myers“This is a riff on a classic tiki drink called the Jungle Bird,” says Holder, “but we sort of flip-flopped the recipe for Pool Burger. We use a higher proof rum than usual for packing a bigger punch, but then instead of Campari, which imparts a particularly bitter taste, we use Aperol, which is a bit tamer.” The pineapple, lime, and simple syrup are there to balance everything with some acidity and sweetness. Here’s how you can make it at home:Combine ½ cup sugar and ¼ cup water in a jar, cover, and shake until sugar is dissolved to make the simple syrup (you could also make simple syrup over the stove until dissolved, if you prefer). Then combine 1 oz. Aperol, 1 oz. overproof rum, 1 oz. pineapple juice, ½ oz. fresh lime juice, and ¼  oz. simple syrup in a cocktail shaker filled with ice. Cover and shake vigorously for 30 seconds. Strain into a glass filled to the brim with crushed ice. The fresher the pineapple juice you can get, the better (Holder is partial to Trader Joe’s brand). This recipe yields 1 cocktail.As for garnishes, Holder’s got some strong opinions there, too. “Tiki drinks are all about embellishing and over-exaggerating the look,” he says. “You could go with pineapple leaves or a pineapple wedge, of course, which both pop against the color of the drink. Or stick as many swizzle sticks or colorful straws as you have in there.” The most over-the-top idea, though? Take half of a juiced lime and place it on the very top (it shouldn’t sink because of all that crushed ice), and then prick the top with a little toothpick flag. It looks like a mini island! In this case it’s not so much go big or go home—it’s go big at home.Get the recipe:Bird of ParadiseThis easy summer tiki cocktail is made with Aperol, rum, and pineapple juice.View RecipeAnother tropical drink for your pleasure:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Emma Wartzman"]}