{"id": "4fdce7abd00e4b95fca1ed8ef18a4bb8", "url": "https://www.bonappetit.com/story/ashtin-berry", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Ashtin Berry is Changing the Beverage Industry One Sip at a Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHospitality Activist Ashtin Berry Enjoys Caviar Potato Chips, Radical Self-Awareness, and a Good Twerk SessionShe also pairs fried chicken with Champagne and has a killer skincare routine so, yeah, we're jealous.By Shanika HillocksAugust 8, 2018FacebookTwitterEmailPhoto by Erik DelanoyFacebookTwitterEmailIf it’s a hospitality job, Ashtin Berry has done it. While working as a bar manager, sommelier, and most recently, beverage director at Tokyo Record Bar and Air’s Champagne Parlor, Berry has also consistently held down the role of activist in the food and beverage space. Recently she’s moved from front of house to center stage, traveling the U.S. speaking on panels about intersectionality within hospitality. We caught up with Ashtin Berry in July at Tales of the Cocktail in New Orleans to get the download on how she incorporates daily reading into her wellness arsenal, the food she loves to eat with champagne, and a skin routine to rival any beauty editor’s.\n—Shanika HillocksWords are an integral part of my work, so reading is one of my biggest self-care practices. I never eat breakfast; it’s just not my thing, but I do like to make sure I’m mentally fed. I’m currently wrapping up Not That Bad by Roxanne Gay, Gendered Spaces by Daphne Spain and Brittney Cooper’s Eloquent Range. When I’m home, my morning ritual includes a pot of tea, often from Mariage Frères. It’s expensive as hell, but I adore them. When I’m not cosseting, a Chinese oolong, or fragrant tea that can last for a second or third cup, is what I enjoy. As the tea steeps, I jump in the shower, and then get to my skincare regimen—more on that later. In lieu of a workout, I listen to trap music accompanied with a good twerk session, which I highly recommend.My other meals lean on the indulgent side. I drink a lot of champagne, so my choices in food tend to reflect what pairs well with a bottle of bubbly. An O.G. grower who is a personal favorite of mine is A. Margaine. For a new-school label, I enjoy Dhondt-Grellet. You’ll be happy if you get your hands on either option. Radishes and whipped butter are generally a snack for me. I used to enjoy caviar potato chips, but my accountant told me to stop acting like I had caviar money, so now I eat a ton of Brothers Food Mart fried chicken (yes, from the gas station) which my mom fusses at me about. I really don’t understand why people won’t let me be great—fried chicken and champagne is a classic. I also love burgers. Like, love them. For hangover-laced mornings, I consume eggs. A seven-minute egg or pickled egg cures all: I swear by it.If travel is on deck for an upcoming panel or business meeting, I’ll look to my article file for three to five pieces I want to read, and archive them for the trip. I'm interested in culture transformation in spaces, and believe conversations about context provide gateways for those shifts. I’m currently in talks about the inclusion of all women of color—Asian, Latina/x, Pacific Islander—in the WOC conversation, not just Black women. I teach that diversity does not always imply inclusivity. Lastly, I acknowledge that reproductive and sexual health as a part of human health is integral to making spaces—hospitality, or otherwise—safer.On a larger scale, I’m invested in conveying that hospitality is a wide world that includes hotel housekeeping staff, event staff, sex workers, and chain and fast food industry workers. The media presents the entire hospitality industry as this craft world—think about any prominent NYC or LA restaurant or bar—where the staff tends to be more homogenous. This disconnect has long-term implications in terms of who continues to get access to valued spaces. If we don’t make it a point to support these underrepresented groups’ progression, we prohibit the whole industry’s growth.For me, social media serves as vehicle to communicate and educate on all of these points. After many text messages and emails asking for reading recommendations, I took to my Instagram to curate a weekly collection of articles. With social media, I’m fostering more in-depth conversations, both inbound and outgoing.Now, back to skin. My skin tells me everything—if I’m eating well and drinking enough water. It’s a gauge for how I’m treating my body. To keep it looking its best, I opt for a mix of serums and Korean beauty products. My current regimen includes The Ordinary’s Caffeine Eye Serum, Corsx Snail Mucin, Marie Veronique Intensive Repair Serum, Mario Badescu Drying Lotion to treat the occasional breakout, and  Dr. Jart brightening and hydration sheet masks.More than books and bottles though, my personal practices place self-awareness at the forefront. I believe that you cannot truly know how to care for yourself if you haven’t been transparent about where you are currently. I like to take a cue from my friends in the theater world and break down the fourth wall. Whether talking to industry colleagues, the audience of a panel, or someone on social media, I make it a point to voice the reasoning behind my words and actions. We all know our ego is a powerful thing. Quieting it is a constant practice but one I highly recommend.Explore Bon AppétitHealthyishNew OrleansCocktailInterviewsRead MorecultureMeet the Woman Behind Solange Knowles's Favorite Skincare LineBy Magdalena PuniewskaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-08", "author": ["Condé Nast", "Shanika Hillocks"]}