{"id": "4fdf5b0b41dad01cfc0327b37b7a2a2b", "url": "https://www.bonappetit.com/story/transport-yourself-to-mexico-with-these-five-salsa-pairings", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Transport Yourself to Mexico with These Five Salsa Pairings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredTransport Yourself to Mexico with These Five Salsa PairingsThis may sound like a bold statement, but we’re pretty sure that everyone loves Mexican food. It’s comforting and flavorful, and when you get a taste of the fresh stuff, it’s clear how this genre of Latin cuisine came to be one of world’s greatest culinary joys.By Princess CruisesOctober 31, 2018FacebookTwitterEmailFacebookTwitterEmailWhen you think about Mexican food, you inevitably think about salsa. Its versatility and variety are unbeatable. Dip it, pour it, and put it on everything: quesadillas, taquitos, tacos, roasted fish, scrambled eggs, even sweet potatoes! When you choose the Bon Appétit Recommended: Salsa & Salsa (Dance & Dine) on Princess Cruises, you’ll become well acquainted with this cover-it-all condiment. Before you pack your bags to Mexico, here are a few of our favorite salsa combos.Salsa Frescapair with taquitos & the Mayan Heat cocktailSalsa fresca is traditionally tomato-based, and this one gets its deep flavor from first roasting the tomatoes, onion, garlic, and jalapeño. White wine vinegar brings added acidity, while chipotle peppers in adobo sauce lend a kick of heat. The whole thing is blended for a smooth finish. Topped over taquitos, it’s the perfect combination of crunch, flavor, and spice. Wash it down with the Mayan Heat cocktail, which marries tequila, triple sec, lime juice, and agave to complement this yummy combo. You can even try these both on board a Princess Cruise!Corn Salsapairs best with tacos and cotija cheeseCrunchy corn, juicy tomatoes, crisp red onion, jalapeños, chilis, and cilantro make up this simple salsa. It goes with everything, but we think it’s optimal spread over warm, just-arranged taco filling, whether it’s an all-veg affair or a carnitas cure-all. The trick to the perfect consistency? Once you’ve charred the corn on the cob, let it cool, scrape off the kernels, and mash them with a potato masher or the back of a spoon. This allows the starches and juices to thicken the salsa.Pico de Gallopairs best with freshly grilled pork, chicken, or salmonFor the salsa purist out there (we know you exist), pico de gallo is the gold standard, the safe standby, and the most reliable of salsas. It’s rarely too hot, it’s flavorful, and once again, it goes with everything. We like it scooped over a freshly grilled fish, like salmon, but it also complements grilled chicken, pork, and steak. With fresh tomatoes, cilantro, ½ an onion, and a little bit of jalapeño, this straightforward salsa is easy to whip up with a moment’s notice.Avocado-Tomatillo Salsa Verdepairs best with grilled shrimp quesadillaSalsa verde, the green cousin to its classic counterpart, may be more understated than the red-tomato variety, but when done right, it is no less mighty. Traditionally made with tomatillos, serrano chiles, garlic, and onion, it’s like a zesty high five, bringing fresh, tangy flavor to grilled fish, salty pork, and cheesy shrimp quesadillas. The addition of avocado thickens the salsa, giving it a dreamy, creamy consistency.Charred Tomato Salsapairs best with a classic margarita, guacamole, and tortilla chipsIf you prefer a traditional salsa à la your local Mexican restaurant––you know, juicy, easy to scoop––but are looking for a bit of extra bite, this is the one for you. This classic, blended tomato salsa gets its grilled flavor by first charring the tomatoes in a skillet on medium-high heat. Onion, garlic, serrano chiles, cilantro, and lime round out the flavors, making it the perfect sidekick to a timeless trifecta of crispy tortilla chips, guacamole, and a classic margarita.Hungry yet?  Book your Princess Cruises’ Salsa & Salsa in Mazatlán tour at Princess.com.  AND- while you get ready to go, try out this salsa you can experience on board a Princess cruise to Mexico.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-26", "author": ["Condé Nast", "Princess Cruises"]}