{"id": "4fe686748fd1aa7358e689ad58a9bde8", "url": "https://www.bonappetit.com/story/too-sick-to-cook", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "All the Things We Eat When We're Too Sick to Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Things We Eat When We're Too Sick to CookSomewhere between homemade chicken soup and delivery there's a world of foods we make when we're feeling low.By Emma WartzmanMarch 7, 2018FacebookTwitterEmailFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.As much as we try to fight end-of-winter sickness with morning tonics, supplements that strengthen our immune system or a solid eight hours of sleep, even the best of us get knocked out in this purgatory season. And when that happens, the easiest tasks feel super hard—including cooking. The last thing we want to do is exert energy in the kitchen (yes, even food editors know when it's time to step away from the stove). These are the foods that we're maybe a little bit embarrassed to admit we rely on for sustenance when all we really want to do is sit in bed and watch movies.Sleeve of saltines, salami, cutting board, ginger ale. —Adam Rapoport, editor in chiefI keep bone broth in the freezer so that when I'm sick I have it to warm up with miso stirred in. —Anna Stockwell, senior food editorWhen I'm sick and definitely not going out to the grocery store anytime soon, I make a big bowl of oatmeal. It's soothing to eat, nutritious, and can act as a base for anything I have lying around. Sometimes I'll go savory with kimchi and avocado, sometimes I'll add dried fruit and a big dollop of peanut butter. Every time I eat in bed, because that's what being sick is about after all. —Aliza Abarbanel, editorial assistant, HealthyishBanana bread oatmeal is definitely a cure for the common cold.\nPhoto by Alex LauWhen a cold knocked me out for several days this winter, I made the following soup on repeat: Canned broth with a little miso stirred in, mixed frozen vegetables (which I keep in my freezer for fried rice and sick meals like this one), and frozen dumplings. It was soothing to eat, easy to make, and didn't require a run to the store, meaning I never even had to change out of my pajamas. —Meryl Rothstein, features editorWhen I'm sick, I rely on something that I would call \"congee-adjacent.\" Cook rice for longer than you are supposed to with a bunch of water. Add to a bowl with fish sauce, peanuts, Sriracha. MEASURE NOTHING! —Carey Polis, digital directorIf I have chicken broth on hand, I love to whisk an egg in a small bowl, then into simmering broth for the quickest ever Stracciatella. A little bit of parm and black pepper to finish and then it's back to Netflix. —Molly Baz, senior food stylistI feel like I always get sick when I NEED to go food shopping, so I usually make what's in my fridge: Scrambled eggs, fried bread, and tons of hot sauce all over them to clear the sinuses. —Emily Schultz, associate social media managerCrack, whisk, cook, done.\nPhoto by Alex LauI love this Masala chai, but I add in some fresh turmeric along with the ginger, and use honey instead of maple syrup. —Claire Saffitz, senior food editorI eat frozen bananas smeared with nut butter whenever I feel feverish. Or whenever I feel anything, tbh.  —Amanda Shapiro, editor, HealthyishWhen I had the flu this season, all I could eat was buttered cinnamon-raisin toast and peeled oranges. When I'm getting over a stomach thing, it's buttered rice with parm. And when I am getting over a hangover, popcorn. —Carla Music, food directorButtered egg noodles, sometimes mixed with Better Than Bouillon-ed broth, is a standby. Or those tiny pastas, like pastina, with a little butter. I am not above a can of Campbell's chicken noodle soup. —Alyse Whitney, associate web editorI make myself weird oatmeal concoctions with whatever is in my pantry. I've made oatmeal with chicken broth instead of milk or water, oatmeal with a sweet potato, and, most recently, oatmeal with a can of baby corn. I'm embarrassed to admit that it was delicious (and if I learned anything, it's to add a can of water chestnuts too). —Elaheh Nozari, e-commerce editorExplore Bon AppétitGet WellHealthyishRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Emma Wartzman"]}