{"id": "4fee9ead0cafa1f9c0f4097636a3c83b", "url": "https://www.bonappetit.com/recipe/spring-hot-and-sour-soup", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Spring Hot-and-Sour Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpring Hot-and-Sour SoupBy Chris MoroccoApril 6, 20204.5(78)Read ReviewsTriangleEmailPinterestPrintPhoto by Chris Morocco EmailPinterestPrintEmailPinterestPrintHot-and-sour soup inspired this highly nontraditional springtime version. Miso gives just enough body so that you won't need cornstarch to thicken it, and you can use silken tofu or thinly sliced yuba instead of egg for that same silky effect.Ingredients2 servings1Tbsp. extra-virgin olive oil or vegetable oil3garlic cloves, thinly sliced11” piece ginger, peeled, finely chopped2Tbsp. miso1Tbsp. soy sauce2tsp. unseasoned rice vinegar or apple cider vinegar½tsp. toasted sesame oil½tsp. Aleppo-style pepper or ¼ tsp. crushed red pepper flakes, plus more for serving if desired2oz. shiitake or crimini mushrooms, trimmed, thinly sliced1cup mixed peas (such as baby and/or trimmed snow and/or sugar snap, halved if large)1large egg, lightly beaten, or 8 oz. silken tofu or 2.5 oz. yuba sheetsKosher saltPreparationStep 1Heat olive oil in a medium saucepan over medium. Cook garlic and ginger, stirring often, until softened and very fragrant, about 3 minutes. Add 3 cups water. Combine miso and 2 Tbsp. water in a small bowl and stir to dissolve miso. Whisk into aromatics, then add soy sauce, vinegar, sesame oil, and ½ tsp. Aleppo-style pepper. Increase heat to medium-high and bring to a simmer. Reduce heat as needed to maintain a simmer and cook until flavors come together, about 10 minutes.Step 2Add mushrooms and peas and cook until crisp-tender, about 3 minutes. Gently stir in the egg (a few turns of a spoon will be enough to set it into ribbons without blasting it apart) and cook until just set, about 30 seconds. Or, if using tofu, drop in by spoonfuls, or if using yuba, thinly slice before adding, and cook just until heated through, about 1 minute. Season with salt.Step 3Ladle soup into bowls and sprinkle with more Aleppo-style pepper if desired.How would you rate Spring Hot-and-Sour Soup?Leave a ReviewTell us what you thinkReviews (53)Back to TopTriangleI’m actually astonished by how good this vegan soup is. It’s like a light, cleanse-friendly version of your typical takeout Tom Yum soup. I doubled the recipe, added a splash more apple cider vinegar since I like my Tom Yum on the tangy side, and used tofu instead of egg. Wish I had cilantro to top off at the end, but a squeeze of lime was good enough. Will be making this one again!ClaireLos Angeles4/22/2021SO GOOD! Letting it simmer, really helps to enhance the flavours. AnonymousCalifornia4/6/2021Loved this, but echoing what everyone else has been saying ok the initial recipe being very bland. Added about 5 Tablespoons on vinegar (malt vinegar did a better job than cider). Added fresh chillies, more soy sauce and the big difference maker... 2 tsp of wonton soup base powder. Tasted exactly like a hot and soup soup to me :)TLondon, UK2/24/2021This recipe is really good but missing kaffir lime leaves & lime juice. I haven't made it without them but I can't imagine it without... also to those saying it is bland, although it was not specified, I believe a darker miso is better. Bailey 1/4/2021Sounds good. Water not included in list of ingredients.TimAustralia12/28/2020Delicious!!!! Edward Szczerba New York 12/17/2020\nSeconding the other reviewers, in that in its original iteration, it is not flavorful enough. I doubled the garlic and ginger, substituted the water (for a broth made with low sodium chicken bouillon), doubled the Aleppo pepper, added soy sauce and coconut aminos to taste, increased the rice vinegar to taste, and omitted additional salt. I also added a little bit of gochujang for spice. Instead of the recommended vegetables, I used mustard greens (about 5.5 oz destemmed) and English peas (shelled, about 5oz volumetrically). While the recipe does not note what type of miso is to be used, I use miso yellow/light/white. I really loved the end product, but had to constantly taste, season and add flavor. I’ll be making it again.Anonymous9/7/2020I agree with the reviewer that called this broth a good baseline. It definitely needed additional vinegar to achieve the restaurant-style sourness. I was craving crispy tofu, so we skipped the egg and pan-fried some tofu cubes to add in at the end. If you're in the mood to get another pan dirty, it was great! I like everything a little spicier, so we used 50/50 chile sesame oil & the regular stuff. Added LOTS of heat without sacrificing flavor. I'll definitely return to this recipe.yagurlcarlyTucson, Arizona6/20/2020Wonderfully flavorful. Cut back on soy sauce a bit but otherwise perfect recipe.Anonymous6/14/2020As with any BA recipe, this is a good guide to start from. I used chicken bone broth in place of water, and my own homemade chile oil instead of red pepper flakes. If you want it to be actually sour, you need to add extra vinegar to taste. I also had to dial it back on the soy sauce so I didn't overload myself with salt. For 3 cups of liquid, I did two eggs instead of one so it would be more of a meal. Next time I'll go for one egg and try some tofu as well. The flavor profile is solid here though, so I will make it again.lifeis_shortLos Angeles, CA6/8/2020I love hot and sour soup and have somehow never thought to make it at home. It was not only worth it but it only took 20 minutes from start to finish. I definitely agree with the comments that if you follow the recipe the flavoring of the broth will be pretty bland. I kicked up the soy sauce and vinegar and that did the job. I also added bamboo shoots because I always live the texture of them in hot and sour soup. sarahmaeveHouston6/4/2020Recipe was great, but it tasted a little bland in my opinion. It may be that I just am not a big fan of hot and sour soup. Worth a shot if you're interested in trying a new recipe!johnnieaVancouver, Canada5/26/2020After doubling almost all the ingredients (miso, vinegar, garlic, ginger) this was delicious. Also added a tiny splash of vinegar and a small dollop of sambal oelek when served.  It'll go much quicker next time now that I know to add more of everything.cheflo2Seattle5/26/2020Meal on the table in 15 mins prep included, and delicious ! I'll be making this so many more timesIsabel helloMontreal, QC5/25/2020I love this recipe!  I did substitute the water for vegetable broth.  We have made this many times and will keep it in heavy rotation! AnonymousArizona5/14/2020Explore Bon AppétitSoupSoups and StewsShiitake MushroomMushroomVegetableMisoCondiments, Sauces & PastesAleppo-Style PepperHerbs & SpicesSpringQuickEasyWeeknight MealsStarterDairy-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-06", "author": ["Condé Nast", "Chris Morocco"]}