{"id": "5009fb0031ae8d8bd921928c7bc73b19", "url": "https://www.bonappetit.com/story/spicy-kimchi-slaw-recipe", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "This Spicy Kimchi Slaw Provides More Balance Than a Yoga Class | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Kimchi Slaw Provides More Balance Than a Yoga ClassThis crunchy slaw is one of our new summer side dish recipes, which means Aunt Weezy’s potato salad has some competition.By Emily SchultzMay 30, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailSo, I have a great aunt named Louise, but for some reason she goes by Weezy. And this gets confusing, because the great rapper Lil Wayne also goes by Weezy. To clarify, my aunt is not Lil Wayne. Now that we’ve got that out of the way, I would love to talk about this kimchi slaw.How this kimchi slaw made me think of my Aunt Weezy is quite simple, for all of you extremely confused right now. Every Memorial Day, 4th of July, and Labor Day, my entire family goes to my grandmother’s house on the Jersey Shore for a barbecue. And undoubtedly, Aunt Weezy shows up with her bright coral tube of lipstick and her mayo-laden potato salad. (If you’re reading this Aunt Weezy, I love you). The chopped string beans are a little too gray, the potatoes a little too mushy. It sits in mayo in a Tupperware container, waiting to be set out on the turquoise kitchen island. This is the image that comes to my mind when I think of summer side dishes. Not that they’re wrong (again, love ya Aunt Weezy!), it’s just that we’re already eating burgers, brownies and beer, so I’d prefer something a little lighter and crunchier in my side dish.In our new summer grilling issue, there’s a story all about different side dishes that ~ aren’t ~ drenched in mayo. Immediately this kimchi slaw caught my eye. I had to make it.I started with the creamy dressing, which is completely done in a blender: scallion bulbs, kimchi, kimchi brine, rice vinegar, fish sauce, Sriracha, and sesame oil. I didn’t have Sriracha, so I used Sambal Oelek instead, which worked out great. The toasty sesame oil and spicy sambal smelled exactly like a Buffalo chicken wing. As you stream oil into the blender, everything gets whipped and turned the dark orange color of the end of a sunset. My dressing was a little too thick, so I added an extra tablespoon of water and it loosened up.Then all I had to do was chop the vegetables for the slaw: Napa cabbage torn (or cut) into 2\" pieces, the green part of those scallions used in the dressing, and daikon radish, which cools down the heat from the spicy Sambal and kimchi brine. The recipe then calls for bagged shredded carrots, but I couldn’t find them at my store so I smashed up some Persian cucumbers, which ended up being a good thing because they’re just as crunchy, their water helped loosen the dressing a little more, and they cooled down the kimchi heat even further. Then I tossed everything together, seasoned with salt, poured the dressing on, and served it with sesame seeds and cilantro for more texture and color. You could chop it finer and serve it on a smash burger, or keep it as-is and have it as a spicy, funky, crunchy slaw to balance out all the hot dogs. And who knows, maybe it’ll even convert your own potato-salad-loving great aunt who has the same nickname as a famous rapper.Get the recipe:Spicy Kimchi SlawWe traded the goopy sweet mayo dressing in your typical cole slaw for a whipped, airy kimchi dressing. Cabbage two ways!View RecipeExplore Bon AppétitSummer SidesGrill BarbecueKimchiSlawRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Emily Schultz"]}