{"id": "501bc5776bda45bc8daab0fdb08ef43d", "url": "https://www.bonappetit.com/story/culinary-torch", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "A Culinary Torch Is the Kitchen Tool You Deserve (But Probably Don't \"Need\") | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Deserve a Culinary Torch Even If You Don't “Need” OneBecause fire is cool—and so are you.By Amiel StanekNovember 29, 2021FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’m not here to tell you that you need a culinary torch; if you’re like most home cooks, you probably don’t. A culinary torch is the kind of kitchen tool that is necessary in only very specific situations—brûléeing a crème brûlée, for instance, or blast-browning a sous vide steak—and if you don’t think you’ll ever find yourself in such a situation, well, that’s cupboard space for something else.Let’s be real, though: There are plenty of kitchen tools you don’t need but covet anyway. And in my humble opinion, a culinary torch is a whoooole lot more awesome than, say, a purpose-built squash seed-scraper, or a WiFi-enabled spoon rest. Because playing with fire is fun. And so are you. This is me giving you permission to buy one of the most fun kitchen gadgets out there just for the hell of it, even if all you ever do is dig it out of the cabinet every once in a while and click it on a few times when no one is looking. You don’t need it—you deserve it! And if this entreaty is speaking to you in any way, here’s what you should buy.For fans of The Great British Bake-OffJo Chef Butane Kitchen Torch$38 $32 at AmazonOkay, sorry, I’ve never actually watched this show, but people talk about it all the time and I’m willing to bet money that there’s some flaming dessert action that takes place. Fire makes for good TV! Anyways, this little refillable butane torch is what you want for putting the finishing touch on a baked Alaska, toasting the top of a lemon meringue pie, or browning some kind of s’mores-inspired behemoth you found on Pinterest. It’s lightweight, doesn’t take up too much space, and comes with about as much butane as you’ll probably use in 10 years. This cutie is ideal for desserts because it’s easy to wield in tighter spaces, producing a tight little tongue of concentrated flame that won’t accidentally set your tablecloth on fire when you’re trying to torch a dessert tableside. It is also great for lighting rows of birthday candles for middle-age people without getting Lighter Thumb.For the pyromaniac in all of us (…just me?)Bernzomatic TS8000 High Intensity Trigger Start Torch$58 at AmazonHOW COOL IS THAT NAME?? “Bernzomatic TS8000” sounds like a character from the Terminator movies, another thing I have not watched, and that is one of my favorite things about it. My other favorite thing about it is that it’s basically a small flamethrower, producing a whooshing jet of intense flame that, in all honesty, is kind of scary (in a cool and fun way!). The trigger unit itself is small and easy to stash in a drawer, which is a plus, but it needs to be attached to one of those bulky green propane cylinders you use with a camping stove in order to work, which makes the whole thing fairly heavy and bulky.But the power. The POWER! This bad boy has the firepower you need to touch up the crust on a standing rib roast or glazed holiday ham, get a batch of charcoal going for grilling, finish off a sous vide or reverse-seared steak, or get a quick char on roasted veggies for extra smokiness. It’s also clutch for when you invited friends over for a backyard campfire but are having a hard time getting the fire going even though you were a goddamn Boy Scout for eight years—it will create a distraction AND save you from humiliation.For the sous vide gear dadsBooker & Dax Searzall Torch Attachment$75 at AmazonThis one’s for the Real Heads, a niche product within a niche category, but pretty sick nonetheless. The brainchild of legendary food nerd Dave Arnold of Booker & Dax fame, the Searzall is essentially a metal cone that screws onto the end of a unit like the Bernzomatic TS8000 and concentrates that intense blast of flame across a discreet circle of heatproof alloy mesh, effectively turning your torch into a high-powered hand-held broiler. Cool, huh? This makes a powerful torch a bit more manageable to wield for longer periods of time, as is sometimes necessary when browning meats that were cooked sous vide or even cooking thin cuts or fillets of fish from raw. It also promises to eliminate “torch taste.” What is that? Apparently, it’s an off-flavor that some people detect in food that has been torched without a Searzall but is really just a Neat Piece of Information you can toss to dinner party guests while they watch you blast their entrée with something that looks like a weapon from Mad Max—another movie I have not seen.Set It On Fire!Mini Baked AlaskasThese showstopping miniature baked Alaskas are as foolproof as they are impressive, plus every easy-to-make component can be made ahead of time.View RecipeExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-29", "author": ["Condé Nast", "Amiel Stanek"]}