{"id": "5038359c133caa5a32fe323b0ddc02c1", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/the-diamond", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "The Diamond Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverThe DiamondProhibition-era glam (and meticulously made cocktails) in GastownFacebookPinterestTwitterEmailGrant HarderGO HERE: for a comprehensive cocktail list in The Diamond’s dapper second-story brick space. Lit by a chandelier and surrounded by trees, the atmosphere makes it feel like you’re drinking inside the world’s most elegant treehouse.ORDER THE: whatever appeals to you from the cocktail list that’s broken down by sections: Boozy, Delicate, Refreshing, and Overlooked, with the date and place of origin provided for every drink. As for the food, the menu is designed for sharing, so get a couple of the Serrano ham, truffled crispy fingerling potatoes with fresh ricotta, and the marinated artichoke and salsa verde.THE VIBE IS: late-night cool with artfully composed cocktails and stylish people to match. Later into the night, head over to the Elk Room (a curious little bar within this bar) for post-cocktail cocktails.PRACTICAL STUFF: Open every day: Monday to Thursday, from 5:30 p.m. to 1 a.m.; Friday to Saturday, from 5:30 p.m. to 2 a.m.; and Sunday, from 5:30 p.m. to midnight. Reservations available.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEGrapes & SodaKitsilano’s blink-and-you’ll-miss-it destination for cocktails and natural wine Upstairs at Campagnolo“Camp Upstairs” in Strathcona is the only carpeted dive bar you’ll want to spend time in33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}