{"id": "50670ad31fd649bc4c65c3c418fe43a2", "url": "https://www.bonappetit.com/story/kitchen-funnel", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "A Kitchen Funnel is An Essential Tool For Everyone Who Buys in Bulk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingIf You're Buying in Bulk, You Could Probably Use a Kitchen FunnelMy funnel brings all the goods to the jars.By Sarah JampelMay 12, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI buy from the bulk bins to save money and reduce disposable packaging. But I also buy from the bulk bins because I love to decant. That’s just a fancy way of saying that as soon as I get home I transfer all of my dried goods, from sushi rice to beluga lentils to oats to cumin seeds, into their respective jars.The tool that has made decanting fun—and frankly, possible—is a humble funnel, which directs all of the small stuff, prone to scattering, directly to its final destination. It’s my traffic controller, and it’s saved me so many minutes that I would have otherwise spent dust-busting (or worrying about the pile of farro that slipped off the counter and behind the stove).The funnel also lends a hand with liquids. I use it to portion my homemade kombucha, which I pour from a huge jug into much smaller jars after the first ferment, and to transfer the olive oil from its big tin into the more manageable bottle.Last but not least, as someone who spent the greater part of my formative years deluded enough to think I’d become a researcher, I welcome any kitchen tool that seems like it would be at home in a chem lab—tweezers, basters, test tubes (JK, no test tubes—yet!).Buy it: Norpro Stainless Steel Funnels, Set of 3, $16 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Sarah Jampel"]}