{"id": "508257322f947f432e750c720c072ca4", "url": "https://www.bonappetit.com/story/chicken-bean-stir-fry", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "This Chicken Stir-Fry Redeems Boneless, Skinless Chicken Breasts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYou'll Never Look at Boneless Skinless Chicken Breast the Same After Making This Stir FryJapanese dry curry inspired this dish that keeps the chicken plenty juicy.By Chris MoroccoJuly 24, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailBoneless skinless chicken breasts don’t give a damn about their bad reputation. They don’t care that you think of them as pale, dry, and rubbery. They don't mind that chicken thighs get all the glory with their crisp golden skin and braisey tenderness. They know that, for hot-and-fast cooking methods like stir-fries and cutlets, they'll always come out on top. They cook evenly and have great flavor, and they'll stay plenty juicy as long as they aren’t overcooked. With this chicken and beans stir fry recipe, I set out to prove just that.The first key move is to cut the breasts into ½-inch slices rather than chunks so that they cook evenly and are easy to flip rather than get knocked around randomly in the skillet. Next, you want to season the chicken with a sprinkle of sugar as well as salt, which allows the meat to brown more quickly. Don't be tempted to cook the meat all the way through the first time it's in the skillet. This is how you'll get it to stay juicy on the inside.Next come string beans, snap peas, and snow peas, which cook in just minutes and turn the dish into a full meal, with various shades of green and crispy-tender textures. For big, fast flavor, I took inspiration from Japanese dry curry, which usually uses ground meat and is cooked quickly with very little liquid, as opposed to saucier curries that can involve longer-braised meat and vegetables. I made a fast, mashed-together mixture of garlic, miso, soy sauce, curry powder, ginger, and olive oil that becomes a flavorful, concentrated paste when it hits the hot skillet and seasons the entire dish.The chicken and beans finish cooking in the saucy base, which reduces and intensifies in flavor. Top it with some scallions, and serve it alone or with rice. And just like that, chicken breast has been redeemed.It's time to stir fry:Chicken and Green Bean Stir-FryThis fast miso-curry paste and handfuls of charred green beans and peas transform skinless, boneless chicken breasts into a highly craveable dinner.View RecipeExplore Bon AppétitHealthyishChickenStir-FrySugar Snap PeaRead MoreLifestyleMake This Healthier Barbecue Sauce and Put It On Everything You Grill This SummerBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-24", "author": ["Condé Nast", "Chris Morocco"]}