{"id": "509bee43ba55ed69a8dd0e4d0ddadc0f", "url": "https://www.bonappetit.com/story/toast-whole-spices", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "You Should Be Toasting Spices at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Toasting Whole Spices at HomePre-ground spices can't hold a candle.By Alex DelanyMay 19, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.Imagine living your life in black and white. When autumn comes around, the trees turn from gray to...shades of grays. Blueberries are called grayberries. And blackberries are still called blackberries. Your whole world is gray. And then imagine one day you wake up and there’s color. The world is shining. A new, beautiful view. You're living in the gosh darn Wizard of Oz. That’s exactly what happens when you stop using pre-ground spices and start toasting whole spices at home. You tap into a whole new dimension of flavor you never knew existed.Okay, maybe that’s a little bit of an exaggeration, but just slightly. If you’ve read Basically before, you know that we’re big fans of buying our spices whole and then toasting and crushing them right before we include them in a recipe. We do this because whole spices have a longer shelf-life than ground ones.When you buy pre-ground spices, you’re essentially buying a shadow of what the spice once was. The minute a spice is ground, it starts to lose flavor. That means the ground coriander that’s been sitting in the back of your spice drawer for the past two years doesn’t taste much like coriander at all. To make spices taste as rich and vibrant as they possibly can, you'll want to toast them whole at home.Toasting spices in your kitchen is a simple process that doesn’t require much time, effort, or technology. All you need is a skillet, a stovetop, and whatever spices you want to toast. Get out a dry skillet (no oil) that's big enough that all of your spices can fit in a single layer—this ensures even cooking. Then set it over medium heat and don't step away from the stove.The heat draws out the oils from the spices, emphasizing and emboldening the flavor. Un-toasted cumin tastes like cumin, but toasted cumin? That stuff tastes like cumin’s confident, more mature cousin. And that’s all thanks to those released oils.So how do you know when your spices have been toasted? Well, there are a few signifiers. First, you’ll notice a change in color in your spices. They’ll darken as the heat starts to take effect. You might also hear your spices talking. No, no. Not talking. Popping. Some spices will pop as they toast. It’s totally cool if they don’t, but don’t freak out if they do. And you’ll also notice a smell—well-toasted nuts give off a fragrant aroma. The whole process generally takes between 2–4 minutes, depending on your batch size.Be sure to remove the spices from the skillet immediately. Even if you turn off the heat, the spices will continue to toast in the residual heat of the pan. Transfer your spices to a bowl or rimmed baking sheet as soon as they’ve hit the sweet spot.Photo by Laura Murray, Food Styling by Kat BoytsovaFrom here, you grind. If you have a mortar and pestle, excellent. That’s our favorite tool for grinding spices. If you don't, no worries at all. You can lay your spices out on a baking sheet and crush them with a pint glass or a heavy mug, or you can throw them in a bag and crush them with a mallet. Or maybe you'll get really into it and buy a spice grinder.But there is one word of warning: If you take your spices too far, start over. Burnt spices taste bitter and aggressive, so if we’re only talking about a couple minutes of your time, it’s better to just toast a new batch. This is a colorful, brilliant, spicy new world you’re living it in. Best keep it tasting as good as possible.Need a recipe for those toasted spices?Sheet-Pan Garam Masala ChickenMarinating in spiced yogurt gets you a juicy and super-tender chicken every time.View RecipeExplore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-19", "author": ["Condé Nast", "Alex Delany"]}