{"id": "509bd977b7ad312e30a8a4cb4ccde12d", "url": "https://www.bonappetit.com/recipe/turkey-and-bean-chili", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Turkey and Bean Chili Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurkey and Bean ChiliBy Carla Lalli MusicJanuary 29, 20204.5(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman,  Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintYes, turkey is a relatively lean protein, but when you pair it with white beans, a robust and concentrated chile purée, and simmer it for just long enough, it delivers major body and richness. The flavor deepens after a day or two, which makes this an ideal recipe to make ahead for friends or work into your weekly meal prep.Ingredients8 servings4cups low-sodium chicken broth3large or 6 medium ancho chiles2dried guajillo chiles2dried pasilla chiles2canned chipotle chiles in adobo6Tbsp. vegetable oil, divided3lb. ground turkey, preferably dark meatKosher salt2onions, finely chopped5garlic cloves, smashed1Tbsp. ground cumin2tsp. dried oregano2Tbsp. tomato paste112-oz. bottle hard cider or lager-style beer13\" cinnamon stick2bay leaves215.5-oz. cans cannellini beans, drained, rinsed3Tbsp. pure maple syrup1cup plain Greek yogurt2Tbsp. fresh lime juice (from 1–2 limes)Handful of cilantro leaves and stems, finely choppedFreshly ground black pepperTostadas (for serving)PreparationStep 1Bring broth to a simmer in a large Dutch oven or other heavy pot. Meanwhile, remove and discard stems from ancho, guajillo, and pasilla chiles. Tear flesh into a few pieces, letting seeds fall out. Transfer to a blender. Add hot broth and cover blender; let sit until chiles are softened, 25–30 minutes. Add chipotle chiles and blend on high speed until smooth, about 1 minute; set aside.Step 2Heat 2 Tbsp. oil in same pot over medium-high. Season turkey all over with salt. Add half of turkey to pot and smash down with a wooden spoon to flatten against surface of pot and break into smaller clumps. Cook, undisturbed, until underside is browned, top side is no longer pink, and most of the liquid is cooked off, 8–10 minutes. Using a slotted spoon, transfer to a plate. Repeat with another 2 Tbsp. oil and remaining turkey.Step 3Heat remaining 2 Tbsp. oil in same pot over medium. Add onions and garlic; season with salt and stir to combine. Cover pot and cook, stirring occasionally, until onions are translucent, very soft, and starting to brown around the edges, 10–12 minutes. Add cumin and oregano and cook, stirring frequently, until fragrant and sizzling, about 1 minute. Add tomato paste and cook, stirring to coat vegetables, until paste darkens slightly, about 1 minute. Add cider, cinnamon, and bay leaves and scrape up any brown bits stuck to bottom of pot (if you’re not using cider, skip this step and increase water in next step to 5 cups). Bring to a lively simmer and cook, stirring occasionally, until liquid is mostly reduced, about 5 minutes.Step 4Add reserved chile purée, beans, and maple syrup. Add 4 cups water to blender, swish around to loosen any remaining purée, then pour into pot; season with salt. Bring to a boil, reduce heat to medium-low, and gently simmer, partially covered and stirring occasionally, until liquid is thickened and very flavorful, about 1 hour. Add turkey and simmer until flavors have melded, about 30 minutes longer.Step 5Meanwhile, stir yogurt, lime juice, and cilantro in a small bowl to combine. Season to taste with salt.Step 6Taste chili and season with salt and pepper if needed. Remove from heat and fish out cinnamon stick and bay leaves. Divide chili among bowls. Top with a dollop of yogurt-lime sauce and some broken tostadas.Step 7Do Ahead: Chili (without yogurt sauce and tostadas) can be made 3 days ahead. Transfer to an airtight container and chill.How would you rate Turkey and Bean Chili?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleI could only find ancho chiles, added a couple more of the chipotle chiles in adobe - thought the heat was perfectly balanced with the other spices!! I did not add the cider, but did add a can (28 oz.) diced tomatoes with juices before adding chile broth. Perfect hearty stew for watching football in the fall / winter. Don't skip the lime yogurt. Mary P Washington, DC 1/24/2022Great taste, easy prep…satisfying savory winter mealSkye McClurePhoenix,AZ1/5/2022If it's too hot for you somehow, just leave out the chipotle chiles.  They are the only ones in the recipe with heat.HerfInnsmouth, MA1/5/2022This is a great chili recipe! Out of refusal to go to the store, I did the following: cooked 1ish cup of dried white beans in the instant pot (had only 1 can at home) used bean broth to soften chilis (mostly ancho and a few large mystery dried peppers I had) and immersion blended. Also only used 2lbs of turkey (2 store bought packets) and thought it was meaty enough. Used more cumin than called for, and added cumins seeds as well to ground. \n\nAgree with other reviewer that is was not greasy which I liked. Still rich and not lacking. In terms of spice level I thought it was nice, just depends on the peppers you use!CaroBrooklyn, NY11/5/2021We are trying to eat less red meat and I am skeptical of things made with ground turkey but this was fantastic. Made this exactly as written with homemade stock. Thankfully it lacked the greasiness of chili made with beef but had all the flavor because of the complex, flavorful chile sauce. This is going into the regalar rotation. CookingMom Nyack, NY 10/16/2021How has no one mentioned how spicy this chili is? I have a moderate heat tolerance but I was nearly dying after each bite, even after doubling the beans and water. Granted, some family members thought it was fine but for me, it was practically inedible.AndreaBrooklyn, NY8/10/2021We did not care for this at all. All we tasted was the heat from the peppers and very little else. I ended up adding a huge jar of tomatoes, a pile of mushrooms, celery and sweet peppers, and then it was passable. Won't make this again. ReneeVictoria6/14/2021the cinnamon and maple syrup pairs perfectly and add a sweet and salty kick!Kiersten Wasserman2/14/2021I hate to admit it, but some changes: I didn’t use cinnamon, could only find ancho chiles, had to use sour cream instead, and I cut the cider and maple syrup by maybe 1/3 each. I also used dried beans (cooked with a small onion, few garlic cloves, oil, and some bay leaves — i didn’t add more bay later); I supplemented some water with chicken stock but overall used my bean broth for soaking & blending the chiles and for the base of the soup liquid.\n\nThat being said, I was shocked at how much I loved this recipe. My market sells a mix of light and dark meat ground turkey, which was outstanding. I let the mixture get burned and stuck to the bottom of my dutch oven multiple times (once even removing the soup altogether to deglaze with beer), but the smoky sweet and mildly spicy flavors were fantastic and forgiving. My cooking time after the beans was probably the same even though I added the turkey and beans together sooner so by the end everything had nearly dissolved into perfection. I’m making a batch to deliver to my parents now, this smoky chili rocks. (I don’t post reviews but couldn’t resist. Any doubters should just keep cooking! It gets better and better and better.)JayFerndale, MI12/5/2020AMAZING!  The flavor is outstanding!! \n\nI left out the cider and used 5 cups of water as directed. I will double the turkey and add canned tomatoes next time...we like a meatier and chunky chili.  \n\nFor a simple Thanksgiving this year, I'm going to use this recipe as a lasagna sauce; I'm sure it will be sublime!  Can't wait!  ErisUnited States 11/23/2020MSYL1991@YAHOO.COM doesn't know what they're talking about; THIS RECIPE IS INSANELY GOOD. It bridges the gap between warm and spicy chili and a smooth, shiny mole. I think the addition of maple syrup is genius! I tried it without because I was skeptical, but it really tames the heat and intensity of the chilies and melds it altogether for perfect richness. Carla... thank you!Nikole SoteloSeattle11/2/2020Omg Carla, yum!!! This chili is so deep in flavour, such a comforting meal, so moreish; yet somehow remains healthy despite? I can't fault a thing about it, the ratios were perfect, the treatment of the turkey really added to the final product texturaly (and kept the mince tender as intended), the lime/yoghurt dressing cut through perfectly with a fresh acid hit. We will make this again soon. BelCombridgePhotographyCanberra - Australia5/1/2020Probably the greatest chili I've had. The flavors reminds me of my grandmother's mole. \nAnonymousOakland4/18/2020Made this yesterday but added pork chorizo to the turkey (could only find ground turkey breast).  Turkey thighs definitely would've been better, but the pork fat definitely helped the turkey breast.  Also added a 28 oz can of fire roasted tomatoes and couple splashes worchestire & balsamic and I think it really helped to meld the spicy and sweet flavors.  Could do without the cinnamon though.  All the chilis were great though!AnonymousNew York City3/25/2020I’ll be completely honest- I made this recipe and it was terrible. No flavor and the spice was missing. The maple syrup, cinnamon, and bay leaf combo all together was just bad.  I won’t make this again. msyl1991@yahoo.comCalifornia3/24/2020Explore Bon AppétitChiliStewSoups and StewsGround TurkeyTurkeyPoultryCannellini BeanWhite BeanBeanVegetableAncho ChileChileGuajillo ChilePasilla ChileMainNut-FreeHealthyishSimmerSuper BowlLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-29", "author": ["Condé Nast", "Carla Lalli Music"]}