{"id": "509cbfaf829c637772c865ced64f7540", "url": "https://www.bonappetit.com/story/rent-week-baked-chicken-wing-dinner", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "These Baked Chicken Wings Are the Only Thing You Need for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChicken Wing Dinner: A Rent Week WinnerThis is me giving you permission to eat chicken wings—and only chicken wings—for dinner tonight.By Alex DelanyMay 31, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf you’re the type of person who feels compelled to eat more than just baked chicken wings for dinner, turn back now. If you think that dinner must consist of a thoughtfully balanced plate of protein, vegetables, and carbohydrates, feel free to show yourself out. If you're the type of person who gets bored of eating perfectly-sauced chicken wing after perfectly-sauced chicken wing, this article is not for you. I’m sorry. I could only write so many crowd-pleasers before getting around to Chicken Wing Dinner.Alex, I recently heard you mention Chicken Wing Dinner. I’m very hungry and exhausted from living my life everyday. Plus, it’s Rent Week, so my wallet is on the lighter side of the spectrum. Could Chicken Wing Dinner work for me? Could you please tell me more?Of course. Of course! Chicken Wing Dinner is where you eat baked chicken wings—and only chicken wings—for dinner. It’s pretty spectacular, especially when the wings we’re talking about are some miso-sambal wings. Interested in flavorful, affordable pieces of chicken you can eat with your hands? Yes? Great. Throw on this playlist of Just Some Good Tunes (completely free of charge) that I made for you and grab those chicken wings from the fridge.Let’s make a marinade! You need brown sugar, fresh ginger, sambal oelek (or another hot chile paste), unseasoned rice vinegar, soy sauce, and red miso. If you don’t have red miso, white miso will be fine, and if you don’t have rice vinegar, you can substitute white vinegar at a slightly reduced amount.In a large bowl, mix ½ cup rice vinegar, ¼ cup soy sauce, and ⅓ cup sambal oelek. Whisk in ⅓ cup brown sugar, ¼ cup red miso, and 1 Tbsp. freshly grated ginger. (Use a Microplane for that grated ginger.) Add 3 lbs. of chicken wings—a mix of flats and drums, ideally—into the marinade and toss to coat. This should be between 25-30 wings—enough for Chicken Wing Dinner for two, or one extremely hungry person with leftovers. Let the wings hang out in the sauce for about 15 minutes.Chicken wings, being chicken wings.\nPhoto by Chelsie CraigIn the meantime, line a rimmed sheet pan with aluminum foil. After 15 minutes have passed, take the wings out of the bowl, spreading them across the tin foil. Leave the excess marinade in the bowl and save it. We’ll come back for that.Now we need to leave the wings, uncovered, in the fridge for at least an hour. This will remove some moisture from the skin, making it easier to get them crispy in the oven. You can do this for as long as a day, if you want, but we’ll err on the side of hungry and do it for an hour. I know. You have to deal with yourself for an hour. You can find something to do. I know that you can. You can listen to Anderson .Paak’s album Malibu from start to finish. That’s a groovy hour. You can walk four miles at a 15-minute per mile pace. That’s a healthy hour. You can count to 60, 60 times. That’s a pointless hour. Wow. Look. The skin on the wings has lost moisture. Let’s put them in the oven you preheated to 425°.Bake the wings on your foil-lined sheet pan for 30-40 minutes, flipping them over halfway through. The goal is to develop some serious browning on the outside of these guys.This is what we're working towards.\nPhoto by Chelsie CraigWhile the wings bake, we’ll turn our attention back to the marinade. This is the real value we’re getting from this whole ordeal. We’re going to turn that into the sauce that we toss the crispy wings in. WHOA! OKAY. DON'T FREAK OUT—WE’RE GONNA COOK IT! I KNOW THERE WAS RAW CHICKEN IN THERE. Jeez. Calm down. We take that leftover marinade and transfer it to a small saucepan. Heat the marinade over high heat. Once it starts to boil, turn the heat to low and let it simmer until the volume reduces by about half. This should take 8-10 minutes. You want it to be thicker than it was, but not syrupy.When the wings are cooked through, remove them from the oven, and turn on your broiler.Yes, your broiler. Maybe it lives on the top of your oven or in a weird drawer on the bottom of it, where you store those two cookbooks your aunt gave you for your birthday three years ago. Regardless, I want to assure you that your broiler is not scary. It’s a magical kitchen appliance that will crisp these chicken wings to tastefully-charred perfection. Place the tray of wings under the broiler for about 3 minutes. Remove the tray, flip the wings, and put them back under the broiler for another 3 minutes. Every broiler is different, so keep an eye on them. We want some very dark, crispy bits of the skin, but no one likes a lump of chicken charcoal. Let them rest for 5 minutes after the second broiler session comes to a close.The toss is all in the wrist. You have to get that flick down pat.\nPhoto by Chelsie CraigTime to toss those wings in sauce! The wing-tossing approach is important. I cannot overstate this. It involves precise technique, like changing a tire or a diaper, only instead of the consequence of failure involving a car accident or things not smelling great, you end up with soggy wings. All that crispiness we worked for...gone. Wasted. Donezo. The most important thing is only tossing as many wings as you intend to serve or eat in a sitting. If you’re going to eat five wings and then eat another five wings an hour and a half later, toss the first five, finish eating them, and then toss the second five. And when we toss, we don’t want to drown them in sauce. Place the wings in a large bowl, and then drizzle just a bit of sauce over them. You can always add more sauce while tossing, but you can’t take any away.Does this sound obsessive? Like I care too much? I don’t know. How about you try it, eat your crispy, sauced wings, and get back to me. And if you feel the need to eat something other than wings for dinner, keep it simple. Maybe a pot of steamed white rice or some cabbage slaw. If you want a sprinkle of sliced scallions or some sesame seeds on top, go for it. Maybe a little lime juice, if you have one in the fridge. But don’t turn this into something else.Chicken Wing Dinner is not about sideline distractions. It’s not about a menu. It’s not about balance or health or variety.Chicken Wing Dinner is about focus. It’s about happiness. And it’s about chicken wings.Fine, you want something other than wings? How about a ramen stir fry? Or some crispy chicken thighs?Garage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyKale, mushrooms, onions, and a beautifully bold sauce make instant ramen noodles something to be excited about.View StoryThese Crispy Chicken Thighs Are the Only Way to Start the YearChicken thighs, with garlic-honey, are here for the first Rent Week of the year. Breathe. You're in a space now.View StoryExplore Bon AppétitChickenChicken WingBasicallyRent WeekMisoSambal OelekSoy SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "Alex Delany"]}