{"id": "50a0c9a84988a1b38dee35f311a66cc3", "url": "https://www.bonappetit.com/recipe/vegan-coconut-lentil-soup", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Vegan Coconut Lentil Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Coconut Lentil SoupBy Claire SaffitzJanuary 9, 20184.8(265)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintNever has such a flavorful, hearty, and warming meal come together so quickly or using so many pantry staples. We love it with a dollop of yogurt on top, but feel free to omit or use a non-dairy yogurt to keep it vegan.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASpoon$24.69 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonLadle$8 At AmazonIngredientsMakes about 8 cups1large onion6garlic cloves13-inch piece ginger2tablespoons virgin coconut oil5teaspoons curry powder½teaspoon cayenne pepper113.5-ounce can unsweetened coconut milk1cup split red lentils½cup unsweetened shredded coconut2teaspoons kosher salt, plus more110-ounce box frozen spinach, thawed115-ounce can crushed tomatoesPlain non-dairy or whole-milk yogurt (for serving; optional)PreparationStep 1Peel 1 onion and chop.  Smash 6 garlic cloves with the flat side of your knife. Peel, then finely chop. Peel 3\" piece ginger with a small spoon, then finely chop.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Heat 2 Tbsp. oil in large Dutch oven over medium. Add onion and cook, stirring often, just until translucent, 6–8 minutes.Step 3Add garlic and ginger and cook, stirring often, until garlic is starting to turn golden, about 5 minutes.Step 4Add 5 tsp. curry powder and ½ tsp. cayenne and cook, stirring constantly, until spices are aromatic and starting to stick to bottom of pot, about 1 minute.Step 5Add 13.5 oz. coconut milk and stir to loosen spices, then stir in 1 cup lentils, ½ cup shredded coconut, 2 tsp. salt, and 5 cups water.Step 6Bring to a boil over medium-high heat, then reduce heat to medium-low to keep soup at a gentle simmer. Cook, stirring occasionally, until lentils are broken down and soup is thickened, 25–30 minutes.Step 7Meanwhile, remove 10 oz. thawed frozen spinach from packaging and squeeze between your hands over sink to remove excess water. Transfer to cutting board and coarsely chop.Step 8Add spinach and 15 oz. tomatoes to pot and stir to combine. Taste and season with more salt. Simmer just to let flavors meld, about 5 minutes. Taste and season again with more salt.→  Frozen spinach: A shortcut we can totally get behind.Step 9Ladle soup into bowls. Top with yogurt, if desired.How would you rate Vegan Coconut Lentil Soup?Leave a ReviewTell us what you thinkReviews (83)Back to TopTriangleHoly moly—I did not expect this to be so good, as simple as it is. The dollop of yogurt is a must.AnonymousBrooklyn, NY3/2/2022I make this often! I always add a cubed sweet potato and a can of chickpeas to the recipe. Then usually add a little more water, curry powder and salt accordingly. The recipe is very forgiving! I love it :)AnonymousChampaign, IL1/24/2022We made this in the slow cooker and it turned out great! I sauteed the onions, etc and spices, then dumped everything in slow cooker (except for the spinach and tomatoes). Six hours on low, then I stirred in the spinach and tomatoes and brought it back to temp. What a great smell to come home to, especially on a cold day!AnonymousSaint Paul, MN1/17/2022Delicious! This dish needs some acid to bring it together, in my opinion - so I subbed the cayenne for a vinegar based hot sauce and a splash of apple cider vinegar, both added right at the end. Otherwise, I make this recipe as written.AliciaToronto, Ontario12/31/2021This is incredible. I added a little quinoa but otherwise left the recipe as is, and no regrets! So tasty, will make again. AileenHalifax, NS12/14/2021Deeeelicious! As tasty a lentil dish as I have ever eaten. It has become a weekly standby\nJR Lyonshawaii11/26/2021Great soup! Very easy, made with things you likely already have, and keeps well! I've been eating this soup all week and it keeps getting better. SOO good with a dollop of good yogurt. It's just what you want in your back pocket during the winter!CorrinaFort Collins, CO11/9/2021This soup is amazing! I used 10 oz of baby kale in place of the frozen spinach because I had some in my CSA that needed to be used. Because I didn’t have cayenne pepper, I also added one de-seeded fish pepper (a rather spicy pepper that Black farmers cultivated here in the Chesapeake Bay region), and if you like extra spice, I recommend adding a finely chopped hot pepper of your choice with the garlic and ginger. But truly delicious and fairly delicious to make. I’ll definitely be adding this to my fall/winter soup rotation! MegWashington DC9/26/2021Tonight is my 2nd time making and I love the recipe even more. For starters, if you see a recipe with a rating of 4.8 stars and over 200 reviews, its a MUST TRY in my book. I stumbled across this recipe because I was looking for a new vegan recipe to surprise my husband with. The first time I made it he was sweating from the intense heat of the cayenne (sorry babe), but he still ate almost 4 bowls. This time I prepared without the cayenne and it is literally still SOOO tasty! I used a can of Fire Roasted Tomatoes because I was out of the normal kind which was nice because it was visually more appealing. I also added in 2 fresh tomatoes because I always like the taste of fresh tomatoes in a soup. Lastly, I used Thai Yellow Curry paste instead of curry powder. The paste does has a bit of a kick (This may be why my husband was sweating the first time, as I used the paste on this attempt with cayenne lol), so this is why I did not use cayenne. Don't hesitate to try this recipe. You will love it and it will definitely become a family favoriteTynisha VargasChicago, IL9/14/2021Yum. My family loves this soup. The smells while cooking are delicious!! I use garam masala in the place of the curry as I don’t love curry powder & I think the garam masala just blends beautifully with the coconut, garlic & ginger notes. We are not vegan so we do top with the Greek yogurt. It just adds a nice tang & a creaminess you don’t get with coconut milk. This is really surprisingly delicious for such a simple recipe & I LOVE the unexpected use of shredded coconut here.April HFranklin, TN3/23/2021I’ve made this recipe so many times my family thinks its mine. Its always a hit and its become a bi-monthly request! I use Jamaican hot curry and a bit more Cayenne but it taste wonderful!!Jay🤗DC2/21/2021Hearty and flavorful soup! Reminds me of thai food. I'd recommend using a garlic press for the garlic and a microplane for the ginger to avoid annoying chunks. Couldn't find \"split\" red lentils so I used normal red ones and they worked fine. Serving with yogurt is amazing--try it with fresh cilantro on top too! AnonymousChicago, IL2/6/2021This is the best soup ever. I make it all the time. Usually I just put a ton of smoked paprika, turmeric and some cardamom instead of curry powder and it always turns out amazing. Sometimes I add quinoa too. AnonymousCroatia2/1/2021LOVE THIS RECIPE !!!!  I added two finely diced carrots and a can of corn kernels. Also did 4 tsp of curry powder and 1 tsp of garam masala.  Served with light sour cream.AlanaAdelaide, Australia1/29/2021From the first time I saw the picture, I knew I would like this soup. However, I have made this several times and I love it more each time I make it. It is so warming and delicious. It is a hug in a bowl. The only change I made was using vegetable stock instead of water. \nThis is a 5 plus star!! Incredible. Yum!!!Stephanie WalvatneMaple Grove, MN1/27/2021Explore Bon AppétitSoupSoups and StewsIndianSouth AsianAsianCoconut MilkOther IngredientsRed LentilLentilVegetableSpinachLeafy GreensEasyOne-Pot MealsWeeknight MealsStarterSideVeganVegetarianDairy-FreeGluten-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Claire Saffitz"]}