{"id": "50a8b23e09e5341a9465c6e33202eca5", "url": "https://www.bonappetit.com/story/sqirl-jam-club", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "This Sqirl Jam Club Brings The Restaurant's Iconic Toast to You—No Flight to L.A. Required | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Jam Club Brings Sqirl to You—No Flight to L.A. RequiredEvery day can start with that iconic toast, thanks to this year-long jam subscription.By Aliza AbarbanelNovember 13, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Even if you’ve never spent a Saturday morning in a scraggly Silver Lake brunch line, you probably can picture Sqirl’s infamous brioche toast. Chef Jessica Koslow’s most recognizable dish is sliced comically thick, with deeply toasted edges peeking out from a blanket of ricotta and two puddles of vibrant jam. Knife and fork definitely required, plus a napkin or three.It’s a truly transcendent toast set apart by Koslow’s handmade preserves, but you don’t need to book a flight to L.A. to get a taste of that crowning jam—just sign up for Sqirl’s jam club. The year-long subscription delivers two jars each month; each a true preservation of California produce that’s surprisingly juicy and never too sweet. Right now, I’m particularly partial to rosy Blenheim apricot and tangy cherry strawberry.These cute jams make for lovely presents, but you should know: This is a gateway gift. I first received a jar of Sqirl jam for Hanukkah a few years ago and blissfully imagined weeks of eating next-level PB&Js for lunch. But after gleefully dolloping jam into Greek yogurt and over ice cream, the jar was empty in a week. (I later learned that my partner was sneaking spoonfuls, which didn’t help matters.) My only course of action? Opt for a year-long subscription, and hope we learn a bit of self-restraint in the process.Buy it: Sqirl Bimonthly Jam Club, $180 for 24 jams at SqirlAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendJamsqirlShoppingRead MorecultureI Put This Condiment on Everything When I Can't Be Bothered to Make a SauceBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-13", "author": ["Condé Nast", "Aliza Abarbanel"]}