{"id": "50cc8e5b620f7d17dc0a3833651fb8af", "url": "https://www.bonappetit.com/story/upgrade-your-spritz", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "How to Upgrade Your Spritz This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Upgrade Your Spritz This SummerAperol? There's more to life than that, friend.By Alex DelanyJuly 22, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailYou know how they say we only use 10 percent of our brains? It turns out that isn’t really accurate. But that quotient of potential truthfully applies to the spritz. Most of us use Aperol or Campari, and then we stop exploring. Yet there’s a whole world of liqueurs out there with a lot of flavor to offer, from honey to cola, artichoke to baking spice—and you can make a spritz with any of them.The beauty of this cocktail is its simplicity and versatility. No matter what liqueur you’re using, the formula is always the same: 3 oz. dry sparkling wine (like cava or prosecco) to 2 oz. liqueur to 1 oz. soda water. Easy to remember! 3, 2, 1. Plus ice and a garnish, of course, to honor Italy’s most refreshing contribution to the season of summer.Below, we pulled together a list of easy-to-find, highly spritz-able amari and apertivi, in order from tame (sweeter, with simple flavors and minimal bitterness) to assertive (more bitter and complex). I’m digging a Zucca spritz with some orange and sage at the moment, but I’ll let you choose what lane you want to ride in.Photo by Chelsie CraigName: AperolItalian Region: VenetoFlavor profile: Mandarin orange, cotton candy, and a hint of dried bitter orange peelWho drinks it: People lounging next to resort pools, almost everyone elseSpritz Vibe: The Aperol spritz is the light lager of the spritz world, and that’s a compliment. Sometimes you just want to drink your drink, not unpack every intricate layer of flavor. The Aperol spritz is sweet, fruity, and refreshing.Garnish: Lemon peelPhoto by Chelsie CraigName: Amaro MontenegroItalian Region: Emilia-RomagnaFlavor profile: Honeysuckle, rose, allspice, a bit of candied orange peelWho drinks it: Those who are just brave enough to deviate from Aperol (Yay! Proud of you!)Spritz Vibe: Amaro Montenegro is sweet, like Aperol, but it moves past the one-dimensional orange territory into deeper, more herbal flavors. We call Amaro Montenegro TSA, because it’s The Starter Amaro, guaranteed not to offend even the most hesitant amaro drinkers.Garnish: Grapefruit peel and green olivePhoto by Chelsie CraigName: MelettiItalian Region: Le MarcheFlavor profile: Root beer, saffron, anise, dark chocolateWho drinks it: Grown-ups who still go to candy storesSpritz Vibe: If you were to drop a scoop of vanilla ice cream in a Meletti spritz, it probably wouldn’t suck. And that’s because a Meletti spritz—filled with syrupy sweetness and mildly spicy bark flavors—tastes a lot like root beer.Garnish: Orange peel and green olivePhoto by Chelsie CraigName: AvernaItalian Region: SicilyFlavor profile: Cola, licorice, caramelWho drinks it: Sicilians, people who want to be Sicilian, people who enjoy Coca-ColaSpritz Vibe: The Averna Spritz has that ’90s-era Coca-Cola commercial vibe, covered in stylized condensation that screams REFRESHMENT. It’s a pure hit of nostalgia for a fountain soda—playfully carbonated, sweet like Haribo Happy Cola bottles, and ideally served next to a sandwich.Garnish: Orange peel and green olivePhoto by Chelsie CraigName: Vecchio Amaro Del CapoItalian Region: CalabriaFlavor profile: Orange blossoms, chamomile, wild honey, peppermintWho drinks it: People who wear espadrilles, your NonnaSpritz Vibe: If you know what it feels like to walk down an old wooden boardwalk and end up with your feet in the sunny sand, you know how it feels to drink a Del Capo spritz: warm, light, and breezy, like where the land meets the sea.Garnish: Lemon peel and celery leavesPhoto by Chelsie CraigName: CampariItalian Region: PiedmontFlavor profile: Bitter orange, cinnamon, Luxardo cherryWho drinks it: Negroni obsessives, spritz enthusiastsSpritz Vibe: Campari is much more bitter, pronounced, and angular than Aperol. It’s still sweet with a citrusy backbone, but its bitterness balances with the sparkling wine better than most other amari. And you still get that photo-friendly pink-red-orange glow.Garnish: Lemon peelPhoto by Chelsie CraigName: CynarItalian Region: PiedmontFlavor profile: Artichoke, green sugar cane, dandelion greens, raisinsWho drinks it: Bartenders, your uncle who went to Italy once and talks about how Americans will never understand “café culture”Spritz Vibe: Cynar packs deep, vegetal flavor with a low ABV (16.5 percent). The bulk of its flavor is derived from artichokes, so a Cynar spritz ends up being slightly dirty but ultimately refreshing in the way a celery juice is refreshing—unfortunately without any of the health benefits. Unless you count the low-ABV.Garnish: Grapefruit slicePhoto by Chelsie CraigName: Rabarbaro ZuccaItalian Region: LombardyFlavor profile: Smoked rhubarb, molasses, cardamom, leatherWho drinks it: Cocktail maestros, mezcal freaks, backyard cookout prosSpritz Vibe: This spritz is equal parts warm, woody, and smoky, with an undercurrent of what was once fresh green leaves. The bubbles brighten the whole thing up, turning what could have been a dark, smoky cocktail into one that makes for the perfect summer bonfire beverage.Garnish: Orange peel and sagePhoto by Chelsie CraigName: Braulio BormioItalian Region: LombardyFlavor profile: Pine, spearmint, juniper, hearty herbsWho drinks it: People who enjoy hiking, gum chewers, lumberjacksSpritz Vibe: A Braulio spritz is all about that Alpine, uh...pine needle flavor, like a Christmas tree, flanked by an army of forest herbs. Drinking one of these—especially when you get a menthol-like kiss of mint—is a nice reminder that cooler weather will once again come your way.Garnish: Rosemary sprig and lemon peelPhoto by Chelsie CraigName: Amaro SibiliaItalian Region: Le MarcheFlavor profile: Floral honey, toasted nuts, charred oak, and coffeeWho drinks it: Adventurers, witchesSpritz Vibe: While Sibilia’s bitterness isn’t shy, it is the most herbaceous amaro on our list. When we call this spritz a potion, it’s out of respect for the amaro’s immense, toasted flavors. If you were to hop in a time machine to drink a spritz in the 1800s, you’d be sipping something like this: dark, medicinal, and nothing like Aperol.Garnish: Fresh or Luxardo cherriesNeed a couple more spritz recipes? We’ve got you.Booze + Soda + Bubbly Wine = All You Need for These 6 Spritz RecipesAnd a glass, I guess.View StoryExplore Bon AppétitCocktailSpritzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-22", "author": ["Condé Nast", "Alex Delany"]}