{"id": "50e6b36c531e135471543558b9fcfe29", "url": "https://www.bonappetit.com/story/what-is-eggnog", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "What Is Eggnog? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Eggnog?We’ve got our best noggins on the case.By Nico AvalleDecember 18, 2021FacebookTwitterEmailFacebookTwitterEmailMaybe you think of eggnog as a nostalgic drink from holidays past—or as the boozy cocktail that got you through an awkward party—but have you ever stopped to wonder: What is eggnog, that frothy, jolly beverage? Like, are there actually eggs in that carton? What the heck is “nog” anyway and is it like myrrh? (Answer: No.) We’ve got answers to all of your eggnog questions, from how to make it from scratch to the perfect booze to spike it with:Where did eggnog come from?While its exact origin is disputed, eggnog—as the majority of Americans know it—most likely came from Europe centuries ago. Its etymology is unclear, but common theories for the origin of the word “nog” point to both “noggin,” a type of cup, and “grog,” a historic term for watered-down rum. English settlers brought the drink with them across the Atlantic to what is now the United States and Canada, where French speakers call the drink “lait de poule,” or chicken’s milk. At the same time, egg-and-milk beverages were popping up in other regions throughout the world, and spiking these drinks with booze is far from an American-only tradition.Are there really eggs in eggnog? As the saying goes, if you want to make some eggnog, you have to break some eggs. At its core, eggnog is an emulsion of milk and/or cream, sugar, and, yes, eggs. Unlike in an egg cream—a similar old-timey drink that actually gets its name from the foamy, whipped egg white-like texture achieved by mixing seltzer and dairy fat—the “egg” in eggnog is very, very real.So real that our recipe for eggnog calls for a whopping six eggs, which are mixed vigorously with whole milk, heavy cream, and sugar into an extremely indulgent, extra-rich drink that's reminiscent, as Al Culliton once wrote, of “melted ice cream mixed with booze.” Recipe developer Amiel Stanek adds a full two cups of dark rum to his recipe. Non-alcoholic eggnog is still eggnog, though, so feel free to mix up a liquor-free batch for the whole family to enjoy. Besides, you can always add the booze at the end.In most cases, homemade eggnog will not be cooked or pasteurized before serving—so is it safe? Mostly. Consuming raw eggs isn’t recommended for the elderly, young children, and people with weakened immune systems. For everyone else, while there’s still a risk of foodborne illness, salmonella is actually rarer than you may think. Plus, alcohol is pretty much disinfectant (right? right???),* so if you’re adding rum you’re probably fine?***This writer is not a doctor and this article should not be viewed as medical advice.**Seriously folks, I studied literature, please be careful.Store-bought eggnog still contains eggs, but most are already pasteurized, so even the sickliest Scrooge can likely have a sip. What's more, the FDA only requires products sold as eggnog in the US to contain a paltry minimum of 1 percent egg solid overall. To account for that significantly lower egg content, eggnog in cartons usually contains stabilizers and binders to match the texture of the homemade stuff, which some blame for an “artificial” or more processed taste.How do you make eggnog? What kind of alcohol should I add?“A classic eggnog is just eggs, cream, and sugar,” says H. Joseph Ehrmann, longtime bartender and proprietor of Elixir, San Francisco’s second oldest saloon, “which means [that when you add booze,] it’s essentially a flip.” For the uninitiated, flips are a category of cocktail consisting of liquor, sugar, and—most importantly—eggs, that are mixed or shaken vigorously into foamy perfection. Ehrmann’s eggnog recipe is a seasonal favorite at Elixir, where he mixes the drink with a blend of cognac and rum. From there, he likes to add a few warming holiday flavors like nutmeg and cinnamon to spice things up before serving.If you’d like a variation on the classic cocktail, there are a few well-known options out there. You can make a Tom and Jerry, an eggnog-adjacent cocktail that’s served hot, but you should be careful when heating the drink to avoid cooking the eggs. Vegans can experiment with plant-based nogs—Ehrmann has been refining an oat-based recipe for veg-nog that he makes by blending together cashews, almond or oat milk, and whole oats. Our dairy-free Cashew Nut Nog opts for the creamy sweetness of coconut milk, although it maintains the egg whites for optimal foaminess. Feel free to get creative with your eggnog, adding a mix of spirits (like mezcal and crème de cacao) and your choice of garnishes (like allspice or cocoa powder). Ehrmann says bourbon and brandy are both great options but he also enjoys experimenting with other liquors. “I used to do an eggnog with a little bit of sherry and a little bit of añejo tequila,” a mixture I like to call ‘Añeggnog.’ Sure, maybe it’s not traditional, but what could be more appropriate for a classic holiday cocktail than a groan-worthy dad joke?Explore Bon AppétitcookingHoliday DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-18", "author": ["Condé Nast", "Nico Avalle"]}