{"id": "50ed97baf71673ce58447a2f3d4de750", "url": "https://www.bonappetit.com/recipe/clams-with-crispy-ham-and-butter-beans", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Clams With Crispy Ham and Butter Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueClams With Crispy Ham and Butter BeansBy Andy BaraghaniMarch 15, 20224.0(1)Read ReviewsTriangleEmailPinterestPrintPhotograph by Graydon Herriott, food styling by Sue Li, prop styling by Aneta Florczyk.EmailPinterestPrintEmailPinterestPrintIn this recipe the meat is a seasoning not a main component—that little bit of cured pork is key to bringing depth to the briny, light clams. To serve, place your aioli-slathered toast at the bottom of your bowl before loading it up with clams, beans, and crispy Serrano ham—it will soak up the flavorful broth to ensure you don’t miss a drop. Says Andy Baraghani: “I don’t even use utensils for this meal. I get in there with my hands and end up with clam broth all over my beard. Worth it.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonLarge Bowl$18 At AmazonTongs$13 At AmazonCan Opener$14 At AmazonIngredients4 servings¼cup extra-virgin olive oil6slices Serrano ham or prosciutto3spring onions or 1 large shallot, thinly sliced6garlic cloves, thinly sliced2Tbsp. double-concentrated tomato paste2tsp. smoked paprika1cup dry white wine4lb. small clams (such as littleneck or Manila; about 44), scrubbed115-oz. can butter, cannellini, or other white beans, rinsed1cup coarsely chopped parsley1cup store-bought or homemade aioli or mayonnaise4thick slices country-style bread, toastedPreparationStep 1Heat oil in a large Dutch oven or other heavy pot over medium. Arrange half of ham in pot in a single layer and cook, turning once or twice, until crisp, about 3 minutes. Using tongs, transfer to paper towels, leaving any fat in pot behind, and let drain. Repeat with remaining ham. Set aside.Step 2Add onions and garlic to same pot and cook, stirring occasionally, until slightly softened but without taking on any color, about 3 minutes. Stir in tomato paste and paprika and cook, stirring often, until paste deepens to a dark brick red, about 2 minutes. Pour in wine and cook until reduced by half, 2–3 minutes. Add clams, cover pot, and cook, shaking pot occasionally, until clams open, 3–7 minutes, depending on their size. Transfer clams to a large bowl with a slotted spoon as they open; discard any that don’t open.Step 3Reduce heat to medium-low. Add beans to pot and stir, letting beans soak up some of the clam broth, until warmed through, 1–2 minutes. Return clams to pot and remove from heat. Scatter half of parsley over and toss well.Step 4Slather aioli over toasts and place in bowls. Ladle clam mixture over toast. Top with remaining parsley. Crush reserved crispy ham and scatter over.Excerpted with permission from ‘The Cook You Want to Be: Everyday Recipes to Impress’ Copyright © 2022 by Andy Baraghani. Published by Lorena Jones Books, an Imprint of Penguin Random House.\n\nBuy on Amazon or Bookshop.orgHow would you rate Clams With Crispy Ham and Butter Beans?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerMainDairy-FreeNut-FreeSeafoodClamShellfishWhite BeanBeanVegetableCannellini BeanToastProsciuttoHamMeatSerrano HamSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}