{"id": "50f186a157c38d806f8eedb1d6faed9b", "url": "https://www.bonappetit.com/story/snail-world", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "This Snail Photo Book Is The Cutest Thing I've Seen All Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI’m Not Living My Best Life, But These Snails AreI can’t stop staring at these photos of tiny snails doing tiny human things.By Aliza AbarbanelDecember 16, 2020FacebookTwitterEmailAleia Murawski and Sam CopelandFacebookTwitterEmailEscapism comes in many forms right now, from reminiscing about karaoke-fueled holiday parties from years past to marathoning every episode of Gossip Girl. (Catch me doing both at once and try not to judge.) Now I have a new source of daydream fuel: Snail World, an adorably surreal book of miniature dioramas starring a surprisingly adorable snail (plus a few other slimy friends).Created by artists Sam Copeland and snail devotee Aleia Murawski, each page is a snapshot from an alternate universe: a place where snails split a carton of buttery popcorn at the movies and flirt across burgers at a neon-lit diner. In other words it’s exactly where I want to be right now. Check out some of my favorite food-fueled scenes below and get the full masterpiece on Broccoli Magazine’s website. What's in a snail's shopping cart? Whiskey, celery, and Doritos, of course. \nAleia Murawski and Sam CopelandA good reminder to take a lunch break—without a computer on the table. \nAleia Murawski and Sam CopelandEven snails know that true love is better with movie theater popcorn.\nAleia Murawski and Sam Copeland10/10, would snuggle up on a lettuce leaf. \nAleia Murawski and Sam CopelandHonestly, this snail has a better breakfast nook than anyone I know. \nAleia Murawski and Sam CopelandActual footage of me on New Year's Eve. Party hat is optional; wine bucket is mandatory. \nAleia Murawski and Sam CopelandExplore Bon AppétitHealthyishTrendsRead Morerecipes49 Healthyish Baked Goods to Satisfy Your Sweet (and Savory) Tooth Gallery49 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-16", "author": ["Condé Nast", "Aliza Abarbanel"]}