{"id": "51076ac3607c6aff2f391e26be4f2ba6", "url": "https://www.bonappetit.com/story/kitchen-witches", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "For TikTok's Kitchen Witches, It's Been a Year of Magical Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFor TikTok’s Kitchen Witches, It’s Been a Year of Magical CookingHome cooks seeking comfort and inspiration have prompted a renaissance of age-old spiritual practices.By Annie WernerJune 2, 2021FacebookTwitterEmailIllustration by Roisin O'DonnellFacebookTwitterEmailTo make Lizzie Markham’s “Black Raspberry Daiquiri for When Emotions Are Running High,” you’ll need white rum for strength and connection, simple syrup for sweetness, Chambord for pleasure and joy, lime juice for a mood boost, and a sprinkle of edible glitter “just because it’s beautiful.” Shake off the bad vibes in a shaker tin, then strain the shimmering contents into a glass. As Markham reminds you with a wink, this cocktail is not meant to be savored: “The faster you drink, the faster you feel better.”Markham, who has amassed more than 87,000 TikTok followers since December, belongs to a new wave of social media kitchen witches: spiritually-minded cooks who combine mysticism and wellness with recipe content. Though magical cooking has been around since prerecorded history, the pandemic has inspired a renaissance of these age-old traditions, reaching eager home cooks.The culinary rituals of kitchen witchery are wide-ranging, from multi-ingredient recipe spells to practical applications addressing specific pandemic woes. Got an excess of shallots you panic-ordered online? Domestic pagan @Madge_LaRue believes these pocket-size alliums hold powerful healing qualities and suggests to her 124,000 followers to fry and store them for later use in salads, sandwiches, and casseroles.Or maybe you’re looking to boost your creativity after months of Zoom fatigue. Keon Dillon (@millennialsoulfood) recommends brewing dandelion tea to clear away emotional blockage. Dillon has been a kitchen witch for 15 years; through their Instagram Reels, they dive into the history and practices of Hoodoo—known alternatively as conjure or rootwork—a centuries-old African American spiritual tradition created by enslaved people.“Food is important for Hoodoo and spell work,” Dillon says. “Almost all ingredients have metaphysical and culinary properties.” They recommend using thyme, rosemary, bay leaf, and other botanicals for prosperity, cleansing, and clarity.There’s no single methodology when it comes to spiritual cooking today. Practitioners like LaRue, Markham, and Dillon pull from many different resources to explore their own brand of mystical food practice. Some pair the globally and historically diverse tenets of herbalism with incantations or other rituals to enhance the metaphysical experience. Home chefs dabbling in food spirituality are encouraged to dive into their own ancestral history for inspiration. Hoodoo, the spiritual philosophies behind Chinese folk medicine, and paganism (which originates from European customs) each come from distinct cultural traditions. Researching on your own is essential to better understand the complex racial and cultural origins of these practices—and to avoid appropriating or partaking in a closed spiritual tradition.Though food-based spirituality may be manifold, almost any spiritual cook will tell you that the power of the practice lies in being mindful of what you consume. Whether or not you believe a garden herb can bring prosperity into your life, there’s no denying the positive effects of intentionality. Mental health experts also cite mindfulness as a means to manage stress and lead a healthier lifestyle.“Spell casting with food and simply being mindful about your intentions, those are the same things,” says Adrian Chang of food journal My Kitsune Café. “One just happens to be more aesthetically mystical than the other.” Chang has been experimenting with spirituality in his cooking for several years now, but he isn’t surprised to see the uptick in interest throughout the pandemic. “It’s no coincidence that everyone in the world right now is going through this kind of soul-searching, whether that’s by baking sourdough or just going back to the basics and rediscovering our purpose,” Chang says. “People want to be more present in their lives.”During periods of political instability and institutional mistrust, spiritual practices have long been a source of comfort and motivation. Medieval forms of magical “cures” offered a false hope during the Black Plague; some turned to witchcraft as a form of political resistance post-2016 election. Of course, no credible practitioners are hawking coronavirus-curing food spells or herbal remedies for geopolitical crises. But never in recent history have global events so sharply altered so many people's relationship to food. After months of grocery shortages and restaurant closings, spiritual cooking has offered people an empowering framework through which to approach uncertainty, both within and beyond the kitchen. Ongoing racial reckonings have also catalyzed a boom in food spirituality. “Speaking as a person of color, our foods are who we are, who our parents are, who our ancestors are,” Chang says. Turning to one’s own cultural history through cooking, he says, serves as a source of vital connection with the divine.In January, Chang collaborated with Erin Wilkins, founder of Bay Area–based herbal medicine shop and clinic Herb Folk, for a series of popular online workshops. Each class focuses on the relationship between Asian foods and folk traditions by discussing how spiritual and philosophical Chinese medicine concepts appear in common dishes (such as the circulating life force known as qi in dashi and root vegetable broth).“It’s been a really beautiful, healing experience, taking the time to dig in and develop my ancestral recipes,” Wilkins says. Until the pandemic, she hadn’t deeply explored the nonclinical side of her practice, but the results have been as spiritually fulfilling as they are delicious. “I learned to make a bomb Japanese curry during quarantine that just warms my soul.”Spiritual nourishment is, after all, nothing without taste. Whether you’re a kitchen witch or a trained herbalist, conjuring the right flavors is key. “It doesn't matter what the magical properties are,” says Markham, “if it doesn’t taste good, it’s not going to work for you.” But that’s where the beauty in the practice lies. “If you don’t like the outcome of something,” she says, “you have the power to change the recipe.”Explore Bon AppétitHealthyishTrendsRead MoreLifestyleAstrology Apps and Tarot Cards: My Pandemic Search for CertaintyBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-02", "author": ["Condé Nast", "Annie Werner"]}