{"id": "511309d61d8c4dc99e36266b2bfa0f33", "url": "https://www.bonappetit.com/recipe/salsa-de-arbol", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Salsa de Árbol Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueSalsa de ÁrbolBy Rick MartinezFebruary 11, 20205.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThis easy chile-spiked simmered tomato salsa pairs well with these beet-topped tostadas, but it’s definitely an applicable topper for all your taco needs—and beyond.IngredientsMakes about 2 cups3Tbsp. extra-virgin olive oil3dried chiles de árbol, seeds removed, chopped2garlic cloves, finely grated114.5-oz. can diced fire-roasted tomatoesKosher salt2Tbsp. fresh lime juicePreparationStep 1Heat oil in a medium saucepan over medium. Add chiles and garlic and cook, stirring constantly, until lightly toasted and very fragrant, about 30 seconds. Add tomatoes and 1 cup water, increase heat to medium-high, and cook, stirring occasionally, until most of the liquid has evaporated and tomatoes are very tender, about 15 minutes.Step 2Season tomato mixture with salt. Using a potato masher, smash until the consistency of a chunky salsa. Let cool, then stir in lime juice.Step 3Do Ahead: Salsa (without lime juice) can be made 3 days ahead. Cover and chill. Add lime juice just before serving.How would you rate Salsa de Árbol?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSo good and easy to make. Should have let my tomatoes evaporate more liquid but that was my impatience. I now have a million chile de arbol, and I am not upset about it. AnonymousCalgary, AB, Canada6/27/2020Excellent salsa, I left the seeds in for a hotter salsa and blended it mine instead. It looked beautiful and was a hit.AnonymousTexas5/28/2020Explore Bon AppétitSalsaCondimentMexicanLatin AmericanCanned TomatoTomatoVegetableChileChile de ÁrbolQuickEasy5 Ingredients or FewerVeganVegetarianDairy-FreeGluten-FreeNut-FreeKetoHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Rick Martinez"]}