{"id": "5117a6f44e25676a9e4e5c0a87a52889", "url": "https://www.bonappetit.com/recipe/chicken-legs-under-a-brick-with-chile-oil", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Chicken Legs Under a Brick Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueChicken Legs Under a Brick with Chile OilBy Kelly MarianiJuly 9, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintIf boning the whole chicken legs isn’t your thing, just use eight skin-on, boneless chicken thighs instead. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients4 servings3guajillo chiles3pasilla chiles2dried New Mexico or dulce rojo chiles1garlic clove, finely grated1Tbsp. red wine vinegar½cup extra-virgin olive oil, plus more for drizzlingKosher salt4chicken quartersFreshly ground black pepperPreparationStep 1Preheat oven to 350°. Remove stems and seeds from chiles and arrange on a small rimmed baking sheet. Cook until just barely dry and crisp, about 3 minutes (don’t let them burn or the chile oil will be bitter). Let cool, then grind to a powder in a spice mill, mortar and pestle, or blender. (You should have 2 Tbsp.)Step 2Whisk chile powder with garlic, vinegar, and ½ cup oil in a small bowl to combine; season with salt. Let sit while you grill the chicken.Step 3Prepare a grill for medium to medium-low heat. Working with 1 quarter at a time, place chicken, skin side down, on a cutting board. Using your fingers, feel for the thigh bone. Using a boning knife or another thin sharp knife, cut straight down into flesh until the tip of the knife hits the bone, then slice from one side to the other to expose its entire length. Using short strokes and trying to stay as close to the bone as possible, cut meat away from bone on both sides, working your way around until you can wiggle the tip of your knife underneath it (take care not to cut through the skin). With the front end of your blade underneath the bone, slice upward toward free end of bone to release flesh. At this point, the bone should only be attached at the joint that connects it to the drumstick.Step 4Repeat this process, this time making a cut from the top of the drumstick bone (at the joint) down toward the foot end. Cut along either side of drumstick bone (same as you did with the thigh bone) until you can wiggle your knife underneath. With the blade angled toward the cutting board this time, cut meat away from bone. By now the drumstick and thigh bones should be attached only where they meet at the joint. Make small cuts all around and underneath joint until you can cut out bones completely. Cut away any pieces of cartilage that remain. Turn boned chicken over and smooth skin over meat and trim excess skin if needed. (Freeze bones for making stock if desired.)Step 5Season chicken quarters on both sides with salt and pepper and drizzle with oil. Place on grill, skin side down, and close together, then place a sheet of foil over chicken, covering all of the pieces. Place a large cast-iron skillet (or bricks) on top to press down on chicken. Cook until skin is very crisp and chicken is 90% cooked through (there should be a very small band of uncooked flesh in the center of each thigh), 10–14 minutes (if flare-ups occur, shift chicken to a new spot, then replace foil and skillet and continue cooking). Turn chicken onto flesh side to finish cooking through, about 3 minutes longer.Step 6Serve chicken with chile oil alongside for drizzling over.Step 7Do Ahead: Chile oil can be made 3 days ahead. Let cool; cover and chill.How would you rate Chicken Legs Under a Brick with Chile Oil?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGood - tip for “bricks” - use 5, 10 or 20 lb. weight plate ( from barbell) wrapped in foil. Nice and flat, and smaller than a cast iron pan!AnonymousCinicnnati OH1/6/2021Explore Bon AppétitChicken ThighChickenPoultryChileVegetableChicken LegGuajillo ChilePasilla ChileNew Mexico ChileMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}