{"id": "513bc4265a9949df321682fb68f2c189", "url": "https://www.bonappetit.com/story/burst-cherry-tomato-sauce", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "This Burst Cherry Tomato Sauce Is Only 15 Minutes Away | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Burst Cherry Tomato Sauce Is Only 15 Minutes AwayAnd allows you to eat as many cherry tomatoes as humanly possible.By Alex Beggs and Molly BazSeptember 6, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Anna BillingskogFacebookTwitterEmailCherry tomatoes are too often relegated to a sad salad fate. But c’mon, these are nature’s Gushers! Gimme that sweet jelly! Let’s show some love to the little guys.We’ve been on this September-is-the-best-time-to-eat kick, and right now, tomatoes are sweet, juicy, and practically glowing with ripeness (or maybe that’s the UV lens in our sunglasses). Pick up 2-27 pints of cherry tomatoes, especially candy-like Sun Golds if you spot them, and make this burst cherry tomato sauce. Every bite is an explosion of fun—if this were a cereal commercial that would be the tagline and then a little tomato would blow up on the screen.Y ThoBecause it’s very easy. Creator Molly Baz describes this recipe as “dump some stuff in a pot, let the heat do its work, tossy toss, cheese.” Molly Baz, pasta poet.The stuff you dump in a pot is a ton of olive oil (Molly: “Tell them it’s good for the Mediterranean diet!” Okay), garlic, basil, and then the tomatoes. The burst part comes in when you simmer the tomatoes, untouched, until they begin to burst open, and then cook them a little longer (10 minutes or so) to transform into a sauce. Different sizes of tomatoes mean they’ll break down at different rates, so you have varied textures in the final sauce “a good mix of saucy and bursty,” notes our poet. The “ton of olive oil” is not a cute suggestion, it’s necessary for this recipe to work. The highly acidic tomatoes need a lot of fat in order to emulsify into a glossy sauce that coats the pasta. “They need something to cling to,” Molly says looking off into the distance wistfully.The tomatoes, about midway through the cooking process.\nPhoto by Chelsie Craig, Food Styling by Anna BillingskogWhat About Grape TomatoesNOOOOOOOO. We HATE them. Did you read the unnecessary food feud of the week in the newsletter a few weeks back? Grape tomatoes have a taut, tough skin and they’re never sweet. They’re like the Red Delicious of tomatoes. HARD PASS. If you can’t find cherry tomatoes, this recipe works with regular tomatoes (cut into smaller pieces), which will break down in the same time, without the Explosion of Fun factor.Use the Good ParmThere are so few ingredients in this recipe, please use the real stuff, which should have PARMIGIANO-REGGIANO on the rind. (Or try one of these cheaper substitutes!)Use a “Stabby” Pasta ShapesLike these ruffled campanelle, or whatever shape looks fun to you. Something you can stab with a fork in order to get tomato bombs in as many bites as possible. We really thought this through.A Nice AnecdoteThis recipe was inspired by a meal that Molly ate when she studied abroad in Florence in college and lived with an Italian widow named Graziella. Every single day—and no this isn’t a screenplay, yet—Graziella went to the market and cooked for hours until Molly came home from school. “Every night I had to eat like, a Tuscan Thanksgiving dinner amount of food,” remembers Molly with absolute joy. At the time, Molly was studying art history, but the feasts Graziella made, and taught Molly how to make, steered her interest into cooking. This simple sauce was one of her go-tos. And now it’s ours too.Get the recipe:Burst Cherry Tomato PastaA simple sauce of juicy, bursty cherry tomatoes (aka nature’s Gushers) that comes together in around 15 minutes.View RecipeMore of Molly’s Pasta Moves:Explore Bon AppétitPastaCherry TomatoSummerWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Alex Beggs", "Molly Baz"]}