{"id": "5140be2cd9dd7238705240c90f840c8f", "url": "https://www.bonappetit.com/recipe/braised-oxtails-with-coconut-rice", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Braised Oxtails With Coconut RiceBraised Oxtails With Coconut Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBraised Oxtails With Coconut RiceBy Kwame OnwuachiMay 18, 20204.6(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Chris MoroccoEmailPinterestPrintEmailPinterestPrint“A bowl of oxtails is like a warm hug from my childhood,” says chef Kwame Onwuachi of Kith/Kin restaurant in D.C. “It’s my favorite Jamaican dish, and a good reminder of how complex and flavorful our food is.” Don’t rule out this recipe just because you can’t find oxtails. Any fatty and rich bone-in braising cut, from short ribs to duck legs, would be a great substitute; just be prepared to shorten the cook time.Ingredients4 servings Oxtails2½lb. oxtails (4–5 large or 6–7 medium), cut by your butcher about 2\" thickKosher salt2Tbsp. curry powder2Tbsp. vegetable oil4cups low-sodium chicken broth1bunch scallions, trimmed, cut into 2\" pieces1head of garlic, halved crosswise1–2Scotch bonnet chiles or other hot chiles (optional)A small handful of thyme sprigs13\" piece ginger, scrubbed, sliced ⅛\" thick2Tbsp. soy sauce1Tbsp. light or dark brown sugar1Tbsp. ground allspice or 2 tsp. allspice berries115-oz. can butter beans or other white beans, rinsedCoconut Rice and Assembly2Tbsp. unsalted butter2garlic cloves, finely chopped11\" piece ginger, peeled, finely chopped1cup unsweetened coconut milk2tsp. light or dark brown sugarKosher salt2cups jasmine or other long-grain white rice, rinsed until water runs clear1cup pigeon peas or red kidney beans from a can, rinsedSliced scallions or chives (for serving)PreparationOxtailsStep 1Preheat oven to 250°. Place oxtails in a medium bowl and season generously with salt. Sprinkle with curry powder and toss to coat completely. Heat oil in a medium Dutch oven or other heavy pot over medium-high. Cook oxtails, turning as needed, until deeply browned all over, 10–12 minutes. Add broth, scraping up any browned bits on bottom of pot. Add scallions, garlic, chiles (if using), thyme, ginger, soy sauce, brown sugar, and allspice. Bring to a simmer, partially cover pot, and transfer to oven. Braise oxtails, turning once or twice and adding a splash of water if pot is looking dry, until fork-tender and meat is beginning to fall apart, about 7 hours.Step 2Carefully transfer oxtails to a plate. Fish out and discard chiles. Skim fat from surface of braising liquid, then return to a boil over medium-high. Simmer until liquid coats a spoon, 5–8 minutes. Add beans to liquid; season with salt.Coconut Rice and AssemblyStep 3Melt butter in a medium pot over medium heat. Cook garlic and ginger, stirring often, until softened and very fragrant, about 3 minutes. Add coconut milk, brown sugar, and 1¾ cups water; season with salt. Add rice and pigeon peas and bring to a simmer. Cover pot and reduce heat to low. Cook until rice is tender and all the liquid is absorbed, 20–25 minutes. Remove from heat and let sit 10 minutes.Step 4To serve, fluff rice with a fork and divide among plates. Top with oxtails and sauce and scatter scallions over.How would you rate Braised Oxtails With Coconut Rice?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI have made this a few times and it is fantastic!  I have cut down on the cooking time by doing it in a pressure cooker for 45 minutes at high pressure.  I just had to cut the broth back to 1-2 cups.Anonymous2/2/2022Took all day but everything came together beautifully.AnonymousMilwaukee, WI1/17/2022I saw Chef Kwame make this on the bon appetit mag instagram in april 2020. I immediately went out and bought the ingredients and just followed along the instagram story as I had no idea there was a written recipe on the website. But I'm glad I cooked along with the Instagram story because it made me feel a more confident that I could riff a little bit more than when following a recipe. This recipe is insane, it's SO good and really does feel like a warm hug from my childhood.JamJersey City, NJ12/30/2021Very easy to make and absolutely delicious! This recipe is LONG to arrive to but has very few steps in the process to reach such delicious flavors and medley. 10/10 would recommend Lisa LewFlorida7/1/2021This was wonderful, made it mostly as written but substituted the scotch bonnets for two rawit peppers (sliced) since scotch bonnet peppers are harder to find here. Same with the beans, I had to use navy beans instead of butter beans and the suggested kidney beans instead of pigeon peas. Not very spicy at all so I would add more peppers next time. I cooked the meat for almost 7,5 hours at 120C with the last 2 hours on 100C, topped  up with some extra water, because the meat was already quite dark. I heavily salted the meat beforehand and used normal chicken broth, and the final salt level was perfect, I didn't have to add any more. The meaty beans in the sauce contrasted against the creamy fluffy rice was amazing.AnonymousAmsterdam5/2/2021Subbed the oxtail for short ribs; so so so good. AnonymousChicago, IL 2/6/2021Whooo-wheee! This recipe was wicked awesome! 🙌\nYou may want to back off the curry powder and allspice *very* slightly depending on your tastes - the flavour is delicious, but very strong, especially with the reduced sauce.\n\nAnother thing - be conservative with salt in the sauce, and wait until you add the beans and start reducing to decide if it needs more seasoning, since canned beans are often pretty salty, and once you reduce the sauce a bit it will be even saltier. Just taste and adjust as you go.AndyOttawa, ON12/5/2020Delicious! First time working on a recipe that takes so much time (wow braising is worth it though!) and quite pleased with the result. I actually browned the oxtail in a frying pan then transfered the meat to a turkey roaster for the braising because my landlord wouldnt have been pleased with me having the oven on for so long. Would def reccommend using an electric roaster oven, side benefit is that it does not heat up the entire kitchen like an actual oven would. This recipe is also really cost effective (at least in Canada) for the amount of food you get.OcculiCanada9/8/2020Absolutely phenomenal!  It is 100% worth the time that goes into it. The meat is fall-apart tender. I've been making this about once a month since I saw it. I haven't been able to find butter beans at my local grocery stores, but I can't wait until I do because I know it'll be even better. I've been using gandules as the pigeon peas. Anonymous8/25/2020This recipe was a massive hit with my family of 7. Defiantly will be doing this again. How ever I did sub the ox tail for beef brisket as I couldn’t get the ox. The coconut it’s beautiful! Wonderful recipe! AnonymousSouthwest England 6/6/2020Subbed in goat for oxtails and still works very well! Cooked for about 4.5 hours total at 120 celsius, and the meat was falling off the bone. A shot of vinegar (per Adam Ragusea) helps to liven up the sauce at the end.AnonymousUnited Kingdom6/5/2020Delicious! Surprised by how much heat was brought out with just two habaneros, but it was the perfect level for someone that likes spice. Never had Jamaican food before but this inspired me to try more Jamaican recipes!UrethrapapercutzIndiana5/28/2020Wowow made it today and it was so good! I don’t mean to be one of those reviewers who sub a bunch of ingredients in a recipe, but seeing how we’re in a lockdown, I didn’t want to go out just to grab two missing ingredients. Didn’t have all spice so subbed equal measurements of cinnamon, cloves and nutmeg. Didn’t have oxtails but did have beef shanks. I can see how it would be better with all spice and oxtails but still it was still VERY delicious despite the substitutions. Served with cabbage slaw for some acidity and crunch. Will definitely make this again!AnonymousToronto, Canada5/27/2020Absolutely delicious! So happy I decided to give this a go despite the 7 hour cooking time. Every part of the recipe was delicious. I was a bit hesitant about the coconut rice since coconut can be such a pronounced flavor but it was fantastic. The coconut flavor was subtle and brought brightness to the dish. I did strain the broth before bringing it back to boil which helped when trying to scrape off some of the fat. I will definitely be making this again!  AnonymousLos Angeles, CA5/26/2020I made this yesterday for dinner, prepping the beans (I used dried) and rubbing the oxtails in salt and curry powder the night before then starting the recipe in the late morning. I also prepped all of the ingredients that you add with the broth the night before so it was a really quick start in the morning. I cooked the beans fully the next morning too before adding them to the recipe later when they were called for. All parts of this meal were so delicious, I'm so happy I decided to go for it! By spreading it out over 2 days it was really not overwhelming and cleanup was pretty minimal too. The 7 hour timing was also perfect for me, the meat was really starting to fall apart. I chose to strain the brothy sauce before adding the beans and then bringing it to a boil to thicken. I felt that with the little bit of work it takes to eat oxtails I would appreciate not having so much to work around in the sauce. I will definitely make again and I know the coconut rice and beans will become a staple side dish even without the oxtails sometimes. Thank you for the great, well thought out recipe!AnonymousHawaii5/21/2020Explore Bon AppétitJamaicanCaribbeanOxtailBeefMeatCoconut MilkOther IngredientsRiceRice & GrainsFallWinterMainBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-18", "author": ["Condé Nast", "Kwame Onwuachi"]}