{"id": "51446145e2aa75b60b7b15d7f810d272", "url": "https://www.bonappetit.com/story/universal-lid", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "This Universal Lid Fits All of Your Pots and Pans  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One-Size-Fits-All Lid is Perfect For Clutter Haters and Kitchen MinimalistsAnd yes, it's better than a baking sheet. By Ali Slagle March 27, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI’ve developed and tested hundreds of recipes with just the equipment I already have—which, for context, doesn’t include a food processor, blender, or stand mixer—so why get anything more? But despite efforts to resist, I’ve recently welcomed in a large and unattractive gizmo/gadget/thingamajig: Zwilling’s universal lid.It’s a good lid—the grooves grip the edge of a pot or pan, making that satisfying plunk like when you finally get the blender on right—but not only for one vessel. As the name implies, it’s a good lid for all of your pots and pans, anything between 6 and 12 inches in diameter. That likely includes the entirety of your cookware collection.When frying capers are popping out of your skillet, or sputtering tomato paste is creating a murder scene on your walls, put on your universal lid until the wreckage dies down. When you’re soaking beans and you need to cover the bowl, reach for the lid, not the plastic wrap. When you have no idea where your stock pot lid is (or if you even have one), the universal lid is there. And when you need to cover the pan for oven polenta immediately, grab the universal lid (oven-safe up to 500° F!) instead of rummaging around the kitchen.A baking sheet may work in a pinch, but it’s no match for the universal lid. The lid’s heavy handle keeps it balanced on even a small frying pan. And where a baking sheet always seems to interfere with the pan’s handle, the Saturn-like rings on the universal lid are intentionally off center, leaving you with full access to a good grip.Before you ask, yes, I do have a set of silicone lids (they were a gift from the person I live with, so I’m stuck with them). They’ve been great at getting us to pay attention to our foil and plastic wrap dependencies, but one size doesn’t fit all or even most pans (and why do they make them for mugs…?). They also have the same structure problem as silicone baking mats, which is that they have none. They’re spineless, like dying fish, taking up more cabinet space than they warrant. A 10-inch silicone lid is too small to suction a 10-inch skillet, buckling from its balancing act right into your food. And a too-big lid risks flopping into your flame. They’re too flimsy to be trusted and they get too hot to handle safely.Once you’ve invested in your universal lid, your one remaining task is to figure out what to do with your now-defunct, mismatched, cumbersome lid collection. Take the whole lot to GoodWill so some lucky person may finally find their match, or bring them to your friends with the toddler (they make good instruments) and spend the rest of your relationship repenting. Or hang them on your living room wall for an avant-garde art installation. They can go anywhere—but not in your cramped kitchen. There’s only room for the one. But luckily, it’s one that does it all.Buy it: Zwilling Cookware Universal Lid, $31 on AmazonAli Slagle is a recipe developer, stylist, and writer based in Brooklyn.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-27", "author": ["Condé Nast", "Ali Slagle"]}