{"id": "5145adabefb1531b2e0af6e9ee4d9ef1", "url": "https://www.bonappetit.com/recipe/peach-pie", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Peach Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPeach PieBy Vallery LomasAugust 11, 20214.4(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat BoystovaEmailPinterestPrintEmailPinterestPrintThis peach pie from lawyer-turned-baking-champion Vallery Lomas is a labor of love, but the reward is a slice of pure sunshine. The nutmeg, vanilla, citrus juice and zest, and a splash of optional (but highly recommended) toffee-like brandy all enhance that quintessential peach flavor without overpowering it. Look for ripe but firm freestone (not clingstone) peaches, whose pits easily separate from the flesh, and take care not to expel too much juice in the pitting process or else you’ll end up with a too-runny filling. There are many ways to peel a peach, but our favorite method is to lightly score an X on the peach bottoms then blanch them whole in a large pot of boiling water for 30 seconds before transferring to an ice bath; the skins should slip right off. A glass deep-dish pie plate takes the guesswork out of monitoring the bottom crust so you can avoid the dreaded soggy bottom. Finally, let the pie fully cool for the neatest slices (we know, we know—it’s hard!). This recipe was adapted from Lomas’s equally fantastic peach cobbler recipe, which you can find in her debut cookbook, Life Is What You Bake It, available for preorder now.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron9\"-Diameter Deep Pie Dish$22 At AmazonFood Processor$49 At AmazonScale$25 At AmazonPastry Brush$9 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients8–10 servingsDough2½cups (313 g) all-purpose flour2tsp. granulated sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1cup (2 sticks) chilled unsalted butter, cut into 1\" pieces2Tbsp. apple cider vinegarFilling and Assembky1Tbsp. all-purpose flour, plus more for surface3½lb. ripe but firm peaches (about 10 medium), peeled, pitted, cut into ¾\"-thick wedges (about 6 cups)¼cup (30 g) cornstarch1Tbsp. fresh lemon juice1Tbsp. brandy (optional)2tsp. vanilla extract1tsp. finely grated orange zest1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¾tsp. ground nutmeg⅔cup (133 g) plus 2 Tbsp. granulated sugar, divided2Tbsp. chilled unsalted butter, cut into ½\" pieces1large egg½tsp. ground cinnamonVanilla ice cream (for serving; optional)Special EquipmentA 9\"-diameter deep pie dishPreparationDoughStep 1Pulse flour, sugar, and salt in a food processor just to combine. Add butter and pulse until most of the butter is pea-size with some larger pieces throughout. Drizzle vinegar and ⅓ cup ice water over and pulse, scraping down sides once, just until dough comes together in clumps and there are no large pockets of flour. (Alternatively, whisk flour, sugar, and salt in a large bowl and use a pastry cutter to work in butter, then mix in vinegar and water with a rubber spatula.)Step 2Transfer dough clumps to a clean work surface. Using a bench scraper, bring dough together (it will still look quite sandy and you might be tempted to add more water—don’t!) and gently pat into a 1\"-thick rectangle. Using bench scraper, fold dough in half, then gently pat down again into a 1\"-thick rectangle. Fold and pat down dough 2 more times (it should be fairly smooth at this point). Divide dough in half, flatten into disks, and wrap each tightly in plastic. Chill at least 2 hours and up to 3 days.Filling and AssemblyStep 3Let 1 disk of dough sit at room temperature 5 minutes to slightly soften. Roll dough on a floured surface to a 12\"-diameter round. Transfer dough to pie dish; lift up edges and allow dough to slump down into dish. Trim, leaving about 1\" overhang. Chill while you prepare the filling.Step 4Gently toss peaches, cornstarch, lemon juice, brandy (if using), vanilla extract, orange zest, salt, nutmeg, ⅔ cup (133 g) sugar, and 1 Tbsp. flour in a large bowl to coat; set filling aside.Step 5Roll second disk of dough on a floured surface to a 12\"-diameter round. Scrape reserved filling, including juices, into pie crust; dot filling with butter. Top with remaining dough round then press crust edges together and fold over to seal; crimp edges.Step 6Place pie on a foil-lined rimmed baking sheet and chill in freezer 20 minutes (this helps the crust to become extra flaky).Step 7Meanwhile, place a rack in middle of oven and preheat to 400°.Step 8Beat egg with 1 Tbsp. water in a small bowl. Mix cinnamon and remaining 2 Tbsp. sugar in another small bowl. Brush pie crust with egg wash, then sprinkle with cinnamon sugar. Cut slits in top of crust to make a large X.Step 9Bake pie on baking sheet 15 minutes. Reduce oven temperature to 350° and continue to bake pie, tenting with foil halfway through if crust is browning too quickly, until juices are thickened and bubbling in the center and crust is deep golden brown (check bottom if you can), about 1½ hours. Transfer pie to a wire rack and let cool at least 3 hours before serving.Step 10Serve slices of pie with scoops of vanilla ice cream if desired.Do ahead: Pie can be baked 3 days ahead. Cover tightly and chill.How would you rate Peach Pie?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThe taste was very good but it was very watery.  Not sure what I did wrong but I don't think I'll use this recipe again.  AnonymousColorado9/5/2021I love fruit pies and peaches with brandy made this pie extra special. I have also used ground walnuts as a bottom layer to help absorb the juices from the fruit.SueLas Vegas9/3/2021AssembkyAnonymous8/26/2021The crust is over baked.  Perhaps it is just the photo?Gail DVancouver8/24/2021Explore Bon AppétitPieDessertFruit DessertAmericanPeachStone FruitFruitSummerNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-11", "author": ["Condé Nast", "Vallery Lomas"]}