{"id": "514a51abe1dd3d36cb049be3abf5faac", "url": "https://www.bonappetit.com/story/spring-in-a-bottle", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Rhubarb Shrub is Like Spring in a Bottle—Here's How to Make It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRhubarb Shrub is Spring in a BottleRhubarb comes but once a year.By Al CullitonMay 15, 2020FacebookTwitterEmailPhoto by Michelle Heimerman FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Each May I marvel at how the earth works so quickly to provide us with food for our table (morels! asparagus! garlic scapes!) and how it puts on an invigorating show of blossoms and new leaves at the same time. Rhubarb follows the spring playbook perfectly; it’s a wonderful thing to use in the kitchen, in all its tart glory, but it’s also a real stunner, dressed up in bright pink, proclaiming its yearly rebirth with more than a little panache.If you’re like me and never want rhubarb season to end, making a shrub will help it last just a little longer. Shrubs are a broad category of “drinking vinegars,” made by employing sugar and vinegar to create a liquid product meant to be mixed with other ingredients and imbibed. Typically, shrubs are served with soda or used as part of a cocktail. I rely on them to take the place of liquor in non-alcoholic drinks, or to play the role of Campari in a 1-1-1 Negroni template. These “drinking vinegars,” as they’re also known, were very popular in the American colonial era. And, compared to canning, stirring together a shrub is simple. It requires a few days of time and very little effort.My approach is very easy and a bit different from other recipes I’ve seen, but trust me, I’ve tried various methods and this recipe works with many different combinations of fruit, sugar and vinegar. In honor of the fleeting rhubarb season, here’s how to make rhubarb-mint shrub or, as I like to think of it, spring in a bottle.Here we go! Slice 4 medium stalks of rhubarb crosswise until you’ve got 2 cups of it. Mix together 1¼ cups sugar (preferably organic) and ¼ teaspoon kosher salt in a small bowl. Pick the leaves off a couple sprigs of mint and clap them firmly between your hands once (this is to release the essential oils). In a large jar or container with an airtight lid (I like glass best, plastic is a good alternative, but avoid metal), layer the rhubarb and mint evenly with the sugar mixture. Seal the jar and turn it upside down a couple of times. Now, let it sit on the counter for a few hours. (If it’s hot out, just an hour or so will do! The juices are drawn out of the rhubarb more quickly at higher temps.) You want to see a fair amount of liquid in the jar at this point. Put your jar into the fridge overnight.Photo by Michelle HeimermanTwenty-four hours after you first combined the sugar mixture with the fruit, add 1 cup red wine vinegar. (I love this kind of vinegar, which amplifies the beautiful color imparted by the rhubarb here, but if you don’t have it, try apple cider or white wine vinegar). After adding the vinegar, leave it at room temp for a few hours, then taste it to see if it needs more vinegar (up to ¼ cup more). Turn the jar upside down a couple times, and put it back in the fridge for a minimum of 24 hours. If you can, try to wait longer, up to two days more, so the flavors can develop further.Photo by Michelle HeimermanWhen it’s ready, strain out the solids and bottle it. (Save the spent fruit! Editor Sarah Jampel is going to eat these sweet-tart “pickles” with yogurt, but you can also use them to garnish the cocktail that follows.) It’ll keep nicely in the fridge for six to eight weeks, but much longer if you keep it tightly sealed and save it for later use (i.e. you’re not exposing it to air by opening the container often).You can, of course, just top 1 oz. of shrub with some soda and call it a day, but you could also try a very easy drink. It’s a spring special that mimics the 3-2-1 template of a spritz but in an unexpected order. Into a Collins or wine glass, pour 1 oz. rhubarb shrub and 3 oz. something dry and bright, like white wine, fino or manzanilla sherry, or dry vermouth. Add ice and top with a couple ounces of good-quality tonic. For garnish, skewer one side of a lemon wheel, then arrange three pieces of your spent rhubarb on the pick, and skewer the other end of the lemon (it should look like three little rhubarbs wearing a lemon jacket). If you want to make this non-alcoholic, try replacing the wine with over-steeped white or Sencha tea.Photo by Michelle HeimermanNow that you’ve learned the art of the shrub, the possibilities are endless: peaches with white wine vinegar and granulated honey in the summer; cranberries, brown sugar, and apple cider vinegar in fall; or pineapple with white sugar and Champagne vinegar for a tropical number in the wintertime. Indeed, there is a shrub for all seasons but, for now, you’ll find me keeping rhubarb season alive for as long as I can.Explore Bon AppétitIt's That SimpleshrubCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-15", "author": ["Condé Nast", "Al Culliton"]}