{"id": "51588db524dcdfcdbdb11ea56d4dda63", "url": "https://www.bonappetit.com/recipe/winter-squash-bharta", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Winter Squash Bharta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueWinter Squash BhartaBy Sohla El-WayllyOctober 20, 20204.2(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBharta is a Bangladeshi style of seasoned meat or mashed vegetables usually served at room temperature alongside hot steamed rice. Its signature flavor comes from the use of pungent and fiery mustard seed oil. If you can’t find mustard seed oil, substitute with extra-virgin olive oil (the most flavorful oil you’ve got)—just don’t call it a bharta! This recipe is part of Sohla El-Waylly’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here. If you’re also making Sohla’s Milk and Honey Pie, roast the squash while you parbake the pie crust.Ingredients4 - 6 Servings12-lb. small red kuri, kabocha, or butternut squash3Tbsp. mustard seed oil*, dividedKosher salt½small red onion, finely chopped½cup finely chopped cilantro2red or green Thai chiles, thinly sliced2Tbsp. ghee1½tsp. ground coriander1tsp. ground cumin1tsp. Kashmiri chile powder or ½ tsp. cayenne pepperFreshly ground black pepperPreparationStep 1Preheat oven to 350°. Using a sharp heavy knife, halve squash lengthwise and scoop out seeds with a spoon (if desired, clean and use the seeds in Smashed Green Beans). Rub cut sides of squash with 1 Tbsp. oil and season generously with salt. Place cut side down on a rimmed baking sheet and roast until tender, 60–75 minutes.Step 2Scoop squash flesh from skin into a serving bowl. Using a potato masher or fork, smash until mostly smooth. Set aside a big spoonful of red onion and cilantro. Mix in chiles, ghee, coriander, cumin, chile powder, remaining red onion, remaining cilantro, and remaining 2 Tbsp. oil; season with salt and pepper.Step 3Top squash with reserved onion and cilantro just before serving.Step 4Do ahead: Squash can be baked and mashed 3 days ahead. Let cool; cover and chill.Step 5*Most mustard oils are not FDA-approved as edible in the United States due to their high erucic acid content. If you are concerned, look for Yandilla, an FDA-approved brand, online, or use olive oil instead.How would you rate Winter Squash Bharta?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleLove baingan bhartha, so tried this with red kuri squash, and again with kabocha squash.. gorgeous… loved it. Preferred the Kuri squash as there was more depth of flavour, rich and chestnutty, and rather than just sweetness like the kabocha..\n\nEasy to make too..! NandiniUK11/24/2021Question: Can you infuse a neutral oil with mustard seeds to get the same flavor profile?Sean M. MuddValley Village, CA10/12/2021Those of you who are not familiar with how bharta is supposed to taste like or dislike the flavor of wasabi will not enjoy this dish. As someone who grew up with bharta and has tried many different varieties and recipes, this variation is something I will be making often. I've used this base with tons of other squash varieties and potatoes and it's delish. \n\nI never thought I would see a dish like bharta included on Bon Appetit! I love the fact that it's being introduced to a wider audience. \n\n AnonymousLos Angeles12/6/2020Great flavor, simple to make. I was also confused on whether you just stir in the spices raw (which seems surprising) so I toasted them in a pan and then added the oil to heat it up a bit before stirring the oil/spice mixture into the squash. My squash also ended up a bit wetter than expected after baking. Since I made the whole thing ahead of time, I reheated the dish in the oven without a lid and evaporated some of the liquid before serving.Anonymous11/27/2020Are the spices mixed in while the squash is still warm? Or are they temped with the oil & then mixed in? Thank for the help, roasting the squash 2 days ahead for less oven monopoly on Thanksgiving :)Nicole GSan Diego 11/24/2020I've never had anything like mustard oil before this - smells of wasabi, has that sinus burn which is exciting when combined with the other burn of the chiles and spices. Gonna bring this to Thanksgiving!TimPittsburgh, PA11/21/2020Explore Bon AppétitBangladeshiSouth AsianAsianButternut SquashSquashVegetableKabocha SquashFallWinterEasySideVegetarianGluten-FreeHealthyishRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}