{"id": "515d5df20b20ea85a0957a704f8c2f99", "url": "https://www.bonappetit.com/story/kitchen-upgrades-for-under-dollar25", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Kitchen Upgrades for Under $25 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking25 Kitchen Upgrades for Under $25You’ve got the essentials. Time to level up.By MacKenzie Chung FeganNovember 5, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Let’s say you’ve assembled your kitchen essentials—the cast-iron pan, the chef’s knife, the big wooden cutting board. You’re doing great! So many meals are within your reach! You’ve built a solid foundation, so now it’s time to consider your second-string kitchen tools. We’re not talking about $400 Vitamix-type upgrades (although, by all means, get the Vitamix if you should find a windfall in your sofa cushions). These humbler tools won’t break the bank but will save you time and energy, all while making your moments in the kitchen that much more enjoyable.Citrus SqueezerYou’ve been using: A fork combined with the brute strength of your handsUpgrade: A double-handled citrus squeezer that will catch the seeds and wring every last drop of juice from your lemon or lime. Just make sure to put the cut side of the fruit down, facing the holes!OXO Good Grips Citrus Squeezer$17 at AmazonFrench Rolling PinYou’ve been using: A wine bottleUpgrade: If you plan on making more than one pie or batch of sugar cookies in your lifetime, purchasing a rolling pin is worth it. The simplicity of a French rolling pin, as opposed to the kind with the handles, gives you more control over your dough.Photo by Chelsie CraigFrench Rolling Pin$17 at Amazon$17 at Sur La TableMicroplane GraterYou’ve been using: A box graterUpgrade: A microplane that will morph a brick of parm into fluffy, cheesy clouds. You’ll also never need to mince garlic or ginger again.Microplane Gourmet Series Fine Blade Grater$17 at AmazonTake-Apart Kitchen ShearsYou’ve been using: The same scissors you keep by the door to open packagesUpgrade: A dedicated pair of heavy-duty kitchen shears to snip herbs and spatchcock chickens. We love the kind that comes apart for easy cleaning.Photo by Chelsie CraigJ.A. Henckels Take-Apart Kitchen Shears$15 at AmazonTwo-Step Waiter’s CorkscrewYou’ve been using: A free plastic corkscrew from your local liquor store or that kind with the two arms that flap up and down (known as a de Gaulle in France for the exuberant open arms pose of the former président)Upgrade: A reliable two-step corkscrew. There’s a reason it’s what waiters, sommeliers, and bartenders use—there’s a built-in blade to cut through foil and the articulating hinge gives you two steps of leverage so you’ll never break a cork again.Rabbit Two-Step Waiter’s Corkscrew$17 at Amazon$15 at RabbitThick Kitchen TowelsYou’ve been using: Flimsy, linty kitchen towelsUpgrade: You can never have too many kitchen towels! Keep the thin ones on hand for slinging over your shoulder while cooking, but get yourself a set of thick, absorbent towels for wiping up spills.Photo by Ted \\+ Chelsea CavanaughWilliams-Sonoma Classic Stripe Towels, Set of 4$20 at Williams-SonomaKitchen FunnelYou’ve been using: A steady handUpgrade: Maybe you bought a lot of bulk lentils in spring 2020. Maybe you needed to transfer them to smaller containers. Maybe you poured them from a flimsy plastic grocery bag into a mason jar too rapidly and spent the next 15 minutes picking tiny pink pulses off the counter and floor. Buy a funnel.Norpro Stainless Steel Funnels, Set of 3$11 at AmazonKitchen ScaleYou’ve been using: Measuring cups, your mediocre powers of estimationUpgrade: We’ve said it before, and we will say it again. And again. Guys. We really mean it. You will never regret owning a kitchen scale. Write us an angry letter if you do.Escali Primo P115C Precision Kitchen Food Scale$20 at Target$25 at AmazonTea InfuserYou’ve been using: Tea bags or a loose leaf tea ball that is impossible to fill without spillingUpgrade: Just like we recommend buying whole coffee beans instead of preground coffee, we’ll pick loose leaf tea over tea bags any day. Get yourself an easy-to-use tea infuser so you’re not fussing with tiny tea balls or fill-your-own tea bags.ForLife Extra-Fine Tea Infuser With Lid$18 at Harney & SonsGlass TumblersYou’ve been using: Jam jars, a rando pint glass, a glass that used to hold a candle and still smells vaguely like vetiverUpgrade: Matching drinking glasses like this set of indestructible French bistro tumblers from Duralex.Photo by Chelsie CraigDuralex Picardie Clear Tumbler, Set of 6$17 at AmazonKunz SpoonYou’ve been using: A spoon that wasn’t invented by a four-star chefUpgrade: Chef Gray Kunz couldn’t find a kitchen spoon quite to his liking, so he developed his own, perfectly proportioned and with a bowl deep enough to use for basting and saucing. This is now the spoon you’ll find in the kits of professional chefs everywhere.J.B. Prince Gray Kunz Sauce Spoon$22 at Amazon$12 at J.B. PrinceCooling RackYou’ve been using: A cutting board and an open windowUpgrade: Intellectually, we can see why a cooling rack might seem unnecessary. Everything will cool eventually—pretty sure that’s science, you might be thinking. But nothing will take fried chicken from crispy to soggy faster than steam condensing on a baking sheet. Cooling racks promote air circulation, which means your perfectly baked cake will stay perfect instead of hot boxing in its tin as it comes to room temperature.Wire RackCommercial grade wire pan cooling rack 4 elevated rack feet Chrome steel and oven safe$23 at BA MarketTweezer TongsYou’ve been using: Normal tongsUpgrade: These are more like two sturdy metal chopsticks welded together than the delicate needle-nose tongs you picture when you think of “Tweezer food,” and Sohla really thinks you should get a pair. Use them for everything from flipping frying tofu to maneuvering a chicken thigh on the grill.Küchenprofi 12-Inch Stainless Steel Tweezer Tongs$13 $12 at Amazon$20 at WayfairStainless-Steel LadleYou’ve been using: Your biggest spoonUpgrade: Ladle, ladle, ladle, I made you out of...stainless steel. Invest in one that isn’t plastic because serving chicken noodle soup with a melted ladle is a Sisyphean task.Winco 8-Ounce Stainless Steel Ladle$10 at AmazonFish SpatulaYou’ve been using: A normal spatulaUpgrade: “But I hardly ever cook fish!” I hear you saying. It doesn’t matter. A fish spatula is incredibly versatile—more flexible and delicate than a regular spatula, it allows you to nimbly maneuver pancakes in a crowded skillet or scrape up all the tasty good bits at the bottom of a small saucepan.Zach DesartWinco Stainless Steel Fish Spatula$8 at AmazonGlass Food Storage Containers With Plastic LidsYou’ve been using: A bowl covered with Saran Wrap, plastic take-out containersUpgrade: The true mark of adulthood is not whether you have a mortgage or floss regularly, but whether you own stackable food storage containers that can go from the freezer to the microwave to the dishwasher.Anchor Hocking 1-Cup Glass Food Storage Containers with Plastic Lids, Set of 4$14 at AmazonSpider StrainerYou’ve been using: A slotted spoonUpgrade: You need a spider if you do any type of deep frying, but it’s just as handy for fishing hard-boiled eggs, short pasta, or blanched vegetables out of a pot of hot water.Bamboo Handle 5\" Spider Strainer$9 at AmazonSteamer BasketYou’ve been using: A MacGyvered situation involving tinfoilUpgrade: Sure, there are ways to steam veggies and fish without a steamer. You can poke holes in an aluminum pie plate and perch it atop wadded-up foil, or you can find a strainer that fits juuust so inside a pot and balance a lid on top. But this adjustable steamer basket will transform any pot into the steam room of your veggies’ dreams.OXO Stainless Steel Good Grips Steamer with Extendable Handle$20 at AmazonMini Offset SpatulaYou’ve been using: A butter knifeUpgrade: If you bake and frost one birthday cake a year, a mini offset spatula is a worthwhile investment. But even if you don’t, this tiny boi will help you remove muffins from a warm tin, flip petite planks of tofu, and win presentation points as you swoosh hummus onto a snack plate.Ateco 4.5-Inch Offset Spatula$11 at AmazonSkura SpongesYou’ve been using: The same sponge for way too longUpgrade: A sponge that doesn’t smell like a sponge. Skura sponges have antimicrobial properties that keep them smelling fresher longer.Photo by Ted \\+ Chelsea CavanaughSkura Style Sponges$15 at AmazonOven ThermometerYou’ve been using: Your gentle, trusting natureUpgrade: There’s a good chance your oven is telling you one thing but doing another. Our favorite oven thermometer from Thermoworks is $43, but a cheaper analog model is a big step up from nothing!Oven Thermometer$7 at AmazonGlass Spice JarsYou’ve been using: The containers your spices came inUpgrade: If you’ve got a large spice collection, chances are your spice drawer or rack is a jumble of different sized containers each fighting for space in cramped quarters. With a set of these uniform 2-oz. glass jars, you can keep the amount you need for immediate cooking on hand while storing the larger containers in a cool, dark place. Bonus: The mouths of these jars are wide enough to dip a teaspoon into.Photo by Laura Murray, Food Styling by Kat Boytsova2 Oz. Glass Jars With Lids, 24 Pack$23 at AmazonAngled Liquid Measuring CupYou’ve been using: The same measuring cup you use for sugar and lentilsUpgrade: A measuring cup for liquid ingredients. Really! Remember when you learned about surface tension in sixth-grade science class? If you fill the type of measuring cup you normally use for flour to the top with water, you will likely end up with more than a cup of liquid. A liquid measuring cup allows you to more accurately gauge the volume—and this angled measuring cup makes it even easier.OXO Good Grips 2-Cup Angled Measuring Cup$9 at AmazonLabel MakerYou’ve been using: Your memory or a Sharpie and masking tapeUpgrade: Some may argue this is an office tool, but a label maker’s place is in the kitchen. Use it to organize your leftovers, your bulk pantry jars that you’ve filled with your funnel and your new tiny spice jars. So soothing.Brother P-Touch PTM95 Portable Label Maker$25 at AmazonBench ScraperYou’ve been using: A knife or your handsUpgrade: If you bake bread or biscuits, a bench scraper isn’t an upgrade—it’s a necessity. But a bench scraper comes in handy for non-bakers as well. Use it to transfer small mountains of diced vegetables from cutting board to pot. It’s a massive improvement over shuttling onions precariously balanced on your knife.Bench Scraper$8 at AmazonExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-05", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}