{"id": "5164adb5ff469b8eafea4eb20d4f1c13", "url": "https://www.bonappetit.com/recipe/basically-skillet-lasagna", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Basically Skillet Lasagna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Skillet LasagnaBy Kat BoytsovaMarch 17, 20194.2(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintFinally: an easy, cheesy, vegetarian(!) lasagna recipe that doesn't require you to dirty every pot and pan in your kitchen. But that's not all! It also comes together in just over an hour and, thanks to all that frozen spinach, delivers enough veggie goodness to justify eating a big pan of baked pasta on a Tuesday. If you don't have a cast-iron skillet, don't sweat—any sturdy, similarly-sized pan that has a heatproof handle will work almost as well here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonCast Iron Skillet$30 At AmazonSpatula$12.99 At AmazonDish Towel$6.15 At AmazonWooden Spoon$6 At AmazonMedium Bowl$17 At AmazonColander$11 At AmazonLadle$8 At AmazonSpoon$24.69 At AmazonIngredients6–8 servings2tsp. kosher salt, divided, plus more1large onion6garlic cloves¼cup extra-virgin olive oil314.5-oz. cans crushed tomatoes1tsp. dried oregano¾tsp. crushed red pepper flakesSmall bunch of basil, divided210-oz. packages frozen spinach, thawed2cups ricotta1tsp. freshly ground black pepper3oz. store-bought grated Parmesan, plus more for serving10oz. dried lasagna noodles28-oz. packages shredded low-moisture mozzarellaPreparationStep 1Place a rack in top-third of oven; preheat to 425°. Bring a large pot of generously salted water to a boil.Step 2Meanwhile, get some prep work out of the way. Peel 1 large onion, then finely chop. Set aside on cutting board. Crush 6 garlic cloves with the side of a chef’s knife, then peel and coarsely chop.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Heat ¼ cup extra-virgin oil in a 12\" ovenproof skillet over medium. Cook onion and garlic, stirring occasionally, until onion is beginning to brown and soften, about 5 minutes.Step 4Add 3 14.5-oz. cans crushed tomatoes, 1 tsp. dried oregano, ¾ tsp. crushed red pepper flakes, 3 whole basil sprigs, and 1 tsp. salt. Cook, stirring occasionally, until sauce is reduced and slightly thickened and flavors have melded, about 15 minutes. Remove from heat and pluck out basil sprigs.Step 5Meanwhile, place 20 oz. thawed spinach on a large clean kitchen towel and wring it out over the sink until no more water can be squeezed out. If you don't have any clean kitchen towels, you can also squeeze water out of the spinach by hand one small handful at a time, or press it in a fine-mesh sieve. Whatever you do, just don't skip this step—waterlogged spinach will make the finished dish too soupy.Step 6Mix spinach, 2 cups ricotta, 1 tsp. freshly ground black pepper, 3 oz. grated Parmesan, and remaining 1 tsp. salt in a medium bowl to combine.Step 7Cook 10 oz. lasagna noodles in boiling salted water, stirring occasionally and separating with a spatula to keep them from sticking, 4 minutes (they'll be very al dente at this point, but will finish cooking in oven). Drain noodles and leave in colander until ready to assemble.Step 8Using a ladle, transfer 3 cups sauce to a medium bowl, leaving just a thin layer of sauce behind. Spread to coat bottom of pan.Step 9Arrange noodles in a single layer over sauce in pan, breaking up a few sheets to fit and cover the whole surface. Top noodles with one-third of tomato sauce, spreading evenly with a spatula. Using a spoon, dollop half of the ricotta mixture in small mounds all over sauce. Sprinkle one-third of shredded mozzarella over ricotta mixture.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 10Repeat layering noodles, one-third of sauce, remaining ricotta mixture, and one-third of mozzarella one more time.  Top mozzarella with another layer of noodles. Spoon any remaining sauce over, then top with remaining mozzarella.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Bake lasagna until browned and bubbling, 15–20 minutes. Sprinkle some Parmesan over, then garnish with remaining basil leaves.How would you rate Basically Skillet Lasagna?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis came out absolutely delicious. Don't hate me, I added meat - I cooked up a lb of grass fed ground beef with the onions and garlic in the beginning. Also, don't hate me, I used a jar of tomato sauce instead of the crushed tomatoes - Raos. I think my jar was 32 oz so it was actually slightly too little (there are 3 14.5oz cans crushed tomatoes called for) and it still came out fine.   This was my first attempt at lasagna and I would definitely do this recipe again. I'd make the veg version, and I'd also do a version with Italian sausage. Oh! And I used fresh spinach that I sautéed and then used paper towels and a heavy water pitcher on top to press the water out of, instead of frozen bc I had spinach to use up, and that worked out great. Thanks Basically - always enjoy your recipes! AnnaleePhilly11/15/2020Well\n\nCast iron pans and dutch ovens scratch ceramic top stoves so other than that, it is a great recipe Santos SanchezBritish Columbia 11/13/2020Instead of a cast iron, I went with a dutch oven and it resulted in a delightfully tall lasagna. Great flavour and tons of food. Will absolutely be making it again. AnonymousCanada9/1/2020Loved this recipe. I should know because I’ve been eating leftovers of it for like a week! This recipe makes a ton of food and tasted delicious, even after a week in the fridge. Took a little bit of time but tasted really really good. If your cast iron is seasoned the tomatoes. shouldn’t be a problem.  Great recipe for a party. AnonymousNew York City 7/27/2020This lasagna is full of great flavor, the sauce is amazing and it does not take long to make at all. I used San Marzano crushed tomatoes and they made for a delicious sauce. I cooked my sauce in a dutch oven and assembled the lasagna in a glass baking dish because I do not own any cast iron, and it turned out great! This is an easy peasy recipe that I will make again and again. AnonymousOhio, United States12/9/2019This is such a good, basic vegetable lasagna recipe. No frills and takes significantly less time than a classic lasagna. I will admit the million comments warning against tomatoes in cast iron made me wary but since my cast iron is well seasoned there were no problems. I think if your cast iron skillet is not seasoned well enough to make this recipe, you should consider re-seasoning your skillet for the sake of everything you make in it.AnonymousIndiana, USA11/19/2019Why on earth use canned tomatoes? Its SO EASY AND QUICK to simply pour boiling water on fresh, ripe tomatoes whose skin has been slit. Then you rinse them under cold water and the skin comes off easy. Takes about 15 seconds per tomato. Then all you have to do is cut them and use them as required in the recipe. Believe me, the taste is better and sweeter than any tinned product- without the industrial after-taste. Worth the slight effort.\nAnonymous4/14/2019Exactly what I expected good veggie dish followed directions very good dish. seasonings could be turned up a bit.. basically wonderful!topdriverLake Orion Michigan 4/11/2019Really good, fast, and basic veggie recipe. I love the ricotta/spinach mixture - it's like eating spinach dip in pasta. It's especially good with homemade ricotta. I also used some of those kinda scary no-cook lasagna noodles, which worked out well (I think they soak up some of the excess moisture in the tomato sauce) but would've been better in a rectangle dish. I think if your cast iron is seasoned and oiled well enough it's not a problem - mine is still in great shape. Looking forward to leftovers for my lunches this week!AnonymousColorado4/1/2019So all the other comments had me scared to cook it in cast iron so I made the sauce in a nonstick skillet and assembled and baked the lasagna in a 13x9 ceramic dish. I ended up needing one extra noodle so I would recommend boiling a couple extra. If you have the room I recommend pulling the noodles out of the cooking water individually and laying them flat on some sheet pans because if you drain them into a colander they noodles will take on weird non flat shapes that aren’t conducive to lasagna. Overall very good vegetarian recipe. AnonymousTX3/31/2019This is your basic spinach lasagne recipe, which is always good. I used half cottage cheese/half ricotta and Aleppo in place of black pepper. \n\nWhile my cast iron skillet occasionally attains the state of seasoning acceptable for cooking tomatoes in, it is prone to seasoning recidivism in my house so I never cook tomatoes in it: The tomatoes impart a metallic taste to the food. (I grew up with this taste from my mother's cooking.) Drives me nuts to see photos of shakshuka cooked in cast iron, and while I'm at it, cooks using metal utensils in porcelain lined cast iron cocottes. I ruined my first one this way. Leta RogersSF Bay Area3/30/2019@ anonymous: tomatoes do not mix well with iron. iron blackens the sauce and tastes awful. but suit yourself. i just wouldn't do it or eat it. recommended skillet: either enameled cast iron or stainless steel. btw, i like your slip: should for shouldn't. PB-CUPNYC3/23/2019As long as your pan is properly seasoned, the acidity of the tomatoes should damage the pan and leach too much iron. Just dont make it in aluminum - that would truly be bad. Some people actually swear by cast iron with anemia, for the very small amount of iron that can be obtained.AnonymousChapel Hill, NC3/21/2019This is a solid easy recipe as is.  Add ground beef or Italian sausage for carnivores! \nSIDE NOTE:  How many people HATE the word \"basically\"?rckcsgrvPacific City Oregon3/20/2019Ingredients and technique generally look great but tomato definitely reacts with cast iron so one must find alternative pan. Gonna hafta vote newp on this, BA should know better. BTW, love those spatulas shown in the video: silicone with wooden handle. Unfortunately it is not the spatula pictured in equipment, and the link from there doesn't even lead to either of those spatulas. Oh, BA my foot! Marcus McGregorCORN BELT, USA3/20/2019Explore Bon AppétitPastaItalian AmericanAmericanSpinachLeafy GreensVegetableLasagnaPasta & NoodlesRicottaCheeseCanned TomatoTomatoMozzarellaWeeknight MealsMainVegetarianNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-17", "author": ["Condé Nast", "Kat Boytsova"]}