{"id": "5164d880bd4ee6c35f9688ca5c930fee", "url": "https://www.bonappetit.com/story/lula-cafe-turkey-sandwich", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "I Will Never Make a Sandwich as Good as The One at Lula Cafe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Will Never Make a Sandwich as Good as The One at Lula CafeWhich is why you have to go there.By Adam RapoportSeptember 27, 2019FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.“Why is your turkey sandwich so good?”That is, essentially, what I texted Jason Hammel, the chef and owner of Chicago’s Lula Cafe.Lula is a neighborhood joint that isn’t really one. Over its twenty years, it has developed a city-wide cult following for its thoughtful, ingredient-driven cooking while retaining the welcoming vibes of a Logan Square spot you might wander into on a Monday afternoon or Thursday night.These days, as Hammel explains, its main dinner menu offers up things like ground cherries and lamb ribs and chanterelles and gai lan and fermented squash. But the cafe menu reaches back to Lula’s original incarnation, and you can order the turkey sandwich, which Lula has served since Year One, from 9 a.m. to 11 p.m.The key to the sandwich’s staying power, I learned, is how considered every element is. How, like everything served at Lula, provenance matters, as does technique, and most importantly, balance. It’s the kind of sandwich you bite into, and it all just makes sense. No one element dominates—they all just complement each other.So, about those details. Let’s let Hammel the texter explain:“multigrain sourdough bread from Publican Quality Bread (Paul Kahan’s place), lightly toasted in rice bran oil on a griddle.turkey brined and roasted in house from Ferndale Farm (MN).slices of ‘mighty vine tomatoes’— a greenhouse tomato project based here in IL.super fine shaved red onion, rinsed in ice water.avocado with lime and salt.lettuces from Werp Farm in Northern MI.sprouts!hot sauce aioli (house made garlic mayo with a Vietnamese hot sauce)bacon from broadbent farmclassic mild cheddar cheese”No, not exactly how you or I might make a turkey sandwich. Which is exactly why we—and so many Chicagoans—line up to go to Lula Cafe, the neighborhood joint that isn’t really one.Go there: Lula CafeExplore Bon AppétitHighly RecommendRestaurantsChicagoSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-27", "author": ["Condé Nast", "Adam Rapoport"]}