{"id": "51670f0621b501783004aa69a4445d1d", "url": "https://www.bonappetit.com/story/final-collapsible-spork", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "This Collapsible Spork Is a Must-Have Accessory for Any Takeout Lover | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Love (or Even Like) Takeout, You Need This Collapsible SporkIt’s the season’s must-have accessory.By Aliza AbarbanelOctober 27, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Like many people, I’m coming to you live from a marathon stretch of picnics, takeout, and other outdoor dining activities. The past seven months have taught me one thing: You never know when you’ll need a fork, especially when eating with your hands is inadvisable. I’ll do just about anything to avoid the guilt of disposable cutlery, but after failing to remember to make a pit stop at my cutlery drawer before leaving my apartment one too many times, I got a bit desperate. Trust me when I say that attempting to eat mac and cheese with a butter knife is simply not worth the stress.But lately, Final’s spork has been a regular in my bag. In a feat of trademarked engineering, the full-size stainless-steel utensil collapses down into a palm-size silicone container, protected from leaky bottles of hand sanitizer, inky pens, and whatever else is jostling around in my tote bag. When lunchtime arrives, it unfolds with a pleasant snap, unfurling from discreet metal joints with the momentum of a brand-new umbrella. And although it’s just one drop in the single-use plastic bucket, it feels good to skip the disposable stuff.This collapsible cutlery tech comes for forks too, but if you haven’t handled a spork since elementary school, let me remind you of its benefits before you cast it aside. The wide curve is perfect for cradling soft-serve or potato salad, the tines are sharp enough to capture stray cherry tomatoes or crisped chickpeas making a break for the grass. In other words, it can handle just about any take-out situation that doesn’t require chopsticks or a steak knife. I’ll even break out my spork on restaurant patios when the dinky cutlery on hand isn’t up to the task of tackling my lunch.I never thought I’d be sitting down to wax poetic about a collapsible spork. But in a year of plot twists worthy of an R.L. Stine choose-your-own-adventure novel, at least I know I’ll have a spork handy.Final Spork$30 at Final$30 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-27", "author": ["Condé Nast", "Aliza Abarbanel"]}