{"id": "51744e167dd08f36bca50d60e0b35f7c", "url": "https://www.bonappetit.com/story/sky-high-banana-cream-pie", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Don’t Be Intimidated By This Sky-High Banana Cream Pie | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Be Intimidated By This Sky-High Banana Cream PieIt’s an architectural masterpiece—and it’s super easy to make.By Rachel KartenNovember 1, 2019FacebookTwitterEmailPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEverything about this banana cream pie intimidated me. I’d never made a pudding before. Would my graham cracker crust get all crumbly and weird? And look at how high the whipped cream mountain on top is!!! But here’s the thing: this is the easiest, most impressive pie you will ever make—it just looks intimidating. Which is my favorite kind of recipe. Allow me to break down why even the most novice baker can make this stunner.The Crust Is Stupid SimpleGraham crackers. Salted dry-roasted peanuts. Kosher salt. Melted butter. Those are the only ingredients that go into the crust. And there’s no rolling pin, pie weights, or special equipment necessary. Sure, the recipe instructs you to use a food processor—and you should if you have one!—but I didn’t and using the bottom of a cup to crush the graham crackers and peanuts worked just fine. Once the butter and salt are involved, you mix and then press it all into the pie dish. Bake for 15 minutes and you’ve got your crust. The result is a sweet and salty (those peanuts!) crunch that takes less than 30 minutes from start to finish.Wait, the Filling Is That Easy?I read (and re-read) the ingredients list, scanning for one ingredient typical to puddings I’ve met before. Sugar, cornstarch, eggs, whole milk, salt, vanilla extract, bananas, butter. Wait, no gelatin? No obscure stabilizers? Just that regular old pantry stuff? Yes. THAT’S FREAKIN IT.Such height!\nPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiJust Look at the Height!!!In our November issue, Chris “King of Instagram Stories” Morocco called this recipe a “sky high pie.” Which, yes, sounds fun and epic. But also a bit daunting. Would I be able to pull it off this architectural masterpiece? Turns out, yes. Because all you need to do is scrape your filling into the cooled crust (I had a little extra filling which I quickly found a home for) and smooth it all over. Let all that chill for a few hours. Then—ready for the whole sky high part?—you pile on whipped cream. Like really go all in with it. You’re trying to trick people into thinking you spent all day on this thing, you know? Once you’ve created a mountain of whipped cream, make it rain chopped peanuts all over. And that’s your pie.The Slice™I’ve had many slices of banana cream pie in my life. And most of them have just two notes: sugar and banana. This pie goes beyond that. The smart addition of peanuts to the crust makes it so the sweetness is balanced with a salty and crunchy kick. The ratio of whipped cream to pudding is what all slices should aspire to. And the extra peanuts on top are a nice change of pace from the usual decor of slightly browned bananas.Serve this pie to your friends. Listen as they gasp from excitement. And tell them it was the easiest pie you’ve ever made. Or say you spent hours laboring over it. Either way, I won’t tell.Get the recipe:Banana Cream PieA showstopping peanut-studded banana cream pie with sky-high whipped cream.View RecipeExplore Bon AppétitPieThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-01", "author": ["Condé Nast", "Rachel Karten"]}