{"id": "5193ee3d5706d05ffe4b76533d19b6d7", "url": "https://www.bonappetit.com/story/shin-ramyun-instant-noodles", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Everything’s Changing—Except For My Love For Shin Ramyun | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEverything’s Changing—Except For My Love For Shin RamyunI may be social distancing, but I’m getting up close and personal with these instant noodles.By Jesse SparksMay 5, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When asked about their college sweethearts, most people talk about how their crush made them feel: how their heart excitedly beat faster, how flushed their face would get, how they’d leave every encounter looking forward to the next one. And I’m no different—except for the fact that my college love was Shin Ramyun .We met late one night in the dorms through my roommate/bad habit enabler Macs. When they pulled out a pack emblazoned in red and black with bold, all caps type, I couldn’t look away. And when Macs realized I hadn’t tried it before, the light berating began. How could I, an “adult” (no one is a real adult at 19), settle for anything other than a pack of instant ramyun that, with the addition of hot water and time, transformed into springy, chewy noodles swimming in a peppery, extremely slurpable broth?Photo by Laura MurrayMacs slid me a bowl of Shin. I wolfed it down in less time than it took to make it. My heart beat in my ears. My forehead shone with each warming spoonful of broth. I got as close to blushing as I’d ever been. The ashen red spice mix turned water into a nasal-clearing, sweat-inducing beefy broth. All that paired with perfectly toothsome noodles, and I was hooked. Days after, I scoured nearby convenience stores, the student center, even the little stores connected to dining halls that peddled random pantry goods in search of the ramyun. I was in deep. I still am.Yes, me and my college crush are still together, and I stock packs of Shin Ramyun like a (responsible, non-hoarding) doomsday prepper—and there are plenty of food reasons why! They’re an ideal meal as I find myself leaving home less and craving comfort more. They don’t require anything but hot water and time, and can accommodate any vegetables I might have lingering in my fridge. Plus, I never have to worry about doing an onslaught of dishes afterward—just the assurance I need as my will to hand wash literally anything nears non-existence. They’re fast and filling on the many days when I can barely bring myself to cook anything at all. Everything may feel up in the air in the current moment, but my love for Shin Ramyun is unwavering.Buy It: Nongshim Shin Ramyun, Gourmet Spicy, $37 for 16 packs on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingHighly RecommendRead MoreLifestyleThese Bins Keep My Pantry Tidy No Matter How Many Beans I BuyBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-05", "author": ["Condé Nast", "Jesse Sparks"]}