{"id": "51936d648eb16ecb0623b36145da83a1", "url": "https://www.bonappetit.com/story/coronavirus-orlando-florida", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "My Life Revolved Around the Tourists Who Poured Into Orlando—Until They Stopped Coming | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusMy Life Revolved Around the Tourists Who Poured Into Orlando—Until They Stopped ComingReality comes for fantasyland.By Luis RomeroAugust 12, 2020FacebookTwitterEmailIllustration by Fran CaballeroFacebookTwitterEmailBy the end of February, things were still relatively normal in Orlando: The theme parks still hummed with the usual throngs of people, the restaurants were still packed, and the worst parts of the pandemic seemed a long way off. In a matter of weeks, most things I loved about the city had disappeared.Week 1I’ve been working nonstop for the past few weeks, but with three different jobs, that’s nothing new. The first is as a server/sommelier at a fine-dining restaurant. It’s a popular place; I spend most of my nights running up and down the bar looking for a bottle of “sweet” Chardonnay for someone’s steak. People order the strangest things sometimes.The second job is at a Mexican restaurant—one big party with absolutely no concept of personal space. It’s chaotic, loud, and entertaining. Everyone is “familia,” the food is good, and there’s always tequila and margaritas. The third job is as a banquet server for a large convention hotel, one so big I still get lost in its hallways even after working there for eight years. During rushes, I run 200 feet back and forth across the ballroom with heavy silverware and plates. I love to watch people behave differently when they think no one’s looking—out-of-towners attempting to live their spring break fantasies, bright-eyed newcomers trying to play it cool, and those who shove their way to the open bar scanning the room for marks.Week 2I scroll through my phone in the break room of the fine-dining restaurant. Carl is there, eating a sleeve of mini powdered donuts. As the one who’s been at the restaurant the longest, he is the de facto patriarch of the place. We’re good friends; he calls me buddy and always asks me not to stress, which he knows I tend to do. In between bites, he asks what I’ve heard about Italy shutting down. I’m too busy fighting for refunds in three different languages for my trip there—a combined birthday and retirement celebration trip for my mom scheduled for two days from now—to answer.Another server enters and asks me about a good Cabernet from Napa. Trip cancellations have to wait, but it looks like the lagoon of “It’s a Small World” is the closest Mom and I will get to Europe this time.Week 3When the news about closing the theme parks hits, I’m seated with my mom outside a restaurant at EPCOT eating my favorite meal: prosciutto e melone pizza with four kinds of Italian cheese and a La Rossa double malt beer. Working for good restaurants ruins my wallet, but it makes me love good food. I’m shocked to hear about the closings—the attractions haven’t closed for more than a couple of days since 1971. My phone keeps buzzing, and I’m not sure if I should join in the already frantic mix of morbid curiosity, despair, fear, and worry. No one thought this could happen here.Carl calls with the official news: No longer the “happiest place on earth.”Week 4Today is the last day I’ll work at the fine-dining spot until the reopening. The hotel continues to receive convention cancellations for the year, and the Mexican restaurant is a few days away from temporarily closing its doors.Pauline and Carl are working today. Pauline and I met when I first started; She’s an animal lover who always picks up wounded birds. I like to say I was one when we met, and now we’re best friends. We brush off the impending closing as if it’s nothing but a temporary gap, but I can tell we’re all nervous. We used to be booked solid, but now we’re at less than 50%. I heard the restaurant next door has 16 reservations for the night; it usually does 400.Week 8It’s been a few weeks since my mom flew back to Mexico. I can’t stop thinking about dropping her off at the deserted airport and watching her walk the empty security lines.I’m getting worried about when I will go back to work, though I am enjoying parts of being at home: I finished my balcony with some wood tiles, a few patches of fake grass, and some cactus, the only plants I cannot kill. It’s my personal quarantine oasis. Rambo, a little Doberman pinscher who lives with my neighbor Alice, sometimes joins me on his own balcony across the way. I pour a glass of wine to calm my nerves and call my friend Gus, a manager for the parks. He tells me he’s begun baking and got a new puppy but has no more new information.Week 9Carl calls to let me know that furlough letters are coming. I ask a bunch of questions, but all he says is “Buddy, it will be all right.” I’d been getting the modified PPP checks, and while they weren’t even enough to get groceries, it was something. With the furlough letters, now even that’s gone.I take a walk to calm down and already spot a few restaurant casualties of the pandemic. My favorite taqueria is one of them—goodbye, tacos al pastor. I pass by the movie theater; the posters haven’t changed since time stopped in March. It’s Sunday. I miss brunch; drinking sangria under the rainbow flags of downtown always feels like going out to dinner for those of us who work evenings.Week 10Feeling fatigued and exhausted. I miss my friends and family, and my liquor pantry is dwindling. I resolve to cut down or stop and decide to start running since it’s healthy and free. I miss my restaurants, the smell of the kitchen when I walk in the back door. I miss getting a facial from the steamers as I pass the prep area toward my locker. I even miss the little spats about who didn’t do their share of side work.I confess to Pauline that I’ve stopped watching our local updates and watch the ones in New York instead. Andy—that’s how I like to refer to Governor Andrew Cuomo—and I have developed a special relationship. He soothes me with science and charming PowerPoints.With suspiciously optimistic numbers but no other basis for reopening, our governor advertises a return to normal. I can’t stand the guy.Week 12My new daily routine: Wake up and try to verify the status of my unemployment claim. All the money I had saved for the trip to Italy is almost gone and the bills keep coming. I’ve moved to an emergency budget, which helps, but there is no way to continue like this without the unemployment help. The system crashes. I go for a run to clear my mind.When I get back, I’m ready for a shower and a nap. My other neighbor works from home now, and I listen to his kitchen drawers banging against my bedroom wall. I’ve never had so much time to sleep during the day, so I’ve never heard them before.Week 14I wake up aching and with my jaw locked. I’ve tried everything: meditation, exercise, changes in diet, but nothing helps. I’m sure a giant lives on the floor above mine. All the smallest noises of the complex flood my apartment and become full-on offenses. On TV, protesters clamor for justice and change. I think about all the microaggressions I’ve gotten as a brown server/sommelier. The looks of surprise, the constant hesitations in accepting my recommendations. Whenever people ask if I’ve tried the wines I recommend, Pauline rolls her eyes.Week 15I’ve begun to daydream about where I will travel when this is all over. I want to make up the trip with my mom, and I want to travel through wine regions across the globe, staying in new places for whole seasons at a time. I pass a small French bakery that has been under construction since March and crave a croissant. There’s a half-completed brewery a few blocks up. I know restaurants are not for the faint of heart, but I feel their people’s pain when it all slips away before it’s even started.Week 16My unemployment claims finally went through, and I begin to feel a shift. I am more serene, and for a second, I see this moment as an opportunity. I wonder if I should change careers—maybe teaching. I sometimes teach wine seminars at a college, and I would love to do that full-time. I love the restaurant industry, but the experience has left me with a sour taste in my mouth. There is no job security for people like me: a combination of tourist guide, counselor, firewall between the kitchen and the table, and emotional punching bag for those who can’t take out their frustration on anyone else. The entire pandemic begins to feel like a massive reset switch.Week 18 It’s Saturday night, and the club next door has reopened. I want to be happy for businesses, but none of this feels right. I lay in bed listening to ambulance sirens and the bass coming from the club’s rooftop. I want to go back to work, but I also don’t want to be cannon fodder for a political cause. Some people expect this of me, and I feel torn between my health and the insistence of those who believe I can pray the virus away.I drift to sleep missing human contact. I always considered myself an introvert, but this is a bit too much isolation even for my taste. Working at the restaurants, I always found it difficult to find a balance between being social and finding quiet time, and I can’t believe I miss it now.Week 20Gus texts me that the theme parks are going to reopen, and I brace for the call to return to work. The outbreak in the area is exploding with record numbers, and Carl calls to tell me I will not return yet—the full-time staff gets preference first. He goes over the full rundown of who lost their job during the pandemic, and many of them are friends with families and people who depend on them. The hotel places me on a call list through July 2021. I stay on payroll (I cost them nothing), but get no new clarity on shifts and hours. I consider myself lucky.Week 21After weeks of dreading it, I get chills and develop a fever. I refuse to believe I’m sick and lay shivering under the covers trying to fight it off. I wonder if I should call someone, maybe Pauline. I take Tylenol and put on the thickest sweatshirt I can find. In the morning, I get tested for COVID-19. It comes back negative. The doctor says I have a sinus infection.I’m relieved but still a wreck. I run the solution through my nose and begin to cry from the discomfort. Then I can’t stop. I cannot think of anything positive to look forward to anymore.Week 22Pauline sends all sorts of clips of people going nuts at supermarkets and stores to avoid wearing masks. Out on my walk, I hear a group of guys getting into a confrontation, one of them shouting about face coverings as muzzles. Tensions are running high.I read an article about a vaccine on track for delivery in September; it sounds incredibly optimistic. Carl says the reopening of the restaurant is a disaster and that not many people are showing up.Week 23I get $275 a week from the state’s unemployment, and my supplemental benefit from the federal government is about to expire. I don’t know what I will do next or how to avoid putting myself in this position again. The obvious answer is to find a job with more security, and the perfect answer would be something I can do remotely.All I want is to pack my bags and go somewhere, anywhere else. I love living in Orlando, but this pandemic has shown how vulnerable the city is. How vulnerable everything is. I wonder if there would be any restaurant jobs for me to return to, and what they would look like, and whether I’d want to go back to them.The city is my home, but I wonder if it’s time for me to leave. What is Orlando, if it’s no longer an escape from reality, a visit to a fantasyland with smiling servers and no concerns? Can it still be an escape when servers wear face masks, plastic shields, and gloves? My favorite thing about Orlando is that I get to live in a dream, both blissfully unaware and in on the joke—but what happens when I wake up?Explore Bon AppétitCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-12", "author": ["Condé Nast", "Luis Romero"]}