{"id": "519bc15040e674bd6f03c4fb420d844c", "url": "https://www.bonappetit.com/recipe/enchiladas-divorciadas", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Enchiladas Divorciadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueEnchiladas DivorciadasBy Daniela Soto-InnesJanuary 8, 20194.3(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhy choose red or green when you can have both? Almost all the components of these stunning enchiladas can be made ahead. Here’s how to pull it off: Poach the chicken, make both sauces, and prepare the crème fraîche topping in advance. The day of, reheat the sauces and chicken, fry the tortillas, and assemble. Or to simplify, choose just one of the sauces and make a double recipe. You’ll end up with a harmonious batch of enchiladas verdes or rojas, accordingly.Ingredients4 servings Salsa Verde1Tbsp. vegetable oil½white onion, coarsely chopped4garlic cloves, crushed3small serrano chiles, halved lengthwise, seeds removed if desired12oz. tomatillos (6–7), husks removed, rinsed, halved1cup cilantro leaves with tender stemsKosher saltSalsa Roja1Tbsp. vegetable oil¼white onion, coarsely chopped1garlic clove, crushed3guajillo chiles, seeds removed2dried chiles de árbol (optional; omit for a milder sauce)3plum tomatoes, quarteredKosher saltEnchilada Assembly13½–4-lb. chicken6bay leaves1tsp. allspice berriesKosher salt½cup crème fraîche⅓cup crumbled queso fresco½cup vegetable oil126\" corn tortillasSliced white onion (for serving)PreparationSalsa VerdeStep 1Heat oil in a large saucepan over medium. Cook onion and garlic, stirring occasionally, until starting to soften, about 5 minutes. Add chiles and cook, stirring occasionally, until onion is lightly browned and vegetables are soft, about 5 minutes. Add tomatillos and cook, stirring occasionally, just until starting to soften, about 3 minutes. Add cilantro and 1½ cups water. Bring to a boil, reduce heat, and simmer until tomatillos soften, 20–25 minutes. Let cool slightly; transfer to a blender. Purée until smooth; season with salt. Return salsa verde to saucepan and keep warm until ready to use.Salsa RojaStep 2Heat oil in a large saucepan over medium. Cook onion and garlic, stirring occasionally, until starting to soften, about 5 minutes. Add both chiles, tomatoes, and 1½ cups water. Bring to a boil, reduce heat, and simmer until tomatoes and chiles soften, 20–25 minutes. Let cool slightly; transfer to a blender. Purée until smooth; season with salt. Return salsa roja to saucepan and keep warm until ready to use.Enchilada AssemblyStep 3Place chicken, bay leaves, and allspice in a small pot and pour in water to cover by 1\"; season lightly with salt. Bring to a boil, reduce heat, and simmer gently until chicken is nearly cooked through (an instant-read thermometer inserted into the thickest part of chicken should register 145°–150°), 20–25 minutes from the time water starts simmering. Let chicken cool at least 1 hour (it should be just warm). If you have the time, cover and chill up to 12 hours.Step 4Remove chicken from broth. Pull meat from bones and shred; discard skin and bones. Place meat in a large saucepan and pour in just enough broth to cover. Set aside any remaining broth for another use. Gently reheat chicken over medium-low; season with salt.Step 5Meanwhile, mix crème fraîche and queso fresco in a small bowl to combine.Step 6Heat oil in a small skillet over medium-high until hot but not smoking. Submerge each tortilla in oil long enough to soften but not so long that they fall apart, 5–10 seconds each. Transfer to a rimmed baking sheet lined with paper towels to drain.Step 7Working one at a time, fill each tortilla with about ⅓ cup shredded chicken and roll up tightly. Place 3 tortillas each, seam side down, into bowls. Ladle ½ cup of each sauce on opposite ends of enchiladas. Top with a big spoonful of crème fraîche mixture and scatter onion over.Step 8Do Ahead: Chicken can be poached and shredded 3 days ahead. Place in a small bowl and pour in broth to submerge; cover and chill.How would you rate Enchiladas Divorciadas?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThese were wonderful. We've made these a few times just with the salsa verde but went full tilt last night with both sauces since we just got a new Vitamix. Only changes we made were poaching the chicken in homemade chicken stock and then tossing pulled chicken with reduced poaching liquid and a little butter. The end result was phenomenal and it came together in just under 2 hours. Thank you Daniela and BA for the brilliant recipe!emilyrBoston, MA6/27/2020Yummy idea! Great recipe but followed it 3/4 of it. I made the salsa verde just like it says, used only chicken breasts used fresh Cotija cheese. For the red salsa, I used dried guajillo, ancho and de arbol chiles, boiled then pureed with onion and garlic then fried.  Much better!!! Will make again!!!AnonymousMonterrey, Mexico3/24/2020Pat, those are the colors of the Mexican flag, red, green, white\nTamales for Christmas\nlarrypsPalm Springs CA5/4/2019One of the best dishes I've cooked in a while. To save time I roasted a pounded chicken breast so it was crispy on the outside,  and U10 shrimp head on, both in a convection oven which took 14 minutes. I also made avocado sour cream for the topping instead of crème fraîche . Between the sauces, the sour cream and filling, the flavors were exploding. I made extra sauce so I was able to whip up another batch a week later in about 1/2 hour.AnonymousDedham MA3/4/2019I followed this recipe exactly, it was just so-so.  Putting the chicken inside the tortilla with nothing else made for a very plain dish.  The salsa verde was delicious.  The salsa roja was meh - looked nothing like the photo.    Next time I'll mix the chicken, creme fraiche, and queso fresco together with some of the salsa verde, then roll in the tortilla, top with more salsa verde and put into the oven to melt the cheese.  Then add the fresh onions on top before serving.  dcarsCleveland, OH2/20/2019I'd much rather these be called Christmas Enchiladas patshannon068604Denver2/2/2019Explore Bon AppétitMexicanLatin AmericanChickenPoultrySerrano ChileChileVegetableTomatilloQueso FrescoCheeseMainNut-FreeGluten-FreeHealthyishSimmerFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}