{"id": "51a4f5d09d0808293626351009bfacef", "url": "https://www.bonappetit.com/story/miso-almond-butter-cookies", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Miso Almond Butter Cookies Are Juuuust Healthy Enough | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Miso Almond Butter Cookies Are Juuuust Healthy EnoughThe miso gives these cookies a secret hit of salt...but you'd never guess it's in there.By Chris MoroccoDecember 10, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Frances BoswellFacebookTwitterEmailCan a cookie be healthy? I used to think no, then I thought sorta maybe yes, but now I am back to no. Everyone’s definition of healthy (and delicious) is different. Personally my career has put me in front of a lot of cookies and I wouldn’t be good at my job if strong opinions didn’t follow. Maybe I am blinded by knowing how critical fat and sugar are to the structure, moistness, and flavor of cookies. Maybe I have just eaten too many bad cookies.While these cookies might rely in part on the phenomenal ability of brown sugar to create a moist and chewy cookie, flavorwise, these are actually not too sweet thanks to the addition of almond butter and miso. Yes, you heard me, miso. And, no, it’s not just there for recipe-title window dressing. Miso gives umami depth and salty balance to the sugar. Add the toasty nuttiness of the whole wheat flour, and these cookies are closer to something you might find wrapped near the checkout counter of a super crunchy supermarket (in a good way).So yeah, there is some refined sugar in these, but it's there for a reason (tenderness), and I don’t think that means they are unhealthy. Believe me, I tried using coconut sugar. Many times. I got sad little cookie pucks that stuck to the parchment paper while they baked, which is actually really hard to do.You can make these cookies in one bowl by mixing the dough with a spoon, no mixer required. You start by browning the butter, which creates delicious flavor but also cooks the water out of the butter so that the cookies keep a chewier structure. Once that cools slightly, add the sugar, followed by the egg, then the almond butter, miso, and vanilla. Stir in the dry ingredients (whole wheat flour and baking soda) just until combined.Roll the dough into 2 tablespoon-size balls and arrange on a parchment-lined baking sheet. Use a fork to make a crosshatch pattern on top of each dough ball. Bake at 350 just until lightly browned and firm around edges, 12–14 minutes. If you want to go for it with the chocolate dip, let the cookies cool until they are firm before dunking.Chewy, crispy, salty, sweet. Healthy. Ish.Preheat your oven now:Miso-Almond Butter CookiesDid we lose you with the miso? Don't go!View RecipeExplore Bon AppétitHealthyishCookieAlmondHoliday CookiesMisoRead MorecookingHow to Make Natural Dyes for Healthier Holiday CookiesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Chris Morocco"]}