{"id": "51c38a956a3b61e897b12ce33ccfa043", "url": "https://www.bonappetit.com/story/my-taco-truck-my-office", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Alebrije’s Is My Taco Truck and Also My Office | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAlebrije’s Is My Taco Truck and Also My OfficeI meet sources, hold court with friends, and even conduct interviews with television networks at a taco truck.By Gustavo ArellanoJune 6, 2018FacebookTwitterEmailBon Appetit Alebrije'sPhoto by Cody JamesFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I don’t even give Alebrije’s a name when I tell people to meet me at my favorite Santa Ana, California, taco truck. “Just look for the pink lonchera off Main Street,” I say. “You won’t miss it.”They never do.This lonchera—another name for “food truck,” for the uninitiated—sports a glorious Pepto-Bismol-esque hue that's probably visible from Graceland, one that would make a Mary Kay top seller green with envy. But even the color-blind immediately see something rosy here. There’s usually a line, Mexicans and not, and eaters scattered everywhere—on the curb, on milk crates, on rickety chairs, or just standing around. Alebrije’s is so popular that police officers park in the red zone right behind it and eat off the hoods of their Ford Interceptors.And this has been my public office for the past decade.Yes, my office is pink.\nPhoto by Cody JamesHere, I meet sources, hold court with friends, or conduct interviews with television networks—producers from Switzerland, Mexico, and Argentina, plus NBC and even ESPN, have all stopped by. Alebrije’s slogan is Coma Como en el DF—“Eat Like in Mexico City”—and so I take my guests through their specialties: alambres (a bunch of meats glued together with melted cheese), mulitas (halfway between a quesadilla and a gordita), and picaditas (think sopes on steroids).They always shoot me a bewildered look when they first arrive, but I shut up skeptics for good when I order them the taco acorazado.It’s a specialty of Cuernavaca, a city about an hour and a half away from Mexico City, and translates to “battleship taco” in English because it’s as mighty as one. Alebrije’s cooks pat out a fresh corn tortilla as big as a hardcover novel and place upon it a bed of Spanish rice. That’s topped with beef milanesa—crunchy and buttery and glorious—followed by strata of grilled onions, grilled cactus, fresh tomatoes, diced cabbage, avocado and a blizzard of cotija. Grab some habanero-spiked pickled onions from the salsa bar, spoon some green or red salsa on everything, and then we're ready to talk.THIS is lunch.\nPhoto by Cody JamesYou don’t eat the taco acorazado so much as deconstruct it layer by layer, and my guests inevitably devour it with gusto. And while they do, I tell them the other reason why Alebrije’s is my office: out of eternal respect.In 2006, the all-Latino Santa Ana City Council decided to enact laws that would force loncheras to move every half hour, thereby killing their business. Alebrije’s decided to sue the City Council on behalf of the city’s taco trucks—and won. A new council tried to do the same last year—this time, they also wanted to enact regulations banning scrolling marquee signs and forcing food trucks to stay at least 500 feet from elementary schools. The council modified the proposed regulations after a collective outcry from the city’s 150-plus loncheros—led once again by the Alebrije’s crew.Parked outside.\nPhoto by Cody James“We just want to sell tacos,” said owner Albert Hernández as he took orders. “We’ve brought much fame to the city and want to make everyone proud.”So, America: If you ever want to meet me, just look for Santa Ana’s pink taco truck. I even take my laptop there. Because who needs a corner office with a view when you have tacos acorazados?Gustavo Arellano is a writer and author of Taco USA.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsTacoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Gustavo Arellano"]}