{"id": "51d2c722dc975b4867e8e6be8ab0eed7", "url": "https://www.bonappetit.com/story/aperitif-cocktail-shots", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "You Should Be Doing More Shots | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Doing More ShotsThese mini mixed drinks are small. They’re fast-moving. They’re delicious. They’re shot-tails. (Did we really just say that?)By Rebekah PepplerAugust 26, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt started at night—as most stories involving shots do. I was having friends over for a drink before going out, and everyone was running late. Without time for a full glass of wine, I shook up a quick cocktail, and divvied it up among small glasses. We passed them around, raised our cups to things like health and love, and then in one swift motion, knocked them back, and walked out the door.That night, tight timing was the mother of invention: an apéritif bright with citrus, light on booze, invigoratingly cold, and surprisingly festive—all in a single mouthful. It was perfect. So perfect, that I now serve different versions of these miniature cocktails every time I get together with friends. And so should you. Heating up the charcoals? Shots! Giving a birthday toast at the start of dinner? Shots! Planning a move on the cute barista you’ve been flirting with all summer? Shots! Once you look at it this way, there’s ample opportunity for shots all night long.Taking only slightly more prep than a steady pour of tequila over a tray of stocky glasses, apéritif shots like the ones below rely on simple, easy-to-execute recipes, and lower alcohol by volume ingredients, like vermouth, wine, and bitters. There’s one, published in my book Apéritif: Cocktail Hour the French Way, that drinks like a slightly bitter (in a good way) margarita, with yellow Suze, blanc vermouth, and lime. There’s a brand-new one, that I’ll call the Half & Half, that combines sweet and dry vermouth with a hit of orange peel, and finishes with a big, buttery, briny Castelvetrano olive. The bright pink Not Shirley Temple also makes its debut here, with Campari, rosé, lemon juice, and a sweet maraschino cherry chaser.Because apéritif shots are small scale yet fully built drinks, you could be tempted to make each as a normal size cocktail. Please don’t. Instead, raise a petite glass to the night ahead, and then get on with it.Photo by Emma FishmanShot de SuzeMakes 8 shots4 ounces fresh lime juice3 ounces Suze3 ounces blanc vermouth2 lime peelsIn a shaker filled with ice, combine the lime juice, Suze, and vermouth. Working one at a time, hold each lime peel by its long edges, skin facing down into the shaker. Pinch the peel to express the citrus oils and drop the peel into the shaker. Cover and shake vigorously. Strain into shot glasses.Reprinted from Apéritif: Cocktail Hour the French Way. Copyright © 2018 by Rebekah Peppler. Photographs by Joann Pai. Published by Clarkson Potter, an imprint of Penguin Random House LLC.Photo by Emma FishmanHalf & HalfMakes 8 shots5 ounces dry vermouth5 ounces sweet vermouth2 orange peelsLarge green olives, such as CastelvetranoIn an ice-filled mixing glass, combine the vermouths. Working one at a time, hold each orange peel by its long edges, skin facing down into the shaker. Pinch the peel to express the citrus oils and drop the peel into the shaker. Stir until very cold; strain into shot glasses. Serve with green olives to eat just after shooting.Photo by Emma FishmanNot Shirley TempleMakes 8 shots6 ounces dry rosé1½ ounces Campari2 ounces lemon juice½ ounce maraschino cherry liquidMaraschino cherries, such as LuxardoIn a shaker filled with ice, combine the rosé, Campari, lemon juice, and maraschino cherry liquid. Cover and shake vigorously. Strain into shot glasses. Serve with maraschino cherries to eat just after shooting.Explore Bon AppétitCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-26", "author": ["Condé Nast", "Rebekah Peppler"]}