{"id": "51e138d23c0a0f70500a18ada5265b85", "url": "https://www.bonappetit.com/story/danielle-mickelson-cottage-food-law", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Danielle Mickelson Fought the Law to Sell Her Food—and Won | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn Some States, Selling Homemade Food Is Illegal. This Home Cook Fought the Law—and WonDanielle Mickelson made the case that home-based food businesses like hers are safe and economically vital. By Meleyna NomuraFebruary 22, 2021FacebookTwitterEmailIllustration by Cynthia KittlerFacebookTwitterEmailThis story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.Danielle Mickelson sold around 2,000 quarts of pickles, 650 loaves of bread, and 225 pies last year—all made in her kitchen in Rolla, North Dakota, a small town about 10 miles from the Canadian border. Though she runs a farmers market with her husband, Mickelson is able to earn additional income from her cooking thanks to cottage food laws, laws that allow people to sell food products cooked in their own homes rather than in commercial kitchens. Every state has its own cottage laws, and while the exact legislation varies, it typically covers the sale of nonperishable baked goods and snacks only—things like nut mixes, granolas, and pickles. But in 2017 the North Dakota legislature passed the Food Freedom Act (HB-1433). Modeled after a Wyoming bill passed two years earlier, this new law extended the list of approved foods to include cooked dishes made with vegetables and poultry (no red meat), perishable baked goods, and more.For Mickelson the new law was life-changing. “My family and friends weren’t the only ones who liked my products; I had regular customers and increasing demand,” she recalls. “And that’s when the exponential growth started.” She began making pies and soups with her homegrown vegetables to sell alongside her freshly baked bread. The success of these new products made Mickelson look into buying a commercial kitchen and encouraged her to join the local job development authority to help others in the community take advantage of the same opportunities.Danielle Mickelson successfully championed cottage laws in North Dakota.\nPhoto courtesy Institute for JusticeHB-1433 was a huge win for anyone with cooking skills but with limited or no access to traditional avenues of entrepreneurship—especially women and immigrants, along with Black, Indigenous, and rural communities. These groups have always been responsible for feeding their communities, and the new law enabled them to do so in a legal and profitable way. It also allowed them to expand their offerings and share their food with a broader swath of customers. Since the law was enacted, the North Dakota Department of Health has been pushing back, asking the state legislature to again legalize nonperishable foods only. Its requests were denied, but in late 2019 the health department circumvented the system and implemented new rules that prohibited home producers from selling perishable meals. “A lot of health departments, not just in North Dakota, think the solution to everything is to regulate,” speculates Erica Smith, a senior attorney with the Institute for Justice, a nonprofit civil liberties law firm, who represented Mickelson in a recent lawsuit. “When you have the hammer, everything looks like a nail.”The department’s rules hugely impacted Mickelson’s business as well as her work in local job development. Throughout the state, some producers lost their entire businesses due to the restrictions; COVID-19 put many families in precarious economic positions. But Mickelson fought back. She, along with four other plaintiffs, worked with Smith to file a lawsuit against the North Dakota Department of Health. In December they won and home producers were able to resume sales of all food covered by HB-1433.Smith believes that laws like these are the future. “Cottage food laws have only been around for about 30 years,” she says. “But people have been selling homemade food for hundreds of years. And since COVID-19, home-based businesses are taking off. It’s the shared-economy model: People want to buy locally and they want to buy from their neighbors.” Winning the case provided not only relief for Mickelson and her budding business but an opportunity to empower her community in a new way. “We all have our niche, but we all grow together,” Mickelson says. “[This law] gives us the chance to expand.”Feeling inspired? Check your state’s cottage laws before selling your homemade eats.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Meleyna Nomura"]}