{"id": "51ec1cfde00dd86e65b08c1bcdfb547a", "url": "https://www.bonappetit.com/story/tex-mex-barbecue", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Tex + Mex + ’Cue: 4 Texas Spots Combining the Best of Both Worlds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTex + Mex + ’Cue: 4 Texas Spots Combining the Best of Both WorldsTexas pitmasters are incorporating Mexican-American flavors in their must-have barbecue.By Jess ElizarrarasSeptember 12, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailIt’s the best of both worlds: Texan barbecue techniques meet Mexican flavors. Whether it’s pit-smoked barbacoa at Valentina’s Tex Mex BBQ in Austin, or smoked chicken covered in a spicy citrus marinade at Pollos Asados Los Norteños on the southeast side of San Antonio, the genre now includes some serious talent in Central and South Texas. Defining Mexican-American barbecue varies by pitmaster, but the results are smoky, spicy, meaty, and more important, charged with the flavors of a chef’s upbringing. Here are four spots we visited this summer that blend local flavors, Tex-Mex heritage, and pitmaster ingenuity.Valentina’s (now permanent) trailer.\nPhoto by Alex LauValentina’s Tex Mex BBQ, AustinThe lines are at least 50 deep on Saturday mornings at Valentina’s Tex Mex BBQ, opened by pitmaster Miguel Vidal in 2013 on the south side of Austin. Barbecue devotees line up to order at the humble trailer, then find a seat at the tent-covered picnic tables or in the huge covered barn.Valentina’s is Vidal’s ode to the food he grew up eating during family backyard barbecues in San Antonio’s south side, where his tios and tias ate their brisket with tortillas, not the sliced white bread found at so many barbecue joints around Texas.The menu is a down-the-middle mix of Tex and Mex with loaded brisket sandwiches on the left and tacos on the right. But the Mexican influences make their way onto both columns with a simple guacamole “just like my mother would make” adding creaminess to brisket sandwiches and carnitas tacos on fresh-rolled flour tortillas.“I wanted to share what Mexicans do across Texas,” Vidal says. “Barbecue and Mexican are comfort foods, and it’s only natural for those things to be together.”Chef Vidal tending to Valentina’s brisket.\nPhoto by Alex LauHe serves hand-made tortillas, zippy tomato-Serrano salsa (you can find the recipe for it here, cumin-laced brisket infused with their house spice rub, and pork butts that he tends to for 14 to 16 hours a day.  He’s also won over followers with his smoky takes on Tex-Mex classics like a sopa de fideo (served on Fridays), a tomato-based soup made with fried vermicelli noodles topped with smoked beef picadillo or brisket guisada (a lip-smackin’ meaty gravy Vidal creates using a week’s worth of trimmings).Also special, his barbacoa. Vidal smokes beef cheeks instead of the traditional whole head — “it took up too much space in the pit.” The mouthwatering result is lean yet rich and fragrant with smoke.Though almost nocturnal, Vidal sees the early inklings of a crowd when smoke aficionados show up at 7:30 a.m. for his barbecue breakfast tacos.“That was something that wasn’t hard to introduce, but it caught people off guard—in a good way,” Vidal says. “This is what we’re doing with our leftover food [at home] anyway; it’s cool that someone’s doing it fresh.”The three breakfast tacos include traditional offerings of potato, egg, and cheese, and the ultimate bean and cheese taco is the “hechos con amor” as the truck’s motto dictates. The Real Deal Holyfield, one of Valentina’s best sellers, was a happy accident Vidal created one morning for his father: flour tortillas hold a schmear of velvety refried beans, crisp potatoes, bacon, fried egg, and choice of brisket or carnitas. “It was a special, and it sold out for the day by 11,” he says.Think there’s enough meat in those tacos at King’s Hwy?\nJessica ElizarrarasKing’s Hwy Brew & Q, San AntonioKing’s Hwy Brew & Q is inside an 1880s home alongside El Camino Real, a historic trade route. The walls are covered with art and beer signs; others are painted bright orange and red.  It’s owned by Emilio “Emo” Soliz and his wife, Christi. After five years as pitmaster for Jason Dady’s Two Bros. BBQ Market, Soliz spread his wings with Sweet Christi’s BBQ (named after his wife) in 2014 before eventually parking the food truck and opening King’s Hwy in 2015.Brisket, sweet-tea-glazed ribs, and pulled pork are available by the pound at King’s Hwy, but the Solizes draw people back with their tortas and mini street tacos. Well, they aren’t so teensy: Each taco can be filled with a heap of carnitas-style peppery pulled pork, carne guisada, or moist brisket with hints of burnt ends and served in locally made yellow corn tortillas. They’re topped off with a flurry of raw white onion, fresh-chopped cilantro, and served with a side of a garlicky tomatillo salsa.“This [mash-up of Tex-Mex and barbecue] is not new. It’s very familiar, it’s what the rest of us do on a regular basis,” Soliz says of his Mexican-American brethren.Soliz keeps his sides familiar to his Mexican-American upbringing with a tomato-based Mexican rice with cumin and chicken stock, and bacony borracho beans that get their name from the Lone Star beers Soliz pours in.“It helps if you’re a little borracho too,” Soliz says with a laugh.The father of four grew up in Atascosa County, about 30 minutes south of San Antonio. He recalls barbecues in his family’s backyard, the smell of brisket, cilantro, and fresh tortillas on the grill. His cooking at King’s Hwy is a nod to his past, with creative spins like the S.A. Cheesesteak that packs brisket into a bolillo (a stocky variation on the baguette) along with queso, grilled jalapeños, and onions. Then there’s the beefed-up grilled cheese on Texas toast that’s filled with choice of brisket, sausage, carne guisada, turkey, pulled pork, or shredded chicken, a messy masterpiece worth every spent napkin.Unfortunately, Kings Hwy will close their doors at the end of September. Pitmaster Emilio will join B Daddy’s BBQ just outside San Antonio.You can see the Oaxaca cheese in the housemade sausage at 2M.\nAlex Lau2M Smokehouse & Catering, San AntonioThe day starts early and ends late for Esaul Ramos, but he wouldn’t have it any other way. Ramos is the pitmaster and co-owner of 2M Smokehouse & Catering, the barbecue shop he runs with his wife, Grecia, his sister Giselle, and his high school best friend, Joe Melig.After training under John Lewis (of Lewis Barbecue at Austin’s la Barbecue for two years, Ramos set out to do barbecue his way, incorporating Mexican flavors from his youth. He left la Barbecue and hosted pop-ups in Lytle, Texas, before finding a permanent location off S. W. W. White Road inside a former Mexican restaurant they painted turquoise and white. Melig and Ramos built the smokehouse on their own and eventually opened the doors in December of 2016 with barbecue the area had never seen before. (Read more about their story here.It wasn’t just the brisket rubbed with cumin, coriander, and onion powder, or the savory pulled pork fashioned like a smoked cochinita pibil, but Ramos and co. inserted Mexican flavors into everything: their house-made sausage links stuffed with Oaxaca cheese, cilantro, and serrano peppers, and the barbacoa that’s spiked with cumin and smoked in banana leaves (available only the first Sunday of every month).Get it before it sells out.\nPhoto by Alex Lau2M draws fans from across the state with its house-made tortillas, vinegary coleslaw, hard-to-beat borracho beans (get the recipe here, and a creamy mac ‘n’ cheese topped with crushed chicharrones (pork rinds!). And then there’s the pickled goodies that deviate from the standard dill pickle and raw onion offerings. Pickled nopales dotted with garlic cloves, bell peppers, and serranos serve as the acidic break you need to balance the richness of the brisket.The accolades have rolled in steadily since 2M’s opening, but Ramos keeps a cool head, especially when barbecue purists discover the shop’s nontraditional takes.2M’s incredible logo.\nPhoto by Alex Lau“It’s funny that people make a big deal out of it, but it’s really cool because it brings our culture to light,” Ramos says. “I grew up eating American food outside of my house, and I’d come home and my mother would predominantly make Mexican dishes with these spices and bold flavors. As a Texan who loves barbecue, why not take that passion and what I grew up eating and marry them, and get something great out of it?”Elote (center) at South BBQ & Kitchen.\nFrank CollazoSouth BBQ & Kitchen, San AntonioSouth BBQ & Kitchen opened this summer in a gray building with a prominent Texas flag mural down the road from two of the city’s World Heritage sites, Mission San Jose and Mission Concepcion.Owner Andrew Samia took the love and knowledge of smoked meats he earned while opening his previous restaurant, Dignowity Meats, and dove headfirst into the world of barbecue. But the largely Hispanic south side of the city demands a different flavor profile.“San Antonio is my culture, but I’m not Hispanic. This is just what I’ve grown up with,” says Samia, a native Texan who’s lived in San Antonio for 13 years. That realization means he works with kitchen manager Manuel Nava to deliver bold flavors. Samia adds mesquite and pecan wood, local to the area and a favorite in South Texas, to their ten-foot oak-filled pit, and Nava takes creative freedoms with familiar sides.They make a tender brisket with a formidable bark, pulled pork, and peppery chicken quarters, all of which are drawing early fans who pack into the small shop to order one of everything.The sides don’t sleep either: Enter more borracho beans, Spanish rice, and creamed corn that’s more elote preparado with a hearty cream cheese base and a dusting of Cotija cheese and cayenne powder on top. There’s smoked jalapeños, beet-soaked pickled red onions with a touch of oregano (a family recipe from one of his employees), and pit-grilled lightly charred green onions. Barbecue con un twist.Jess Elizarraras is a writer in San Antonio.Now watch some not Tex-Mex barbecue:Explore Bon AppétitRestaurants + TravelTexasMexicanTex-MexAustinBarbecueSan AntonioRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-12", "author": ["Condé Nast", "Jess Elizarraras"]}