{"id": "51f5e9de60d88947a3c7b228787a7203", "url": "https://www.bonappetit.com/story/make-a-big-batch", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "The Case for Big Batch Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThere's No Better Time to… Make a Big BatchMy days of cooking a half-cup of rice are over.By Aliza AbarbanelMay 27, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Dip into the dried goods and make a really big batch of, well, just about anything.I’ve been cooking more than ever, which means I’m doing more dishes than ever, too. Like many New Yorkers, I don’t own a dishwasher, and the tension between my desire to cook project-y recipes that require a million dishes and my aversion to actually washing said dishes has never been higher. I conduct a cost-benefit analysis every time I open the cabinet to grab another bowl.A few weeks ago, I had a moment of realization: I can’t stop cooking anytime soon, but what I can do is embrace big batch cooking. If I’m going to take down (and inevitably clean) my heavy Dutch oven to make beans, I might as well cook the whole bag and deal with the leftovers later.I started leaning into cooking large-format gradually, mainly because I dreaded eating the same thing all week. It sounds bleak, but dinner is usually the highlight of my day, and I didn’t want to conscript my household of two into eating chickpeas ad nauseam. Then I decided to frame it as a very mundane challenge to use one ingredient as many ways as possible. Some lucky chickpeas got simmered in a lightning-fast broth to create chickpeas and dumplings, others were smashed and mixed with Greek yogurt and Dijon mustard for a chickpea salad sandwich. As for the rest, well, they got sprinkled into pretty much every grain bowl and salad I made.Now I spend each Sunday afternoon making a big batch of one thing (because you and I both know I don’t have any other plans). I started with marinated lentils, which I knew would help me quickly build flavor in a variety of meals without adding many extra ingredients. I simmered a cup in chicken broth for a quick lunchtime soup, used another cup to anchor a pseudo grain bowl, and pureed the rest into an extremely satisfying lentil bolognese. Over time I’ve expanded my repertoire, roasting off trays of carrots to save the extras for sandwiches and making double my usual amount of sushi rice to plan ahead for tomorrow’s stir-fry.The days of cooking half a cup of grains are officially behind me because I no longer see leftovers as a limitation. Knowing that I have one prepped ingredient stashed in the fridge makes it infinitely easier to figure out my next meal, and I haven’t gotten sick of anything just yet. If I find myself staring down the barrel of a container of five-day-old cannelinis, well, that’s what the freezer is for.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-26", "author": ["Condé Nast", "Aliza Abarbanel"]}