{"id": "52019088a239b483292bfe77180b9566", "url": "https://www.bonappetit.com/story/claire-fitzsimmons", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Claire Fitzsimmons Is the Sexual Wellness Guide We Didn’t Know We Needed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleClaire Fitzsimmons Is the Sexual Wellness Guide We Didn’t Know We NeededThe founder and director of Salty is all about amplifying non-cis-heteronormative voices. Carrie Bradshaw could never.By Anya TchoupakovJanuary 30, 2019FacebookTwitterEmailFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Claire Fitzsimmons, founder and director of Salty, a newsletter and online publication exploring modern dating, sex, and relationships for women, trans, and non-binary people.In the world of wellness, there’s a bit of an illusion when it comes to sex. Everyone and their mother is glowing, doing tantric yoga, and looking “accidentally” cute with their S.O. in matching, sustainably made leisurewear—but is anyone talking about, uh, the sex itself?Claire Fitzsimmons is.Photo courtesy of SaltyFitzsimmons is the founder of Salty, a weekly-ish newsletter and online publication full of the sex and dating advice we all wanted but were afraid to ask for, like texting templates that help you set boundaries and essays about how kink can help heal emotional trauma. Fitzsimmons herself is a powerhouse non-binary femme and a staple of the NYC fashion and nightlife scene. “I’m not a Cosmopolitan girl, I’m not Alluring, I’m not Glamorous, and I’m not in Vogue, that’s for sure,” she tells me in an e-mail. Instead, Ms. Fitz (as she is commonly known) is all about amplifying non-cis-heteronormative voices that are not often heard. “Collaboration means listening to others first,” Fitzsimmons says.Sustaining a digital platform that highlights NSFW content that isn’t porn has been incredibly challenging, and Fitzsimmons has encountered obstacles (i.e., the patriarchy) every step of the way. Salty kept getting booted from mass e-mail platforms, and Instagram/Facebook refused to allow promotional posts (and kept deleting photos with even the hint of a nipple). Then hackers deleted their whole site after Salty broke an important #MeToo story. Still, the bright, brash voice of Salty cuts through the millennial pink clouds of other sex and dating sites. “Salt is visceral and human,” says Fitzsimmons. “Sweat is salty, tears are salty, sex tastes salty.”Here’s what Ms. Fitz has to say about sex and saltiness in all its forms.What keeps me going despite the haters… is all the amazing supporters who are super vocal. There are hackers, MRAs, trolls, and tone police, too. It comes with the territory. If you’re on the internet all day, it’s easy to think the world is full of assholes, but the thing to remember when it all seems too much is that you don’t hear the people who don’t say anything. Most people are reasonable and kind. There are way more silent supporters than there are people who want to bring you down. And I know that because I see the numbers, and I read the lovely messages from our community.I’ve learned… to stop trying to please everyone. In the beginning of Salty I would get so upset if someone said something mean or rude about our mission, but over time I’ve come to realize that no matter what you do, someone is going to have a problem with it, so you might as well just do you.I blow off steam by… riding my bike through Brooklyn. Oh and masturbating, duh!Sexual wellness is… essential for your mental wellness.My favorite sex toy is… my faithful rabbit! (I’m old school).I’m always snacking on… CBD gummies. They are my JAM! Also iced tea. After I quit booze and coffee a year ago (#soberlife) I’ve become hopelessly addicted to iced tea. I like really shitty American iced tea from Dunkin Donuts (sorry, Healthyish). But it’s better than the alternatives. I snack on popcorn, too.My love language is… touch and telling. I need to be told I’m amazing and loved, and I need to be cuddled constantly.I’m currently obsessed with… knowing everything about the changing landscape of digital media. How are people monetizing? What are their strategies? What’s working? What’s not? How do you keep up with this rapidly disrupting market? I read Harvard Business Review and business books religiously.The biggest challenge of starting a radical, intersectional media brand is… money. We’ve seen massive, impressive growth in readership since we launched eight months ago, but the real problem has been finding people willing to invest in it. It’s not that there isn’t value—womxn’s sexual wellness is a massive market with billions of dollars of revenue potential—but there are institutional and patriarchal roadblocks that make it hard to monetize. I’ve shared some screen grabs on my socials from the sexist venture capitalists we’ve encountered and people are blown away by the overt and underhanded misogyny we’ve faced. The good news is that there is a secret network of women in angel capital who are getting stuff done on the DL. We’ve tapped into that. We’re also exploring fresh revenue models like memberships, products, and events.The best advice I ever got was… from my mentor Beth Comstock. She says, “Great ideas can come from anywhere. There is great value in the opinions of those who don’t think like you.” I’ve really taken that to heart.To me, activism means… intersectionality. Consider the complex sociological injustices that have created the world we live in and use your unique privileges to amplify the voices of those who need it more than you. To me, activism is civil disobedience. I love to march, rally, show up, make noise, stick it to the man. Activism means actually DOING something—building a platform for the voices of women, trans and non-binary people, for example, not just raging and re-gramming memes on the internet. That’s an unpopular opinion, but really, what are we doing that isn’t just noise?I’m always re-reading… my Instagram feed? Ugh! It’s a nightmare!I make the most difference by… Passing the mic.I’m salty… ALL the time. To be salty means to be annoyed. I’m a non-binary femme and I’m tired of being pandered to and talked down to. I know how strong I am. I know I’m a force—just like many other women, trans, and non-binary people know we are. Our strength and rage is not something to hide, it’s something to be fiercely proud of.Censorship is… a workhorse of the patriarchy. It’s an ongoing battle for Salty.Wellness means… fighting for yourself. Your wellness is a manifestation of your love for yourself, and it will not be prioritized by anyone except you.Explore Bon AppétitHealthyishInterviewsPerson of InterestSelf CareRead MoreLifestyleLike You Don't Want to Know Abena Boamah-Acheampong's Skincare RoutineBy  Siraad DirsheRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-30", "author": ["Condé Nast", "Anya Tchoupakov"]}