{"id": "520e209537cfb21fb27432309129d986", "url": "https://www.bonappetit.com/story/ojai-tangerines-mail-order", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "A 10-Pound Box of Ojai Tangerines Is a Bright Spot in Deep Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA 10-Pound Box of Citrus Is a Bright Spot in Deep WinterWhat are you gonna do with all those tangerines? I have a few ideas. (Eat them.)By Alex BeggsFebruary 16, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.One of the worst things you can get in the mail is a fine for an E-ZPass violation, $100 for each of three missed $9 tolls that you will never, ever successfully dispute. But thankfully, per Newton’s Third Law, things will come back around when a 10-pound box of tangerines shows up in the middle of frigid February. One of the best things you can get in the mail.Last Christmas, when my family asked what I wanted, I replied: BIG BOX OF TANGERINES. I sent the link to OjaiPixies.com. You have to order them a few weeks/months in advance, so when they show up on a snowy winter day right when you totally forgot you made that bossy request, well, what a pleasant surprise!The tangerines—or oranges, grapefruit, lemons, a few avocados, you have a lot of choices—are from Friend’s Ranch in Ojai, California, 2,315 miles away from me. Last year, I ordered a mixed box that had several varieties of seeded, seedless, tiny and big tangerines, all as sweet as candy and cute as a button. Some are so small they fit into your puffer coat pockets, which is a great place to store them. These seasonal California tangerines make the year-round oranges I buy here in Michigan (for cocktails only) look like plastic props in comparison, bitter and bland.And this year, demand for the Pixies has only grown. In fact, you have to keep checking back on the Friend’s Ranch site to catch its restocks every Tuesday, at around 3 p.m. to 4 p.m. ET. I just snagged “The Plain Jane” box this week, which I’m crossing my fingers contains a few avocados. Yes, there’s hype for seasonal fruit now. Set your calendar alert. Do what you need to do!Sidenote: Some of the fancy citrus have great names like “Yosemite Gold” and “Gold Nuggets,” which remind me of greedy men sifting rocks in dried riverbeds. If only they knew where the real riches were! (In their hearts—and in mail-order citrus farming.)I WILL be adapting this grapefruit pound cake with whatever shows up in my “Plain Jane” box. \nAlex LauWith 10 pounds of citrus, what to do?! I juiced a few seedy but supersweet Dancy tangerines into a mason jar, then dropped in a halved jalapeño to make margaritas with later. I juiced a few more to make my favorite poppyseed pound cake, which is moister-than-moist thanks to all that juice. Citrus salads with fatty cheeses or fatty avocado for contrast. Upside-down cakes. Curd bars! Candied peels. Homemade house cleaner. Marmalade! I gave them out to coworkers and friends. I peeled them and snacked on them and then had that dreaded-wonderful orange scent stuck on my hands all day. If you think 10 pounds of citrus is too much for a single person, I’m sorry to say that’s just a lack of imagination.Photo by Emma FishmanOjai Pixie TangerinesShop Now at Ojai PixiesShop Now at Friend's RanchExplore Bon AppétitHighly RecommendShoppingRead Morerecipes37 Citrus Recipes to Put Some Pep in Your Winter StepGallery37 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-16", "author": ["Condé Nast", "Alex Beggs"]}