{"id": "5219bccab8ac6b25382f5a9f2d38a6ed", "url": "https://www.bonappetit.com/recipe/aperol-spritz", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Aperol Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueAperol SpritzBy Yekaterina BoytsovaMarch 20, 20183.7(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis classic combo should be credited with starting the whole spritz phenomenon in the United States.IngredientsMakes 13pitted green olives2oz. Aperol3oz. ProseccoSplash of club sodaPreparationThread olives onto a swizzle stick. Pour Aperol and Prosecco into a rocks glass filled with ice. Top off with soda and gently stir with swizzle stick with olives.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Aperol Spritz?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleFantastic! The olive is such a fun twist!AnonymousDenver4/29/2021The comment from anonymous in New Haven is likely from someone who has never traveled. \n I used to think that Aperole Spritz could only be served with orange slices until I went to Shenzhen, China! There was a magnificent cocktail bar called \"Magma\" in a place called Baishizhou. Magma specialized in cocktails and the owner would use his Mother's Spritz recipe.She lived, I think,  near Milan. He would serve it with three olives and oranges slices. It was divine!Canada5/1/2020I did  not even bother making this recipe, because it is full of errors.  (1). An Aperol Spritz is made with Aperold, white wine, a dash of sparkling water, and a slice of orange.  (2). This recipe is for an Aperol Prosecco (which I happen to prefer), but NEVER have I seen it or heard of it made with green olives or any kind of olive.  It is ALWAYS serve with a slice of orange.\n\nIt is okay to ampler with classics, but please do not pretend that the result is the real or authentic recipe.AnonymousNew Haven, CT3/24/2020Every time we ordered these in Italy and France they were always served with green olives, usually a thin slice of orange, and often a tiny bowl of potato chips. The saltiness of the chips compliments the semi sweetness of the drink. A perfect day drink for a summer sidewalk cafe. AnonymousMyrtle Beach, SC8/26/2019So, the olives are totally legit.  When I was in Venice last Spring, it was the loveliest of surprises to see olives in the spritzs.  The light touch of salinity added something buonissimo to this delightful beverage that takes me to Italia, even at the cabin in Wisconsin! And if you like your Aperol to Prosecco ratios differently, feel free!Minnesota8/26/2019Not a bad drink. I agree the olives are an odd choice. I much prefer a slice of orange. To an earlier commenter: Prosecco is a type of sparkling Italian wine. It can be found at most groceries with a decent wine selection. Aperol is a great Italian bitter. It can be found in a strongly supplied liquor store. It makes for a great summer, pre-dinner beverage!parttimebakerOhio8/26/2019Needs way more than a \"splash\" of soda to make it a spritz. Skip the olives - a dry martini this is not. Replace them with Maraschino cherries, if anything.Alina Tarmu8/26/2019This is not an Aperol Spritz.  \nNo olives.  Too much Aperol.  Not enough sparkling water. \nServe in a Wine glass.    AnonymousUSA7/3/2019Olives? Seriously? This is the most egregious example of change for the sake of change I've seen in a while. Shame on you!AnonymousFlorida and Firenze7/2/2019You act as if we know what Aserol and Prosecco is! 4 ingredients and I am already over my head! Please explain what this stuff is and where to get it. Thanks wannaBchef840677/1/2019Explore Bon AppétitCocktailDrinks AllItalianEuropeanAperolAlcohol & Other DrinksProseccoQuickEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Yekaterina Boytsova"]}