{"id": "521d9ca1f2bf55c79fb32e1547554c97", "url": "https://www.bonappetit.com/recipe/chickpea-pancakes-with-kale-and-fennel", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Chickpea Pancakes with Kale and Fennel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChickpea Pancakes with Kale and FennelBy Chris MoroccoDecember 26, 20184.6(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSavory chickpea flour pancakes, also known as socca, require just four ingredients (including water) and are packed with protein. The kale-fennel salad with tahini dressing is a fresh, bright complement but is also delicious on its own. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servings½cup chickpea flour6Tbsp. extra-virgin olive oil, dividedKosher salt3garlic cloves, divided115-oz. can chickpeas, drained1Tbsp. za’atar (or curry powder, chile powder, or frankly any other combination of mild dried ground spices)1small bunch Tuscan kale, stemmed, leaves torn1small fennel bulb, very thinly sliced crosswise¼cup tahini2Tbsp. fresh lemon juicePreparationStep 1Whisk chickpea flour, 1 Tbsp. oil, a pinch of salt, and ½ cup water in a medium bowl. Let socca batter sit at least 10 minutes or up to 1 hour to let flour hydrate.Step 2Meanwhile, heat 2 Tbsp. oil and 2 garlic cloves in a medium nonstick skillet over medium, tossing occasionally, until garlic is lightly browned, about 3 minutes. Add chickpeas and increase heat to medium-high. Cook, tossing occasionally, until chickpeas are lightly browned, 6–8 minutes. Add za’atar and toss several times to coat chickpeas; season with salt. Add kale and continue to cook, tossing occasionally, until kale wilts, about 2 minutes. Transfer to a medium bowl, add fennel, and toss to combine. Reserve skillet.Step 3Finely grate remaining garlic clove into a small bowl. Whisk in tahini, lemon juice, 2 Tbsp. oil, and 2 Tbsp. water until thick and smooth. Season with salt.Step 4Heat 1½ tsp. oil in reserved skillet over medium-high. Add half of reserved socca batter to center of skillet and tilt skillet so that it spreads out to a thin 6\"–7\" pancake. Cook, undisturbed, until well browned and crisp underneath, 2–3 minutes (crank up the heat to high if needed to get crunchy edges and nice browning). Turn and cook just until lightly browned on second side, about 1 minute. Transfer to a plate. Repeat with remaining 1½ tsp. oil and batter.Step 5Top each socca with chickpea salad. Drizzle with tahini sauce.How would you rate Chickpea Pancakes with Kale and Fennel?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThis was delicious! I doubled the recipe and used the mandoline to slice the fennel bulbs. I cranked the skillet to high from the beginning and did end up thinning the batter a little bit more to get the batter to spread easier and make a larger pancake. It’s a keeper for sure.Emily WestbrookBirmingham, AL2/8/2022I made this without the pancakes and it is delicious. LynRiverside, CA9/28/2021Love this. Fast, different and delicious. Love the way everything plays with each other. Great way to get my wife to eat kale. Crispy garlicky chickpeas, oh yes.  These pancakes would be great for breakfast, my breakfast any way. I prefer my steel cut oatmeal with everything but the bagel seasoning  from the Spice House. And love shrimp and scallion pancakes with fish sauce. William ZarsNear Chicago1/16/2021I was really looking forward to this recipe but have some remarks: \n* the chickpeas + veggies were too dry to complement the pancake\n* chickpea flour makes for a dry pancake. I feel like it's missing some kind other ingredient to help make it wetter? \n* the tahini wasn't enough to moisturize the dish, so I added some whole milk yogurt w/ lemon + grated garlic instead\n\nOverall, it left me feeling like I was chewing into a bunch of chalk marbles. \nDisappointedgodsyllaLos Angeles, CA12/26/2020This was simple and delish. Next time I'm going to omit the olive oil in the tahini and. You also may not need oil to cook the pancake if you have a non-stick pan.Fran11/22/2020Delicious. I only used oil to fry the pancakes. Not in the dressing or for frying the greens. Tahini alone has already lots of fats and calories. Garlic and greens can be fried with splashes of water. Keep adding a few tablespoons at a time to keep things from sticking and burning. Yield 2 small pancakes and plenty of greens. Have leftovers greens which will be devoured later. Great taste. Will do it again.AnonymousTexas11/8/2020Made this exactly as described, and thought it was delicious! It was pretty fun to have a \"pancake\" for dinner, too.ChloeSan Diego10/15/2020this was great imo, i didn't even make the sauce but it would have been great i'm sure. the socca were surprisingly tasty, and i enjoyed the zaatar spiced beans n greens. definitely making more of this soon, and taking this as a base for exploring different toppings.wheres_the_vegNJ8/28/2020I was excitedly anxious to try this recipe out because ,I thought, we had all of the ingredients on hand and savory pancakes sounded like a dream at the time. The flavor combination was for me, personally, a little strange but it most likely had to do with the couple substitute ingredients I incorporated - lime juice instead of lemon juice, and red lentils instead of chickpeas.  It seems like a lot of work for a not so great result. Hope it's better for others!Leslie MarianaOlathe, KS6/30/2020This recipe was OK. I made it as written and it was pretty underwhelming and not very filling. Other comments have noted that this recipe is 1000 calories (per serving I think) and to have such a caloric recipe that isn't filling is kinda of disappointing. I like the idea but probably won't make it as written again.Anonymouscalifornia5/7/2020This was prettttty good. I was excited to find this since we have chickpea flour in the house for some Indian recipes we like to make, and it was fun to try out something different with it. I feel like the kale mixture should have had more acid or spice to take it up a notch; it was good but I didn't want to gobble it down. I loved the pancake and it would make a great base for things like roasted veggies, so would definitely make that again.soapnanaChicago, IL5/6/2020Delicious!  Well worth the (apparently) 1,000 calories.  Pancakes were fluffy and delicious.  I used my leftover dressing from the Charred Kale with Citrus salad on the kale here.  I did not have za'atar or curry, so used chili, cumin, and turmeric.  I tried to move the first pancake too soon and tore it.  The second one I started at a high heat and flipped once it was cooked through, it stayed together and got nice and brown.noramayeBuffalo5/2/2020I've made this with both za'atar and curry powder and it's delicious! Always have leftover sauce and it's delicious on everything. AnonymousChicago3/28/2020I was skeptical about the flavor combination but this was much better than I expected.  I made this tonight for my family of 4 with a few changes due to what I had on hand and personal preferences.  First, I made the socca into about 6\" rounds to use as tacos instead of one larger pancake per serving.  Second, I started the garbanzo beans alone first then added the garlic with the za'atar because I was afraid of the garlic burning.  After sautéing the kale with the beans (used conventional instead of Tuscan) I set it off to the side, in the pan, and stirred in the fennel along with half a shredded rotisserie chicken and a teaspoon of lemon zest.  For some reason my tahini seized up on me so we ended up using it as a spread on the 'taco's' instead of a drizzled sauce.  Husband and I ate it with green and red harrisa, kids with tatziki.  Delicious!ceylon22NJ3/19/2020This is a great recipe and incredibly tasty, but as written it comes out to over 1000 calories per serving! My suggestion is to either cut the total oil in half or be extremely sparing with the tahini sauce. I agree that whole foods matter more than numbers when it comes to being healthy, but most of us don't have 1000+ calories to spare for a single meal.Anonymous12/22/2019Explore Bon AppétitPancakeSaladMediterraneanChickpeaBeanVegetableChickpea FlourFlourKaleLeafy GreensFennelZa'atarHerbs & SpicesQuickWeeknight MealsMainVegetarianVeganDairy-FreeGluten-FreeHealthyishFryRamadanLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}