{"id": "5220b8ca81196774b840c79c68cdc91e", "url": "https://www.bonappetit.com/recipe/crispy-salmon-with-tomatillo-salsa", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Crispy Salmon With Tomatillo Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueCrispy Salmon With Tomatillo SalsaBy Vanessa CasillasApril 20, 20215.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jaida Grey Eagle, prop and food styling by Rose DanielsEmailPinterestPrintEmailPinterestPrint“The health of the salmon reflects the health of the people,” says Vanessa Casillas, the business manager and internship coordinator at Gatherings Cafe inside the Minneapolis American Indian Center. She is a citizen of Ho-Chunk Nation, and while salmon isn’t common in her community, she wanted to highlight the bond between the fish and humans in this recipe because it’s key to so many other tribes’ diets. Before searing the salmon fillet in hot oil, she sprinkles in cumin seeds to add aroma and texture. To finish, she adds a swoosh of smoky, spicy tomatillo salsa, a tribute to her father’s Mexican heritage (“He eats everything with salsa!”).Ingredients4 ServingsSalsa1lb. tomatillos, husked, rinsed2serrano chiles2garlic cloves, unpeeled¼tsp. cumin seedsKosher salt1spring onion or 2 scallions, white and pale green parts only, finely chopped3–4sprigs cilantro, tough stems removed, chopped½tsp. dried oregano, preferably MexicanLime wedges (for serving; optional)Salmon and assembly1Tbsp. extra-virgin olive oil¼tsp. cumin seeds46-oz. skin-on salmon filletsKosher saltDried oregano, preferably Mexican, cilantro leaves, avocado slices, and lime wedges (for serving)PreparationSalsaStep 1Preheat broiler. Place tomatillos, chiles, and garlic on a rimmed baking sheet. Broil, tossing once, until tomatillos are blistered in spots and starting to release some juices, 7–10 minutes. Transfer to a medium bowl and cover. Let sit until tomatillos are softened, about 5 minutes. Uncover and let sit until cool enough to handle, about 10 minutes.Step 2Remove skins from chiles if desired and peel garlic; place in a molcajete or mortar and pestle along with cumin seeds and a pinch of salt. Grind until smooth. (Or you can use a blender if you grind the cumin seeds before adding.) Add tomatillos and grind until a coarse purée forms. Stir in spring onion, cilantro, and oregano. Season with more salt if needed; squeeze in lime juice to taste if desired.Salmon and assemblyStep 3Heat oil in a large skillet over medium-high. Sprinkle in cumin seeds. Season salmon with salt; arrange, skin side down, in skillet. Reduce heat to medium and cook, pressing down gently on fish, until skin is golden brown and crisp, 6–8 minutes. Turn over; cook until just cooked through, about 4 minutes.Step 4Divide salmon among plates; spoon salsa over. Scatter some oregano and cilantro on top. Serve with avocado and lime wedges alongside.How would you rate Crispy Salmon With Tomatillo Salsa?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleFabulous!  We give it a 10!Oboelady Whitehall, MI5/8/2021Explore Bon AppétitSalmonFishSeafoodTomatilloVegetableQuickEasyWeeknight MealsMainNut-FreeGluten-FreeKetoFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Vanessa Casillas"]}