{"id": "52285a7364cbf59b02e9f43ea2ae7c9f", "url": "https://www.bonappetit.com/recipe/this-plt-will-be-your-new-fave-sandwich", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "This “PLT” Will Be Your New Fave Sandwich Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDThis “PLT” Will Be Your New Fave SandwichSponsored by Heinz® Mayonnaise FacebookPinterestTwitterEmailPhotography by Chelsie CraigServes 1If you’re a fan of the BLT then get ready for a new sandwich favorite to enter the ranks. This exclusive sandwich comes from one of Atlanta’s mainstays, Fred’s Meat and Bread—the sandwich spot from Chef Todd Ginsberg, Shelley Sweet, and Jennifer and Ben Johnson a.k.a. the folks behind The General Muir. Their “PLT” is made with crisp pastrami, lettuce, and tomato and comes complete with the perfect finish—a generous slather of NEW Heinz® Mayonnaise. You bet we’re totally getting down with PLT.PrintIngredients3 slices pastrami, sliced about 3/16” thick2 slices thick white bread, liberally buttered on one side before toasting (bring butter to room temperature for spreading)Heinz® Mayonnaiseslices of heirloom tomato (enough to cover bread), cut about 1/2” thickKosher salt and pepper2 pieces of washed and dried butter or bibb lettuce (lettuce should be cold)Recipe PreparationSandwich AssemblyCrisp the pastrami in a pan or griddle to desired crispness. Remove the pastrami and toast the bread in the same pan or griddle. Spread a generous amount of Heinz® Mayonnaise on the buttered sides of both pieces of toast. Place tomato slices on top of mayo and season with salt and pepper. Layer pastrami on top of tomato, followed by lettuce. Top with the other slice of toast and cut in half from point to point, so it makes two triangles.Sponsored by Heinz® Mayonnaise GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Heinz"]}