{"id": "5230b1bee8bb01404c9e8a953fc094e4", "url": "https://www.bonappetit.com/story/5-rhythms-dance", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "5 Rhythms Virtual Dance Party Is What I'm Living For Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureLeading a Virtual Dance Party Is What I'm Living For Right Now5Rhythms doesn't care that I can't tell my right from my left. It's an open invitation to do whatever my body wants to do.By Hilary CadiganApril 21, 2020FacebookTwitterEmailIllustration by Sofie Birkin FacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone. If you want to dance with us, Hilary will be hosting a hour-long dance party on Zoom this Friday, April 24th at 9 p.m. EST. Here's the link to listen to her playlist live (you need a Spotify account to log in). In lieu of payment, please consider a donation to Raise NYC's Undocumented Workers Fund, for food service workers who have lost their jobs but won't receive any government assistance because of their status. See you on the virtual dance floor!I’m standing in a 10-foot-by-4-foot rectangle, wedged between the kitchen island and the kitchen table, which is wedged against a wall. This is the largest continuous space in my entire Brooklyn apartment. It is not large. But I’ve gotten pretty good at leaping, spinning, swinging my hips, and waving my arms around without slamming my elbows into the granite countertop. That only happened once.My laptop sits at eye-level on a bookshelf between Where the Wild Things Are and Air Fryer Revolution. On its screen is a grid of 12 sweaty people, one of whom is me. We’re physically scattered, separated into kitchens and bedrooms and living rooms around the globe, but digitally we’re all right here, in our little rectangles, listening to the same streaming playlist, moving faster and faster as the beat builds, transitioning (not quite smoothly—my free online DJ app offers no crossfade) from a Nina Simone remix into the pounding bleeps and bloops of “Space Junk”, an EDM anthem my friends and I used to collectively freak out to in our early twenties.I pick up my cat and speed-waltz with him close to the screen until he scratches me in the face. Someone starts waving a flashlight around like we’re at a rave and suddenly we’re all pulling out flashlights, candles, sage sticks, our little screens exploding with light. We are alone, but we are not alone, and we are dancing.I went to my first 5Rhythms class in Atlanta about five years ago, finally succumbing to a friend’s persistent promises that I would love it. “It’s this thing, where like, a bunch of people dance together in a room,” she’d told me. “There’s no choreography, but there’s a vibe. It’s kind of like...a meditation? But also a dance party.”It amazed me how I could come into a space knowing no one and, without speaking a single word, leave it feeling connected to everybody.When I finally made it one rainy Tuesday night, said friend did not appear, so I found myself alone in a room full of strangers, ages ranging from 20-something to 70-something, bodies of all sizes and colors and shapes, outfits falling at all spectral points between athleisure and Burning Man. The music kicked off like one of those new age-y soundtracks they play at spas. I clomped around awkwardly, circling my arms a little, not sure how to dance to massage music. But then it slowly began building until we crossed over the 128 BPM line into that place where your head drops loose and your hips turn liquid and your feet come untethered from reality and suddenly you’re free. We thrashed and sweated until the music lightened into something jangly-warm and good for ballerina twirls, then slowed back to massage music levels, collapsing in sticky heaps on the floor. It amazed me how I could come into a space knowing no one and, without speaking a single word, leave it feeling connected to everybody.Depression and anxiety are woven into my fabric—periods of intense joy sandwiched between panic and sadness and deep, biting worry, the kind that wakes me up in the middle of the night and knocks against my skull like an intruder with a hammer. The period when I first started 5Rhythms was a particularly rough one; I’d recently moved back to Atlanta after three years in Thailand and was struggling to re-find my place in the city. My anxiety made me awkward, unsure of how to carry my body. I felt trapped in my brain and I cried all the time. (Does this sound like all of us right now? Yes, it does.)The idea of starting a ~practice~ like 5Rhythms was hard for me to accept at first. I have never been a particularly disciplined person. I don’t understand how anyone could ever find jogging pleasurable, and I’ve busted out of more gym contracts than I can count on two hands. Yoga is fine, but I get bored, and my mind wanders too much for seated meditation. Once when I was living in Thailand, I tried to take a hip-hop dance class with a bunch of old ladies and left near-tears because I couldn’t follow along with any of the moves. “You’ll do better next time!” said a woman with fluffy gray hair and an inside visor. But I knew I wouldn’t. I can’t follow choreography because, at 32, I still don’t know my left from my right (it’s a thing! 15 percent of the population!). I have to put my hands in the shapes of Ls and think for a minute about which one is pointing the right way, and that takes way too long when a dance teacher is screaming “to the LEFT!”That’s why 5Rhythms works for me—it’s freedom instead of rules. It’s an open invitation to do whatever my body wants to do, with only the loosest structure in which to do it.Flowing, staccato, chaos, lyrical, stillness: These are the five rhythms, invented by a dancer named Gabrielle Roth who was recovering from a knee injury at the Esalen Institute in Big Sur, California, in the late ’70s. She was searching for a way to structure dance as a transformative process and came up with this: the Wave, which contains all five rhythms strung together into “a metaphor, a meditation, and a medicine.” It all sounds very woo-woo, and well, yes, it kind of is. Look on the 5Rhythms Instagram page today and you’ll see lots of inspirational quote cards and grainy pictures of rocks and flowers piled into circles. But this practice, if that’s what you want to call it, fucking does something to you.The best feeling dancing can give you is one of floating above yourself, looking down at your body moving on its own, completely free from the yoke of your own brain.As I kept going back, week after week, I noticed changes in myself almost immediately. After dancing, I was calmer, lighter. I felt more at home in my own flawed skin, but also more at home in the world, more comfortable among other people. “The body doesn’t lie.” That’s something Gabrielle said a lot, I’m told, and something 5Rhythms teachers like to repeat in whispery voices over the microphone during a wave. It’s something I think about as I throw my limbs into the air, as I let them make their own gangly decisions about where to go next. The best feeling dancing can give you is one of floating above yourself, looking down at your body moving on its own, completely free from the yoke of your own brain. Because my brain does lie to me, often, so it's a comfort to know—or at least to be told—that my body won’t.I danced through knee problems and nervous breakdowns and writing blocks. Eventually work relocated me to New York City; I was sad to leave my Atlanta dancers behind but heartened that I’d be moving to the epicenter of the 5Rhythms community, where Gabrielle’s son Jonathan leads weekly Tuesday Night Waves. Roth herself passed away several years ago, but many of the people who dance here knew her. Here, the group of 30 or 40 I was used to back in Atlanta ballooned to 150, and the atmosphere intensified (because: New York). People would crawl around on the floor and howl like dogs. It was a lot, and it took me a minute to find my comfort again, but I knew by then that I was a better version of myself with 5Rhythms, so I danced through it.There is something that happens in a room full of people all dancing to the same beat. If I may dust off one of my old college textbooks, it’s what sociologist Émile Durkheim referred to as “collective effervescence”—a moment in which individuals come together to participate in the same action, the unity of which lifts us into a state of electrified delirium. For Durkheim, such a state is usually tied to religious ritual, because its power is so strong it can make people feel like they’ve come into contact with something otherworldly. But I can’t think of a better term to describe what happens when I’m letting my body do its thing in a space filled with other bodies doing their thing. We’re little bubbles, dancing together, carbonated and intoxicating.On the last weekend of February, I attended a 5Rhythms workshop on the fourth floor of a  building in the West Village. It was a sunny day and the studio was flooded with light, the windows open to let in the air. Back then we were washing our hands a little more often, but still unafraid of togetherness, of proximity.For nearly six hours straight, we danced alone and together, with partners and in groups. At one point, during an exploration of chaos (and its shadow: confusion), we allowed ourselves to completely lose control while two spotters guided the perimeter, making sure we didn’t get hurt. I left the studio feeling more connected to strangers than I maybe ever had.Less than two weeks later, the first confirmed coronavirus-related deaths were recorded in New York. It wasn’t safe to dance together anymore. Not for 100 people and not for five. It wasn’t even safe to go to the grocery store.I started feeling crazy about a week into quarantine. Not only did it seem like my muscles were beginning to atrophy, denied even their brief walk between home and subway station and work, but I missed the connection dancing gave me, that collective effervescence that once strung my weeks together. Though I knew I was lucky to be healthy and privileged to have a job that allowed me to work from my kitchen table, I also found it hard not to despair. My apartment is tiny. There are approximately 28 children living next door and all of them scream in unison at 10:51 p.m. every night. I let my cats outside to roam the abandoned hallways one time and now they sit by the door every day meowing like prisoners.So one night, desperate to move, I pushed the kitchen table as far as it would go against the wall, put on some Spotify, and started dancing, alone in my kitchen. A couple days later, I got my husband to join. Then, on one of those Zoom happy hours with a dozen people attempting to talk at the same time, I thought, What if we had a version of this where...nobody talked. And instead we just...danced? That’s how the Zoom Waves began. Not officially, of course—I am legally required to inform you here that I am not a certified 5Rhythms teacher—but there are no rules in quarantine aside from the ones keeping us alive. As long as you stay inside and wash your hands, you can have a meeting with your boss, pantsless. You can eat brownies for breakfast. You can host a dance class over Zoom and call yourself its leader.Now I do Zoom Waves every Friday night and Sunday afternoon. (On Tuesdays and Thursdays, I can tune into the official 5Rhythms livestream.) I start by demonstrating each rhythm in a way that I hope sets the tone for a place free from judgment—you don’t need to look cool to be on this Zoom. Then, we tune into my streaming playlist, put our microphones on mute, and dance. Participants are friends from school, work, and nearly all the cities I’ve ever lived in. They Venmo me donations that I send to a fund for undocumented workers who have lost their jobs—a small contribution that, like the dances themselves, makes me feel less impotent in the face of such a big and all-consuming trauma. Our group grows every week, some people filtering in and out, some as committed as I am. I spend most of my free time making playlists on Spotify. I have blisters on my feet because I’m dancing more than ever. If I stop for even a few days, I feel the darkness settling in, but I know that an hour of dancing will lift it. This is my way of being with other people; it’s also my way of being with myself.I have felt alone so many times before—in crowded rooms, in bars full of people, surrounded by friends. That’s what depression and anxiety can do to you, but it’s also just the reality of living in this weird, connected-but-apart world, where we bond with people and then leave them, always on the hunt for something else. We move to new cities and see each other less and don’t call as often as we could. Some of us get married and some of us have babies and slowly, without even realizing it, we break away from each other like icebergs on a warming planet.But this current form of aloneness is distinct in its severity, its physicality, its everywhereness. Unless we’re out there doing essential work, none of us have plans on Friday night, and thus, in a way, all of us do. Our plans are, collectively, no plans. And maybe this can be a blank slate of sorts; not just a new way of being alone, but a chance to come up with new ways of beating back loneliness. We can reach out into the void, share the things that bring us comfort, and hope they might bring someone else a little comfort too.We’re easing into lyrical now, starting with the opening whistle of Bomba Estereo’s “To My Love.” It’s one of those songs where the tune is happy but the lyrics are sad, though many of the dancers probably don’t know that because it’s in Spanish. We raise our arms above our heads and swoosh them back and forth; I do a complicated little jig around the right angle of my kitchen island, trying not to step on a cat or knock over a precariously placed Dolly Parton prayer candle. A close friend whose recent pregnancy led to a pelvic floor prolapse that makes it hard to move too much is sitting down on her carpet, pumping breast milk to the rhythm. Another twirls with her one-year-old son, who is screaming on mute. A third, who lives alone and has taken this opportunity to ingest hallucinogens, seems to be having a nonverbal conversation with her light fixture.Here we are in our little rectangles, apart but united by movement. “The body doesn’t lie.” Neither does the screen. Neither does this virus that keeps us from touching each other. Neither does the process of aging, of growing up and away.At the end of each Zoom we will linger. Maybe we’ll cook or do chores, wander in and out of the room, leave the screen open for company. We’ll say things like, “Let’s keep doing this even after the quarantine is over.” Who knows if we will. Who knows which promises we’ll hold onto once this all ends, and which ones we made because we were scared and promises helped us feel safe. We are not safe here—none of us, ever—but right now, dancing like maniacs across the void, it feels like we are.Want to dance with me? Tune into my JQBX livestream every Friday at 9:15pm EST and Sunday at 3:15pm EST, or check out my past playlists on Spotify.Explore Bon AppétitHealthyishHealthyish Guide to Being AloneSelf CareessayRead MoreCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomBy Phillip PicardiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-21", "author": ["Condé Nast", "Hilary Cadigan"]}