{"id": "5234388ba066237b3ea0a547cedcf1bf", "url": "https://www.bonappetit.com/story/weeknight-dinner-party-butter-basted-steak", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Weeknight Dinner Party? Start with Brown Butter-Basted Steak | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWeeknight Dinner Party? Start with Brown Butter-Basted SteakIf you have one beautiful piece of meat, you can build your meal out from there.By Adam RapoportFebruary 5, 2019FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I got an email from my wife last week, announcing that Lauren and Amiel were coming over for dinner on Tuesday night and that, you know, we’d figure it out.The thing about weeknight entertaining is that it’s like taking a job on a tight budget—you’ve got to think about labor, timing, and how you’re going to get it all done.In this instance, my mind went immediately to our freezer, where there was a ginormous, dry-aged rib eye I had gotten from our friends at Belcampo Meat Co. Easily enough for four people.Steak, pork chops, lamb chops—quality protein really doesn’t need much more than salt, pepper, and heat, which makes it ideal for a dinner party on the fly.Want this letter before it hits the website? Sign up for our newsletter!I pan roasted the rib eye, giving it a nice, patient sear on all sides. And then, right before it reached medium rare on an instant-read thermometer, I did that restaurant thing where you throw in a few knobs of butter, some smashed garlic cloves and herbs, and baste the steak with the frothy, fragrant butter before letting it rest on a cutting board.Steak, butter, done.\nI could’ve done without a starch (honestly!), but in our email thread, Simone lobbied hard for risotto—which, I just might have shot down a bit abruptly.It’s not that I don’t love risotto. But when you’re busy tending to a steak on a stove top, do you want to simultaneously be standing and stirring a pot of rice and feeding it stock for exactly 21 minutes till it’s creamy but still al dente?Not really. Remember, weeknight entertaining should be manageable and not too time consuming.So instead of firing up another burner, Amiel turned on the oven and got to work, riffing on his Basically roasted potatoes. So crispy, so fluffy, so good. And, yes, guess who at the table ate the most of them, by far? #guiltyFirst you boil them, then you roast them.\nBen DeweyFinally, a big salad. One that I like to call “bracing,”  a word that my colleagues make fun of me for using way too much. But when you’ve got a lush, rich steak, and a bowl of crispy, salty potatoes, don’t you just crave something...bracing for balance?So Lauren pulled one together, teeming with peak-season citrus and the kind of hearty greens you can find in February—something like this or this.Salad, for balance and for health.\nMichael Graydon + Nikole HerriottOh, and Amiel brought a magnum of easy-to-drink Beaujolais.By the end of the night, we realized that everyone had chipped in. Nothing was too complicated, but it was all delicious.And finally, just as we were wrapping things up at a respectable hour, Lauren and Simone announced that the risotto dream would not die. That they would plan a risotto-exclusive dinner party on an upcoming Tuesday night. I’ll be eagerly awaiting the email.Get the recipes:Brown Butter–Basted SteakPerfectly Roasted PotatoesRadicchio and Citrus Salad with BurrataChicory Salad with Honey-Mustard VinaigretteP.S. Speaking of weeknight entertaining, Alex Beggs is looking for your etiquette questions about Valentine’s Day cooking or dining. Want to know if it’s okay to cook your date a dish with 40 garlic cloves? The best dessert to hide an engagement ring in? An impressive date-night recipe? Send all your questions to staff.bonappetit@gmail.com.Explore Bon AppétitSteakAdam NewsletterRead MorecookingThe Biggest, Best, and Cheapest Steak You’ll Ever Make Is Also Impossible to Mess UpBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-05", "author": ["Condé Nast", "Adam Rapoport"]}