{"id": "5237d69db854c6ce42f641c95aaafe17", "url": "https://www.bonappetit.com/story/aloo-chaat", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Aloo Chaat Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'll Take a “Chaat Treatment” Over a “Spa Treatment” Any DayA very fast, very satisfying way to turn a couple of potatoes into dinner.By Priya KrishnaJanuary 9, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Yekaterina Boytsova FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Let me set the scene: It’s 9 p.m. I just got home. I haven’t eaten dinner and there’s nothing in my kitchen except a bag of russet potatoes. What do I do? I make aloo chaat.Chaat—a category of spicy, tangy, texture-heavy snacks that you want to eat even when you aren’t remotely hungry—is a fundamental part of Indian cuisine. The concept behind most of these snacks is something I think of as the “chaat treatment”: A crunchy and/or carb-y base (chopped-up samosas, chickpea flour crackers called paapdi, potato patties called aloo tikki, and so on) is doused with herby chutney (usually cilantro or mint), sweet and sour tamarind chutney, yogurt, finely chopped red onions, chaat masala, and sev (crunchy, sprinkle-like savory bits made from chickpea flour). One of the best versions is aloo chaat, the foundation of which is plain ol’ chopped, boiled potatoes—the tubers do an exceptional job of soaking up flavor.Aloo chaat has recently become my back-pocket meal prep/entertaining/weeknight dinner solution. Boil potatoes. Chop ’em up. Salt ’em. Lime ’em. Make a quick chutney out of cilantro, lime, a Thai chile, salt, and sugar. Drizzle that over the potatoes, along with equal parts bottled tamarind chutney (Maggi is my favorite brand!) and plain, whole-milk yogurt. Sprinkle the chopped onions over the top, followed by a large pinch off chaat masala and a big handful of sev (Haldiram’s or bust!). Make it on a sheet tray, for a dramatic presentation!But you don’t actually need these exact ingredients to capture the essence of aloo chaat. What makes the dish so brilliant is the alchemic combination of zesty, sweet, sour, funky, refreshing, cooling, and crunchy. And there are many ways to achieve that!Let’s start with the potatoes. Chopped, peeled (or unpeeled!) boiled russets are usually my go-to, but you can use red potatoes, new potatoes, even those teeny tiny baby potatoes that come in the mesh bags!Next up, chutney: You can make it out of nearly any fresh, tender herb. Cilantro, mint, basil, parsley—it’s all fair game. Don’t feel like taking out your blender? Chop up the herbs (cilantro and mint work best for this method, because they bring the necessary bite and brightness even without being blitzed with chiles and lime) and the chiles and mix them directly into the potatoes, along with an extra generous squeeze of lime and a pinch of sugar.With the tamarind chutney, what you’re really after is that sweet and sour flavor. Date syrup or maple syrup whisked with a little lime juice work just fine, as does, I imagine, actual sweet and sour sauce (can someone please try this and report back?).In lieu of yogurt, I have used sour cream, mascarpone thinned out with a little milk, and crème fraîche.Fresh out of chaat masala? Skip it.In the crunchy topping realm, sev is a great option, but you know what else works? Crushed Fritos. Those fried onions in a can. Crumpled up potato sticks. Nacho Cheese Doritos!The best part of aloo chaat is that it doesn’t judge you for being unprepared. Some days, I open my fridge and I have all the ingredients I need. Other days, I’m running out to my bodega to buy a bag of Fritos and some sour cream in lieu of sev and yogurt. Trust in the aloo chaat formula, and you’re going to end up with something incredibly crave-worthy.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-09", "author": ["Condé Nast", "Priya Krishna"]}