{"id": "5241e36ddf7089de688b914dd3a20268", "url": "https://www.bonappetit.com/story/burlap-and-barrel-cinnamon", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "This Cinnamon Powder Tastes Like It's Spiked with Sugar (It’s Not) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cinnamon Tastes Like It's Spiked with Sugar (It’s Not)One shake of Burlap & Barrel's Royal Cinnamon, and my oatmeal is transformed. By Sarah JampelFebruary 14, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I ended a recent dinner party with a humble-looking applesauce cake that turned out to be way more delicious than it had any right to be. When my friends quizzed me on the exact ingredients, I was forced to fess up and pass around the jar of cinnamon that was solely responsible for the cake's \"wow\" factor. I ended up dishing out tiny spoons so my friends could taste the cinnamon straight-up. I swear I don’t normally do this, but they had to understand that this cake was built on Burlap & Barrel’s Royal Cinnamon and Burlap & Barrel’s Royal Cinnamon alone.Photo by Emma FishmanBurlap & Barrel Cinnamon$8 at Burlap & Barrel$9 at HiveCompared to any other ground cinnamon, this is powerful stuff. Harvested from an heirloom species (cinnamomum loureiroi) that’s rarely seen outside Vietnam and sun-dried, it smells like Big Red gum and tastes so sweet you’ll swear it’s spiked with sugar. Even when I use half the amount of what’s called for in a recipe (and yes, I’d recommend starting slowly as you gauge its intensity), my pies, snickerdoodles, morning buns, and yes, cakes, turn out brighter and more fragrant than any I’ve baked before. And on days when I’m not baking, it makes my regular banana smoothie or bowl of oatmeal taste like something special.If you love flavor, don't just stop at Burlap & Barrel's cinnamon powder. Every spice they sell is infinitely aromatic.\nPhoto by Emma Fishman, Food Styling by Sue LiAll of Burlap & Barrel’s spices are sourced directly from farms and farm cooperatives, which means better payoffs for producers and fresher, higher-quality spices for me. Because spices start to deteriorate the second they’re ground, a shorter supply-chain—one where the spice company isn’t trading through middlemen—means more potent spices (and less chance of adulteration). While I occasionally experiment with their harder-to-find seasonings, like wild Icelandic kelp and black lime, it’s the everyday spices—smoked paprika, cumin seeds, turmeric, and yes, cinnamon—that have made me realize just how musty my old stash had been. My dinners sing louder and clearer than ever before.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleIn a House of Picky Eaters, These Jarred Sauces Are Always a WinBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-14", "author": ["Condé Nast", "Sarah Jampel"]}