{"id": "5243130c3c0faf40d49a51c61c5528f2", "url": "https://www.bonappetit.com/recipe/lacy-cornmeal-pancakes-with-strawberry-compote", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Lacy Cornmeal Pancakes With Strawberry Compote Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueLacy Cornmeal Pancakes With Strawberry CompoteBy Ashleigh ShantiApril 14, 20203.7(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintWe didn’t think a light and tender 100 percent cornmeal pancake was possible. Until now. This recipe is from chef Ashleigh Shanti at Benne on Eagle in Asheville, NC.Ingredients4 servingsCompote1lb. strawberries, hulled,  halved if large2Tbsp. dark rum (optional)2Tbsp. sugarPancakes and assembly1½cups whole milk4tsp. apple cider vinegar1½cups (225 g) cornmeal¾tsp. baking soda¾tsp. kosher salt2large eggs4Tbsp. unsalted butter, dividedPreparationCompoteStep 1Cook strawberries, rum, sugar, salt, and 2 Tbsp. water (add ¼ cup water if not using rum) in a medium saucepan over medium heat, stirring occasionally, until strawberries are softened and juices have thickened and are syrupy, 20–25 minutes. Let compote cool completely before serving.Step 2Do Ahead: Compote can be made 3 days ahead. Transfer to an airtight container; cover and chill.Pancakes and assemblyStep 3Stir milk and vinegar in a small bowl. Let sit until milk curdles and sours, about 5 minutes.Step 4Meanwhile, whisk cornmeal, baking soda, and salt in a medium bowl.Step 5Whisk eggs into milk mixture, then add to dry ingredients and whisk vigorously to combine.Step 6Melt 1½ tsp. butter in a large nonstick skillet over medium-high. Ladle ⅓ cup batter into skillet. Cook pancake until lacy and browned underneath, about 3 minutes. Flip and cook just until cooked through, about 1 minute. Transfer to a plate (or keep warm on a baking sheet in a 300° oven until ready to serve if desired). Working in 7 more batches, repeat process with remaining butter and batter to make a total of 8 pancakes.Step 7To serve, divide pancakes among plates and spoon compote over.How would you rate Lacy Cornmeal Pancakes With Strawberry Compote?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThis recipe turned out just as expected even using oat milk (which was all I had). I also used a cranberry compote I already had leftover from making cookies, although I would have preferred the strawberry! As many people have said, it's about managing expectations with this recipe. These aren't fluffy sweet pancakes - they're a little bit gritty and not sweet at all (that's the purpose of the compote). The cormeal flavor is fun for a change of pace. They were super easy, so I'd make them again next time I'm looking for something different for breakfast!AshleyPittsburgh, PA12/9/2020I took the recommendations of other reviewers, and substituted buttermilk for the milk/vinegar, and added 1 Tbsp maple syrup and 1 tsp vanilla.  I also whizzed everything in a blender, let everything sit for 10 min before cooking.  This strategy helped to reduce the grittiness, helped the pancakes stay together when cooking.  Mary Pat Selvaggiojohannesburg, south africa 8/16/2020Appreciated the comments that managed expectations of griddle cakes v pancakes. Love the taste and texture. Important to pour the batter thinly, so the cakes are indeed lacy; when we got impatient and tried to make bigger, fatter cakes, they cooked unevenly and came apart. We used 1.5 c buttermilk instead of souring the milk ourselves and it worked fine. Used coarsely ground corn meal. We liked the gritty texture, but others might prefer it with fine ground.Kerry Walsh SkellyMerritt Island, Florida6/21/2020I just made this recipe for the first time and it was a hit! I was a bit wary going into it because of some negative reviews, but I was pleased with the results. A few things: the compote was very sweet, so I'll cut some of the sugar next time (the pancakes were quite good without the compote too). I also replaced about 1/4 cup of the cornmeal with polenta, which added a nice gritty texture. My biggest complaint is the batter. It was a pain to keep together, and I had to whisk it vigorously and scoop the batter for my next pancake very quickly to get enough of the cornmeal in each cake. I think it was worth it though. Lastly, they are definitely more savory than sweet, but I appreciated that. I will absolutely make this again.AnonymousUrbana, IL6/18/2020I’ve made this recipe three times and have loved it every time. The first time I made this I used some store-brand yellow cornmeal. The batter is runny and you have to keep stirring it, but it was still great. The second two times I made this recipe I used masa harina corn meal and found that it made a very thick batter. It was still delicious but I wouldn’t call it at all “lacy” like the batter that uses regular cornmeal. Unlike some of the other reviews, I think the key to this recipe (whether the batter ends up thick or thin) is to add enough butter to the hot pan before cooking each pancake. \n\nThe strawberry compote, in my opinion, is important to balance the savory flavor of the pancakes (though my significant other prefers using maple syrup).AnonymousAtlanta, GA5/31/2020These pancakes were so easy and delicious! Definitely recognized the flavors of black cuisine with the cornmeal and sour milk, reminded me of my Grandma. Make sure to give the batter a stir between batches, and i preffered using a scoop rather than pouring into the pan. goes fantastic with greens, especially the green eggs and ham recipe by molly baz! Pancakes were tender and savoury, great with the compote.AnonymousSt. Louis, Mo5/31/2020I think the problem that people are having with this recipe (what is usually the problem with negative reviews I find) is their expectations of what it is going to taste like based on the name of the recipe. “Pancakes” conjures up light, fluffy, sweet, vanilla-y, so that’s what your brain prepares for.  I honestly think there would be less negative reviews if it were called “Cornmeal Griddle cakes” or something like that. They’re not sweet, and yes, quite eggy- but I had read the reviews before making them and was prepared and adjusted my expectations of what they were going to taste like and I enjoyed them very much! I just happened to make a batch of yogurt overnight so instead of milk & vinegar I used unstrained yogurt. I think the trick is to let the batter sit for 5-10 min to hydrate the cornmeal. Whether you prefer a fluffier pancake or thinner crepe will dictate how you pour the batter into the pan because it is a very liquid batter. I like a thicker cake so all I did was VERY slowly pour the batter into the pan, almost letting it set as I poured. The one other thing I will say is that they do require a good amount of compote, otherwise too savoury. That said I think they would be nice with a savoury topping! Anonymous5/30/2020These weren't my favourite. I do wonder if they might go better with bacon and mushrooms rather than a sweet topping. Overall though, poor texture and taste.raquelxmossNew Zealand5/28/2020I am not usually a big pancake fan but I thought these were delicious. I used some fresh ground cornmeal from my CSA which work really well. I will definitely make these again.AnonymousSacramento CA5/25/2020These turned out fantastic for me! I just made sure to do a quick stir between pours. Only recipe change is that I used bourbon instead of rum in the compote. Super easy to make. Will become a regular for meAnonymousSaint Louis 5/23/2020I liked this recipe! I think some people below had issues because they used coarser cornmeal. I used a medium-fine cornmeal and enjoyed the texture (if your cornmeal is old it could also be more bitter). I did not make the strawberry compote because my partner prefers savory items. I made a quick gravy and sauteed kale with garlic and they were a smash. vchuongApex, NC5/19/2020Awful. I ended up tossing them in the trash. With zero sugar in the thin, gritty batter, they were inedible. AnonymousSeattle5/18/2020I made these with polenta and from reading the other reviews, next time I will use a more finely ground cornmeal. The pancakes were a little crunchy where the cornmeal didn't fully cook. My milk didn't curdle either. However, I liked the flavors a lot, especially with the strawberries, so I will probably give them another try in the future. tracyschifDenver, CO5/10/2020Sorry to see that this didn’t work out for some folks - these were easy and delicious!!! And I used unsweetened oat milk which def didn’t curdle (and I knew that going in) lol. I used frozen dark cherries, honey and spiced rum in my compote (because, you know, you gotta get creative in quarantine). I feel like these pancakes would be delicious with plain Greek yogurt and maybe Andy’s scallion salsa from the May issue?! misscribbsWinnipeg, MB, Canada5/2/2020Okay, so. These worked for me, but I made some modifications based on the reviews. I also think these 100% have to served with a really syrupy compote, to balance out the grittiness. I had no trouble with them setting, and definitely did not find them too eggy.\n\n1) I used Quaker Yellow Corn Meal, which seems to be the right size/coarseness. \n2) 1.5 tsp of butter per pancake is way too much, agree. A teensy pat worked for me. \n3) I used an 8 inch skillet and made these 1 at a time. Dropped the amount of batter to closer to 1/4 cup and rolled the batter to coat the pan, spreading it out as much as possible. The one I made with 1/2 cup of batter was thicker, and honestly had a cornbread-ish texture. Thinner=better. Aim closer to a crepe than a pancake. \n4) I had buttermilk and did not have apple cider vinegar, so just used buttermilk. \n5) I let the batter rest while the compote cooked, and whisked  it up between scooping each pancake, to fight the cornmeal-settling problem mentioned in other reviews. \n\nCompote's good. Some citrus might have made it pop a little more, but it was good. AnonymousChicago5/1/2020Explore Bon AppétitPancakeAmericanSouthernStrawberryBerryFruitCornmealFlourSummerSpringEasyMainGluten-FreeNut-FreeJuneteenthFourth Of JulyMemorial DayLabor DayBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Ashleigh Shanti"]}