{"id": "524601054665068b99b662e7ff56142d", "url": "https://www.bonappetit.com/story/hand-salve", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "This Hand Salve Fixes Everything from Parched Hands to Flyaways | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Salve Fixes Everything from Parched Hands to FlyawaysJust a dab of this hand salve goes a long, looong way.By Amanda ShapiroMarch 6, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I'm not a lotion person, and not just because Silence of the Lambs ruined the word for me forever. Most lotions smell weird, even if they claim to be unscented, and I just don't have the energy to add more steps to my personal-care routine.But despite my strong stance against lotion, I'm not immune to the ravages of winter. And my hands are suffering especially badly now that I'm washing them all. the. time. So I've been keeping a tube of Make Beauty's Marine Salve in my bag instead. It's oil-based and thicker than lotion, so just a dab is enough to coat my parched hands in a protective layer for the rest of the day. (The \"marine\" part of the name refers to an extract of edible marine algae called wakame, a.k.a. Undaria pinnatifida, that supposedly protects against pollution, heavy metals, and free radicals. Great if true...what’s a free radical, again?) I also use it on my chapped lips and the corners of my nose when I've been blowing it a lot. And I rub the salve into my palms and then over my hair to smooth flyaways.A tube will run you $20, but mine has gotten me through two winters so far. It comes in three tinted shades, but I'm wedded to the classic for now. Also, and this I can swear by, it really is unscented.Buy it: MAKE Marine Hand Salve, $20All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItNatural BeautyShoppingRead MoreLifestyleThis French Moisturizer Keeps My Skin Soft All Winter Long By Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-06", "author": ["Condé Nast", "Amanda Shapiro"]}