{"id": "5250c3a415c4b15282b62824671146bd", "url": "https://www.bonappetit.com/story/beach-etiquette-2021", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Is It Ever Okay…to Take Soup to the Beach? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Take Soup to the Beach?Alex Beggs dodged a few seagulls to bring you this month’s edition of Questionable Etiquette.By Alex BeggsJuly 20, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can you suggest some solid to-go snacks I can buy on my way to the beach? —Last-Minute LailaChips and Tostitos salsaPretzels, baby carrots, and hummusBucket of Popeyes, classicTrader Joe’s cold peanut udon noodle saladBag o’ grapesThe biggest sandwiches available in your zip codeHear me out: shrimp cocktailWhat’s a festive all-day-drinking big-batch cocktail? —All-Day AnitaAdapted from a BA recipe I love: In an insulated thermos that’s at least 30 oz., pour in a chilled bottle of still rosé; add ¼ cup vermouth bianco, a sliced cucumber, and basil. Pack a can of San Pellegrino Limonata. At the beach, fill everyone’s cup with ice, ¾ with rosé sangria, and top it off with lemon soda.How do I keep all those seagulls at bay? —Annoyed ApolloIntense, unwavering eye contact. Or bring a toddler.My family would always buy Life Savers so you could pop one in your mouth when you got out of the ocean. What do you consider the best palate cleanser after a salty swim? —Refreshed RheaA single potato chipTrident Watermelon TwistBit o’ turkeyLemon iceMouth-to-mouth from a vaccinated lifeguardIs it possible to pack a charcuterie spread without the cheese getting as sweaty as you? —Meaty MelHere’s what you do: Marinate the salami and Manchego with olive oil, black pepper, Marcona almonds, and lemon zest. The olive oil keeps everything from sweating! Don’t forget the baguette.What’s the best cooler? —Insulated IgnacioForget your overachieving bear-proof cooler. You want a cooler bag, a soft one that doesn’t require pallbearers to carry it a mile to your perfect spot (which is within eyesight of an ice cream truck, out of earshot of neighbors). I have the 24-can-size Sportsman model by AO Coolers. It’s easy to hose out too. Pack your drinks on the bottom, and snacks on top so they don’t freeze.Do I really have to wait 30+ minutes after eating to swim? —Timely TreNO! The risk of getting a cramp from too much salami is low. And even if you do get one while waiting for the ideal bodysurfing wave (we both know you’re out there to pee), the worst that could happen is you’re a bit uncomfortable and probably whiny.What tastes good with a sprinkling of sand? —Speckled SilvaNearly everything! But especially fried oyster po’boys. Because eating food sprinkled with sand is a crunchy reminder that you’re AT THE BEACH, not indoors, wasting away in front of a computer that’s ruining your posture and whittling away your life’s meaning. If you’re trying to avoid a fleck of sand making its way to your mouth, I have a recommendation, but you might not like it. (Soup. It’s soup.)Beach soups??? —Liquid LoriA thousand times yes! A quart of cold soup is the beach food we’ve needed all along. It’s crumb-less, so it won’t attract the gulls. It’s refreshing. It doesn’t bloat you out of your bikini. If you drink it out of a lidded thermos—no sand! Think green gazpacho, chlodnik (Polish beet soup), cucumber yogurt (the beach is your spa), chilled corn chowder, or vichyssoise.Explore Bon AppétitIs It Ever OkayEtiquetteCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-13", "author": ["Condé Nast", "Alex Beggs"]}