{"id": "52673505e6041445f1d8ff726d41f92f", "url": "https://www.bonappetit.com/story/bolognese-sauce", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "It’s Meat Gravy: A No-Nonsense Bolognese Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBA’s Best Bolognese Is a Sunday Gravy for All TimeA no-nonsense meat sauce for no-nonsense people.By Alex BeggsJanuary 7, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailIt’s meat gravy.That was Andy Baraghani’s summary of his new recipe for BA’s best bolognese. Poetic, right? Andy wanted to develop the simplest version of classic bolognese that delivers exactly what it’s supposed to without any unnecessary bells and whistles. “I was inspired by Marcella Hazan, evenings at Via Carota, my desire for an Italian heritage in my youth, Paul Bertolli, Chez Panisse, Chris Morocco…” The resulting recipe is a meat sauce that, after two hours cook time, turns soft, tender, and velvety. No ingredient outshines another. “The sauce should cling on to noodles, draping and coating each strand,” said Andy. Here’s the bolognese breakdown:The meatAt first, Andy tried to convince us that the meat should be hand-chopped skirt steak, painstakingly chopped by you. “Lol no,” was the general feedback. “It’s a more interesting cut of meat,” he pleaded, but that homestead aesthetic was not what we were going for this time, and it certainly wasn’t easier than buying ground chuck. We’re going with ground chuck, plus some pancetta for a fuller, meatier final flavor. The chuck gets browned for a few crucial minutes before the low and slow Sunday sauce simmer begins. A NOTE: If cooked on too high a heat, ground beef will turn into a rubber band. That’s why we keep the heat low, and why it takes so damn long to reach that final velvet state.The tomato pasteNO CANNED TOMATO ZONE. Tomato paste only this time! It adds color, body, and acidity. “Water from canned tomatoes would dilute the flavor and texture,” said Andy. “I don’t want pieces of tomato in my sauce. I want it to be rustica, not fancy.”The milk and chicken stock and wineThose are the only liquids we need. The milk adds more fat content, a.k.a. “richness,” and helps the beef achieve that velvety consistency. The stock rounds out the meat flavor and gives the beef something to cook down in without drying out. The wine adds acidity.The aromatics, featuring carrotsWe pulse the aromatics—carrot, onion, celery—in a food processor until they’re practically the same size as the ground meat. That consistency in size keeps one flavor in the sauce from dominating, and we’re especially looking at you, carrots.The lone bay leafThat mystery aromatic strikes again.The pastaHot take from Andy here. NO DRIED PAPPARDELLE, or other wide noodles, he insisted. He tried several brands, they all broke too often and caused him immense stress. If you can use fresh pappardelle or tagliatelle, rejoice. If you’re using dry pasta, go with rigatoni. It catches the sauce in its ridges and tube better than anything else. (The Test Kitchen stans De Cecco)The attitude“It’s a meat sauce, not a tomato sauce,” Andy reminded me. “People have an idea of what they want bolognese to be, but it’s hard to pinpoint. This recipe is not a restaurant dish. It’s a Sunday sauce. I’m not trying to hurt you. Take a photo, tag me. If you have problems, tag me too.” We’re family now.Get the recipe:BA's Best BologneseIt doesn’t take a lot of ingredients (or a lot of money) to make a classic Bolognese recipe. What it does take, though, is patience!View RecipeExplore Bon AppétitSunday SupperSauceRaguBolognesePastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-07", "author": ["Condé Nast", "Alex Beggs"]}