{"id": "526ae656a29baf354ee7247da2de33c2", "url": "https://www.bonappetit.com/story/what-is-hibiscus", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "What is Hibiscus? For Starters, It's Not Exactly a Flower | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat is Hibiscus? For Starters, It’s Not Exactly a FlowerCome for hibiscus’s deep red color, stay for its tart, floral flavor.By Ozoz SokohMay 14, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailIf you’ve ever had hibiscus tea, you’ve had zobo. In Nigeria, that’s what we call the calyx of the deep red, edible variety of hibiscus, the Hibiscus sabdariffa species. What is hibiscus?Often—and erroneously—described as a flower, the hibiscus we cook with is actually a collection of sepals (known as a calyx), the part of a flowering plant that protects the bud and supports the petal once in bloom. Before the plant flowers, the calyx resembles a pointed bud, holding the seed pod, but it unfurls as the flowers push through the pod.Where does hibiscus come from?Likely native to West Africa, East Africa, Southeast Asia, or Northeastern India, hibiscus goes by many names: bissap in parts of West Africa; karkade in North Africa (specifically in Egypt, Sudan, and South Sudan); rosela, rosella, grosella, and sorrel in Indonesia, Australia, and across the Caribbean and Latin America; mathi puli in Kerala; krachiap in Thailand; luo shen hua in China; and flor de Jamaica in Mexico and across North America.While the deep red variety of hibiscus is the most common across the world, other colors exist, from beige to rose to yellow. One would expect the color differences to produce marked flavor differences, but that isn’t the case. The flavor is similar except that the lighter-colored varieties tend to be tarter and more sour, while the darker variants are fuller and more robust.Hibiscus is the defining ingredient of Jamaican Christmas sorrel punch, where it’s paired with citrus, aromatics, spices, and, occasionally, rum. (The plant used to be available in the Caribbean only during that time of year, though it’s now harvested year-round.)What does hibiscus taste like and what are some common ways to use it?When I think of the flavor of zobo, I think of it as floral, tart, and sour, with notes of forest fruits. While it is edible fresh, it is most common to find it dried. You’ll often see it steeped in water to make tea or cooked into jams and jellies because it’s pectin-rich.For drinks, you can enjoy it plain, sweetened, or unsweetened, or combine it with whole or ground spices (like cloves, cardamom, star anise, cinnamon); aromatics, like fresh or dried ginger; and with fruit juices and alcohol (think sangria). Most people sweeten hibiscus with sugar, honey, dates, fruit, and more. In Nigeria, sliced dried ginger, whole cloves, and fresh pineapple (skin, flesh, and core) are common additions.Add hibiscus to rhubarb compote to double down on the tart, floral flavor and then bake into crumble bars.\nPhoto by Alex LauHow to make my favorite hibiscus drink:To prepare my calyxes for infusions, I first rinse them in a large bowl of cold water, swishing them around as I would with leafy greens, so any bits sink. Don’t let your heart be troubled as you watch the water darkening—the flavor will not be lost. I move them around and then lift them up and out into a container. If they still seem sandy, I’ll repeat this.For my favorite version, I combine 1 cup cold-rinsed dried zobo with 2 liters (about 2 quarts) of water. I like to cold-soak this mixture for at least 2 hours, and as long as overnight, in a nonmetallic container (because hibiscus is high in acidity, it could leach out metallic flavors). The soak deepens the flavor and color. Once that’s done, in a large pot, I combine the hibiscus and the soaking liquid with ½ teaspoon of whole cloves and 3 to 4 slices of dried ginger, common in Nigeria. When I’m out of dried ginger, I substitute with the same amount of fresh ginger, sliced ½-inch thick and bashed/bruised. I bring this to a boil, turn down the heat to simmer, and cook for 30 minutes. I turn it off, remove the calyxes with a slotted spoon, and reserve for another use. I then let the liquid cool to room temperature, after which I decant and bottle it. The infusion keeps in the fridge for a week.I don’t cook my zobo with sugar because it speeds up the fermentation process and shortens its shelf life. Instead, I make a simple syrup—sometimes plain, often with ginger—and store it separately. When I want a drink, I combine both to taste.To extend the deliciousness of an infusion, I’ll transform it into a syrup. I simmer 2 cups of tea with 1 scant cup of sugar, stirring till the sugar dissolves. I bring this to a boil on medium heat and then turn down to simmer for 5 to 8 minutes, till it’s reduced a touch and glossy. It will thicken as it cools. Sometimes I add in the spent calyxes (which I never discard) so they candy. Both the syrup and the candied calyxes make delightful toppings for pancakes, waffles, and ice cream. I’ll also swirl it into water, yogurt, and porridge. Or, I’ll add it to a glass or flute and then top with whatever bubbly I’ve got: sparkling water, prosecco, and Champagne all work.This hibiscus agua fresca has chile, vanilla, and lime juice.\nAlex LauWhat can you do with the soaked hibiscus?Even when I don’t candy the cooked calyxes, I save them—although they’re spent, they’re still full of flavor. Often I’ll chop them up and use them as I would dried fruit, folding into muffin batter, bread dough, and more. Other times I tear them into smaller pieces and add to salads, stir-fries, and sauces, where they deliver a meaty texture. In southwest Nigeria, across Yorubaland, the beige calyxes called ishapa are used in long-simmered stews with nutty ground egusi seeds (of the African bitter melon) and greens.One thing I really enjoy is hibiscus purée. I blend the cooked calyxes with some of the infusion and pass it through a fine-mesh sieve, creating a deep purple-red purée that can also be frozen for up to 3 months. This has new life when it’s added to chutneys—one of my favorite combinations is zobo purée, brandied dry fruit, apples, and green chiles. This zobo pepper sauce tastes like ketchup meets cranberry sauce meets a lick of hot sauce, and it’s perfect with meat, mushrooms, and everything in between.What else can you do with hibiscus?Making hibiscus sugar is one of my favorite things to do with the deep red variety, perfect for gifts all year round. I brush dried calyxes clean and blend equal amounts with granulated white sugar in a spice mill or coffee grinder till the color changes to a light purply-pink. After the calyxes are finely chopped up, you have a lightly floral powdered sugar. I use it as a cinnamon-sugar replacement for tossing with churros and fried dough or whipping into heavy cream. There are no limits to the combinations you can make by adding your favorite spice blends and mixes.I also love to steep-clean calyxes in spirits like rum and coconut liqueur. I add ½ cup dried hibiscus, a couple tablespoons of brown sugar, a 2-inch piece of bruised fresh ginger, and a teaspoon of cloves to 3 cups of spirit. Shake, shake, shake with the lid on and set in a cool, dark place (I love my deep freezer for this). Allow to infuse for a few weeks, shaking every other day or so. Use as you would your favorite spirit.Where can you buy hibiscus?Across North America, you’ll find dried hibiscus in Nigerian, African, Caribbean, Mexican, and Latin American stores or sections by any of its popular names (it’s also available online). Most of the hibiscus available in North America comes from Nigeria and Jamaica. When I buy zobo, I seek out dried calyxes that have bright, uniform color without mold or whitish patches that might indicate damp storage conditions. I also look at the bottom of the bags to ensure there aren’t sandy or stony bits.There you have it, a multitude of things to do with hibiscus from drink to sauce to sugar to much in between. The first step, though, is stocking your pantry. Then decide what and how you want to explore.Explore Bon AppétitHibiscusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-14", "author": ["Condé Nast", "Ozoz Sokoh"]}