{"id": "52740a394d01811808b06684715653ad", "url": "https://www.bonappetit.com/recipe/samosa-tart-with-caramelized-onions-and-fontina", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Samosa Tart With Caramelized Onions and Fontina Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSamosa Tart With Caramelized Onions and FontinaBy Amisha Dodhia GurbaniOctober 14, 20214.8(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintFrom Amisha Dodhia Gurbani's debut cookbook, Mumbai Modern, this tart captures the flavors and flakiness of a samosa with none of the deep-frying, making it a party-ready appetizer that is as crowd-pleasing as it is low-lift. According to her, the Fontina layer is crucial: “Fontina’s a really wonderful cheese and quite underrated, in my opinion—and it goes so well with spicy flavors.” For an even faster turnaround, boil the potatoes the day before and keep them in the refrigerator until you’re ready to build the tart.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidMortar and Pestle$25 At AmazonBlender$32 At AmazonIngredientsChutney1serrano chile or 2 green Thai chiles, seeds removed if desired2garlic cloves2½cups (packed) coarsely chopped cilantro leaves and stems½cup (packed) mint leaves2Tbsp. fresh lemon juice2Tbsp. unsalted dry-roasted peanuts2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2tsp. sugar1tsp. cumin seedsFilling2medium Yukon Gold potatoes (about 12 oz.), scrubbed4Tbsp. vegetable oil, divided1small sweet onion, thinly sliced2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided½tsp. coriander seeds½tsp. fennel seeds1green chile (such as jalapeño or green Thai chile), finely chopped11\" piece ginger, peeled, finely grated½tsp. cumin seeds¼cup thawed frozen peas½tsp. amchur powder½tsp. garam masala½tsp. Kashmiri chile powder1Tbsp. finely chopped cilantro½tsp. fresh lemon juice½tsp. sugarTart and AssemblyAll-purpose flour (for dusting)1sheet frozen puff pastry (one 14-oz. package or half of a 17.3-oz. package), thawed3oz. Fontina cheese, coarsely grated (about ⅓ cup)1Tbsp. heavy cream½tsp. sugar¼cup pomegranate seedsCilantro leaves with tender stems, Cilantro-Mint Chutney (see recipe), and store-bought tamarind-date chutney (for serving)Special EquipmentA spice mill or mortar and pestlePreparationChutneyStep 1Purée chile, garlic, cilantro, mint, lemon juice, peanuts, salt, sugar, cumin seeds, and ¼ cup water in a blender, scraping down sides as needed, until very smooth. Set cilantro-mint chutney aside.Do Ahead: Chutney can be made 1 day ahead. Transfer to a jar; cover and chill.FillingStep 2Pierce potatoes all over with a paring knife and place in a medium saucepan. Pour in cold water to cover by 1\". Bring to a boil and cook until potatoes are fork-tender, 18–20 minutes. Drain and let cool slightly. Rub off skins with paper towels; discard. Cut potatoes into ¼\" pieces.Step 3Meanwhile, heat 2 Tbsp. oil in a large skillet over medium-low. Add onion and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and cook, stirring occasionally, until onion is soft and deeply browned, 10–12 minutes. Transfer to a bowl; reserve skillet.Step 4Coarsely grind coriander seeds and fennel seeds in spice mill or mortar and pestle.Step 5Heat remaining 2 Tbsp. oil in reserved skillet over medium. Add green chile, ginger, cumin seeds, and ground fennel and coriander. Cook, stirring, until fragrant, about 1 minute. Stir in potatoes and peas until well combined; cook 1 minute. Stir in amchur powder, garam masala, chile powder, and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and cook, stirring occasionally, 2 minutes. Stir in cilantro, lemon juice, and sugar and cook, still stirring, another 2 minutes. Remove from heat.Tart and AssemblyStep 6Unfold puff pastry on a lightly floured surface and roll out to a 9½\"–10\" square. Transfer to a parchment-lined rimmed baking sheet.Step 7Spread onion over pastry, leaving a 1\" border. Scatter Fontina over onion and press lightly with a spatula. Top with potato mixture; press to flatten.Step 8Whisk together cream and sugar in a small bowl. Brush edges of tart with cream mixture. Freeze tart until pastry is firm, about 10 minutes.Step 9Place a rack in middle of oven; preheat to 400°. Bake tart until crust is golden brown, 35–40 minutes. Let cool 10–15 minutes, then cut into squares.Step 10To serve, scatter pomegranate seeds and cilantro over tart. Drizzle tamarind-date chutney and reserved cilantro-mint chutney on top and/or serve alongside.Do ahead: Tart can be assembled 1 day ahead. Wrap in plastic and freeze. Thaw 1 hour in fridge before baking.Excerpted from ‘Mumbai Modern: Vegetarian Recipes Inspired by Indian Roots and California Cuisine.’ Copyright 2021 Amisha Dodhia Gurbani. Reproduced by permission of the Countryman Press, a division of W.W. Norton & Company. All Rights Reserved.\n\nBuy it on Amazon.com or Bookshop.orgHow would you rate Samosa Tart With Caramelized Onions and Fontina?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSo delicious - will definitely make again! We already had both chutneys on hand (thank you, freezer!), so it cut back on the prep time a bit. Made this as a light dinner after a large Diwali lunch, and it was a hit. Next time I'd double the onions and maybe even leave out the cheese. Anonymous11/8/2021This is freaking genius! Side of tamarind chutney goes a long way! Nitya San Jose, CA10/31/2021Don’t sleep on the chutney, it’s needed for acid and balance. Would def prep some day before next time but absolutely worth making again. I upped the amounts on everything by a “pinch, handful” and used a whole Dufour puff pastry rolled out to almost a cookie sheet size to make it an entire meal with some roasted veggies. Served with some mango chutney. Delicious Amanda Owen10/31/2021Fun, beautiful and delicious! Skipped the freezer time and still turned out amazing. Will make this again and again!  Perfect for parties! B CodyAustin, Tx10/28/2021Made this over the course of two days, and man is it a lot of steps, but the result is very tasty. Sped things up by peeling and chopping the potatoes before boiling (prepped them the day before), making the cilantro chutney the day before, and caramelizing the onions the day before. One note: this recipe, along with almost every recipe on the internet, is LYING when they tell you that you can caramelize onions in ten minutes. Properly caramelized onions take at least an hour! I caramelized mine the day before making the tart along with caramelized onions for another recipe, all while I was waiting for bread to rise and also boiling the potatoes. I think that regular sauteed onions would be just fine here, though. Followed instructions for assembly and serving pretty carefully, though I used a spicy pepper fontina and omitted the date chutney. Served alongside an Indian cucumber salad and some dal, it was perfect for four people and got devoured in ten minutes. Melodie RoschmanDenver, CO10/24/2021Omg this recipe takes forever!!! Almost 4 hours, from prep to plate. For a small appetizer type dish this is way too long, in my opinion- no matter how delicious. I most likely won’t make this again because of the time issue.Tess Palma-MartinezLos Angeles10/22/2021Explore Bon AppétitIndianSouth AsianAsianPotatoVegetablePuff Pastry DoughappetizerCilantroHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Amisha Dodhia Gurbani"]}