{"id": "527428230043e2017bf255b315fe5bd3", "url": "https://www.bonappetit.com/story/stackable-wine-glasses", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Stackable Wine Glasses Mean You’ll Never Serve Zweigelt in a Jam Jar Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStackable Wine Glasses Mean You’ll Never Serve Zweigelt in a Jam Jar AgainWho has room for a set of 12 wine glasses? You do.By MacKenzie Chung FeganDecember 17, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There was a time when I hosted, I say like an elegant octogenarian, gathering my grandchildren around me by the fire. I’d have friends over for sit-down coursed dinners, raucous weekend house parties, and everything in between. Wine would flow. There was only one problem: No one living in a New York City apartment has room for more than eight wine glasses. Where would I keep all that extra stemware? My Regency-era china cabinet, next to luncheon plates and a soup tureen? And so the first guests to arrive (or the ones I thought least likely to break my Schott Zwiesels) would receive grown-up wine glasses, and the rest would get whatever was available—tumblers if they were lucky, chipped coffee mugs if they weren’t.By the grace of Anthony Fauci, I will host again in 2021, and this time, I’m prepared. These Bormioli Rocco wine glasses have a ’70s Italian modern vibe that makes me want to sip Franciacorta in my sunken living room. Chunky with vertical sides offset by rounded curves, they call to mind Massimo Vignelli’s iconic Heller dinnerware except they’re made of hefty tempered glass. I own a set of the somewhat coupe-shaped 8-ounce glasses—technically dessert glasses, according to the manufacturer—which are perfect for effervescent pét-nats and olive-garnished spritzes. If you’re looking for something more the size of traditional stemware, they also come in 9.5- and 11.75-ounce versions. They’re remarkably sturdy, so I can throw them in the dishwasher or hand one to my clumsiest friend (you know who you are) without fear of chipped rims or snapped stems.But the best part about these glasses is that they stack, and not in the way that my mismatched Tupperware kind-of-not-really fits together. These glasses nest snugly so you can carry four at a time without fear of them toppling over, and when they’re not in use—which is often these days—they take up minimal real estate on my kitchen shelf, one on top of the other like a tower of acrobats.At six bucks a pop, they’re affordable enough that I’m considering buying another set to keep stacked in deep storage in the corner of a closet until they’re needed. As soon as I’m able to safely gather my loved ones around me, you can be sure there will be a bacchanalian party—and this time everyone will have a proper wine glass.Photo by Emma FishmanSet of 6 Stackable Wine Glasses$39 at Food52Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-17", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}