{"id": "5277e1b176a5036793f97a75068b4006", "url": "https://www.bonappetit.com/story/september-cooking-season", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "It’s Time to Get Back to the Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt’s Time to Get Back to the KitchenCooking Season has arrived.By Adam RapoportSeptember 3, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.By the time you’re reading this, Labor Day weekend will have sputtered to a close, and I’ll have hit Full Tomato. Absolute Corn, too. Basil, see you next year.Whether or not fall is actually in the air, I’m ready to flip the page on the calendar. Spareribs on the grill give way to short ribs in the oven. Sun Gold–tomato spaghetti segues into creamy mushroom pasta.At some point I’ll inevitably pester my wife, Simone, about whether we can plan some sort of dinner party. “I feel like we haven’t had anyone over in ages!” Because to me this time of year means the return of Cooking Season—back to work, back to school, back to the kitchen.That’s the ethos behind our September issue out now. We’re sharing the kinds of recipes, game plans, and let’s-do-this-thing! inspiration that will carry you through to the holidays. We’ve moved the Hot 10, our celebration of America’s Best New Restaurants, to the October issue, at which point you’ll have spent so much time braising and roasting and chopping and mincing that you’ll need a night out, yes?Want this letter before it hits the website? Sign up for our newsletter!If this creamy mushroom pasta isn’t the picture of fall, I don’t know what is.\nPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonBut for now, how about you step away from the grill and get reacquainted with your oven—you know, that box that makes big hunks of meat and pulled-from-the-earth root vegetables all glazy and caramelized and impossibly fragrant? It’s what Alison Roman turns to so deftly in her Steak House Night in America feature. Having attended a party a few years back in which Alison smoked out an entire apartment while individually searing off a half dozen dry-aged rib eyes, I’m glad she’s finally heeding the common-sense cooking advice that so many of us resist—to make it easy on yourself while still making it delicious. In this case, she lets the oven go to work on a prime rib roast and a gang of baked potatoes, while a serve-yourself martini bar keeps her guests more than occupied.Our Fall Playbook answers all manner of other pressing concerns, like what to do when it’s 6:26 p.m. on a Monday and you still don’t know what’s for dinner. And have you seen Carla Lalli Music’s beautiful galettes? She argues that you should take advantage of all that ripe end-of-summer fruit to make the tastiest, most forgiving home-baked dessert there is.All told, these are the recipes and strategies that will make you forget all about your swimsuit and your long, lazy weekends. Because, really, starting right now, it’s the best time of year. It’s Cooking Season.Get the recipes:Braised Short Ribs With Squash and ChileMake this smoky-spicy braise when it’s Sunday and you’ve got big plans to never leave the house.View Recipe Creamy Pasta with Crispy MushroomsMushrooms just need a quick sear in a hot pan before being tossed in this creamy (easy!) pasta sauce.View Recipe Low-and-Slow Rib RoastThis totally make-ahead rib roast is rubbed with a punchy mixture of rosemary, anchovies, and garlic.View Recipe Baked Potatoes DeluxeThese are impossibly fluffy on the inside and shatteringly crispy on the outside.View Recipe Martini BarBecause you don’t individually stir these ‘tinis for a crowd, water is added to aid in the dilution you’d normally get from ice. You can thank us later.View Recipe Peach-Plum GaletteYou can use any combo of stone fruit in this galette, so dream big! Apricots and cherries would be divine. Peaches and nectarines make good friends…View RecipeExplore Bon AppétitAdam NewsletterFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-03", "author": ["Condé Nast", "Adam Rapoport"]}