{"id": "52974c509e8d4c6bd0ada532ac6e25c2", "url": "https://www.bonappetit.com/recipe/peanut-butter-noodles-with-cucumbers", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Peanut Butter Noodles With Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssuePeanut Butter Noodles With CucumbersBy Hetty McKinnonFebruary 9, 20214.3(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintCookbook author Hetty McKinnon leans on working-from-home lunches like this one because it requires two ingredients she always, always has: peanut butter and dried noodles. “Lunch tends to be the trickiest meal of the day as it needs to be flexible enough to cater to my family’s five different lunch breaks,” McKinnon says. “Dishes that can easily be fortified with vegetables earn extra points. These nutritious and satisfying noodles feature two things we always have in the pantry: peanut butter and some kind of dried noodle. Because this dish is just as good cold, family members can toss together their own bowl whenever they catch a break from school or work.” Store the cooked noodles, sauce, and toppings separately and have everyone mix up their own bowl when they’re ready to eat.Ingredients4 Servings12oz. dried wheat noodles (such as thin udon)Kosher salt½cup chunky or creamy peanut butter2Tbsp. unseasoned rice vinegar4tsp. pure maple syrup or honey1tsp. soy sauce1small garlic clove, finely gratedFreshly ground black pepper4small Persian cucumbers, thinly sliced2scallions, finely chopped⅓cup salted roasted peanuts, coarsely choppedRaw sesame oil or chili oil (for serving)PreparationStep 1Cook noodles in a large pot of boiling salted water until tender. Drain and rinse under cold running water; set aside.Step 2Whisk peanut butter, vinegar, maple syrup, soy sauce, garlic, and ¼ cup warm water in a large bowl until smooth. Dressing should be the consistency of heavy cream; if too thick, add a little more water as needed. Season with salt and pepper. If noodles are sticking together, rinse briefly to separate; drain well. Transfer to bowl with dressing; toss to coat. Add cucumbers and scallions and season well with salt and pepper.Step 3Divide noodles among bowls; top with peanuts and drizzle with oil.How would you rate Peanut Butter Noodles With Cucumbers?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI was first drawn to this recipe since it is vegan.  Turned out to really like the flavor and it was very easy to make.  I have to figure out what I did wrong with the peanut butter because it was mostly a glob versus a sauce, but still tasted really good!AnonymousArlington Heights, IL9/11/2021I'm a huge Hetty fan, but this recipe is very unbalanced, leaning way too hard on the pb. I added a ton of chill oil, black vinegar, and cilantro but it was still too heavy/too pb-esque. Anonymous8/3/2021Pro tip: Top this with the Trader Joe's Chili Onion Crunch and it is perfection. AnonymousBoston, MA3/25/2021A solid base for playing around. I used spicy PB, without which I wouldn't have enjoyed the recipe so much. After adding the right amount of warm water, the sauce was great, but too thick. I thinned it out to the heavy cream consistency, but then it was watered down too much - won't make that mistake again. A squeeze of lime juice brightened it up, tooAnnamarieCalifornia3/17/2021I've lived in three Asian countries, and some version of this dish was always available somewhere. I've been back in the States for over a decade now, and for the sake of nostalgia, I thought I'd give this recipe a try. I'm really glad I did. Not only is it extremely easy to put together, it was truly delicious. I'm surprised other reviewers thought it lacked flavor. I think it's the best version of the dish I have ever tasted. Given how easy it is to prepare, I stuck this one in my recipe drawer. I'll have it again soon.Johnny BellrockSedona, AZ3/16/2021Sauce as-written turns into slightly seasoned peanut butter. Definitely needs more soy sauce, sweetener, and rice vinegar than what is listed. Also found the sauce quite thick so I thinned it with some warm pasta water, which worked well. I used cilantro instead of scallions for the topping , which was also good.AnonymousAtlanta3/8/2021Marlene: If you splashed on the chili oil at the table, you should get the red and liquidy look that you see in the picture. Sounds like you mixed in the chili oil instead? I do agree the sauce has a strong PB flavor, but I enjoyed that , especially when serving the dish at slightly below room temp (ie, out of the frig for about 15 mins before eating).Dan WConnecticut2/27/2021I was disappointed in this recipe. The sauce just tasted like peanut butter. I added more vinegar, garlic, soy sauce and chili oil.  The photo shows liquid in the bottom of the plate. The peanut sauce is thick and there was no liquid at all.  That's not a bad thing, but the sauce in the shot is red and liquidy where the sauce in real life is peanut butter colored ant thick.  Marlene's CuisineSan Francisco2/24/2021Pretty simple to make with great flavor payoff! Chicken goes really well with this dish - I crisped up some leftover Nashville Hot Chicken (another bomb BA recipe) and added it to the noodles. Didn’t need the extra salt when there’s already soy sauce and peanut butter in the sauce. Squeezing on some lime juice at the end really brightened up the dish.GeorgieBoston, MA2/20/2021I, too, would like to hear more from Biggie Philz - can you make this happen, BA? And hope life is good now, Biggie! \n\nSVSLondon, UK2/19/2021BA needs to find Biggie Philz and have them share their expertise in working with what you got! I hope you're doing well Biggie Philz!skBrooklyn, NY2/19/2021Love this and make it frequently with whatever I have on hand (bell peppers, carrots, leftover chicken or pork, etc).  I usually substitute tahini for peanut butter, though, as my daughter has a peanut allergyTheresaKansas City, Missouri 2/18/2021I cant wait to try this. We actually did something similar when I was in prison. When youre stuck with only items that can be bought on commissary (think off brand dollar store, prepackaged foods that archeologists will undoubtedly find, intact and edible in 1000 years) things are tricky so I used Ramen noodles, peanut butter, hot sauce. Sometimes with tuna and always crushed up cheetos and it was not bad. So I KNOW this dish using real ingredients will be awesome!Biggy PhilzFort Worth TX2/18/2021The website is difficult to navigate. I cannot find the recipe for Peanut Noodles.\n\n\\Victoria LeeLa Quinta, Ca2/17/2021Simple and quick to put together.  I went with 2 cloves of garlic, and wow! what a punch, but in a good way.  Let it sit and have the flavours meld at least a day.  I might add chicken to my portion for lunch.AnnOmaha, NE2/15/2021Explore Bon AppétitUdon NoodleNoodlePasta & NoodlesPeanut ButterCondiments, Sauces & PastesQuickEasyWeeknight MealsOne-Pot MealsMainVegetarianVeganDairy-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Hetty Mckinnon"]}