{"id": "5299c1602af2c831cab9d3090e61f016", "url": "https://www.bonappetit.com/story/torn-greens", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "How to Eat More Vegetables? Tear Up Some Greens  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen I Don't Have Time to Meal Prep, I Do This InsteadIt's the easiest way to up your intake of leafy greens.By Meryl RothsteinJanuary 7, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen I’m at my most organized, I meal plan. When I’m not, I tear greens. If I have a bag of washed, torn, ready-to-eat greens in my fridge, I can probably cobble together dinner even when I haven’t planned it in advance or bought much in the way of groceries. Unwashed, untorn greens sit in my crisper as though they require a password that I’ve long forgotten to access them. But I dole out washed, torn greens like Oprah gives out cars.I can have fried eggs with greens sautéed in chili flakes. I can have pasta with so many greens it feels virtuous. I can make a simple salad alongside a can of good tuna. A simple salad with dumplings from the freezer. A simple salad with the piece of fish I bought in a five-minute market trip on the way home from work. I couldn’t do any of that on the fly without torn greens.Which is why every time I grocery shop, I buy a bunch of sturdy greens—kale and collards are particularly long-lasting. I sit down on the couch when I get home, turn on an episode of Veep (I know I’m many years late on this), and tear them up. I wash them in a salad spinner, let them air dry (since I can never get them dry dry in the spinner), then stick them in a ziptop bag in the fridge. They’re available whenever I need them, so I’m almost always part way to dinner.This also means I eat approximately 90 percent more greens. I’ll fold them into a larb or throw them into a frittata that might otherwise lack veg while yelling “You get some greens!” in my best Oprah voice as I go.Wrap those greens around some spicy curried tofu:Curried Tofu WrapsIf the cooked tofu isn’t as hot as you’d hoped, amp it up by tucking a slice or two of Fresno chile into your wrap.View RecipeExplore Bon AppétitHealthyHealthyishLeafy GreensCollard GreensKaleMeal PrepRead MoreLifestyleThese Vejibags Are Keeping My Greens So Fresh It's ScaryBy Oset BaburRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-07", "author": ["Condé Nast", "Meryl Rothstein"]}