{"id": "52a55e9d9cb60f053818f14a8f84621f", "url": "https://www.bonappetit.com/recipe/custard-tart-with-cream-and-fresh-fruit", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Custard Tart with Cream and Fruit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueCustard Tart with Cream and Fresh FruitBy Claire SaffitzAugust 14, 20184.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintIf eggy flan-like desserts are your thing, you are going to love this crustless vanilla-infused tart. Pastry cream is made by cooking eggs, dairy, sugar, and a thickener. To avoid scrambling the eggs, many recipes employ a technique called tempering, in which you add a bit of hot dairy to the eggs to gradually bring up the temperature. For this tart recipe, we wanted to know what would happen if we nixed tempering (and the extra bowl and ladle) and instead slowly brought up all the ingredients together. The result: a smooth pastry cream with a bit less fuss—and a lot less mess.Ingredients8 servings Unsalted butter, room temperature (for pan)¾cup plus 2 Tbsp. sugar; plus more for pan8large egg yolks2large eggs⅔cup cornstarch½tsp. kosher salt3cups whole milk1½cups chilled heavy cream, divided1vanilla bean, split lengthwise, or 1½ tsp. vanilla extract or paste1lb. stone fruit, cut into wedges, blueberries and/or blackberriesPreparationStep 1Butter a 9\"-diameter cake pan. Line bottom with a round of parchment paper; smooth out. Coat sides with sugar, tapping out excess. Gently whisk egg yolks, eggs, cornstarch, salt, and ¾ cup sugar in a large saucepan until smooth, then whisk vigorously until lightened in color, 1–2 minutes. Whisking constantly, gradually stream in milk, followed by 1 cup cream; scrape sides of pan. Scrape in vanilla seeds; discard pod. Cook mixture over medium heat, whisking constantly, until it starts to thicken, then whisk vigorously until it holds marks of whisk, 6–10 minutes. Immediately remove custard from heat (do not let boil); let cool slightly.Step 2Using a rubber spatula, press custard through a fine-mesh sieve into prepared pan. Chill, uncovered, 20 minutes (it should be warm but not hot). Place a rack in middle of oven and preheat to 400°.Step 3Bake custard until top is deeply browned in spots, 40–50 minutes (it will still be wobbly in the center). Let cool.Step 4Toss fruit with remaining 2 Tbsp. sugar in a medium bowl. Let sit 15 minutes.Step 5Slide a knife around sides of custard to loosen and place a plate upside down over custard; invert onto plate. Peel away parchment and invert again onto another plate. Whisk remaining ½ cup cream in a medium bowl until soft peaks form. Serve slices of custard topped with fruit and whipped cream.Step 6Do Ahead: Custard can be baked 1 day ahead. Cover and chill.How would you rate Custard Tart with Cream and Fresh Fruit?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI liked this recipe a lot! I’m not much of a baker at all so I enjoyed taking this one on as a challenge. Lots of whisking as the other commenter said but it was doable for me without an electric mixer. My tart did not come out nearly as beautiful as the one in the photo — mine was much paler (I left it in the oven longer to see if it would darken, with no luck) and not glossy at all. I ended up styling the fruit on top of the whole tart to disguise it. But it tastes great and custardy. I would make this again!GracegraceNew York9/8/2018In answer to the previous question - no, you're not crazy! - it looks like a crust.  But, I made this and found that it just bakes that way.  I followed the recipe and it also appeared to have a crust.  \nI don't think I'll try this again.  It was ok but more trouble than it was worth.  It involves a LOT of whisking; more than I could do.  I used my hand mixer for the last 5 minutes or so.  That may have made it denser than it should have been.  I found it took some work to push it through the sieve. The flavor was good, but I was hoping for something a little more custard-y.\nAnonymousBainbridge Island9/6/2018The photos in the printed Sept issue of BA this definitely looks like it has a crust... as do these photos. Am I crazy?? Anonymous8/25/2018Explore Bon AppétitTartDessertAmericanVanillaHerbs & SpicesSummerBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}