{"id": "52ab9ea5a4502466fe9f73ed5ca10dc2", "url": "https://www.bonappetit.com/story/cyber-monday-deals", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "The Best Cyber Monday Cookware & Kitchen Deals (2021) to Shop Right Now: Amazon, Our Place, Target, and More  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Cyber Monday Cookware and Kitchen Deals to Shop Right NowFrom stainless-steel cookware to stand mixers and air fryers, these are the best kitchen deals we’re shopping this Cyber Monday.By MacKenzie Chung FeganNovember 29, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The best Cyber Monday cookware deals are live right now, ready to be snapped up by intrepid shoppers who have been waiting for months to pull the trigger on those Le Creusets, Our Place Always Pans, and All-Clad sets. If you are one of those deal hounds, get ready to gloat—there are some incredible prices on air fryers, KitchenAid stand mixers, and other kitchen appliances in addition to pots and pans galore. These are the best kitchen deals we’ve seen all year, and with very real supply chain issues and shipping delays, don’t wait to snap them up. Below you’ll find a curated selection of retailers we love whose Cyber Monday sales are in full swing. Happy shopping!MisenIt’s all gravy over at DTC cookware company Misen, where you can get 25% off almost the entire site with the code GRAVYTRAIN25. Spend $150 or more, and they'll throw in a free paring knife. Their 7-quart Dutch oven—one of our favorites—is already reasonably priced at $165, so this is a great deal for a quality piece of cookware.Misen 7 Quart Dutch Oven$165 at MisenAnd grab some knives while you’re at it. Misen’s serrated knife makes our list of best bread knives, and their steak knives or three-piece knife set (you only need three) are extremely giftable.Misen Serrated Knife$70 at MisenTargetThe discounts on KitchenAid stand mixers are some of the best Cyber Monday appliance deals out there, in my book. Check out our dedicated KitchenAid sale post to find the mixer that's right for you, like this 5-quart Professional Series stand mixer on sale at Target.KitchenAid Professional 5-Qt. Stand Mixer$430 $294 at Target$500 $250 at Best BuyTarget’s also got your best deals on Instant Pots, Crockpots, all the pots. Save 54% on this nine-functions-in-one 6-quart Instant Pot and get to braising with this 7-quart slow cooker from Crockpot—only $30 during this Black Friday sale.Courtesy of Instant PotInstant Pot 6-Quart 9-in-1 Pressure Cooker$130 $60 at TargetThe entire CRUXGG range is 20% off at Target for Cyber Monday. (This is culinary collective Ghetto Gastro’s line of kitchen appliances, all of which look like futuristic, sentient robots.) We like the 2-slice toaster and air fryer, which isn’t not Robocop. As always with CRUXGG, 5% of profits go to organizations tackling food insecurity.CRUXGG 2 Slice Toaster$45 $36 at TargetFly by JingYou’ll find deals all over Fly by Jing’s site, from 20% off their iconic chili crisp to 40% off the Sichuan salsero set, which we featured in our round-up of the best gifts for food people (have you checked it out yet?). Know what’s going to get you through winter? Dumplings.Fly By Jing Sichuan Chile Crisp$15 $12 at Fly By JingSur La TableIt’s a Dutch oven bonanza! This 8-quart oval Le Creuset is a whopping $140 off, and Staub’s 7-quart round cocottes are on deep discount as well. That pork shoulder isn’t going to braise itself.Staub 7-Qt. Cocotte$557 $290 at Sur La TableIf you’re in the market for an espresso machine, now’s the time to buy. The De’Longhi La Specialista Presitigio is over $400 off. You’ll also find deals on the Fellow gooseneck electric kettle, the Vitamix E310 Explorian blender, and our favorite sous vide machine, the Joule by Breville.Vitamix E310 Explorian Blender, 48 oz. Container$350 at Amazon$450 $350 at Sur La TableOmsomProud, loud Asian cooking at 20% off. The sitewide discount will be applied at checkout, and orders over $35 ship free. We love these sauce and seasoning packets, which help you get favorites like Filipino sisig and Korean bulgogi on the table in no time at all.Photo by Mischelle MoySoutheast Asian Omsom Sampler$29 at OmsomAmazonSaving galore over at Amazon on items big (save 25% on Roombas) and small (can you ever have too many Stasher bags?). There are too many deals to do justice here, so head on over to our separate round-up of Amazon Cyber Monday kitchen deals and go nuts.GE Profile Opal Nugget Ice Maker$529 $499 at AmazonPhoto by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)Our PlaceThe ubiquitous Always Pan is on sale for under $100, or save $40 on the Our Place Perfect Pot (read our full review here).Our Place Perfect Pot$165 at Our PlaceBUT WAIT THERE’S MORE! This hefty walnut cutting board comes with a juice trench and is almost 50% off—a good deal on a piece that can be used for kitchen prep or serving.Photo by David Kitz/courtesy Our PlaceOur Place Walnut Cutting Board$95 at Our PlaceI’d also recommend picking up a set or two of these versatile drinking glasses, which are 20% off and come in a range of 70’s-cool colors. I use them for ice cream and other desserts as well as water.Jason WoolwayOur Place Drinking Glasses, Set of 4$50 at Our PlaceHausTake 20% off all apéritifs at Haus, including full-sized bottles of their new pomegranate rosemary flavor (festive!) and their customizable sampler kit, which comes with four 200 mL bottles (gifty!).Haus Pomegranate Rosemary Apéritif$40 $32 at HausBed Bath & BeyondSave $75 on the Solo Stove Bonfire, a near-smokeless backyard fire pit perfect for outdoor entertaining and marshmallow roasting.Photo courtesy Solo StoveSolo Stove Bonfire Fire Pit$300 $255 at Bed Bath & BeyondWin the cookie swap this year with these fudgy meringue cookies and a KitchenAid cordless hand mixer, now 30% off. It's our favorite handheld model. And yes, you need a cooling rack. This one from OXO is 20% off.Photo by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksKitchenAid Cordless Hand Mixer$100 $70 at Amazon$100 $70 at Bed Bath & BeyondAtlas Coffee ClubSave up to $55 on coffee gift subscriptions over at Atlas Coffee Club, one of BA’s favorite coffee subscription services. Or sign up for a subscription box yourself and get your first bag free.Atlas Coffee Club SubscriptionShop Now at Atlas Coffee ClubNordstromAnother excellent deal on an excellent cutting board: the Five Two by Food52 bamboo board is on sale for $40. What sets this product apart is a little notch for your phone, so you can consult your recipe or FaceTime your umma while chopping carrots.Five Two Bamboo Cutting Board$59 $41 at NordstromNordstrom has some molten-hot Cyber Monday cookware deals as well. This 10-piece stainless steel All-Clad set is 46% off—take care of it, and it’ll take care of you. And if you’ve always felt lukewarm about leaving a clunky plastic water carbonator out on your counter, Aarke’s sparkling water maker—designed in Sweden, of course—is a sleek, high-end alternative. It’s 25% off at Nordstrom as well as at Bed Bath & Beyond and Amazon.Photo courtesy of NordstromAarke Sparkling Water Maker$249 $164 at Nordstrom$219 $164 at AmazonLe CreusetTake $140 off Le Creuset's Classic Oval Dutch Oven or—if you're tired of your banged up, mismatched cookware—over 25% off the 5-Piece Signature Set, which comes with a Dutch oven, saucepan, and 9-inch skillet. Amazon also has a choice Le Creuset Cyber Monday deal: Take 20% off any three products from this list, which includes grill pans, cast-iron skillets, and Dutch ovens of all shapes, sizes, and colors.Le Creuset Classic Oval Dutch Oven$350 $210 at Le CreusetZwillingSave on knives (like this chef's knife, which is over 50% off) as well as on Staub Dutch ovens (score a 4-quart cocotte for under $200) and the Zwilling Fresh & Save vacuum sealer starter set. This food storage system comes with six reusable containers and a handheld vacuum pump so that your leftovers stay fresher for longer. You'll never toss a brown avocado half again.ZWILLING J.A. Henckels,LLCZwilling Fresh & Save$80 at Amazon – 6 Piece Set$125 $100 at Zwilling – 7 Piece SetBioLiteOutdoor entertaining was the only type of entertaining I did last year, and the BioLite FirePit+ made wintery evenings in the backyard not only bearable but downright cozy. Right now you can save almost $100 on the FirePit Cooking Bundle, which includes the wood and charcoal-burning FirePit+, a cast-iron griddle, a grill lid, and a set of grilling utensils.FirePit Cooking Kit$400 $300 at BioLite EnergyWe also like their USB-rechargeable headlamps—an essential tool for evening grilling—and BioLite AlpenGlow500 USB lanterns, which are 20% off. They’re rechargeable, can be left out in the rain, and have a range of settings from “flickering candle” to full-on color-changing light show.BioLite AlpenGlow Lantern$60 $45 at BioLiteHiveHive is one of our favorite online grocery stores for sustainable products with a social good component; they make discovering great new brands easy. Use code HOLIDAY for 15% off your purchase of $75, 20% off $100, and 25% off $125 or more. I’d recommend meeting that minimum spend by stocking up on Big Spoon Roasters nut butter and these reusable vegetable preservation bags.Vejibag Vegetable Preservation Bag$23 at HiveThermoworksHow’d your turkey turn out? If the answer is “could have been better,” consider grabbing a meat and oven thermometer from Thermoworks. The Thermapen One—lightning fast, frighteningly accurate—is over $20 off, and the DOT probe-style alarm thermometer will ensure your oven stays honest.Thermoworks Thermapen ONE$105 at ThermoWorksDysonSave up to $120 on Dyson cordless stick vacuums (as essential a kitchen tool as a microplane) like the lightweight V8 Absolute and the Cyclone V10 Animal, which is great for houses with pets.SHOP DYSONBamboozleSpecial for the holidays, Bamboozle is offering their 7-piece mixing bowl set as a bundle with their measuring cups and spoons for $86. Considering that just the bowls alone usually retail for $80, that’s some value right there. Best of all, everything is made of biodegradable bamboo fiber.Bamboozle Baking Bundle$86 at BamboozleHestanGet. Those. Pans. Specifically Chris Morocco’s favorite Hestan NanoBond Titanium Essential Pan at the lowest price we’ve seen. (You can also find it on sale at Amazon.) It’s also worth checking out their new Insignia cookware line, a collaboration with Thomas Keller. The universal lid is a terrific gift for someone with limited kitchen space.Photo by Emma FishmanHestan 3.5 qt. Sauté Pan$300 $264 at Hestan$330 $264 at AmazonGraf LantzTake 30% off almost everything at this felted Merino wool emporium including sets of four round or square coasters, which we love for their wicking properties and sophisticated colorways. Snag some trivets for holiday oven-to-table serving as well.4-Pack of Merino Wool Felt Coasters$24 at Graf LantzMysa WineScore 30% off the first month of Mysa’s Natural Wine Club using code BLACKFRIDAY—that’s six bottles of low intervention wine from small producers for $105. This is one-stop holiday shopping, in my book.Photo by @hellopiacereMYSA Natural Wine Club Subscription$150 $105 at MYSA WinesBokksuPair that wine subscription with a Japanese snack box subscription from Bokksu. For Cyber Monday, take $20 off your first box using code BF2021. If you prefer your snacks à la carte, Bokksu Market is offering e-gift cards toward future purchases with a minimum spend. I personally would be stoked to find this Japanese Kit Kat sampler box—which features flavors like sake, wasabi, and purple yam—under the tree.Photo by Emma FishmanBokksu Japanese Snack BoxShop Now at BokksuMaterialSave up to 20% at Material, where you’ll have the option to donate some or all of your discount to Star Route Farm’s food access program. I have my eye on this serving bowl, a limited-edition collaboration with Soil Baker (this collection is among our favorite ceramic dinner sets).The Open Bowl (2-Pack)$80 at Material KitchenIf you’re interested in upgrading your knife storage situation, Material’s The Stand is a minimalist statement piece that will ensure your blades don’t get worn down sliding in and out of a knife block. Pick up a recycled cutting board in a bold hue while you’re at it.Material reBoard Cutting Board$35 at MaterialSpice HouseSave 15% on all spice gift boxes with the code CYBERGIFT. The 4-jar Baker's Collection would be a welcome pantry addition for anyone tackling gingerbread or cinnamon buns this December.SHOP SPICE HOUSEFood52Spend $100 today and take 20% off using the code CHEERS20. Or go in on a joint order with your sister and take 30% off orders of $400 or more with the code CHEERS30. Snag some of these rechargeable USB lighters and let this be the last Hanukkah where you're hunting for a working butane lighter.Photography by Isa Zapata.  Prop Styling by Paige HicksUSB Rechargeable Lighter$32 at Food52$30 at The GrommetOr make someone's Christmas with this delightful French ceramic produce bowl. The bottom compartment is ideal for onions, garlic, or root veggies, and the cork topper has anti-fungal properties and repels fruit flies.Photo by Rocky Luten/Food52Emile Henry Ceramic Storage Bowl$140 at Food52SpicewallaEverything is 20% off over at Spicewalla, including their Kitchen Essentials pack of 18 spices—a great gift for a recent grad setting up their first apartment or your mom whose smoked paprika expired last millennium. Orders over $25 ship free.Photo by Laura MurraySpicewalla 18-Pack Kitchen Essentials$99 $79 at SpicewallaBrightlandSave 25% on The Golden State Capsule from Brightland, which includes its two original olive oils, four infused olive oils (the basil and garlic are especially good), and two vinegars.SHOP BRIGHTLANDHaandRemember how yesterday you swore that this would be the last Thanksgiving with paper plates? North Carolina-based ceramics studio Haand makes some of our favorite servingware and dinner sets, and for Cyber Monday, they’re offering 10% off purchases of $100, 15% off $250, and 20% off $500 or more.3-Piece Ripple Dinner Setting$114 $95 at HaandW&PTake 25% off sitewide at W&P, including their full range of ice trays and molds. Their silicone Everyday Ice Tray is best in class; every house needs at least two.W&P Peak Silicone Everyday Ice Tray$13 at Amazon$14 $10.50 at W&PPartakeSenior editor Sarah Jampel is responsible for these camouflage chocolate fudge brownies, so if she says Partake’s vegan and gluten-free blondie and brownie mixes are good, pay attention. They're 25% off for Cyber Monday with free shipping on orders over $35.SHOP PARTAKEKate SpadeYou'll find everything you need for holiday entertaining over at Kate Spade (and for up to 50% off using code CYBERMON), including gold-toned silverware sets, decorative serving platters, and these statement champagne coupes.Kate Spade Champagne Saucers$100 $50GhiaStock up for holiday parties and Dry January with Ghia's non-alcoholic apéritif and canned spritzes, currently 20% off. Their recently released Ghia Ginger spritz is as deliciously bitter as the original, but with a spicy ginger bite.Ghia Nonalcoholic Aperitif$33 $26 at GhiaLesserEvilIt’s no secret that we don’t love the name and branding, but LesserEvil’s popcorn is undeniably good. Take 25% off with the code THANKSAVINGS, and be sure to throw in a bag of the limited edition white chocolate matcha flavor.SHOP LESSEREVILComing SoonCode DONTMISSOUT will get you 15% off a whole mess of items at Coming Soon, like confetti cutting boards from Fredericks & Mae and these colorful glass water carafes.Photograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Sytyling by Paige HicksFredericks & Mae Cutting Board$32 $27 at Coming SoonDuluth Trading CompanyThink of the holiday snack board installation art you could create on this handsome walnut serving plank, now 25% off. Make sure to grab some wood conditioner—made of coconut oil, beeswax, and carnauba wax—to keep it in prime shape for years.Best Made Walnut Plank Server$140 $105 at Duluth Trading Co.Yun HaiUse code GANXIE15 to take 15% off orders over $60 from Yun Hai Taiwanese Pantry. A great place to start would be this soy paste, which made my brussels sprouts the hit of Thanksgiving this year.SHOP YUN HAIThe CakerTake advantage of wholesale pricing on six boxes of luxe cake mix. Give them away as gifts if you want, but be sure to keep the flourless chocolate cake kits (our favorite) for yourself.Wini LaoThe Caker Cake Kits$25 at The Caker (Single)$150 $106 at The Caker (6-Pack)Williams SonomaThere's a wide range of cookware and entertaining deals over at Williams Sonoma, from kitchen workhorses like splatter screens and Lodge cast-iron skillets (a classic duo if ever there was one) to 6-piece nonstick baking sets and Bodum French presses.Photo by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieOpen Kitchen Splatter Screen$18 $14 at William SonomaBraggSave up to 25% on all our favorite old-school-health-food-store faves like nutritional yeast (the star of the popcorn of our dreams), apple cider vinegar, and liquid aminos. SHOP BRAGGDriftaway CoffeeUse code BF21 for up 10% off personalized gift subscriptions, which include virtual cupping sessions, from Brooklyn-based Driftaway Coffee.SHOP DRIFTAWAY COFFEEExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-29", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}