{"id": "52b1f4f6a3473b3bd1bfe710ba7d83c3", "url": "https://www.bonappetit.com/story/homemade-ginger-shots", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Make A Ginger Shot and Kick Your Winter Cold to the Curb | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMake Homemade Ginger Shots and Kick Your Winter Cold to the CurbBreak up with the juice shop and never look back. By Caroline LangeJanuary 21, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailOver the course of many raw, gray New York winters, I’ve made countless trips to the local juice shop for potent, golden “wellness shots” made from natural cold-fighters. The pilgrimage marks a first line of defense against a tickle in my throat or a last-ditch effort to ward off sickness when I get so congested that the world starts to tilt sideways. There’s a reason why lemon and ginger are popular cure-alls for colds—they’re head-clearing, warming, potent, and comforting. And though shelling out six dollars for one teeny, burning one-ounce gulp is better than spending the next week feeling fuzzy-headed and stuffed-up, even thinking about spending that much on one mouthful of juice makes me queasy. Last winter, I decided I was going to break up with the juice shop and make the darn shots myself.I loaded a blender with a couple chopped-up, three-inch branches of unpeeled fresh ginger, a few nubs of fresh turmeric, and the fruit of two lemons and two big navel oranges (that is, I slice away the skin and pith but toss the whole fruit in so I can get every drop of juice). I also added a pinch of kosher salt (for taste), a few cracks of black pepper (to help along turmeric’s anti-inflammatory properties), and a pinch of cayenne (for punch, and to tell the germs who’s boss). I whirled everything together until frothy and deeply golden, about a minute, then pressed the juice through a fine-mesh strainer and into an ice cube tray for later use. (Conveniently, most standard trays make 12 one-ounce cubes.) The resulting liquid is spicy and bright, good-tasting but intense enough to make you believe that you’re taking your medicine.The above is a loose framework—fiddle with it to your liking. The ginger and lemon feel non-negotiable, at least to me; they’re such classic cold-fighters, and ginger’s walloping heat is just what I want when I’m under the weather. But swap a grapefruit for the oranges, if you like. Add a clove of garlic if you’re feeling truly crazy, or drip in some oregano oil—both ingredients are harsh but beloved for their purported immune-boosting properties. This is a time I’d really recommend buying organic, fresh turmeric and ginger—just give them a rinse and then you can toss them into your blender, peel and all. If you can’t find organic, opt for peeling by gently scraping away the skin with the edge of a spoon. And if you can’t find fresh turmeric, use a teaspoon of powdered turmeric.For six dollars or less, you can make at least a dozen of these fiery shots (more if you’re pro-pulp and want to skip the straining). Once they’re frozen, pop them out of the ice cube tray and stash them in an airtight container in the freezer for up to three months. I like to add one to a glass of seltzer or a mug of just-boiled water whenever I need the boost. Of course, if you’re feeling bold, you can let a cube melt and then knock it back on its own, maybe chasing it with a little spoonful of honey as an incentive. You just might find yourself breaking up with the juice shop too.Explore Bon AppétitHealthyishRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-21", "author": ["Condé Nast", "Caroline Lange"]}