{"id": "52c14d6006c140be9bdb4b966157b48d", "url": "https://www.bonappetit.com/story/best-cocoa-powder", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "The Best Cocoa Powder for Baking (Especially Brownies!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Cocoa Powder for the Chocolatiest Brownies and CakesNot all cocoa powders are created equal.By Tiffany HopkinsSeptember 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.It’s debatable whether or not a bad brownie truly exists, but one thing that's for certain is that the best brownies start with the best cocoa powder. If you’ve ever baked with a dusty off-brand box of cocoa, you know this. That chocolate craving hits, you run to your kitchen cabinet, grab whatever cocoa you can find, pull your brownies out of the oven, take your first expectant bite, and find that they taste...kind of whatever. “Maybe I didn’t add enough cocoa,” you think, but the real issue is not quantity but quality. This is why many Bon Appétit recipes call specifically for Dutch process cocoa powder, and in the eyes of the BA Test Kitchen, Guittard Cocoa Rouge is the best cocoa powder of them all.Guittard Cocoa Rouge Dutch Process Cocoa Powder$11 at Amazon$11 at Sur La TableWhat is cocoa powder?Cocoa powder is the product of cacao beans that have been fermented, dried, and separated from their fats (a.k.a. cocoa butter) to yield cocoa solids. These solids then get ground into dust. Cocoa powder has a higher percentage of solids to fat—about 75 to 90%—compared to even dark chocolate or fèves, which is why we call for cocoa powder in our most chocolaty of chocolate desserts. It's highly concentrated and packed with chocolate flavor.What’s the difference between natural and Dutch process cocoa powder?Typically, a recipe will call for one of two types of cocoa powder: natural or Dutch process. Though both of these cocoa powders start from cacao beans, the steps that go into making them are a little different. In natural cocoa powder—sometimes also labeled as unsweetened cocoa powder, natural unsweetened cocoa powder, or pure cocoa powder—the dry cocoa solids remain unprocessed after being ground. Cocoa beans are acidic, with a pH level between 5 and 6, and so is natural cocoa powder, which is light brown in color with an almost reddish tint. In its raw state cocoa powder tastes sharp, fruity, and bright.In Dutch process cocoa powder—a.k.a alkalized cocoa powder or Dutched cocoa powder—the cocoa beans are soaked in an alkali solution that neutralizes the acidity and renders a smoother, earthier taste and rich flavor. “When it comes to baking, I prefer Dutch process cocoa powder,” says former BA food editor Claire Saffitz. “The alkalizing process darkens the color and typically deepens the flavor.” Dutch process cocoa powder produces baked goods that taste more intensely chocolatey.Can I substitute natural cocoa powder for Dutch process, and vice versa?The difference doesn’t stop with flavor. “Keep in mind that you can’t use Dutch process cocoa powder interchangeably with raw in every recipe because of how the different acidities interact with baking soda,” Saffitz warns. Baking soda is a leavening agent that is activated when it comes into contact with acidic ingredients—think of cakes that call for yogurt or buttermilk or even vinegar in addition to baking soda. If a recipe is developed using natural cocoa powder (which, you’ll recall, is acidic) and baking soda, swapping in alkalized cocoa powder could cause your chocolate cake to not rise correctly. However! The flip side of this is that Dutch process cocoa often yields fudgier, denser baked goods—a real plus in our book.Not every brand specifies if its cocoa powder is natural or Dutch process. “Most European brands, like Droste and Valrhona, are alkalized, while most American brands, such as Hershey’s and Ghirardelli, are not,” Saffitz explains.What's the deal with hot cocoa mix?It's mostly sugar! Read your labels carefully lest you get home from the grocery store ready to bake only to find that you've picked up hot chocolate mix by mistake. You can always make your own hot cocoa using baking cocoa powder sweetened to taste.Why is Guittard Cocoa Rouge the best cocoa powder?Saffitz’s—and the BA Test Kitchen’s—favorite high-quality brand for Dutch-processed cocoa powder is Guittard Cocoa Rouge. It has complex, bitter tasting notes and yields silky, fudge-like results when baked into desserts. Its high fat content makes it your best option for making luxurious ice cream and rich chocolate pudding pies. A good alternative is Droste, a Dutch brand that features an old timey nurse on the box.Guittard Cocoa Rouge Dutch Process Cocoa Powder$11 at Amazon$11 at Sur La TableDroste Unsweetened Cocoa Powder$9 at Amazon$9 at Cost Plus World MarketFor recipes that specifically call for natural cocoa powder, like these devil’s food cupcakes or this four-layer birthday cake with Nutella frosting, there’s a time and place for that box of Hershey’s. Scharffen Berger is another solid option.Hershey's Naturally Unsweetened Cocoa Powder$4 at Target$3 at WalmartScharffen Berger Unsweetened Natural Cocoa Powder$13 $12 at AmazonNow go make that salted caramel tart:Salted Caramel–Chocolate TartWe can't stop staring at the layers of bittersweet ganache and buttery caramel.View RecipeMore chocolate:Explore Bon AppétitShoppingBA RecommendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-03", "author": ["Condé Nast", "Tiffany Hopkins"]}