{"id": "52d179abf0178c2b89c5948e71cdadcd", "url": "https://www.bonappetit.com/recipe/yemenite-green-hot-sauce", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Yemenite Green Hot Sauce (Zhug) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueYemenite Green Hot Sauce (Zhug)By Andy BaraghaniJanuary 9, 20184.9(9)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintFeel free to use whatever fresh chile you can find, but remember that this sauce from Yemen, known as zhug, is supposed to pack some heat. You can use this sauce with sandwiches, over grilled meats, or as a topping for veggies.Ingredients4 servings 2cardamom pods1teaspoon black peppercorns1teaspoon coriander seeds½teaspoon cumin seeds4serrano chiles, finely chopped2garlic cloves, choppedKosher salt1cup very finely chopped parsley¾cup very finely chopped cilantro⅔cup extra-virgin olive oil4teaspoons fresh lemon juiceSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Remove cardamom seeds from pods; discard pods. Toast cardamom seeds, peppercorns, coriander seeds, and cumin seeds in a dry small skillet over medium-high heat, swirling often, until fragrant, about 2 minutes. Transfer to a spice mill or mortar and pestle and let cool; finely grind.Step 2Place chiles and garlic on a cutting board and sprinkle with a large pinch of salt and smash into a paste with the side of a chef’s knife. (Or use that mortar and pestle here too.)Step 3Transfer chile paste to a small bowl and work in spice mixture, parsley, cilantro, and oil; season with salt. Let sit 10 minutes for flavors to marry. Stir in lemon juice.Step 4Do Ahead: Sauce (without lemon juice) can be made 1 day ahead. Cover and chill. Let come to room temperature before stirring in lemon juice.How would you rate Yemenite Green Hot Sauce (Zhug)?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is delicious on chicken or slices of steak, and on roasted potatoes.  I've served it with roasted slices of sweet winter squash, and with fried tofu.  JavalinaDavis, CA1/29/2022Where in Yemen is this being made? Never heard of it. Have not tried it but it’s not something that anyone in my part of Yemen has made. What we do is take jalapeño garlic and tomato  mash it up add salt and call it a day. You could add cilantro or parsley or mint you could add cumin. But most common is jalapeño garlic tomato and cilantro. And it’s an everyday condiment. Anonymous5/1/2021sooooo goodAnonymousMontréal4/5/2020This is one of my faves seymourkittyPortland12/20/2019Explore Bon AppétitSauceHot SauceCondimentYemeniMiddle EasternSerrano ChileChileVegetableCilantroHerbs & SpicesParsleyCardamomDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}