{"id": "52d8313420da2d012b2609f698cf4a8b", "url": "https://www.bonappetit.com/recipe/rosemary-short-rib-ragu", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Rosemary Short Rib Ragù Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDRosemary Short Rib RagùFacebookPinterestTwitterEmailShallow-braised short ribs provide a relatively hands-off path to an incredibly rich and robust ragù. Make sure to cook the soffritto until the vegetables are completely tender, which is key to releasing all of their flavor.PrintIngredients3 lb. English-style bone-in beef short ribsFreshly ground black pepper3 tsp. kosher salt, plus more6 Tbsp. extra-virgin olive oil, divided1 fennel bulb, coarsely chopped3 celery stalks, coarsely chopped5 garlic cloves, smashed2 sprigs rosemary½ cup dry white wine1 20 oz. jar Barilla® Vero Gusto Heritage Marinara Sauce24 oz. Barilla® Collezione RigatoniFinely grated Parmesan and crushed red pepper flakes (for serving)Recipe PreparationPreheat oven to 300°. Season ribs with pepper and 3 tsp. salt. Heat 2 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Cook ribs, turning occasionally, until well browned on all sides, 10–15 minutes. Transfer ribs to a large plate or platter. Carefully pour off drippings and wipe out pot.Pulse fennel, celery, and garlic in a food processor until finely chopped. Return pot to medium-low heat and pour in remaining 4 Tbsp. oil. Add chopped vegetables along with rosemary sprigs; season with salt and pepper. Cook, partially covered and stirring occasionally, until soffritto is extremely tender and just starting to brown, 10–12 minutes.Pour in wine and simmer, stirring occasionally, until reduced by half, about 2 minutes. Stir in Vero Gusto sauce. Rinse out jar with 1 cup water and pour into pot. Increase heat to medium-high and bring mixture to a boil. Nestle ribs into sauce, cover pot, and transfer to oven. Roast, stirring halfway through and adding water to pot if sauce looks overly thick, until meat is tender and pulling away from the bone, 2½–3 hours.Transfer meat to a platter and let sit until cool enough to handle. Shred meat; discard bones. Return meat to braising liquid; pluck out rosemary sprigs and discard. Taste sauce and season with salt if needed. If sauce seems too thick, stir in water as needed to loosen. Bring to a simmer over medium heat and keep warm until ready to use.Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, 2–3 minutes less than package instructions (it will finish cooking in the sauce). Using a spider or slotted spoon, transfer pasta to sauce along with 1 cup pasta cooking liquid. Cook, stirring thoroughly to coat pasta with sauce, until pasta is al dente and sauce is slightly thickened.Transfer pasta to a platter. Top with Parmesan and red pepper flakes.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBarilla® Vero GustoPastaItalianShort RibRigatoniMainNut-FreeDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}