{"id": "52eae16d6179e45102a8bc6efc2b6ffa", "url": "https://www.bonappetit.com/story/jenny-lefcourt", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Jenny Lefcourt Won't Admit That She's the Reason You Drink Natural Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleJenny Lefcourt Won't Admit That She's the Reason You Drink Natural WineThe founder of Jenny & François Selections knows the importance of unscheduled time.By Marissa A. RossAugust 12, 2019FacebookTwitterEmailPhoto by ©️JamesrobinsonpicturesFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is natural wine importer Jenny Lefcourt, because when we see her label 'Jenny & François Selections' on the back of any bottle, we know it's a bottle we want to drink.If you drink natural wine, it’s because of Jenny Lefcourt. She would never tell you that though. She’ll attentively listen to the story about a Brooklyn wine shop you wandered into or your friend who brought a few bottles back from their year in Vienna, her playful mop of curls bouncing as she excitedly giggles with you about Gut Oggau. You’d never know she was the Jenny of Jenny & François Selections, the importer of many of your favorite wines (including Gut Oggau). Or that she was the first female wine importer in the United States, and arguably the states’ first natural wine importer, period. Because that’s Jenny.Coming in at 5-foot with a portfolio of some of the natural wine world’s most respected and influential winemakers, Lefcourt is a humble powerhouse. She built her business by lugging bottles of wine from Paris to New York, nearly selling them door-to-door like some 1950’s vacuum salesman while getting her PhD at Harvard. Now, nearly twenty years later, Jenny & François Selections isn’t just a side hustle picked up in Paris, but one of the most successful natural wine importing portfolios in the U.S. Here’s how she got started and what her days are like now.Before I  was  a wine importer I was …  getting my PhD in French Literature and Film from Harvard. I thought I was going to teach.I  discovered my  love of natural wine…  while getting my PhD. I spent a ton of time in France studying at the library and then going to very interesting wine bars around Paris. I realized there were certain winemakers making wine unlike anything I’d ever tried. These wines have come to be known as natural wines, but they didn’t really have a name for them in the '90s in Paris. I kept tasting and asking winemakers questions about how they made their wines and the similarity in all the wines I liked was that they were grown organically or biodynamically. They weren’t adding the three hundred additives that are permissible but fermenting with native yeast and using little to no sulfur. We felt that we were at the beginning of something really exciting, where people who had felt so isolated in their appellations were coming together, discussing what they were doing and how it was different from everything else going on in their regions.I  started my  company by… Putting wine in a bag and bringing it back to New York, because at the time you could carry it onto the airplane. I have a very vivid memory of dragging sixty bottles through the airport and trying to fit them under the seat in front of me, which it did! We had no funding, so we’d go to retail shops introduced to me by friends of the family, like Josh Wesson of Best Cellars, and show them the wines, saying “Hey! I can't believe this crazy Gamay from the middle of France that you’ve never heard of.” They were all so excited. We got the same response again and again: “Wow, this really reminds me about what I love about what I do.” I They would taste it and ask if we could send some tomorrow, and I’d be like, “I can send you some in two months! Can you order a little more so we can get this going?” [Laughs] We did all the orders DIY for the first few years, trying to save money, living on nothing and buying more wine.My  goal bringing these wines to New York was… to say, “Hey! Drink this! These wines are beautiful! The people who make them are awesome!” Because these winemakers who were making such exciting wines felt like my French family. I slept at their houses, met their kids, their wives, their husbands; had breakfast with them, went into their vines with them. I loved these people—how they lived, what they were working for, what they believed in—and had to share that.Twenty years later, my  goals…  are the same, it’s just gotten bigger. In the beginning, it was all French wines and just New York. Now, we represent wines from many countries and we’re distributed in nearly every state in the US, which is really exciting. We want to do right by every producer we represent and get their wines in the right hands—people who are going to love and appreciate them and find pleasure in drinking their wines and discovering their stories.My  day-to-day as an importer is… varied, and I like that. I come down to my office in Tribeca and generally have a lot of meetings with my team, most often tasting samples from producers. And I’m always meeting with sommeliers and doing staff trainings at restaurants. I really look forward to the staff trainings because that is where I can talk to a lot of people and get them interested in natural, organic, and biodynamic wines.Plenty of people wind down after work with a glass of wine.  Since wine is my  job, I … watch old movies. I studied film, and Fridays are movie and pasta night in my house. I just showed my seven-year-old daughter Charlie Chaplin and she loved it. The other day I asked if she wanted to watch TV and she said, “Any old film.” And I said, ”Yes! Any old film!” [laughs] So we watched more Charlie Chaplin together, which is so special to me.The last wine I opened was Alexander Koppitsch’s Homock. We just got it in. It’s Grüner Veltliner, Sauvignon Blanc, and Weissburgunder and has a very cool label of the beach. It’s great for enjoying days of sunshine.Something I’ve  taken away from all my  time spent in Europe is …  keeping my door open. I really have spent more time with winemaker Olivier Cousin and his family than anyone else, and their door is always open to people from all over the world who want to come sit, have dinner, talk politics, and enjoy each other’s company. It’s hard, but I really try to leave unscheduled time and be open. For example, on the weekend being able to go visit our friends who grow peaches and nectarines and plums and apples and hang out in their garden, picking fruit, standing under the trees talking about life. I think that not counting time or scheduling things—that kind of enjoyment of food and wine and relaxation and spontaneity—is important.Explore Bon AppétitHealthyishnatural winePerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-12", "author": ["Condé Nast", "Marissa A. Ross"]}