{"id": "530e2c54fb2106261dda7f0dc515756d", "url": "https://www.bonappetit.com/story/how-to-cook-rice-noodles", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "How to Cook Rice Noodles so They Don't Stick Together | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Rice Noodles so They Don't Stick TogetherNobody likes clumpy noods. Here's how to cook rice noodles so they're slippery and perfect, not a gummy mess.By Alex DelanyMarch 13, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmail\"Gummy\" should be used to describe gum and gummy bears. It should never be used to describe noodles. But if you don't know how to cook rice noodles, chances are that they're going to fall into the gummy category far too often, leaving you with a giant clump of starchiness instead of a beautiful tangle of glorious slippery strands. It should be noodles, plural—not noodle.So how do we avoid the gummy? How do we get rice noodles not to stick together? How do we cook them properly for dishes like pad thai or green shrimp curry? You're asking the right questions, and the answers are actually pretty simple. Here are a couple of tricks for working with flat, medium-sized rice noodles (think pad thai noodles).This might seem obvious, but the most important thing you can do is to follow the instructions on the package that the noodles came in. The biggest mistake when cooking rice noodles is not following the suggested cook times to get them to that pleasant chewiness (much like al dente pasta). There are usually two sets of directions on the package: one for cold noodles and one for hot noodles. The cook time for cold noodles will generally be a little longer, since the noodles will firm up a bit when they cool, and also because they won't get cooked a second time the way they would if you were stir frying them.If you’re planning on eating the noodles hot, like in a stir fry situation, you should remove the noodles from the water and dump them into a colander to remove as much water as possible. Then, as quickly as possible, transfer the noodles to your skillet with whatever else you're cooking them with and get them coated in sauce or oil. The starch hanging out on the exterior of the noodles is what makes them clump, and getting them in sauce will keep the starches on each noodle from coming into contact with each other.Easy shrimp curry loves rice noodles.\nAlex LauIf you’re not eating the noodles immediately or using them in a dish that’s either cold or room temperature, you should rinse the noodles in cold water immediately upon taking them out of the boiling water. The cold water will remove surface starch and cool the noodles, keeping them from cooking any longer. Once the noodles are rinsed, toss them in a bowl with a small amount of oil, which will provide further insurance against sticking. Toss them every five or ten minutes until you’re ready to use them.Oh, you want the TL;DR? Starch is trying to mess your day up. It’s great, because it gives rice noodles that pleasant texture, but it also likes to get clingy. Like, really clingy. Get something to coat those noodles and keep the starch from getting all sticky. If you do it right, you can keep those noodles separated, while you make your curry, or ready the ingredients for your pad thai...or eat gummy bears. Your call.Pad thai time!Weeknight Pad ThaiBecause your takeout habit is getting to be a bit much, tbh.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Alex Delany"]}