{"id": "5313884747481c289e77198a4b4dfc74", "url": "https://www.bonappetit.com/story/never-fail-make-ahead-broccoli-quinoa-salad", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "This Broccoli-Quinoa Salad Is the Answer to Soggy Desk Lunches | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Broccoli-Quinoa Salad Is the Answer to Soggy Desk LunchesIt's an actually-satisfying lunch that won't have you hunting for snacks at 4 p.m.By Aliza AbarbanelSeptember 14, 2018FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ANNA BILLINGSKOGFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.If life were a video game, packing your lunch would totally be a power-up—one of those trinkets you grab or smash or eat that gives you special powers. Even bringing a sad desk lunch would provide you a little boost. But bringing salad for lunch? Now that would be worth some serious adulting points—right up there with scheduling your semi-annual dental visit and cleaning the oven. (Do these video game metaphors make sense? Who knows! I never got past 'Rainbow Road' in Mario Kart.)I used to think meal prepping a week's worth of salad was an unattainable goal—a grown-up Holy Grail. Then I met this make-ahead broccoli and quinoa salad and saw the light. If you’ve ever had a traumatic encounter with a limp, soggy salad you may be reluctant to pack up a few day’s worth for work. I get it! I promise: This one will not disappoint. Unlike leafy greens and watery vegetables, broccoli holds up like a champ. And an addictive, well-balanced blend of mix-ins like chopped roasted almonds, sharp cheddar, dates, and red pepper flakes only gets better over time. It’s an interesting, healthyish lunch that tastes like it came from an actually-good fancy food store salad bar—without forking over my life’s savings.Are you sold? You better be. Start by cooking the quinoa like pasta. Get a big pot of salted water boiling, dump in the dry quinoa, and gently boil until you see a curly tail separating from the grains. Once it’s tender, dump it into a fine mesh strainer, shake off as much excess water as you can, and immediately return the cooked quinoa to the saucepan. For extra-fluffy quinoa, put a couple of paper towels under the lid to absorb excess moisture as the grains continue to steam.Okay: broccoli time! Shaving broccoli may seem tricky, but it’s easily accomplished with some basic knifework. Grasp the broccoli by the stalk with your non-dominant hand and hold it over a large bowl, then use a sharp chef’s knife to evenly scrape off the buds. If this seems confusing, check out this handy photo.Once the stalk is bald, it’s time to butcher the stalk and stem. The inner parts of broccoli stalks are tender and delicious, and worth excavating with a bit of vegetable peeler action. They are sweet and refreshing, and pretty much every salad can do with a little extra crunch. Once the inner stalk is chopped, toss it into the bowl with your dates, scallions, cheese, almonds, red pepper, and all that fluffy quinoa. Add some salt, olive oil, and lemon juice, then toss to combine.Now all that’s left to do is wait. Cover the salad with plastic wrap, pressing it directly onto the salad’s surface to lock in the flavor. Let it sit at least 30 minutes, and up to three days. The dates will soften, and the quinoa-broccoli mixture will soak up all the seasoning. It will be worth the wait.I know I said this salad is meant for lunch, but I’d be lying if I pretended I never eat it straight out of the bowl.  Of course some gets skimmed off the top, in furtive bites and nibbles on stray “scraps” of cheese. That’s just the price of meal prep—and it sure feels like a power-up to me.Get the recipe:Make-Ahead Broccoli and Quinoa SaladThe ideal bring-to-your-friend's-dinner-party salad.View RecipeExplore Bon AppétitBroccoliQuinoaLunchMeal PrepSaladNever FailRead MorecookingThis Tomato Tart Is So Easy, I Can Tell You How to Make It Over the PhoneBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-14", "author": ["Condé Nast", "Aliza Abarbanel"]}