{"id": "5316376137984291a684487b1ff7b68f", "url": "https://www.bonappetit.com/recipe/diri-kole-ak-pwa", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Diri Kole ak Pwa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueDiri Kole ak PwaBy Gregory GourdetJanuary 4, 20224.6(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranEmailPinterestPrintEmailPinterestPrintA staple of Haitian cuisine, diri kole ak pwa is a celebrated bean and rice dish that gets its complex flavor profile from epis, Haiti’s verdant, peppery green seasoning akin to sofrito. Chef Gregory Gourdet’s epis recipe makes more than you’ll need for this dish alone—keep any extra in a lidded container in the fridge and use it to season stews and marinate meats.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonCitrus Juicer$7 At AmazonHeatproof Measuring Cup$18 At AmazonDutch Oven$80 At AmazonMedium Pot with Lid$155 At AmazonMesh Sieve$13 At AmazonIngredients8 ServingsEpis½small green bell pepper, ribs and seeds removed, coarsely chopped½small white onion, coarsely chopped½large shallot, coarsely chopped½celery stalk, coarsely chopped1scallion, coarsely chopped½Scotch bonnet or habanero chile2garlic cloves1whole clove½cup (lightly packed) cilantro leaves with tender stems½cup (lightly packed) parsley leaves with tender stems2Tbsp. extra-virgin olive oil1Tbsp. thyme leaves2¼tsp. distilled white vinegar2¼tsp. fresh lime juiceBeans3scallions, halved lengthwise3garlic cloves¾cup dried kidney beans, soaked overnight, drained1½tsp. Diamond Crystal or 1 tsp. Morton kosher saltRice and assembly2cups basmati rice¼cup extra-virgin olive oil1medium onion, finely chopped1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt5garlic cloves, finely chopped3sprigs thyme1½tsp. freshly ground black pepper1Scotch bonnet or habanero chilePreparationEpisStep 1Pulse bell pepper, onion, shallot, celery, scallion, chile, garlic, clove, cilantro, parsley, oil, thyme, vinegar, and lime juice in a food processor or blender until a chunky sauce forms. Transfer epis to a small bowl and set aside.Do Ahead: Epis can be made 4 days ahead. Transfer to an airtight container; cover and chill.BeansStep 2Bring scallions, garlic, beans, salt, and 6 cups water to a boil in a medium pot. Reduce heat and simmer until beans are tender and the skins peel away when you blow on them, 55–65 minutes. Discard scallions and garlic. Drain beans in a fine-mesh sieve set over a medium bowl. Measure out 3 cups bean broth (add water if short). Set beans and broth aside.Rice and assemblyStep 3Rinse rice in a fine-mesh sieve under cold running water until water runs clear; drain well and set aside.Step 4Heat oil in a large Dutch oven or other heavy pot over medium-high. Add onion and salt and cook, stirring occasionally, until onion is light golden around the edges, 5–7 minutes. Reduce heat to medium and add garlic; cook, stirring, until fragrant, about 1 minute. Stir in thyme, pepper, and 2 Tbsp. reserved epis; cook, stirring, until fragrant, about 1 minute.Step 5Gently stir in reserved beans, then pour in reserved bean broth and bring to a boil. Stir in chile and reserved rice. Reduce heat to low and cook, covered, until rice is tender and liquid is absorbed, 15–20 minutes. Remove pot from heat and let sit, still covered, 10 minutes.Step 6Uncover pot; remove and discard thyme. Fluff rice with a fork and divide among plates. How would you rate Diri Kole ak Pwa?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleIt was easy and I loved it. I did the recipe as written using Carolina gold rice, and I probably overcooked the red kidney beans, but that was fine. I will NEVER be without epis in my refrigerator again, because it's the consummate hot sauce and it goes well with anything you want to spice up.DaveSherman Oaks, CA2/20/2022This was a lovely dish, came together pretty easily, and was comforting and flavorful. I agree with another reviewer that the dish could use more epis. We ended up stirring the leftover epis straight into our leftovers and it was really delicious that way!LaurenAtlanta, GA1/29/2022Delicious!!!  I followed the recipe exactly and it came out wonderful.  Since there's so much Epis left over, I'll freeze in small portions to use next time I make this dish or add to other dishes.  The rice was perfectly cooked and the flavor was so good.  I served with bratwurst and that was a great combination.ChristySeattle, WA1/20/2022I used white beans instead of kidney beans, a lot of canned chipotle peppers instead of the habeneros, vegetable broth instead of water,, and used ALL of the epis. Came out tasty and satisfying. Ian1/10/2022This was a quick meal and pretty tasty, but I think it could have done with more of the epis. I did sub in 1 can of (borlotti) beans in place of the dry, and though I simmered with the garlic/scallions I'm guessing my broth was probably less flavourful than had I cooked the beans from dry.  Will try again with beans from dry and report back. AnonymousLibya1/6/2022Explore Bon AppétitDinnerHaitianCaribbeanBeanVegetableKidney BeanRiceRice & GrainsScotch BonnetChileHabanero ChileSideVeganVegetarianDairy-FreeNut-FreeGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Gregory Gourdet"]}