{"id": "531ca718facac47a78cdc4385bd54d0e", "url": "https://www.bonappetit.com/story/love-thy-name-is-slow-roasted-onion-dip", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "This Onion Dip Recipe Makes Me Feel Better About Eating the Entire Bowl Myself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLove, Thy Name Is Slow-Roasted Onion DipThis incidentally-healthy yogurt-based onion dip helped me kick my store-bought dip habit. Meet my new favorite potato chip plunge pool.By Hilary CadiganJune 26, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailAt eight years old, I discovered my greatest love. And that love’s name was onion dip.As a kid, there was no greater pleasure than the first dip of a chip into a snow-white pool of luscious dairy fat, its cloud-like surface studded with translucent shards of rehydrated onion. It was the perfect mouthfeel before I knew what mouthfeels were: the cool, gloppy dip soft and tangy against the sharp salty crunch of the chip. To this day, I know no greater joy.In my household, onion dip came in two forms: sour cream + Lipton soup mix if my mom was feeling fancy; a store-bought tub of Heluva Good! (the exclamation point is part of the name) if I managed to sneak one into the grocery cart when she wasn’t looking. I was in my late twenties by the time my boyfriend informed me that it’s actually pronounced “Hell-uv-a,” as in, “Hell of a good dip” and not the highly embarrassing “Hel-loo-va” my mom fooled me into thinking it was for nearly two decades. (I still call it Heloova though because whatever.)If you invite me to a party, and there is onion dip on the table, you can bet your sweet bottom I will plant myself next to that not-big-enough bowl and remain there, speaking to no one, until the last streaks of sour cream have been wiped clean. If someone else drops a chip into the bowl and walks away like a reckless, slovenly ingrate (this is what you are if you do this), I will fish that chip out and eat it myself. Because I care. Because I cannot be tamed. Because I love onion dip more than I love my own dignity.But here’s the thing. Although going ham on a pile o’ chips and dip feels amazing while you’re doing it, it feels...really not amazing afterwards. That giant macerated lump of full-fat dairy and sodium and potato carbs can sit like a bowling ball in the pit of your stomach for hours. The roof of your mouth burns with the fire of MSG. Even your face starts to feel greasy. You need to leave the party early. People start identifying you as that grown adult woman who comes to social functions, camps out in a creepy stupor beside the snack table, then leaves without talking to anyone in a cloud of bad breath and shame and stomach pain.It’s not that the onion dip isn’t worth all that. It’s maybe just not a part of living your Best Adult Life.But guess what, friends. There is another way: this new slow-roasted onion dip recipe.Kettle chips FTW.\nThis innovative dip’s merits rest solidly on its base: rather than sour cream or mayonnaise or a combination of both, it uses one simple ingredient: Greek yogurt. Just as lush and tart as the sour cream it replaces, Greek yogurt is also straight-up good for you! It has protein and calcium and potassium and B vitamins and its own thrilling cadre of buzzwords like “probiotics” and “gut health.” Using something that is a part of a balanced breakfast as a dip base sounds like a good solve to me!Here's how it comes together. You start with a pound and a half of onions, a mix of colors. Really whatever you have lying around will do: red, yellow, white, sweet, Vidalia, Spanish. Just have at it. Then don a pair of goggles, preheat your oven to 400 degrees, open a window, and brace yourself for the hell that’s coming: chopping a pound and a half of onions. There’s no way around this, folks. (Unless you sob so loudly that your fiance gets tired of listening to you and takes over. Hot tip from yours truly.) Halve them, peel them, and then slice them all as thinly as possible until your eyeballs feel like they’re about to fall out of your face.Next, put your onion slices, four cloves of unpeeled garlic, a quarter cup of olive oil, and some kosher salt in a bowl and toss until everything is evenly coated. Dump it all into a mound atop a parchment-lined baking sheet—don’t spread the onions out; just leave ‘em piled up so they steam and soften slowly—and pop it into the oven. This is kind of delightful because usually to make a good homemade onion dip you have to spend an hour sweating over the stove and breathing in onion fumes. In this case, you’ll want to check your onions and move them around a bit every ten minutes or so, but aside from that you can just chill and watch season two of The Office for the 97th time.And that’s pretty much it! Once the onions come out, just let ‘em cool and dice ‘em up. Squeeze out your garlic cloves and crush them into a paste, add two teaspoons of lemon juice, and stir everything together with a cup and a half of full-fat Greek yogurt. Put it in a pretty bowl or trough, garnish with a pinch of cayenne, and serve with fresh halved radishes and some properly salty potato chips. Heluva, shmeloova. A new day has dawned.Get the recipe:Slow-Roasted Onion DipLike the one you make with the packet of soup mix, but with no weird chemicals and 1,000 percent tastier.View RecipeExplore Bon AppétitBasicallyDipOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Hilary Cadigan"]}