{"id": "5320b9b05057736231325b38bde7be66", "url": "https://www.bonappetit.com/recipe/leek-and-artichoke-fondue", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Leek and Artichoke Fondue Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueLeek and Artichoke FondueBy Victoria GranofMarch 16, 20213.7(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Victoria Granof, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintFondue, the hit dish of the ’70s, is brought into the 21st century with bright fresh herbs, goat cheese, and leeks. Developer Victoria Granof describes it as a cross between fondue and creamy artichoke dip (the best of both worlds, really). The secret to thick and smooth fondue is the addition of cornstarch. It absorbs any excess water, thickens the fondue, and prevents proteins in the dairy from separating or curdling. Don’t worry if you don’t happen to have a fondue pot; a saucepan, small rice cooker, or an Instant Pot will keep it warm. Here it’s served with crunchy vegetables, dill pickle potato chips, and a few fried butternut squash ravioli. —BA Test KitchenIngredientsMakes about 5½ cups6oz. Bel Paese cheese or whole-milk mozzarella, coarsely grated (about ¾ cup)2tsp. cornstarch½cup frozen peas1Tbsp. unsalted butter2medium leeks, white and palegreen parts only, tough outer layers removed, finely chopped8oz. canned artichoke hearts, drained, coarsely choppedKosher salt⅓cup dry white wine3oz. cream cheese (about ½ cup), cut into 1\" pieces3oz. fresh goat cheese (about ⅓ cup), cut into 1\" pieces1cup basil leaves¼cup mint leaves½tsp. finely grated lemon zest1Tbsp. finely chopped chivesCrudités and torn crusty bread (for serving)PreparationStep 1Toss Bel Paese cheese and cornstarch in a small bowl to coat cheese and set aside.Step 2Place peas in another small bowl. Bring 1 cup water to a boil in a small saucepan and pour over peas; let sit 5 minutes to soften. Drain peas, then set aside.Step 3Melt butter in a medium saucepan over medium heat. Add leeks and cook, stirring occasionally, until softened but not browned, about 4 minutes. Add artichokes, season with salt, and cook, stirring, until warmed through, about 1 minute. Add wine and cook until almost completely evaporated, about 2 minutes. Transfer mixture to a blender and blend until a coarse purée forms.Step 4Wipe out saucepan and return purée to pan; set over medium-low heat. Wipe out blender and set aside. Add cream cheese and goat cheese to pan and cook, stirring, until melted and combined, about 4 minutes. Working in 2 batches, add Bel Paese cheese, letting first batch melt before adding the second, and cook, stirring, until melted and combined, about 2 minutes total. Reduce heat to low and keep warm.Step 5Combine peas, basil, mint, lemon zest, and 1 Tbsp. water in reserved blender; season with salt and blend, adding a little more water if needed, until smooth.Step 6Remove fondue from heat and scrape pea purée into pan. Return to low heat and cook, stirring, just until warmed through, about 1 minute. Taste fondue and season with more salt if needed.Step 7Transfer fondue to a fondue pot if you have one and keep warm over a fondue burner; sprinkle chives on top. Serve with crudités and bread for dipping.How would you rate Leek and Artichoke Fondue?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleReally a great hit! I even forgot to turn on my fondue.AnonymousLondon11/24/2021I was very excited to make this recipe but sadly it didn't live up to the hype. I followed according to instructions -- exact amounts of wine, corn starch, etc. and the the texture of it was less like fondue and more like bread dough. The top of the fondue quickly developed a thick, coagulated, brown film. Sadly had to toss it all out in the trash. Saved the bread cubes for croutons tomorrow...AnonymousNew York, NY4/30/2021Explore Bon AppétitDipLeekVegetableArtichokeMozzarellaCheeseWinterStarterVegetarianGluten-FreeKetoNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Victoria Granof"]}