{"id": "5326fe12fca6a6f918adce0a2098b0f6", "url": "https://www.bonappetit.com/story/sustainability-feeling-energized", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "Dawn Davis Is Feeling Energized | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI'm Feeling EnergizedWhat I learned while editing our May sustainability issue.By Dawn DavisApril 29, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhen I think of the advent of spring, I usually think of color, a riot of yellow daffodils and purple crocuses, the bright male goldfinch returning to New York. But this spring what comes to mind is motion, perhaps because my own movement has been restricted due to the pandemic. There is the energy (and the audacity) of a tulip defying gravity to shoot up out of the earth. Then there’s downward motion too, the power unleashed in a terrific rain or pollen storm.The energy required to gather and feed friends comes to mind as well. The menu planning, the shopping, the mad dash to declutter the apartment before friends arrive. As of press time it’s not yet safe to entertain, but I’m already daydreaming about it. When friends arrive they’ll find a tray of lettuce cups filled with spicy bulgur, a dish bejeweled with pomegranate seeds. We feature these and many more dishes from the new cookbook Ripe Figs by Yasmin Khan, who traveled the Mediterranean listening to refugees and those who help them get on their feet by creating spaces where food begets conversation and compassion.At my dinner party the conversation will start with what we’re reading (The Final Revival of Opal & Nev for me) and then escalate to the environment. I’ll be armed with alarming facts—the ones I learned while editing this, our sustainability issue—but I’ll also come with optimism, buoyed by the creative thinkers who are focused on solutions. You’ll learn about how much we waste and how to combat it at home. Want a drink after you take in the magnitude of it all? You’ll find companies that distill alcohol sustainably.Of course, you come to BA for the food. Our test kitchen has produced delicious recipes that use parts of produce usually thrown away, like chai made from orange peels, and pork chops topped with broccoli stem salsa verde. (Though we have plenty of wonderful vegetarian options, we’re not here to tell you, even in this issue, how much meat to consume. That’s a choice each individual has to make, and with two teen boys, meat is certainly in rotation at my place.) No, we’re not featuring recipes from the restaurant Fat Choy just because they’re vegan. We’re featuring them because we’re excited about Justin Lee and his food. He went meatless at Fat Choy because he’s concerned about the planet and wanted to show that you can create big flavors without meat. Mission accomplished—just try his Bok Choy With Brown Sauce and Crispy Garlic. We also feature Brian Yazzie, an Indigenous chef for whom sustainability means staying rooted in his community and feeding those in need.In the magazine we titled Yazzie’s story “The Land Stewards.” To be a steward means to spend energy taking care of something. I’m going to employ my energy not just planning the dinner but thinking how, in the process of doing so, I can be more thoughtful about the earth’s resources. I’d love for you to join me, in ways that feel urgent and right for you.Explore Bon AppétitLetter From The EditorSustainableRead MorecookingYou’ve Got Time For ThisBy Dawn DaviscultureFood’s Most Important Year—EverBy Dawn DaviscultureI’m Happy to Be HereBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-29", "author": ["Condé Nast", "Dawn Davis"]}