{"id": "53345202b29c7defb03bf4ca242648fc", "url": "https://www.bonappetit.com/story/cantonese-restaurants-richmond", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "The 8 Cantonese Restaurants That Make Me Want to Move to Canada | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe 8 Cantonese Restaurants That Make Me Want to Move to CanadaIf you had the dim sum in Richmond, you’d understand.By Elyse InamineNovember 7, 2019FacebookTwitterEmailKyoko FierroFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.I became obsessed with Cantonese food not in Hong Kong, nor the sprawling suburbs of Los Angeles—two places filled with generations of immigrants from Guangdong (formerly known as Canton). No, I fell in love with the region’s intensely savory and satisfying cuisine in Richmond, an island city that’s part of Greater Vancouver in British Columbia.My husband’s parents used to live in West Vancouver, and every time we flew in from New York City to visit them, Richmond was a mandatory first stop. Sometimes it was for the juiciest shao mai at a busy dim sum parlor, or maybe the home-style Cantonese cooking (like steamed fish stuffed with mui choy or preserved mustard greens) we couldn’t find in NYC but could in a Richmond strip mall. Whatever craving struck, this town always had just the thing.That’s because Richmond is essentially Cantonese restaurant central with nearly a third of its 800 or so restaurants being Chinese, according to the city’s tourism board. In the late ’80s through the mid-’90s, many immigrants, like my in-laws, left Hong Kong and settled in along Canada’s west coast to preserve their way of life before the British government handed Hong Kong off to China. They came for the cool, temperate climate and for the auspicious name (Richmond sounds like “rich man,” my in-laws tell me). The result of that exodus was a mini Hong Kong on this side of the Pacific, complete with competing barbecue stalls slinging fat-crowned pork belly and nondescript restaurants doling out fragrant beef curry on par with Hong Kong’s most hallowed joints.Years later the cravings that my in-laws sought to satisfy whenever they brought me to a Hong Kong–style café or fancy banquet spot have become my own. But since they moved to Toronto a few years ago, I’ve been left to my own devices during our yearly treks to Vancouver and, as tradition demands, Richmond. That means pestering them, their friends, local food writers, and even my husband’s high school classmates for their favorite Cantonese spots in the area.The following eight restaurants are the ones that have made the cut. In part this is due to pure nostalgic favoritism after hitting them up for so many years, but it’s also because these eight cover the full spectrum of Cantonese cuisine and what makes it so special: the fancy (chewy Chinese charcuterie) and the everyday (humble beef brisket noodle soup), the familiar (mouthwatering dim sum) and the should-be-standard-but-isn’t (steamed pork cake!). Okay, less talking, more eating.8 Cantonese Restaurants You Need to Hit Up in Richmond, British Columbia:My ideal dinner at Sing Yee Chinese Restaurant.\nPhoto by Kyoko FierroSing Yee Chinese Restaurant“Steamed pork cake.” Those three words are all it took Kenson Ho, my father-in-law’s food-loving friend, to convince me to go to this seemingly no-frills restaurant in the Continental Shopping Centre strip mall. What is steamed pork cake, you ask? Imagine a meatball flattened into a Frisbee with pork so finely minced it’s like velvet, which is then cooked in its own fat so every bite is dripping with flavor. Well, Sing Yee’s version is even better than that. It comes threaded with fresh ginger and salted fish, so it’s balanced and complex and way too easy to shovel down with hot white rice. Then there are the meaty clams tossed in a sticky sweet-salty black bean sauce, garlicky snow pea leaves that are the definition of crisp-tender, and Kokanee beers served in chilled mugs. Despite the lack of ambiance (Sprite boxes everywhere, TVs on each wall broadcasting Food Network shows), there’s a reason why Sing Yee is always packed with young gregarious couples and older families late into the night: The food is dialed in and delicious.2118-3779 Sexsmith Rd., Richmond, B.C.; open Wednesday–Monday, 5 p.m.–1:30 a.m.; closed Tuesday.Parker Place Meat & B.B.Q.'s juicy barbecue pork\nPhoto by Kyoko FierroAnd more pork at HK B.B.Q. Master.\nPhoto by Kyoko FierroParker Place Meat & B.B.Q. and HK B.B.Q. MasterWhen it comes to char siu (barbecue pork) in Richmond, you’re either Team Parker Place or Team HK B.B.Q. Master. Some locals prefer Parker Place for its slightly sweeter glaze while others love HK B.B.Q. Master for its saltier, almost herbal flavor. In a move that everyone can agree to hate me for, I’m playing the role of Switzerland here and putting both places on this list! The best char siu is rimmed with fat and shellacked with Chinese five-spice powder and soy sauce while the inside has a salty and tender but not fall-aparty texture. So the best move is to order a little bit at both to make your own Platonic ideal barbecue platter. At Parker Place inside Parker Place mall, the move is to get the roast pork and duck, which is glossy, a touch gamey, and totally underrated (people are sleeping on this!). Then cross the street to HK B.B.Q. Master in Superstore, the Canadian equivalent of Costco, and get more roast pork—this one has a sharper, saltier flavor to cut the almost fruity Parker Place version—and roast suckling pig with a textbook puffy, crisp bark of skin. I’m all about barbecue world peace. Just don’t forget to bring cash.Parker Place: 1020-4380 No. 3 Rd., Richmond, B.C.; open every day, 11 a.m.–7 p.m.HK B.B.Q. Master: 4651 No. 3 Rd., Richmond, B.C.; open Thursday–Tuesday, 11 a.m.–8 p.m.; closed Wednesday.Just order everything at Chef Tony Seafood Restaurant.\nPhoto by Kyoko FierroChef Tony Seafood Restaurant“This place has more hype than a Supreme store,” my husband whispered to me as we walked by 40 people lined up outside the restaurant before it even opened. That’s because Chef Tony has become the standard for dim sum despite opening only five years ago. “It really forced existing Canto places to up their game,” food writer Eagranie Yuh told me. “And it brought in a more lavish Mainland-inflected swagger to the scene.” As in insanely gaudy chandeliers on the ceilings and columns of purple light beams dotting the space—but focus, you’re here for the dim sum. Order the meaty spare ribs, wobbly radish cake, succulent shao mai (steamed pork and shrimp dumplings) with black truffles (yes, it somehow works), fluffy brown sugar cake, and delicate egg white egg tart, a specialty of the restaurant. The wait is much more worthwhile than a white T-shirt with a Barbara Kruger knockoff.101-4600 No. 3 Rd. #101, Richmond, B.C.; open Monday–Friday, 10:30 a.m.–3 p.m., 5–10 p.m., and Saturday–Sunday, 10 a.m.–3 p.m., 5–10 p.m.The glorious fried pork chop with ham and eggs at Lido Restaurant.\nPhoto by Kyoko FierroLido RestaurantThe hottest club in Richmond is this diner inside Central Square at 8:35 a.m. Cha chaan tengs, or Hong Kong–style cafés, are by nature busy, with no-nonsense waitresses ferrying hot milk tea, thick congee, and silky rice rolls at lightning speed and turning over tables just as quickly. The swarms of sleepy families and solo diners crowding the entrance right around this time aren’t just here for the cha chaan teng essentials—though the fried pork chop with ham and eggs is very good. They’re here for the bolo bao (pineapple bun). This pastry gets its name from how it looks rather than how it tastes: The top of the bun has a crosshatched, sugar cookie–like crown that, if you squint, kinda looks like a side of a pineapple. Lido’s oversize version arrives split in half with the thickest square of cold, lemony butter in between. Never has a pineapple bun been so alluring.4231 Hazelbridge Way, Richmond, B.C.; open Sunday–Monday, 7:15 a.m.–10 p.m.; Tuesday, 7:15 a.m.–6 p.m.; Wednesday–Thursday, 7:15 a.m.–10 p.m.; Friday–Saturday, 7:15 a.m.–10 p.m.I refuse to share Mui Garden's comforting curry noodle soup.\nPhoto by Kyoko FierroMui GardenTom Wu, my husband’s old high school friend and expert on all things Richmond, introduced Mui Garden’s curry noodle soup to me the last time I was in Richmond. I haven’t stopped thinking about it since. The curry is Portuguese-ish (Macau, the peninsula just south of Hong Kong, was a Portuguese colony), thick and rich with coconut milk and tons of aromatics, and it comes brimming with thin flat rice noodles, hunks of the most tender braised brisket, and long stalks of blanched Chinese broccoli. At Hong Kong–style cafés like Mui Garden, which has another outpost in Vancouver, curry noodle soups are the norm, as are the spare, dark wood-lined booths and high schoolers taking a break from playing games at nearby internet cafés. During my most recent visit, each person at our table ordered their own curry noodle soup, unwilling to share, like the last time.5960 Minoru Blvd., Richmond, B.C.; open every day, 11 a.m.–10 p.m.You can never eat too much dim sum in Richmond.\nPhoto by Kyoko FierroFisherman’s TerraceIf you see families loitering on the second floor of Aberdeen Centre, yet another mall in Richmond, perhaps walk a little faster to this revered dim sum spot. Even if you made a reservation (which I strongly suggest you do), you will have to check in with the hostesses and wait for them to yell your name over the miked-up loudspeaker. But after that jarring experience, you’re led into a plush, very Vancouver kind of dim sum experience. Fisherman’s Terrace is covered in light wood and has more tasteful chandeliers than Chef Tony; similarly, service is much less harried. Make sure to mark up your dim sum menu with the baked barbecue pork buns cloaked in a buttery pastry that shatters all over the table; shrimp-and-pea dumplings; and the iconic shredded cold chicken, a crunchy, sesame-oiled mix of actually juicy breast meat, celery, fried wonton chips, and cooked-down onions and carrots that’s like the best chicken salad you’ve ever had.3580-4151 Hazelbridge Way, Richmond, B.C.; open daily, 10 a.m.–2:30 p.m., 5:30–9 p.m.Max Noodle HouseI’m not sure if it’s intentional, but the name of this place sure sounds like Mak’s, the famed wonton noodle soup shop in Hong Kong. (The general manager won’t tell me; her name is Maxine, so could it be named after her?) Fact-checking aside, this hushed restaurant is just as essential in a Richmond guide as Mak’s is in a Hong Kong one. (Another solid Tom rec; I told you he’s an expert!) The ceilings are low like a basement and the decor is alpine-inspired, as if you’re in Whistler. Strangely enough, it’s the perfect environment for slurping up the spot’s specialty of homey, satisfying noodle soups. There’s the beef brisket with a clear, delicately spiced broth, chewy rice noodles, and incredibly fatty and flavorful meat. Then there’s the star: the wonton min, bobbing with wiry yellow noodles and globes of big shrimp wrapped in a tissue-thin wonton skin. It gives Mak’s a run for its money.8291 Alexandra Rd., Richmond, B.C.; open Wednesday–Monday, 11 a.m.–9 p.m.; closed Tuesday.The charcuterie is a must-order at Kirin.\nPhoto by Kyoko FierroThe lobster noodles taste as good as they look.\nPhoto by Kyoko FierroKirin Seafood RestaurantEvery food writer who comes to Vancouver falls head over heels for Kirin. And I fit the stereotype. The first Cantonese banquet feast I attended was for my sister-in-law at Kirin in Vancouver, and I was happily overwhelmed with the platters of charcuterie (jiggly jellyfish, sockeye salmon, Vietnamese-style ham); the crisp duck skin served with the thinnest pancakes, the duck’s meat diced and tossed in a hot wok with shallots, carrots, and mushrooms for the most indulgent lettuce wraps; and a luxurious noodle dish with fresh lobster and egg noodles soaking up all that buttery, lobster-y sauce. At the Richmond outpost of Kirin adjacent to Richmond Centre Mall, I felt that same magic of the banquet feast, ordering all the same things and wishing there was something like this and like everything else I love about Richmond back home.7900 Westminster Hwy., Richmond, B.C.; open daily, 10 a.m.–2:30 p.m., 5–10:30 p.m. (Other locations in Vancouver, New Westminster, and Vancouver West.)Want more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Elyse Inamine"]}