{"id": "5341d85b378500b6b29292ccb6eb99c9", "url": "https://www.bonappetit.com/story/make-make-mussels", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "These Stuffed Mussels Are My Favorite Dish in a Book Full of Must-Make Italian American Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIn a Book Full of Must-Make Italian American Recipes, This Is My FavoriteChoosing my favorite recipe was like choosing a favorite child—tough, but you do it anyway.By Caroline LangeOctober 27, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In the fall of 2019, I began testing the recipes for Italian American, the cookbook from Scott Tacinelli and Angie Rito, the chefs at Don Angie, a cozy, twinkly (you guessed it) Italian American restaurant in New York City’s West Village. For six wonderful months, I worked my way through gallons of olive oil, enormous hunks of Pecorino Toscano, and truly impressive amounts of garlic as I cooked the book’s recipes. I had such a good time (and ate so well) that when asked to write about just one recipe I loved, I almost couldn’t choose.Here were some of the front-runners: The spicy fra diavolo sauce, which is frankly genius. The roasted cauliflower and pine nut spread that I ate by the spoonful. The 10-minute San Marzano tomato sauce, so fast and shockingly delicious. The over-the-top spaghetti and meatball frittata! Any of the lasagnas! Get the book and bump all of those recipes straight to the top of your to-make list. But first, I’ve got to tell you about the recipe that knocked my socks right off: the stuffed mussels with pepperoni rice.Alone in the kitchen with Scott and Angie’s recipes, I would shake my head with delight as I read through recipes, dreaming of being a fly on the wall during the recipe-brainstorming sessions. So many of the recipes tell stories in their ingredient lists and techniques, stories to follow from New Jersey to Ohio to Manhattan’s Chinatown to the Italian city of Trieste, where the cuisine is influenced by the region’s roots in the Austro-Hungarian Empire. Each ingredient, each step is intrinsic to the recipe, and nothing goes to waste. Each recipe is scrappy and smart.Italian American: Red Sauce Classics and New Essentials$35 $30 at Amazon$35 $32 at BookshopWith the stuffed mussels, for example, you start by cooking the mussels. It’s simple—the Italian triumvirate of olive oil, garlic, and chile flakes plus a few sprigs of parsley and enough white wine to help the mussels steam open—but the step makes a five-minute concentrated stock, which you use to cook the rice while the mussels cool in the fridge.And the rice! Made of short-grain white rice cooked with white wine and pepperoni, the dish winks simultaneously at Italian risotto and Spanish paella. Like risotto, it’s made with short-grain white rice and dry white wine, and you stir it often to bring out the creamy starch. And like paella, it matches rice with mussels and smoky, savory pork sausage. In this case, it’s pepperoni, which resides firmly on the American end of Italian American cuisine while still emulating more traditional cured salumi. I love this trick in the recipe: You grind the pepperoni into rubble in the food processor, then bloom it in olive oil so that the fat turns a slippery bright orange. This pepperoni fat, plus that mussel stock from before, is what you cook the rice in, its snappy color and flavor weaving through it all.And all of that can be done ahead of time if you’re hosting. When you’re a little ways out from serving, just pop the top shell off the mussel, loosen the meat, heap on a spoonful of the rice, and slip them into a hot oven to warm through and brown. Serve with a big bowlful of Scott and Angie’s lemon aioli, which embodies another lesson I learned from Italian American: A bit of sugar goes a long way in the savory world—here, it wakes up the whole dish. There’s a pinch of white sugar in the pepperoni rice and two whole tablespoons in the lemon aioli, which is store-bought mayo fancied up with unexpectedly large quantities of lemon zest and juice, garlic, and salt. It’s a delicate, delicious counterpart in a recipe (and a cookbook) so smart, it’ll make you feel like a certified smarty yourself.Get the recipe:Stuffed Mussels With Pepperoni RiceEven though we could devour every last one of these hearty stuffed mussels on our own, we recommend making this feast a group activity. View RecipeExplore Bon AppétitcookingShoppingCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-27", "author": ["Condé Nast", "Caroline Lange"]}