{"id": "535c9f9e012585a299f7b44980111a18", "url": "https://www.bonappetit.com/recipe/charred-sweet-potatoes-with-toum", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Charred Sweet Potatoes With Toum Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCharred Sweet Potatoes With ToumBy Andy BaraghaniJanuary 9, 20184.3(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis recipe is nice twice. The roasting and honey-glazing method is a great way to make sweet potatoes, and you also get an eggless garlic sauce that you’ll use again and again.Ingredients4 servings1cup grapeseed or vegetable oil⅓cup garlic cloves (6–8)2tablespoons fresh lemon juiceKosher salt8small sweet potatoes (about 1½ pounds), scrubbed4tablespoons unsalted butter, divided2tablespoons honey2teaspoons nigella seeds (optional)Flaky sea saltIngredient InfoNigella seeds can be found at Middle Eastern and Indian markets and online.PreparationStep 1Chill oil in freezer 30 minutes (this helps the sauce emulsify). Pulse garlic in a blender with lemon juice, ¼ cup cold oil, and 1 Tbsp. ice water until smooth. With motor running, very gradually and steadily stream in ½ cup oil (you don’t want to risk having the emulsion split). Scrape down sides and continue to blend, slowly adding remaining ¼ cup oil, until a slightly thick sauce forms (it should cling to a spoon). Add 1 more Tbsp. ice water, season with kosher salt, and pulse again to combine. This whole process will occupy 8–10 minutes. Take your time! Transfer toum to a medium bowl.Step 2Place a rack in bottom third of oven and preheat to 400°. Place sweet potatoes in a large heavy skillet, preferably cast iron. The pan should be large enough so that sweet potatoes cover only half of the pan. Pour in just enough water to barely coat bottom of pan. Cover tightly with foil and bake sweet potatoes until tender, 30–35 minutes. Transfer to a cutting board and let cool; reserve skillet. Slice sweet potatoes in half lengthwise.Step 3Return reserved skillet to rack and heat 20 minutes. Remove skillet from oven and swirl 2 Tbsp. butter around in pan to coat. Add sweet potatoes, cut side down, and roast until edges are browned underneath and crisp, 18–25 minutes.Step 4Spoon some toum on a plate or in shallow bowl and arrange sweet potatoes on top (save extra toum for another use). Stir remaining 2 Tbsp. butter and honey in skillet and place over medium heat to warm. Drizzle honey butter over sweet potatoes. Sprinkle with nigella seeds, if using, and sea salt.How would you rate Charred Sweet Potatoes With Toum?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleSOOO good. Used an immersion blender, added the oil slowly (~3-4 minute process), and the toum came together no problem.  Anonymous1/20/2021Love this recipe, I could not get my toum to thicken though :(. However I found a Whole Foods Market Brand that makes delicious toum so I was able to complete the dish. The brand TOOM Garlic Dips even have a few flavors making it either spicy or basily to mix it up! YUM!AnonymousDetroit6/23/2020I couldn't get my Toum to thicken enough but the flavor was great. AnonymousWashington, DC 4/1/2020Never had luck with the Toum emulsifying... kind of ruined the recipe for me, sadly.Anonymous9/8/2019I adore this recipe. It works taste-wise even if your toum doesn't emulsify - delicious anyway.\nBut I finally got the toum right - I finally tried putting the garlic through a press before trying to blend it. Worked perfectly. Serve these potatoes with the best darned steak you can get your hands on - the toum is great on steak as well.Maine6/1/2019This is an excellent recipe. Wouldn't change a thing. Make sure to really heat up the cast iron pan before putting the potatoes in for the final roast.AnonymousIthaca, New York4/17/2019are the sweet potato skins edible?  i have not found them to be.  i love all your recipes, Andy.  have you written a cookbook and i just don't know it?hollis5Vero Beach, FL2/6/2019I saw this recipe, had sweet potatoes, but no oil. So we just had the sweet potatoes sans toum. They were absolutely delicious. I am looking forward to making again with the toum. nadinewalsworth8597Maple Valley, WA1/15/2019Unbelievably delicious. I accidentally forgot about the oil in the freezer for almost a week, so it was pretty solidified in a blender cup. Added the garlic, lemon juice and a few ice cubes to the solid oil and it emulsified perfectly. My new go-to sweet potato recipe. Thank you Andy!!AnonymousBrooklyn12/8/2018Use a bit of Xanthan Gum. It will help hold the emulsion.  It is easily found in the baking section of the grocery store and comes in handy for all types of things. Bobby KeeneLos Angelese12/2/2018A DELICIOUS RECIPE. Made this because I had sweet potatoes and nothing to do with them, and it is honestly perfect (even if the pan handle breaks as you take it out of the oven and your potatoes end up on the kitchen floor) I'd love to try it again, this time with a new pan! ;)AnonymousLondon, UK11/30/2018Delicious recipe! \n\nA few tips for toum:\n-Careful not to add the oil in too quickly \n-If the emulsion breaks, add an egg white into 1/4 of your mixture (garlic/water/lemon juice/oil) and SLOWLY add the rest of the mixture back in\n-Use a food processor instead of a blender, imhoAnonymous11/12/2018The first time I made this, the toum came out perfectly and it was so freaking good! I tried to make it two more times and each time I wasn't able to get it to emulsify! Any suggestions? AnonymousBrooklyn, NY3/16/2018Explore Bon AppétitMiddle EasternSweet PotatoPotatoVegetableGarlicYogurtOther IngredientsSideStarterGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}