{"id": "5370f4e47f1844bdd9c8b5004812d509", "url": "https://www.bonappetit.com/story/plastic-free-stores", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "5 Stores That Make It Easy to Go Plastic-Free | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Stores That Make It Easy to Go Plastic-FreeMoney talks, and at these five places, it's saying: \"I love businesses that don't use plastic.\"By Rachel Sugar March 25, 2019FacebookTwitterEmailIllustrations by Seb AgrestiFacebookTwitterEmailBreaking a plastic habit is hard. Trust us, we've tried. Going low-waste means saying goodbye to countless tools in our kitchen arsenal, from zip-top plastic bags and paper towels to yogurt containers and clamshell produce containers. (Cherry tomatoes, we just can't quit you.) Luckily, these stores are dedicated to easing the transition.The Take-out OptionGreenToGo, Durham, NCThat mountain of are-these-actually-recyclable take-out containers cluttering your cabinets? Not an issue with GreenToGo, which partner with Durham restaurants like BA fave Rose's Noodles, Dumplings & Sweets.  For a fee, you can use its app to order from participating restaurants, then get carryout or delivery in one of the program’s reusable boxes. When you’re done, return the box to a drop-off point and GreenToGo will clean it to health department standards and get it back in circulation.The Coffee ShopThe Tare Shop, Halifax, Nova ScotiaA zero-waste grocery store attached to a zero-waste coffee shop, the Tare Shop offers goods like bulk tamari, olive oil, and sprouts sans packaging. The café, too, has ditched disposable cups: It’s BYOMug here, though if you forget, you can always grab one from the community “library”of donated mugs—bring it back next time, or consider it a zero-waste souvenir.Instagram contentThis content can also be viewed on the site it originates from.The Grocery Delivery ServiceThe Wally Shop, BrooklynThe convenience of grocery delivery with none of the packaging. Produce, grains, and spices from local farmers’ markets and bulk stores come packed in mason jars and cotton bags, delivered to your door in reusable totes. At your next delivery, the Wally Shop collects that packaging, clean its, and reuses it— leaving your pantry stocked and your garbage empty.The BarHenley, Nashville, TNAt the Henley, ditching plastic is a creative opportunity. Reusable straws, for example, are not so much an obligation as an expression of taste: aromatic cocktails get bamboo straws, to enhance the experience, while classics — your G&Ts, your mint juleps — come with metal straws, all the better for stirring. As for the drinks themselves? Instead of buying pre-packaged ingredients for the cocktail program, the team makes their own — using leftover fruits and vegetables from the restaurant to make syrups, vinegars, and oils.Instagram contentThis content can also be viewed on the site it originates from.The Home Goods StorePublic Goods and Services, SeattleThis is where you go to get reusable cotton bags for storing vegetables, stainless- steel tiffin containers, beeswax wrap, and refillable cleaning supplies like laundry detergent (you’ve got to wash those bags somehow).Explore Bon AppétitHealthyishShoppingTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-25", "author": ["Condé Nast", "Rachel Sugar"]}