{"id": "5392ef08c4ea9d2d8ef9a1b170092eb1", "url": "https://www.bonappetit.com/story/horn-barbecue-quarantine-cooking", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Making Grilled Cheese For My Kids Is as Satisfying as Smoking Meat For a Living | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMaking Grilled Cheese for My Kids Is as Satisfying as Smoking Meat for a LivingPitmaster Matt Horn often worked 48 hours straight for his Oakland pop-up, Horn Barbecue. Quarantine gave him a chance to step back. By Matt Horn, as told to Hilary CadiganAugust 26, 2020FacebookTwitterEmailPhoto courtesy Horn BarbecueFacebookTwitterEmailWhen I was growing up, my mom used to say, “I never want my son to be a firefighter. He’ll run right into the fire.” I became a pitmaster instead (different kind of fire), but she was right. Once I see a challenge, I embrace it, face it, and try to endure. Opening a restaurant during a pandemic is just another challenge.Since 2016 I’ve been doing barbecue pop-ups in Oakland. Those are 48-hour days: I’m buying the meat, prepping the meat, and sacrificing my sleep to cook it for 16 hours. Then I have to serve it, give customers that one-on-one experience—preparing the cuts they want, having personal conversations—and then clean up. By the time I go home, I’m exhausted physically as well as emotionally. The last thing on my mind is “Hey, I’m going to go in the kitchen to cook up a meal!” No way. I’m gonna order some takeout from the place down the street.But since the pandemic started, things are different. It’s made me focus more on cooking here at home. It’s made me rely on the reasons I love to cook in the first place. Watching a fire takes me to a meditative state—complete peace. I’ve always said that if no one showed up to my pop-ups, I would be fine because I’m completely in love with what I do. Quarantine is proof of that: I find the same pleasure in cooking a 200-pound hog in my backyard brick pit as I do in making grilled cheese sandwiches and plain omelettes for my kids, Matty and Leilani, who are four and three.Photo courtesy Horn BarbecueDuring quarantine I’ve been able to spend a lot of one-on-one time with them, in their little world of toys and licorice and YouTube. I’ve had time to hone family recipes, like my grandmother’s cheesy potato casserole, which I plan to serve at the restaurant when we open. The other day she came by and tasted it. She didn’t say, “This is great.” She didn’t say it was bad. She just looked at me, smiled, and told me she was proud of me. I’ll take that.When I open up the restaurant, it’s going to take time away from my family. I understand that, and they understand that too. But I’m trying to implement systems where neither me nor my employees are working all the time. We’re not going to be open seven days a week. We’re going to be open three to four days. And once we sell out, that’s it—we go home.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-26", "author": ["Condé Nast", "Matt Horn", "As Told To Hilary Cadigan"]}