{"id": "539893d807b37c24f6bd0f25dbdc2d5e", "url": "https://www.bonappetit.com/story/flat-scandinavian-whisk", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "A Flat Whisk Is More Useful Than a Round Whisk (Prove Me Wrong!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Flat Whisk Is More Useful Than a Round WhiskThe bottom of your pan is flat, so why isn’t your whisk?By Ali StaffordMay 13, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.One Sunday evening, nearly 20 years ago, a friend’s mother gave me two gifts.The first, a cooking lesson, came just before dinner. While the chicken she roasted rested on a platter, she splashed white wine into the still-hot cast-iron skillet, where it immediately bubbled up, nearly disappearing. Then, with a tool I had never seen before—whisk-like but flat-bottomed—she dislodged all of the browned bits stuck to the bottom of the pan. As she swirled the whisk across the pan’s surface, she dropped in a few pats of butter, then carefully tipped the plate holding the bird, allowing the juices to trickle into the emulsifying sauce. She broke down the bird, spooned her finished pan sauce over top, and placed the platter in the center of the set table: cloth napkins, candles, warm bread, wine.As I was leaving to head home that evening, she handed me the whisk, my second gift. She promised me she had two and sent me on my way.Little did I know how much I would use this small but mighty tool. At that point in my life, I was attending culinary school and working at a catering company. In these kitchens, where blending was mostly performed by industrial Robot Coupes and emulsion blenders half the size of my body, this dainty, flat-bottomed whisk had no place.But now that I’m primarily a home cook, I’ve come to believe there is no better whipper. After my chef’s knife, it’s the tool I reach for most often.If you are unfamiliar with a flat-bottomed whisk, imagine a coil bent into a circle and attached to a handle at a slight angle. My particular one is called a Scandinavian whisk, named by the company’s Swedish owner who wanted to differentiate it from the other whisks available at the time. It goes by many names, however, including sauce whisk, which is an accurate but limiting title as it does so much more.It excels on the stovetop because its design makes it perfect not only for pan sauces but also for milky custards, bèchamel, and any creamy gravies or soups prone to sticking to the bottom and corners of pots. A flat-bottomed whisk can nose its way into a pot’s edges, liberating any bits that otherwise would linger and burn. Even polenta, which loves to clump and cling to a pot’s surface, can’t put up a fight.But it has other uses too. Once you give this whisk a whirl, it will be the one you reach for every time when you need to make a dressing, vinaigrette, or marinade. And when it’s time to make whipped cream (a small batch, at least), this is the whisk that will transform heavy cream into soft, billowy peaks in less than a minute. For mixing dry ingredients together, it performs as well as any balloon whisk you have in your collection. From beating eggs for a breakfast scramble to incorporating them into a cake or muffin batter, this is the tool that will get the job done most effectively, its many coils working together to unify the yolks and whites into a ribbony golden stream.And every time you roast a chicken or sear a steak and need a simple sauce to dress it up with, reach for this magic wand. The best gift of all is knowing a low-effort, high-reward sauce is just a flat-bottomed whisk away.Photo by Isa Zapata, Food Styling by Pearl JonesLudwig Scandinavian Whisk$16 at AmazonAlexandra (Ali) Stafford is the blogger behind Alexandra’s Kitchen and the author of the cookbook, ‘Bread Toast Crumbs.’Explore Bon AppétitBasicallyToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-13", "author": ["Condé Nast", "Ali Stafford"]}