{"id": "539eb1e8af0c7f5fde22972bfdf9b9ea", "url": "https://www.bonappetit.com/story/croissant-itinerary", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "I Planned an Entire Vacation Around Croissants and Regret Nothing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Planned an Entire Vacation Around Croissants and Regret NothingGive your vacation a mission and a higher purpose.By Carla Lalli MusicMay 3, 2018FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailI went to San Francisco in 2013 with my then ten-year-old son Leo to eat, no qualms about it. I could no longer resist the constant stream of media fanfare about the “scene.” There were local culinary heroes (Danny Bowien; Stuart Brioza and Nicole Krasinski), destination-worthy neighborhood spots (Outerlands), third- wave coffee beaneries (Sightglass, Ritual), and the bakeries. So. Many. Bakeries. At the time, the city was even becoming famous for its toast. Toast!Our first stop was the mecca of Tartine Bakery in the Mission, where jet lag got us there before a line had formed. We picked out the famous morning bun, a ham-and-cheese croissant (the pain au jambon), and a chocolate croissant. Also a quiche and some still-warm brioche bread pudding, because you just never know! The bun certainly lived up to the hype, but Leo deemed the pain au jambon the “winner,” and on the spot the two of us decided to compare it with every other ham-and-cheese croissant we encountered over the next five days.Our mission gave our days structure, and we stuck to a steady food-culture-culture-food rhythm, heading out with intention and then converting our high-fat, high-carb diet into spontaneous detours. On the way to Craftsman and Wolves, where the ham-and-cheese was a solid B+, we wandered into a cool taxidermy and artifacts store. We followed B. Patisserie’s spectacular kouign-amann with a long walk to Golden Gate Park, descending from hot and sunny San Francisco spring weather to cold, wet, and windy San Francisco spring weather.There were no pins on my Google map for the moments I remember most clearly: the night we stayed in and read graphic novels because we were too full for dinner; the albino alligator at the California Academy of Sciences; Leo jumping the dunes at Ocean Beach; chatting with strangers in line at Swan Oyster Depot; walking the hairpin turns on Lombard Street. We needed a point A and a point B—and the next croissant was as good a destination as any—but the trip ended up being about everything that happened in between.Read more: Our Highly Subjective But Very Smart Guide to TravelingCheck out one of our favorite restaurants in SF:Explore Bon AppétitSan FranciscoCroissantTartineTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-30", "author": ["Condé Nast", "Carla Lalli Music"]}