{"id": "53a30642885217770f905fb2015fb471", "url": "https://www.bonappetit.com/story/bens-chili-bowl-refuge-resistance", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "How D.C.’s Ben’s Chili Bowl Continues to Serve as a Refuge for the Resistance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Historic Hot Spot of the Civil Rights Era Remains a Refuge for the ResistanceWashington D.C.’s Ben’s Chili Bowl didn’t close during the 1968 riots, and they’re certainly not about to now. Here’s how two generations of the family owned–business feeds the movement.By Ryan Walker-HartshornJuly 23, 2020FacebookTwitterEmailPHOTO BY KELLY MARSHALLFacebookTwitterEmailNewlyweds Ben and Virginia Ali opened Ben’s Chili Bowl in 1958 in the U Street Corridor of Washington D.C., the heart of the capital's vibrant Black community. Over the years, the iconic business expanded into nine different locations with the help of the couple’s three sons and their families. When COVID-19 hit, eight of the nine closed overnight. Only the original Ben’s—a hub of activism during the Civil Rights era, where prominent Black leaders like the Reverend Dr. Martin Luther King regularly stopped in for chili, burgers, and fries—remains open, a persevering witness to new protests in the same fight against racism. “It takes me back to 50-something years ago,” says Virginia. History, as they say, repeats.It’s the rare restaurant that can fuel hope and empower a community simply by keeping its doors open against the storm. Virginia’s daughter-in-law, Vida, has devoted herself to carrying on the legacy. “They passed the baton to us,” she says. “We're not stopping until we see change for our people.” We spoke to the two generations of owners (pictured above) about what it means to harness the power of community and comfort food in times of upheaval—past and present.What was Washington D.C. like when you founded Ben’s Chili Bowl?Virginia: In 1952, D.C. was still a segregated city. We didn't go downtown for dinner, or to the movies, or for very much of anything. We didn't need to, because we had such a vibrant community of our own. Black people had our own white tablecloth restaurants. We had little hotels. There was a theater next door to the Chili Bowl called the Lincoln that had a fabulous ballroom underground where we danced to Count Basie and Duke Ellington's music. There were beautiful jazz clubs and music halls. Howard University afforded us an absolutely fabulous African American intellectual community. We had our own doctors and lawyers and print shops and everything. We called it Black Broadway. When we opened, we settled in very nicely.Ben’s has always been a gathering place. People feel like they’re coming home when they walk in the door. Back in the 1960s, Dr. King would stop in, and I'd have an opportunity to chat with him about his dreams. You'd get to say hello to Harry Belafonte, or Dick Gregory. They’d come in for a little delicious comfort food and a moment to sit down and energize, and then continue on.Photos of notable visitors, including President Barak Obama, line the walls at Ben’s.\nPHOTO BY KELLY MARSHALLSeveral years after the restaurant opened, uprisings against racial injustice broke out across the country. What are your memories of that time?Virginia: Dr. King was marching and being jailed in Alabama, in South Carolina, in Georgia. Then he came to Washington in 1963 for the March on Washington. Ben and I were able to be a part of that march, and then rush back to U Street to be in the Chili Bowl.We left that speech with enthusiasm and hope. And now we've got all these young people out there doing the same thing. I think it's going to have an impact. You've just to keep the pressure on. Our people have suffered long enough now.Vida: The energy is inspiring. Mom said she wants to see positive change before she leaves this earth. I hope it’s long before she leaves this earth, but I take that as a responsibility to do all I can.There were also riots after Dr. King was killed. What was the aftermath like?Virginia: The neighborhood was literally destroyed. There was a curfew in place for three nights. The National Guard was called in. After the third night when the looting was done, we noticed that all these businesses had been burned out. They didn’t reopen. Our beautiful Black Broadway took a downturn that lasted for 20 years.When the city decided to build a subway system, they did a survey and found only three surviving businesses in the immediate vicinity: Industrial Bank, Lee's Flower Shop, and Ben's.How did you manage to stay afloat?Virginia: Well, we're conservative people. We worked hard. My husband worked at night and I worked during the day, seven days a week. Now our entire family is here. All three sons, my daughters-in-law. My granddaughter was there today. It's truly a family business.It’s lived through so much.Vida: It’s a legacy. When President Obama won his first election, our Mayor Fenty brought him to the Chili Bowl for his first public outing. That's something I'll never forget.Outside Ben’s\nPHOTO BY KELLY MARSHALLPeople are in the streets now, fighting for racial justice in this day and age. How do you see Ben’s—which has changed so much in order to stay open, all while donating meals to hospital workers and the elderly—role in the movement this time around?Vida: I think the big difference between then and now is that everyone came to Ben's because it was the meeting place. You had activists and city officials and demonstrators all meeting. Now, we can’t have that with COVID-19—but we can still do what Mom did in the '60s and feed people. The time will come to think about a new normal in the industry, but for now we’re putting all of our energy into keeping our doors open and representing a culture.Virginia: It's comfort food, served like you're at home in your grandma's kitchen. I think that energizes, and makes those protesters feel appreciated.Vida: When you're eating the chili, or the half smoke, or the beef dog, or the burger, it's way more than that. It's the love, the culture, the history, the warmth. When we hand something to someone who is demonstrating, we're handing all of that, in a sandwich.It’s the perfect way to keep people going spiritually, emotionally, physically.Vida: We were really touched by how many generations showed support during the closures. Guests were asking, “How can we help you guys? What can we do?” Some of them donated to our foundation, the Ben's Chili Bowl Foundation—we took that money and used it to feed the community. We said for every dollar that came in we'd give it back. You wonder what tomorrow will bring, because there's so much uncertainty, but the warmth of the community is what makes it easier.Virginia: This has been our calling for more than 60 years. It's what we do. You just have to calm yourself and speak softly. A soft answer turneth away wrath, right?This interview has been edited for clarity and length. Emma Wartzman contributed reporting.Explore Bon AppétitWashington, D.C.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-23", "author": ["Condé Nast", "Ryan Walker-Hartshorn"]}