{"id": "53aa601d71c43d27a00ef23a96d67ad3", "url": "https://www.bonappetit.com/recipe/blackberry-and-dried-apricot-slab-pie", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Blackberry and Dried Apricot Slab Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueBlackberry and Dried Apricot Slab PieBy Samantha SeneviratneJuly 6, 20213.9(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis blackberry and dried apricot slab pie from expert baker Samantha Seneviratne travels well and feeds a crowd, making it picnic-perfect. The filling features tart and juicy blackberries, as well as dried apricots rendered soft and chewy by rehydrating in wine. (Using dried helps control excess juiciness, preventing the crust from becoming soggy.)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonMedium Saucepan$39 At AmazonFrench Rolling Pin$17 At AmazonPastry Brush$9 At AmazonWire Rack$23 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketIngredients12 - 16 ServingsDough2½cups (313 g) all-purpose flour3Tbsp. granulated sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1cup (2 sticks) chilled unsalted butter, cut into piecesslab pie2cups chopped dried apricots½cup (100 g) granulated sugar½cup dry white wine½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½vanilla bean, split lengthwise3cups fresh blackberriesAll-purpose flour (for parchment)2Tbsp. unsalted butter, cut into small pieces1large egg, beaten to blendGlaze (optional)4oz. cream cheese, room temperature¼cup (packed; 50 g) light brown sugar1Tbsp. unsalted butter, room temperaturePinch of kosher salt2–3Tbsp. warm milkPreparationDoughStep 1Pulse flour, granulated sugar, and salt in a food processor. Add butter and pulse until mixture is the texture of coarse meal with some larger pea-size pieces. Drizzle in 6 Tbsp. ice water and pulse until dough is evenly moistened. It should hold together when squeezed but not be too wet. Add up to 2 Tbsp. more water if needed. Divide dough in half. Form each into a rectangle and wrap tightly in parchment paper or plastic. Chill at least 1 hour.Do ahead: Dough can be made 2 days ahead. Keep chilled.slab pieStep 2Combine apricots, granulated sugar, wine, salt, and ½ cup water in a medium saucepan; scrape in seeds from vanilla bean and add pod. Bring to a simmer over medium heat, then reduce heat to medium-low and cook, stirring often, until apricots are plump and sticky and sauce is thick, about 10 minutes. Remove pan from heat and stir in blackberries. Chill filling until cool, 45–50 minutes.Step 3Preheat oven to 400°. Roll out 1 piece of dough on a lightly floured sheet of parchment to a 12x10\" rectangle. Using parchment, transfer to a rimmed baking sheet. Top dough with filling, spreading out in an even layer and leaving a 1\" border all the way around the edges. Dot butter evenly over filling. Roll out remaining piece of dough to a 12x10\" rectangle. Brush egg on exposed dough around filling, then lay remaining rectangle of dough over. Seal dough by pressing edges together with a fork. Trim ⅛\"–¼\" off each side with a paring knife. Cut four 3\" slits in top of dough. Cover pie and freeze 15 minutes.Step 4Uncover pie and brush top with egg. Bake until deep golden brown and crisp, about 40 minutes. Transfer baking sheet to a wire rack and let pie cool before slicing and serving.Glaze (optional)Step 5While the pie is cooling, whisk cream cheese, brown sugar, butter, and salt in a small bowl until smooth. Whisking constantly, add milk a little at time until glaze is thick but still easy to drizzle. Drizzle over pie while still warm.How would you rate Blackberry and Dried Apricot Slab Pie?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWho decided to add a vanilla bean to the fruit mixture. The vanilla completely overpowered the fruit. As a consequence the flavor was off putting and a waist of  both my time and the fruit!!!John GuthrieSan Carlos CA10/12/2021I make slab pies all the time and have been making them for years, you can use any combination of fruit you like. Some great ones to try: apples and berries, stone fruit and berries, sour cherry.  To ensure correct sweetness, taste your fruit and then add sugar according to taste, always add fresh butter dotted over your fruit, and to ensure no soggy bottoms, add a little flour or cornstarch to your fruit - more if it's really wet after sitting for 10-15 minutes, less if not too wet after it sits. You can add all kinds of fun spices to your fruit too, I like cardamom with stone fruit, cinnamon and lime zest with sour cherries, cinnamon and ginger with apples. Experiment and have fun, your guests and family will be grateful you made them a pie! Bianca 4SOakland, CA8/8/2021The recipe worked beautifully, but I didn't love the dried apricots. They tasted great when the pie was fresh out of the oven, but the next day got very chewy and overly sweet. I'm going to try to make this with different fruit.RachelFL8/4/2021Yes, you can use other fruit.  We used half the apricots, and blueberries and raspberries fresh off the stem. We hated the giant pop-tart idea, and used a big tart pan instead of a rectangle.  Result: a giant circular pop-tart.  But very good eating!AnonymousMilwaukee, but cooking today in Vermont.7/29/2021Can other fresh or frozen fruit be used to make this?MelAlbany,OR7/26/2021Just wondering: \nNext time, couldn't I divide the dough, roll out the pieces to the same dimensions, and cut into sections that could lie atop each other and make little sealed pies?  ( I sometimes \"cook\" with a ruler so my pieces would be \"pairs.\") \nAnonymousCharlotte, NC USA7/26/2021Just don’t care for blackberries. Can you think of substitution that would end up with same consistency and no soggy bottom? GayPhiladelphia 7/25/20211/2 cup sugar isn't enough. 1 cup or more makes a world of difference!Monica7/21/2021Explore Bon AppétitPieDessertAmericanDried ApricotDried FruitFruitBlackberryBerrySummerEasyNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Samantha Seneviratne"]}