{"id": "53bea42a636caf4a526b8ad720010c62", "url": "https://www.bonappetit.com/story/party-tricks-big-dip-energy", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Bless Your Next Party with Big Dip Energy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBless Your Next Party with Big Dip EnergyAin't no party like a Dip Party!By Alison RomanMay 9, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Amy WilsonFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Many people will tell you that all you need to throw a good party is some booze, loud music, and fun people. But those people are wrong. It’s not a “good party” unless there’s dip, preferably many different types (at least three). If the idea of preparing more than one dip feels overwhelming, just know that a Dip Party need not be a laborious affair. The dips can be as involved (from-scratch 7-Layer) or uninvolved (open a package of hummus) as you want, but as with most things, I prefer somewhere in the middle: Something that takes about five minutes to make, can be done ahead of time, and doesn’t require hauling out any special equipment.Since I am a CDP (Creamy Dip Person), this means starting with store-bought sour cream, Greek yogurt, cream cheese, or ricotta. (And at least one tab of Lactaid, if we're being honest). Season your dairy product of choice with a good amount of kosher salt, freshly cracked black pepper, and fresh lemon juice before continuing. Be generous: It should be salty, tangy, and extremely delicious all on its own. If I were making dip just for me, I could stop here—yes, I will happily eat seasoned cream cheese straight from a bowl—but I do like to class it up for guests with several different mix-ins.When it comes to what you can and cannot add to your creamy dip base, there are truly no limits. Similarly to how one would assemble a boyband, for a truly successful Dip Party, all dip demographics must be represented: You’ll need the toasty, nutty one (turmeric + tahini + labne!), the tangy, herby one (lemony salsa verde + yogurt!) and my favorite, the fiery, spicy one (chile oil + ricotta!). Regardless of flavor combinations, it’s important to be mindful not to accidentally thin your dairy base out too much (i.e., adding too much lemon juice, buttermilk, etc.). There’s a fine line between dippable and pourable, and you don’t want to cross that line.For your chosen vehicles, do not feel limited to crackers—prepared raw vegetables, tiny toasts, and/or chips are all invited to the Dip Party, as long as they are sturdy enough to hang (no flimsy \"crispbreads\" or crushed potato chips allowed!).Go forth, my friends, and may your next party radiate with Big Dip Energy.Also: Don't forget to keep those drinks cold!How to Keep All That Party Booze Cold—Without Using Your FridgeWhen Alison Roman hosts, the wine goes in the bathroom, not the kitchen.View StoryExplore Bon AppétitBasicallyParty TricksDipEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Alison Roman"]}