{"id": "53ca4bd620706fa0c932297d543a9b85", "url": "https://www.bonappetit.com/story/ramadan-running", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "When the Non-Muslim World Flattens Me, I Run During Ramadan to Feel Human Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen the Non-Muslim World Flattens Me, I Run to Feel Human AgainThe body screams, the muscles loosen, and the mind empties.By N.A. MansourMay 12, 2021FacebookTwitterEmailIllustration by Amina BouajilaFacebookTwitterEmailWeeks before Ramadan begins, my friends and I talk Ramadan strategy. We obsess over the details in texts and voice notes, sometimes a phone call—though those are trickier with our different time zones. My community is scattered across the globe. My parents worked in Singapore, Taiwan, Qatar, and more throughout my childhood; wherever they went, I went too—including Palestine, where my father is from (though I’ve never been to Mexico, where my mother’s parents were born). I went to college in the U.S., but I’ve rarely stayed in the States for longer than seven months—until the pandemic.Ramadan prep hasn’t changed much, though, because each Ramadan is different, and fasting must be tweaked accordingly. Everyone has their own approach. This year a friend boldly announced via voice note that she’d be drinking coffee at suhoor. Others reported they are easing their kids into Ramadan with half-day fasts—the beginning of a lifelong lesson in how giving up food from sunrise to sunset can be an act of divine love. And because they know me so well, my friends ask how I’m going to run this year. They know it grounds me and, with little exception, I cannot give up running for Ramadan. I enjoy these exchanges, but I wonder if they’re special because non-Muslims often don’t see me as a complex human being.However open I am to my Muslim friends, I talk less and less about my personal life with many of the non-Muslims I know. I’ve learned to do this especially around colleagues. It’s ironic because we’re historians of Islam, but people who study Islam don’t necessarily understand Muslims. This comes up when they ask about my Ramadans. Once, while I was living in Cairo, another foreign historian invited me to talk shop in the gardens of a liberal arts university. I nodded blankly as she ran through the standard laundry list of complaints—particularly how ungrateful Egyptians were to her, a white woman, for writing their history. Then, maybe because she noticed she was the only one talking, she brought up Ramadan, which wasn’t for a few months. I could feel it coming, that expectation of what a Muslim is or isn’t; by now, I can see the signs like small tremors before an earthquake. So I wasn’t surprised when she asked, or rather stated, “Do you fast? You must. Do you break your fast on dates?”In a split second, I processed the implications of this narrow question. There is no one way to fast, as there is no one way to be Muslim. I have prayed jumaa in mosques in Seoul, where the khutba was spoken in three languages. I know what it’s like to break my fast on olives and honey I harvested on my own land, in Palestine. And many are exempted from fasting: people who breastfeed, or those who have diabetes. I wanted to say this all to my fellow historian but instead chose to challenge her assumption.“I break my fast after I finish running, on a sports drink,” I said.I could practically see her brain stop working. She was silent for a moment, but soon proceeded to lecture me about dehydration and how I was damaging my body.I float away to a place where I can imagine futures shaped by my own hand, ones in which I no longer spend time convincing people who I’m supposed to be.Even though I didn’t see her again, I’ve encountered many people like her, people who assume I’m as flat as a piece of paper, that upon the paper is a list of rules, and that I am those rules. Sometimes, they assume Islam is this otherworldly thing, transcendental and loose. When I was living in Istanbul, an acquaintance commented that I must have so much inner peace because I pray. An activist I know called a close Muslim friend of mine so “ethereal” she walked on air. I try to push back against these snap judgments. But when I do, especially in non-Muslim spaces, a crushing feeling overtakes my chest. I worry I won’t say the right thing. I am slowly realizing, for all my knowledge of Islam—be it lived, theological, or historical—I don’t know how to be a Muslim in non-Muslim spaces. Some days I am happy to engage, to tell stories of what Islam can be; others, I get angry. So I go for a run.l love running, not because I’m good at it, and not because it’s exercise. To me, running, like Ramadan, is about letting go of this world. The act is a simple loop, putting one foot forward as the other swings ahead. As I settle into my pace, my soul bounces around its earthly confines, almost breaking free. I’m hyperaware of my surroundings—of cracks in the sidewalk, of a middle-aged white man staring at my light pink headscarf. But I’m also floating away to a place where I can imagine futures shaped by my own hand, ones in which I no longer spend time convincing people who I’m supposed to be.Like with running, when I fast properly, an electricity runs through my body, the same way it does when I invoke Allah, saints, prophets, messengers, and angels. I feel like I can see who I am, and who I want to be, more clearly. It’s an explosive feeling, but also one of grounded contemplation.My friends understand this. They are curators, activists, scholars, dads and moms navigating non-Muslim spaces. They too are constantly told what Islam is, by acquaintances or strangers; and some of their stories are more violent than others. They also know what it’s like to have something of their very own, that feels like praying or fasting, something private and imaginative, like what running is for me.Maybe this mess of feelings will come up when my friends and I talk after Ramadan. We’ll chat and tease each other about what fasting tricks did or didn’t work. The friend who tried coffee at suhoor has emerged victorious; she stays hydrated by drinking three liters of water along with her AeroPress brew. I have my own discoveries: As this was the first Ramadan I’ve spent close to a Mexican-American community, I realized what my ancestors always knew: corn—in the form of tamales de coco—will sit in the stomach all day, staving away hunger. I buy them in bulk and toast them up on a hot comale for suhoor.Or maybe I’ll skip my anxieties. My friends know them already. Instead, I will talk about something good, something about Ramadans past, when I felt Muslim in Muslim spaces. I often think of one moment, not too long ago, in Istanbul. There was an older man who stood at the mosque door as people filed in for Taraweeh. Each night he brought a box of lokum—the classic rose, lemon, and pistachio combo box—and handed out the sweets. One night, as he gave me a piece, I thanked him and asked if I could sit with him for a while on a nearby stone ledge. He told me he did this every Ramadan for as long as he could remember. He didn’t smile, but I could see his quiet contentment.“I want to be like you,” I told him.He handed me three more pieces of lokum. I had just run three miles on the Bosphorus. There was powdered sugar all down my scarf, and I could feel myself settling into the high that comes from Ramadan, Taraweeh, and running, when the body screams, the muscles loosen, the mind empties—that explosive feeling that floats me away.Explore Bon AppétitHealthyishRamadanessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-12", "author": ["Condé Nast", "N.A. Mansour"]}