{"id": "53ceda1d3353d4adaf57bdb7f7717fb1", "url": "https://www.bonappetit.com/story/pantry-excavation", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Banana Bread, Comfort Me, Dammit! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBanana Bread, Comfort Me, Dammit!I’m baking with the random flours I’ve accumulated, plus, what the rest of the BA staff is excavating from their pantries.By Alex BeggsMarch 21, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Optimism bakingI made Chris Morocco’s buckwheat banana bread at the start of the week, finally. I’d had it pinned for years. I snuck the espresso powder from the frosting into the batter, which is the closest I’ll ever get to working for NASA. I love the way doctoring up a recipe makes you feel like some kind of Mensa genius. “You know, the soup was perfect as-is, but I added a bay leaf and a cat hair and it simply pushed things over the top!”Bake it: Buckwheat Banana CakePhoto by Alex LauIt was a long weekThis week in my (somewhat) quarantined home, an all-out fight broke out about apples. Not like, some Lord of the Flies stuff, but an argument resulting from trying to convince a high-risk loved one that the old way of daily shopping—three avocados here to “ripen on deck,” a “backup” loaf of bread there—is putting us at a potentially higher risk, putting others in the city at risk, and frankly unnecessary considering our stocked pantry. That maybe even this high-risk person...shouldn’t be doing the shopping at all.It didn’t work. Suddenly the boring, chore-y act of popping in a store and feeling a few ‘cados for ripeness seems to represent all that’s left of free will.And I know I’m not the only one in this unnecessary feud. It’s been written about in The New Yorker. A friend asked me if I had any good talking points she could give her dad, who’s running errands around town like it’s Normal Times. “They didn’t work!” I lamented. I’m exhausted and unfunny right now. But I’m hoping for the best.Want this letter before it hits the website? Sign up for our newsletter!Photo by Hilary CadiganThe pantry depthsThis week, Bon Appétit staffers mined their pantries for treasure and this is what they excavated:Hilary Cadigan popped open a bottle of...Ikea ketchup. “I like the Nordic simplicity of the bottle,” she reviewed, “and it’s a teensy bit on the sweet side but overall well-balanced, with a nice spice action—you can actually SEE the spices suspended in the goop.”I dug out Runamok’s coffee-infused (!) maple syrup and drizzled it over that banana bread mentioned earlier, crisped up in a cast-iron with butter.Jesse Sparks found spicy cocoa powder he’s going to experiment with. Cookies? Hot cocoa?Christina Chaey discovered a ton of roasted seaweed sheets. One package was rancid (“if you're wondering how I knew, YOU KNOW”) but she’s going to use the rest to practice her onigiri technique.MacKenzie Fegan unearthed her fiancée’s ex’s “enormous payload of gluten-free pasta and noodles, plus one box of gluten-free Bisquick” in her cabinets. “The most upsetting item is this ‘shirataki spaghetti,’ which is made from the type of yam that my family was forced to eat for survival during the Cultural Revolution in China. It comes packaged in a liquid-filled sac.”Aliza Abarbanel shrugged and made a smoothie with CBD-infused honey packets. “Yes, I'm a parody of myself.”Chris Morocco’s all about Patak's Mango Chutney. “Damn, with some curry, daal, basmati, etc...it brightens everything and gives lovely sweetness.”A Zoom of one’s ownWhen you tell Andy a joke and he tries to hide his reaction:(Courtesy of Christina Chaey)When your internet connection slows because everyone’s working from home at the same time:Sohla, tell me about those oystersOn Instagram this week, I saw Sohla El-Waylly cracking open a pile of OYSTERS. WHAT. SOHLA. HOW. The celebratory scene stemmed from a sad one. Her husband’s restaurants closed this week and everyone was laid off. The employees divided ribeyes, oysters, all the good stuff. It was a small consolation. “It helped to have a good night in a sad situation,” she said.Read more: Here’s how you can support the restaurants you love right nowPhoto by Alex Lau, Food Styling by Judy ManciniQuaran...tiniPeople I love keep sending me “quarantini” memes and I can’t help but find the name catchy. My ...quarantini... has been actually going to the trouble of shaking my margarita in a shaker instead of simply squeezing lime over tequila. This is the cocktail equivalent of putting jeans on to work from home. How considered. How decent.Get the recipe: MargaritaPhoto by Gentl & HyersPantry pankoI made one of the best simple pastas this week, a 2017 Andy Baraghani recipe, for bucatini with swiss chard (or whatever greens) and a topping of garlicky breadcrumbs. That extra step, tossing panko with garlic until it smells absurdly good, is something I’d normally be too lazy to do. But I’m starting to redefine lazy lately...Get the recipe: Bucatini with Swiss Chard and Garlicky BreadcrumbsUnnecessary food meme of the weekUnnecessary food feud of the weekI...don’t need any more of these this week, thanks!Explore Bon AppétitBeggs NewsletterRead MorecultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffcultureWhere to Buy Great Wine Online By Alex DelanyCoronavirusHow to Support Restaurants and Their Workers Right NowBy MacKenzie Chung FegancookingWhy I'm Still Having Happy Hour, Even At a DistanceBy Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-21", "author": ["Condé Nast", "Alex Beggs"]}