{"id": "53d524d2289679bda718dfe043dcecb5", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/democratic-coffee", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Democratic Coffee Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenDemocratic CoffeeOne more reason to love the library (or at least this Indre By one): buttery croissantsFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for the croissants (and a really nice pourover) at this friendly, not-too-geeky coffee bar, which happens to be part of the main public library in the old city center.ORDER THE: almond croissants and pour-overs. The coffee shop manages to serve some very tender croissants, and they’re serious about the coffee too, roasting their own beans.THE VIBE IS: well, democratic! Library folks (read students of all ages), trendy boutique workers, and pastry fiends flock here.PRACTICAL STUFF: Open every day Monday through Friday from 7:30 a.m. to 7 p.m., and Saturday and Sunday from 9 a.m. to 5 p.m.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEThe Coffee CollectiveA pour-over (and upcycled coffee kombucha) is always in reach, thanks to this mini chainLa BanchinaGet real R&R in at this Amager Harbor vegetable-focused restaurant with a few surprisesMirabellePlan a mini croissant- and yogurt-filled vacation at this café-like spot in NørreboroExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}