{"id": "53d87c37220bc2c2f93caa590ae6eabb", "url": "https://www.bonappetit.com/story/blender-sauce-ideas", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "How to Turn Salad Dressing Into a Week’s-Worth of Delicious Meals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Turn One Blender Sauce Into a Week’s-Worth of Delicious MealsWe’d eat just about anything with this spicy cashew dressing drizzled on top.By Aliza AbarbanelMarch 26, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailWhen cooking fatigue sets in and even our most beloved pantry staples start to feel stale, there’s only one thing to do: Make spicy cashew dressing. This super sauce is tasty enough to eat by the spoonful, and versatile enough to elevate a full week of meals.Developed by senior food editor Molly Baz, it blends together high-impact flavors like funky fish sauce, spicy red pepper flakes, garlic, bright rice wine vinegar, and nutty cashews (which are protein-rich and naturally fatty enough to replace about half the oil you’d typically need). The result? The silkiest, creamiest dairy-free sauce we’ve tried. It instantly improves just about anything, and can make random bits and bobs thrown together feel like a well-composed meal. Here are a few ways we love to use it.Upgrade a saladThis dressing was originally developed to add body and protein to a “dinner salad” with radicchio and roasted sweet potatoes, but pairs well with a variety of ingredients.Opt for sturdy greens (chicories, sliced cabbage, sliced fennel) and hefty mix-ins (rotisserie chicken, hard boiled eggs, crispy chickpeas) that can stand up to the thick dressing for hearty salad that doesn’t feel like a side dish.The one thing that would make this grain bowl even better? Spicy cashew dressing.\nOr throw together a grain bowlIf your fridge is low on produce but your pantry is overflowing with grains, use this dressing to anchor a satisfying one-bowl meal. Drizzle a few spoonfuls over a nutty farro, chewy wheat berries, or delicate quinoa, then mix in any herbs and cooked veggies you have on hand. All together, the dish will taste thoughtfully composed—even if it wasn’t.Smear it on sandwichesGive your jar of mayo the day off. Stir a dollop of dressing into smashed chickpeas or slather a spoonful onto toasted bread to shake up your turkey sandwich game for good.Dress up soba noodlesIf you’re a fan of noodles coated in peanut butter or tahini-based sauces, try tossing soba, rice noodles, or fresh ramen in some spicy cashew dressing. Place your cooked, drained noodles in a big bowl and add a few tablespoons of dressing at a time, tossing in between, until every noodles is coated. Add in tempeh crumbles, sliced Persian cucumbers, chopped cabbage, or shredded chicken.Use it as a dipHold back a few tablespoons of warm water before blending to make a scoopable dip for crudités, potstickers, and any other odds-and-ends hanging out in the fridge. Go ahead, plunge in your loose carrots, roast chicken, and other leftovers yearning to break free.Get the recipe:Spicy Cashew DressingInspired by the nut-based Caesar dressings at NYC’s Lalito and Scarr’s Pizza, our version starts with roasted cashews.View RecipeExplore Bon AppétitSaladSauceHealthyishRead MoreLifestyleYou Don’t Need a Recipe to Make a Damn Good SmoothieBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-26", "author": ["Condé Nast", "Aliza Abarbanel"]}