{"id": "54012813bfeed976baf28e0bd430784b", "url": "https://www.bonappetit.com/story/motzi-bread-baltimore", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "My New Life Goal Is to Make Motzi Bread My Local Bakery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy New Life Goal Is to Make Motzi Bread My Local BakeryYes, I'm considering moving to be closer to bread. By Sarah JampelOctober 5, 2020FacebookTwitterEmailPhoto by Nathan MitchellFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When I go to Baltimore, my parents think I’m there to visit them (and their cats), but I’m actually in town for the baked goods from Motzi Bread. In addition to drop-in business, Motzi offers online ordering for pick-up on Thursdays and Sundays. To the great joy of my family, I’ve made it a point to place an order whenever I’m in town.We’ve tried the hearty people’s loaf (good for slicing and sandwiches); the generously-sized English muffins; the delightfully sour classic; the millet raisin, which has more raisins—and plump ones, too!—than any raisin bread I’ve ever encountered; the earthy, seed-spackled benne rye (my personal favorite); and the almost molasses-y chocolate chip cookies, which are brimming with single-origin, bean-to-bar Askinosie chocolate. I have yet to meet a Motzi Bread baked good I won’t devour—and because they frequently add new items to the menu (like end-of-summer focaccia with peaches and rosemary, apple challah for Rosh Hashanah, and cardamom buns), I’m always finding something new to try.The people's loaf at Motzi Bread. \nPhoto by Nathan Mitchell The owners, Russell Trimmer and Maya Muñoz, live directly above the space, where they mill their own flour from grains sourced from farms in the Chesapeake Bay region, like Migrash Farm and Next Step Produce. Even their pastries and sweets—which are as rich and buttery as pastries and sweets should be—are naturally-leavened and 100 percent whole-grain, meaning that they’re also incredibly flavorful. (My mother-in-law and I spent more time than was reasonable naming all of the tasting notes in the chocolate chip cookies. Is that...treacle? Espresso? Wheat germ?)Even more important than the delicious bread is Trimmer and Muñoz’s commitment to their neighborhood, the Harwood section of Charles Village—it’s a cornerstone of their business rather than an afterthought. “We feel very responsible to Baltimore, for what it’s given us but also for its history of white supremacy, including red-lining and divestment from schools. It’s our responsibility to do what we can for the place we’re in,” they told me. Rather than expansion, “our focus is on what the neighborhood is looking for in a bakery.” Their pay-what-you-can policy means that no one is turned away, and the $5 “pay-it-forward” option on the ordering form allows customers to purchase a loaf for someone in need.If I lived in Baltimore, I would eagerly join their weekly subscription service, which allows Motzi to build lasting relationships with their customers while ensuring a baseline revenue to help keep their small business stable. Subscriptions are currently sold out, but when they’re back in stock, I’ll be signing up my parents immediately. Bread for them—and more visits for me.Go there: Motzi BreadExplore Bon AppétitHighly RecommendBreadBaltimoreRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-05", "author": ["Condé Nast", "Sarah Jampel"]}