{"id": "5402e586cb6d76ea63f44136be0fcc60", "url": "https://www.bonappetit.com/story/california-veggie-sandwich-newsletter", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "I Love This Veggie Sandwich at Least as Much as My Actual Children | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Love This Sandwich at Least as Much as My Actual ChildrenA weekly dispatch from Bon Appétit food director Carla Lalli Music.By Carla Lalli MusicJuly 12, 2018FacebookTwitterEmailGentl & HyersFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.So, where do recipe-babies come from?I have worked at Bon Appétit for 6 years and 48 weeks, which means that in less than a month, this job will be turning seven. That’s old enough to have outlasted many marriages, the lifespan of New Coke, and every bathing suit I’ve ever owned.The advantage of this milestone is not only that my coworkers remember me before I had any gray hair, when I was regularly pitching stories about food and marijuana (I was super fun back then). Now that I have seniority—it comes with the gray hair, as it turns out—I can point to lots of recipes we’ve published and say, obnoxiously, “That one was my idea!” Here’s the way it goes around here: when my pitches get approved, and those assignments yield recipes, the finished dishes are my sassy recipe-babies. This is true even when someone else in the Test Kitchen actually develops, finalizes, and writes the recipe, which at Bon Appétit we refer to, lovingly, as “creative collaboration.”Want this letter before it hits the website? Sign up for our newsletter!One of my most prized recipe-babies is Chris Morocco’s expert rendition of the California Veggie Sandwich, which we welcomed into our Bon Appétit family in August 2016. Like Chris Morocco himself, the California Veggie is an icon. If you consider yourself a sandwich connoisseur, but you don’t have immediate visual recall of this handheld masterpiece, then you don’t really know anything about sandwiches and I’m not sure we have that much in common after all. Just saying. This sandwich, with distinct layers of avocado, sliced pickled carrots, lettuce, sprouts, and cucumbers, deserves some recognition. Perhaps because it’s vegetarian, the C.V. operates on a higher plane, propelled by a tight architectural structure, delightful mix of snappy, creamy, and shreddy textures, salty-sour pickled things, and just enough creaminess to keep it from feeling too virtuous. One of those creamy-fatty things is avocado, which Chris smartly deploys as a lightly smashed and seasoned layer so it doesn’t go slipping and sliding out the side when you take a bite.Most of the time we spent raising this sandwich was harmonious, but Chris and I had to collaborate very creatively about whether it would be better with sliced cheddar or Muenster, or, as he brazenly suggested, goat cheese. For me, it had to be Muenster, the ‘70s-era hippie cheese of choice, but I was willing to compromise on cheddar. The goat cheese thing, though—it was like I didn’t recognize my own child. But here’s the thing about having offspring, or developing recipes: One day they become fully realized beings, and you don’t get to pick out their outfits anymore. And you have to be okay with that. The goat cheese layer, as Chris elegantly argued, is the obvious complement to the avocado, two creamy smashed things anchoring their respective slices of bread to the stack of ruffled, sliced, fresh fillings in the middle. The tangy, crumbly goat cheese is the yin to avocado’s creamy, rich and mellow yang. He was right. This is what parenting is all about.When a recipe-baby is ready, we send it into the world. But I, for one, never forget where they got their start. With me!! They all started with me. And, okay fine, with the other amazing people who work here and care just as much about sandwich architecture as I do, even though I’ve worked here for longer.Get the recipe:California Veggie SandwichView RecipeExplore Bon AppétitVegetarianCarla NewsletterSandwichRead MoreWylie Dufresne’s Scrambled Egg SandwichSpiced Sweet Potato Sandwich with FetaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Carla Lalli Music"]}