{"id": "541a51e1eba25264135ea6e03cb19fff", "url": "https://www.bonappetit.com/story/ashapops", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "This Flavorful Popcorn Look-Alike Is Made From Puffer Water Lily Seeds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Can't Stop Munching On This Fluffy, Flavorful Popcorn DupeAshaPops are light, tasty, and made with only a handful of unprocessed ingredients. By Amber GibsonFebruary 26, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!Before I tried AshaPops, I had never heard of water lily seeds. My glamorous actress friend from Los Angeles introduced me to this puffed, crunchy version, and I was immediately blown away by how light and flavorful they are. What’s more: Unlike most processed snacks, each variety is made from only a handful of ingredients.Once I AshaPop-ped, I couldn’t stop. The vegan cheese flavor, seasoned with nutritional yeast, extra virgin olive oil, and onion powder is like a gourmet, healthier take on Cheetos. The chili lime variety has just the right balance of tang and heat. And the earthy and umami-packed turmeric is my favorite of all. I’m not really a sweet tooth, but for those among us there’s a delicious dark chocolate flavor dusted with cacao powder and coconut sugar.While water lily seeds were new to me, I’m Chinese-American and grew up eating their cousins: candied lotus seeds. They often get confused for each other, but water lily seeds come from a different genus of flower grown in various temperate and subtropical climates, and they have a completely different texture. When candied, Chinese lotus seeds are denser, nuttier, and more starchy, while AshaPops puff their water lily seeds into a lighter, fluffier popcorn-alternative.As with many trends, water lily seeds aren’t actually new; the grayish-black pods have been consumed for thousands of years throughout India, according to Ayurvedic traditions, which deemed them to have anti-aging and anti-inflammatory properties. That’s how AshaPops founders, mother-son duo Asha and Jai Farswani, had the idea to combine modern flavors with the ancient Indian ingredient. They work directly with small family farms in Bihar, an Eastern state bordering Nepal, to import the water lily seeds, which are then seasoned and popped in L.A.The resealable bags make for a perfect portable snack, and unlike with chips, there are no messy crumbs to deal with. I love taking them on hikes and walks to the park, and they make a great crouton alternative to add crunch to my salads and grain bowls. Though, let’s be real: The bags may be resealable, but I always finish my AshaPops in one sitting.AshaPops Variety Pack$20 at AshaPopsExplore Bon AppétitHealthyishHealthyish Loves ItShoppingSnackRead MoreLifestyleThis Tangy-Sweet Drink Is Made From Avocado PitsBy Paul O. MimsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-26", "author": ["Condé Nast", "Amber Gibson"]}