{"id": "541b0bd6c21d248039a87b4119d81c12", "url": "https://www.bonappetit.com/story/lightly-brewed-sparkling-tea", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "This Sparkling Tea Changed the Way I Feel About Sparkling Tea | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI'm Now A Person Who Drinks Lightly Brewed Sparkling TeaMost sparkling teas are too syrupy and sweet, but Minna's unsweetened teas are straight-up refreshing.By Alex DelanyJune 22, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!If I were to describe my ideal beverage in four words, not a single one would be plucked from the phrase \"lightly brewed sparkling tea.\" But if you were to magically appear on my roof on a summer weekend afternoon, you’d see me lounging in a chair, drinking a beautifully designed can of...lightly brewed sparkling tea.This is a testament to either A) an intensifying identity crisis that I am undergoing or B) the straight-up delectability of Minna sparkling teas. For the sake of reputation, I’m going to say it’s the latter.I’ve always steered clear of sparkling teas because they tend to be so syrupy and sweet, but Minna’s three flavors don’t have any added sugars. The tropical green tea is filled with hints of passionfruit and pineapple, and the citrus black tea ropes in tannins and bright citrus for a spritz-like experience. But the lime hibiscus tea is currently riding high at the top of the sparkling tea power rankings. The tang of the lime and the delicate floral nature of the hibiscus make me feel like I’m drinking the world’s lightest Berliner weisse, which—as those who know me even in the slightest will attest to—is a beverage I enjoy a lot.I really didn’t see this newfound love coming. But in a world of syrupy tea drinks, Minna is the shining light(ly brewed sparkling tea). —Alex Delany, associate editorBuy it: Minna Organic Sparkling Tea, $26 for a 12-pack.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishIced TeaShoppingRead MoreLifestyleThis Is My Non-Alcoholic Drink of the SummerBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-22", "author": ["Condé Nast", "Alex Delany"]}