{"id": "5427f08de729f120be079227edff4621", "url": "https://www.bonappetit.com/story/use-more-herbs", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "How to Prevent Your Herbs From Wasting Away in the Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Prevent Your Herbs From Wasting Away in the FridgeAdd ‘em by the handful, not by the pinch.By Sarah JampelMay 9, 2019FacebookTwitterEmailTED+CHELSEA CAVANAUGHFacebookTwitterEmailWe’re all familiar with the dreaded market-to-compost pipeline: You buy a whole bunch of herbs for a recipe, pluck a few leaves for garnishing, and then let the rest languish in the crisper drawer, never to be seen until the day they die a sad, wilt-y death.How can you break the cycle? It’s simple: Just use more herbs. Instead of adding them by the pinch (a teaspoon of chopped mint here, a precious parsley leaf there), add them by the handful. It might sound silly, but trust us: This is groundbreaking stuff.There’s a good chance that a recipe that calls for a couple teaspoons or a few tablespoons of chopped herbs can handle a bit more. If you’re using a versatile, cuisine-crossing soft herb like basil, parsley, mint, dill, or cilantro, consider the called-for amount as a guideline rather than a commandment. (With super-pungent herbs like oregano, marjoram, or tarragon, however, we suggest treading more lightly.)  Even if a recipe doesn’t call for herbs at all (blasphemy!), there are plenty of dishes that will nearly always benefit from a mess of your chopped-up orphan herbs: a frittata, any green or grain salad, your standard-issue yogurt dip.MAKE. IT. RAIN.\nTED+CHELSEA CAVANAUGHSo be generous: You’ll be rewarded with ordinary meals that feel fresher and more alive—like a room where you just opened up all the windows! Like the first day that’s warm enough to feel a breeze on your bare legs!—and you’ll have saved your precious greens from unjust demise.If the situation really gets dire—say, you’re planning to skip town in the morning and staring down three older bunches—sauce is the solution: Green sauce—whether it’s chimichurri, pesto, salsa verde, or something you just made up by mixing and matching herbs, oils, and vinegars in your food processor—comes together in minutes and tastes as good smeared across a slice of toast as it does spooned over seared fish or plain old scrambled eggs. And since green sauce lasts for weeks in the fridge, you’ve just given those bunches a new lease on life.Or, even better, stash some green sauce in the freezer: You’ll thank yourself next winter, when fresh, vibrant bunches are few and far between, and the thought of letting one wilt is truly unimaginable.Just chop 'em up and throw 'em in a salad dressing!Every Night Salad with Yogurt RanchThis crunchy romaine number, drizzled with a creamy, craveable yogurt-based homemade ranch dressing, is the kind of salad that goes with just about anything, from delivery pizza to pan-seared pork chops.View RecipeExplore Bon AppétitBasicallyherbParsleyBasilDillCilantroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Sarah Jampel"]}