{"id": "54361e8bd6f51d02399abf21ff1d3274", "url": "https://www.bonappetit.com/story/gardettos-rye-chips", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Will a Bag of Gardetto’s Rye Chips Redeem Me in the Eyes of My Family? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWill a Bag of Gardetto’s Rye Chips Redeem Me in the Eyes of My Family?Nobody remembers my Chex Mix transgression, but I’m still hopeful the crispy, garlicky snacks will make up for it.By Sonia ChopraFebruary 7, 2022FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There’s a story I like (hate) to tell about the time I got caught in four hours of traffic on the way to JFK and almost missed my flight to New Delhi. I arrived at the airport so late that I couldn’t check luggage and ended up needing to buy a smaller suitcase from a pre-security kiosk. I figured it all out and eventually boarded my international flight with literally zero time to spare. Luckily, I’d packed light since I knew the trip would involve a lot of shopping. Unluckily, the four giant bags of Chex Mix I’d bought for my family (and to pad out my mostly empty suitcase) did not fit into my carry-on and were, regrettably, left behind.I’d planned not to tell any of my relatives about my near miss with disaster, but I didn’t quite anticipate their disappointment when the Chex Mix didn’t arrive on schedule. I had to fess up, and my brother, who was flying out a few days later, was enlisted to bring the bags I had failed to produce. Although probably everyone else involved has forgotten this story, it wouldn’t be completely inaccurate to say I have been trying to make up for my transgression ever since.Many immigrant families I know all have that one thing they bring their relatives when visiting from the U.S. For my grandmother in Delhi, it’s Chex Mix. She will put it out on the coffee table in her living room, where everyone gathers, in small bowls during teatime and anytime anyone needs a snack. Sometimes it’s nestled between plates of dhokla, sweet mithai, home-fried shoe-string potatoes, and other salty, crispy namkeen. Sometimes it’s a solo treat. It’s always beloved, but still, without fail, a week or so into a trip, someone will comment on how the best part of the mix is the rye chips, and everyone else will agree. We still eat all the rest of the mix, but you can definitely tell the rye chips are favored.Since my grandmother is never far from my mind (nor are my familial wrongdoings), I think about this a lot. So when I was recently deep in the middle of an online grocery order and came across Gardetto’s Rye Chips, something sparked in my brain. Were these the rye chips my relatives loved? I promptly ordered a few bags to try and found them to be crunchy, garlicky, and delightful, an ideal snack situation. I think still there is something to be said for the mix: The cereals and pretzels allow the rye chips to really shine. (In fact, the garlic rye chips were originally a part of a snack mix from the brand Gardetto’s, a Chex Mix competitor now owned by the same company before becoming a stand-alone “special request” product in 2006.) But whenever I finally get to go back to India, I’ll be taking a bag of Gardetto’s rye chips too in the hopes that I make up for the snacks I once left behind.Photo by Isa ZapataGardetto's Roasted Garlic Rye Chips$3 at Amazon$3 at WalmartExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-07", "author": ["Condé Nast", "Sonia Chopra"]}