{"id": "54406e9850f5b47abde3d72fb9eb675b", "url": "https://www.bonappetit.com/recipe/ham-cheese-and-onion-empanadas", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Ham, Cheese, and Onion Empanadas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHam, Cheese, and Onion EmpanadasBy Gaby Melian October 2, 20194.5(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis dough works with any filling, but was specifically designed for fried empanadas. It’s not the way Gaby Melian, who developed the recipe, learned to make them at home in Buenos Aires (typically, they’re baked, as in her beef empanadas recipe), but this version is still absolutely delicious. For this cooking method, it’s especially important to be careful with your crimping to avoid leaks or any “explosions.” Watch Gaby’s techniques here.IngredientsMakes about 40 (8 servings) Dough½cup (1 stick) unsalted butter, melted, slightly cooled1Tbsp. apple cider vinegar1Tbsp. kosher salt6cups all-purpose flour, plus more for surfaceFilling and Assembly1Tbsp. extra-virgin olive oil or unsalted butter2medium onions, choppedKosher salt, freshly ground pepper1Tbsp. dried oregano14oz. uncured slow-cooked ham, coarsely chopped1lb. whole-milk, low-moisture mozzarella, cut into ½\" pieces1Tbsp. cornstarchVegetable oil (for frying; about 6 cups)Special EquipmentA 4½\"-diameter cookie cutter; a deep-fry thermometerPreparationDoughStep 1Mix butter, vinegar, salt, and 2 cups lukewarm water in a large bowl until well combined. Gradually add 6 cups flour, mixing with a wooden spoon or your hands until a shaggy dough forms.Step 2Transfer dough to a lightly floured surface and knead until mostly smooth and no dry spots remain, about 2 minutes. Form into a disk, wrap in plastic, and chill until cold, at least 2 hours.Step 3Do Ahead: Dough can be made 2 days ahead. Keep chilled.Filling and AssemblyStep 4Heat olive oil in a large skillet over medium-high until shimmering. Cook onions, stirring occasionally, until golden and softened, 5–7 minutes. Season with salt and pepper; mix in oregano. Transfer to a large bowl and chill until cool enough to handle, about 20 minutes.Step 5Add ham to chilled onions and toss to combine. Taste and season with salt and pepper.Step 6Toss mozzarella and cornstarch in a medium bowl to coat (this will prevent the mozzarella from liquefying as the empanadas cook).Step 7Divide dough into 6 pieces. Cover all but 1 piece with plastic wrap and keep chilled. Roll out dough to a rectangle about 15x10\" and 1/16\" thick. Using 4½\" cutter, punch out 6 rounds. Roll out scraps to 1/16\" thick to punch out another round or two.Step 8Place about 1 Tbsp. ham mixture in the center of dough circle. Top with 1 or 2 pieces of cheese, breaking cheese up if needed. Using your fingers, brush water halfway around edge of each round. Fold dry side up and over filling to create a semicircle. Pinch edges to seal; crimp with your fingers. Transfer to a parchment–lined rimmed baking sheet. Chill while you repeat with remaining dough and filling. Chill empanadas at least 20 minutes before frying.Step 9Pour vegetable oil into a large heavy pot or Dutch oven fitted with deep-fry thermometer to a depth of 3\". Heat over medium-high until thermometer registers 350°. Working in batches of about 5 at a time and adjusting heat to maintain oil temperature, fry empanadas, turning often, until deep golden brown, about 4 minutes total.Step 10Transfer to a wire rack. Let cool slightly before serving.Step 11Do Ahead: Onion mixture (without ham) can be cooked 2 days ahead. Transfer to an airtight container and keep chilled. Empanadas can be filled 2 days ahead. Cover and keep chilled.Photo by Alex Lau, Food Styling by Pearl JonesHow would you rate Ham, Cheese, and Onion Empanadas?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThe filling is good, but the pastry was way too bland in flavor.  I'm glad I tossed out the remaining 6 pieces of dough after I made 6 because I was going to make a bunch more and flash freeze unbaked for the freezer.  I'll make the pastry dough again tomorrow morning, but add sugar and a pinch more salt. Vera MooreIdaho1/22/2021Can you bake this?AnonymousLA, Ca6/19/2020These came out great! I cut the recipe in half and it was fine. The only caveat \nI have is that there was really way too much mozzarella. Other than that, it was perfect.Evelyn McelroyPortland, Maine5/26/2020These were so delicious, and so hard to stop eating!  I am just a beginner cook, but the empanadas were surprisingly easy to make.  The dough wanted to stick to anything and everything, so be sure to keep lots of extra flour around.  I also made my empanadas bigger, because it got tedious making tiny ones, so they ended up a bit like calzones.  The filling of onion-ham-mozzarella with oregano was sooo mouthwateringly good.Toby CurtisEhime, Japan11/7/2019A great recipe. Used a twist on the Beef Empanada filling and it turned out awesome. In a similar situation to below commenter (small, hot apartment) so dough got warm really fast, but easy to stick in freezer for 5 min between batches. Some got a little stretched from working them too warm but I only had a couple tear on me. I actually prefered larger empanadas than called for since you got pack more filling in, but the small ones are also quite good. I ended up freezing some of them and tested frying from frozen and frying defrosted and both worked fine, so frozen-to-frier empanadas have been sitting in my freezer for quick dinners. Super great!AnonymousSomerville MA10/25/2019This was so good! My only complaint was that I feel like it took waaayyyy longer for the dough to get cold? I actually had to put mine in the freezer and do it in shifts. But! I have a small kitchen in a small apartment, so maybe it was just warmer than usual in there. But these tasted amazing, and even though they were time consuming, were really worth the effort. And I think you could also probably be very versatile with the filling! The dough in and of itself was really good. Will be making this again, probably with my own twist on the flavors! AnonymousNew Jersey10/21/2019Explore Bon AppétitSavory Pie & TartHamMeatMozzarellaCheeseSnackStarterNut-FreeDeep-fryEasterLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-02", "author": ["Condé Nast"]}