{"id": "5446eb8df7d9cb605e6377d1ed7eef7e", "url": "https://www.bonappetit.com/story/mediterraneo-houston-restaurant-astronauts", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Mediterraneo, the Houston Restaurant That Astronauts—and My Grandparents—Hit Up for Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Houston Restaurant That Astronauts—and My Grandparents—Hit Up for LunchAstronauts are hard to spot in the wild, but lunch hour is the great equalizer.By Alex BeggsJune 6, 2018FacebookTwitterEmailPhoto by Max BurkhalterFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.There’s a highway that runs through Clear Lake, Texas, called NASA Road 1. As you get closer to the space center, everything is on brand, like the Nasa liquor store, Nasa Chiropractic, Budgetel Inn Spacecenter Nasa, and Nasa Fast Food (a Vietnamese restaurant). When life hands you a theme, you go with it.Once you get to the actual space center, there’s a V in the road where two mini rocket ships, angled as if about to take off into the sky, signal your arrival. If you look closely, there are astronaut mannequin men at the helm, and after a few years, one of them has sort of slouched forward, the glass of the window gathering dust. Like the thousands of other NASA employees laid off throughout the years, the plastic man too seems affected by Congress’s illogical decision to cut the budget time and time again.The toy rockets were a local landmark in a stretch of copy-and-paste strip malls. My dad and I used it as a halfway point for long runs; it’s where you need to turn to pick up Grandma and go to church; and oh yes, we’re two blocks away from Mediterraneo Market and Café.Repeat to self: “Their safety in space depends on your quality on Earth.”\nPhoto by Max BurkhalterThe proximity to the space center is part of what brings the astronauts and NASA employees to Mediterraneo for lunch, but the reason our family eats there is because the Greek and Middle Eastern food is wonderful, the atmosphere cozy and welcoming, and for a family on a budget even tighter than NASA’s, the price makes going out to eat possible.Like those lowercase Nasa businesses, Mediterraneo also sticks to its theme, which is literally geography. The glass tabletops protect what appear to be printouts from MapQuest circa 2003. Maybe you’ll have the privilege of sitting at Morocco, where you can learn about the country’s population density, see postcards, and take in other educational imagery. By the end of the meal, the map will be covered with red baskets of pita chips, plops of spilled hummus, flakes of phyllo, and those little sticker rings that seal sets of napkins around flatware.The walls are painted habanero red and Castelvetrano green, but barely a square inch is left unadorned. They’re covered with framed photos of idyllic Grecian coastal towns, visiting celebrities thanking owners Magdy and Sonia Kotb for catering (Coldplay multiple times!), local awards and press, and NASA swag. There are astronaut class portraits (see class of 2012 at the checkout counter while you’re picking out some halva and Jordan almonds), expedition posters, and photos from rocket launches. When astronauts return home from months-long stints on the International Space Station, they might be welcomed with a party catered by Mediterraneo.I’m magnetically drawn to the silver aluminum trays of baklava.\nPhoto by Max BurkhalterMagdy and Sonia moved to the Clear Lake area decades ago from Egypt, opened the restaurant in 1999, and have contributed to the community in more ways than just offering a favorite lunch spot for government employees. They sponsor local arts events and festivals, and they recently fed hospital workers and first responders keeping the city together in the floods of Hurricane Harvey.Astronauts are hard to spot in the wild, but lunch hour is the great equalizer. They might be doughy dads wearing polo shirts with government ID tags at their belt. They might be performing in the band jamming on a Saturday evening on the slightly raised section by the windows. Or there might be the rare occasion where you walk in and spot the blue NASA jumpsuit with patches you had ironed on your backpack decades ago.The food, though. I’ll let my grandparents, loyal customers for decades, take it from here.Grandpa Jim recommends the moussaka, layers of spiced beef and creamy béchamel. But do not leave without at least two orders of spanakopita, which he pronounces adeptly, with a twang.Grandma Rose recommends the lentil soup, minestrone, or the tomato basil. The kebabs if you need grilled meat; and the mezze platter of dolmas, hummus, cabbage rolls, baba ghanoush, and hummus. If you need lunch wine and your medications allow, her favorite is the sweet Mavrodaphne.Left: Grandpa Jim’s moussaka. Right: Greek salad with olives (watch out for those pits).\nPhoto by Max BurkhalterThere’s a mini-market inside the restaurant where you can buy imported grape leaves, tahini, and huge cans of olive oil. Don’t pass up some baklava to go. On the weekends there might be bands serenading you over dinner, or belly dancers shaking their couscous. Grandma Rose will review those for you over the phone. In the years since I moved to New York, they’ve installed a supersize flatscreen to watch soccer matches on and opened a second location with pizza.Recently NASA’s budget for travel to the moon was barely increased, while funding for the International Space Station will dwindle to zilch by 2025, and other educational departments will disappear. It doesn’t look like we’re going to Mars anytime soon, but around the Windexed tables of Mediterraneo, staring into a faded photo of Santorini, at least we can dream about going somewhere.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsHoustonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Alex Beggs"]}