{"id": "544d545f84a5c94cca5a69853c013dbf", "url": "https://www.bonappetit.com/story/hilma", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Hilma Makes a Capsule Melts Away My Tension Headaches | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Herbal Capsule Melts Away My Tension HeadachesHilma’s blend of herbs and minerals eases my pounding head like ibuprofen.By Kyle BeecheyJanuary 22, 2021FacebookTwitterEmailPhoto courtesy of HilmaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!My body seems to be permanently on edge. My shoulders are up to my ears, my brow is furrowed, and my jaw is clenched. I barely even notice these physical stress symptoms until I start to work on the mental ones. Meditating, doing yoga, or getting a massage make me realize the tensed-up state my body is in.On the worst of days, this tension causes headaches, right in the middle of my brow. I can feel them coming, like a throbbing, pulsing cloud blowing straight toward me. I’ll try to drink some water, close my eyes, and power through, but more often than not I’ll reach into my purse and reluctantly pop an ibuprofen. It’s the only drug or medication I ever take, and while it eases the headache, I often experience numbness and other unpleasant side effects. I’ve tried endless natural remedies—eating more protein, chugging coconut water, micro-dosing coffee, taking a dropper of CBD— but nothing ever worked reliably. And then Hilma’s tension relief popped into my medicine cabinet.Hilma’s formulations are inspired by medicine cabinet staples: immunity support, upset stomach comfort and, my favorite, headache relief. A team of doctors, researchers, and herbalists formulates each product with a blend of herbal ingredients—and without animal products, artificial sweeteners or colors, or preservatives. The tension relief formula includes white willow bark, magnesium, boswellia, feverfew, and skullcap. Though the FDA does not evaluate statements about the efficacy of herbal supplements, willow bark and feverfew have a long history of use among different medicine traditions as a pain reliever.During a rainy day spent staring at screens, my headache arrived right on schedule, so I popped the recommended dose of two capsules and hoped for the best. Within a half hour the tension gradually lifted. The relief lasted for about four hours, and it even helped ease pain from a recently sprained toe. Ever since, I’ve reached for the bottle whenever that dull throbbing cloud starts to set in. As an added bonus, I find that when I take the pills close to bedtime, I sleep sooo soundly (possibly because of the added magnesium), but I never feel drowsy during the day. I now have my go-to treatment—no more electrolyte waters, shots of coffee, or peppermint oil on my temples required.Photo courtesy of HilmaHilma Tension Relief$15 at HilmaExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThe Cookbook That Makes Herbal Medicine Totally ApproachableBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-22", "author": ["Condé Nast", "Kyle Beechey"]}