{"id": "544e1adf1a26251ed2c89218724c4ba1", "url": "https://www.bonappetit.com/story/easy-picnic-recipes-make-ahead", "year": 2018.0, "month": 6.0, "day": 5.0, "content": "15 Picnic Recipes to That Are Ready to Travel (and Easy to Make!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking15 Easy Recipes to Bring to a Picnic or Barbecue or Wherever You Have to Go This SummerMake-ahead foods that travel well aren't always easy to come by. But we've got the goods.By Alex DelanyJune 29, 2018FacebookTwitterEmailFacebookTwitterEmailWhat should you bring to your friend's picnic? Or that barbecue you're going to next weekend? Or Aunt Karen's 64th birthday party? These are the questions we face constantly, because it is officially outdoor eating season.You want to bring something low-maintenance, a dish that delivers on flavor without stressing you or the people hosting this outdoor function out. It should  be able to be prepared in your own kitchen and transport pretty easily. Sounds simple enough, right? Well, sometimes it isn't. But you don't need to sweat this summer, because we put together this list of easy recipes that any and all will be quite pleased to eat on a picnic blanket. Here you go. Enjoy the sunshine.Slow-Roasted Onion DipLike the one you make with the packet of soup mix, but with no weird chemicals and 1,000 percent tastier.View RecipeWe firmly believe that a cookout is not really a cookout without some onion dip and a big bag of potato chips. This is an undeniable truth.Jammy Eggs with Paprika AioliLike deviled eggs—but faster, easier, more delicious, and fancier-sounding.View RecipeThese are essentially the deviled eggs you already love, without the annoying step of whipping up those yolks. It's about convenience, folks.Classic Chickpea HummusSo easy you'll never buy hummus again.View RecipeYour friends don't want the store-bought hummus. They want this hummus. Give it to them.Easy Vegetarian CalzonesStarting with store-bought pizza dough makes the dream of weeknight calzones actually attainable.View RecipeCalzones are pizzas that you can carry! And they're good room temp! Which means you can take them to a picnic! Wonderful!Marinated Olives and FetaAn appetizer you can have it ready within 10 minutes of walking in the door.View RecipeGood olives deliver a touch of class to any outdoor meal. Garlic and feta? They just make everything taste better. Both are important.Peanut Butter BlondiesOoey, gooey, peanut butter-y perfection.View RecipeIf your friends don't want peanut butter blondies at their picnic, you should probably just find some new friends.Cold Miso-Sesame NoodlesThe ultimate dinner-to-desk lunch dish.View RecipeCold noodle salads were invented for cookouts. Possibly. Actually, we're not sure, but this cold miso dressing is so tangy, creamy, and refreshing we'll accept that claim as truth.Winter Crunch SaladShredded brussels and kale, salty cheese, sweet-tart apple, and crunchy seeds make for a borderline addictive salad.View RecipeYes, its called a \"winter crunch salad.\" And no, it doesn't have to be winter to eat it. This is great year-round, and won't get sad and soggy in the heat.Antipasti Hand SaladTo the Hand Salad Haters out there: BYE! Go look at some other recipe! Get your own food website!View RecipeHand Salad is a salad that you can eat with your hands. And we all know hand foods belong at picnics. Just do what feels right.Roasted Eggplant and Pickle DipPlenty of creamy Greek yogurt keeps this baba ganoush-esque dip light and tangy.View RecipeAn eggplant dip gives all the pita freaks out there something to dip their bread in. This is for the pita freaks in your life.Make-Ahead Broccoli and Quinoa SaladThe ideal bring-to-your-friend's-dinner-party salad.View RecipeYou can make this broccoli and quinoa salad ahead of time, which gives you more time to do other things, like figure out which beer you're bringing to the function.Easy One-Bowl Upside-Down CakeThis cake is a breeze for bakers of all levels.View RecipeSummer fruit. Simple cake. And whipped cream. This is the picnic dessert MVP, no contest.Smoked Trout-Avocado DipIf you're not the kind of person who keeps canned fish in your pantry at all times, this is the recipe that will convert you.View RecipeThere needs to be avocado at your cookout. And there might as well be some seafood too. This smoky trout dip is all the right kinds of creamy.Blackberry-Pistachio Crumble BarsThese easy crumble bars are the ultimate bring-over dessert. They're incredible when made with blackberries, but any other berries that look good—raspberries, blueberries, strawberries, or a even a combination—make a more than acceptable substitute.View RecipeA blackberry bar is a dessert you can hold while playing badminton. That's just good old-fashioned fun.Cheesy Slice-and-Bake CrackersKeep a log stashed in your freezer AT ALL TIMES.View RecipeAll those dips need a cheesy cracker for dipping. Be the person who brings the crackers. Be the hero.Explore Bon AppétitBasicallyCookoutSaladDessertGrillRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-29", "author": ["Condé Nast", "Alex Delany"]}