{"id": "54586d14a2b364c4b9480eb2c66432f8", "url": "https://www.bonappetit.com/story/ember-ceramic-mug", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "This Heated Coffee Mug Keeps My Americano at the Perfect Temp All Day Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIt’s 3 p.m. and My Morning Coffee Is Still Piping HotThe Ember heated coffee mug was made for high-maintenance drinkers like me.By Amanda ShapiroFebruary 25, 2022FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When it comes to the ideal temperature of my drinks, I have a strong preference, and that preference is “hot.” I'll consume just about any beverage as long as it’s scalding: wine, water, cold brew (yes, you can do that). It’s a wonder I still have taste buds. On the other hand, I hate tepid drinks as much as that Dr. Seuss character hates green eggs and ham: I will not drink lukewarm coffee, Sam I Am. So when I get halfway through my mug of hot whatever and it’s already room temp, find me either pouring it down the drain or hanging out by the microwave, constantly reheating my sad partially drank drink.The Ember Temperature Control Smart Mug was designed for overzealous people like me. Made of stainless steel with a ceramic coating, this heated coffee mug lets you regulate the precise temperature of your drink with a Bluetooth connection and the Ember app on your phone. Welcome to the future.Ember Temperature Control Smart Mug, 10 oz.$110 $100 at Amazon$100 at Bed Bath & BeyondYes, these here are pricey cups. But think of all the cold coffee that will no longer go to waste! The smart mug sits on a saucer that doubles as a charger, which is included with the Ember ceramic mug but also available separately in case you want one for every room. Leave your cup of coffee on the charging coaster and it’ll stay hot indefinitely, or you can walk around with it—to meetings, to the bathroom, to show off your steaming hot beverage to your neighbor—while the self-heating mug takes care of the rest. The battery life of the Ember, indicated by a little LED display, will keep your bev at the desired temperature for over an hour before needing to recharge. The white 10-ounce Ember mug I have (it's also available in a 14-ounce version) washes easily and has stood up to turmeric, chaga mushroom powder, and hibiscus-based drinks in addition to hot coffee and espresso drinks. It also comes in black ceramic and a range of metallics—just don’t put any of them in the dishwasher. Ember makes a 12-ounce heated travel mug too, so if a normal insulated thermos isn't keeping that very last drop of matcha hot, it might be worth the admittedly steep price.Ember Temperature Control Travel Mug, 12 Oz.$248 at Amazon$180 at TargetLastly, I will note that this heated coffee mug's max temperature setting is 145 degrees Fahrenheit (the lowest is 120), and though that’s safer for my mouth, it’s just not quite as hot as I like the drinking temperature of my liquids. But, you know, that’s probably for the best, since hanging on to these few remaining taste buds is important for both my pleasure and my job.Could be hotter tbh.\nThis article was originally published in 2019 and was updated by MacKenzie Chung Fegan in 2022.Explore Bon AppétitShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-11", "author": ["Condé Nast", "Amanda Shapiro"]}