{"id": "545fd4b03f122e7dd0e091effd0a4153", "url": "https://www.bonappetit.com/story/topo-chico", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Topo Chico is Everywhere Now, and That’s Just Fine with Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTopo Chico Is Everywhere Now, and That’s Just Fine With MeConfident carbonation in the sleekest of bottles. Once you go Topo you'll never go back.By Isle McElroyAugust 5, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.By now you’ve probably heard of Topo Chico. Coca-Cola acquired the Mexican mineral water in 2017 and quickly moved the drink into bodegas, coffee shops, and supermarkets across the U.S. But let’s imagine it’s 2016 and you’ve just moved to Houston and you’re at an ice house and tired of beer but still excessively thirsty because every day in Houston feels a little like walking through butter. Imagine you ask the bartender for club soda, and they hand you a “Topo.” The glass bottle is as lean and willowy; the carbonation is confident, intense. This is the beginning of the rest of your seltzer-drinking life.I grew up on the East Coast pounding Polar Seltzer. During my undergrad years in Oregon, I survived off artificially flavored store-brand sugar-free soda waters that tasted drastically of aspartame. Whereas those drinks were either too tepidly undercarbonated or desperately overflavored in a bid to compete against soda, Topo Chico knew what it was: a 126-year-old mineral water so heavily carbonated the opening sips scour your tongue. Unlike LaCroix with its dozens of fruity options, the flavored varieties of Topo—lime, grapefruit, tangerine—are few and dignified.Before 2017 Topo Chico was a regional obsession in Texas and Mexico. In Houston, Topo drinkers stand by their brand; they make Red Sox fans look nonchalant by comparison. It’s a key component of Ranch Water—Topo, tequila, and lime—and is rumored to cure hangovers. Sure, Houston also had LaCroix, but after Topo Chico, drinking LaCroix is like sucking a rock when you’re craving a steak. It’s not only the taste that satisfies. The true pleasure of Topo Chico is holding the bottle, sleek and firm, heavier than most club soda bottles. Feel the textured glass that rings the bottle beneath your forefinger and thumb, right where the bottle begins to taper toward the neck. Drag the glass across your forehead—there’s no better way to cool down during a steamy Texas summer.Over the past few years, as Topo Chico spread into stores across the U.S., I’ve felt a pang of nostalgia for my early days in Houston when Topo felt like a secret. I moved to Brooklyn last summer, and seeing its bottles on shelves across the city reminds me of hearing The Postal Service playing at Crate & Barrel years after I “discovered” the band. My special thing was suddenly everyone’s special thing. But Topo was never my thing. I discovered it 121 years into its life as a transplant to Texas. I’m only recommending Topo Chico because Houstonians shared it with me. I’m happy for Topo. Really, I am. It isn’t even about me. It’s about what’s best for Topo Chico. And you. Because if you haven’t already tried it, it’s time you discover what might be the worst-kept secret in mineral water.An earlier version of this story included a pronunciation note and a descriptor that do not meet our standards for inclusivity.Photo by Emma FishmanTopo Chico Mineral Water$11 at Target (12-Pack)$39 at Amazon (12-Pack)Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-05", "author": ["Condé Nast", "Isle Mcelroy"]}