{"id": "546227d76a41f119403973104a302b85", "url": "https://www.bonappetit.com/recipe/yum-nua-thai-beef-salad", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Yum Nua (Thai Beef Salad) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJuly 2020 IssueYum NuaBy Nok SuntaranonJuly 20, 20204.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto and food styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrint“When it comes to beef salad, there is no other way but spicy,” says chef Chutatip “Nok” Suntaranon of Kalaya restaurant in Philadelphia. Bursting with sliced aromatics like chiles, garlic, and lemongrass, it’s as spicy as it is bright, with handfuls of herbs and plenty of lime juice. The salad’s adaptability has made it a mainstay in her life, as well as on the menu at Kalaya. In this version, she swaps the Thai eggplant she uses in the restaurant for tomatoes. But, she advises, “You can throw in any vegetable you have, as long as you have the main ingredients: the beef and all the herbs.” The toasted rice powder is key for adding texture and a hint of smokiness. Toasting your own (preferably using sweet rice, but any white rice will work) is the way to go.Ingredients4 servingsDressing and rice powder½cup sweet white rice or regular short-grain or other white rice¼cup fresh lime juice2Tbsp. fish sauce1tsp. crushed red pepper flakes½tsp. sugarKosher salt, freshly ground pepperBeef and assembly1lb. top sirloin steak, New York strip steak, or other nicely marbled cut of beef, sliced ¼\" thick1Tbsp. fish sauce2tsp. sugar2Tbsp. vegetable oil, plus more for grate or skilletKosher salt, freshly ground pepper1lb. small and medium tomatoes, halved1large shallot, thinly sliced2scallions, thinly sliced2lemongrass stalks, tops trimmed, tough outer layers removed, very thinly sliced2long hot chiles, thinly sliced2garlic cloves, thinly sliced2cups cilantro leaves with tender stems2cups mint leaves1lb. cucumbers, thinly sliced, plus more for servingLime wedges (for serving)Special equipmentA spice mill or mortar and pestlePreparationDressing and rice powderStep 1Place rice in a medium skillet and set over medium heat. Cook, tossing often, until golden brown and deeply nutty–smelling, 12–15 minutes. Let cool, then finely grind in a spice mill or mortar and pestle; set aside.Step 2Meanwhile, stir lime juice, fish sauce, red pepper flakes, and sugar in a small bowl until sugar dissolves. Season with salt and black pepper.Step 3Do ahead: You can toast and grind the rice a few days in advance (as Suntaranon does).  If the smokiness and aroma have faded at all, just toss it in briefly hot skillet to refresh.Beef and saladStep 4Place beef in a large bowl and add fish sauce, sugar, and 2 Tbsp. oil. Let sit at room temperature 1 hour, or cover and chill up to 1 day ahead.Step 5Prepare a grill for medium-high heat or heat a large skillet over medium-high. Oil grate or lightly coat skillet with oil. Season beef with salt and black pepper and grill until browned underneath, about 2 minutes. Turn over and grill on other side just until lightly browned (meat should still be slightly pink in the center), about 45 seconds.Step 6Toss tomatoes, shallot, scallions, lemongrass, chiles, garlic, cilantro, mint, 1 lb. cucumbers, and 1 tsp. rice powder in a medium bowl to combine. Drizzle half of dressing over and toss to coat. Taste and season with salt and black pepper.Step 7Add beef to salad. Drizzle with more dressing as desired and top with more cucumber slices and 1 tsp. rice powder (save remaining rice powder in an airtight container at room temperature for another use). Serve with lime wedges for squeezing over.How would you rate Yum Nua?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis recipe rocks!  A bit of prep work, but once sorted, tossed together to infuse all the fabulous smells and flavors.  I added glass noodles and sliced lettuce to the dish.  Will definitely do this recipe again.ShelleyRSydney, Australia8/22/2021My husband is in love with this recipe! But why on earth would you suggest that anyone make a half cup of rice into that powder when you only need a small part??? What other use, exactly, are we saving it for? Be reasonable, now.Anonymous6/26/2021Very nice dish. Easy to cook. The dressing is very hot though. We let eetveryone dish up and out their own dressing on. The toasted, ground rice made it. Well worth the effort. Will be eating this  often through summer.Heath EnwaysMelbourne Australia11/7/2020Loved this recipe, will definitely be adding into the summer rotation! I added some shredded green cabbage and some romaine to make it a bit hardier. I left out the chiles b/c I just didn't have them and the dressing still had a nice kick to it so I'd be hesitant about adding the chiles next time. I also subbed torn fresh basil for mint b/c it was what I had. Such an easy, refreshing, and healthy meal!!AnonymousQueens, NY8/25/2020This recipe was excellent. A simple and delicious summer lunch. We served it on a bed of arugula and subbed out the beef for shrimp. Highly recommend!JWBaierWashington, DC7/27/2020Yum nua? Um, no-uh. Bris, this is far from your best recipe. I appreciate the effort, and am eagerly waiting for your next conviction. AnonymousBristol 7/25/2020Great recipe!  Used bird chiles instead of the crushed pepper, and about twice the fish sauce and sugar in the dressingAnonymousNew York7/24/2020Easy recipe that comes together quickly once the veggies are chopped. Would recommend using a large bowl for the veggies, as it overflowed in the medium bowl that was suggested. Used risotto rice and it worked just fine. AnonymousNew York, NY7/23/2020Yum, ready to get cooking!carol1339Atlanta7/22/2020Explore Bon AppétitSaladAsianSoutheast AsianThaiSteakBeefMeatLemongrassHerbs & SpicesCucumberVegetableTomatoSummerMainNut-FreeDairy-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-20", "author": ["Condé Nast", "Nok Suntaranon"]}