{"id": "5465422a5d9cb988868dd4f6c58d134c", "url": "https://www.bonappetit.com/story/ted-lasso-biscuits", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Craving Ted Lasso’s Shortbread Biscuits? Try These Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCraving Ted Lasso’s Shortbread Biscuits? Try These RecipesI’m obsessed with that cute pink box of freshly baked shortbread that Ted Lasso brings his boss every morning.By Sonia ChopraAugust 5, 2021FacebookTwitterEmailPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioFacebookTwitterEmailI’m a whole season late to the party, but I just got into the show Ted Lasso, which features a deeply charming football coach (the American kind) who heads across the pond to train, for his first time, a football club (the soccer kind). It's very sweet and very feel-good, and new episodes air every Friday on Apple TV+. But I’m not here to talk about the show—I’m here to talk about the cute pink box of freshly baked shortbread biscuits that Ted brings his boss every morning.The boxes make me nostalgic for my own days working in a bakery, where I clocked countless hours folding and assembling cardboard packaging just like the ones in the show. And the biscuits remind me of my grandmother, who loves shortbread—which, as we (and the Brits in Ted Lasso) know, is the perfect cookie to have with tea. She lives in Atlanta and I live in New York, so I always send her some for birthdays and special occasions, and over the years I’ve landed on two favorites that can be shipped nationwide: Mah Ze Dahr’s vanilla bean shortbread and Back in the Day Bakery’s lavender shortbread. But as I was watching Ted’s boss Rebecca Welton enjoy the shortbread, I realized I couldn’t think of the last time I’d had some myself. So I took a trip through the archives to look for a few recipes, which you can find in the list below. I’m planning to try out one (or two or three...) ahead of the next episode.In the meantime, here are a few other things I’m loving:This guide-to-end-all-guides to dining outside from Epicurious, particularly the frozen cocktail and ice box cake entriesAnd a guide to all things sticky riceIdeal dining itineraries by local restaurant experts everywhere from New Orleans to Bozeman for the August print magazine (subscribe here to get future issues)This year’s Met Gala plans, which feature a lineup of extremely cool chefs—and a fully plant-based menu (!)A conversation I had with Jana Schmieding, co-star and writer of another great show, Rutherford Falls, which just got picked up for a second season. We discussed what she ate in the writers’ room, food sovereignty, and so much moreA very helpful Epicurious product review of serrated knives, just in time for tomato seasonAnd speaking of tomatoes, I’m a purist, but this Tomato Caesar recipe for the next time my market haul is less than perfect. Plus more new recipes ideal for the dog days of August: Dominican Spaghetti, Saucy Grilled Squash With Chickpeas, Spicy Braised Eggplant Noodles, Summer Corn RicePlease tell me about the TV shows (or movies, plays, video games, or books) that have prompted you to cook something new—but no spoilers, please! I’m at sonia@bonappetit.com.Photo by Chelsie Craig, Food Styling by Kate BuckensMore shortbread recipes:Rye Shortbread Cookies RecipeRoasty Toasty Pecan-Caramel Shortbread Cookies RecipeZebra-Striped Shortbread Cookies RecipeWhole Grain Shortbread with Einkorn and Rye FlourGrated Shortbread Bars With Rose JamGoat Butter ShortbreadExplore Bon AppétitTvLetter From The EditorCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-05", "author": ["Condé Nast", "Sonia Chopra"]}