{"id": "54693eaa125b58fe157a33858f616815", "url": "https://www.bonappetit.com/story/i-miss-the-old-food-instagram", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "I Miss the Old Food Instagram, Don’t @ Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Miss the Old Food Instagram, Don’t @ MeHave you wondered what happened to all the good food pics in your feed?By Julia KramerMarch 23, 2018FacebookTwitterEmailBrian FinkeFacebookTwitterEmailThe first rule of Instagram should be that you will never write a story about Instagram. And yet, the words just vomit out of me, so here goes: The golden age of Food Instagram is over, and—this is the part I hate myself for—I miss it.We’ve all witnessed The Change: the slow fade-out of what we used to call, simply, Instagram (you know, single-photo posts in a chronological feed—Flat Instagram, if you will) at the hands of Instagram Stories (you know, the thing that we used to do on Snapchat).If there is one word that sums up Instagram Stories, there isn’t one, because nothing on Stories is ever a single word. The philosophy behind Stories can be summed up with a phrase whose meaning I’ve never totally understood but that the type of men who get their news from Pod Save America and The Ringer seem to always be saying: “flooding the zone.” Stories are the un-filter: diaristic, impulsive, digressive. They are “real” to Flat Instagram’s posed aesthetics, grainy to its capital-C Contrast. They’re loose and democratic in the face of Flat Instagram’s aesthetic rigidity. The best ones are funny in a way that Flat Instagram (meme accounts aside) could never really be.Flat Instagram wasn’t about showing who you really were; it was about creating a beautiful fiction of who you wanted others to imagine you to be. It was sheer aspiration, bundled with “service” that became marketed as “influence,” from the way one spread ricotta on toast to the number of minutes one boiled an egg to the restaurant one became tired enough of seeing on Instagram to finally eat at. Stories, on the other hand, promise a window into who people really are. They too are commuting home in a snowstorm. They too have cats. They too have ankles that may appear swollen when they are very pregnant. This is intriguing, appealing, maybe even, for some, addictive. In Stories, food is less an object to fetishize than a prop in the narrative, a set piece for a small-scale Kardashians simulacrum, and everyone gets to be Kim. In Foucault’s theory of panopticism (yup, I’m going there), we were all behaving out of the fear that we might be being watched, even if we were not certain that we were. In Instagram Stories, we’re constantly recording ourselves—we know that we are being watched—then pretending to go about our lives as if we’re not.Oh yeah, and the vast majority of the food featured in Stories looks like it was photographed in a sensory deprivation chamber. Blurry, dark, with some crazy words scrawled on top of them. The food that shows up in Stories is the FlipCam (remember FlipCams?) to Flat Instagram’s Chef’s Table. I get it, Chef’s Table can be a little...precious.But aren’t all the Stories a bit much? Think of it this way: You run into a colleague on the elevator on Monday morning and you ask him how his weekend was. In the Flat Instagram version of the story, he tells you about the most insane chicory Caesar he had at Chez Ma Tante. In the Stories version, he unfurls a 3,000 word memoir: It begins with what temperature and time it was and what track was playing on his phone as he stood outside the restaurant, details every one of the seven dishes he ordered, and ends with a description of the way the city lights twinkled on the cab ride back across the Williamsburg Bridge. Because Stories are, well, longer and more involved, they promise something more. And yet they deliver the same meaninglessness, just protracted—like a profile that congratulates itself on its #longformness without having anything to ultimately say. Was Chez Ma Tante actually good? Should you eat there? What should you order? Answering those questions is besides the point. Stories are not endorsements, but no one needs to say that, because it’s so obvious.The volume of Stories reminds me of why I could never get into Twitter: I felt like I was trapped in an abyss where people were just senselessly yelling, desperate to be heard. In my little corner of Flat Food Instagram, things weren’t perfect, but you know, they were at least a little quieter. (Insert: Old Man Yells At Cloud.) I followed people who seemed to have an understanding that Flat Instagrams were things you posted once a day. These weren’t photo albums; they were the one photo you chose to get framed. Which is to say, they were posed and selective and annoying and easily lent themselves to becoming tropes (remember the “hands-reaching-across-the-brunch-table” lol), but you know, Stories is already or will soon be clouded by its own tired motifs and ridiculousness.Which would be fine if I could just retreat into my safe, comfortable Flat Instagram. And yet, like life, Instagram is a zero-sum game, and the more food people post on Stories, the less food they post on Flat Instagram. (This scrupulously researched fact has been verified by our social media manager, who now resorts to hitting up staffers over text messages for fodder for the Flat @bonappetitmag feed.) So although I wrote this post to express to the world why the end of Flat Food Instagram pains me, the sad truth is that in this lonely, scary world, I would rather listen to that 3,000-word memoir than hear no story at all. Tap.Explore Bon AppétitInstagramRead MorecultureIt’s Dinner, Put Down Your Goddamn Phone (Yes, You)By Mari UyeharacultureGifts for People Who Take Instagram Very SeriouslyBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-23", "author": ["Condé Nast", "Julia Kramer"]}