{"id": "546e18f0fa90565d52eb749226f4ca40", "url": "https://www.bonappetit.com/story/reusable-coffee-filter", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "This Reusable Coffee Filter Means I Never Worry About Running Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Reusable Coffee Filter Means I Never Worry About Running Out Morning productivity is at an all-time high. By Sarah JampelSeptember 16, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I cannot claim to be a coffee expert (I’ll leave that to Chris Morocco). I was the person in college who never complained about our dining hall coffee, which I would drink at breakfast, lunch, and after dinner. If it was hot (or even hottish), strong, and caffeinated, I was in.These days my standards are a little higher—as in I’m the proud owner of a Chemex (for sake of simplicity and ease of cleaning) and I grind my beans at home. But still, there’s really only one thing that can make me inconsolably distressed when it comes to coffee, and that’s when the coffee doesn’t exist. How will my brain, body, or soul function properly? For me the limiting factor isn’t the beans themselves (I would never let that happen), but the paper filters that fit into my Chemex.After too many days of fumbling around the cabinet at 6 a.m. only to realize that the box that normally contains the filters was tragically empty (I blame my husband), I decided to buy a reusable stainless-steel coffee filter. It saves paper, it saves money (the upfront cost evens out over time), and it saves me from googling “what can I use instead of a coffee filter?” and then seeing how many layers of cheesecloth it will take…. And because it’s dishwasher-safe, it’s not even that annoying to clean.Full disclosure: There’s much debate in the barista community (of which I’m not a member) about whether a steel or paper filter makes for a better cup. Compared to paper filters, which absorb more of the beans’ oils and strain out more sediment, a cup of coffee that drips through a metal filter will be richer and fuller bodied. I’ll leave the discussion to the experts and say, that as an amateur, I haven’t noticed a difference. As long as I can keep making coffee without a hiccup, I’m thrilled.Barista Warrior Pour Over Coffee Filter$32 at AmazonExplore Bon AppétitShoppingCoffeeRead MorecultureThis Extremely Precise Electric Kettle Grounds Me in the MorningBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-16", "author": ["Condé Nast", "Sarah Jampel"]}