{"id": "54810b95103b757f46283e99dbfef3ea", "url": "https://www.bonappetit.com/city-guides/chicago/venue/marisol", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Marisol Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginchicagoMarisolThe destination-worthy museum restaurant in StreetervilleFacebookPinterestTwitterEmailJeff MariniGO HERE: to see what all museum restaurants should aspire to. The Museum of Contemporary Art (MCA) brought in chef Jason Hammel—of Chicago’s beloved farm-to-table trailblazer Lula Cafe—to run its ambitious coffee bar-slash-takeaway-slash-brunch/lunch/dinner restaurant. Expect a thoughtfully sourced menu of very beautiful food from chef de cuisine Sarah Rinkavage, set against the backdrop of a wall mural from the legendary artist Chris Ofili.ORDER THE: epic veggie cheeseburger at lunch—it will change your entire outlook on veggie burgers. Hyper-seasonal salads (like roasted beets with strawberries and radicchio) and handmade pastas (like bucatini with salmon roe or rigatoni with baby squid) star at dinner.THE VIBE IS: definitely still a basement museum restaurant, albeit a very well-designed one. This is the ideal place to come when you need a break from museum-hopping or shopping on Michigan Avenue.IN CASE OF (VERY RARE) NICE WEATHER: Grab a grilled ham-and-Comté sandwich and coffee from to-go bar and head to a nearby park (or to the beach!).GETTING IN: shouldn’t be too hard; this place is built to accommodate the museum-going throngs and takes reservations. Note that both the MCA and Marisol are closed on Mondays.—Julia KramerJeff MariniCallie LipkinJeff MariniWE ALSO LOVELula CafeThe Logan Square restaurant that is all things to all people Mi Tocaya AntojeríaA standout Mexican restaurant in a city of standout Mexican restaurantsSportsman's ClubThe best indoor/outdoor bar for simple/spot-on cocktailsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-02", "author": ["Julia Kramer"]}