{"id": "5483ca32fb515c3e3ba4cad9e967d2a6", "url": "https://www.bonappetit.com/story/bas-best-shrimp-cocktail-ready-to-party", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "BA's Best Shrimp Cocktail Recipe Is Ready to Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBA's Best Shrimp Cocktail Is Ready to PartyA recipe for the shrimp cocktail you deserve.By Molly BazJuly 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailShrimp cocktail is one of those when it’s good it’s freaking great, and when it’s not, it’s an abomination, kind of foods. As simple as it seems when you’re housing them from an ice-filled dish at a party, a lot goes into constructing the perfectly poached shrimp cocktail. I know because I’ve tried every method, which means I did the work for you, so you can sit back and relax and read the rest of this article knowing there’s a solid recipe at the end. It’s not difficult to make, but there are a few key points to bear in mind, and you’ll never suffer a mediocre shrimp cocktail again.Number one: High quality shrimp. It means everything. Most of the shrimp we get in the U.S.  is previously frozen, and that’s A-OK. If you have access to fresh shrimp, by all means snag that good stuff. But if not, look for “wild-caught,” which tend to have better and cleaner shrimpy flavor than those raised in farmed environments. Or at least look for “sustainably farmed” whenever possible; the fresher the better, duh.Better shrimp = better shrimp cocktail.\nPhoto by Alex LauOkay enough with the preachy-preach. Next up: Shell On. Shrimp that is poached in its shell tastes a gajllion times better than the stuff poached with the shell removed. The shells protect that sweet tender flesh from getting rubbery and they give flavor to the poaching liquid, both extremely important details. You’ll remove those shells later.Third point: Salt, sugar, lemon. That’s all you’ll add to your water to create a poaching liquid that will season and flavor the shrimp in the brief time it spends in it (1½ to 5 minutes, depending on the size). I tried many different versions of poaching liquid—including a 30-minute simmered court-bouillon packed with herbs and aromatics—and ultimately determined that it’s the salt and the sugar and that hint of lemon for brightness that are doing the heavy lifting here. The shrimp spend so little time in the poaching liquid that all the fuss of making a stock really doesn’t pay off.Make some Bloody Marys, make it a shrimp cocktail party.\nAnd lastly: Ice bath. Shrimp can overcook in an instant. Which is why we shock them with ice, to stop the cooking. Pro-trick here is to add ice to your poaching liquid once the shrimp are cooked, so that they can cool down in the liquid they cooked in. More time in that yummy salty lemony water = more flavor picked up by your shramps.Get the recipe:BA’s Best Shrimp CocktailShrimp cocktail is all about the shrimp: big, fat, perfectly cooked gorgeous shrimp. Here’s how to do it.View RecipeExplore Bon AppétitShrimpCocktail PartySeafoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Molly Baz"]}