{"id": "549473afd777950651634283b2aed013", "url": "https://www.bonappetit.com/recipe/sausage-peppers-and-onions-subs", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Sausage, Peppers, and Onions Subs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSausage, Peppers, and Onions SubsBy Alex DelanyFebruary 1, 20184.1(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintAlthough your traditional sausage, peppers, and onions sandwich may not have tomato paste, we like to caramelize a little bit into the mixture for a sweet, saucy, umami-rich hit of flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Straight-Sided Skillet$290 $199 At AmazonTongs$13 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonIngredientsMakes 3 very shareable subs4red and/or yellow bell peppers1poblano chile3small onions6garlic cloves3soft Italian sandwich rolls2lb. sweet Italian sausage (about 8 links)5Tbsp. extra-virgin olive oil, dividedKosher saltFreshly ground black pepper2Tbsp. tomato paste⅓cup red wine vinegarPreparationStep 1Cut 4 bell peppers and 1 poblano chile in half lengthwise. Using your fingers, pull out stems and ribs, then tap out seeds. Slice lengthwise into ¼\" strips.Step 2Peel 3 onions and cut in half through root end. Cut a V-shaped notch into root to remove. Slice each half into 3 lengthwise wedges.Step 3Peel 6 garlic cloves and thinly slice.Step 4Slice 3 rolls lengthwise without cutting all the way through (so 2 sides remain attached).Step 5Place 2 lb. sausages in a large straight-sided skillet and cover with cold water just until sausages are submerged. Heat over medium-high and cook, uncovered, just until water reaches a gentle boil, 6–8 minutes. Remove from heat. Transfer sausages (they will be fully cooked) with tongs to a plate; set aside. Dump water from skillet; reserve skillet.Step 6While sausages cook, heat 2 Tbsp. oil in a large Dutch oven over medium. Add onions and garlic and cook, stirring often, just until onions are beginning to soften, 5–8 minutes.Step 7Add bell peppers, chile, and another 1 Tbsp. oil to pot; season generously with salt and pepper. Stir to combine, then increase heat to medium-high. Cover and cook, uncovering to stir occasionally, until peppers are tender, 10–15 minutes.Step 8Create a clearing in the middle of the pot and add 2 Tbsp. tomato paste. Stir paste until darkened in color and is sticking to bottom of pot, about 3 minutes.Step 9Add ⅓ cup vinegar and stir to dissolve paste and combine with peppers and onions. Cover and cook, stirring occasionally, until peppers and onions are very tender, 8–10 minutes longer. Season with more salt and pepper.Step 10Meanwhile, slice sausages in half lengthwise.Step 11Heat remaining 2 Tbsp. oil in reserved skillet over medium-high. Add half of sausages cut side down and cook, pressing down to ensure full contact with pan, until cut sides are browned, about 3 minutes. Transfer back to plate and repeat with remaining sausages.Step 12Divide half of peppers and onions mixture among rolls, then arrange seared sausage halves over.Step 13Top with remaining peppers and onion mixture. Cut sandwiches in half crosswise and serve.How would you rate Sausage, Peppers, and Onions Subs?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI’m really here to comment on “How to Cook Sausage.” I followed the directions and, lo and behold, when I sliced them in half to brown them, they were DEFINITELY still nearly raw!!! The article/directions specifically said that they would be completely cooked??? Yechhhhhh!!!Normando TicoSan José, Costa Rica9/3/2021Great recipe! I would personally suggest using less of the tomato paste (~1 heaping tbsp) and subbing red wine vinegar for straight red wine. My personal philosophy - if it drinks well it will eat well, hence using red wine instead. The 1 start review person has a good point in critiquing the recipe for being too vinegary, but it's an easy fix and that's how I would adjust. BTW, you simmer the sausage so that they don't fall apart when you slice. Just be sure to keep an eye on them so they don't overcook. They won't dry out if you handle with love and care! dfrank00New York City 12/29/2019I really liked this recipe! The only issue I had was in roasting the peppers. The quantity is so large that when I cooked it all in my dutch oven (which is not small) the pot was so overcrowded that all the vegetables began to sweat and I had a significant amount of liquid in the bottom. This meant I couldn't really brown the tomato paste and deglaze with the red wine vinegar. Tastewise, though, this didn't cause any significant issues.AnonymousColumbia, SC10/17/2019I usually love making recipes from Bon Appetit! regardless of how long they might take and/or having to purchase ingredients that I don't often use.  However, this recipe was disappointing.  The addition of the tomato paste and red vinegar impart such an acidic aftertaste to what would have been a mild, sweet pepper and onion mixture that typically complements the subtle fennel seed spice of the Italian Sausage.  And simmering, slicing and frying the sausage only dried it out.  I am not a picky person but I just didn't want to waste my Italian rolls on this one. Hot!Hot!Hot!Pennsylvania7/2/2019Mmmm such a good recipe! Just made these yesterday and they were a huge hit!AnonymousMA6/18/2018Explore Bon AppétitSandwichRollsBreadItalianEuropeanSausageMeatBell PepperVegetableOnionPoblano ChileChileEasyWeeknight MealsDairy-FreeNut-FreeSuper BowlLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Alex Delany"]}