{"id": "5497b071b06e080e4e4363a5eaf1dd68", "url": "https://www.bonappetit.com/story/canned-black-olive-feud", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Make These Chicken Thighs This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake These Chicken Thighs This WeekendAnd more useful tidbits, news, and food feuds from the week.By Alex BeggsApril 27, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Chicken is the answerA friend asked me for a slam dunk chicken recipe and it reminded me how much I love/adore/cherish Andy Baraghani’s hot honey chicken thighs. START FROM A COLD PAN, PEOPLE. The toast fried in the chicken fat is almost absurd. Sometimes I just make the chicken + honey part because endive is not typically in my crisper. Look out for “What’s in my crisper?” a new column in Us Weekly.Get the recipe: Hot Honey Chicken Thighs with Fried BreadThe dough senses fearThis week marked the debut of Bon Appétit’s newest not-TV but can-we-just-call-it-a TV show, “Making Perfect.” The Test Kitchen comes together to create the perfect pizza, Avengers-style, with different cooks in charge of different components. I watched all three hours in two nights. If you haven’t watched yet, let this be a warning: Do NOT watch without pizza, even if it’s frozen Trader Joe’s or floppy Papa John’s. It is absolute torture to watch Molly Baz bite into slice after slice of crispy-crust, gooey fresh mozz, mortadella mountain-topped pizza while sitting on my couch with a cup of water. TORTURE.Watch the first episode here, and view the preview below.Want this letter before it hits the website? Sign up for our newsletter!Hi JesseTo celebrate the launch of the show, there was an exclusive party in the Test Kitchen, which explains how my invite got lost in the mail. According to sources—again, I wasn’t there—a fan named Jesse (hi Jesse!) drove nearly 11 hours from Ohio to attend. Another fan was in town from D.C. to see Hamilton AS WELL AS to come to this event, and presumably, find $100 on the sidewalk, fall in love, and find the perfect pair of jeans. Sounds like everybody had a good time.Photo by Chelsie Craig, Food Styling by Kate BuckensChocolate chip cookiesChris Morocco’s biggest fear was letting everyone down. His family. His friends. Strangers on the internet. He had to develop BA’s best chocolate chip cookie. After tasting approximately 15 different iterations, I can testify that this is The One. Chewy, gooey center, crispy, caramel-like edges, balanced bitter chocolate chunks to fragrant vanilla, nutty brown butter and just enough salt to bring everything out.It took nearly an hour for him to explain every ingredient decision to me (read that here). At one point when he was telling me what would happen if you added flaky salt to the top of the cookie, his eyes widened, his hands waved in the air, and he cried out: “If there’s salt on top, we can’t put as much inside, then what if the person opts out of the flaky salt, and the rest of the cookie is undersalted? The cookies don’t taste right! Is that the world you want to live in, Alex Beggs?!”Get the recipe: BA's Best Chocolate Chip CookieNew words, same worldIt’s time to throw out the 500-pound dictionary propped on a pulpit in your living room, because Merriam-Webster announced some official new words this week, making all other dictionaries woefully irrelevant. Except for Urban Dictionary, and the red squiggles that know your worst failings. There are officially new Food Words. So let’s welcome to Planet Earth, “ghost pepper!” Good job, “chai latte!” You’re finally legal, “umami”! And a round of applause for “cow parsnip,” who’s been waiting a long time for this. A long time.The best use for vodkaMy friend Brennan, who asks everyone he meets whether they’d “rather be a ghost or a dog,” told me that he’s made the Basically vodka sauce every day this week. It reminded me what a good recipe it is, so I’m sharing it again here. Make it! (I’m a dog.)Get the recipe: Rigatoni with Vodka SauceNewsI’ve been thinking in equal parts about the newly discovered black hole—and Dr Pepper’s new flavor. Why does Dr Pepper need a new flavor when it already contains 23 in one great product? Why are people arguing about [anything] when there’s “a cosmic abyss so deep and dense that not even light can escape it”??? Both seem to offer clues about the universe. Or more mysteries. Hard to say. We tried the unlabeled new Dr Pepper in the office this week, at 9:30 a.m., and guessed the flavor. I stuck my nose into a plastic Dr Pepper–branded plastic cup and asked Jesse Sparks, who knew the flavor, “black cherry?” He shook his head. Then Alex Delany and I tasted it. Not cherry at all, but raspberry, or blackberry, or the elusive, fictional blue raspberry. OH WAIT. We realized. “Berry supreme,” said Delany. Some kind of triple berry, we concluded. And we were RIGHT. “Dark berry” is the flavor. And it’s not as good as the original.Take your Amiel to work dayI accidentally walked into the Test Kitchen on “Take Your Kid to Work Day” and encountered a pack of ravenous kiddos making variations on avocado toast led by the brave Gaby Melian. Young Celia owns an iPhone but had never had avocado before! “My mom puts it on toast everyday, so I figured it was good,” she said. “My mom puts butter and cinnamon on hers,” chimed in Marin. Over at Andy Baraghani’s station, Kyle’s toast was garnished with pink pickled radish, which he did not like. “I don’t even like toast,” he, a cool guy, said. “I don’t believe in carbs either,” added Andy. A large adult child swooped in to make himself an avocado toast on a rice cake with a blanket of pickled radishes. “They didn’t go for the sprouts, huh?” asked Amiel Stanek, who proceeded to crash the group photo, pictured above.Unnecessary food meme of the weekUnnecessary food feud of the weekGoing with the “Making Perfect: Pizza” theme, let’s revisit one of Bon Appétit’s favorite internal feuds. The legitimacy of the canned black olive, which I consider a delicacy. I could eat a whole can, but it would take a while, because I’d need to first apply them to every finger and then tap my hands together like Mr. Burns before eating them one by one. Slowly. I love a sliced black olive on pizza, but man-who-definitely-didn’t-break-an-office-lamp-with-a-golf-club this week Adam Rapoport forbids it. “Never. Ever,” he said. Emily Schultz is with me. Brad Leone is with me: “Oh my goddddd,” he groaned and leaned back in his chair, next to a portrait of Jerry Garcia. “Salty, that little squeak, meaty. Some are better than others...but I like them all.” Chris Morocco sent me a Slack message that nearly shot off the screen in flames: “Terrible! Not even a food! Treated with poison to make them bouncy! Brad and Schultz love them of course.” “WOOF” was all I got out of Molly Baz, despite being a known brine-enthusiast. “I LOVE THEM SO MUCH,” said Carla Lalli Music, validating me and really the only opinion that matters here. She felt a gravitational pull towards them in the grocery store during her second pregnancy and always has them in the house. “My body literally needs them. You can’t fight that. It’s like the tides of the moon.” Andy rolled his eyes, “No, I’m not from Jersey,” and walked away.Explore Bon AppétitBeggs NewsletterRead MorecookingChris Morocco Just Made the Best Chocolate Chip Cookie EverBy Alex BeggscultureJoy, Pain, and Puke at the 2019 Hot Sauce ExpoBy Alex BeggsPhotography by Amy LombardcultureWhat Kind of Person Makes a Breakfast Sandwich On a Weekday?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-27", "author": ["Condé Nast", "Alex Beggs"]}