{"id": "5499d2c9b96cfae951acb3b01a62181d", "url": "https://www.bonappetit.com/recipe/inside-out-kimchi-grilled-cheese", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Inside-Out Kimchi Grilled Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInside-Out Kimchi Grilled CheeseBy Diana YenSeptember 12, 20214.5(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis crispy, gooey, spicy, and utterly indulgent comfort food requires just a few things: a strong, sharp cheddar to play off the tangy kimchi (make your own if you’re feeling ambitious!); the patience to let the cheese fully melt over moderate heat; and, most importantly, a fast and confident flip. Consider any crispy shards of cheese that get stuck to the pan the chef’s treat. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonBox Grater$13 At AmazonGIR Mini Flip Spatula$11 At Bon Appétit MarketIngredientsMakes 24½\"-thick slices Pullman or other white sandwich bread, divided3Tbsp. unsalted butter, room temperature, divided4tsp. gochujang (Korean hot pepper paste) or Sriracha, divided1½cups coarsely grated sharp cheddar, divided½cup drained coarsely chopped kimchi, dividedPreparationStep 1Place 2 bread slices on a work surface. Evenly spread ½ Tbsp. butter over each slice. Turn 1 slice over and spread 2 tsp. gochujang over, then top with ½ cup cheese and half the kimchi. Close sandwich with buttered sides facing out. Sprinkle 2 Tbsp. cheese over top of sandwich, gently pressing to adhere cheese to butter.Step 2Heat ½ Tbsp. butter in a medium nonstick skillet over medium-low until foaming. Cook sandwich, cheese side down (if some cheese falls out, use a heatproof spatula to nudge it back underneath the sandwich), gently pressing occasionally with a heatproof spatula, until underside is golden brown and crisp, about 3 minutes. Sprinkle another 2 Tbsp. cheese over top of sandwich, pressing with spatula to adhere. Turn sandwich over and cook until golden brown on second side and cheese inside is fully melted, about 3 minutes. Transfer sandwich to a plate. Wipe out skillet and repeat process with remaining ingredients to make 1 more sandwich.How would you rate Inside-Out Kimchi Grilled Cheese?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleFantastic. The cheese on the outside is worth it and so good. Make sure to drain the kimchi well before adding it to the sandwich, and I actually cooked the kimchi for a bit on the side of the pan, which melted the cheese in the middle much faster when I added the hot kimchi. LizBrooklyn, NY1/29/2022DELICIOUSKathyLebanon,IN10/25/2021The bread gets pretty soggy and becomes very difficult to flip. Messy in the pan because the cheese is shredded and it’s too much work for what it is. The taste is decent, the mixture of the cheddar and kimchi is weird but not too unpleasant. My roommates liked it but I thought it was just okay. All around pretty mid. JacobFort Collins, CO10/20/2021The level of difficulty associated with trying to cook cheese on the outside of a sandwich seems probably not within the realm of those looking for direction in these pages.AnonymousChicago 10/17/2021At first read through, this recipe seemed like a wildcard on whether it would taste good or not. But I’m pleasantly surprised to report this is truly heavenly. It’s sweet spicy gooey crispy. I’ll be making this on repeat until the kimchi jar is done. Anonymous10/6/2021Explore Bon AppétitSandwichButtergochujangSrirachaCheddarCheeseKimchiVegetarianDinnerLunchWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-12", "author": ["Condé Nast", "Diana Yen"]}