{"id": "549ceaa343c2b73f3d46410a02993e21", "url": "https://www.bonappetit.com/story/never-fail-spicy-fennel", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "I Could Eat This Spicy Fennel with White Rice For Dinner Every Night | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Could Eat This Spicy Fennel with White Rice For Dinner Every NightSpicy, tangy, toasty, crispy, sweet fennel? And a bowl of steaming white rice? Yeah, that sounds good.By Alex DelanyMarch 8, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I don't think of myself as a boring guy—but my weeknight dinner routine might suggest otherwise. My ideal Monday (and Tuesday, and Wednesday, and Thursday) night dinner consists solely of one very flavorful thing on top of freshly-steamed white rice. That's it.I’ll have two bowls. And then maybe eat a piece of fruit for dessert. And have a glass of wine or beer. And then maybe some chocolate for second dessert. And then read a book. And then maybe watch something on TV. And then brush my teeth. And then go to bed. And that’s my kind of Tuesday night. I’m 26. (I swear I don’t have grandchildren.)With such a simple dinner formula, I need to make sure that whatever I’m throwing on top of my rice is an absolute showstopper in the flavor department. I’ve gone through phases, but right now, when it comes to putting things on top of white rice, I just can't get enough of this crunchy gochujang fennel recipe.I’m a big fennel guy. And I’m big on sauces that bring a range of flavors to the table, with balanced proportions to keep them all in check. Which is exactly what this recipe, developed by Sohui Kim, the chef at Insa and The Good Fork in Brooklyn, delivers in spades.The flavor comes from the sauce, a mix of ginger, garlic, gochujang, rice vinegar, toasted sesame oil, honey, sesame seeds, and gochugaru. Those two Korean chile ingredients are what really fire it up. The fermented chile flavor of gochujang shines all the more bright next to the dry heat of gochugaru, which is not too spicy and a little smoky. (If you can’t find gochugaru, you could substitute any red chile flakes in a pinch.)But it’s about how the other flavors balance that spice that makes the sauce so good. The honey brings sweetness. The sesame brings toasty-ness and umami. The vinegar brings tang. They all work together to take that simple bowl of white rice from good to exceptional.Rice, waiting for fennel.\nIt might sound like I just really love this sauce. And I do. But I also love what gets tossed in it. Slices of fennel that get briefly blanched in boiling water and then shocked in a chilly ice water bath. The result is a just-soft, highly crispy vegetable. The texture is incredibly satisfying.And at this point, you may have decided that I am, in fact, boring. It’s just rice and fennel and sauce? That’s a dinner that excites me? Yes. It is. I know it’s incredibly simple—but it’s also incredibly tasty.But if you’re the type who wouldn't be satisfied by this kind of simplicity, this would also be killer with just about any crispy, seared meat. Or fried rice. Or stir-fried noodles. And you could substitute just about any vegetable for the fennel. But I’d suggest reveling in the simplicity, at least for a moment. And then plotting your Tuesday evening plan from there.Get the recipe:Crunchy Gochujang FennelThe dressing would also be crazy delicious on virtually any vegetable—cooked or raw.View RecipeExplore Bon AppétitBasicallyNever FailgochujangRiceFennelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-08", "author": ["Condé Nast", "Alex Delany"]}