{"id": "54a2929ebebe5b00926b1fc62ed84bc5", "url": "https://www.bonappetit.com/story/can-you-fry-with-olive-oil", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Can You Fry with Olive Oil? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan You Fry with Olive Oil?We've got thoughts.By Alex DelanyMay 24, 2018FacebookTwitterEmailFacebookTwitterEmailIt's a question for the ages: Can you fry with olive oil? Listen, we don’t like to think of ourselves as rebels or outsiders. We’re like you. We like to eat tasty food. We like to look at memes. We like free drinks. But sometimes we have to take a stance on something that is at odds with what most people seem to believe. Not because we think we’re better, but because we know what we’re talking about. In this case, most people think you shouldn’t fry in olive oil. We disagree.We endorse olive oil for a sear or shallow fry. We do it all the time. But we’ll never deep-fry anything in olive oil.We don’t like to deep-fry in olive oil. Not necessarily because it would taste bad or fry differently, but because it would be expensive. And we’re not made of money. High-quality extra virgin olive oil is pricey, and dumping six cups of it in a Dutch oven to fry some chicken—instead of something more affordable like vegetable oil, which we consider the best oil for frying—seems like a waste.But we love olive oil for a sear or shallow fry. In fact, there are some things we use it for exclusively. But before we get into that, we just have to clear something up: Yes, olive oil has a lower smoke point than most neutral oils, but it's actually not that low—around 375°F, to be precise. Yes, it will smoke if you're searing a piece of meat in it. And yes, that’s totally okay.People tend to run and hide the minute a pan starts smoking. It’s an understandable human reaction. Smoke usually means your car is about to blow up or the frayed wire on your laptop charger that you’ve been ignoring for months finally chose to give up. But you shouldn’t. Sometimes pans will smoke. That’s just part of cooking. We don’t work in fancy kitchens with ventilation hoods. The smoke coming off our stove hangs around. We open a window and get back to cooking.But maybe you're not scared of the smoke. Maybe it's the rumors going around that say heating olive oil to a high temperature produces carcinogens that can harm a human being. Look, as far as we can tell, there's no solid evidence that supports this claim. And while there's no evidence to the contrary guaranteeing its safety, people have been frying in olive oil for far longer than we've been around, so we're confident in saying that searing your fish fillet in olive oil isn't going to kill you.Frying in olive oil is delicious. We love the way it crisps up the bottom of a fried egg, and we’ll sear a pork chop in olive oil at just about any chance we get. Olive oil doesn’t overwhelm whatever you’re cooking with an olive-y taste, but it does lend a subtle hit of flavor that neutral oil doesn’t. So pour a little bit in your skillet and crack a couple eggs. If your roommate or friend or significant other complains about a little smoke, just hand them a crispy fried egg. That'll shut them up.Olive oil fried eggs coming right up!How to Fry an Egg Perfectly Every TimeFried eggs, crispy and runny and perfect on everything.View StoryExplore Bon AppétitBasicallyOlive OilFryDeep-fryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Alex Delany"]}