{"id": "54b8cb39bf37831aa5320bfdf157d06c", "url": "https://www.bonappetit.com/story/never-fail-sausage-and-broccoli-pasta", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "This Sausage and Broccoli Pasta Recipe Made a Believer Out of Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSend Help: I Can’t Stop Making This Sausage and Broccoli PastaIt strikes the ideal balance between those ultra-rich, all-in pasta dishes and the kind of veggie-packed situation that's healthy enough to eat once a week.By Amiel StanekJuly 13, 2018FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I’ve always taken a certain sneering, high-minded pride in the fact that I have never been a big pasta person. Even when I was in college, even when I was a broke-ass twenty-something living in New York City, pasta was never my go-to. Don’t get me wrong: I love to eat pasta. But, as a misguided young person, I always thought of pasta as a crutch, the kind of thing that people who didn’t know how to make delicious food for themselves made for themselves too often. “Sure, you could make pasta tonight,” I’d think to myself, “sure, it will be delicious. But can’t you think of anything...else to make?” And normally the answer was yes, and normally while eating said “anything else” I’d pat myself on the back for being oh-so unpredictable, resourceful, and creative. “Let them have their pasta—I can COOK!” (I'd proclaim, four hours later, to no one in particular, after my pot of lovingly-simmered cooked-from-dried beans were finally finished.)Well, things change, and people change. I got older, and wiser, and stopped feeling like I had so much to prove. I got into the habit of cooking pasta maybe, say, once a month. I treated it as a special treat, an opportunity to lean into the richer, all-in dishes that make pasta one of life’s great joys but are definitely not healthy, or even healthyish: vodka sauce, alfredo, bolognese, carbonara. I had no time for the whole, “pasta...but not-that-bad-for-you, it's-made-from-whole-wheat-and-the-sauce-is-just-vegetables!” thing—why cook pasta if you were trying to be reasonable? That’s what salads are for, dummy!And then I met this sausage and broccoli pasta recipe. And then everything went off the rails.Originally featured in our November 2017 issue, the recipe was developed by Adam Rapoport, our editor in chief, which explains why he got away with naming the recipe “Broccoli Bolognese with Orecchiette” though it bears literally no resemblance to its meaty, long-simmered namesake. I edited the story, and had tasted the pasta once or twice in passing while it was being developed in our Test Kitchen, and then forgot about it until a few months ago. Then, one fateful night, I found myself on my way to a friend’s apartment with every intention of cooking dinner but no plan or groceries to speak of. I didn’t have time to go to a grocery store, and ducked into a reasonably well-stocked bodega for a bit of inspiration. Staring at a head of decent-looking broccoli, that recipe popped into my head, and I scanned the store for the rest of the things I’d need. Hunk of Parm? Check. Pound of sausages? Check. Box of orecchiette pasta? Check. Garlic? Check. Golden. I checked out, texted my friend to put a big pot of water on to boil, and sallied forth.Peeling the base of the broccoli stems exposes the tender goodness within.\nWhen I got there, everything came together in a flash—I was able to get the prep done in the time it took my friend to tell me about their day. I crumbled the sweet Italian sausage into a Dutch oven and let it brown. I chopped that head of broccoli—stems and all—down into tiny pieces, and blanched them quickly in the salty water I had on for the pasta. (Nothing fills me with greater joy than making that pasta water do double duty.) I dumped the orecchiette into the pot, and while it cooked I sizzled some crushed garlic in the pan with the sausage, added a pinch of chile flakes and that chopped broccoli, and let it cook together for a few minutes. When the pasta was almost al dente, I scooped out a few ladlefuls of the starchy water it was cooking in into the Dutch oven and got that bubbling, then used a spider to transfer the cooked pasta directly from the pot into the sauce. While that simmered away, the orecchiette soaking up that garlicky, porky, starchy liquid, I gradually folded in a handful of grated Parm at a time until the sauce went thick and glossy, and threw in a knob of butter for good measure. And there it was: sausage and broccoli pasta. But it was so, so much more.I could not believe how good this unassuming pot of pasta tasted. It had plenty of lip-sticking luxuriousness from the pork, cheese, and butter, but the entire head of broken-down broccoli in there meant that every bite was still full of bright, crunchy vegetal flavor. It somehow bridged the gap in my mind between hedonistic cream-and-carb bliss and the sad, dietetic dishes of zoodles I imagine people claim to like. A soulful, truly satisfying dish of pasta that was chock full of vegetable goodness without sacrificing an ounce of flavor. I was hooked.I’ve made it nearly once a week since that first encounter, a bit differently each time. I’ve switched up the pasta shape—anything that has nooks and crannies to cradle the bits in the sauce will work. I’ve swapped out the broccoli for kale, spinach, broccoli rabe, wax beans, and a whole host of other green things, alone or in combination. I’ve used hot Italian sausage and chorizo and garlic sausage and even a random chunk of paté one time. And now, every time I can’t think of what I want to eat or what I can serve to a group of people that will be universally appealing, I make...pasta. This pasta. I guess this is what being an adult is like, after all.Get the recipe:Broccoli Bolognese with OrecchietteBroccoli and sausage pair up for an indulgent veg-heavy pasta dinner.View RecipeExplore Bon AppétitSausageBasicallyBroccoliNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-13", "author": ["Condé Nast", "Amiel Stanek"]}