{"id": "54b8731e12be4757e47264ac2706ff0c", "url": "https://www.bonappetit.com/story/trini-stewed-eggplant", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Trini-Style Curry Eggplant with Garlic and Hot Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTrini Stewed Eggplant is Almost Too Simple to Require a Recipe, But I Made You One AnywayA fast, satisfying way to make eggplant taste delicious.By Brigid WashingtonAugust 2, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailIn my home country of Trinidad and Tobago, this garlicky eggplant dish, known colloquially as baighan or melongene, isn’t considered a recipe because all it requires is a low flame, a handful of garlic cloves, a hearty dash of curry powder, and eggplant. The process of making this dish seethes with a simplicity that defines island life. Folded into the ease, however, are deep flavors rightfully attributed to the island’s vast and vibrant East Indian culture, from which this dish is believed to originate.Many foods from the subcontinent were hybridized and adapted when Indian indentured laborers arrived to the Caribbean in the mid-nineteenth century. Take curry, for example. It is a popular catch-all culinary term, albeit one that doesn’t hold much contextual weight or historical accuracy. However, the curry used in this recipe is a powder made by the Trinidad-based company Chief. The brand was started by Sayeed Khan, the grandson of an Indian indentured laborer, who envisioned an easier way for locals to achieve the rich and complex notes of freshly ground dried spices without the labor of toasting and pulverizing many individual types. This curry powder in particular is a household staple and national darling, beloved for its fresh, bold, and nuanced profile. In this recipe, the inclusion of curry powder adds perfume and a brilliant hue. If you can’t find Chief curry powder, however, madras curry powder is an acceptable substitute (but not an exact one).The biggest win of this wholly vegan eggplant recipe, which tingles with bright bursts of heat and bite, is its range and functionality. Growing up on the island, I ate it for breakfast with sada roti. These days, my husband is thrilled to heap creamy spoonfuls of melongene over steamed brown rice for a hearty meal on a weeknight. And during these balmy summer months, we adapt it ever-so-slightly by pairing it with peppery fresh arugula and pan-seared citrusy chicken thighs. In whatever mode preference dictates, this stewed eggplant is a workhorse wonder that’s sure to surprise.Get the recipe:Trini Stewed EggplantIn Brigid Washington's home country of Trinidad and Tobago, this garlicky eggplant dish, known colloquially as baigan or melongene, isn’t considered a recipe because all it requires is a low flame, a handful of garlic cloves, a generous dash of curry powder, and eggplant.View RecipeBrigid Washington is a chef and journalist based in Raleigh and the author of the cookbook Coconut. Ginger. Shrimp. Rum.: Caribbean Flavors For Every Season.Explore Bon AppétitEggplantTrinidadianCaribbean/Central AmericanCurryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-02", "author": ["Condé Nast", "Brigid Washington"]}