{"id": "54bf227977ba5cd9130f3f6848e57c3c", "url": "https://www.bonappetit.com/recipe/caramelized-leek-and-fava-bean-toast", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Caramelized Leek and Fava Bean Toast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramelized Leek and Fava Bean ToastApril 10, 20184.1(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintPiled high with softened leeks and fresh fava beans, this tartine might—might!—make you forget about avocado toast. Slicing the leeks with the grain prevents them from falling apart into mush after getting caramelized. This recipe from Botanica is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servingsCaramelized Leeks4leeks, white and light green parts only, sliced in half lengthwise, rinsed well¼cup extra-virgin olive oilKosher salt2tsp. very finely chopped rosemary leaves1tsp. Aleppo-style pepper1tsp. finely grated lemon zest1Tbsp. fresh lemon juiceTartine Assembly2cups shelled fava beans (from about 2 lb. pods), shelled fresh peas (from about 2 lb. pods), or one 10-oz. package frozen peas, thawed2Tbsp. fresh lemon juice2Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt, freshly ground black pepper4thick slices whole grain sourdough bread, toasted1garlic cloveAleppo-style pepper, finely grated lemon zest, and sliced chives (for serving)PreparationCaramelized LeeksStep 1Slice leeks crosswise into 3\" pieces, then lengthwise into thin matchsticks. Heat oil in a large skillet over medium. Add leeks; season with a pinch of salt. Cook, covered, stirring and tossing occasionally (and reducing heat if needed to avoid getting color on leeks at this point), until leeks are soft, 8–10 minutes. Add rosemary, Aleppo-style pepper, and lemon zest. Continue to cook, stirring often, until leeks are golden brown and caramelized, 5–10 minutes longer. Remove from heat and stir in lemon juice; season with salt.Tartine AssemblyStep 2Toss beans with lemon juice and 2 Tbsp. oil in a medium bowl; season with salt and black pepper.Step 3Drizzle toasts with oil and rub with garlic clove. Top toasts with a dollop of caramelized leeks and a big spoonful of dressed beans. Season with Aleppo-style pepper, then sprinkle lemon zest and chives over.How would you rate Caramelized Leek and Fava Bean Toast?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI've made this at least 5 times since I found it a year ago, maybe more. The leeks are absolutely delicious.\n\nIMO, the fava beans, the garlic on the bread, and the chives are all optional. And the rest of the ingredients don't have to be fresh. Just carmelized leeks with the rosemary (dried is ok), Aleppo style pepper (this is one ingredient I haven't tried substituting), lemon zest (dried is ok), and lemon juice (bottled is ok) on any kind of toast is great.\n\nI've also mixed the leeks with pesto or zhoug and tossed with pasta to make a really savory pasta salad.\n\nOne of the easiest and most versatile dishes I've found recently!Kal5/10/2021Taste-wise, this recipe is incredible. You can substitute gochugaru (Korean red pepper flakes) for the Aleppo pepper if you can't find any.\n\nMy main critique is that I would not recommend covering the leeks, especially if adding some salt. They put out enough water that they won't caramelize for way longer than 10 minutes. Also, you'll want to make sure you don't crowd the pan, which four decent-sized leeks in one medium pan absolutely will. I had to split my leeks into batches. So just prepare for this to take longer than the recipe says.CharlesHamilton, Ontario2/18/2021Incredibly tasty. I used a frozen bag of peas instead of fava. It was messy to eat so I would mash the peas slightly. Tasty eaten by itself as leftovers too. Overall, this was received really well at our family dinner. Anonymous12/27/2020The fava beans are to be eaten raw?Eflat6southern California5/29/2020Delicious spring recipe, but be aware that there's a hidden additional amount of time needed for ingredient prep. Fresh fava beans need to be shelled, blanched, and peeled, and leeks need to be carefully washed for dirt.AnonymousCalifornia5/3/2020I just tried to recipe for the caramelized leek part. I added it on a pizza, with ricotta and pancetta... and boy was it good! This will become a new staple!AnonymousMontreal11/21/2019Explore Bon AppétitToastLeekVegetableFava BeanBeanQuickEasyWeeknight MealsNut-FreeDairy-FreeVeganVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-10", "author": ["Condé Nast"]}