{"id": "54ca6fc281592fef7a573fdaf72c38b5", "url": "https://www.bonappetit.com/story/fire-roasted-tomatoes", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Don't Overlook Fire Roasted Tomatoes At The Grocery Store | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon't Overlook These Tomatoes At The Grocery StoreFiery and fierce.By Emma WartzmanOctober 4, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWhen it comes to canned tomatoes, we generally preach whole peeled or bust. Unlike crushed or diced tomatoes, our favorite brands of whole peeled tomatoes don’t include additional ingredients besides salt (there’s no calcium chloride, which helps tomato chunks stay firm, or “added purée,” which imparts a weird thickness).But there’s one type of canned tomato we rarely talk about, and those are fire-roasted. The silence ends now: As it turns out, they have their time and place to shine.Fire-roasted tomatoes are exactly what they sound like: the tomatoes are charred over a flame before they're  diced and canned (sometimes, they're also enhanced with onion and garlic powder). Often, you can actually see the blackened flecks on the tomatoes. Contact with the flame brings out the tomatoes’ sweetness and, most notably, imparts a distinct smokiness. Essentially, it’s a shortcut to more flavor.Photo by Laura MurrayIn Rick Martinez’s chicken tinga tostadas, smokiness is essential for balancing out the fat in the bacon-y refried beans, the sharpness of the raw onion, and the creamy sprinkling of cheese on top. Sure, you could use whole peeled tomatoes, but the end result would not be nearly as dynamic. With everything else going on in the tostadas, it’s a subtle flavor—but certainly a noticeable one. (Fun fact: In a side-by-side taste test, Cook's Illustrated found a smoky salsa made from fire-roasted tomatoes to be significantly more complex and delicious than one made with regular diced tomatoes!)If you don’t have fire-roasted tomatoes on hand, definitely don’t attempt to char your own. The truth is, regular canned tomatoes will work fine as a substitute. You can even add a pinch of smoked paprika to make up for it.But the next time you’re at the grocery store, grab a can of fire-roasted tomatoes to keep in your pantry. When you decide to make those tostadas or a smoky salsa, or you want to doctor up your usual chili, you’ll be glad to have it.Get the recipe:Chicken Tinga Tostadas With Bacony Black BeansEverything you could possibly want in a tostada (and then some): shredded chicken smothered with a smoky, spicy tomato salsa, bacony refried beans, and a smattering of cilantro and cheese.View RecipeExplore Bon AppétitTomatoCanned TomatoesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-04", "author": ["Condé Nast", "Emma Wartzman"]}