{"id": "54e3c11c0556fcf63b487d144a31efd0", "url": "https://www.bonappetit.com/story/camping-foil-pack", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "This Camping Dinner Requires No Pots, Pans, or Even Plates | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Camping Dinner Requires No Pots, Pans, or Even PlatesGet the fire going, pour a drink, and relax—dinner is a bunch of stuff steamed in a foil packet.By Alex BeggsJuly 1, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Wear a banana print fanny pack. Sleep with socks on. Poop in a little hole I dug myself. There are some things I only do when I’m camping, and that’s what makes the whole thing so special. By far my favorite camping-only activity? Making fish in foil packets.It’s the easiest, maybe healthiest, kinda fanciest dinner that I make, without fail, every time I go camping. Fish and vegetables in a foil packet, steamed to perfection in the campfire coals, topped off with a flavor-packed butter that does the heavy lifting.Here’s the basic formula for one packet:BaseTear off a section of heavy duty foil and in the center, place a vegetable that cooks around the same time as a filet of fish: broccoli or broc rabe, a handful of greens, asparagus, mushrooms, mandoline-sliced potatoes you packed ahead of time, fennel, peppers, and/or onions.MainOn top of the veg, plop a filet of fish, whatever was on sale. Something rich and fatty—think salmon or char—is a good choice because it's forgiving and harder to overcook. And keep in mind that a thick filet will take longer to cook than a thin one. Fat Topper On top of the fish, plop a very generous 2-3 tablespoons of fat and a good sprinkling of the seasoning of your choice. That could just be good butter and Trader Joe’s Everything But the Elote spice mix if you want. But my favorite thing to use is a simple compound butter I make at home before hitting the road. If that sounds fancy, it’s not: I put a stick of room temperature butter in a bowl with a handful of chopped up herbs, a few anchovies, some chile flakes, plenty of salt and pepper, and just mash it all up. Pack it into a portable container and you’re good to go.Wrap ItI wrap the foil packet like a half-assed swan napkin, lengthwise, with two long edges that I curve up to make a little handle. Wrap it however you want to wrap it, it’ll all work out in the end.Cook It I drop the packet to the side of the coals—not in the center of the fire!—and in a few minutes, I can hear the fat melting, the fish sizzling, and everything begins to steam cook inside. This is when I pour another Nalgene Negroni into my offbrand “Polar Camel” insulated mug. I start checking for doneness at around 10 minutes. Grab the foil packet out of the fire with your fire gloves or long tongs, see if the fish is looking mostly opaque and flakes with a fork, and toss it back in for another 3-5 minutes if not. Then let it cool for a minute or two and eat it from the packet on your lap, passing a tiny container of flaky salt and wedges of lemon around the campfire for anyone who needs it.These fishy little foil packs are always a slam dunk, but this same method works well for side dishes as well. If we don’t go the all-in-one route and decide to grill some sausages or chicken wings on our Breeo over the campfire, I’ll still do a foil packet on the side inspired by this old Chris Morocco recipe. I wrap up a few handfuls of those adorable blue and red potatoes from The Little Potato Company, some sliced Spanish chorizo, olive oil, and salt and toss that on the coals for 15 to 20 minutes while everything else cooks. If you’re patient, the little potatoes will get almost charred and caramelized on the outside (yes, inside the foil) while remaining tender and fluffy inside, and the chorizo stains everything red. It’s a crowd favorite every time—just like my fanny pack.Explore Bon AppétitIt's That SimpleBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-01", "author": ["Condé Nast", "Alex Beggs"]}