{"id": "54e64c02a8a0a81272f818dfdfe3d514", "url": "https://www.bonappetit.com/story/all-about-shallots", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "What Are Shallots: Are They Onions Or What? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShallots: So Are They Onions Or What?Welcome to my shallot TED Talk. By Alex BeggsOctober 24, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWhen my editor was like, “Do you want to write a story about shallots,” I jumped at the opportunity to better know my favorite allium. I opened up Alfred, Lord Tennyson’s famous poem about them, only to learn it wasn’t about shallots at all, but some lady. Of Shalott. No relation. Boo!Shallots, as it turns out, are in the onion family: Allium cepa var. Ascalonium, to be exact. They grow from a bulb (called the mother) in clusters (the daughters!). I learned that shallots and other guys who make you cry when you cut them are called LACRIMATORS. Perhaps you’ve dated one! But then the editor was like, “I need you to write about things that are actually useful to home cooks.” So here we are:What’s the difference between a shallot and, like, a yellow onion?Shallots have a delicate  and sweet flavor with a hint of sharpness, while onions bring a more intense heat. You can substitute shallots in nearly any recipe that calls for onions—just make sure you’re using the same volume. (For example, several medium shallots equals about one small yellow onion.)Okay, I'm sold. How should I pick out the good ones?Shallots should feel heavy for their size and firm with dry, papery skins. Avoid any that are sprouted or have soft spots.There's our star!\nTed CavanaughAnd how should I store them?Kept in a cool, dark, and dry place (a.k.a. not in the fridge, where moisture lives), shallots will stay good for weeks.Help, there are so many ways to cut them! What do I do?Dice for vinaigrettes and pan sauces for a subtle, evenly distributed bite.Slice into rings for a raw, pickled, or fried garnish.Cut into matchsticks for an assertive, beautiful topping.Leave whole when you don’t have time for knives. Best peeled and glazed as a side dish or roasted under a chicken.And how should I cook them?Go slow: Place 1 lb. large shallots (unpeeled and rinsed) on a rimmed baking sheet. Roast in a 425° oven until skins are deep golden brown and a knife easily pierces flesh, 50–60 minutes. Let cool slightly, then slip out of skins. Chop and add to: yogurt (for chip dip, or fine, veggies), mayonnaise (for your new favorite sandwich condiment), vinaigrettes (for mellow, not biting, allium flavor), or mashed potatoes (for some extra oomph—why not?).Christina HolmesPickled them: Quick-pickled shallots add acidity and crunch to salads and roasted veg. Here’s how to make them: Toss 1 thinly sliced large shallot in a small bowl with ¼ cup red wine vinegar, 1 Tbsp. sugar, and ½ tsp. kosher salt; let sit, tossing occasionally, 5 minutes.Photo by Chelsie Craig, Food Styling by Pearl JonesFry them: If you don't want to do it yourself, buy them already fried. We love Maesri brand, which is easy to find online; buy in bulk because you’ll be snacking on them right out of the container. Our test kitchen editors sprinkle them on breakfast tacos, soup, dips, and avocado halves.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiSteak salad, anyone?Steak Salad with Shallot VinaigretteCrusty, juicy sliced steak + a fully-loaded salad = what we want to eat most nights of the week, TBH.View RecipeExplore Bon AppétitShallotOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-24", "author": ["Condé Nast", "Alex Beggs"]}