{"id": "54fb0af009ae5178117aff49704a2928", "url": "https://www.bonappetit.com/recipe/hoisin-turkey-meatballs-with-glass-noodles", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Hoisin-Turkey Meatballs with Glass Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHoisin-Turkey Meatballs with Glass NoodlesBy Bridget VanamanJuly 5, 20183.5(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintPutting quinoa in meatballs might sound weird, but trust us, it keeps these meatballs light as air. This recipe from Bridget Vanaman of Mott Street in Chicago is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servingsMeatballsNeutral oil (for greasing)½cup red or white quinoa, rinsedKosher salt3garlic cloves, finely chopped11\" piece ginger, peeled, finely chopped½tsp. crushed red pepper flakes5Tbsp. hoisin sauce, divided1lb. ground turkeyNoodles and Assembly4oz. dried glass noodles2Tbsp. soy sauce3garlic cloves, finely chopped11\" piece ginger, peeled, finely chopped1Tbsp. toasted sesame oil1Tbsp. unseasoned rice vinegar2tsp. sugar2Tbsp. vegetable oil, divided2cups sliced snap peas and/or snow peas2small zucchini, cut into matchsticks (about 4 cups)1cup mung bean sprouts (optional)Kosher salt (optional)Sliced scallions, toasted sesame seeds, and lime wedges (for serving)PreparationMeatballsStep 1Preheat oven to 375°. Grease a large rimmed baking sheet with oil. Cook quinoa in a small pot of boiling salted water until tender, 15–18 minutes; drain. Let cool slightly.Step 2Meanwhile, mix garlic, ginger, red pepper flakes, and 3 Tbsp. hoisin in a medium bowl. Add quinoa, turkey, and a large pinch of salt. Stir to combine. Using oiled hands, roll into 16–18 2\" balls (they will seem very soft but will firm up as they bake) and place on prepared baking sheet. Bake meatballs until lightly browned and nearly cooked through, 15–18 minutes. Brush remaining 2 Tbsp. hoisin over meatballs. Continue to bake until hoisin has set into a glaze, 3–5 minutes longer.Noodles and AssemblyStep 3Cook noodles according to package directions. Mix soy sauce, garlic, ginger, sesame oil, vinegar, and sugar in a small bowl until sugar dissolves; set sauce aside.Step 4Heat 1 Tbsp. vegetable oil in a large nonstick skillet over medium-high. Add peas and cook, tossing occasionally, just until they become bright green and partly tender, about 2 minutes. Transfer to a plate. Add remaining 1 Tbsp. oil to skillet along with zucchini and cook, tossing frequently, until al dente, about 1 minute. Add reserved sauce, followed by noodles, sprouts (if using), and peas. Cook, tossing often, just until noodles and vegetables are coated in sauce, about 2 minutes. Season with salt, if needed.Step 5Divide noodle mixture among plates. Top with meatballs, scallions, sesame seeds, and a squeeze of lime juice.How would you rate Hoisin-Turkey Meatballs with Glass Noodles?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleHealthy, substantial, all around delicious way to eat meatballs! I am surprised to see several reviewers saying the meatballs are dry, since that hasn't been my experience at all. The slightly sweet, aromatic hoisin sauce makes minced turkey into something special. I've made these several times and have served them with glass noodles as outlined here, with rice, on top of salad, and in a sort of bahn mi style sandwich. Definitely recommend.Sadie BeeQueens, NY3/6/2021I agree with a lot of the other reviewers. These meatballs were a bit dry--but pleasantly soft. I think it's the high volume of quinoa? I also wanted a bit more sauce on the noodles. RebeccaDenver, CO12/4/2020I read the reviews below ahead of cooking and I solved the dryness issue of the meatballs by adding an egg to the mince. I also did 5tbsp hoisin instead of 3. As for the sauce I basically made double the amount and it turned out great. Hubby loved it.Mel AplinAustralia5/31/2020Awful recipe. Dry mealy meatballs. Sauce was tasty, but not nearly enough to coat all of the ingredients. Ending up tossing it.AnonymousSeattle5/25/2020This was more work than I expected, but surprisingly good!  I did read the reviews so added some chopped onion and shredded carrot to the meatballs.  I also added some vegetables and the other half of the onion to the stir fried noodles.  I would definitely make it again!AnonymousBoston4/2/2019The meatballs were tasty and light, with the quinoa.  The noodles were packed with vegetables.  Couldn't find glass noodles so substituted thin rice noodles.  The noodle sauce could have used a little more soy, though not sure whether this is because of the rice noodle substitution.  Very healthy, and both kids loved it and want it again-- a win for everyone.AnonymousPhiladelphia area4/1/2019I work as a cook at a boarding school, meaning I cook meals for 20-ish extremely picky preteen girls every day - I tried this recipe out today and they ALL loved these meatballs. The quinoa really helped keep the turkey moist and light, but texture-wise they had no idea they were eating quinoa! This will definitely be in my regular meal planning rotation from now on!1/8/2019The meatballs were somehow flavorless despite all the strong flavors in them. The texture was also off. i think the quinoa was to blame. The noodles were okay but I'm not going to to be making this again. Erika SBoston8/19/2018SO DELICIOUS! Really simple to make and didn't require any crazy ingredients. Only thing I would do differently is use a little more veggies and less noodles. The noodles are delicious but theres way too many of them. I would also say this server 6 as opposed to 4! So yummy and will definitely make again.AnonymousBoston, MA8/14/2018Explore Bon AppétitMeatballQuinoaRice & GrainsSugar Snap PeaPeaVegetableZucchiniSquashTurkeyPoultryGlass NoodleNoodlePasta & NoodlesEasyWeeknight MealsMainDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-05", "author": ["Condé Nast", "Bridget Vanaman"]}