{"id": "551df2f9b366c4524833c85c6a6bbddd", "url": "https://www.bonappetit.com/story/heilala-vanilla-bean-paste", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Heilala Vanilla Bean Paste Is the Best Gift For the Baker in Your Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHeilala Vanilla Bean Paste Is the Best Gift For the Baker in Your LifeResponsibly grown, incredibly potent, and destined to improve holiday cookies. By Sarah JampelDecember 19, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Picking out an excellent food gift can be a true test of friendship. The best ones are tricky to find (see: pasta hand-shaped in Italy, saffron from Iran) or, ahem, illegal (see: unpasteurized cheese smuggled in from France*, tonka beans smuggled in from England*, raw milk from a farm upstate). They might be homemade, or highly personal, or, even better, luxurious-feeling things—the sort of item you’d hesitate to buy for yourself but feel incredibly grateful to own.Vanilla bean paste falls squarely into that last subsection. It’s on the pricey side, but any baker would love to have it—and not just to look at, but to actually use.While I refuse to speak negatively against vanilla beans—a veritable gift from the heavens—I will say that vanilla bean paste, which consists of seeds suspended in extract, is relatively less expensive and more convenient to use (the splitting and scraping has been done for you). Typically, one teaspoon of paste is the equivalent of one vanilla bean, which means that you’ll turn out batches of cookies, cakes, puddings, jams, and simple syrups before the jar runs out.Compared to vanilla extract, paste has a more intense flavor (you’ll taste the difference in any vanilla-forward desserts, like shortbread, custards, yellow cake, whipped cream). Plus, it gives you those signature seed flecks, which are not only beautiful but also scream, “This is going to taste like vanilla!!!” That’s what makes paste an excellent gift and extract a less great one.My jar of choice is the super potent Heilala vanilla bean paste. It smells so good that I instinctively take a huge whiff every time I bake with it. The company started in 2002 as an aid project to bolster the economy of Tonga in the South Pacific after a cyclone, and the vanilla is grown sustainably and pollinated by hand—so you can feel good about buying a jar for a friend. Then drop a hint that some vanilla-flecked cookies would make a pretty great thank you in return... ;)Heilala Vanilla Bean Paste$15 at Amazon*Legally, I cannot recommend you do either of these things! But personally, I would accept either as a spectacular anytime present, should you wish to bestow them upon me.Explore Bon AppétitHighly RecommendShoppingRead MorecultureThe Test Kitchen Swears By This Cookie and Cake CarrierBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-19", "author": ["Condé Nast", "Sarah Jampel"]}