{"id": "551d7b3304718b949d24bac14f7d892d", "url": "https://www.bonappetit.com/story/john-cena", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "John Cena Drinks Protein Powder for Breakfast but Still Makes Time for Red Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLike a True Champ, John Cena Drinks Protein Powder and Red WineNo, not at the same time.By Adam RapoportMarch 16, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailJohn Cena isn't the type to mince words. \"I'm the most boring food guy you're ever going to talk to,\" insists the 16-time WWE champion and star of next month's raucous comedy Blockers. Case in point: Ask him what he had for breakfast. \"This morning? Four scoops of protein and four glasses of milk.\" Which, yeah, is kind of intense. But we guess that's what you have to do to maintain a chiseled 250-pound physique at age 40. Here, he talks with Bon Appetit editor-in-chief Adam Rapoport about red wine, staying fit, and the baked goods he can't resist.Adam Rapoport:  What have you had to eat today so far?John Cena:  This one is an uneventful day. I've had four scoops of protein and one cup of coffee.AR: What does that mean, \"four scoops of protein?\"JC:  That means four scoops of meal replacement substitute, and actually, I'm sorry. I also had four cups of milk, because that makes each meal replacement with two cups of skim milk. I mean, I've had days and weeks where I've lived off of nothing but powder. It's boring as hell, but once it calls for that, it calls for it.AR: On a day like today, why did you do the protein instead of not a proper breakfast with actual food?JC:  Just efficiency. There was a lot to be done early on in the day in San Diego. I had a hard out at 11:00, so I made it. I probably will get something to eat as soon as I get to where I'm going in Los Angeles, and that will probably consist of a small portion of steak, maybe 8 oz., medium rare, a starter salad, and probably two vegetable sides. I'm just assuming that spinach and Brussels sprouts will probably be there—or spinach and broccoli—because usually the place that I go, I have those choices.AR:  What will you then do for dinner? Or will you have an afternoon snack, I assume at some point? In between lunch and dinner?JC:  No, I'll hold out for a nice dinner. So lunch will probably be like 2:10 p.m, and I'm hoping my lady will join me to dinner at like 6:30 p.m., closer maybe to 7:00 p.m. And then I'll probably repeat and have the same sort of set up, but just for the nights, a full-bodied glass of red.AR:  Question: How do you sort of stick to one glass of red and not go, \"Oh, you know what? I'm going to have that second nice full-bodied glass of red.\"JC:  Oh, no, by \"glass\" I meant, well, the bottle is a glass.AR:  [LAUGHTER] Okay. Do you have particular favorite types of wines or grape varieties or brands that you like?JC:  I do. I like Malbec and pure Cab varietals, especially from Napa. I just know the area well. They have some well known winemakers from there, also some little-known brands that'll occasionally find their way out on a restaurant's wine list. It's pretty exciting. I'm starting to get into like Washington and Oregon stuff, but I just don't know enough.I like my coffee as bold as my wine.AR:  Whether you're in the ring or doing a movie , how often are you trying to put on weight compared to trying to take off weight? Or do you stay pretty steady these days?JC: I am the most boring food guy you're ever going to talk to. I have been 250 lbs. for about a decade now.AR:  So you're not like a lineman, where you have an off-season or anything like that. You just stay steady.JC:  Well, you know, in the WWE life, you're on 52 weeks a year. There is no off-season. I deviate between, literally, 246 and 256. On any given day, I'll peg myself at 250. So—AR:  When you're \"being bad,” what are you eating?JC:  I love me some good baked goods... I'm a sucker for a good set of hash browns or pancakes or French toast.  I love baked goods for dessert, as well—like cheesecake and just any sort of cookies. I'm a cookie monster. And starch dishes, like I love a good like macaroni and cheese. I know a lot of restaurants are doing solid mac and cheese sides. Those are always great. I love like fried rice—rice in general. Sushi with rice is great. And then I like ice cream. I'm a sucker for ice cream, too. Cake, fries, and ice cream—just like every kid.AR:  So how do you monitor yourself?JC:  Yeah, it's not like a bank, borrow, lend system. We all know what's bad for us. And I think if you consistently make bad decisions, then you're going to end up on the short end of the stick. So, I mean, I enjoy stuff like that, but I've got a good bar for like, \"Okay, this is too much. This is not enough.\" You know? I'm not one of those folks that will bring their own food places. I live life to be lived. I just do. You know, sometimes you can't help but eat a hamburger every once in a while.Explore Bon AppétitHealthyishInterviewsRead MorecultureWhy I'm Eating 90 Grams of Protein a DayBy Adriana VelezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-16", "author": ["Condé Nast", "Adam Rapoport"]}