{"id": "5522b71f3caafdc5f7223dd60557e9bd", "url": "https://www.bonappetit.com/story/party-tricks-marinate-it-yourself-appetizers", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "The Easiest Homemade Party Appetizers Are Just a Marinade Away | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Easiest Homemade Party Appetizers Are Just a Marinade AwayStep away from the olive bar. Marinating your own beans, artichoke hearts, and veggies at home couldn't be easier, or more impressive.By Alison RomanNovember 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.If you, like me, find the snack hour portion of having people over as exciting as the actual meal, then you are likely familiar with the antipasti bar at your local grocery store. You know, the trough of pre-marinated artichoke hearts, dried herb-smothered olives, and picked-over gigante beans glistening beneath a sneeze guard, surrounded by signs indicating that no, you should absolutely not sample the goods before paying. I understand the urge to load up a few plastic containers with these various treats, bring them home, slop them into a few bowls, serve them to your nearest and dearest and call it a day. The appeal is clear, I know, because \"it's just. so. easy.\"But I am going to propose something radical, and that is to resist the lure of the pre-made antipasti. Pull out some semi-homemade vibes and MIY (Marinade it Yourself)! Not only is it almost as easy (I said “almost”), but this way YOU get to control the antipasti narrative (my new favorite phrase). How spicy, how tangy, how salty: It’s all up to you.First, pick the thing you’re going to marinate. Classic antipasti stuff like artichoke hearts, butter beans, olives, hearts of palm can all be purchased in cans or jars, unmarinated and unseasoned. Other things that love a good tangy, oily bath: firm-ish and/or creamy cheeses like feta, ricotta salata and chevre sliced or coarsely crumbled (yes, the creamy goat cheese from the 90’s is BACK, baby, and it’s ready for a marinade) and simple roasted vegetables like peppers, eggplant and mushrooms.Place said items in a mixing bowl, a glass jar, a baking dish, you name it. As a general rule, you want something deeper (rather than shallow) so that whatever you’re marinating can be at least mostly submerged.That's the stuff!\nPhoto by Alex Lau, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiNext, you need your marinade. Start by warming a generous amount of olive oil in a small pot over low heat. Because fat carries flavor better than anything water based, here’s where you want to add aromatics like crushed garlic, dried chilies or slices/peels of citrus. Let it simmer a few minutes, just enough to infuse the oil and take the edge off any of the raw ingredients. Remove from heat, let cool slightly, then add your acid. For these purposes, nothing is better than vinegar. White wine, red wine or white distilled are best for their maximum tang, minimal sweetness and subtle flavor. If you’re feeling bold, it can be nice to add some thinly sliced or finely chopped shallot here as well, to pickle lightly. Add that to the oil and season it with lots of salt and pepper. Think of this as a highly seasoned, very oily vinaigrette. It should be salty, tangy and flavorful as hell.So, once you have your marinade and your things are all snug in a bowl or glass jar or whatever you like, pour the liquid over. How long they need to sit will depend on the item being marinated—a quick 30-minute bath will suffice for tender vegetables like roasted mushrooms or blistered peppers, but give denser items like artichokes and canned beans closer to an hour.  Or, for the overachievers, you can marinate any of these thing up to a week in advance, kept in a well-sealed container in the fridge.When it comes time to serve, let the items come as close to room temperature as possible to give the oil a chance to liquify, season again with a bit of salt if needed, and transfer to the cute serving vessel of your choosing (shallow bowls and plates both work). Add a scattering of tender herbs if you like (parsley, chives and mint are my favorites), and call it a night.More Party Tricks, right this way:How to Host a Dinner Party When You Just Don't Feel Like CookingThere. Will. Be. Fried. Chicken. Alison Roman gives you permission to phone in your next party.View StoryExplore Bon AppétitParty TricksappetizerOliveBeanArtichokePartyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Alison Roman"]}