{"id": "5531d4b9da531abaf6742eab1f10ea49", "url": "https://www.bonappetit.com/story/bells-los-alamos-california", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "This French Bistro Is the Reason You Should Visit Los Alamos, California | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis French Bistro Is the Reason You Should Visit Los Alamos, CaliforniaCome for the Western vibes, stay for the moules frites.By Rachel KartenSeptember 4, 2019FacebookTwitterEmailPHOTO BY KAYLA TIERNEYFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Driving through Los Alamos, California, is like watching an old Western film. There’s 1880 Union Hotel, where it looks like a bar fight could break out at any moment. There’s the tiny post office straight out of a set designer’s dream. It’s essentially the kind of town where you wouldn’t blink an eye if you saw a tumbleweed roll through the main (and only) street. Which is why I was so surprised to find Bell’s, an extremely charming and ultra delicious French bistro, smack in the middle of it.So, uh, why open a French restaurant on a one-street town in California? Well, for starters, chef and co-owner Daisy Ryan is originally from the Santa Ynez Valley, where Los Alamos is located. She and her husband Greg Ryan (also a co-owner) recently moved back to the area after working together at Per Se to open Bell’s. Plus, thanks to other spots like natural wine bar Bodega and renovated motel Skyview Los Alamos, the area is quickly becoming a vacation spot for chill-seeking Los Angeles folks. And one New Yorker (me!).When I visited Bell’s this past summer, I was blown away by it all (vibes, check; food, check; bathroom, check—really!). Here, in no particular order, are all the reasons I love it:The perfect appetizer DOES exist. And it’s tinned Spanish sardines (from La Brújula) with homemade saltines sprinkled with chives. *chef’s kiss*There’s a vintage French sardine recipe book by the bathroom. That’s a reason to visit.Okay, wait. Another perfect appetizer exists. We’re talking a sliver of crepe cake layered with crème fraîche and topped with caviar AND Santa Barbara uni. Decadent.The salads here aren’t afterthoughts. When I was there, the stone fruit salad had scarlet runner beans, aged cheddar, crunchy pistachios, and a tangy whole-grain mustard vinaigrette.Then there’s the moules frites. It’s a humble dish, that even if you’ve had it a thousand times, just tastes so much better at Bell’s. Maybe it’s the fresh Santa Barbara Hope Ranch mussels. Or the perfect garlicky, saffron-y broth. Or maybe it’s the freakin’ cute dish it comes in that says “Moules.” Either way, you’re ordering it.The fries are salty and McDonald’s-esque in the best way.The dense and super buttery gâteau Breton cake is the only way I’d like to end meals from here on out.And, and, and!Okay, I am pretty sure I’ve exceeded the word count allowed for this column, so here you go: Head to Los Alamos for the saloon vibes, stay for the moules frites (and all the things!) at Bell’s.Go there: Bell’sExplore Bon AppétitHighly RecommendRestaurantsCaliforniaFrenchRead MorerestaurantsI Will Gladly Take This Glorious Rotisserie Chicken Joint Over Any Hyped L.A. RestaurantBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-04", "author": ["Condé Nast", "Rachel Karten"]}