{"id": "554883ab2c0fa75f2c8fa89a1236292a", "url": "https://www.bonappetit.com/recipe/the-greenest-coconut-curry-with-clams-and-rice-noodles", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "The Greenest Coconut Curry with Clams and Rice Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueThe Greenest Coconut Curry with Clams and Rice NoodlesBy Andy BaraghaniJanuary 9, 20184.2(7)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintCoconut cream is what gives this soup its velvety richness. Otherwise it’d just be green juice and noodles! Add the fresh herb purée to any clear broth to give it a shock of green.Ingredients4 servings2serrano chiles, 1 coarsely chopped, 1 thinly sliced13-inch piece ginger, peeled, thinly sliced2lemongrass stalks, bottom third only, tough outer layers removed, thinly sliced2garlic cloves, smashed1tablespoon fish sauce1tablespoon light brown sugar15.4-ounce can coconut cream3cups cilantro leaves with tender stems3cups basil leaves, plus more for serving2tablespoons virgin coconut oil or vegetable oil36littleneck clams (about 4 pounds), scrubbed8ounces rice stick noodles½limeKosher saltPreparationStep 1Purée chopped chile, ginger, lemongrass, garlic, fish sauce, brown sugar, and 3 cups water in a blender until smooth. Transfer curry to a small bowl. Reserve blender (no need to clean).Step 2Purée coconut cream, cilantro, 3 cups basil, and ¼ cup ice water in blender until very smooth; set herb purée aside.Step 3Heat oil in a large saucepan or small pot over medium-high. Add clams, cover, and cook until clams open, 5–7 minutes. Uncover and transfer opened clams to a medium bowl, reserving cooking liquid in saucepan. If any clams are still closed, cover and cook a few minutes longer, then add to bowl with others; discard any clams that refuse to open.Step 4Add curry base to saucepan and bring to a boil. Reduce heat and simmer 10 minutes to let flavors meld.Step 5Meanwhile, cook noodles according to package directions. Drain and rinse under cold water. Divide among bowls.Step 6Using a slotted spoon, transfer clams to noodle bowls. Pour any accumulated clam-cooking liquid into curry mixture and stir in herb purée; bring to a boil. Immediately remove from heat and squeeze in juice from lime. Taste and season with salt if needed. Ladle curry over clams and noodles. Top with sliced chile and basil leaves.How would you rate The Greenest Coconut Curry with Clams and Rice Noodles?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was freaking delicious. Used shirataki noodles instead. About 50 clams for 4, 5 per person in shell on top (like the picture) and the rest out of shell, in the soup A couple of serranos is fine, but also begs for 1-2 more Thai green chiliesA cook in BuffaloBuffalo, NY8/29/2021great recipeAnonymousMorganville, NJ5/19/2021Great recipe, I have made this many times and everyone I've made it for absolutely loves it! Though I switched to thinner noodles and liked it better.AnonymousEugene, Oregon2/28/2018Explore Bon AppétitCurrySerrano ChileChileVegetableLemongrassHerbs & SpicesCilantroCoconutFruitClamShellfishSeafoodRice NoodleNoodlePasta & NoodlesQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}