{"id": "5556c577a9d3accefd99f21f9a7911c4", "url": "https://www.bonappetit.com/recipe/sour-cream-and-onion-potato-salad", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Sour Cream and Onion Potato Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSour Cream and Onion Potato SaladBy Molly BazJune 23, 20194.2(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis recipe was an excuse to combine our favorite potato chip flavor with the creamy, salty \"salad\" of our dreams. To hammer that home, the whole dish is topped with crumbled sour cream and onion potato chips. We love to eat this warm, we love to eat this cold, we love to eat this while wearing jorts in the park, and we love to eat this while wearing pajamas on the couch. Do make sure to start your potatoes in cold water so that they'll cook evenly through and through (if you add potatoes to hot water, the outsides will turn mushy before the insides are tender—no bueno).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonForkLarge Bowl$18 At AmazonSpatula$12.99 At AmazonMicroplane$16 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASieve$18 At AmazonPaper Towels$13.45 At AmazonGlass Measuring Cup$19.99 At AmazonColander$11 At AmazonIngredients4 servings2lb. baby Yukon Gold potatoes1cup kosher salt, plus more¾cup sour cream¼cup mayonnaise1Tbsp. onion powder2tsp. Dijon mustard1tsp. freshly ground black pepper1garlic clove1bunch chives¼small red onion½cup sour cream and onion potato chipsPreparationStep 1Place 2 lb. baby Yukon Gold potatoes in a large pot, cover with 3 qt. water, then 1 cup kosher salt, and bring to a boil over medium-high heat. (Yes, this is a lot of salt, but it’s the right amount for the job. Potatoes are big and dense—so it takes highly concentrated water to ensure they're seasoned through and through, Plus, think about how much of that gets left behind in the water you pour out!) Once water comes to a boil, reduce heat, adjusting as needed to maintain a simmer, and cook potatoes until fork-tender, 15–20 minutes.Step 2Meanwhile, make your dressing. Combine ¾ cup sour cream, ¼ cup mayonnaise, 1 Tbsp. onion powder, 2 tsp. Dijon mustard, and 1 tsp. black pepper in a large bowl. Finely grate 1 garlic clove into dressing and stir to combine. Thinly slice 1 bunch chives. Transfer half of chives to dressing; set remaining aside for serving. Slice ¼ small red onion as thinly as possible through root end. (This might not be the way you usually cut an onion, but we're going for shallow arcs rather than chunky quarter-moons.) Transfer to a fine-mesh sieve and rinse for several seconds (this eliminates some of that astringent raw onion flavor). Pat dry with paper towels. Add half of onion to bowl with dressing; reserve remaining onion for serving.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3When potatoes are tender, scoop out ½ cup potato cooking liquid—we're going to use this later to thicken the sauce, warm up the cold dairy, and flavor the potatoes. Drain potatoes in a colander and let cool 10 minutes or until cool enough to handle. Crush each potato slightly with your hands (it's easiest to do this if you transfer them to a baking sheet or big plate first) and add to bowl with dressing.Step 4Toss potatoes with dressing and ¼ cup potato cooking liquid. You want to do this while the potatoes are still warm so that they'll better absorb all of the seasoning. Don't worry if the dressing looks a little loose and watery at the beginning—it will all get absorbed and be nice and creamy. Taste and add more salt or, if your dressing looks too thick, a splash of potato cooking liquid.Step 5Top potatoes with reserved chives and onion. Crumble ½ cup sour cream and onion potato chips over—in big pieces if you really just want to be eating a bag of chips or in small pieces if you'd like more of a bread crumb effect.How would you rate Sour Cream and Onion Potato Salad?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleI used Diamond brand Kosher salt and it was perfect. Smitten Kitchen has an awesome article on the difference between kosher and other salts. I’d highly recommend checking that out.Anonymous5/29/2021This is a great recipe. No need for the chips though; it is a nice conceit but they will go soggy if there are leftovers and they don't really have to do with the overall taste... which is yummy. AnonymousCanada5/25/2021Prepared as directed and it was really, really good. Don't change anything.... if anything use less of the salt water at the end for a less salty product but I followed it to the T and it was delicious.Rhoads FamilyPennsylvania3/25/2021Like another reviewer, I wondered about the omission of an acid, and was thinking about adding a splash of apple cider vinegar, but decided to follow the recipe more or less as written for my first attempt. But I just couldn't use all that salt. Added only 3 tablespoons of kosher salt to the cooking water and none at all to the dressing, and the finished result was perfectly seasoned. And I found that the onion and the generous amount of chives added enough of a piquant note that I didn't miss the vinegar. I also omitted the chips. Will most likely make again, as I always have an excess of chives in my herb garden, but may try this recipe with a bit of vinegar next time, to see if it adds anything.\nAnonymousSF Bay Area10/16/2020Best potato salad I’ve ever had. The recipe does specify 3 qts of water and a large pot for cooking the potatoes. If you cook your potatoes in a small pot with minimal water like I do, yeah, inedible potatoes.  BTW the same recipe (minus the mayo) makes sour cream and onion MASHED POTATOES.  You’re welcome. AnonymousSouth Carolina9/6/2020OMG.  This is the best potato salad ever.  Like so good that we'll never be able to eat another pre-made one again without thinking of this one.  Even just the smell of the dressing when it hits the warm potatoes made me hungry!  YES, that's a lot of salt, just like the recipe said.  But YES, it's KOSHER salt - not table salt - which is must less \"salty\".  It also isn't all going into the food as if it was being thrown in at the end, so relax...  Cut back on it if you want, but we all thought it turned out absolutely perfect.  Used tiny Yukon golds because that's what the store had and it worked out really well - little smashed bite-sized pieces of heaven!  Will likely use a little more red onion next time, as that was a great crunch.  This will go into our regular pot-luck rotation as well as a grill-out side every summer!txhuskerTexas8/6/2020Well, I haven't made this yet (even though I love my salt), because my cardiologist would be horrified.\nIt would be useful if this recipe contained a nutritional content for Sodium content to get an idea of how much salt is absorbed by the potatoes. AnonymousPennsylvania8/6/2020Where's the acid?  Potato salads need an acid, usually vinegar to brighten them up.  This was dull without it and I don't think the potato chips added anything other than crunch.  Also, the salt called for in cooking the potatoes was way too much.\nCalifornia8/5/2020This showed up in the August 2020 issue and it doesn't specify KOSHER salt. Beware. I skipped the salt water in the dressing and found it super salty still with the chips. Next time the chips are enough for my taste. Also the salt left a total mess on the stove that easily cleaned up. I am determined to make this again without the salt water. bmassi8381SF Bay Area7/28/2020We were super disappointed in this recipe.  Everything else we have ever made from BA has been delicious.  I followed it exactly and wondered about the salt as I added it.   Gross.  Completely disgusting.  We threw everything away.  I'll try it again another time with a normal amount of salt in the water as everything else was great.  Anonymoustx7/28/2020Wayyyyy toooo much salt. Ruined the entire thing. I know Molly likes salt but wayyyy too much. Anonymous7/28/2020We loved this spin on potato salad!  Yummy!mol1michigan7/27/2020Fantastic and simple. I didn't have baby Yukon's, soused regular and cut into chunks to smash. Also used shallot's in place of red onion as I had that readily available as well. Great flavor, enjoyed by all.AnonymousWoodinville, WA5/25/2020This recipe made me look good.  Full of flavor.  I added a finely sliced shallot to the sauce as well.AnonymousAmherst, Wisconsin3/9/2020Awesome, here in Rochester NY Salt Potatoes are a staple.  I used a bag of Our salt potatoes, they sell in our grocery stores, I did not use the extra salt water.  I also use Daisy sour cream, Hellman’s Mayo and dried chives, made in January.  I think better quality products make more delicious dishes. I will be making this for all our parties We go to in the summer. In 2020.  ThanksRochester, NY1/22/2020Explore Bon AppétitSaladPotato SaladAmericanPotatoVegetableChiveHerbs & SpicesRed OnionOnionYukon Gold PotatoSideGluten-FreeVegetarianSimmerFourth Of JulyMemorial DayLabor DayLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-23", "author": ["Condé Nast", "Molly Baz"]}