{"id": "5567ca9e038fbc0a30e7df134a2dd027", "url": "https://www.bonappetit.com/story/mango-slushy-air-conditioner", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "This Mango Slushy Is a Personal Air Conditioner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Mango Slushy Is a Personal Air ConditionerThe latest edition of the Test Kitchen Dispatch by Bon Appétit food director Carla Lalli Music.By Carla Lalli MusicJuly 26, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.What the slush?I don’t understand why more people aren’t making this glorious personal air-conditioner of a beverage. I haven’t seen even a single picture of the Healthyish Beauty-Food Mango Slushy in my Instagram feed, and yet I’ve seen a thousand videos of people getting out moving cars doing the #kikidoyouloveme dance.The slushy is not only more entertaining, it’s more rewarding.You don’t even have to wait for the image to load to know there’s genius at work. Enticement begins with the recipe name alone: Beauty-Food Mango Slushy. Sure, fine, whatever—it’s blended frozen fruit that you can drink, but don’t you dare call it a “smoothie”. This is a slushy, and if you’ve ever been tempted to buy a plastic sandal simply because someone labeled it a Jelly, you know how important branding can be.Want this letter before it hits the website? Sign up for our newsletter!A slushy, despite (or maybe because of) its subliminal associations with 7-Eleven Slurpees, sounds freaking incredible. It sounds special. A slushy is, in fact, colder than a smoothie (I just decided). Remember the Polar Vortex winter of 2015, when the Atlantic ocean got so cold that the waves started to freeze? That’s what this is like, except the ingredients are straight out of the tropical zone: Frozen mango, lean and hydrating coconut water, zippy lime juice, a big pinch of salt, and a non-ignorable amount of crushed red pepper flakes. Molly Baz, who created this concoction, took the legendary combination of fresh mango with Tajín and lime juice and slushified it. You’re welcome! (Thanks, Molly.)Back to the genius marketing though: “Beauty-Food Mango Slushy.” Beauty food! Now that you mention it, that vibrant orange is quite a fetching color! You mean the slushy has vitamins A and C to make me more beautiful! As if! What the heck—make mine a double!Smoothies are for children. They always have bananas, and you blend them till they’re frothy, and then you stick a biodegradable straw in them and hope your kid doesn’t taste the cup of rolled oats you added for nutrition. It’s called survival.Alternatively, a slushy made with frozen mango whips up into a dense, crystallized, silky, semi-frozen state, and instead of the straw there’s a smattering of chile flakes. It’s grown-up stuff, and if you added a few ounces of rum—well, that would be beautiful too.If I had half a brain, I would be subsisting on these exclusively. Instead I have been enduring late-afternoon tastings of the entire Thanksgiving menu in the test kitchen for the past two weeks, as the New York City heat and humidity wreaks havoc on my attitude and my naturally curly hair. I’m a special kind of cranky that only a very photogenic slushy can fix. See you at the swim-up bar.Get the recipe:Beauty-Food Mango SlushyMangoes are packed with vitamins C and A, both of which provide major skin-brightening benefits. Lime and chile keep this slushy spicy and bright.View RecipeExplore Bon AppétitMangoCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-26", "author": ["Condé Nast", "Carla Lalli Music"]}