{"id": "556cc9d982a12eac8b4eba166d1c622b", "url": "https://www.bonappetit.com/recipe/roasted-brussels-sprouts-with-warm-honey-glaze", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Roasted Brussels Sprouts  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueRoasted Brussels Sprouts With Warm Honey GlazeBy Molly BazDecember 3, 20214.7(143)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintMake these honey-glazed brussels sprouts once and we promise they’ll become a permanent fixture of your regular weeknight winter cooking rotation. Why? This brussels sprouts recipe hits all the right notes—pleasantly charred veg, sticky-sweet honey, tangy red wine vinegar, bright lemon zest, spicy chile flakes, and a good dose of butter—for a perfectly balanced dish. If the heat is too much for you or your dinner companions, feel free to turn it down by cutting back on the chiles or leaving them out all together.Try serving them alongside something simple like roast chicken with potatoes, a perfectly made steak, or sweet potato tian if you’re having a vegetarian meal.Editor’s note: This recipe was originally published September 25, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonMicroplane$16 At AmazonWhisk$10 At AmazonTongs$13 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 servings1½lb. brussels sprouts, trimmed, halved¼cup extra-virgin olive oil½tsp. kosher salt, plus moreFreshly ground black pepper¼cup honey⅓cup sherry vinegar or red wine vinegar¾tsp. crushed red pepper flakes (optional)3Tbsp. unsalted butter3scallions, thinly sliced on a diagonal1tsp. finely grated lemon zestPreparationStep 1Place a rimmed baking sheet on bottom rack of oven; preheat to 450°. Toss brussels sprouts and oil in a large bowl; season with salt and black pepper.Step 2Carefully remove baking sheet from oven. Using tongs, arrange brussels cut side down on baking sheet. Roast brussels on bottom rack until softened and deeply browned, 20–25 minutes.Step 3Meanwhile, bring honey to a simmer in a small saucepan over medium-high heat. Reduce heat to medium-low and cook, stirring often, until honey is a deep amber color but not burnt (it will be foamy, that’s okay), 3–4 minutes.Step 4Remove from heat and add vinegar and red pepper flakes, if using, and whisk until sauce is smooth (it will bubble up quite aggressively when you add the vinegar before settling). Return saucepan to medium heat, add butter and ½ tsp. salt, and cook, whisking constantly, until glaze is glossy, bubbling, and slightly thickened, 3–4 minutes.Step 5Transfer brussels sprouts to a large bowl. Add glaze and scallions and toss to combine. Transfer to a platter and top with lemon zest.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Roasted Brussels Sprouts With Warm Honey Glaze?Leave a ReviewTell us what you thinkReviews (54)Back to TopTriangleI'm NOT a born-again Christian, 😉 but these were still the best Brussels Sprouts I've ever made, and possibly ever eaten. First runner-up was served to me in a local brewpub here in Portland, Oregon - they had a Vadouvan Curry treatment and were heavenly - leading to an education for me on Vadouvan curry, but that's another story. THESE had - for me - the perfect balance between tangy (vineger /acid), spicy, and sweet.  Kind of like Chicken Marbella, if you've ever had that. (If not, you should. A now-legendary sweet / tangy recipe.) \nKEEPER! Ken P PDXPortland, OR1/19/2022These were the best I’ve ever had better than a restaurant that we went to that serve them absolutely delicious and I’m recommending it to my family! Also I am a born-again Christian and I wanted to ask if you know Jesus Christ as your savior the Bible says believe on the Lord Jesus Christ and they shall be saved and thy house. Acts 16:31 but as many as received him to them gave he power to become the sons of God to them that believe on his name. John 112Happy Virginia 1/17/2022This recipe is truly delightful. I made two pounds of Brussel sprouts and the sauce was still too much, but it’s nice to have some leftover sauce.\nI added pancetta, truly delicious Anonymous12/27/2021This recipe made the best Brussels sprouts I’ve ever tasted. And they are so easy to prepare!AnonymousThe Adirondacks 12/26/2021Loved the way of cooking the sprouts - they did come out crispier than usual. But you need about half the amount of the glaze, Wasn't a huge fan of this one.AnonymousOakland, CA11/26/2021Love it. I tried numerous recipes before sticking with this one. It's a true crowd-pleaser\n\nI don't usually use all the glaze and as a variant, bacon makes it even better.DenverChefDenver, CO11/26/2021these brussels sprouts are easy enough for everyday and delicious enough to wow a crowd at a dinner party or holiday gatheringranalos angeles11/25/2021This recipe was a hit at Thanksgiving. It's more tangy than sweet, if you're worried about that. For those looking to bring it somewhere, I  made the glaze ahead of time and kept it relatively warm in a coozy/jar combo, reheated the sprouts when it was time to eat, and topped with the glaze/scallions/zest at the last. The glaze was never super thick. I don't know if that was on me or just the way it is, but the sprouts were tasty regardless.AnonymousChicago11/21/2021I love the honey and acid to balance the dish. Adding scallions is genius. Maybe some fresh thyme to the it with some turkey too.John GKennesaw, GA11/10/2021I was a sceptic, esp. given how runny the glaze was initially, but it is as delicious as other reviewers have claimed. I've been convinced that Brussels sprouts should become a more regular feature of the table rather than just making a one-off appearance at Christmas.AnonymousLondon, UK12/29/2020Brussels looked perfect coming out of the oven but the glaze turned them soggy immediately.  Flavor was great but texture was a mess.  I think the problem was the glaze was way too hot, I'd cranked the heat pretty high to get it to reduce into a more glazy consistency and it never would.  then when i poured onto the brussels it just overcooked them.  noticed that the leftover glaze (recipe makes about 2x what you need) after it had cooled a bit was the right consistency. next time will try making the glaze well ahead and just reheating lightly while sprouts are roasting.  The flavors are right so worth a few experiments to get this one downSeamusdallas12/26/2020Hands down my favorite Brussels sprouts recipe. They’re addictive with the perfect balance of flavors AnonymousAustin, TX12/15/2020This is the recipe to make a Brussels lover out of a Brussels hater. I have brought it to every Friendsgiving/Thanksgiving/Christmas the last couple of years and it always gets RAVE reviews, and requested again. I’ll never even think about making a different Brussels sprouts recipe because this one is so perfect. Thanks, Molly!AnonymousColumbus11/26/2020I brought this dish to a potluck full of meat eaters and it ended up being one of the first empty plates of the night. A friend of mine told me that this was the dish to make her love brussels sprouts, which was a big win :) The kick of vinegar + chile is a fantastic way to perk up what would otherwise be a pretty mellow vegetable dish, would happily make again!JessSt. John's, NL11/23/2020I've made this several times now, and it always delivers a punch of very well integrated flavors.  The sweet and sour glaze is perfect with the brussels sprouts.  I have added bacon to this recipe and it's always delicious.  Also, I've subbed maple syrup too, and it is terrific as well.  RoyCornelius, NC11/11/2020Explore Bon AppétitMediterraneanBrussels SproutVegetableFallQuickEasySideGluten-FreeNut-FreeVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Molly Baz"]}