{"id": "556ca11bfbe71541d7a1ce8ea6235575", "url": "https://www.bonappetit.com/story/root-baking-co-atlanta", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "I Hate Brunch, But I Love Root Baking Co. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Hate Brunch, But I Love Root Baking Co.This delightful new Atlanta cafe mills its own grains, and would never make me wait two hours for a mostly-orange-juice mimosa.By Hilary CadiganJuly 26, 2019FacebookTwitterEmailPhoto by Andrew Thomas LeeFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Here’s something about me: I hate brunch. The massive crowds, the two-hour waits, the too-large-groups squeezed into too-small-tables, the obligation to pay ridiculous sums for boring dishes I could easily make at home, the need to appear chipper when all I want is to be home in bed reading the New York Times Sunday Styles section with my cats. Terrible, all of it.You know what I do like, though? Really excellent morning meals, eaten alone. Which is why I’ve dubbed Root Baking Co. my new favorite not-brunch brunch spot in Atlanta.After three years running a small wholesale bakery in Charleston, Root owners Chris Wilkins and Nicole Lewis-Wilkins expanded last fall to a full eat-in cafe, now located inside Atlanta’s Ponce City Market. Here, there are no long lines, no gimmicky mimosa deals, no hungover undergrads loudly discussing last night’s conquests. Instead: high ceilings, giant windows streaming light, and nice big tables for those who choose to brunch in packs (I’ll be in the corner, not making eye contact; pretend you don’t see me).You can order at the counter instead of waiting for a stressed-out server to notice your presence. You can drink actually awesome coffee (from Three Heart Roastery, just down the street). You can choose from chef Matthew Palmerlee’s well-curated list of delicious breakfast-y items you definitely could not make at home: sorghum-glazed ham layered under melty cheddar and mustard greens on a hot croissant. Creamy labneh and strawberry jam on housemade grit bread (yes! Grits, but bread!). Cinnamon sugar-dusted morning rolls made from grains milled onsite. There are even—and I cannot overstate the importance of this fact—non-breakfast-y items that you can order at brunch, because who says you have to wait for the sun to reach its peak sky position before being permitted to eat a shawarma-spiced lamb sandwich with pickles, or a bread bowl of Moroccan chickpea stew with saffron broth? It’s enough to warm even the coldest brunch grinch’s heart.And you know what else? You don’t even have to sit down at all. You can order a freshly baked loaf made with Charleston gold rice and benne to go. You can bring home an entire bag full of morning rolls. You can eat them all, one by one, in your bed while you read the New York Times Sunday Styles section with your cats. You can have your brunch and eat it too—and never even call it brunch.Go there: Root Baking Co.Explore Bon AppétitHighly RecommendBrunchRestaurantsAtlantaRead MorerestaurantsTFW One of Your Favorite Chefs Takes Over One of Your Favorite KitchensBy Hilary CadiganrestaurantsAtlanta Doesn’t Need New York Water to Make a Really Freaking Good BagelBy Elyse InaminecultureI Thought My NYC Summers Would Be Sad and Peachless, Until…By Hilary CadiganrestaurantsAn Adult-Sized Hangover Calls for the XL Breakfast Sandwich at Philly’s Hungry PigeonBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-26", "author": ["Condé Nast", "Hilary Cadigan"]}