{"id": "557b9d5f486c8cb9e751200da58093a4", "url": "https://www.bonappetit.com/recipe/cranberry-sauce-with-orange-and-cinnamon", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Cranberry Sauce with Orange and Cinnamon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCranberry Sauce with Orange and CinnamonBy Claire SaffitzOctober 16, 20214.6(51)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintCranberries divide Thanksgiving diners into two clear camps: Those who prefer a chunky compote and those who like a sliceable condiment that jiggles. This cranberry-orange sauce is for the first group. Bright citrus and warming cinnamon are the complements cranberries look for this time of the year, and navel oranges conveniently come into season just in time for the holiday. First blanching the citrus in boiling water removes any bitterness from the peel and pith. Once you’ve added the cranberries to the pan, don’t stray far from the stove. They scorch easily and thicken quickly because they contain a lot of natural pectin, a key ingredient used in jam-making.Editor’s note: This recipe was originally published October 16, 2018.IngredientsMakes about 2½ cups1medium navel orange, seeds removed, chopped1lb. fresh (or frozen) cranberries1cup sugar2Tbsp. unsalted butter13\"-long cinnamon stick½tsp. ground allspicePinch of kosher saltPreparationStep 1Place orange in a large saucepan and pour in cold water to come 1\" up sides of pan. Bring to a boil, then remove immediately from heat and drain orange in a mesh sieve or colander. Rinse under cold water; return to saucepan. Add cranberries, sugar, butter, cinnamon, allspice, and salt and bring to a boil, stirring to dissolve sugar.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Cook, stirring often and reducing heat as needed to avoid scorching, until cranberries burst, juices are syrupy, and pan is visible when a wooden spoon is dragged across the bottom, 12–15 minutes. Let cool.Step 3Do Ahead: Sauce can be made 1 week ahead. Cover and chill.How would you rate Cranberry Sauce with Orange and Cinnamon?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleThis is the BEST cranberry sauce! I’ve made it three times now and it’s always a hit. However, you could add slightly less sugar or add a little orange juice if you prefer a more tart cranberry sauce. CatherineSan Francisco 11/25/2021So, this is my first time making homemade cranberry sauce. I had NO idea you had to keep the peel on the orange? I wish the directions were a little more specific. Anyway, I made it without the peel and I kind of think its better? So many of the reviewers complained that the oranges didn't break down very well and were awkward to eat so I'm not experiencing that problem. I added some zest from the peel right at the end and let that cook for like, a minute and it really brightened and livened up the flavor. So, happy accident? Sure. AdriannaRhode Island11/22/2021I’ve never preboiled the orange - I just chop it up and add to the cranberries and sugar in the pot. Substitute cardamom for the cinnamon - you won’t be sorry. CarswellCanada11/7/2021Our family favorite! Love that it can be made 1 week ahead.AnonymousCalifornia10/24/2021It was very delicious! Kevin San Diego, California 11/27/2020I am making this recipe for the past 10 years, I found it in an old Bon Apetit magazine. It is simply the best!Anonymous11/17/2020This recipe should be more specific about the size of orange pieces. I did \"chop\" size pieces and they did not break down. Had to remove them and run through an emersion blender before adding back in.Anonymous10/10/2020This was so simple and it has so much flavor! I used really ripe local oranges for mine and I didn’t get any bitterness from the rinds after boiling. I added about 1/2 a teaspoon of salt  instead of a pinch. I chose this recipe over the 2019 cranberry sauce, because I didn’t want to deal with a food meal and bunt pan and I am so glad I did!! TarathenotsoprofeasionalchefMaui Hi 11/28/2019There is one CUP of sugar in this, how are other reviewers even possibly calling this bitter??? I made this for Thanksgiving 2018, it was delicious and I'll definitely make it again. If you have elderly family, I'd definitely recommend chopping up the orange into tiny pieces/removing as much of the flesh from the tougher parts as you can. Some of the orange pieces just don't break down and are harder to chew.Thomas_1/30/2019Orange can cause bitterness just cut it with salt a little bit at a time...it’ll smooth outJus76512/24/2018Well, boiling the orange did not remove the bitterness at all. I think if there is a next time I will just use Mandarin orange slices. The bitterness must have squashed to sweetness, so I did some doctoring up with just a little more sugar, a bit of vanilla extract.AnonymousFlorida11/22/2018This may become a family tradition. Bright, not too sweet and the butter gives it a gloss (similar to jam). Should be clearer re: the orange - chopped fine or rough and did not follow at first this basically called for blanching. I added micro grated orange rind and 3 capfuls cold pressed OJ, as I didn’t think the orange pieces would be enough for the amount of cranberries. Also, I used 2 pounds cranberries rather than 1. Overall, excellent flavor and highly recommend. Monica FisherLos Angeles11/22/2018Delicious! The orange with peel on turns out very good.Ketchikan Alaska11/21/2018For those that find the recipe confusing:\n1) chop up the oranges (leave peel on) and bring them to a boil \n2) once oranges come to a boil, remove oranges from heat. strain and rinse with cold water \n3) In the same saucepan combine all ingredients INCLUDING oranges and NO LIQUIDS are added..\n4)to reiterate: in the saucepan you only include: oranges that were boiled, cranberries, butter, sugar, cinnamon stick, allspice, and pinch of salt. NO LIQUIDS. once berries and oranges start to warm up it'll provide enough liquid to make the sauce. \n5) let that come together, stirring constantly on low heat\n6) as minutes pass you'll notice the sauce becoming thicker as the berries burst and sugar dissolves\n7) once the 12-15 minutes pass, you may choose to discard the oranges since the peels are still on\n\np.s. I have also attempted this recipe peeling the oranges and skipping the entire boiling process and just combining all the ingredients together and it came out just as delicious as the original recipe.Anonymous11/20/2018Also confused......i assume you leave the peel on the orange?JackyePa11/20/2018Explore Bon AppétitCondimentCompoteFruit DessertDessertAmericanCranberryBerryFruitOrangeCitrusCinnamonHerbs & SpicesSideGluten-FreeNut-FreeVegetarianSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}