{"id": "557d6dd9059c53fcb31d92c3276991e3", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-4", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "The 'Healthyish' Podcast Episode 4: The Best Things We're Cooking This Summer, With Chris Morocco and Amiel Stanek | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Things We’re Cooking This Summer, With Chris Morocco and Amiel StanekThis week’s episode of the Healthyish podcast is all about simple summer recipes.By Bon AppétitJuly 8, 2021FacebookTwitterEmailFacebookTwitterEmailWhat makes a simple summer meal? This week on the Healthyish podcast, Amanda Shapiro brings in test kitchen director Chris Morocco and BA contributing editor Amiel Stanek to talk about what “simple” means to them, how they’re really cooking right now, and whether a dip can be a meal. Also on the menu: the “Short is Sweet (And Savory!)” recipe collection in the June/July issue of the magazine and online, which is loaded with easy dinner ideas like a punchy Vietnamese Tomato Salad, Chicken Seekh Kabobs, and a sweet dessert dip (yes, we said dessert dip).ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episodeShort Is Sweet (And Savory)!DIY Sour MixChicken Seekh KebabsChintan Pandya on InstagramTuk Trey Ping Poh With Pork ChopsKreung Cambodia on InstagramVietnamese Tomato SaladHa’s Dac Biet on InstagramStracciatella Fruit DipKitty’s MarketAmiel Stanek on InstagramChris Morocco on InstagramHow to ListenListen to this episode through the audio player on this page, or subscribe via Apple Podcasts, Spotify, or wherever you get your podcasts to get all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitPodcastsCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-08", "author": ["Condé Nast", "Bon Appétit"]}