{"id": "559f680dc9e7cf5a7827391fd0fc4dc4", "url": "https://www.bonappetit.com/story/wisconsin-cheese-curds-decatur-dairy", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "The Wisconsin Cheese Curds That Heal My Homesickness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Wisconsin Cheese Curds That Heal My HomesicknessCheese curds have a way of doing that.By Erika OwenMarch 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWithin a week after moving into a closet-sized room in Brooklyn miles away from the Midwest, a care package from my parents arrived. Inside was the one thing that had the power to stop my homesickness in its tracks: cheese curds. These particular curds came from a modern, green-roofed barn outside of Brodhead, Wisconsin called Decatur Dairy, a necessary stop on Owen family day trips for as long as I can remember.Let’s get one thing straight: I’m not the first to bow down to Decatur’s cows. The Muenster has taken 1st place at the World Champion Cheese Contest — which the Dill Havarti has also placed in, FYI— and their Pepper Havarti brings locals and tourists in from all over the country.My family’s perfect day kicks off with an hour-long drive to the Decatur barn, a spot you could easily miss if you weren’t looking, but isn’t that most of the rural Midwest? Come on a warm day and you’ll be greeted by the cows grazing in the field next to the gravel parking lot. Inside, a handful of apron-clad cheese experts answer questions and provide recommendations in thick Wisconsin accents.Instagram contentThis content can also be viewed on the site it originates from.The shop is cramped, the kind of place where you need to carve out somewhere to wait while your order is prepared. Shelves are lined with funny little souvenirs you’ll only find in small-town Wisconsin: “Cow Pie” candy, Wisconsin pride T-shirts, the occasional Green Bay Packer memorabilia. My advice: beeline for the cheese curd cooler to your left, proudly boasting “Curd is the Word” (my personal motto).The curd flavor variety is impressive: BBQ Mesquite, Buffalo, Cheddar, French Onion, Horseradish Bacon, Hot Salsa, Muenster, Jalapeño, White Garlic and Herb, Tomato Bacon Basil, White Bleu Cheese, Green Olive, and Ranch. Everyone knows a good curd squeaks as you eat it, but don’t forget about flavor: too much and you can only handle one or two. Decatur Dairy’s curds come with a quick punch of flavor that blends perfectly into the creamy interior; just enough to reel you in. It’s near impossible to eat less than five. What sold me were the jalapeño curds, a strong flavor that has the potential to go oh-so wrong. Instead, they’re a savory treat with a hint of spice that doesn’t overwhelm your tastebuds.Wisconsin Master Cheesemaker Steve Stettler, center, and two employees mix the cheese curds at Decatur Dairy.\nPhoto by Anthony WahlCome hungry—very hungry—because the only thing better than the cheese curds are the $3 grilled cheese sandwiches they sling hot off of the grill next to the curd cooler. My summer is never complete without a Pickleicious, their award-winning Havarti with pickles and “special sauce” (a recipe I’d group close to spicy mayo) on sourdough. It’s the kind of melty mess that mixes cheesy, salty, and a touch of sweet so well. Months later, you’ll wake up from a dead sleep craving it.You can buy Decatur cheeses by the pound (as well as online), along with specialty mustards and deli meats they have behind the counter, as well. If you're looking for inspiration, my go-to is always the same: one bag of jalapeño curds, a bag of cheddar curds, a solid block of Havarti Horseradish cheese, and a bit of Smoked Butterkäse.Once we pack the car with our cheese bounty, we’re off to the nearest brewery, usually Minhas or New Glarus, to beer-flight it up until we inevitably pull out a bag of curds to snack on. If the weather is nice, we’ll linger at New Glarus, where picnic tables overlook fields of farmland and a single country highway. This simple scene, to me, is my family at its best. And the cheese curds are a delicious, completely necessary, part of the equation.Photo by Alex LauBuy 12 oz. of Decatur cheese curds for $5.20 here (but one bag won't be enough...)Explore Bon AppétitCheeseWisconsinRead MorecultureA Definitive Ranking of Cheddar Cheese CrackersBy Alyse Whitneyrecipes35 Cheesy Appetizers That Are Cheesier Than Your Uncle’s JokesGallery35 SlidesBy Bon AppétitcultureButterkäse: The Best Cheese You’ve Never TriedBy Posie HarwoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-05", "author": ["Condé Nast", "Erika Owen"]}