{"id": "55a015b0842d068bbd3c996086956cc2", "url": "https://www.bonappetit.com/story/how-to-cook-fish-without-stinking-up-your-kitchen", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "How to Cook Fish (Without Stinking Up Your Kitchen or Splattering Oil Everywhere) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Fish (Without Stinking Up Your Kitchen or Splattering Oil Everywhere)No shade to a crispy-skinned salmon fillet, but once you learn how to cook fish in the oven you may never go back.By Molly BazJuly 30, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Rhoda BooneFacebookTwitterEmailI get it: Learning how to cook fish is a daunting undertaking. Fish can be easy to overcook, tends to be pricier than other protein options at the grocery store, and has a nasty way of making your kitchen (or whole house if you're not careful) smell like, well, fish. As a result, fish recipes can be a bit of a hard sell, and a lot of our readers seem to pass them up in favor of dishes that seem more forgiving or user-friendly. Which is a shame, because there's a whole world of easy, clean, low-risk fish cookery out there to be explored. And I want you to start exploring it right now.I live in an apartment in Brooklyn, which means I have a teensy-tiny kitchen that has one small window to the outside world for ventilation. (Somehow, in a truly baffling feat of interior design, it's actually mostly blocked by my countertop, so I'd really consider it a half window.) You know what that means? I’m almost never cooking a piece of fish on the stovetop, over high heat, in a pan with spattering oil. I don’t have the luxury of a hood system, or any form of cross ventilation for that matter. My bedroom abuts the kitchen, and I’m sure as heck NOT trying to fall asleep with the scent of crispy fish skin fish on my pillow. (Although I may dream of eating it).But that doesn’t stop me from regularly cooking and eating fish in my apartment. I just take a different approach—one that’s known around these parts as the low-and-slow method. And once you learn how to cook fish this way, it's pretty hard to go back. Here's the basic method. Preheat your oven to 300°. Place one large, seasoned piece of fish—flaky, white-fleshed varieties like cod, halibut, hake, sea bass or cod work best here, but salmon works great too—in a baking dish or skillet. Drizzle the fish generously with olive oil, and add any number of optional flavoring agents (sliced citrus, herbs, fresh chiles, thinly sliced fennel, smashed garlic, etc.). Transfer it to the oven and bake. It’s ready when the flesh in the thickest part of the fish begins to flake away with just the slightest bit of pressure from the back of a spoon, and it has just turned from translucent to opaque. The \"slow\" part of low-and-slow is actually a bit of a misnomer here—a 1½-lb. piece of halibut could be ready in as little as 15 minutes, depending on how thick it is. And the result? A juicy, delicately-flaky piece of perfectly-cooked seafood.Slow-Roasted Cod with Belle Peppers and Capers, anyone?\nPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiHere's why it works. Cooking fish at a low temperature reduces the risk of overcooking it by leaving you with more wiggle room with regards to cooking time. An extra 2-3 minutes at high heat on the stove top could be the difference between a perfectly cooked piece of fish and one that is tough, mealy, and grossly overdone. But at lower temperatures, that ideal window of doneness widens significantly, giving you the time to calmly and repeatedly check for doneness. Best of all? The whole thing happens hands-off and inside the oven—your insurance policy against a stove covered in splattering oil and the possibility of fish skin-scented nightmares. Less mess, less smell, and less of a chance that your spendy piece of fish gets overcooked. See where I'm coming from?So take it from someone who’s just as wary of the stank as you are, cooking fish at home can be a quicker and easier dinner play than you probably thought. Your weeknight recipe repertoire is about to expand tenfold. So let’s raise a glass to the beloved low-and-slow—and I’ll see you at the dinner table.Try this recipe on for size:Foolproof Fish With Spiced ChickpeasJust about the most approachable at-home fish cooking method there is.View RecipeExplore Bon AppétitBasicallyFishtechniqueHaddockCodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-26", "author": ["Condé Nast", "Molly Baz"]}