{"id": "55a3613f25a44b9bdb1cbb0abfbad8ea", "url": "https://www.bonappetit.com/story/easiest-blackberry-icebox-cake-ever", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Icebox Cake Is Easy—This Blackberry Icebox Cake Is Even Easier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is Our Chillest Icebox Cake EVERBecause it’s just blackberries, jam, Nilla Wafers, and whipped cream. And it looks like a snowy mountain.By Alex BeggsJune 12, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailWhen it’s hot enough that I’m inspired to shave my legs again, I start making icebox cakes—and I don’t stop until the radiator clinks and clangs back to life. And this new recipe, a blackberry icebox cake with Nilla wafers and you-don’t-need-to-know-anything-else, is by far our easiest one yet. Of all people, I should know: I’ve made every Bon Appétit icebox cake, some multiple times. (I’m a dedicated student of the form.) And while they’re all pretty simple, I swear that I could make this one in my sleep.Let’s get one thing out of the way first: Contrary to popular belief, icebox cake is not a frozen dessert. It never goes in the freezer, despite the “ice” in the name. Instead it gets refrigerated for a few hours. (Seriously though: When was the last time people called the fridge an “icebox” anyway? I’m going to go with 1869. It’s been a while. But maybe, if we make and eat enough of this cake, we’ll bring it back.)The fridge is the key to icebox cake success; that’s where the action happens while you go to the beach or take a nap outside or get a sunburn or otherwise live your life. Instead of dealing with any kind of dough, or putting something in the oven, or stirring a curd on the stove, you simply assemble and chill it. And it’s fun! A layer of cookies, a layer of fruit and jam, a layer of whipped cream, and then you do that over and over until you’ve run out of stuff. And in those anticipatory overnight hours, all of the layers soften and bleed together to create a divine mousse-like cake. Again: FUN!If you are the kind of person who makes their own jam, well, use it!\nPhoto by Alex Lau, food styling by Rebecca JurkevichAs always, creative genius (and senior food editor) Claire Saffitz has managed to improve on the form. Instead of assembling the thing in a loaf pan or freeform on a plate, you build this icebox cake inside of a Cling Wrap-lined mixing bowl, which not only produces a freestanding icebox cake that looks cool as hell, but also makes it much easier to transport to someone else’s house. When it’s good and chilled, all you have to do is flip it onto a platter, peel the clingy business off, and cover it with a final swipe of whipped cream and some more berries. It looks like something that would appear on Marie Antoinette’s dessert buffet. (If this isn’t the aesthetic you’re going for when making a cake, are you even living?)Instagram contentThis content can also be viewed on the site it originates from.I made it recently to inaugurate grilling season, and since strawberries were looking good at the market, I used those and plenty of Tiptree’s strawberry jam—a new addition to my icebox lineup after reading this persuasive piece about it. Another tweak I made: Because I don’t plan ahead very well, I assembled the cake 9 hours before serving instead of 24. The result was that the Nilla wafers weren’t fully mushified under all that cream, and they retained just a bit of their soft cookie chew. My dinner guests all said that they really dug the “textural contrast” 🙄. The next morning, after the full 24 hours, the semi-crunchy cake was completely transformed into the familiar, uniformly-silky mess I crave all summer. It’s hard to say if one version is better than the other; neither deserve the guillotine, that’s for sure.So clear out all the excess mustard from your fridge, buy the first box of Nilla Wafers you’ve had in a long time, and on a day so hot you dread the sight of pants, make your friends an icebox cake.Get the recipe:Blackberry Icebox CakeThe no-bake dessert you'll be making all summer.View RecipeExplore Bon AppétitWhipped CreamSummer DessertsBlackberryBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Alex Beggs"]}