{"id": "55a445b0ddcb41925127ae99e6ccc9d9", "url": "https://www.bonappetit.com/story/sourdough-starter-crackers", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Sourdough Discard Crackers Are the Absolute Easiest Thing to Make With Excess Sourdough Starter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingYou Can Stop Googling \"Sourdough Discard Projects\" NowBecause you've found the absolute easiest one.By Rebecca FirkserApril 30, 2020FacebookTwitterEmailPhoto and Food Styling by Rebecca FirkserFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.If you’ve been regularly baking sourdough bread—or have only thought about baking bread but still find yourself in possession of a starter you’re trying to maintain—you have a lot of starter discard. For the uninitiated: Every time you feed (that is, mix fresh flour and water into) a sourdough starter, you must first remove about half of the existing mixture. And when you have more than you know what to do with, it’s tempting to shovel it into the garbage (or compost bin).But starter discard isn’t only perfectly safe to cook and bake with, it’s also tasty, adding a subtle tang to muffins, cinnamon rolls, and scallion pancakes. While you can theoretically use it in any recipe that calls for flour and water by making a couple of adjustments, I usually just keep things simple: I make sourdough discard crackers. The dough takes five minutes to put together, and the crackers are easy to store. Just as good with a wedge of sharp cheese as they are with a yogurt dip or hummus, I haven’t bought packaged crackers since I started making them. Crispy, tangy, and not-too-sour, the flavor is somewhere in between a pita chip and a Cheez-It.Here’s how it goes: Heat the oven to 350° F. In a medium bowl, use your fingers to whisk together a fat pinch of kosher salt and about 1 cup flour. I like to use a mixture of whole wheat and all-purpose, but whatever you have on hand will work. I’ve even made them with half chickpea or buckwheat flour.Pour in about 1 cup sourdough starter discard and about ¼ cup olive oil and combine until the dough comes together. At first, it’ll be shaggy, but it will become increasingly taut. Knead a couple times to make sure everything is combined and the dough forms a smooth ball. Divide into thirds.Lay a piece of parchment paper on a work surface and roll out one ball of dough into as big and thin a sheet as you can without tearing it. Dimensions don't really matter here: as long as it’ll fit on a sheet pan, it’s perfect. Transfer the parchment to the pan, then brush the surface of the dough with a bit more olive oil. If you have more sheet pans, you can prepare all three cracker sheets at once, or you can bake in shifts.Now, toppings. Usually all I want is a shower of flaky salt, but anything goes. Za’atar, sumac, garlic powder, nutritional yeast. For slightly heavier seasonings, like fennel, cumin, poppy, or sesame seeds, or dried herbs, brush the surface of the dough with a beaten egg white instead of oil, then scatter the topping and press them in gently, or knead them directly into the dough before rolling it out. You can also go sweet—cinnamon and sugar is a delight. This is the time to experiment; there are no wrong answers (she says, as she eats a bite of a cracker topped with nooch and turbinado sugar, which tastes like when you mix a handful of cheese popcorn with caramel corn from those giant holiday tubs).Slide the tray into the oven and bake for 15–20 minutes, until the giant cracker is golden brown. Let it cool completely, then snap it into jagged pieces. Store the crackers in an airtight container at room temperature, and grab a couple every time you walk through the kitchen. Maintaining a sourdough starter can be maddening, and producing an intricately scored, crusty loaf of bread is a days-long, painstaking process. So even if you’d rather opt for purchasing sourdough made by an expert, hang onto that starter and you’ll never need to buy another box of crackers.Rebecca Firkser is a New York City-based freelance food writer and recipe developer.Explore Bon AppétitIt's That SimpleCrackerBasicallyRead MoreLifestyleThis Fresh Starter Takes the Stress Out of Baking SourdoughBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-30", "author": ["Condé Nast", "Rebecca Firkser"]}