{"id": "55a5b30d7c20e819a3879f7cb2bf7df4", "url": "https://www.bonappetit.com/story/ny-shuk-harissa", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Condiments Come and Go, But NY Shuk Harissa is Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingCondiments Come and Go, But NY Shuk Harissa is ForeverBA's entire test kitchen is obsessed with NY Shuk harissa. Here's why.By Molly BazJanuary 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.If you were to open my refrigerator at any given moment, you’d find four or five types of mustard, an outlandish number of pickle jars, and about six varieties of chili-garlic condiments like sambal oelek, gojuchang, layu (a Japanese chili oil), and sriracha. All these condiments have a place at my table, but they come and go—I’m not wedded to any one style or brand.Then you’ll notice the jar of NY Shuk harissa paste. It’s the only condiment that has landed a permanent place on my refrigerator shelf. It’s the harissa paste to end all harissa pastes: Allow me to explain.Harissa is hot chili pepper paste made by soaking then blending a variety of dried chili peppers, garlic, and spices. It’s found in many North African cuisines and has more recently become popular in the modern American pantry. Unlike many other harissas, NY Shuk’s boasts a red pepper base that is concentrated, jammy, and slowly sun-ripened the way a red pepper should be. Other harissas I’ve tried tend have been looser, more like spicy, roasted red pepper relish than a thick, deeply flavored paste.NY Shuk makes both a Signature Harissa and a Preserved Lemon Harissa, and I’m partial to the latter. The somewhat unusual inclusion of preserved lemons in the paste lends a brightness and acidity to the earthy flavors. It’s only moderately spicy, which allows you to deploy this magical condiment liberally. And that’s exactly what you should do. I slather it on slow roasted salmon, whisk it into vinaigrettes, toss it with roasted vegetables, stir it into yogurt, and smear it below soft boiled eggs.NY Shuk also offers jars of those pungent funky preserved lemons and an entire line of Middle Eastern spice blends.  They even sell a dried harissa spice for moments when a paste just won’t do the trick. But their Preserved Lemon Harissa is the product I love the most. At a price point of $15.95, it’s a bit more expensive than other harissa on the shelves, but trust me when I tell you that this is the harissa that your refrigerator should never be without.  Flavor like this is worth splurging for again and again.Buy NY Shuk Preserved Lemon Harissa, $15.95Now, use that harissa on some chicken thighs.One-Skillet Crispy Chicken Thighs with HarissaStarting the chicken skin side down in a cold skillet lets the fat render slowly and results in the crispiest skin imaginable. It also yields a pan of flavorful schmaltz, aka liquid gold.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanHarissaShoppingRead MorecookingThese Crispy Chicken Thighs Are the Healthy Comfort Food You DeserveBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Molly Baz"]}