{"id": "55a60d57335789de012f508ee01bb7e2", "url": "https://www.bonappetit.com/story/use-up-buttermilk", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Want to Use Up Buttermilk? Drink It! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Best Way to Use Up ButtermilkAll you need is a tall glass. By Priya KrishnaJanuary 8, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailGrowing up in Texas, I was trained to think that buttermilk was for fried chicken, biscuits, and ranch dressing. My dad, on the other hand, was always telling me to drink it.He’d reminisce about his childhood in India when, to cool off during the humid, sticky summers, he’d drink buttermilk seasoned with green chiles, ginger, and a little salt, called chaach. It was common to have buttermilk in the fridge back then—his family made butter from scratch (the store-bought stuff wasn’t as widely available in smaller cities), and buttermilk is the whey leftover from that process. In a climate as scorching as India’s, he’d tell me, there was nothing more refreshing than downing a cold glass of buttermilk. It was thick and creamy and cooled your body from the inside out.But I ignored my dad’s advice. I had enough dairy products crowding my fridge! Milk for my chai, yogurt for snacking. Did I really need buttermilk, too? And then, about a year ago, I moved in with my partner, who really, really loves to bake, and, uh, has a penchant for buying ingredients without checking to see if we already have them. Very quickly, our fridge became littered with half-filled bottles of various brands of buttermilk. We had no room left. Something needed to be done.On one particularly hot New York day, I thought back to my dad’s childhood stories, poured myself a glass of buttermilk, and pinched in a little salt and pepper. To my surprise, it had all the best parts of yogurt and Gatorade—filling, energizing, a little acidic in a pleasant way. It satisfied my salt craving, and kept hunger pangs at bay all afternoon. I started drinking a glass of buttermilk with my morning toast or oatmeal—sometimes seasoned with salt and pepper, sometimes just plain. It felt less weird than drinking a glass of milk (I mean, what am I, a toddler?!), and kept me fuller longer than when I ate a bowl of yogurt. Even when the weather turned cooler, I kept drinking buttermilk. I noticed that whenever I didn’t have it, my stomach would start rumbling half an hour into my morning meetings. My A.M. toast yearned for something creamy to wash it down.Now I buy my own buttermilk, whether or not a bottle magically appears in the fridge after a weekend baking session. I splurge on the good stuff, which is thick and creamy, with a pucker-y tang (If you shake the bottle and it feels thin and watery, skip it!). Kate’s buttermilk is far and away my favorite. It’s never crazy expensive, but it feels like a luxurious purchase since it’s not on my usual list of grocery staples. And because buttermilk lasts for a very long time in your fridge, there’s no race to finish it—just, in my case, a race against shelf space. I’ve also gotten a lot more creative with my add-ons. If I have leftover herbs, I’ll chop those up and throw them in the glass. Maybe a squirt of date syrup if I want some sweetness. Smooshed raspberries for texture.The best part of buttermilk, though, has nothing to do with its taste or nutritive qualities. Because it’s a little thick, it’s not one of those drinks you can just down and then race out the door. You’re forced to sip it slowly, and take a moment of peace, even if it’s just a short one, before you start your day.Now if only I could clear out the six varieties of bread flour taking up all that cabinet space.Explore Bon AppétitHealthyishButtermilkShoppingRead MoreLifestyleFor the Love of All That is Dairy, Why Are We Still Eating Low-Fat?By Mari UyeharaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-08", "author": ["Condé Nast", "Priya Krishna"]}