{"id": "55be9a5e83f43f46bfe542685a30e2ad", "url": "https://www.bonappetit.com/story/alida-malushi-balkan-bites", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "For Alida Malushi, a Former Journalist From Kosovo and Founder of Balkan Bites, These Buttery, Flaky Pastries Are a Portal Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor One Journalist-Turned-Pastry Chef, These Buttery, Flaky Pastries Are a Portal HomeDecades after fleeing political unrest in her home country of Kosovo, Alida Malushi and her niece are bringing ready-to-bake burek to American kitchens with their new company, Balkan Bites.By Ali FrancisJune 29, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Pastry chef Alida Malushi moved to New Jersey 30 years ago, but if she closes her eyes and pictures the wood-burning stove in her family’s house in Kosovo, where she grew up, she can still smell the buttery, golden burek coils her grandmother made every Sunday. “My strongest memories are of her elegant, thinly stretched phyllo dough and seasonal ingredients like stinging nettle peeking out from inside,” she says. “It was the ultimate comfort food.”Malushi and I are chatting in a Google doc (she’s hard of hearing these days, so phone calls can be difficult) but her love of food and home rises off the screen like steam as she tells me about Balkan Bites, the frozen burek company she launched here in the U.S. with her niece, Ariana Tolka, in 2019. Their flaky, portable pastries come stuffed with a variety of ingredients—like beef laced with caramelized onions; fluffy potato; and sweet Nutella (a flavor that makes my inner child squeal)—and are traditionally enjoyed at any time of day. “The dough recipe and most of the recipes for the fillings have been passed down from my grandmother, to my mother, to me, and now to my niece,” says Malushi. “I love them all, but my favorite to this day is spinach and cheese.”Malushi is ethnically Albanian, but was born and raised in Peja, Kosovo (which, by 1963, when she was seven years old, had become an autonomous, majority Albanian province in the Socialist Federal Republic of Yugoslavia). She recalls a peaceful childhood with people of many backgrounds and religions living together in relative harmony. Though, at that time, Malushi paid no mind to political tensions anyhow—nor did she foresee the conflict that was brewing in the region. “I just wanted to play with my friends and run around outside,” she says. Her father had died suddenly of a heart attack when she was just two years old, and at that time it was customary for a widowed wife to live with her husband’s family. “So my mother, my two siblings, my grandparents, and my aunt and uncle all lived together in one house, with my grandmother doing most of the cooking,” Malushi explains. “Food was something to be enjoyed.”Magbule Malushi with her children Alida (left), Eduard (middle), and Shqipe (right) in Peja, Kosovo.\nPhotograph courtesy of Alida MalushiFrom her grandmother’s garden, Malushi harvested fresh tomatoes, cucumbers, peppers, spring onions, garlic, spinach, and lettuce—and picked apricots, pears, peaches, quince, and mulberries right from the trees. “Can you imagine that beauty? And to think we lived in a small city,” she says now. Buzzwords like organic and gluten-free and antioxidants didn’t exist in her grandmother’s vernacular. “She just followed nature and the seasons. Recipes were given without cooking times and measurements. You learned by doing and nothing was rushed; slow food was a way of life.”After the death of President Josip Broz Tito in May, 1980, tensions mounted in Yugoslavia that would result in its eventual breakup. By the early ’90s, Malushi had graduated with a degree in literature and was working as a reporter in the city of Pristina. She watched as nationalism took hold. “[Ethnic] groups start talking against each other and protesting, which proved to be deadly for its former citizens who lived side by side peacefully for many decades,” she says. “Neighbors turned to enemies and you never knew who was listening and would report you to the government as a dissident.”By 1989, Albanians living in the once again Serbian province of Kosovo began protesting for the return of their constitutional autonomy, which had since been stripped by Serbian President Slobodan Milosevic—a longtime opposer of Muslim Albanians’ demographic control of the area. When Milosevic’s military forced Malushi’s Albanian-run TV station to shutter in 1991—a way for Serbian authorities to “further censor” the media, says Malushi—she decided to move to America, where she joined her sister and brother (Tolka’s father), who were both living in New Jersey. New in the U.S., out of work, recently married, and pregnant, Malushi found her new career in the pages of Gourmet magazine with an ad for the French Culinary Institute in Manhattan. She applied to become a professional pastry chef, was accepted, and graduated in 1995—going on to work at various hotels and restaurants before opening her own bakery, Iris, in River Edge, New Jersey in 2002.But two years later, her mother, who had also since relocated to the U.S., fell ill, so Malushi closed Iris to care for her until she passed in 2017. It was then that Malushi's niece, 28 years old and working on brand partnerships at Charity Water, approached her about learning to cook the traditional Albanian foods her aunt and father had eaten as children in Kosovo. “She [Magbule, Malushi’s mother] was the matriarch of our family,” says Tolka, “and I wanted to find a way to preserve her recipes.” Malushi hadn’t cooked professionally in over a decade when the two began spending their Sundays together making baklava, ćevapi, and, of course, burek. “After we made the burek, I was like, ‘Ah, I forgot how good this is!’” Tolka says. “We realized there was really none like my aunt’s on the market.”A few family tastings later and, during a frosty winter in 2019, the pair decided to start selling their burek under the name Balkan Bites. Tolka managed the business, branding, and marketing, and Malushi developed recipes and oversaw production. They debuted their fresh pastries at local markets in New York City—from the Columbus Circle Holiday Market to the Queens Night Market—where the hot, stuffed phyllo swirls delighted passersby and became an instant hit.Despite the deep historical divisions in former Yugoslavia—and plenty of attempts, according to Malushi, to nationalize cuisines after its various former territories split in the ’90s—food remained a connective tissue across the Balkan diaspora. “People continued sharing their memories and family recipes through cooking websites, TV shows, and books—telling stories of how people once lived together and shared a common life,” Malushi explains, citing the popular Balkan adage “Make burek not war.” “When we had our outdoor pop-up events in New York, it was beautiful to see people come together from different countries that were previously at war, talking together and bonding over their shared love of burek.”In early 2020, Tolka and Malushi had plans to expand into wholesale by selling burek to restaurants and coffee shops. “Little did we know they were about to close for months due to the COVID-19 lockdowns and outdoor pop-up markets wouldn’t resume for the rest of the year,” Malushi says. “We felt helpless and didn’t know what to do next.” Then came requests from loyal customers for shipments, and they decided to launch an online store, which turned into their biggest sales channel.My first taste of Balkan Bites came from a four-pack of spinach and cheese burek I scarfed down on a cold, rainy, gray day in April. I dropped one of the frozen, naked-looking disks on a parchment-lined tray and sent it into a hot oven before going about my business. Suddenly my kitchen was filled with the smell of Malushi’s childhood memories—buttery pastry crisping up; cheese softening to a molten, aromatic paste. The phyllo was unimaginably flaky on the outside and warm and stretchy inside, each bite oozing with spinach-flecked ricotta and tangy feta. It’s crazy to think the burek I was eating in my upstate New York apartment was virtually identical to the ones Malushi ate 60 years ago in Kosovo.I asked Malushi why, after years of hard work, she continues to roll out enough dough—hand-stretched so thin “you can see the table underneath,” as she puts it—for 1,500 bureks every week. “It’s a popular saying that an immigrant’s refrigerator assimilates last,” she replied. “Preserving something that was done for hundreds of years is important; it’s a way of remembering our past while moving forward and building our future in a new place.”Shop Burek:Frozen Spinach and Cheese Burek, 4-Pack$19 at Balkan BitesExplore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-29", "author": ["Condé Nast", "Ali Francis"]}