{"id": "55c779f041f0217e531123fce3ae6463", "url": "https://www.bonappetit.com/story/baseball-helmet-nachos", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "My Favorite American Pastime Is a Baseball Helmet Full of Nachos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Favorite American Pastime Is a Baseball Helmet Full of NachosThe tray is not enough! The perfect serving size of nachos is in helmet form, and I will accept no arguments on this.By Alex BeggsOctober 7, 2019FacebookTwitterEmailPhoto by Kate FenoglioFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m squeezing this story into the tail-end of baseball season, the playoffs. I’m rooting for the Astros, because my Tigers didn’t make it happen this year. But my real MLB MVP is a Baseball Helmet Full of Nachos, which you can find at nearly every baseball stadium. I’m not a Yankees fan, but I am a big fan of their stadium’s helmet of hot cheese, pictured above. Comerica Park gets it done too. And this spring, I encountered fresh jalapeños, instead of pickled, at Citi Field. Wow!No matter what is happening in the game (grown men swinging bats), or in the stands (grown men pushing children out of the way to snatch foul balls), nachos give everything a happy Cheez Whiz glow. Unlike cold, soggy fries, or overcooked, dry sausages, there’s little room for disappointment here. The helmet, which you can bring home and plant some succulents in or whatever, ensures that you get a ridiculous but sufficient amount of chips, and plus, they’re just festive to behold.“But the normal tray of nachos is enough,” you might be thinking, or, “I need to save room for a hot dog and some Dippin’ Dots and three beers,” or “I can’t really be spending $20 on nachos right now, Beggs.” But I believe you can, and should. The tray is not enough! Especially to share!The helmet nachos are pretty much the same at every stadium, but there’s an art to ordering. Here’s how I do it: Skip the mystery meat. It’s never good, and it gives me the runs (baseball pun!). Ask kindly for the nacho artist to weave in layers of cheese and pickled jalapeños ONLY, then kindly ask for extra jalapeños on top. That’s it. A thing of beauty, of cheese and heat and crunch and salt. Share with people you love. Root, root, root for the home team. If they don’t win, it’s fine because you had a helmet full of nachos.Go there: Yankee StadiumExplore Bon AppétitHighly RecommendNachosRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Alex Beggs"]}