{"id": "55d79f4661e4503916500d4101b57ed5", "url": "https://www.bonappetit.com/recipe/udon-in-buttery-tomato-and-soy-broth", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Udon in Buttery Tomato and Soy Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueUdon in Buttery Tomato and Soy BrothBy Andy BaraghaniFebruary 9, 20213.7(61)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintIn this hybrid soup, which borrows elements of Vietnamese, Chinese, and Japanese soups, Andy Baraghani simmers whole cinnamon and star anise in the tomato broth to add a light sweetness, while finely ground black pepper gives it some heat. (Any black pepper works, but we prefer this one from Diaspora Co.; it’s fruity and just a little spicy.) You may be surprised at how quickly this broth builds flavor, with massive depth from golden onions, tomatoes, soy sauce, and just a tiny bit of butter for a silky finish.Ingredients4 servings2large beefsteak tomatoes, halved crosswise, seeds removed¼cup vegetable oil2large onions, very thinly sliced4garlic cloves, thinly sliced11\" piece ginger, peeled, finely grated1½tsp. freshly ground black pepper2whole star anise13\" cinnamon stickKosher salt27-oz. packages instant udon noodles, flavor packets discarded3Tbsp. low-sodium soy sauce3Tbsp. unsalted butterToasted sesame oil (for serving)4scallions, thinly sliced½cup coarsely chopped cilantro leaves with tender stemsPreparationStep 1Starting at cut end, grate tomatoes on the largest holes of a box grater into a medium bowl until all that’s left is the flattened tomato skins; discard skins. Set grated tomato aside.Step 2Heat vegetable oil in a medium pot over medium. Cook onions, stirring occasionally, until starting to soften, 5–7 minutes. Add garlic and cook, stirring often, until onions are very soft and evenly golden, about 5 minutes. Add ginger and pepper and cook until fragrant, about 20 seconds. Add grated tomato and cook, stirring, until thickened, about 3 minutes. Add star anise, cinnamon stick, and 5 cups water; season with salt. Bring to a simmer over medium-high, then reduce heat to medium-low and simmer gently until flavors come together, 8–10 minutes.Step 3Meanwhile, cook udon according to package directions. Drain and set aside.Step 4Add soy sauce and butter to broth and stir until butter is melted. Fish out star anise and cinnamon stick and discard. Season with more salt if needed.Step 5Divide noodles among bowls; ladle broth over. Add a few drops of sesame oil; scatter scallions and cilantro on top.How would you rate Udon in Buttery Tomato and Soy Broth?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThis recipe was so close to being good. The idea was there, but it felt like a first try, not something that had been through multiple tests before publishing. After making it as written the first time, I tweaked it the second time to add a LOT more depth. I used ghee instead of butter, and to replace half the veg oil, used at least 2-3 times the ginger, added fish sauce, golden mountain (thai seasoning) sauce, five spice powder, 2 dried thai chilis, toasted all the spices, and like most people below, caramelized the onions. Also used canned tomatoes which was extremely helpful. Added 2T of rice vinegar in the last 5 min of cooking, and then finished with lime, fresh sambal, and some fried garlic since it still needed more umami and tart freshness to pick it up and balance it out. The second time through, it was a great meal, but it needed an awful lot of work to get there, and still could have been improved upon.AnonymousChicago, IL10/13/2021I didn’t have many of the ingredients but it came out to be delicious I toasted turmeric pepper flakes and cinnamon and caramelized the onions for quite a while. I used a can 14 ounces of Roma tomatoes just chopped. Not having udon I used potato gnocchi and just the noodles from Ramen broken up. Fresh basil instead of cilantro. Otherwise the same and it was very flavorful.MaryClemson sc10/3/2021After reading the mediocre reviews, I amped up the flavor and was determined to make the recipe better. I used 3 onions and caramelized them low and slow until chocolate brown. I used about 10 garlic cloves and triple the amount of ginger. I didn’t grate the tomatoes but pulsed them with an immersion blender. When I added the tomatoes in, I also added cumin seed, 5 spice, coriander, ground cumin/ginger/onion/garlic, let it bloom and then added the stock along with 2 cinnamon sticks, 4 anise star, peppercorns, bay leaves. I let it simmer for about an hour and adjusted as needed. I added 4 tablespoons of soy sauce, but only because I used more stock than the recipe called for. Thin sliced shiitakes, gojuchang (sp) and Filipino coconut vinegar were added in the last 10 mins of simmering. I topped it with sesame oil, chilli oil, scallions, cilantro, squeeze of lime and some pickled radishes and picked garlic that I made. The result was really delicious, but let’s be honest, what I did wasn’t necessarily the recipe, hence the 3 stars. Sonjachardé Chicago, IL9/17/2021I'm not a review-leaving kind of person, but this recipe has haunted me since I made it several months ago. The broth has absolutely no depth. I don't know how on earth it made it past testing because I followed the recipe to the letter and it came out absolutely inedible. Maybe find a recipe for one of the Vietnamese, Chinese, or Japanese soups that this borrowed from instead.AnonymousOrange, California9/6/2021This is a fantastic base for steamed, flaked cod. I love tomato based fish soups and I'll add this to my collection!~AnonymousAlbuquerque, New Mexico9/5/2021This was great!AnnieNYC8/26/2021Loved this. Like the other revieweres I also added a beef stock cube and fish sauce, and used the egg noodles I had in my cupboard. Flavour was gorgeous and I'll definitely be cooking again. EllaLondon, UK7/20/2021This was amazing! I used beef broth instead of water. I will be keeping this recipe on repeat.L. MirmesdaghWI4/15/2021I've found that this is fantastic with a few tweaks. I cut the vegetable oil in half, add a couple dashes of fish sauce, throw in a bouillon cube with the water (this is key, IMO - everything is better with broth instead of water), and use fresh udon. Everything else remains as is. Especially the butter, which gives this a much-needed mouthfeel. AnonymousPortland, OR3/23/2021This was delicious and quite moreish, even when I’ve skipped a few steps and made an even faster/lazier version without the cinnamon and star anise. I did miss the star anise though!AnonymousBris, Australia 3/21/2021Mediocre at bestkjkVermont3/19/2021the taste was fine but we did not enjoy the overall texture with the sliced onions. Cecile3/15/2021This  one was surprisingly flavourless, we were pretty disappointed. AdrienneHamilton, ON3/14/2021This was solid. Everyone agreed the broth was surpisingly good for how quickly dinner came together. I threw in some tofu and radish to make it a little more filling. A solid 4/5.LessThanNothing3/8/2021I've never left a review before, and I usually love Andy Baraghani's recipes, but this was an utter failure and I wanted to warn other people off the recipe. Despite following it to a T, the broth lacked any kind of depth. I think if the onions were caramelized down for a significantly longer time, and if some heat were included, and maybe some fish sauce or something were in there, it might become \"meh\". Also the broth wasn't really brothy - between the onions and tomatoes there wasn't a lot of liquid at the end so our dinner looked nothing whatsoever like the photo. CMcGOakland, CA3/3/2021Explore Bon AppétitSoupSoups and StewsUdon NoodleNoodlePasta & NoodlesTomatoVegetableQuickEasyWeeknight MealsMainVegetarianSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-04", "author": ["Condé Nast", "Andy Baraghani"]}