{"id": "55f0e04b8b38c6017318908d3b57523f", "url": "https://www.bonappetit.com/story/marinated-zucchini-recipe", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "This Marinated Zucchini Recipe Is Changing the Way I Make All Vegetables | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Marinated Zucchini Recipe Is Changing the Way I Make All VegetablesLemony ricotta. Marinated veg. Crunchy hazelnuts. It’s how I want to eat everything now.By Alyse WhitneyJune 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailWhen it comes to summer produce, zucchini never gets much love. I admit I was part of the problem...until I tried this marinated zucchini with hazelnuts and ricotta recipe. If all summer squash were seared, tossed in a zippy vinaigrette, and served with a swoosh of lemony ricotta, I could be a zucchini lover for life.This recipe stopped me in my tracks when I flipped through Bon Appétit’s June/July issue because it was stunning. Zucchini and summer squash all caramelized and glistening with a slight sheen of olive oil like they'd spent a day tanning on the beach, nestled in a cozy bed of ricotta with a sprinkle of crushed hazelnuts. I knew I had to have it. As someone who loves zucchini at all times of year—like Ina Garten’s zucchini pancakes and the easiest pasta with basil—it was a no-brainer, but I never could’ve predicted that it would become my new go-to method for cooking all vegetables this summer.The process is simple. First halve zucchini and summer squash, salt them, and let the water drain. Try to get medium-sized squash; larger ones have more water and seeds and will take longer to dry. This process also seasons them from within! Then sear them as if you were making a steak until deeply caramelized on the cut side, cover the pan, and let them steam for about 15 minutes until tender. All of this can happen while you toast blanched hazelnuts (important so they don’t have papery skins on them!) and make a super simple vinaigrette.I doubled the recipe—changed to 4 Tbsp. oil, 4 Tbsp. white wine vinegar, 2 cloves grated garlic,  1-½tsp. sugar, 1 tsp. crushed red pepper flakes, and a few sprigs of mint that you’ll remove later—and I'm glad I did. After searing the zucchini, I cut them into 2” pieces and tossed them with the vinaigrette. I hadn’t even added the cheese yet and I was ready to eat a whole bowl of summer squash. But once I mixed lemon zest with ricotta and dipped a piece of zucchini in, my world changed. The ricotta was insanely creamy but not too rich; the squash was caramelized yet tender and could be cut with a fork; and the hazelnuts added a little crunch and salt to round things out. It was like the Captain Planet of dishes: With their powers combined, this dish could save the world. I had to hold myself back from eating it all so I could plate it up and serve it to friends.Cauliflower steaks would also take well to this method of marinating and serving on top of ricotta.\nThe recipe calls for bread for dipping, but I forgot, and it was still satisfying enough to be a great starter salad for dinner; with bread, I could have easily made it into a vegetarian main. The next day, I ate the leftover ricotta and dressing on some steamed broccoli. I tossed the broccoli with the dressing, put it on top of ricotta, and finished it off with olive oil, lemon juice, and crushed hazelnuts. It was the best time I've ever had with broccoli. Now that I am intimately familiar with this new quick method for making all vegetables taste good, I am going to apply it to cauliflower steaks, crispy sweet potatoes, grilled asparagus, charred cabbage, and caramelized carrots next. Sure, I still don’t looooove salad, but I will gladly eat vegetables for every meal as long as ricotta and this vinaigrette are there to party.But you could start with zucchini and summer squash:Marinated Zucchini with Hazelnuts and RicottaZucchini is anything but boring when bathed in a kicky vinaigrette.View RecipeExplore Bon AppétitMarinadeRicottaZucchiniSummer SquashHealthyishRead MorecookingYou Can Carve Ina Garten's Zucchini Pancakes Recipe Onto My TombstoneBy Alyse Whitneycooking11 Big Batch Recipes to Make with Your Farmers' Market HaulBy Alyse WhitneytechniquesThe Summer Pasta We Can't Stop MakingBy Alyse WhitneycookingZucchini Noodles Don't Have to Taste Like DeprivationBy Sue LiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Alyse Whitney"]}