{"id": "55f7094f63a5237f9988a86771f96e27", "url": "https://www.bonappetit.com/story/depanneur-le-pick-up", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "I Still Regret Not Ordering This Halloumi Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Still Regret Not Ordering This Halloumi SandwichThis perfectly balanced (and, surprise, vegetarian!) sandwich from Dépanneur Le Pick-Up in Montreal haunts me.By Bryan FountainDecember 2, 2019FacebookTwitterEmailPhoto by Veronique SoucyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The best thing about Montreal—besides that it’s bilingual and has universal health care—is that it has an endless supply of memorable sandwiches, like the salami-and-bologna-stacked Wilensky Special at Wilensky’s Light Lunch and the smoked meat sandwich at Lester’s Deli. But the one that I can’t stop thinking about is the grilled halloumi sandwich at Dépanneur Le Pick-Up, which I tasted on my last trip to Montreal.A dépanneur is what we call a bodega in New York City, typically stocked with pantry staples and beer. Le Pick-Up turns the concept on its head: It is part-diner, part-convenience store, part-coffee shop, the list goes on. They have local Québécois beer and kombucha, and Club Mate from Germany (my favorite), best accompanied by the spicy, crispy home fries that made me shed tears of joy. While I got the Club Chipotle sandwich, a triple-decker of chicken, bacon, lettuce, tomato, and chipotle mayo—classic and well executed—the sandwich I’m calling out here is the halloumi one, and I didn’t even order it!My vegetarian partner did—God bless her—and I had a bite, expecting to be fully underwhelmed. Then I had five more bites. The sandwich was transcendent. Let me break it down for you. First things first, the seeded bread comes toasted (smart!) to support all the fillings. Then, there’s a layer of fatty, tangy halloumi, griddled and golden. On top of that is a generous pile of zingy, mint-laced slaw that perfectly cuts through the meaty cheese and provides much needed crunch. Finally, slathered on both sides of the bread, there’s a harissa-honey mayo situation. This addition gives a sweet, spicy, creamy, smoky finish. There are so many working parts, and each is doing its thing to make this sandwich totally flawless.As you can tell, Le Pick-Up was the highlight of my trip. And since then, my longing for this sandwich in particular has not subsided. But one thing’s for certain: I will be back!Go there: Dépanneur Le Pick-UpExplore Bon AppétitHighly RecommendMontrealRestaurantsSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-27", "author": ["Condé Nast", "Bryan Fountain"]}