{"id": "55f8a8508905fbc189db5562d1c9e0b1", "url": "https://www.bonappetit.com/story/savory-plum-salad", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "This Plum Recipe Is So Savory, So Sweet, and So Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is Just to Say This Plum Salad Is So Savory, So Sweet, and So GoodIt even inspires bad poetry.By Rachel KartenAugust 8, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneFacebookTwitterEmailI Ate Six Plums in 15 Minutes: A Memoir of a Salad.“SIX?!” my colleagues yelled out in unison. I had just told them how many plums I ate for dinner the night before. And in retrospect, it did seem a little excessive. But they had never made Chris Morocco’s Plum Salad with Black Pepper and Parmesan.This new recipe is so simple you could Tweet it: Add a few shakes of red wine vinegar, a squeeze of honey, and a crack of fresh pepper to a bowl. Throw in six ripe summer plums—thin slices and wedges. Add shards of salty Parm. Transfer everything to a new bowl. Add MORE Parm. Drizzle with olive oil. Top with salt and pepper.And I still have three characters to spare! But what happens to those plums is some Dumbledore-style wizardry. Suddenly a one-note piece of fruit is as complex as a Saturday crossword puzzle. Every taste bud texting this emoji “🚨” to your brain with the slap of Parm, zing of red wine vinegar, and the sweet rush of summer fruit.Instagram contentThis content can also be viewed on the site it originates from.It was gone within 15 minutes, the serving size was four.To learn more about why I ended up with six plum pits staring up at me, I talked to the mastermind behind it all, Chris Morocco. “What makes the fruit go from something you eat standing over the sink to something that feels like it belongs on the dinner table is that balance.” Morocco tells me. “When you add acid and salt, you open up the range of flavors in the fruit.” This also explains why plums pair so well with salty cuts of meat, like in this pork chop recipe from Claire Saffitz. Suddenly it all clicked. The vinegar, oil, cheese, and salt all play off each other, taming the sweetness that would normally inhibit someone from consuming, say, six plums. (Dive into more savory fruit salad recipes here.)I’ll try not to do it again. Eat all the servings, that is. I will arm myself with a salty main (pork chops!), a few friends (text me!) and the knowledge I learned when I Googled “Can you eat too many plums?” (Reddit is fun!). But if I come across some ready-to-burst plums at the farmers’ market, and it’s a too-hot-to-turn-on-the-oven night? Well, no promises.Now get the recipe:Plum Salad with Black Pepper and ParmesanA savory fruit salad that holds its own at the dinner table.View RecipeExplore Bon AppétitPlumParmesanSummerFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-03", "author": ["Condé Nast", "Rachel Karten"]}