{"id": "55f9868a02ca641241d01fb2fa59707e", "url": "https://www.bonappetit.com/story/buttonwood-newton-massachusetts", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "The Restaurant That Replaced My Childhood Favorite Spot Is Now My Adult Favorite Spot, Buttonwood Newton | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Restaurant That Replaced My Childhood Favorite Spot Is Now My Adult Favorite SpotButtonwood is just one of the reasons why I keep coming back to Newton, Massachusetts.By Chris MoroccoJanuary 13, 2020FacebookTwitterEmailPhoto by Michael PiazzaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I have been going to the corner spot currently occupied by Buttonwood in Newton, Massachusetts, for most of my life. As a kid, I knew it as Cantin’ Abruzzi, a temple to red-sauce cooking with Dom (or was it his brother Mario?) singing in the kitchen and serving pasta mountains topped with saucy peaks. The short walk from my parents’ house felt like an odyssey, but no matter how much I complained during the trip, I am certain I never made a peep once we got there. That’s because I was too busy stuffing myself with chicken parm that hung over the edges of already huge plates, pastas with “gravy” that we never even came close to finishing, and golden chunks of chicken Scarpariello that still haunt me with its glorious combination of white wine, butter, and lemon.Here, my dad, the firstborn and loudest of four very loud boys, held court and made the rounds in the dining room, greeting friends like he owned the place. It was like his childhood home, three generations stacked in a Worcester triple-decker, all coming together for Sunday suppers and epic holiday feasts, with the volume and drama to match. I just watched and always ended my meal with chocolate mousse that came in an edible chocolate cup and topped with a single chocolate-coated espresso bean. It was heaven.But eventually Cantin’ Abruzzi closed as the neighborhood got more affluent and Mario (okay, it was definitely Mario) wanted to get out of the restaurant business. A series of restaurants came and went in the space as tastes evolved in Newton, until Buttonwood came and stayed, even after a devastating fire threatened to close the space for good.When my family went over the summer, it was my own kids’ turn to complain about the walk, along with my father who no longer gets around as easily as he did. At Buttonwood, he still gets treated like royalty, though, and seems to know everybody’s name, despite the fact that Buttonwood couldn’t be more different than Cantin’ Abruzzi. Where chianti once ruled, rosé is now on tap along with Partida Creus natural wines. Instead of peperoncino, chef David Punch showers Aleppo pepper over sticky ribs and serves pork schnitzel alongside a chunky “Israeli” salad and za’atar yogurt. Punch doesn’t overlook the simple stuff either. The fries are textbook crispy on the outside and creamy inside, while the griddled rich cornbread is elevated by Tabasco-spiked butter. It’s all so good, making Buttonwood somehow the perfect neighborhood restaurant in a neighborhood that has changed so much since I was a kid.The dining room feels fresh and tasteful without veering into stuffy fanciness, laid-back enough for a drink on the way home, but classy enough to be a special-occasion destination. The menu reflects how much food has evolved since the days of the Cantin’ Abruzzi, and how comfort food can pull from a global pantry.I don’t know how much longer my parents will be in their house or how many more times we will take that walk together. I don’t know if regulars realize the vibrant sambal all over the charred striped bass collar is made in-house, but I do know one thing: It’s more than just nostalgia that keeps me coming back to 51 Lincoln Street.Go there: ButtonwoodExplore Bon AppétitHighly RecommendRestaurantsMassachusettsRead MorerestaurantsThe Second I Land at Boston Logan Airport, I Head for Tawakal Halal CafeBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-13", "author": ["Condé Nast", "Chris Morocco"]}