{"id": "5627328f85b820c07f74d22775243401", "url": "https://www.bonappetit.com/recipe/chicken-cordon-bleu", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Chicken Cordon Bleu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueChicken Cordon BleuBy John Becker and Megan ScottFebruary 3, 20204.4(21)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis classic dish features chicken breasts stuffed with thin slices of ham and cheese that are then coated in breadcrumbs and pan-fried. To avoid tearing the meat, pound it with a glancing (diagonal) motion rather than straight down, working from the center of the breast to the edge. This recipe is from the latest edition of Joy of Cooking, our February 2020 Cookbook Club pick.Adapted and excerpted from Joy of Cooking by John Becker and Megan Scott. Copyright ©️ 2019. Reprinted by permission of Scribner, an imprint of Simon & Schuster, Inc.  Ingredients4 servings4skinless, boneless chicken breasts (about 1½ lb. total)Kosher salt, freshly ground pepper4thin slices ham or prosciutto (about 4 oz. total)4thin slices Gruyère or Swiss cheese (about 4 oz. total)¾cup dry breadcrumbs¼cup finely chopped parsley (from about ¼ bunch)1large egg½cup all-purpose flour3Tbsp. neutral oil (such as grapeseed or vegetable)PreparationStep 1Place a rack in middle of oven; preheat to 375°. Trim any fat around edges of chicken. Working one at a time, place chicken between sheets of parchment paper and pound with a mallet or rolling pin until about ¼\" thick. Season chicken all over with salt and pepper.Step 2Arrange chicken smooth side down on a work surface. Cover one half of each breast with one slice of ham and one slice of cheese, leaving space around the edges. Fold breast in half over ham and cheese and press edges together to firmly seal.Step 3Combine breadcrumbs, parsley, 1 tsp. salt, and ½ tsp. pepper in a shallow bowl. Whisk egg and 1 Tbsp. water in another shallow bowl. Spread flour on a plate.Step 4Press both sides of chicken in flour, shaking off any excess, then dip both sides into egg mixture. Coat all over with breadcrumb mixture, patting with your fingers to adhere. Transfer to a plate.Step 5Heat oil in a large heavy skillet over medium-high until shimmering. Cook chicken, turning occasionally, until browned on all sides, 2–3 minutes per side. Transfer to a wire rack set in a rimmed baking sheet; season with salt. Bake chicken until an instant-read thermometer inserted into the thickest part registers 165°, about 5 minutes.How would you rate Chicken Cordon Bleu?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI think it's ok for this to be a bit messy, more of a rustic cordon bleu.  Delicious!brushjlsolon, ohio1/30/2021Delicious! Fixing for 2nd time tomorrow!  Natalie Hurdle WierzbaNOLA living in LA, CA1/28/2021I add broccoli\nJulieIllinois12/15/2020One of my favourite chicken recipes. Great taste, especially the meaty cheesy over the salty prosciutto. This dish received many compliments when I made it for the family, it’s a staple now.AnonymousVictoria, Australia 8/22/2020I normally don’t make anything other than asian food, but this was pretty good. I couldn’t get the chicken to fold together on the edges so the cheese came out. Perhaps I needed practice on using the mallet. Although it had cheese all over the sides, it tasted great. I would definitely try it again. ByeOhio, US6/3/2020Ultimately very tasty and pretty quick to make. Getting the chicken to stay together and not let the ham/cheese slip out of the sides is the hardest part. A little patience and it comes together nicely. danimalcrackersChicago4/27/2020Delicious! Simpler take on a traditional cordon bleu. Served with broccoli & rice pilaf. Anonymous3/29/2020Fantastic, super simple and fast. I made it with a side of herbed and spiced sautéed zucchini and loved it.AnonymousColorado3/8/2020Explore Bon AppétitSwissEuropeanChicken BreastChickenPoultryHamMeatProsciuttoGruyèreCheeseSwiss CheeseMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-03", "author": ["Condé Nast", "John Becker", "Megan Scott"]}