{"id": "562ce54f756d4889b011e117026984e0", "url": "https://www.bonappetit.com/recipe/breakfast-blondies", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Breakfast Blondies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBreakfast BlondiesBy Anna StockwellMarch 12, 20194.4(65)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintForget breakfast bars or muffins: Our new favorite grab-and-go breakfast is a blondie. Think of them like a healthyish muffin in bar form. Made with almond butter and flaxseed meal, they’re grain-free and packed full of protein.IngredientsMakes 166Tbsp. unsalted butter, plus more for pan1cup chopped nuts, such as walnuts, hazelnuts, and/or pecans¾cup creamy unsweetened almond butter½cup pure maple syrup2Tbsp. flaxseed meal2tsp. vanilla extract1tsp. kosher salt½tsp. baking powder3large eggsPreparationStep 1Preheat oven to 350°. Line an 8x8\" baking dish with a sheet of parchment paper, leaving an overhang on two sides. Grease parchment with butter.Step 2Cook nuts and 6 Tbsp. butter in a medium skillet over medium heat, swirling pan often, until butter foams, then browns, 5–6 minutes. Strain through a fine-mesh sieve into a large bowl; set aside nuts. Add almond butter, maple syrup, flaxseed, vanilla, salt, and baking powder to hot brown butter and whisk until smooth. Add eggs one at a time, whisking to incorporate after each addition. Vigorously whisk batter until glossy and smooth, about 1 minute. Stir in all but about 3 Tbsp. reserved nuts. Scrape batter into prepared pan and spread in an even layer. Top with remaining nuts.Step 3Bake blondies until top is puffed and lightly browned and a tester inserted into the center comes out with a few moist crumbs attached, 18–22 minutes. Let cool.Step 4Remove blondies from pan using parchment overhang. Cut into squares.Step 5Do Ahead: Blondies can be baked 3 days ahead. Store tightly wrapped in plastic at room temperature.How would you rate Breakfast Blondies?Leave a ReviewTell us what you thinkReviews (51)Back to TopTriangleI'm eating one as I type this review! Whoa, these are delicious! Granted, I had to modify slightly based on what I had on hand (PB for almond butter, coconut flour for flax seeds) - but they came out fluffy and perfect baked for 20 minutes in a 9x9 aluminum pan. Also added cinnamon & cardamom for a warm, spicy flavor. This recipe is a keeper.PrilAsheville, NC1/7/2022Just amazing, had them with vanilla yogurt and a fruit salad. The perfect snack. My partner couldn't even tell that they were gluten-free.\nSome changes I made: I browned the butter separately from the nuts, and heated up the nuts in the leftover butter in the pan. I also cook the flax seed before I ground them, so I used cooked flax seed. I used peanut butter instead of almond butter I don't really think it makes a difference.\n\nI would just suggest to keep an eye after 20 minutes of baking to insure the perfect browning. I also believe flour is not necessary, the brownies were fluffy without it.\n\nOverall a great recipe, thanks to the creator!JuliGermany1/18/2021Made these this afternoon-- not too sweet at all. Very nut buttery flavored. Yeah I could eat these at breakfast. On the \"fudgier\" side. Added about 1/2 tsp of cinnamon, maybe I'll add more next time. Did a mix of almonds, pecans, and walnuts. Done after 20 minutes. AnonymousHouston, TX12/25/2020I followed the ingredients list exactly. However, I took the advice of one reviewer and partially browned the butter first before adding the nuts—1/2 cup hazelnuts and 1/2 cup pecans which I chopped in the Cuisinart.  Also, did not drain them in a sieve. Just stirred up all the ingredients at once in a mixing bowl.  It came together quickly and baked perfectly in 30 minutes.  Sent some  home with my daughter who is restricting her gluten intake. We compared notes after breakfast today and both declared delicious!  My husband loved his with whipped cream cheese. Barbara P. Pasadena, CA12/2/2020I have not made this yet, but ALWAYS looking for gluten-free on the go breakfast recipes, and this looks PERFECT to eat in the car on my way to work.  Is there a way to make it dairy-free as well - maybe coconut oil?  I have a double whammy with gluten & dairy.  Also would appreciate a replacement for the flaxmeal - can't have flax either. Would almond flour work in place of flaxseed meal?  Thank you!AnonymousDelaware10/12/2020I have made this a few times during the shelter in place. The first time I followed the recipe as written. The were good, but dense. The second time I added a cup of flour, which caused them to rise a little more. The last few times I’ve made them, I add a cup of flour and bake them in muffin tins- this is my preferred way to make these now. Delicious!AnonymousCalifornia5/12/2020can flax seed eggs be replaced for the regular eggs to make it vegan? (I also have an egg allergy)Vanessa jaquesAustralia(but live in China)5/4/2020I was bored last night and (Quarantine!) ran across this recipe; I had about everything but made a few substitutions based on what I had in the house:  Cashews, Peanut Butter, Bourbon Maple Syrup. I decided to add about a teaspoon of cinnamon to the mix. They are great! I think this recipe is pretty forgiving and easy to experiment with different flavoring ideas. I used a glass pan and baked for about 25 minutes. Anonymous4/28/2020Fantastic! Have made these twice and they are perfection. Both times I used pecans and almonds because that's what I had on hand. The second time (today!) I ran out of maple syrup so used some honey too. Still tasted great. Mine baked in 17 minutes. Yummy for breakfast or snack. I'm about to go get a second piece to go with the rest of my cup of coffee. Make this; you won't regret it.funfoodinfloridaUSA4/7/2020Made these like a dozen times, so 5 stars for sure. One note - for me, it always takes 30 minutes. May be because of my pan type (glass). Make sure you do a tester.SrAsparagusOakland, CA4/3/2020I've made these 5 or 6 times and we just love them. I thought I'd share my experiences though. Every time I've tried to brown the butter with the nuts in the pan, the nuts start to burn before the butter has browned. I found that if I wait to add the nuts until the butter gets close to browning, it works out MUCH better. The other thing is that I started just buttering the bottom of my baker and forgoing the parchment paper. I just cut the blondies like I would brownies, and that works out just great. Thanks for a great breakfast treat!Cle Elum , WA3/4/2020These were delicious and easy. I will be making them again. I love that they're gluten-free and other grain free as well. \nI just wish you would post some nutritional information for calculating within my app!\n Thank you.gabriellaPhiladelphia, PA3/1/2020I'll respond again once I actually make these but the amount of people upset about the lack of flour clearly didn't read that this says GRAIN-FREE and doesn't say anything about flour. Even saw a comment about the article stating something about \"almond flour\"...it clearly says almond butter. Yeah.AnonymousSeattle, Washington1/27/2020This is a fabulous recipe, I am gluten free and could not believe the texture of the bars my girls brought some in to there chemistry teacher with a copy of the recipe (she too is gluten free) and could not believe it.  I made these twice, either time I did not add nuts to the butter but did brown the butter loved the flavor, first time did add maple extract and raisins loved it, second time did not add the maple extract but did a variety of different nuts flavor is better with the extract.  first day is great second day the butter fell to the bottom of the bars and they were a bit greasy thinking about adding less butter next time.  My kids loved them, took them for lunch.  \nGreat recipe!!!!   Gloucester, MA1/27/2020I accidentally used honey as the sweetener and it was a great swap. I also used 1/4 cup cashew butter and 1/2 cup peanut butter based on what I had handy. I baked for 20 minutes, then 5 more based on the top still looking raw, but I think it's just the appearance because it felt set after 25 minutes. Mine was much paler in comparison to these pictures, but pretty tasty for a healthyish snack or dessert! I am surprised there is no note about letting it cool before adding the eggs- after mixing in the first one I swear I could see a few tiny specks of cooked egg white. C BatesSeattle 1/26/2020Explore Bon AppétitCookieDessertBar CookieWalnutNutHazelnutPecanFlaxseed MealFlourSnackGluten-FreeVegetarianHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Anna Stockwell"]}