{"id": "562fe9d306247b18ca78c2dd7fc9f59f", "url": "https://www.bonappetit.com/story/too-many-lines", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Too Many Lines, Not Enough Tacos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleToo Many Lines, Not Enough TacosA dispatch from SXSW by Healthyish editor Amanda Shapiro.By Amanda ShapiroMarch 14, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Hi from Austin, where I am here waiting in lines! Everyone says SXSW is the worst time to come to Austin, and I believe it, but even as one of 80,000 interlopers, I’m having a great time. Yesterday afternoon, I talked about why we’re so obsessed with wellness alongside Kirby Bumpus of Sweetgreen and Mo Clancy of Five Suns Foods. Then Bon Appétit hosted a pizza party at The Carpenter Hotel, where no one was obsessed with wellness (though the pizza was vegetarian...and very good).What I’m EatingI’ve been in Austin for 48 hours and I haven’t eaten a taco yet. This is a huge problem that I will remedy by adding “taco break” into my SXSW calendar. [Update: I’ve eaten two tacos since writing this draft.] Instead I’ve eaten a chopped salad at Carpenters Hall, the aforementioned pizza, a nice plate of cauliflower at Cafe No Sé, and various snacks and bars while waiting in lines. The best bar? Big Spoon Roasters’ cherry pecan, by a mile. It’s all about that salty-sweet.New! Healthyish! Recipes!Did you think kale chips were over? I have news for you: They still got it. Also: BREAKFAST BLONDIES. And while I have your attention, can we talk about steaming some more? Sweet potatoes aside, it’s also my favorite way to cook non-smelly, never-dry, done-in-ten-minutes fish, and Christina Chaey’s new recipe is so simple and good; you don’t even need a steamer basket.Kale chips are back.\nIn Other Healthyish NewsRachel Sugar intrepidly spends the day at a wellness coworking space trying to figure out what “wellness coworking” even means. “Does your office need a gong room?” she asks, and I’ve been asking myself the same question ever since. Yoga teacher, podcaster, and writer Kathryn Budig is sick of people commenting about what she eats. Deanna Pai dives into the facial massage technique that beauty vloggers and Instagrammers are obsessing about.Who I’m FollowingSam Jay, who is a very funny comedian.This weekend, once I’m back in New York, I’m itching to make the Healthyish squash parm and the braised short ribs from BA’s March issue. Gotta get ‘em before winter is gone!Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleVacation Doesn't Have to Be All About the FoodBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-14", "author": ["Condé Nast", "Amanda Shapiro"]}