{"id": "56450c92e6a403930115977b251370c6", "url": "https://www.bonappetit.com/recipe/caramelized-cabbage", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Caramelized Cabbage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFall-Apart Caramelized CabbageBy Andy BaraghaniFebruary 3, 20204.6(219)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThis is one of the easiest, most delicious ways to cook down a whole head of cabbage until it's falling-apart tender. If the spiced tomato paste has reduced and the pan starts getting dry and dark before the cabbage is ready, just add a splash of water to loosen and let it keep going.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSmall Bowl$13 At Amazon8-Inch Chef's Knife$47 At AmazonIngredients4 servings¼cup double-concentrated tomato paste3garlic cloves, finely grated1½tsp. ground coriander1½tsp. ground cumin1tsp. crushed red pepper flakes1medium head of green or savoy cabbage (about 2 lb. total)½cup extra-virgin olive oil, dividedKosher salt3Tbsp. chopped dill, parsley, or cilantroFull-fat Greek yogurt or sour cream (for serving)PreparationStep 1Preheat oven to 350°. Mix tomato paste, garlic, coriander, cumin, and red pepper flakes in a small bowl.Step 2Cut cabbage in half through core. Cut each half through core into 4 wedges.Step 3Heat ¼ cup oil in a large cast-iron skillet over medium-high. Working in batches if needed, add cabbage to pan cut side down and season with salt. Cook, turning occasionally, until lightly charred, about 4 minutes per side. Transfer cabbage to a plate.Step 4Pour remaining ¼ cup oil into skillet. Add spiced tomato paste and cook over medium heat, stirring frequently, until tomato paste begins to split and slightly darken, 2–3 minutes. Pour in enough water to come halfway up sides of pan (about 1½ cups), season with salt, and bring to a simmer. Nestle cabbage wedges back into skillet (they should have shrunk while browning; a bit of overlap is okay). Transfer cabbage to oven and bake, uncovered and turning wedges halfway through, until very tender, liquid is mostly evaporated, and cabbage is caramelized around the edges, 40–50 minutes.Step 5Scatter dill over cabbage. Serve with yogurt alongside.How would you rate Fall-Apart Caramelized Cabbage?Leave a ReviewTell us what you thinkReviews (89)Back to TopTrianglewhere is the recipe? These guys don't know how to run a web site. every time i look at a recipe they want me to pay again. spent 3 separate time 20mins plus to try to get it fixed. Dumping this mag. not even that good anymore. 20 year plus subscriber.ken kasznelpittsburgh3/11/2022This was a very easy way to make a boring green cabbage delicious. I found that the wedges held together better if I left the core attached, in fact the core was edible after the long braise. I followed the recipe and found the spices just right. I will definitely make it again and may try some add-ins such as onions.\nNothing boring about this!Moosegirl2/8/2022Very nice way to eat cabbage. So flaverful. Yoghourt and dill are a must!\nFabienneAsheville, NC12/10/2021I used a dutch oven instead of a cast-iron and it worked well, plus gave extra space for additional sauce.  I used a can of tomato sauce instead of paste and just reduced it a little bit.  This gave plenty of sauce to spoon over rice alongside.  I have never tried cabbage like this before and found it very enjoyable.  I may cut the cabbage into eighths next time.  RaindancerPortland, OR12/7/2021I have no idea what people are talking about with all the praise for this. I added slivered onions and paprika and 1.5 the spices ,I salted and seared the cabbage, I cooked the sauce down to the right level, I added the dill at the end and this was very boring. We love cabbage and especially braised cabbage in our house and this was just so so boring. It was only salvageable by letting it cool then cutting up the cabbage with kitchen shears and adding a TBS of chili powder to it and making shakshuka with it the next day.  Marcella Hazan and Ottolenghi both have much better cabbage recipes. AnonymousAnchorage, AK11/23/2021Excellent!!!! We doubled the paste and spices and used vegetable broth instead of water came out greatAnonymousWarwick, RI10/25/2021This was WILDLY good! I was browsing the recipes at BA a couple weeks ago and stumbled across this. The idea of this dish haunted me daily until I finally got the cabbage and settled in to make it. It was a hundred percent worth the effort. I love cabbage already and this really took it to the next level. I followed the recipe to a T this time, next time I think I'll cut the cabbage into eighths instead and also remove the core, which I think more closely resembles the photo attached to this recipe. Then as it cooks and softens the leaves should wilt into the sauce better. I can't wait to make it again!NoellePhoenix, AZ9/24/2021I was taught to never put tomatoes (paste or otherwise) into cast iron. Any truth to the acidity issue and iron? Hilda Oklahoma 9/19/2021I was excited to try this recipe, reading from the comments... It's easy, cheap, tastes ok, but nothing amazing. Ottolenghi has far better cabbage recipes, in my humble opinion.SebFrance7/6/2021Lovely recipe! Rich and satisfying. I cut down on the oil a bit. Have done it with a pound of ground pork with great results. Brown and reserve first and layer it below the cabbage.gypsybrewerSpokane, WA6/27/2021This recipe slaps, I've made it maybe 5 times now with NO regerts. The proportions can be modified easily, I suggest increasing the spices and the tomato paste - more sauce is more better. Why not caramelize chunks of onions and mushrooms while caramelizing the cabbage too? Serve this over mashed potatoes if you want to live your best life. Definitely don't sleep on the side of yogurt and fresh herbs while we're at it.SuzPittsburgh, PA5/13/2021Love it! One of my best cabbage side order. Was wondering if I could use cauliflower. \n\nFor a better result don’t cut your pieces too big. Did use green cabbogeRichardCanada5/11/2021This was so delicious! Next time I'll double the sauce - the best part! - and reduce the spice a little. ReneeVictoria4/22/2021Do this recipe twice and it is by far one of the best. So easy and you can adjust the spices as you wish. I am a fan of Korean recipe so I used Korean spices and spicy oil. \n\nThx RichardRichardCanada4/9/2021I've made this a few times and it's so good! My family likes it and it's a different spin on cabbage. Looking it up because I'm about to make it again!LaraCalifornia2/21/2021Explore Bon AppétitGreen CabbageCabbageLeafy GreensVegetableSavoy CabbageEasySideNut-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-03", "author": ["Condé Nast", "Andy Baraghani"]}