{"id": "565d86d8ccf89b63dcbba948c099e3d7", "url": "https://www.bonappetit.com/story/chloe-kim-churro-ice-cream-sandwiches", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "David Chang Congratulated Chloe Kim with Churro Ice Cream Sandwiches at the Winter Olympics 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDavid Chang Congratulated Chloe Kim with Churro Ice Cream Sandwiches at the Winter Olympics 2018Snowboarding fuel.By Melissa MintonFebruary 13, 2018FacebookTwitterEmailLoic Venance/AFP/Getty ImagesFacebookTwitterEmailOlympic snowboarder Chloe Kim may have just won the gold medal in the halfpipe competition in Pyeongchang, South Korea, at the 2018 Winter Olympics, but on social media, she's just like any other 17-year-old. While completely dominating in her events for Team USA, Chloe, like me, was thinking about food.Twitter contentThis content can also be viewed on the site it originates from.On Monday, Chloe tweeted about craving ice cream while literally in the middle of the women's halfpipe qualifications. \"Could be down for some ice cream rn,\" she wrote. A fan asked, \"Aren’t you competing right now?\" and she responded simply \"yes...\" Now, the Olympian is back at it again, this time tweeting about a breakfast sandwich. She wrote on Twitter mid-competition, \"Wish I finished my breakfast sandwich but my stubborn self decided not to and now I'm getting hangry.\" But despite her hanger, Chloe went on to become the youngest-ever gold medalist in the halfpipe event.According to an ESPN reporter, when asked why she was tweeting during the competition, Chloe said, \"Like, what else are you supposed to do?”Besides ice cream and breakfast sandwiches, Chloe tweeted about eating two churros over the weekend, which not only satisfied her sweet tooth but apparently also helped calm her nerves. Soon thereafter, Momofuku chef and NBC food and culture expert David Chang brought a batch of churro ice cream sandwiches—made with pizza dough from the Olympic cafeteria—to Kim to congratulate her.Instagram contentThis content can also be viewed on the site it originates from.The proof is in the ice cream: In 2016, Chloe became the first person under the age of 16 to win three gold medals at an X Games and the first woman to land back-to-back 1080 spins in a snowboarding competition. Not to mention the second person ever to receive a perfect, 100-point score. And we'd give her Twitter game a solid 💯.Explore Bon AppétitTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Melissa Minton"]}