{"id": "5661860ed0d6d56c1cce8bb1c9fcd6da", "url": "https://www.bonappetit.com/story/hunt-for-the-stinkiest-cheese", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "The Hunt for the Stinkiest Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Hunt for the Stinkiest Cheese, Or, How I Tested the Bonds of FriendshipI unleashed six extremely stinky cheeses in my apartment until my nostrils couldn’t take it anymore.By Molly FitzpatrickApril 26, 2018FacebookTwitterEmailIllustration by Elliot SnowmanFacebookTwitterEmailThere was no missing the smell, even in the hallway outside. “Whoa,” said more than one person as they stepped into my apartment, most clutching wine for the sake of courage as much as for pairing. I’d assembled these friends (maybe former friends, now) as human guinea pigs with one purpose: To find the very stinkiest cheese. Submitted for our approval were seven assertive, pungent, and occasionally quite freaky creations—provided by Murray’s Cheese and curated by Elizabeth Chubbuck, the Greenwich Village–based cheese purveyor’s senior vice president of sales and marketing and, as far as my nose is concerned, a diabolical dairy-wielding sadist. (A very nice sadist, but still.)It was one of the first warm days of spring, and a pair of oscillating fans somewhat counterproductively wafted the sinus-charring bouquet from room to room, like Miss Havisham thwacking you in the face with her long-rotten flowers. My normally mild-mannered dog lost her mind, yowling and dancing around the kitchen until someone, anyone, would give her even the smallest morsel of cheese. Oh god, she needs it, just give it to her.My table was laid out, for the most part, with six washed-rind cheeses, which are renowned among the stinkiest that the world has to offer. “You’re generally taking a soft ripened cheese and washing its rind in a solution that contains Brevibacterium linens,” explained Nora Weiser, executive director of the American Cheese Society. “It’s kind of disgusting, but it’s a bacteria that’s found on our bodies and in human sweat, so it gives it the cheese kind of a stinky foot smell.” Weiser assured me that a stinky cheese’s bark—well, its odor—is almost always worse than its bite. “The flavor tends to be generally much milder than the scent, especially if you’re tasting the paste, the interior, as opposed to the rind,” she said. “The way your nose recognizes the stink versus the way you recognize it on your palate when you’re eating it is very different.”The Farm TeamWe started slow, dipping a toe into the shallow end of the stinky-cheese pool. First up was Scharfe Maxx Extra, a sweet French-onion-soupy and Nosferatu-pale Alpine hard cheese with only the faint funk of a shirt you’ve worn twice without washing, which led me to wonder if I’d taken home a flagrantly unstinky specimen by mistake. Brie Fermier, the only bloomy-rind cheese (with a soft, fluffy mold on its surface) in the bunch, was entry-level stinky with a pleasant brininess and an unmistakable note of brussels sprouts in both its flavor and odor. Gooey spruce-bound Greensward smelled like musty Christmas but tasted like mushrooms, miso soup, and some kind of elegant, artisanal, and altogether delicious—hear me out—hot dog. It was an instant lock for my mouth’s all-time cheese hall of fame.The Major LeaguesAnd then came the Dorset, with which, hoo boy, we graduated with honors to the second circle of stinkiness. To some in attendance, the smell of this raw cow’s-milk cheese was the most objectionable they encountered all evening. The Dorset’s taste was deeply, delectably meaty, but the inescapable smell made me think of a long-abandoned, possibly haunted high school boys’ locker room—or at least, what I imagine a long-abandoned, possibly haunted high school boys’ locker room to smell like. My friend Gabrielle compared it to the pee-drenched alley next to a dive bar. My fiancé and his sister, the only two people in the room who were unfazed by the Dorset fumes, said it reminded them of the Cantonese salted fish they grew up eating.I guarantee you that, in this lifetime, I will never taste, or smell, anything like Torta del Casar again. This Merino sheep’s-milk cheese is from the Extremadura region of Spain and produced using the flower buds of the cardoon thistle. “Cardoon thistles have a very distinct flavor profile: It’s like green apple Jolly Ranchers and GT’s original flavor kombucha combined,” said Chubbuck. I actually liked the bright yet sweaty scent of the Torta del Casar: equal parts vaguely sweet dandruff, stale cheddar-cheese popcorn in a tin from last year’s holiday season, and sub-toenail crud of mysterious origin. I can’t say the same for the taste. Imagine a gamey dark chocolate cut with the chemical shiver of accidentally spraying perfume directly into one’s mouth. Overall, this cheese ranked last on our collective list of favorites to eat: If the Brie Fermier was the evening’s Miss Congeniality, then Torta del Casar was a rogue contestant hellbent on burning the whole pageant down.The funkmaster is present.\nPhoto by Alex LauThe World Series“Époisses is the quintessential funkmaster,” Chubbuck told me. According to legend, this famously stinky cheese was banned from public transportation in France. It certainly lived up to its internationally law-flaunting reputation. This unassuming disk delivers a strong Windex hit of ammonia, despite the fact that hiding beneath its rind is what tastes like an irresistible bacon pudding. One friend described the smell of Époisses as a sidewalk fish market without an awning, the sun burning down on it all afternoon.But in my estimation, the ultimate funkmaster—and there can only be one—is U Pecorinu, our ovine demon-king. When I first unwrapped this Corsican sheep’s-milk cheese, a round in a truly aggressive shade of orange, the smell of washed-up sea trash baking under a boardwalk launched me into a minor coughing fit. “I have a client who wants cheeses that smell like the chicken coop. That is the cheese that brings him the most joy. It is gnarly and funky but hard to come by,” Chubbuck said. It is also, like someone in my apartment less affectionately put it, “like eating somebody’s armpit.” My friend Susan—who, it should be noted, enjoyed eating this cheese so much she took it home with her—compared it to a hamster cage that’s long overdue for a cleaning. The actual taste was thoroughly barnyardy but approachable, balancing that ineffable chicken coopiness with a more familiar nutty quality.Even the meanest, most offensive-smelling cheeses can reveal untold wonders on the palate—they just require a little patience and an open mind. The Torta del Casar, which will haunt my tongue (if not my nose) in my dreams, found a fervent fan in my friend Brian, who explained that he couldn’t think of single reference point in his food memories that could even approximate those crazy-ass flavors. How often does anyone get to have that experience in their adult lives?Chubbuck’s advice for those new to stinky cheese: “Once you have decided that you’re going to try to learn how to enjoy something that is challenging for you, there’s this process of saying, ‘Okay, I know it has these intense aromas, but I also know that once I get over my initial reaction, it’s going to taste like French onion soup, and that’s an experience I want to have.’”Remember, don’t judge a book by its cover, even if that cover happens to smell like old socks, discovered by nostril-pinching archeologists, centuries later in a definitely haunted high school boys’ locker room.Read more: The 25 Most Important Cheeses in America, According to Cheese ExpertsExplore Bon AppétitCheeseCheese WeekRead MorecultureThe Science Behind Why We Love Stinky CheeseBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Molly Fitzpatrick"]}