{"id": "5667d27ba6e61d106d7feea516afa643", "url": "https://www.bonappetit.com/story/catching-coffees-31-wave", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Catching Coffee's 3.1 Wave | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredCatching Coffee's 3.1 WaveWorld Latte Art Champion Cabell Tice Talks Coffee Trends and Chobani Oat Barista BlendBy ChobaniDecember 13, 2019FacebookTwitterEmailFacebookTwitterEmailIf you’ve downed coffee, sipped a high-end creative cocktail, read a food publication, or simply existed in the U.S. in the past couple of years, you’ve probably seen the proliferation of oat-based drinks. The creamy alternative made from oats has grown 400 percent1 in popularity in the last four years and isn’t stopping anytime soon. But not all oat drink options are created equally.There’s a new kid on the block: Chobani Oat Barista Blend. This kid isn’t the kind to sit quietly in the corner and be overlooked, it’s the kind that deserves to be front and center of the classroom. Its versatility in hot and cold beverages, frothing capability, and taste are worthy of attention. We took it for a test drive and so did three-time world latte art champion and coffee expert Cabell Tice to see how it handles.A Taste Above the Rest“If a customer walked into a high end coffee shop five or 10 years ago and added milk or sugar to an expensive pour over, they might have been chided by a barista,” Tice says. “The coffee world was focused on telling customers how to drink their coffee,” he adds. That’s no longer the case. Today, coffee shops and baristas are embracing the fact that customers are customizing their coffee and drinking a cup their way — often with a milk or alternative that suits their lifestyle, dietary preferences, and environmental convictions. Meaning, the quality of what’s added to coffee has never been more important.Chobani is taking that to the next level with this one. Made with organic oats, Chobani Oat Barista Blend “is just a touch sweet, but not too sweet at all,” Tice explains. The texture is thick and full, a luxurious addition to a cup of coffee. “It’s a very balanced sweetness,” he adds.This One Dances Well With Many Partners“With substitutions, you have a lot of people who honestly want a lot of different things,” Tice explains. “So, you’re looking for an alternative that can stand up to a cold drink or a hot drink just as well as whole milk does, but still works better than the others.” This one does.It carries well with espresso in cappuccinos, lattes, cortados and the like, but shines just as brightly in a golden milk latte made with turmeric and ginger or a matcha latte. With matcha, as Tice explains, “it fits a lot more fluidly” than a traditional milk, since both the tea and Chobani Oat Barista Blend are made with water. And the tempered sweetness means it won’t overpower flavored hot or cold drinks like the popular honey cinnamon at Tice’s new cafe Orchard Coffee in Waynesville, North Carolina.Frothing: Don’t Mess With Our Latte ArtIn the Instagram era, we no longer expect an espresso drink to have a giant pile of light foam on top of it that requires a spoon to eat. No, we demand a perfect crema and rosetta — and maybe even some advanced latte art. “Customers want to see things that are beautiful,” Tice explains.To achieve that, the base of the drink needs to receive air well when it’s being steamed by a barista. “Basically what you’re doing when you’re steaming is you’re adding hot air to it. A good oat based drink is able to receive that texture and let it be something that goes throughout the whole drink and definitely the Chobani Oat Barista Blend carries that texture very well,” he adds. In short, “it’s easy to make great latte art with this it.”1Source: Datassential MenuTrends 2018. Of restaurants serving beverages, % that offer oat milk.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast"]}