{"id": "5676d6d8a9801657065202075c2ff2d0", "url": "https://www.bonappetit.com/recipe/italian-sundaes-with-nutella", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Italian Sundaes with Nutella Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueItalian Sundaes with NutellaBy Ignacio MattosApril 17, 20181.7(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFior di latte (“milk flower”) is a fresh cow’s-milk mozzarella. In its frozen-dessert form, it’s made without egg yolks so that the pure flavor of the sweet cream can shine. If you have a gelateria in your neighborhood, get a couple of pints to go. If not, use vanilla ice cream and your imagination. Serve these sundaes alongside a picnic menu of beef sliders, shrimp empanadas, and grain salad with tomatoes.Ingredients8 servings2pints fior di latte gelato1cup NutellaCoarsely chopped toasted blanched hazelnuts, crumbled amaretti cookies (Italian macaroons) and/or wafer cookies (for serving)PreparationPlace a scoop of gelato into each chilled bowl. Spoon a dollop of Nutella over each and top with another scoop or two of gelato. Top as desired.How would you rate Italian Sundaes with Nutella?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWould I ever make it again? I wouldn't make it in the first place. It is not a recipe. It is not even a good suggestion, a glob of Nutella on a scoop of ice cream. Additionally, the accompanying video of a guy looking for the best Buffalo wings in Buffalo opens with an offensive ethnic shout, \"Bill's Mafia.\" You see, the Mafia, as I understand it, is not a good thing. Are you guys at BA all on vacation this month? One other question, what does \"null with review\" mean?Anonymous8/3/2018not a recipe. good job bon apple tea.Anonymous900048/3/2018I'm sorry, but this is not a recipe. I was looking for a recipe for nutella topping but this is just click-bait. That doesn't even look like nutella (which has very little chocolate) but more like fudge sauce. Nutella is more like peanut butter in consistency and would not spread but glop on the ice cream or gelato. I expected better from Bon Appétit.susanannlopezSt Laurent du Var, France7/28/2018Explore Bon AppétitFrozen DessertDessertSundaeItalianEuropeanNutellaCondiments, Sauces & PastesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}