{"id": "568d6ce0ebceee2e065867056a2436ed", "url": "https://www.bonappetit.com/story/pankio-sport-water-bottle", "year": 2021.0, "month": 7.0, "day": 5.0, "content": "This Gigantic Sports Water Bottle Is the Only Thing That Stands Between Me and Dehydration | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Gigantic Sports Water Bottle Is the Only Thing That Stands Between Me and DehydrationGlowy skin doesn’t just happen.By Tiffany HopkinsJuly 29, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It’s my eternal workday dilemma—do I get up to fill the glass or proceed without water? More often than not, I pick the latter, even when my throat is drier than the Atacama Desert. Wrong decision, I know, but sometimes I’d rather continue working on an assignment (and, by “working on an assignment,” I mean binge-watching emotional puppy videos on The Dodo) than walk all the way to the sink. Two hours later...still thirsty. But I’ve decided to turn my life around with a little help from my half-gallon Pankio water bottle—and now a sip of water is always within arm’s reach.Photo by Emma FishmanPANKIO Water Bottle$16 at AmazonMy Pankio water bottle looks like something you’d see a bro with ripped deltoids carrying around at the gym because it is, essentially, a sports water bottle. It is not for the timid—it’s for the dehydrated. Equipped with a hefty handle, a leak-proof cap, and a thick lanyard, it’s made of heavy-duty BPA-free plastic and is, importantly, also 100% free of phrases like “Keep on drinking!” or “Almost there!” Its transparent design means I can always see how much water is in it—and there is almost always water in it because it’s so big. This thing is a beast, and drinking out of it will make you feel like one too.My Pankio is so sturdy that I know it won’t spill or break should I decide to take it on the go. But it goes nowhere. It sits on my desk from nine to five, all day, every day. While my morning coffee brews, I fill it up, and I’m set for the next eight hours. And although dramatically tilting my head all the way back to take a swig from a 5-pound jug of water during Zoom calls might make colleagues think I’m doing too much, I like to think that it sort of matches my entire life’s aesthetic: extra.I’ve learned a lot since purchasing this bottle, like that drinking water through a straw out of a dainty little glass is a very inefficient way to stay hydrated. I’ve also learned that just like you don’t have to actually do yoga to wear yoga pants, you don’t have to play sports to own a sports water bottle.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-29", "author": ["Condé Nast", "Tiffany Hopkins"]}