{"id": "56a9346fafbc7371d3353e9e0d9c0d34", "url": "https://www.bonappetit.com/story/the-dishwashing-system", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Wish Dishes So That You Save Soap, Water, and Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Dishwashing System Saves Soap, Water, and TimeHow to treat a pile of dirty dishes like a game of strategy.By Sarah JampelApril 10, 2020FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to wash the dishes.Every one of my dinner parties ends like this: My friends look around, assessing the wreckage—the utensils, the ever-multiplying glasses, the plates and bowls and platters—and insist on helping me clean. (They are good friends.) We have a friendly back-and-forth for about five minutes, at which point I hiss “But I have a system,” which sends them scurrying out the door. (I am also a good friend, but a very particular one.)Illustration by Tim Lahan Much of my “system”—which works in our small apartment, and whether I’ve cooked for eight or, much more often, just for two—is inspired by Peter Miller’s charming and excellent new book How to Wash the Dishes. It saves time, soap, and water and makes me feel like a grand strategist. The dirty dishes are the puzzle—and I’m going to solve it.But wait, before you even sit down to eat: Being an efficient dishwasher is not only about what happens after the meal—much of it hinges on your actions before guests even arrive. You’ve got to set yourself up for success. To do that, I apply a bit of strategy to reduce the number of dishes that will need to be washed in the first place. The fewer dishes I make, the less time I’ll spend scrubbing them.I’m also a big “clean as you go” proponent. In the ideal scenario, anything I’ve used to cook—cutting boards, knives, pots and pans, random graters, measuring devices—will be cleaned and put away before the meal is served. That way, I can start with a clear sink and dish rack.As soon as my friends scram, I turn on my favorite playlist (I can’t reveal my own on the internet, sorry) and get to washing. I’m talking here about washing dishes by hand, but if you’re using a dishwasher, this same strategy will apply to any items that don’t belong in the machine, too. Here it goes:1. Do not clear the dishes into the sink.The sink is your workspace. Clogging it up only slows you down and invites shattered glasses and cracked plates.2. Take a moment to come up with an action plan.If you’ve got room to organize the dishes on your kitchen counter, good for you! Keep like with like and wash from lightest to heaviest, saving anything greasy or gloppy (which can soak in the meantime) for last. Since I’m operating in a small space, I enforce kitchen crowd control: I leave the dishes where they are, whether that’s on the table or on the stove, and bring them to the sink only when it’s their time to shine.Illustration by Tim Lahan4. Make a soap bowl.You know how when you hand-wash a ton of dishes, you end up squirting soap into the sponge a million times? Not anymore. A soap bowl, a reservoir of warm sudsy water, will get you through a dinner’s worth of dishes faster, without wasting soap and a few gallons of water along the way. To do it, place a shallow bowl in your empty sink. It shouldn’t take up the whole basin—you need some room to work. Add a couple of pumps of soap, then trickle in hot water from the faucet.Illustration by Tim Lahan5. Fill it sloooowly.As the water from the faucet drips into your bowl, dip in your sponge and use it to wash the small, not-so-dirty things like glasses and utensils. Don’t submerge anything in the bowl—it’s your clean soap source.Illustration by Tim Lahan6. Once the bowl is full, move on to the bulkier items.When your bowl is good and foamy, tackle the dinnerware (of course, scrape off any remaining food first and rinse if it’s super, um, gunky), followed by heavier items like pots and pans. Saturate your sponge in the soap bowl and pour some of its powerful liquid directly into any dirtier items as needed.Illustration by Tim Lahan7. Rinse off.As you wash, you can either stack up the clean-but-sudsy dishes, then rinse them all later on, or you can rid each one of soap as you go. Either way, you want to direct any dirty runoff into the empty section of the sink and away from your sacred bowl. If your supply does become contaminated (grease happens!), restart with fresh soap and water.8. Pause to dry.As your dish rack fills up, take a breather to dry and put away the dishes. (If you need a towel recommendations, we’ve got it.) Otherwise, you’re building the sort of pile-up you’ll never want to untangle later.And that’s it: The dishes will be finished before you know it—and maybe even before your playlist has ended. Kick your feet up and finish that bottle of wine, but maybe straight from the bottle so that there isn’t another glass to clean.Oh, you have a dishwasher?Yes, There is a Correct Way to Load a DishwasherSince you're probably doing more dishes than ever.View StoryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-10", "author": ["Condé Nast", "Sarah Jampel"]}