{"id": "56b197b774ab754e668050c1d960810e", "url": "https://www.bonappetit.com/recipe/watermelon-coconut-gandt", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Watermelon Coconut G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredWatermelon Coconut G&TJulie Reiner shares her spin on a Bombay & Tonic. Julie grew up in Hawaii and uses that for her inspiration, with watermelon, lemon, and coconut water for a bright burst of summer. By BOMBAY SAPPHIRE® GINJune 14, 20214.2(5)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire3oz. premium tonic water3watermelon balls, for garnish1½oz. coconut water1oz. watermelon juice1lemon wedge, plus 1 lemon wheel for garnishPreparationStep 1Pour the Bombay Sapphire gin, coconut water, and watermelon juice into a balloon glass.Step 2Squeeze the lemon wedge into the glass. Add ice. Pour in tonic. Stir to combine ingredients.Step 3Skewer the watermelon balls onto a cocktail pick. Garnish with watermelon balls and a lemon wheel. Enjoy!Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Watermelon Coconut G&T?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-14", "author": ["Condé Nast", "Bombay Sapphire"]}