{"id": "56b13764a7b8009c59151be88ebda61e", "url": "https://www.bonappetit.com/story/kitaba", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Kitaba is a Spicy, Nutty, Toasty Angolan Specialty | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPeanut Butter Who? In My Family, It’s All About KitabaFragrant, spicy, salty, and nutty, kitaba can be eaten on its own or used as the base for soups and stews.By Jessica AlvesNovember 19, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Watching my grandma cook Angolan food is the closest I’ll ever get to magic. She doesn’t believe in kitchen scales or own any fancy cookbooks, and she pretty much eyeballs every meal to perfection. As a kitchen equipment fanatic (everything is necessary), it boggles my mind. The ancestral knowledge and skills passed on through generations guide her to enhance everyday ingredients into outrageously moreish treats like kitaba.Kitaba or quitaba is a versatile roasted peanut paste that can be eaten on its own as a snack or mixed with water to form the base for other traditional Angolan dishes like muamba de ginguba, a flavor-packed peanut and chicken stew with okra. Kitaba is fragrant, spicy, salty, and nutty with sweet undertones. For years, my family and I only ate it at grandma’s house because—cue my terrible excuse for our sheer laziness—she’s just the best at it.When I first started cooking for myself, I hid from Angolan cuisine. Although I was always curious, it seemed so beyond my skill set that I didn’t know where to start. Food is the strongest connection that I have to my heritage, so risk messing it up? I think not.It wasn’t until lockdown, when I joined the circus of Instagram sourdough-bakers-in-training, that I wondered why I wasn’t investing my time in learning about the foods perfected by my ancestors. They definitely heard me because that week, my grandma slipped a surprise through our letterbox. It was kitaba, but more than that, it was the love and comfort we had been craving in isolation. We all shrieked, and before inhaling it at record-breaking speed, I looked at it and knew it was my gateway to rediscovering my cultural identity.Unlike my grandma, I got out the scale and started perfecting my own kitaba. Peanuts are a major player in Angolan cuisine, and back home we have them in abundance, so it felt like the perfect ingredient to start my journey. Kitaba was the first of many dishes I learned to make, opening up an unquenchable thirst for self-discovery. Learning how to cook Angolan food has increased my appreciation for not just my grandma’s cooking, but all those who came before me too. Plus, it’s just fantastic.To make it, you’ll start by roasting 350 grams (2⅓ cups) raw redskin peanuts (these are ideal, but you can also give it a go with other raw peanuts with skins) on a baking sheet in a 350° F (180° C) oven for about 13–15 minutes. Make sure your peanuts have room to breathe and aren’t cramped or they won’t roast evenly. You’ll know they’re done when you’re hypnotized by the smell and the skins darken to a gorgeous maroon. If, like me, you’ve discovered the wonder that is air-frying (when I said everything is necessary, I meant it), you can also pop them in there for about 9–10 minutes—just don’t forget to give them a shake halfway.Let them cool completely. If you try the next step while they’re warm, the peanuts will release too much oil and you’ll end up with a sticky, liquid-y mess. Now, I love fumbling with peanut skins as much as anyone, but keep them on—they’ll help get you the rich flavor that makes kitaba so fabulous. Next, put the peanuts in a high-powered blender or food processor with ½ tsp. Maldon sea salt flakes (that’s my favorite, but you can use any sea salt and tweak the amount to your taste) and ½ medium Scotch bonnet or ⅓ medium habanero pepper (add a little more, less, or none at all depending on your spice tolerance).Now, my grandma beats the ingredients together into a thick paste in a mortar and pestle, but as my biceps aren’t quite there (yet), I blend them on the highest speed for 4–5 minutes. It should be very thick with a dough-like consistency. While it won’t be crunchy, you should see fine, almost powdery bits of peanuts. Just like that, you’ve got your kitaba and you can begin rapid consumption.To store it, I use a rolling pin or my hands to mold it into a rectangle (I go for 1-inch thickness, but freestyle as you wish) on a sheet of plastic wrap or parchment paper. I’ll then score it into smaller squares so that it looks a bit like a chocolate bar, lift the plastic wrap/parchment paper into a container, and pop it in the fridge (it keeps for up to one month for those with self-control, or a day in my house).Kitaba is the ultimate movie companion or the high-protein, heart-healthy boost I need before a workout. Spoon it, spread it, slip it into a smoothie or sauce—the choice is yours. Kitaba can do it all. Once you try kitaba, there’s no going back to store-bought peanut butter.Jessica Alves is a London-based freelance food writer and social media marketer who thinks everything tastes better with chile.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-06", "author": ["Condé Nast", "Jessica Alves"]}