{"id": "56b28edbb8362678b3866859a69da013", "url": "https://www.bonappetit.com/story/soft-swerve-soft-serve", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Soft Swerve Is the Only Soft Serve I’m Willing to Wait in Long Lines For  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Hype Ice Cream I’m Willing to Wait in Long, Near-Rioting Lines ForSoft Swerve in New York City is that good.By Sarah JampelJune 18, 2019FacebookTwitterEmailPhoto by @taylorjchoiFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I stumbled on Soft Swerve’s Instagram, I was drawn like a moth to a pastel light. The New York City soft serve shop swirls velvety-smooth ice cream in various appealing hues—Kermit-green matcha, periwinkle purple ube, cotton-candy pink lychee—any of which I’d be tempted to use to paint a wall of my living room. (It’s called an accent wall, okay???)As if the colors weren’t stunning enough, they’re churned into cups or cones to heights that rival Marge Simpson’s hair, in shapes that are textbook “soft serve.” And then there are the toppings affixed to the sides: Fruity Pebbles, Lucky Charm marshmallows, toasted coconut, freeze-dried strawberries, mochi, boba, red bean. It’s a visual fantasy straight out of my 1996 Lisa Frank obsession.It’s definitely something to look at (and the shop’s 50,000-plus Instagram followers agree). Yet I wasn’t convinced it would taste any good. I’ve been burned by too many pretty-faced desserts that haven’t lived up to their Instagram fame to go in feeling optimistic.But the Lower East Side spot slapped the skepticism out of me: the flavors—hojicha, matcha, sesame butter, black sesame, Hong Kong milk tea, coconut—are intense and, shockingly, not saccharine-sweet. The texture is unbelievably creamy, without even a hint of ice crystal. I’ve never even ordered an add-on, like caramel or sprinkles, or one of the Insta-famous “Swerve Specials” because I don’t want to distract from the flavor or the creaminess.I love Soft Swerve so much, I choose where I’m going for dinner based on its proximity. But even if I’m not eating in the neighborhood, I’ll always find an excuse to make a special trip.Go there: Soft SwerveExplore Bon AppétitNew YorkHighly RecommendRestaurantsFrozen DessertIce CreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-18", "author": ["Condé Nast", "Sarah Jampel"]}