{"id": "56b9e7aeaf3f79a65251f7cf381d3e36", "url": "https://www.bonappetit.com/story/dosas-swagath-gourmet", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Swagath Gourmet: The Indian Restaurant I’m Drawn to Like a Magnet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Indian Restaurant I’m Drawn to Like a MagnetThere are a lot of Indian restaurants in Edison, but I’m loyal to Swagath.By Mayukh SenJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Singling out a favorite Indian restaurant among Edison, New Jersey’s dizzying array of them is, plainly, a real idiot’s errand. Why even bother? This exercise forces you to succumb to the irrationalism of your silly heart. And for the better part of two decades, mine has guided me to Swagath Gourmet.Swagath Gourmet is on a retail-populated stretch of Edison’s Oak Tree Road, nestled between a sari shop and a jewelry store. I feel as if I was born at Swagath; I can’t remember the first time I visited, but it must’ve been around 1997, when I was five years old.Shrine to Ganesh.\nPhoto by Alex LauSwagath’s menu includes vegetarian South Indian staples. There are dosas padded with potatoes and onions; there are medu vadas, deep-fried doughnuts made from lentils; there are uttapams, those thick, savory rice flour pancakes that are cooked with onions and chiles, tomatoes added in as the batter sits on the hot pan. Everything is served on stainless-steel platters and cups. Its cotton tablecloths are a pleasant shade of turquoise dulled by overhead lighting; the air inside is thick with the sweat of batter from idli, a steamed fermented rice cake that’s served as an appetizer. There’s a pleasant little shrine of Ganesh, draped in garlands of red and yellow roses, at the entrance. The restaurant usually has the faint sound of Hindi music rumbling in the background, high enough to be recognizable but gentle enough not to disturb.We ate there out of habit: My family visited Swagath frequently because of the extremely boring fact that it was just down the road from the YMCA we all went to. Through this repetition, it became one of my late father’s favorite restaurants: the service dependably vigilant, the food unimpeachable. The man would basically inhale the rasam, a muddy tomato-and-tamarind–based soup that’s served before dosas. I’ve inherited this fondness from him; Swagath’s rasam wields understated power, spiced with such restraint that it has staved off some of my worst head colds.Idli, uttapam, and more.\nPhoto by Alex LauSwagath was the place where my clueless hands learned how to mangle a dosa and dip it into a shallow, sludgy pool of coconut chutney. This was where I learned that you can’t just drink a blisteringly hot cup of filter coffee, served in a stainless-steel tumbler, because you’d potentially lose your tongue in the process; you’ve got to pour it into a dabarah, a tiny bowl with lipped rims, to cool it down.Our family moved a few suburbs away from Edison in 2001. We would visit sporadically, gravitating to Swagath when we found ourselves there, as if our Toyota Corolla had developed a mind of its own.Inside Swagath.\nPhoto by Alex LauMy mother and I last ate there in June 2017 after my dad’s funeral. Swagath was convenient: The restaurant was down the road from the storage unit where he’d kept some of his belongings, belongings we now had to sift through and decide what to do with while we did the same with ourselves. Swagath has become one of life’s constants. It is an unfluctuating hamlet in the armpit of America, fostering the illusion that restaurants can be immune to the dumb ravages of time. The faces at the table may disappear, but the dosas are never stale, the rasam never loses its flu-vanquishing kick, and the tablecloths stay the same color. If I’m corny, forgive me. Blame Swagath.Mayukh Sen is a JamesBeard Award-winning food writer in New York.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Mayukh Sen"]}