{"id": "56b92d622e087370163a67515177a46d", "url": "https://www.bonappetit.com/story/carrs-crackers-with-cheese", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Carr’s Table Water Crackers Are the Best Crackers for Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Are the Only Crackers You Should Serve with CheeseI mean it, buster!By Amiel StanekApril 26, 2018FacebookTwitterEmailIllustration by Elliot SnowmanFacebookTwitterEmailYou’re planning a dinner party. You figured out a menu that would somehow accommodate your two vegetarian friends, your one Paleo friend, and your three friends who are doing Whole30. You just spent what felt like three hours (and the GDP of a small Baltic principality) at the cheese counter selecting some Fine Fromage. You know what you absolutely don’t have time to think about right now? Which of the 10,000 varieties of crackers on offer at the store are going in your cart. Fortunately, we’ve made the choice for you: Carr’s Table Water Crackers, the only cracker you should ever serve with cheese. End of story. Always and forever.I once read a Vanity Fair article—well, technically it was paraphrased to me, so sue me—about how, during his presidency, Barack Obama sought to eliminate as many frivolous choices from his day as possible to cut down on “decision fatigue.” He alternated between grey and black suits exclusively, and had a staffer order for him whenever he was at a restaurant. Which made sense to me—when you’re the leader of the free world, making decisions all day long that affect the lives of millions if not billions of people, you don’t want to waste any of your finite decision-making energies trying to choose between the chicken and the fish. And while I am not Obama, and you are not Obama (unless you are, in which case, WOW HI!), I think we can all agree that picking crackers is a frivolous endeavor, a decision better to not waste energy on. So, again: Carr’s Table Water Crackers.Why though? Why Carr’s Table Water Crackers and not, say, Triscuits or Stoned Wheat Thins or rice crackers or any of the seemingly-infinite options out there? Let’s get down to brass tacks, shall we. For one, Carr’s are plain without being bland. Delicately crispy, with the faintest toastiness, they’re not interested in upstaging any of the fancy-ass cheeses you dropped dime on—they’re there to support, not shine. There’s something almost spiritually austere about them (I’ve heard Catholics compare them to communion wafers and Jews liken them to matzo) and they read—simply, familiarly, ineluctably—as crackers. Not chips. Not bread. Not everything bagels. Crackers. And as such there’s absolutely zero risk that anyone is going to snack on them on their own. Bonus: They’re cheap!But I love my $15 Nut and Fruit Everything Bagel Bonanaza Crackers! They’re, like, soooo goooood!Fine. I’m not going to yuck your yum. Buy those artisanal-whatever hand-crafter crackers, but if you do, don’t even spend one second thinking about what kind of cheese you’re going to buy to put on them. Grab the closest hunk of orange cheddar or log of affectless chèvre and get gone.If you care about cheese, though, and pick it out lovingly, with excitement and anticipation and every intention of savoring it to its fullest savor around a dinner table of your closest friends...well, you know what to do. Carr’s. Carr’s. Carr’s. This time, and the next time, and every time after that.Buy It: Carr’s Table Water Crackers are $3.50 on AmazonExplore Bon AppétitCheeseCheese WeekCrackerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Amiel Stanek"]}