{"id": "56d4f5a592126d957e2a0ca2cab25700", "url": "https://www.bonappetit.com/story/pregnant-in-isolation", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Alexandra Marzella On What It's Like to Be Single and 8 Months Pregnant Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhat It's Like to Be Single and 8 Months Pregnant in Isolation“The people who show up for you are the people who show up for you, and that's amazing. And you should not be afraid to ask for help.”By Alexandra Marzella, as told to Emily Sundberg April 10, 2020FacebookTwitterEmailIllustration by Sofie BirkinFacebookTwitterEmailAlexandra Marzella is an artist, model, and soon-to-be mother currently self-quarantining in Brooklyn. We spoke to her while New York was approaching the end of the second week of its Stay at Home Order, and as Marzella was approaching the eighth month of her pregnancy. This essay is part of the Healthyish Guide to Being Alone, a month-long series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.I feel super lonely. No pregnant woman doesn't feel lonely. But I feel especially depressed because of my situation, not being in a committed relationship, not having planned this pregnancy, and not being financially stable at all.I was in Rome when I found out about the pandemic. I remember a boy that I hung out with there messaging me after I left being like, \"Yeah, they just put the entire city on lockdown for a month.”I got back at the beginning of March. It took me a minute to take [coronavirus] super seriously. In New York City, where everyone's like work, work, work, the city wasn't shutting down yet. One roommate was still babysitting, and another was still going into their auction house job. I did a photo shoot after we should've started staying home. I was encouraged by my best friend and roommate because the photographer was good and I felt like I wanted nice photographs of me being pregnant, and a lot of the other shoots I was planning on doing were cancelled.,There are usually six of us in this apartment. I’ve lived in this apartment for eight years now. It can definitely be overwhelming to live with so many people. There have been times when I didn’t want to come out of my room because I didn't want to interact with my roommates. One of my roommates just booked a ticket back to Germany to be with her family. Another girl went home to be with her mom in Baltimore. One of my roommate's boyfriends has been staying with us. We have a general agreement to not go out besides on walks or to the grocery store.I talk to my mom and dad on the phone, but that doesn't suffice for being held, for crying to someone and feeling comforted. I was born and raised in Rhode Island, my dad moved to Hong Kong when I was 15, and my mom moved to Charleston. You'd think that my mom would be the one who would try to come for my birth, but my dad's actually the one who's trying to push to get here, which I'm a little overwhelmed by, that he'd go on planes and airports to come to the epicenter of the virus.A lot of single moms have reached out to me on Instagram, so I've had a lot of support in that way. All the moms I've talked to throughout this pregnancy, are like, \"Ask for help as much as you need to. Ask for help, and then ask for help, and then ask for help, and the people who show up for you are the people who show up for you, and that's amazing. And you should not be afraid to ask for help, because it's hard.\"When I first got pregnant, I was like, \"Should I have a performance? Should I give birth at a museum? This could be like my comeback [as a performance artist].\" And then I watched unassisted home births, where women are giving birth in their bathtub, with literally nobody around, maybe a partner, maybe not, and that was really beautiful to me. So I'm having a home birth.I had a doula but she switched to virtual services only, and we had only had one in-person prenatal meeting. I was really banking on her in-person physical support, but it didn’t make sense for me to pay more than I could really afford if she wasn’t going to be in the room.So then I was standing in line at this food box pickup—it's a government-subsidized package of food that’s $15.00 a bag—talking to my ex about how all these women are scrambling to find midwives because they don’t want to give birth in hospitals. And then the next woman in line was like, \"I'm so sorry to interrupt, but are you at all, by chance, interested, or looking for a doula?\" And I was like, \"Well, I had a doula.”We’ve been talking, and I’m feeling pretty good about hiring her because she’s still open to doing in-person visits, and she seems very hands on which I think I could use. So I’ll have a doula. I don’t know if my dad will make it. I don’t know if my ex will be around.It’s been hard not exercising and dancing. I've always been a very physical person, and I haven't really done much of that throughout my pregnancy due to all kinds of fear. It also became less of a priority because I was pretty depressed throughout the pregnancy. But I have walked throughout my pregnancy, and I have started doing prenatal yoga. And I wake up every day and make a giant smoothie with vegetables and fruit. Even if I don't eat as healthy for the rest of the day, that's what I do to feel sane, and to feel like I'm giving my baby the nutrition she deserves.I've been staying away from people on the street, but I also feel like it's good, if you can keep your distance, to talk to strangers. And to check in with people online as well. And just remember that you're never alone, even though you're always alone.Explore Bon AppétitHealthyishHealthyish Guide to Being AloneCoronavirusessayRead MoreLifestyleAsk Andy: I’ve Started Texting My Ex During Social Distancing...Should I Stop?By Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Alexandra Marzella", "As Told To Emily Sundberg"]}