{"id": "56dc939cea2aee25e63ac43b1579dff9", "url": "https://www.bonappetit.com/recipe/fast-chicken-pot-pie", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Classic Chicken Pot Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2014 IssueClassic Chicken Pot PieBy Kat BoytsovaDecember 18, 20203.9(253)Read ReviewsTriangleEmailPinterestPrintALEX LAUEmailPinterestPrintEmailPinterestPrintDon’t fall into the trap of thinking this chicken pot pie recipe is too much work. In fact, your supermarket is going to do most of the heavy lifting, not that anyone else needs to know that. Store-bought rotisserie chicken, puff pastry (or pie dough), and a simple gravy spiked with flavorful condiments like hot sauce and Worcestershire sauce all come together to create something that tastes truly homemade.Editor’s note: This recipe was originally published on January 14, 2014. Ingredients6  Servings6Tbps. unsalted butter1large shallot, finely chopped1Tbsp. chopped thyme½cup all-purpose flour, plus more for dusting3cups low-sodium chicken broth1cup heavy cream or whole milkKosher salt, freshly ground pepper6oz. carrots (about 4 small or 2 medium), peeled, chopped4cups coarsely chopped or shredded chicken meat (from 1 small rotisserie chicken)1½cups frozen pearl onions, thawed1½cups frozen peas, thawed2tsp. hot sauce2tsp. Worcestershire sauce2tsp. white wine vinegar1sheet frozen puff pastry (one 14-oz. package or half of 17.3-oz. package), thawed in refrigerator, or 1 14-oz. store-bought pie crust1large egg, beaten to blendPreparationStep 1Preheat oven to 400°. Heat butter in a large skillet over medium heat. Add shallot and thyme and cook, stirring often, until shallot is translucent and golden, about 4 minutes. Add ½ cup flour and cook, whisking constantly, until mixture is pale golden and smells like popcorn, about 5 minutes.Step 2Whisk in broth ½-cupful at a time, incorporating completely before adding more. Whisk in cream; season with salt and pepper. Bring mixture to a boil, reduce heat, and simmer, whisking occasionally, until thick enough to coat a spoon, about 3 minutes. Reduce heat as needed to maintain a simmer and add carrots; cook until nearly tender, about 5 minutes.Step 3Mix in chicken, pearl onions, and peas, then add hot sauce, Worcestershire sauce, and vinegar and season with salt and pepper.Step 4Transfer mixture to a shallow 2-qt. baking dish. Unfold pastry and gently roll out on a lightly floured work surface just to smooth any creases and make large enough to fit over dish, if needed. Drape over baking dish and trim pastry so it is slightly larger than the dish if using puff pastry (you want a little overhang), or crimp dough around edge of dish if using pie dough. Brush with egg and make 2 or 3 slits in the pastry with a sharp knife.Step 5Place baking dish on a rimmed baking sheet (to catch any filling that may drip over) and bake until puff pastry is golden brown and filling is bubbling through slits in pastry, 20–30 minutes. Reduce oven temperature to 350° and continue to bake until crust is deep golden brown and cooked through, 30–35 minutes longer. Let sit 10 minutes before serving.Nutrition Per ServingCalories (kcal) 380 Fat (g) 15 Saturated Fat (g) 7 Cholesterol (mg) 140 Carbohydrates (g) 23 Dietary Fiber (g) 4 Total Sugars (g) 7 Protein (g) 36 Sodium (mg) 560How would you rate Classic Chicken Pot Pie?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleHonestly I would've skipped the hot sauce, I like a more classic flavor and the hot sauce was a bit off. Also, I would recommend cooking the vegetables separately completely before adding to the gravy, that will prevent them from releasing water into the filling which causes a bit of a soupy consistency.GMinneapolis, MN2/17/2022Due to dietary restrictions, I am only able to eat Yatzhee dice. I made the necessary substitutions, and it turned out great!Anonymous4/11/2021Due to dietary restrictions, I am only able to eat Yatzhee dice. I made the necessary substitutions, and it turned out great!Coleman Santa Rosa beach, Florida4/11/2021I liked this recipe overall. I boiled a whole chicken and used the stock, another reviewer had done. I reduced the  quantity of chicken stock by 1/2cup and added double the hot sauce, Worchester sauce, and white wine vinegar, after reading the reviews about the consistency and flavour. I was happy with my consistency. I didn't end up needing to simmer the sauce once it reached boiling, it was already thick enough. Even with my changes to the sauces' and vinegar quantities, I still found it a bit bland. I might try using the whole milk next time, since the 35% cream I used is super rich, so it might be inhibiting flavour build up. Definitely a good base recipe to build on and make your own. AlliToronto, Ontario3/23/2021The recipe was easy but the final result was a bit bland. Next time I will add additional spices or increase the volume of hot sauce, vinegar, and Worcestershire sauce. I didn’t run into the watery issue that other reviewers mentioned, perhaps because I cooked the frozen peas and onions a bit. All around a good basic recipe to have on hand! AnonymousAtlanta, GA1/29/2021This was tasty, although a touch soupy. However, how can you call a recipe \"fast\" when it calls for baking something for nearly an hour?? AnonymousChester County, Pennsylvania4/29/2020This was delightful! I boiled a whole chicken before and used the liquid from the chicken as the stock. Delicious!AnonymousDC4/14/2020Delish! I made a rotisserie chicken in my Instant Pot and made my own pie crust so it took a bit more time but it was great. I swapped the hot sauce for a dash of cayenne and added some Yukon gold potatoes to the mix, otherwise followed the recipe. Definitely would recommend!hannahdmichael1462Napa3/30/2020This was very easy and its foolproof.  It also tastes great.  It is my new go to pot pie recipe.AnonymousChicago10/3/2019The recipe was very easy. I used frozen mixed veggies and fresh mushrooms.  It turned out very good. It was very easy to make.  The sauce was also really good. I added extra dried spices.  Will definitely make it again.AnonymousCA3/10/2019Very delicious.  The sauce becane a bit watery after baking and even after sitting didn't quite reach the consistency it had when it went into the oven, presumably from the water in the onions and peas.  Next time i will add extra flour to compensate or cook the onions and peas a bit before adding.  The flavors are fabulous however.  Although i love a puff pastry crust,  next time i might try a biscuit type crust (bisquick makes a great crust for stews, etc) so it doesn't take quite so long to bake.  I added celery, mushrooms and a parsnip i had lying around.  It was a delicious meal for a wintry night!PaulaKimmelRichland, Wa2/5/2019The flavors are there but the dish lacks the comforting ooey-gooey cream sauce that usually accompanies traditional chicken pot pie. May opt \"non-fast\" recipe in the future and see if it makes a difference... AnonymousBoston11/26/2018Explore Bon AppétitSavory Pie & TartAmericanBritishEuropeanChickenPoultryPuff PastryOther IngredientsFallWinterMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-01-14", "author": ["Condé Nast", "Kat Boytsova"]}