{"id": "56eb47702f6d5585a444c4aeee2125d6", "url": "https://www.bonappetit.com/recipe/bas-best-eggplant-parmesan", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Best Eggplant Parmesan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2016 IssueBA’s Best Eggplant ParmesanBy Claire SaffitzMarch 12, 20214.6(173)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThe mantra for this Eggplant Parmesan recipe should be: “Good things take time.” Trust us, your efforts will be rewarded the moment you pull this custardy eggplant slathered in tangy sauce and a crispy, cheesy top from the oven. It may take some time and a few steps, but it helps that you can break the work into chunks, and over a couple days if you prefer. The marinara sauce, rich with tomato, wine, tons of garlic, and anchovies (the secret to everything) can be made up to two days ahead; the flavors might even be better after a day’s worth of mingling. The casserole itself can be assembled and cooked two days before you want to dig in—just store it in the fridge and reheat. As for the fried eggplant and cheese, panko, and herb mixture? Those two components should be made the day you plan to layer it all together. Making them fresh will help keep the herbs vibrant and the crispy/custardy texture of the eggplant.Some practical advice: If you’re striving to serve this Eggplant Parmesan as perfect blocks with some structural integrity (like the picture above), let it rest at room temperature for at least 30 minutes after pulling it from the oven. Trying to slice into this dish while it’s still molten hot will create an oozy mess. Pair it with a simple, leafy salad and call it dinner.Editor’s note: This recipe was originally published September 20, 2016.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonFood Mill$50 At Amazon13x9\" Baking Dish$20 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients12 servingsMarinara¼cup olive oil1head of garlic, cloves crushed1large red onion, chopped3oil-packed anchovy fillets (optional)½teaspoon crushed red pepper flakes1Tbsp. tomato paste¼cup dry white wine228-oz. cans whole peeled tomatoes¼cup torn basil leaves½tsp. dried oreganoKosher saltEggplant and Assembly4pounds Italian eggplants (about 4 medium), peeled, sliced lengthwise ½–¾ inch thickKosher salt3cups panko (Japanese breadcrumbs)1½tsp. dried oregano1tsp. freshly ground black pepper1½cups finely grated Parmesan, divided1½cups all-purpose flour5large eggs, beaten to blend1⅓cups olive oil½cup finely chopped basil and parsley, plus basil leaves for serving6ounces low-moisture mozzarella, grated (about 1⅓ cups)8ounces fresh mozzarella, thinly slicedPreparationMarinaraStep 1Preheat oven to 350°. Heat oil in a Dutch oven or other large heavy ovenproof pot over medium. Cook garlic, stirring often, until golden, about 4 minutes. Add onion, anchovies (if using), and red pepper flakes and cook, stirring often, until onion is translucent, about 5 minutes. Stir in tomato paste and cook, stirring often, until slightly darkened, about 2 minutes. Add wine, bring to a boil, and cook until almost completely evaporated, about 1 minute. Add tomatoes, breaking up with your hands, and their juices; add basil and oregano and stir to combine. Swirl 1½ cups water into one tomato can, then the other, to rinse, and add to pot; season with salt. Transfer pot to oven; roast sauce, stirring halfway through, until thick and tomatoes are browned on top and around edges of pot, 2–2½ hours.Step 2Let sauce cool slightly. Pass through the large holes of a food mill or process in a food processor until mostly smooth. Taste and season with salt.Do Ahead: Sauce can be made 2 days ahead. Cover and chill.Eggplant and AssemblyStep 3Lightly season eggplant slices all over with salt; place in a single layer on several layers of paper towels inside a rimmed baking sheet. Top with another layer of paper towels and more slices; repeat as needed. Top with a final layer of paper towels, then another rimmed baking sheet; weigh down with a heavy pot. Let eggplant sit until it has released excess liquid, 45–60 minutes. This step gives the eggplant a creamy texture when baked.Step 4Meanwhile, pulse panko, oregano, pepper, and ¾ cup Parmesan in a food processor until very finely ground. Transfer to a shallow bowl.Step 5Preheat oven to 350°. Place flour in another shallow bowl and eggs in a third shallow bowl. Working one at a time, dredge eggplant slices in flour, then dip in egg, allowing excess to drip off. Coat in breadcrumbs, packing all around, then shaking off excess. Place on wire racks.Step 6Heat ⅔ cup oil in a large skillet, preferably cast iron, over medium-high. Cook as many eggplant slices as will comfortably fit in pan, turning once, until deep golden, about 5 minutes. Transfer to paper towels and immediately press with more paper towel to absorb oil. Working in batches, repeat with remaining slices, adding remaining ⅔ cup oil and wiping out skillet as needed. Let cool. Taste and season with more salt if needed.Step 7Toss chopped herbs, low-moisture mozzarella, and remaining ¾ cup Parmesan in a medium bowl. Spread 1 cup sauce over the bottom of a 13x9\" baking pan; top with a layer of eggplant slices (trim as needed). Drizzle 1 cup sauce over and sprinkle with one-third of cheese mixture. Add another layer of eggplant, followed by 1 cup sauce and half of remaining cheese mixture. Repeat layers with remaining slices, sauce, and cheese mixture. Cover with foil and bake on a rimmed baking sheet until eggplant is custardy, 45–60 minutes.Step 8Remove from oven and arrange fresh mozzarella over eggplant. Increase oven temperature to 425° and bake, uncovered, until cheese is bubbling and browned in spots, 15–20 minutes longer. Let rest 30 minutes. Top with basil leaves just before slicing.Do Ahead: Eggplant Parmesan can be made 2 days ahead. Let cool; cover with foil and chill. Reheat in a 350° oven, uncovering halfway through, until bubbling gently at edges.Nutrition Per ServingCalories (kcal) 620 Fat (g) 41 Saturated Fat (g) 11 Cholesterol (mg) 100 Carbohydrates (g) 45 Dietary Fiber (g) 5 Total Sugars (g) 9 Protein (g) 19 Sodium (mg) 640How would you rate BA’s Best Eggplant Parmesan?Leave a ReviewTell us what you thinkReviews (81)Back to TopTriangleTime consuming but worth it! I cut the eggplant too thinly and made it overall not as saucy with all of the breading from the fried eggplant but it was still delish! Definitely can make it in parts and it all at once! Kathryn EAtlanta 2/13/2022This was amazing! Yes time consuming but worth it. I used my deep fryer for the eggplant. AnonymousCenterport, NY2/6/2022Amazing recipe. The only change I made is, I used my air fryer for the eggplant. No oil!\nLindaMontreal1/11/2022I think this recipe should be labeled as eggplant lasagna rather than Parmesan. Still it is amazing. I highly recommend making the sauce in advance just to save time. It is a lengthy recipe. Additionally, I’m not the hugest fan of the skins of egg plants, so I recommend just going ahead and cutting all of that off when layering.Ariel TX12/27/2021This is the best eggplant parm I’ve ever had, but be warned, it is a marathon and it’s messy.  If you don’t do the sauce and eggplant concurrently, plan on this taking 4+ hours.  I don’t make any variations to the recipe for the most part.  I would recommend buying 5 pounds of eggplant so you don’t have to worry about using the end scraps after cutting. Go thick on the slices, it will cook down significantly.  Also a good idea to increase the panko mixture by 50% so you don’t end up with tiny crumbs. Tom KLos Angeles, CA12/5/2021Really good eggplant parm just takes time, but it sure is delicious. A few tips to reduce some of the pain of making this:\n1. Give yourself time. I made this over three days (sauce day one, bake eggplant up fresh mozz day 2, reheat and broil mozz day 3). \n2. Take a few minutes before you start to read through the recipe several times, prep, and strategize. There's a lot of moving eggplant from one dish to another.\n3. Clean as you go. You can give yourself time in between breading and frying the eggplant. This + pre planning will make things much less dire at the end, especially if you're dealing with a small kitchen and/or fewer tools. \nThis is a project for sure but if you enjoy eggplant parm, you'd be hard pressed to find a better one than this. NytashaOakland11/25/2021This was by far the best eggplant dish I ever made, worth all the time and effort. A couple things I didn't intuitively know, like whether to leave the Dutch oven lid on while roasting the sauce or chopping up the anchovies. I put the lid on, and left the anchovies whole. Seemed fine.. Also, I don't have a food mill and instead put the sauce in my food processor. Next time I will batch it since I made an enormous mess. It worked fabulous though, I was impressed. \nI skipped the bake it for an hour step since I deep fried my eggplant slices in my Fryer for three minutes. They were already custardy when I layered it all together.  20 minutes uncovered 350 was perfect. \nThis was my first time not using a jar sauce, honestly never going back so thank you. My family thanks you. There wasn't a scrap of leftovers. I have to make two next time, maybe three. I took photos but I don't see a way to share my pics. JoLynn Becker Lompoc, California 11/13/2021How much time and how much effort will you make for maximum flavor? This is a spectacular dish, and I've used the mother sauce  in other recipes as well (makes great lasagne and spaghetti as well). It's time consuming, and when it comes to the eggplant, a bit fiddly and fussy, too. But this is unbeatable for flavor and texture. To me, it's worth it. RWyldeSt Paul, MN11/13/2021I grew up in New York eating some of the best Italian food you can get in America . This is the second time I've made this. It's phenomenal,  got rave reviews from a restaurant owner. Roasting or baking the sauce is something I've never done before but it came out unbelievably well. As others have said this takes a long time . It's a lot of work . But alll in all a great recipe. The only change I made was adding a little bit of Italiab  hot pepper pate' because I like my sauce with some spice.Russ TaylorVero Beach. Florida 10/31/2021Was nervous that it would be a nightmare! For a rainy Sunday it was a good project to have, and the outcome was delicious. 4 eggplants was way too much- I ended up having enough to make two. My partner was my fry cook. It takes a long time to fry all those pieces so be prepared! SO yummy, but be ready for this commitment. You need time, you will have dishes to wash, and supper will be so satisfying :)\nShaeVancouver, BC10/27/2021Used my own marinara sauce recipe, but everything else about this recipe was great. YES this is going to be long and tedious and messy, that is the beauty of an eggplant parm. I don’t know why you would rate a recipe low because of that. It was absolutely delicious. Bianca MCanada10/23/2021A+++ recipe. Was worried by reviews saying this is too long/complicated/messy. So I modified, with great success (I think this recipe is hard to mess up). Hopefully this helps someone else!\n (1) As suggested by the recipe and other reviews, split across 2 days, making only the marinara the first day. (2) Sliced eggplant a little on the thinner side (none were wider than 1/2\") and \"fried\" in the air fryer after spritzing the breaded slices with a spray oil. 400F for ~12min; bonus that this eliminates a lot of paper towel use too. (3) broiled the mozz on the top and watched it carefully -- took about 7 min to be melted and bubbly (saving me a few mins at the end after smelling this deliciousness so long I couldn't stand to wait!). Turned out amazing, would recommend. AnonymousMaryland10/19/2021The flavours were very good.  I did have issues with the eggplant though.  1/2 to 3/4 inch slices are very thick.  Some of my eggplant was tough...not sure what I did wrong.  Also, almost set off smoke alarms in my place when I was frying the panko coated pieces in my cast iron skillet.Anonymous10/7/2021Read this carefully before you make this! \n\nOK I was going to leave a 1 star review b/c of all the freaking time, energy, counter real estate, pots, pans and dishes it used....but this was extremely tasty.   You MUST NOT skip any steps if you want to be truly wow'd.  I highly recommend you make the sauce the day before.  If you decide to make it all in one day, you better get started around 2 in the afternoon b/c this dish is TEDIOUS AF.  Try to get eggplants that are smaller, shiny, fresh and with the least amount of seeds. \n\nHere are the modifications I'd recommend:  You don't need 4 lbs of eggplants.  I think around 3 lbs would be just fine.  Increase the egg mixture to 6-7 eggs.  I'd also recommend at least 24 oz of mozzarella cheese b/c I ran out for the top layer.  You NEED the anchovies in the marinara.  Trust me, you won't even taste it and it will get the sauce depth. \nShruti San Antonio, TX 10/4/2021Read this carefully before you make this! \n\nOK I was going to leave a 1 star review b/c of all the freaking time, energy, counter real estate, pots, pans and dishes it used....but this was extremely tasty.   You MUST NOT skip any steps if you want to be truly wow'd.  I highly recommend you make the sauce the day before.  If you decide to make it all in one day, you better get started around 2 in the afternoon b/c this dish is TEDIOUS AF.  Try to get eggplants that are smaller, shiny, fresh and with the least amount of seeds. \n\nHere are the modifications I'd recommend:  You don't need 4 lbs of eggplants.  I think around 3 lbs would be just fine.  Increase the egg mixture to 6-7 eggs.  I'd also recommend at least 24 oz of mozzarella cheese b/c I ran out for the top layer.  You NEED the anchovies in the marinara.  Trust me, you won't even taste it and it will get the sauce depth. \n\nShruti 10/4/2021Explore Bon AppétitPastaCasseroleEggplantVegetableParmesanCheeseMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-09-20", "author": ["Condé Nast", "Claire Saffitz"]}