{"id": "56f7931cd65a1ee50114ef12f33e98b4", "url": "https://www.bonappetit.com/story/how-to-make-yuca-fries", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "Yuca Fries Are the Crispy-Fluffy Childhood Treat I Constantly Crave | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYuca Fries Are the Crispy-Fluffy Childhood Treat I Constantly CraveGolden on the outside, velvety in the center.By Zaynab IssaDecember 22, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I was probably 12 years old when I had the disappointing realization—for everyone else, not for me—that not all moms make crispy and fluffy mogo fries on Sunday afternoons. Mogo is the Swahili word for yuca (pronounced YOO-KAH), which is also known as cassava and manioc. Not to be confused with yucca, a pretty flowering desert plant that you most definitely should not eat, yuca is an unattractive tubular root vegetable that you most definitely should eat. Native to the tropical Americas, where it’s been harvested for thousands of years, yuca was brought to Tanzania by Portuguese traders a very long time ago—I'm talking circa the 1500s. But it’s not just popular in Africa (which as of 2002 was growing about half the world’s supply)—it’s also an essential ingredient in numerous cuisines across the globe, from South and Central America and the Caribbean to West Africa, Thailand, India, and China.This is what you're looking for!\nPhoto by Laura MurrayIts versatility makes it a go-to ingredient in so many East African households, including my own. Of all the ways we cook yuca (it should always be cooked and never eaten raw)—slow-cooked with beef and coconut milk for a creamy and hearty stew, sliced paper-thin and fried, then tossed in chili powder and salt to make mogo chips, or shredded and flash-fried to make a crispy and crunchy garnish for soups—my favorite yuca preparation is mogo fries: The yuca is cut into strips, boiled, seasoned, then fried to create an extra-crispy exterior to encase the velvety interior.Before you can actually make the mogo fries, you’ve got to get your hands on some yuca. Find this super-starchy root vegetable, not unlike a potato, in the produce sections of most international grocery stores and at some farmers markets. If you can’t find it fresh, try looking in the freezer section where it’s sold peeled and cut into segments.In terms of flavor yuca is pretty neutral, so it takes on whatever flavors you choose to season it with. But the standout here is the texture—it's so starchy that for the most part it holds its shape even when cooked to death, which is why this method for mogo fries works out so well. The boiling ensures a fully cooked mashed potato-esque texture on the inside and, when fried, the natural starch from the mogo, along with the dusting of flour, creates an impressive outer crisp to contrast.Now when it comes to actually handling yuca, it takes some extra elbow grease. Its woody, waxy skin needs more than the swipe of a vegetable peeler to be removed. Instead, trim the ends, stand it up on a flat side, and carefully run a sharp knife down the sides to peel it. After that it's pretty much smooth sailing—the white fleshy interior is similar in texture to a raw sweet potato and can be easily cut into with a sharp knife. For 4–6 servings of fries, start with 3 medium yuca, peeled and cut into spears. As you prep the yuca, bring a large pot of water to a rapid boil on high heat. When it’s boiling, add the spears and at least 2 Tbsp. kosher salt. Boil the yuca until they can be easily pierced with a fork, about 25–30 minutes. Use a colander to thoroughly drain the yuca, then let them sit out for about 15 minutes to allow the moisture to steam off. You might notice a woody stem running through the edge of some of your spears. If you find one, gently remove it by peeling it away with your fingers or a knife and discard it. I find it’s easier to do this after the mogo is boiled.In a medium-size bowl, combine another ½ teaspoon kosher salt, the juice of 1 lemon, ¼ tsp. Kashmiri chile powder, and ¼ tsp. ground turmeric. This will act as a flavorful seasoning for the yuca. Add the yuca and toss to coat evenly. Then sprinkle over 1 Tbsp. flour and toss again. Heat a large pot of vegetable oil on high heat for deep-frying. If you have a kitchen thermometer, aim for about 425°. Carefully add the yuca to the hot oil in batches, about 4–6 pieces at time, and fry until golden brown and crispy, about 3–5 minutes. Remember, the yuca is already cooked through—we're only looking for color and crispness here. Use a slotted spoon or spider to remove the fries from the hot oil and place them on a paper-towel-lined plate to drain any excess oil. Serve immediately with a squeeze of lemon and a sprinkle of flaky salt or some tamarind chutney. And just like that, I’m 12 again, it's noon on a Sunday, and I’m sitting on a stool by the island in my mom’s kitchen.Zaynab Issa is a writer based in New York. Most recently, she has published the zine-style cookbook Let’s Eat that features some of the East African and Indian recipes she grew up eating.Explore Bon AppétitIt's That SimpleAfricanRead MorecookingWhen I Crave Something Hearty and Homestyle, I Make Udon GyozaBy Jarrett MelendezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-22", "author": ["Condé Nast", "Zaynab Issa"]}