{"id": "57046f31ba4052fef898cd065cce149d", "url": "https://www.bonappetit.com/story/favorite-fancy-supermarket-butter", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Organic Valley's Pasture Butter Is Our Favorite Fancy Supermarket Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOrganic Valley's Pasture Butter Is Our Favorite Fancy Supermarket ButterIf we're going to drop dime on the good stuff, this is our go-to.By Alyse WhitneyNovember 15, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEating butter by the spoonful miiiiiight be bad for your heart, but that’s what the Basically team did to make sure we found the best brand. There are a lot of butters on the grocery store shelves, and you probably reach for the same one for all your needs: spreading on toast, cooking, adding a knob to make pasta glossy and decadent. But if you’re looking to up your butter game for homemade bread, a killer ham and cheese sandwich, or another application where you taste mostly butter, we found the best salted cultured butter for you.Wait, salted? Cultured? What does that mean? Salted is, well, added salt for flavor, mostly for savory applications. (We didn’t test unsalted, but we would vouch for this brand for both salted and unsalted—the latter for baking things, like strawberry–graham galettes.) Cultured means it was made with active bacteria, like yogurt. Cultures are added to cream before churning, and it is churned low and slow until it is ultra creamy with a higher fat content. European and French butters are usually cultured, and have at least 82 percent butterfat level. The resulting butter is less sweet and more tangy because of fermentation, like sourdough bread, which is unsurprisingly pairs delightfully with.After tasting six widely available brands of cultured salted butter, we crowned Organic Valley’s Pasture Butter ($4.69 for 8 oz. at Whole Foods) the winner. It has a whopping 84 percent butterfat, is “lightly salted,” and Organic Valley explains the butter is \"made at the peak of pasture season, slow churned from May to September.” Its bright golden color is from the quality of the grass the cows ate, not synthetic dyes.There she is!\nPhoto by Alex LauOne editor appreciated how it was “milky, extremely rich and creamy, with just enough tang and lactic acidity to keep things interesting, and an appealing grassiness.” He said he could eat this every day and would be excited to cook with it, like browned and drizzled over fish, baked into salty chocolate chip cookies, or whipped with garlic and herbs for a compound butter. (That’d be nice with a simple steak!)Another taster commented that it tasted like “French restaurant butter at a more accessible price point,” with “a delicate amount of salt, deeper flavor than regular butter, and smooth and silky texture like fresh-churned cream.” Unlike some of the others we tasted, this didn't have an off-putting funk. “It’s grassy but not the whole barn,” someone else added.The texture is what really sealed the deal for two other editors. One said it “melts in your mouth without turning greasy,” and another admitted that it fooled us because it doesn’t taste mass-produced or that it was one of the cheaper options we selected. “SO DAMN CREAMY!” With that in mind, our idea applications are simple: carbs! Think over-the-top grilled cheese, any pasta, or spreading on the warmest bread you can find. But honestly, if you just take a spoon and eat it on its own like ice cream, it wouldn’t be a terrible idea. Everything’s better with butter.Organic Valley Pasture Butter is available at Whole Foods and other grocery stores across the country. Check your local grocer or use this location finder for the closest store.This pound cake wants to be full of fancy butter:Lemon Pound CakeEvery cook should have at least one good dessert up their sleeve, and this classic, lightly-glazed lemon pound cake should be yours.View RecipeExplore Bon AppétitButterBasicallyproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Alyse Whitney"]}