{"id": "571453532770aadd47a0fbfeabcee805", "url": "https://www.bonappetit.com/story/the-best-chicken-part", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "How to Debone Chicken Thighs for Skin-On Flavor And Shorter Cook Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Debone Chicken Thighs for Skin-On Flavor and Shorter Cook TimeBreak out your kitchen shears—we're doing some (light) butchery.By Kate KassinJanuary 13, 2022FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Unless we’re talking stir-fry, curry, or chicken parm, I have one poultry prerequisite: It must be skin-on. Throughout my childhood I was the chicken skin czar of my family, commanding that all crispy skin be presented to me as a familial tax. (My mother usually obliged while my father did not.)The problem with skin-on chicken, however, is the pesky bone. Certain chicken parts (e.g., wings) deserve to be bone-in, but as for other cuts (like thighs and breasts), there’s something inherently indulgent about the uninhibited pleasure of biting in with no bone to navigate around.So how does one reconcile the ease of eating a boneless piece of chicken with the magic of crispy skin? The answer is boneless, skin-on chicken thighs, the only cut of chicken I have eyes for.The first time I was introduced to boneless, skin-on thighs was during family meal at a restaurant, that glorified half hour before service when it’s not quite lunch and not quite dinner—the best time of day to eat chicken thighs. What made boneless, skin-on thighs so perfect for family meal preparation also makes them perfect for weeknight dinners: They cook a lot faster than bone-in thighs, but you don’t lose out on texture and flavor.While the restaurant could purchase this flawless cut of chicken from suppliers in bulk, I soon learned that if I wanted to indulge at home, I would have to turn to my trusty pair of kitchen shears and learn how to bone chicken thighs myself. (Either that or I’d have to be lucky enough to stumble upon an H Mart location that had these babies in stock that day, or forward-thinking enough to place an order with Weee! ahead of time.)Boneless, Skin-On Chicken Thighs, 4 lb.$16.99 at Weee!Here's how to bone chicken thighs:You don’t have to be a seasoned butcher to get the job done. To do it, place the thigh skin-side down on a clean surface. Look for where the fat meets the bone along the length of the thigh and use your shears to cut along one side of the bone to begin to free it from the meat. You want to cut deep enough only to free the bone—don’t cut through the meat or the skin. Repeat with the other side of the bone, then use your fingers to move the meat away from the bone. Next, position your shears under the bone and cut to loosen from the remaining flesh. You should feel like you’re slowly easing the bone away, rather than ripping it out. To release the bone from the thigh, carefully cut along the knuckle-like ends and lift the bone away. You can save the bones for stock or discard them. Learning to bone chicken thighs may take a bit of practice, but once you get the hang of it, you’ll be doing it often enough that you’ll question whether your calling in life is to become a butcher. Maybe mine still is.Joyce Chen Unlimited Kitchen Scissors$30 $18 at AmazonFrom there, make this Chicken Under a Brick in a Hurry or use your boneless, skin-on thighs in your other favorite chicken dishes, like Thai Roast Chicken Thighs with Coconut Rice or Hot Honey Chicken, keeping in mind that they’ll take less time to cook through.Or, if you can’t be bothered to follow a recipe, simply roast your newly boned chicken thighs for 20–25 minutes at 425° F with olive oil, S&P, and your favorite spices atop some fingerlings and your veggies of choice. As the fat from the chicken skin renders, your vegetable will be left tasting better than any vegetables have ever tasted. And since you butchered and cooked, I give you full permission to be your own chicken skin czar.No bone, no problemChicken Under a Brick in a HurryGetting your chicken super juicy on the inside and extra crispy on the outside requires one simple tool (that’s the brick part) and a few helpful techniques.View RecipeExplore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-13", "author": ["Condé Nast", "Kate Kassin"]}