{"id": "5717e9c470cc64aa5d5c40c7048f48a4", "url": "https://www.bonappetit.com/story/going-to-a-dispensary", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Marijuana Dispensary Tips: 8 Things to Think About Before You Go | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle8 Things to Think About Before Going to a DispensaryLive in a legal state or visiting one? Here’s what you need to do to buy weed.By Charlotte PalerminoSeptember 6, 2018FacebookTwitterEmailPhoto by Andrew LichtensteinFacebookTwitterEmailWith over 30 states medically legalizing and 9 states recreationally legalizing weed, more and more people are realizing what the cannabis community, research community, and 1930s NYC Mayor La Guardia knew: addiction rates are lower than commonly accepted substances like alcohol and nicotine while the therapeutic benefits are potentially high. So how does one navigate this brave new weed world? Legalized states have regulated products sold in licensed stores called dispensaries. Buying from a marijuana dispensary still can’t guarantee you’ll get the right product so here are some questions to ask before you go buy legal weed.But first, a quick primer: Unlike alcohol, which affects most people in basically the same way (you drink; you get drunk), cannabis is anything but consistent (though the DEA has repeatedly concluded that zero overdose deaths come from cannabis.) Different forms of ingestion, applications, and strains interact with your unique endocannabinoid system making weed a choose-your-own adventure experience.Your endocannabinoid system are the receptors floating around your entire body that regulate everything from mood to digestion and immunity. Different compounds can unlock and activate these receptors, and it just so happens that cannabis has many compounds—cannabinoids—that act as keys in this way. CBD and THC are both cannabinoids, and more than one hundred other compounds have been discovered in the plant as well.No two people’s endocannabinoid systems are the same, and it’s the dispensary staff’s job to help you figure out if and what type of cannabis, and product, is right for you. Here’s what you should be asking yourself—and your cannabis consultant—before you commit to buying.Am I in a recreational or legal state?Only 9 states allow for anyone over the age of 21 to walk through the door. That list is here. 30 states are medical, in those states you have to apply for a medical card and each state varies when determining which conditions qualify for a card.Does the store has a recreational license?Just because a dispensary is in a recreationally legalized state doesn’t mean they have their recreational license. You can find this information on a dispensary’s site or go to Leafly, which has peer-reviewed locations and easy-to-use finders for places near you.What is my experience level?A good dispensary will not weed shame you if you’ve never tried it, most dispensaries I spoke to are thrilled to open the wonderful world of cannabis to someone new. Eliot Dobris from Apothecarium, a dispensary located in San Francisco with branches all over the city and a location in Vegas stressed the importance of being honest with your cannabis consultant (they avoid the more common label of “budtender”) because they are there to help you navigate a complicated plant.Edible gummies are just a few of the many marijuana products on the market.\nBenjamin RasmussenHow do I want to feel?Jennifer Seo, one of the general managers of LAPCG, a popular dispensary with medical roots in LA, noted that the first question a good cannabis consultant will ask is “what are you looking to help with or feel?” Are you anxious? In pain? Is it for you mom and you don’t want to freak her out with a bong rip and are looking for something cute and non-threatening? Think about why you’re walking through the door or, if you’re just curious, choose a dispensary focused on one-to-one services. Open-floor plans where patients outnumber cannabis consultants can be overwhelming and confusing for first-timers. Dispensaries like LAPCG and Apothecarium tailor their experiences so that consumers have 1:1 experiences with an expert that’s gone through extensive training. A good dispensary wants you to have a great experience so you, and your mom, will find something that works.What other questions do I have?Ask a lot of questions; there are no dumb ones. Even the most experienced smokers may not know much about new kinds of edibles, topicals, or tinctures on the market. Due to the versatility of cannabis, there are a lot of options. Your body, your choice: Just make sure you communicate.Is the staff trying to educate me?Any dispensary that rushes you to buy, or doesn’t dive deep into how a product works isn’t a good sign. Both Seo and Dobris noted their dispensaries have strict cannabis consultant testing and have a list of questions they ask patients as they walk through the door. This isn’t a bar, it’s a consultation. Their goal is to understand each person and help them find what works for their personal endocannabinoid system. Kyle, head of training at Apothecarium, noted that cannabis needs more research due to the breadth of issues it can tackle. Suffering from disfluency from a young age, Kyle was able to wean himself off anxiety medication to make his speech flow naturally. Dispensaries rooted in education with workshops, seminars, and attentive consultants are a great place to make the buying process easier.Is the staff pushing me to get high?Seo noted this is a great tell for a dispensary who is being responsible versus one that is trying to push a stereotypical experience on you.Are they doing good for the community?Cannabis has a sordid history in the US. Even with reports showing cannabis as a safer substance than alcohol as far back as 1944, it was made a schedule I substance in the company of drugs like heroin and meth. Over half of all drug arrests in the US, according to the ACLU are from cannabis, majority of which are for possession, not big drug busts. Most of those arrests are African-Americans and people of color (even though white people use cannabis at similar rates). People are still in jail because of cannabis possession, communities have been ravaged by the war on drugs, the word marijuana came into popular usage to make the drug sound foreign, a Richard Nixon aide even confessed that the war on drugs targeted “blacks and hippies.” The list goes on.So, it’s important to give your money to people who help communities, educate customers, and generally aren’t just going for the money. Ask your dispensary what they do to help communities and those that carry felonies on their record for non-violent cannabis crimes even once recreational laws are passed. Los Angeles, along with other cities and states, haven’t fully expunged records. Apothecarium has donated over $300,000 to causes impacted by the war on drugs, LAPCG has also donated money and scours Instagram and the internet for products and brands created by communities hurt by cannabis prohibition. Generally in life, but particularly with cannabis, a good rule of thumb is to buy from people who look beyond the bottom line.Explore Bon AppétitHealthyishCannabisRead MoreLifestyleBefore You Buy CBD Oil Online, Ask These QuestionsBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Charlotte Palermino"]}