{"id": "5741836ee50d9ea327b15cf502a186af", "url": "https://www.bonappetit.com/story/crispy-goat-meat-road-trip-america", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Searching for Goat Meat on a Road Trip Through Trump Country | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSearching for Goat Meat In Trump CountryThe real discovery of my 16-month road trip across the U.S.: Even the deepest “red” and darkest “blue” states contain endless diversity.By Ashlea HalpernJune 6, 2018FacebookTwitterEmail2015 Onward WestPhoto by Cody JamesFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.In October 2014, I left my job as special projects editor at Bon Appétit to travel the world. What was supposed to be a six-month trip lasted three-and-a-half years and took my partner and me all over Asia, Australia, North America, and the Arctic. For 16 of those 42 months, we crisscrossed the U.S. by car, visiting 40 states and nearly 150 cities in the process.The first time we road-tripped across America, it was early 2016—an election year. But not just any election year. The most divisive election year in U.S. history. We saw a lot of Trump signs. We saw a lot of Bernie signs. We did not see a lot of Hillary signs.The second time we drove coast to coast, from August 2017 to February 2018, Trump was president and a tense new mood gripped the country. Some people were elated, others were devastated. Each time we crossed a new state line, we did a quick mental calculation: red, blue, or purple? Sometimes the billboards and bumper stickers told us; sometimes I had to look it up.But here’s the thing about America: There’s no such thing as a “red” or a “blue” state. From a strategically divisive, vote-counting perspective, sure. But on a multidimensional human level, things are a lot more complex and messy. Politics, like people, are not monolithic, and who we are is not dictated by where we live or even how we vote. Even the deepest “red” and darkest “blue” states contain endless diversity, and as people who fell squarely on the “devastated blue” end of the political spectrum, seeking out that difference, that which disproved the crude generalizations of the electoral map, kept us grounded throughout our travels. And the best way to do that was through food.It’s no surprise that you can find authentic Szechuan in New York City, Indonesian street eats in Chicago, or Yemeni home cooking in San Francisco. What’s more heartening was seeing immigrants set up mom-and-pop restaurants and tiny grocery stores beyond the big, predictable cities. In 16 months of U.S. travel, our most memorable meals included a Bosnian feast in Tucson, Arizona (Chef Alisah’s Restaurant); Afghani food in Fort Collins, Colorado (Maza Kabob); Salvadoran in Lexington, Nebraska (El Rinconcito); Guinean in Lexington, Kentucky (Sav’s Grill); Jordanian in Fayetteville, Arkansas (Petra Cafe); Kurdish in St. Paul, Minnesota (Babani’s); East African in Fargo, North Dakota (Rugsan); Venezuelan in Madison, Wisconsin (La Taguara); Ethiopian in Memphis, Tennessee (Derae Restaurant); and Korean in Anniston, Alabama (Cafe Korea) and Cheyenne, Wyoming (Korean House).One thing we always noticed about these neighborhood eateries was that they weren’t just places to fill your belly; they were community hubs for their respective diasporas. This was where you went to eat the food of your homeland (or your parents’ or grandparents’ homeland), to speak in your native tongue, and to bond over shared history and experience. It’s where you found job leads and babysitters, traded cooking tips, complained about your favorite sports teams, or advertised social events. The atmosphere was convivial, familial. And even though we were clearly outsiders—ethnically, culturally, geographically—we were always welcomed with open arms.Most of these restaurants were family-run affairs. When we stopped for dinner at African Safari Restaurant in Amarillo, Texas, the man running the front-of-house proudly introduced us to his wife of more than 20 years, who handled all the cooking. He spoke in halting English, and we never did catch his name, but we know why he was beaming: Her tender, crispy-fried goat meat, served on the bone atop a bed of spiced basmati rice, was easily one of the best meals we would eat in 2016. The Somali, Sudanese, Kenyan, Ethiopian, and Nigerian men occupying the tables around us also flashed big smiles of approval. We had found their spot.If we’d had more time on the ground in Amarillo, we would have gone back the next day for a breakfast of boiled beef liver with injera and hot tea, but we had so much more to explore. Up and down the mile-long eating corridor of East Amarillo Boulevard were Thai, Vietnamese, Cuban, Salvadoran, and Mexican restaurants. We tucked into a plate of Laotian beef jerky at Ly’s Cafe, bought ingredients to make lahpet thoke (fermented tea leaf salad) at the Burmese grocery store Aye San Bu, and resigned ourselves to adding green “want to go” flags to our Google Map for everything else.These ethnic food hubs popped up time and again throughout the country—along Atlanta’s Buford Highway; in the Gateway District of Las Vegas; in the New Orleans suburb of Gretna; and in the culinary gold mine of Boise, Idaho. (Seriously, you have not lived until you’ve dug into the Eritrean tibs firfir at Kibrom’s, Iraqi lamb qwzi at The Goodness Land, and traditional pintxos at The Basque Market). In Omaha, Nebraska, we hoovered up peanut butter lamb stew with fufu at Chaima African Cuisine, opened in 2012 by a talented mother of four from Togo. Fifteen minutes across town, we shared a delightful wafers-and-buttercream Napoleon torte laced with apricot from Lithuanian Bakery, founded in 1962 by a married couple and now run by their three sons. The two businesses have more in common than either probably realizes. Moving to a foreign country, learning a new language, adapting to a strange culture, putting food on the table for yourself and others—these experiences are universally challenging.It’s worth noting that we didn’t stumble upon these neighborhood-y places and the communities they serve by accident. We sought them out. In what continues to be tumultuous political times (at least in our minds), restaurants like these and the kindhearted people who run them give us hope. They are a reminder of what America was built upon, and that it is the coming together of the stories of real people—in all their beautiful messiness and complexity—that truly makes it great.Ashlea Halpern is a no-longer-nomadic writer living in Minnesota.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Ashlea Halpern"]}