{"id": "574ab14fd679112d87b74f7284050bd4", "url": "https://www.bonappetit.com/story/retro-decal-cups", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Vintage Decal Cups Are the New Cocktail Glass, And We're Here for it | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLife Is Hard. Drink Your Cocktails Out of a Vintage Smurf GlassRestaurateurs are scouring thrift stores and raiding their parents’ attics for retro decal cups—and we are here for it.By Hilary CadiganJanuary 28, 2019FacebookTwitterEmailUndercote in NYC boasts a large collection of vintage glassware.Photo by Laura MurrayFacebookTwitterEmailRemember those jelly jars with the cartoon characters that doubled as juice glasses after you used up all the jam? Man, those were cool. I don’t even like jam but I piled GLOBS of that saccharine sludge onto my toast every morning and night just to complete the Bugs Bunny family reunion that was forming in my mom’s kitchen cabinet. That’s called dedication, folks. That’s called suffering for your art.But unlike many of my childhood pleasures—like forcing my little brother to play “school” until he cried or organizing stickers by type with the fastidiousness of a serial killer—my love of glasses with pictures on them remains fully intact. Even today, with 31 years to my name and a tired old heart full of dust and sand, these babies still spark joy.But I’m not the only one feeling nostalgic. Lately, my colleagues and I have noticed these kitschy-on-purpose throwbacks showing up in bars and restaurants across the country, from L.A.’s Ronan to Atlanta’s 8arm. So we called up the owners to talk about their collections, how they acquired them, and the fuzzy feelings they dredge up in times that are bleak.The staff at Ronan in LA spent two years collecting vintage glasses like this one from local flea markets while they worked on the restaurant's buildout.\n“Decal glasses take me back to Saturday morning cartoons,” says Victoria James, beverage director at Undercote in NYC. “If a glass can bring you back to your childhood, well, that’s certainly a good feeling for a cocktail.” She and her team traveled upstate to build their collection, which now includes more than 20 types of glassware, from sculptural tea cups to ’80s-era Smurf glasses. “We found some at an old yard sale and sent a picture to the group like, ‘Are these cheesy?’ And everyone responded, ‘No! Those are great. You HAVE to get them.’”Mason Hereford, owner of Turkey and the Wolf in New Orleans, credits his mom for discovering the motherlode (heh heh) at a junk shop in Greenwood, Virginia—including a Camp Snoopy cup from McDonald’s and a Return of the Jedi promotional glass dating back to 1983. “We love them because they match the fun, hodgepodge, easygoing nature of our restaurant,” he says. As someone who once collected so many McDonald’s Happy Meal toys that I eventually made $2 selling them for a penny each at the local playground, I can relate.Safta's rosebud glasses bring grandma-friendly vibes to the industrial Denver restaurant.\n“My grandmother, my mom, and I have all been collecting vintage glassware for years,” says Emily Shaya, co-owner of Safta in Denver. The modern Israeli restaurant has industrial vibes, but Shaya says the midcentury rosebud-printed glassware she found for serving drinks lends a special kinda warmth. “They’re inspired by the cups my husband [co-owner Alon Shaya] grew up seeing in his grandmother’s home.”Andrea Carr of re.Find Vintage has been more successful than I in the secondhand game, and now makes a living selling antique barware to restaurants like Yellow Door Taqueria in Boston. She says stocking your cabinets with decal glasses is easy; they’re both plentiful and affordable at thrift stores across the country, and shouldn’t cost more than about $5–$10 each (though complete sets and rarer collections will run higher). For first-timers seeking a more targeted selection, the internet reigns supreme. Typing “vintage decal glasses” into Etsy or eBay will bring up an array of options, and Carr also recommends online shops like Amy’s Vintage Decorium or itsnotjustcocktails.com.The vintage leopard glasses at Rita in Brooklyn came from a thrift store upstate.\nMary Ellen Amato, owner of Rita in Brooklyn, says that her vintage glasses are both the cheapest and most-loved purchase she’s ever made for the cafe. “After spending my entire life savings opening up a restaurant, I was broke,” she recalls. One weekend, she closed down and headed upstate to her parents’ place for a break. “I wandered into a very old-school thrift store, and there, I saw them—safari-themed with leopards. The older woman working behind the counter was so thrilled to get rid of the ‘ugly cups' that she threw in a free James Taylor cassette tape as a thank you.”And that, folks, is called the life-changing magic of decal glasses.Explore Bon AppétitRestaurantsDesignRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-28", "author": ["Condé Nast", "Hilary Cadigan"]}