{"id": "574dbd84b18ad96cd07ff85af9181667", "url": "https://www.bonappetit.com/recipe/jalebi", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Jalebi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJalebiBy Mehreen KarimDecember 7, 20214.1(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintAs a child, I would watch in wide-eyed wonder as my mom lifted one jalebi after another out of the frying pan, forming mouthwatering piles of orange spirals. Nothing beats gathering loved ones around a mountain of these freshly fried treats and biting into the hot chewy-crispy swirls straight out of the fryer.These South Asian treats look intimidatingly beautiful, but jalebi are simple to make. Don’t let the deep-frying deter you—wintery days are the ideal time to turn on the stove and go on a jalebi journey. The urad dal (ivory white lentil) powder in the batter helps the jalebi stay crisp no matter how long they soak in the cardamom-rose syrup. Not a fan of rose? Feel free to flavor your syrup with warm spices or some orange-flower water. Whatever you do, just don’t forget the lemon juice; it prevents the syrup from crystallizing while your jalebi soak it all up. —Mehreen KarimAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonDeep-Fry Thermometer$29 $16 At AmazonSlotted Spoon$13 $10 At AmazonIngredientsMakes 25–30¼cup raw pistachios4Tbsp. urad dal1cup (125 g) all-purpose flour½tsp. baking powder2Tbsp. melted ghee or clarified butter2cups (200 g) sugar3cardamom pods, lightly crushed4saffron threads (optional)¼tsp. rose water (optional)Pinch of kosher salt2Tbsp. fresh lemon juice2½cups vegetable oilSpecial equipmentA deep-fry thermometerPreparationStep 1Toast pistachios on a rimmed baking sheet, tossing halfway through, until golden brown, 10–13 minutes. Let cool, then finely chop.Step 2Process or blend urad dal in a food processor or blender to a powder (some grainier pieces will remain). Transfer urad dal powder to a large bowl and whisk in flour, baking powder, and ghee. Whisking constantly, gradually pour in 1 cup water; whisk until no large lumps of flour remain. Batter should be viscous. Add more water 1 Tbsp. at a time (up to 5 Tbsp.), whisking constantly, until batter is smooth and falls off the whisk in a long ribbon that slowly dissolves on surface of batter. (You will still have some small, granular lumps of dal.) Transfer batter to a piping bag fitted with a ¼\"-diameter tip (or, use a gallon-size resealable plastic bag with a corner cut off to make a ¼\" opening or a squeeze bottle).Step 3Bring sugar, cardamom, saffron (if using), rose water (if using), salt, and 1¼ cups water to a rolling boil in a medium saucepan over medium heat. Reduce heat to low and simmer until syrup coats a spoon, 5–7 minutes. Remove syrup from heat and stir in lemon juice; set aside.Step 4Fit thermometer to a medium Dutch oven or other heavy pot. Pour in oil and heat over medium until thermometer registers 350°. Squeeze a drop of batter into oil. The batter should immediately start to bubble and rise to the surface, but if the batter browns immediately, the oil is too hot. If the batter drops to the bottom of the pot, the oil is not hot enough. Adjust heat as needed. Once oil is ready, carefully squeeze batter into oil to create a 2\"–3\"-wide spiral, starting from the outside and circling in. To keep jalebi from sticking together, squeeze no more than 3 spirals into pot at a time. Fry until golden brown, 2–3 minutes, then turn over and fry on other side until golden brown, 2–3 minutes. Using a slotted spoon, transfer jalebi to reserved syrup and let soak 3–5 minutes. Remove soaked jalebi from syrup and place on a platter. Repeat process with remaining batter, squeezing the batter of your next batch into oil while the previous batch is soaking in the syrup. Sprinkle pistachios over jalebi and serve warm.How would you rate Jalebi?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleWhen I told my parents I wanted to make jalebis from scratch they were skeptical. But this recipe was easy to follow and yielded tasty results. We omitted the pistachio garnish and they felt like ones I'd eaten on the streets of New Delhi!T1/18/2022Explore Bon AppétitIndianSouth AsianAsianDessertDeep-fryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-07", "author": ["Condé Nast", "Mehreen Karim"]}