{"id": "575f7f3c86875db0b3fc0b2af2406b81", "url": "https://www.bonappetit.com/story/food-people-trailer", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Food People Trailer: The New Bon Appétit Podcast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGet a Sneak Peek at Our Brand-New Podcast, Food PeopleNew podcast alert! Catch the trailer for our new show, Food People, launching next week. By The Bon Appétit StaffAugust 19, 2021FacebookTwitterEmailFacebookTwitterEmailHere at Bon Appétit we've never really warmed to the word foodie. It's always just felt a little, I don't know, cheugy? We're more than just foodies, dammit! We're food people. When we decided to launch a new podcast, we knew we wanted to have the whole staff involved as contributors, as well as friends beyond the brand who care about food as much as we do. And when we thought about how to sum up the spirit of the show, no other name felt as right as this one. So welcome to Food People, a show from Bon Appétit made by, for, and about people who love food. Each week BA’s editorial director, Amanda Shapiro, will ask a serious or not-so-serious food question: What’s the best way to grill chicken? Can meal prep be less terrible? Are air fryers worth the hype? In search of answers or at least a spirited debate, she’ll bring in staffers, chefs, writers, and experts from across the culinary universe. Editor in chief Dawn Davis will step in regularly to interview a guest who inspires her in the kitchen. There will be strong opinions, tons of recipe inspiration, and probably more food puns than we'd like to admit.Give a listen to the trailer below and make sure to subscribe to get the first episode next week; episodes will be every Thursday after that. Subscribe here, or listen wherever you get your podcasts.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitPodcastsRead MorecultureFood People: A New Podcast From Bon AppétitBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "The Bon Appétit Staff"]}