{"id": "57752698713d299896487980c6aee6f6", "url": "https://www.bonappetit.com/story/depression-stole-my-sense-of-taste", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Depression and Anxiety Stole My Sense of Taste. Here’s How I Got It Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDepression Stole My Sense of Taste. Here’s How I Got It BackWithout the joy I used to feel at dinnertime, I no longer felt like me.By Rachel ZarrowApril 14, 2021FacebookTwitterEmailIllustration by Jessie WongFacebookTwitterEmailOn a cool morning last October I wiped the very real and very nasty cobwebs off my deck furniture and prepared for a socially distanced get-together. Two of my childhood best friends from Oklahoma had also ended up in northern California and we were eager to reunite—outdoors, of course, leaving room for Dr. Fauci between us.Out on my deck Annie and I sampled a jar of fiery chile crisp Genevieve had brought over. We marveled at the smoky flavor and, after a beat, Annie raised her eyebrows and said, “What else do you have?” We all knew that if we weren’t living through a pandemic, she’d already be inside, rummaging through my fridge, just as we had in each other’s childhood homes, then dorm rooms, then apartments.Like a server presiding over a tasting menu, I was soon flitting between my kitchen and deck, surprising my friends with samples of home-brewed kombucha, a spicy whole grain mustard, and my favorite chocolate ice cream topped with homemade chocolate crispies. It wasn’t as intimate as being in the kitchen together, but it was the best we could do.We’d already lost so much during the pandemic: loved ones who’d died, funerals we’d missed, celebrations we’d cancelled. I didn’t yet grasp how sharing a meal with friends could be one of my deepest sources of joy—until that joy disappeared.When the world shut down last year, I (like many others) started to cook with new fervor. My life has always centered around food. As a child I used to sneak bites of raw cookie dough when my mom’s back was turned (salmonella be damned). I baked my way through high school and college, and in the years since, when I wasn’t working in the food and beverage industry, I became the go-to friend for cookbook recommendations and kitchen tips. So during an unprecedented global catastrophe, I did what any person in my position would do: I cooked.First, I joined the masses and made sourdough. Then I turned that sourdough into croutons. I meal-planned according to the season: eggplant parmesan in the summer, potatoes every which way in the winter. I baked ladyfingers to layer into tiramisu. I tried my hand at pickling, pressure-cooking, and braising. I documented every detail on Instagram, referring to my kitchen’s “private restaurant” as The Social Distance Table. And for months all this activity buoyed me.Shortly after our tasting menu on the deck, COVID-19 infections spiked and I stopped seeing friends, even outside. Following local guidelines, I cancelled holiday plans. My partner and I scattered festive decorations around our living room, but the loneliness of the pandemic cast a shadow over the sparkly tinsel and glimmering menorah. My spirits dwindled, The Social Distance Table shuttered, and I dreaded entering the kitchen.My problem, I realized, was that I no longer derived pleasure from food. Whether I spent two hours preparing a feast or 15 minutes making pasta with jar sauce, I felt exactly the same after eating. Which is to say, I felt nothing.I had an appetite, I ate, I got full. But I had lost the one consistent thing I looked forward to each day: preparing dinner and enjoying the fruits of my labor. As someone who worked from home, with access to food and other creature comforts, I knew things could be much worse. I didn’t have COVID-19; my senses of smell and taste remained intact. I had an appetite, I ate, I got full. But I had lost the one consistent thing I looked forward to each day: preparing dinner and enjoying the fruits of my labor. Without the joy I used to feel at dinnertime, I no longer felt like me.According to the New York Times Magazine, people suffering from depression can experience a decreased sense of smell; given that smell and taste are linked, I wondered if my mood was altering my senses. Over the course of the pandemic, for U.S. adults anxiety and depression symptoms had respectively tripled and quadrupled. I was diagnosed with generalized anxiety disorder as a teenager, so it seemed plausible that I might now be suffering from depression. But then it occurred to me that I’d experienced a similar numbness before.Eight years ago I tried to cook my way out of another impossible situation. My dad had been diagnosed with cancer and was struggling with chemo-induced nausea. His voracious appetite, once a thing of family lore, had vanished. With naive optimism, I loaded butter and cheese into his scrambled eggs, hoping the decadence might spark interest and sustain him. As I watched him push the eggs around on his plate, I found that I could no longer enjoy eating either.Of course, no amount of cooking could change the outcome. My dad passed away and, in the wake of his death, I struggled to regain my footing in the world. I sought comfort in therapy, swimming, anxiety meds, and holistic remedies. Six months later I graduated from college—my first milestone without my dad. The one thing that kept me from falling apart during the ceremony was a road trip Genevieve, Annie, and I had planned, driving from California to Washington State.While hiking in a redwood forest, we discussed our hopes for what lay ahead: dream careers, families, and homes. That I’d been able to think about my future after such a devastating loss seems, in retrospect, like a miracle. But these friends had always weathered the worst with me. As 2020 wore on, and almost all in-person interactions disappeared, I dreamed of exploring the coast with my friends. And though I couldn’t recall when exactly I rediscovered the joy of eating after my dad died, I suspect it happened on that road trip.During lockdown I needed to recover the pleasure of food on my own. I turned to my usual mental health strategies to ease my depression and anxiety. When that didn’t rekindle my joy in food, I tried to shock my taste buds into submission with wild card snack suggestions from friends (dill pickle potato chips, cheeseburgers, chocolate milk). Nothing seemed to work.Then, on a foggy December day, before my county reissued a stay-at-home order, Annie and I met for a hike. I told her how, since that day on my deck, I’d been having trouble experiencing any pleasure from cooking and eating. As we followed a trail under the towering redwoods and fragrant eucalyptus, we discussed a working theory: the same way you can’t tickle yourself, perhaps you can’t surprise your own palate when you’re doing all the cooking.Once we reached the parking lot, Annie retrieved a jar from her car. “I have a new taste for you,” she said, offering me a spoonful of something golden-hued and gooey.I closed my eyes and let the sugar crystals dissolve on my tongue. I’d never tasted anything like it—luscious, sweet, and slightly spicy, like the first bolt of lightning in a summer rainstorm.“Turmeric and black pepper honey,” Annie said with a grin.Walking back to my car, I thought about that West Coast road trip and all the stops we made along the way, for ice cream cones, wild berries, smoked salmon, and pizza by the slice. I was still reeling from my dad’s death, yet I’d managed to restore some part of who I was before, in the company of my friends.Grief is never linear. But with the passage of time and the communion of close friends, pleasure can and will return. As I drove home I thought about Annie and the surprising taste she’d introduced me to and the hint of joy that seemed to imply for the future. I thought of all of us reunited, the new foods we’d try, the exciting restaurants we’d visit together, out there in the world beyond my deck.Explore Bon AppétitessayRead MoreLifestyleHow Writing a Cookbook Helped Me Break Free From Diet CultureBy Julia TurshenLifestyleI Left Dancing for Food…And Found Love Along the WayBy Phyllis GrantRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-14", "author": ["Condé Nast", "Rachel Zarrow"]}