{"id": "577713e7674df35c041bb1bf08008e76", "url": "https://www.bonappetit.com/recipe/spicy-and-sour-stir-fried-potatoes", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Spicy and Sour Sichuan-Style Stir-Fried Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy and Sour Stir-Fried PotatoesBy Hetty McKinnonNovember 9, 20215.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrint\"Serving stir-fried potatoes with rice defies culinary logic for some, but it should come as no surprise that this carb-on-carb union offers a meal high in both comfort and happiness. Across Asian cuisines potatoes are frequently enjoyed with a bowl of rice: There’s the Tibetan dish alu sipsip, which features shredded potatoes stir-fried with green peppers; the homestyle Korean banchan gamja bokkeum, a similar dish of pan-fried potato strips; and there are myriad Indian stir-fried potato dishes.This recipe is based on the Sichuan dish qiang chao tu dou si, shredded potatoes stir-fried with chiles and Sichuan peppercorns and finished with sharp black vinegar (though it’s worth noting that stir-fried potatoes in various preparations are eaten throughout China). It may sound counterintuitive to talk about crisp-tender potatoes, but that’s exactly the result you're looking for here. Stir-frying the potato strips will temper their raw bite, but they should retain some defined crunch. Slice the potatoes as uniformly as possible to ensure they cook evenly and give them a quick soak to wash away some of the starch to encourage crisp sticks rather than gluey ones. This dish can be made with any type of large potato—quick cooking at high heat means that even starchy potatoes like russets won’t fall apart.\" —Hetty McKinnonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBenriner Mandoline Slicer$80 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings1¼lb. large potatoes (any kind), peeled2Tbsp. vegetable oil4small dried chiles (such as er jing tiao or chile de árbol), torn, seeds removed if desired, or 1 tsp. crushed red pepper flakes1tsp. Sichuan peppercorns4garlic cloves, coarsely chopped2scallions, thinly sliced1Tbsp. plus 1 tsp. black (Chinkiang) vinegar1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher saltSmall handful of cilantro leaves with tender stemsSteamed white rice (for serving)PreparationStep 1Cut a thin slice from base of each potato. Stand potatoes on flat bases and slice lengthwise into ⅛\"-thick planks. Working with a few planks at a time, stack potatoes and slice into long ⅛\"-thick matchsticks. (Alternatively, use a mandoline fitted with the julienne attachment.) Place in a large bowl and pour in cold water to cover; let soak 10 minutes. Swish potatoes around with your hands to release some starch, then drain well and pat dry.Step 2Heat oil in a large skillet or wok over medium-high. Cook chiles and Sichuan peppercorns, stirring constantly, until aromatic, about 1 minute. Add garlic and cook, stirring, until fragrant, about 20 seconds. Immediately add potatoes; cook, tossing constantly, until potatoes are wilted and crisp-tender but not browned, about 5 minutes. Remove from heat and stir in scallions, vinegar, and salt.Step 3Transfer stir-fry to a plate and top with cilantro. Serve with rice.How would you rate Spicy and Sour Stir-Fried Potatoes?Leave a ReviewTell us what you thinkExplore Bon AppétitSichuanPotatoVegetableStir-FryWeeknightEasyVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-09", "author": ["Condé Nast", "Hetty Mckinnon"]}