{"id": "577d4c6e424439b92b39c6773beb9336", "url": "https://www.bonappetit.com/story/gorgonzola-cheese-dip", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "This 2-Ingredient Cheese Dip Is the Easiest Thing I’ve Ever Seen a Chef Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 2-Ingredient Cheese Dip Is the Easiest Thing I’ve Ever Seen a Chef MakeWhen chefs say “easy,” they usually mean “excruciatingly difficult”—but not this time.By Amiel StanekApril 27, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott. Prop Styling by Kalen Kaminski.FacebookTwitterEmailHaving spent quite a bit of time over the last few years asking chefs how to recreate restaurant dishes at home, there is one word that always raises a red flag: “just.” I’ve usually asked them to describe the process behind some delicious and seemingly-simple item on their menu, crossing my fingers in hopes that it is every bit as straightforward as it seems—the kind of thing that our test kitchen could transform into a plainly-worded, not-too-complicated recipe that you, dear reader, could recreate at home—when that word comes out of their mouths, and I fight to keep from rolling my eyes.“Okay, you just brine the chicken for three days, drain it, vacuum seal it, cook it sous vide for 15 hours at 145°, rub it with our signature 100-spice blend and then simply grill it over cabernet vines—even your dad could make it!”“So easy! Just combine some of last-season’s dehydrated-and-powdered fermented Jimmy Nardello peppers with whatever leftover house-made sheep's milk farmers’ cheese you have lying around, drizzle a bit of black garlic honey over top, a sprinkle of dill pollen, and you’re good to go—the perfect throw-together appetizer!”You get the idea.Which is why, when I was in Italy reporting the “Summer Like an Italian” story for our May issue last summer, I almost didn’t even bother to ask what was in the insanely-delicious, creamy-funky-sweet gorgonzola cheese dip that chef Ignacio Mattos had set out on the table. We had our recipe lineup set already, and there wasn’t room for the dip, so what's the point in asking? But after spending a half hour hovering over the bowl like a vulture, plunging snap pea after snap pea after potato chip after grissini into the stuff, I caved.“Ignacio, what is this stuff?!” I asked breathlessly, my mouth still full.A little beleaguered after a long day of cooking for all of us, he drew a deep breath and said the word: “Oh, it’s easy, you just...” He paused—I assumed because the process was so complicated that he needed to collect himself before detailing it to me—and then continued. “You just put some gorgonzola dolce in a bowl and thin it out with a little heavy cream. Mash it up with a spoon. That’s it, pretty much.”I was baffled, but also skeptical. How could something so complex and delicious be so simple to make? And also: the words “pretty much” weren’t sitting well with me. “Are you sure that’s all it is?” I asked.“Oh, I think I added a little salt. And I drizzled a little olive oil on top at the end because it looks nice.”And that really was it. I know, because I made him make another batch to prove it. (And because I had eaten most of the bowl.) Mattos took a wedge of gorgonzola dolce—a creamy, relatively-mild cow’s milk blue cheese with a texture almost like soft cream cheese—plopped it in a mixing bowl, and started to mash it up with a spoon. He drizzled in a little bit of heavy cream in at a time, stirring vigorously in between additions, until the mixture was the consistency of yogurt. He tasted it, added a pinch of salt, stirred again, and poured it into the serving bowl that I had almost single-handedly emptied. A drizzle of olive oil on top. Done and done.A wedge of gorgonzola dolce, which you can find on Amazon Fresh.\nlafromagerie.co.ukI’ve served this dumb-simple dip many times since, and it has never let me down. It’s the perfect accompaniment to a platter of otherwise-virtuous cut vegetables, a killer dressing for an Italianate wedge salad (sub pancetta for the bacon if you’re feeling fancy), and absolutely slays with chicken wings. And if it has taught me anything—other than the fact that sometimes chefs actually do make simple food—it’s that, by and large, my own friends often regard my cooking with the same eye-rolling skepticism that I have for the chefs I’m so often trying to pull information out of. But seriously: This one actually is that easy. Just sayin’.Read more: How to Drink and Snack Like an Italian on VacationThis is part of our May travel issue, devoted to Italy, subscribe here.Explore Bon AppétitCrudite DipDipGorgonzolaCheese WeekItalyRead MorecultureHow to Drink and Snack Like an Italian on VacationBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-27", "author": ["Condé Nast", "Amiel Stanek"]}