{"id": "579227e72186c967931f5b933c117059", "url": "https://www.bonappetit.com/story/i-bought-too-many-vegetables", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "I Bought Too Many Vegetables | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Bought Too Many VegetablesHere's how I used up (almost) every single thingBy Christina ChaeyApril 11, 2020FacebookTwitterEmailPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,Last weekend, I made the mistake of going on my weekly grocery shop on an empty stomach after a 30-mile bike ride. I walked out with six bunches of greens, a giant head of cauliflower, a butternut squash, a bag of cucumbers, four sweet potatoes, four Yukon gold potatoes, a couple of heads of lettuce, herbs, and entirely too many scallions. Whenever I accidentally buy a glut of fresh vegetables without a plan, I try not to worry about it too much: I just make sure to wash and prep as many of them as possible, make an exciting sauce (more on that below), and trust that dinner inspiration—not to mention breakfast and lunch inspiration—will come later. And here I am, at the end of the week, with just a nubbin of cauliflower and a couple of cukes left. Victory! Here, a vague sketch of how I ate my way through that vegetal mountain this week:Store It ProperlyThese days, I have zero excuse to put off the tasks I usually “don’t have time for” e.g. hand-washing my delicates, flossing, and properly washing/drying/storing all my produce. By now, I’ve gotten into a cadence: As soon as I get home, I’ll quickly scrub down my sink and let it fill up with cool water as I unbag my groceries. Everything that needs a good rinse and/or scrub (stemmed greens, herbs, radishes, celery, carrots) goes in the bath at once. I’ll pat the sturdier produce dry, wrap them in damp paper towels, and store them in reusable plastic bags; my celery’s going on a month now. I spin the greens and herbs dry using my large salad spinner, then pile them on a large rimmed baking sheet lined with a clean towel to soak up extra water before bagging those up with paper towels, too. This prep is the single most important thing I do to ensure that cooking for myself remains an exciting endeavor, rather than a chore.Photo by Christina ChaeyMake One Very Good SauceI almost always seem to end up with a few slimy scallion casualties that I have to throw away. So, in an attempt to cheat time, I turned most of my scallies into a half-batch of Francis Lam’s Caramelized-Scallion Sauce, which can live in the fridge for up to two weeks, though I already know it will be gone (i.e. in my belly) long before then. In the interest of cutting down on food waste, I also threw in a few chopped-up fennel stalks (the celery-like stems that grow atop the white bulb) and some grated ginger. I’ve been mixing the resulting deeply savory and complex condiment into just about everything: cauliflower rice with a smattering of herbs; noodles with braised tofu and tiger salad; simply cooked fish and greens.Put Vegetables In...EverythingWith a bit of planning, I managed to slip an extra serving or two of veggies into almost every meal I cooked this week: I mixed my usual brown rice with its cauliflower counterpart; I made a batch of butternut-squash-and-carrot-stuffed muffins for local NYC hospital workers; I ate salad for breakfast (with fistfuls of whole herbs) with my morning eggs, a move inspired by the dreamy breakfast plate at Ochre Bakery in Detroit. I revisited my favorite vegetarian cookbooks, like Meera Sodha’s Fresh India, and rediscovered my love for her spicy and herbaceous Goan Butternut Squash Cafreal (the original inspo for this squash recipe).Photo by Christina ChaeyThe “ish” in “Healthyish”I digress from the vegetable content to make a brief plug for BROWNIES, a criminally underappreciated quarantine baking project. I made a batch of BA’s Best Cocoa Brownies (and copped the tahini swirl from these gluten-free favorites) and, like that scallion sauce, I suspect they’ll be long gone by the time you get next week’s newsletter. Luckily, I remembered to stock up on cocoa powder.Eat your vegetables (and your brownies too),Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?VegetableessayRead MoreLifestyleThese Are a Few of My Favorite FatsBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-11", "author": ["Condé Nast", "Christina Chaey"]}