{"id": "57932bc02d6dfcb2badb18e4d7fce04e", "url": "https://www.bonappetit.com/story/swiss-chard-dip-maydan", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "This Swiss Chard Recipe Makes the Best Healthy Dip | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Ate This Swiss Chard Dip for Dinner and Feel Great About ItDip for dinner is the best thing to happen to Monday nights.By Carey PolisAugust 27, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole HerriottFacebookTwitterEmailI fell deeply for this swiss chard dip at Maydan in Washington D.C., recently named no. 2 on our 2018 Hot 10 list. It was the kind of meal that was so good that I left in physical pain because of the volume of food consumed—seared halloumi, lamb skewers, just-from-the-oven flatbread, lemony cabbage, grilled squid, and at least a half dozen other things.But the dish that I was still thinking about the next day was what sounded the most banal: the swiss chard dip. A puréed mix of greens, tahini, lemon juice, lots of garlic, and salt. It had none of the bitterness normally associated with chard, and it was a welcome, bright addition to the table amongst so many meats and sauces. I announced to my dinner dates that I wanted to re-create it at home; at that time (pre-Hot 10 announcement), I hadn’t realized that Bon Appétit had already developed the recipe, and it was available on our internal servers.So, as an early celebration (uh, with myself), the day before we revealed the Hot 10, I made Maydan’s dip in my un-air conditioned kitchen in the middle of August, loosely channeling the heat of cooking over the hearth in the restaurant as both the greens and I sweated over my stove’s flame.Here‘s how a hardy green gets turned into such a smooth and robust dip:The chard is cooked down for at least 10 minutes so it gets wilted and tender.Ditto with the ribs and stems—they are cooked until softened so that there are no tough bits.Once the leaves, ribs, and stems are cooked, you must wait until they are cooled. Then, you squeeze out any remaining liquid and set aside. While you may eventually add some of the liquid back in to thin out the dip, not adding too much allows for a more concentrated chard-y, tahini-y flavor.The not-watery chard is then put through a food processor for up to 5 minutes (along with some tahini, garlic, lemon juice, and salt). The goal is to chop the chard up so finely that only speckles remain. There should be minimal stringiness.Olive oil is really on your team here—you use a total of ⅔ cup (half for cooking and half for puréeing), plus even more for drizzling. You need all this fat: It gives everything body.The whole process can take shy of an hour, including allowing for time for the cooked chard to cool. That time commitment is about all I allow for when cooking weeknight dinners. Meaning, yes, my Monday night dinner was definitely a bowl of dip, a glass of Vermentino, and plenty of crackers. It was excellent. And a little sweaty.Get the recipe:Swiss Chard–Tahini DipIf you love hummus or baba ganoush, this dairy-free dip will become a new favorite.View RecipeExplore Bon AppétitDipchardTahiniHot 10 2018appetizerHot 10Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-27", "author": ["Condé Nast", "Carey Polis"]}