{"id": "57973494b32a89a596f9ff31a8bc4f0e", "url": "https://www.bonappetit.com/recipe/stovetop-spinach-artichoke-dip", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Stovetop Spinach-Artichoke Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStovetop Spinach-Artichoke DipBy Molly BazJanuary 28, 20194.6(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintServing this creamy, delicious dip in a bread bowl is not mandatory, but we highly recommended going for it. If you’re not making the bread bowls (this time), just skip ahead to the dip instructions below and serve with pita chips alongside!IngredientsMakes about 5 cupsBread Bowl1large sourdough boule or other round country loaf (about 10\" in diameter)5Tbsp. extra-virgin olive oil, dividedKosher saltSpinach-Artichoke Dip4Tbsp. unsalted butter6garlic cloves, finely grated215-oz. cans artichoke hearts, drained, quartered10oz. baby spinach or frozen chopped spinach, thawed1½tsp. (or more) kosher salt16oz. cream cheese, cut into 1\"-thick slices3½oz. finely grated Parmesan (about 1 cup), plus more1tsp. freshly ground black pepper, plus moreChips (for serving; optional)PreparationBread BowlStep 1Preheat oven to 350°. Using a serrated knife, cut about 1\" off top of boule.Step 2Using your hands, scoop out bread from the inside of the loaf, leaving about a 1\" -thick wall all around. Tear bread and top slice into 1½\" pieces. Place torn bread and bread bowl on a rimmed baking sheet, discarding any small crumbs. Toss torn bread with 3 Tbsp. oil and season with salt. Coat inside of bread bowl with remaining 2 Tbsp. oil.Step 3Bake until edges of bread bowl are golden and crisp and torn pieces are browned, 25–30 minutes. Let cool.Spinach-Artichoke DipStep 4Melt butter in a large saucepan or Dutch oven over medium heat. Add garlic and cook, stirring often, until very fragrant but not browned, about 1 minute. Add artichokes and cook, tossing, until well coated in butter, 1–2 minutes longer. Add spinach and salt and continue to cook, stirring and folding often, until spinach has wilted and most of the liquid is cooked off, 7–8 minutes. (It’s okay if the bottom of the pot isn’t completely dry. It just shouldn’t be swimming in liquid.) Add cream cheese and cook, stirring constantly, until melted. Add 3½ oz. Parmesan and 1 tsp. pepper and stir until melted and creamy. Taste and season with salt if needed.Step 5Transfer dip to bread bowl. (If it doesn’t all fit, serve remaining dip on the side or refill bread bowl as it gets eaten.) Top with Parmesan and a crank of pepper. Serve with toasted bread pieces or chips of your liking—don’t snooze on Stacy’s pita chips if you can find them.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Stovetop Spinach-Artichoke Dip?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleA delicious, easy recipe the whole family enjoyed!  To celebrate Mother's Day, I decided to make Mom a throwback 1960s/1970s dinner utilizing her favorite recipes. One of the recipes she always loved was her artichoke dip but this updated recipe takes the dip to a whole new level of excellence and she truly loved it...and so did the rest of the family. Thank you!KarenLos Angeles5/12/2021This was SO good!! Made it for a super bowl party we went to and it was DEF a hit! So so good I had to make it again just for myself! Lol. Yummy! Will save this one! Made the exacpt recipe with frech spinach and Vigo canned artichoke. Danielle2/14/2021Molly , love your recipes and those from the Bon Appetit website !  Given we use the  metric weights and measure system, and whilst I  have to convert weights & temperatures for your recipes,   this is no  bother, given your wonderful  tasty recipes and informative and entertaining videos..  Here in the land down-under (as we call our country) Australia, similar recipes were very popular in the seventies and eighties and have regained popularity of late during our COVID19 lockdown and the months that have followed! \n\nThe bread we use is called a \"cob loaf\" and after removing the top and inner bread from the loaf, we  mix  the ingredients,  place the dip mixture back in the loaf, put the bread lid back on and cook the loaf in the oven for about 20min at 180C (360F).  Caution - if using frozen spinach, one needs to squeeze and remove excess water before adding to the mixture.   We  also use \"French\" bread sticks slices, oven baked until crisp to use to dip!  A very old but tasty recipe that has re-emerged post COVID19  uses softened cream cheese, frozen spinach, add ingredients from packet French onion soup, chopped  drained can of water chestnuts for texture and  tasty grated cheese.  Allowing this  mixture to stand  in refrigerator overnight,  prior to adding to the bread loaf enhances the flavours!  Yummo!  I do intend however intend using your  recipe and method for our next scheduled \"happy hour\" . Stay safe everyone  and again thanks \n\n\nMazza BarrySunshine Coast , Queensland, Australia1/16/2021Super delish and simple. This recipe is super easy to make with very little steps. I usually half the recipe when I'm making it for only a few people, or just myself :) This was my second time making it and it's better than I remember. I also like that this recipe requires few ingredients, making it likely that I already have all the ingredients at home.AnonymousMilwaukee, WI10/23/2020Super creamy, rich and delish. Delightful presentation in the toasted bread bowl but found myself perfectly happy just dunking ritz crackers into this dip! Can’t wait to make again for a party app. Nailed this one, Molly!lexilou8Coeur d’Alene5/3/2020The bar food ideal of spin-artichoke dip—and the recipe is easy to halve if you're making for 2-3 people who just want dip for dinner... alexbeggsBon Appétit 4/10/2020Fantastic! But I did only one box of 8oz cream cheese and add about 4oz of mozzarella, tasted amazing! Nat.gisslleNy 12/31/2019Made this using a Hawaiian Sweet Bread bowl.  It was a big hit!CleverUserName11/27/2019I just made another bread bowl recipe that called for slicing the sides of the bowl partially down, every inch or so, to give you even more bread to use to scoop up the dip. It worked out really well, and I think I would do that here as well. Can't wait to try this dip, especially based on the comments. Keep up the good work, BA!!klgray125Knoxville, TN 10/19/2019I absolutely love this dish- the perfect appetizer (replace the bread and go for salty chips instead) !!  I really enjoyed the preparation as you could see the dip becoming more and more delicious with every new ingredient. I had to force myself to put it in a tuppaware, place it in the fridge (still hot, I know..) and walk out of the kitchen. Otherwise my friends would of been deprived of this tastebuds experience tonight. Atleast I already know on what corner of the table I'll be sitting tonight during appetizers.AnonymousBrussels, Belgium8/22/2019Love this dip! Delicious and addictive. Very easy to make. Didn’t bother with the bread bowl. Can’t wait to make it again!!AnonymousCT2/4/2019Super easy way to make a tasty dip and look like a proAnonymousNew York2/3/2019Love this dip and so easy to make - I didn't change a thing. Made it for a party on Friday and it was gone almost before I put it out!! I so wish people would stop writing reviews for recipes they never made!!!!!Wisconsin2/3/2019I literally just pulled this off the stove and I can’t stop eating it! It might not make it to the Super Bowl tomorrow if I don’t put my spoon away. Definitely five stars without need for modifications.bstevens94Wenatchee WA2/3/2019I have not yet made this, but will with a few changes. I would use shredded parm, parley and perhaps a bit of nutmeg. I would also add aa bit of garlic and onion powder for the croutons. I'll check back to see what others think!kat_madd_coUSA2/1/2019Explore Bon AppétitDipCondimentArtichokeVegetableSpinachLeafy GreensCream CheeseCheeseSnackStarterNut-FreeVegetarianSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-28", "author": ["Condé Nast", "Molly Baz"]}