{"id": "579af187235be0799490b4cc4712eb10", "url": "https://www.bonappetit.com/story/what-we-lost-david-mcatee", "year": 2020.0, "month": 6.0, "day": 4.0, "content": "What We Lost When We Lost David McAtee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat We Lost When We Lost David McAteeI’ve spent the past six years of my life trying to prevent Black barbecue stories from ending up in the cemetery. But I missed my opportunity with YaYa’s.By Howard J Conyers, PhDJune 25, 2020FacebookTwitterEmailPhoto by Brett Carlsen/Getty ImagesFacebookTwitterEmailTwo days after Mardi Gras, just before COVID-19 shut down the whole country, I found myself in Louisville, Kentucky. As a scholar of the Black barbecue tradition birthed by our people’s long farming history, I was there to attend an agricultural workshop and hopefully squeeze in a few good meals. But now, looking back, I am most struck by what I did not do, which was visit David McAtee’s barbecue stand on a busy street corner in the city’s West End.Due to the lack of coverage of Black pitmasters in mainstream food media, I had never heard about YaYa’s BBQ. I had never read a review of David’s ribs and hot links in a national newspaper or magazine. Never witnessed the positive work David was doing in the community—how anybody who stopped by his corner, whether they had enough money or not, came away with a plate. I’ve spent the past six years of my life seeking out unknown Black barbecue spots, trying to capture the oral histories and prevent yet another Black barbecue story from ending up in the cemetery. But I missed my opportunity with YaYa’s that day, and less than two months later, David was gone. Shot dead by the same police he used to feed for free.It may seem simple, but in the midst of struggle, barbecue is a comfort. It is an act of passive resistance, of community-building, of fellowship. Even after it’s served, people linger in that fellowship. And that’s what David was doing, lingering after a curfew set to curb the protests of George Floyd and Breonna Taylor’s deaths, when he was killed.Now, I can only imagine what we would’ve talked about, David and I, if we’d gotten the chance to meet and walk the neighborhood that day in Louisville. Two Black men descended from the enslaved, carrying on the rich barbecue tradition that our ancestors perfected. Maybe we would have discussed the struggles of being Black here in the United States. Maybe we would have talked about our shared history, our families, the South. About how barbecue can inspire a community. I never would have asked him to divulge his sauce recipe (never!), but I might have asked him about the base—was it tomato? Vinegar? The answer to that question would have given me a big clue as to where he’s from and who taught him the trade.To me, David McAtee’s story represents all what barbecue culture is to being Black in America. Cooking barbecue was one of the first businesses that recently emancipated enslaved people could do to provide for themselves and their families. As they moved from rural areas to the cities, they carried with them techniques from the plantations and farms. They turned informal trade into permanent businesses, their barbecue shacks emerging where people lacked regular sources of food. In that vein, David was claiming the inheritance that his ancestors left for him: answering the call of barbecue as an endeavor of entrepreneurship.At 53 years old, he was still working hard to own his own space, to solidify his position as a pillar in the community, to put down roots on his own terms. He was on his way to making an honest living and securing his legacy—a barbecue dream. But getting there isn’t easy when you’re Black. As my mother and father always told me, you have to work at least two to three times harder to get the same thing as your white counterparts.This I know from personal experience: Four years ago I asked my banker if I could open my own brick-and-mortar restaurant, and he told me no. Even though I had the credit score, the collateral, the cash in the bank, a full-time job with benefits at NASA, and some national visibility, it still wasn’t enough. Not without an investor, the banker told me. And the investors, the ones with the capital, are almost always white. The racial wealth disparity in this country is real. Maybe David and I would have talked about this too.Or maybe we would have talked about Reverend Adam Scott, a preacher from Goldsboro, North Carolina, the heart of the world’s largest tobacco market. By day he was a janitor and elevator operator; but starting in 1917, just after World War I, he also smoked meats in his backyard and sold them out of the back door of his home. He catered parties and receptions and fed people of both races. Business caught on and eventually Reverend Scott turned his back porch into a dining room. From there, he enlarged the restaurant three times. Scott claimed the recipe for his vinegar-pepper-based barbecue sauce came to him in a dream and laid the foundation for a multigenerational barbecue business; his family still sells Scott’s Family Barbecue Sauce to this day.I wonder, what could David’s family’s legacy have been a hundred years from now, had his life not been cut short? Would he be alive to fulfill his barbecue dream in America if he was white instead of Black?What dreams would Ahmaud Arbery or George Floyd or Breonna Taylor or Rayshard Brooks have fulfilled? Or George Stinney, a 14-year-old Black boy from Alcolu, South Carolina, where I attended elementary school? Back in 1944, he was accused of murdering two white girls and executed after a 10-minute trial. In 2020, nearly a century later, the story remains the same: Those 8 minutes 46 seconds that a cop kneeled on George Floyd’s throat were the only trial he got. And even if that cop ends up in prison, true justice will never be able to bring a dead man back to life.For David, it’s no different. Investigations are still underway to determine whether he shot first or the cops did—witnesses said the barbecue man was killed trying to save his niece after she was hit with pepper balls. But we the public will never know the entire story because a dead man can’t talk. Because none of the cops who killed him had their body cameras on, even though accountability is why cops are mandated to wear cameras in the first place.There are burdens that a white person will never understand. The sad reality is that even if David and I had had the chance for this walk and talk, we would still be two Black men, still a threat to society regardless of what he would have owned or what credentials I’ve earned. When you are Black, simply driving a pickup truck can be perceived as a danger—I’ve been pulled over twice for just that. Our skin color is a bull’s-eye; we are destined to be guilty first and innocent last.During this time of unrest, I’ve thought a lot about my own life: Will I have a worse chance of staying alive if I carry a handgun with the proper paperwork or if I have a registered American Kennel Club American Boxer by my side? To be honest, I feel I have a better chance of living with the dog…because dogs are more respected in America than Black people.Someday I may return to Louisville. I might visit the whiskey distilleries or catch a horse race. But I will never be able to eat at YaYa’s BBQ. I will never get to sit with David over mint juleps and ribs, talking history and entrepreneurship and what base makes the best sauce. Because no matter what we can do or know or own as Black people, we are still Black in America.Rest in power, David, and may God comfort your family. Black Lives Matter.Howard Conyers was one of just 20 African Americans across the U.S. in 2009 to earn a Ph.D. in Mechanical Engineering. After completing his undergrad at the Historically Black College North Carolina A&T State University, he continued his education at Duke University, then became an aerospace engineer for NASA. He is currently working on an illustrated anthology about Black people in barbecue and serves on the board of Grow Dat Youth Farm. He is also raising funds for the #100AcresProject, an agricultural incubator initiative in Clarendon County, South Carolina.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-25", "author": ["Condé Nast", "Howard J Conyers"]}