{"id": "579df5f1b78e7c4e4fcafb0a100d977c", "url": "https://www.bonappetit.com/recipe/rhubarb-brown-butter-bars", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Rhubarb–Brown Butter Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRhubarb–Brown Butter BarsBy Sarah JampelApril 20, 20204.6(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThink of your favorite granola packed full of nuts and surrounding a layer of sweet-tart rhubarb jam and you’ve got these bars. Use any combination of whole nuts you’d like, and feel free to leave the dried hibiscus flowers out of the filling entirely (they’re there to make the mixture pinker and amplify the rhubarb’s floral flavor). And if you have found yourself with a bounty of dried hibiscus flowers, may we recommend this bright pink agua fresca? You can also use a tart, thick store-bought jam: You'll need 1½ cups.Ingredients16 servingsJamZest and juice of ½ grapefruit or 1 orange3dried hibiscus flowers (optional)¾cup (150 g) granulated sugar¼tsp. kosher salt1vanilla bean, split lengthwise (optional)1lb. rhubarb, sliced crosswise into ½”-thick pieces (about 4 cups), dividedAssemblyNonstick cooking oil spray1¼cups blanched hazelnuts, raw pecans, and/or raw or blanched almonds¾cup (1½ sticks) unsalted butter, cut into pieces1¼cups (156 g) all-purpose flour1¼cups (125 g) old-fashioned oats¼cup plus 1 Tbsp. (packed; 63 g) dark brown sugar¼cup (50 g) granulated sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. baking sodaIngredient infoDried hibiscus flowers, also called Jamaica flowers, are available at Latin markets and some natural foods stores.PreparationJamStep 1Combine grapefruit zest and juice, hibiscus flowers (if using), sugar, and salt in a medium saucepan; scrape in seeds from vanilla bean and add pod. Bring to a boil over medium heat. Reduce heat and simmer, stirring occasionally, until sugar is dissolved, about 45 seconds.Step 2Set aside ½ cup rhubarb; add remaining rhubarb to pan and simmer, stirring often and mashing with a wooden spoon, until rhubarb is softened and mixture is thick and jammy, 10–12 minutes.Step 3Remove pan from heat and stir reserved rhubarb into jam. Let cool. Remove vanilla bean and hibiscus; discard. (You should have about 1½ cups jam.)Step 4Do ahead: Jam can be made 5 days ahead. Transfer to an airtight container; cover and chill.AssemblyStep 5Preheat oven to 350°. Coat an 8x8” pan with nonstick spray, then line with parchment paper, leaving an overhang on 2 sides. Coat parchment. (These bars have a tendency to stick.)Step 6Toast nuts on a rimmed baking sheet until fragrant and slightly darkened, 5–8 minutes. Let cool, then chop very coarsely (it’s okay to cut some just in half).Step 7Meanwhile, cook butter in a small saucepan over medium-low heat, stirring often, until it foams, then browns, about 5 minutes. Immediately pour into a small heatproof bowl, making sure to include all of the brown bits.Step 8Whisk flour, oats, brown sugar, granulated sugar, salt, and baking soda in a large bowl to combine, then whisk in nuts. Drizzle in butter and, using a rubber spatula, mash into dry ingredients until a clumpy, wet mixture forms (it should hold together when squeezed in your hand). Transfer 3 cups mixture (no need to pack) to prepared pan. Using your hands, press and compact into an even layer.Step 9Spread jam over base, leaving a ¼” border to prevent jam at the perimeter from getting too dark, then crumble remaining nut mixture over. If you’d like bigger clumps, press the mixture together in your hands before scattering over jam.Step 10Bake, rotating pan halfway through, until top feels firm and is deep golden brown, 40–45 minutes. Let cool in pan, then use parchment overhang to remove. Transfer to a cutting board and slice into 16 bars. (Chilling for a couple hours first will make them even easier to slice.)Step 11Do ahead: Bars can be baked 5 days ahead. Transfer to an airtight container; cover and chill.How would you rate Rhubarb–Brown Butter Bars?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleThese were amazing!  Made them as is except for the dried hibiscus flowers.  Already on the docket to make again next week.Stacy Atlanta7/15/2021These are wonderful!  They look like a run of the mill rhubarb crumble, but the flavour is far superior and more subtle.  They're a bit work, between making the jam, browning the butter, etc. using several bowls and pots, but worth every bit of effort.  I made them exactly as written, except that I was unable to get an dried hibiscus flowers (which are optional anyway).  Definitely a keeper!    GraceWinnipeg, Canada6/19/2021The lazy person in me likes to slap together a rhubarb crumble but the bottom oaty-cookie base adds TWICE THE CRUMB, yum. I used the juice from a whole lemon in place of grapefruit. Recipe was easy to double, in case you need to make them for a bake sale or something...alexbeggsBon Appétit 6/8/2020The jam is fine, hibiscus a wonderful addition. The dough and topping are just OK. Needs more salt and I think grinding the nuts into the dry mix would add more flavour and a finer texture.PGLCroton on Hudson, NY6/1/2020These are great use of our fresh rhubarb. Jam might be better than the finished bars! I also found the grapefruit to be overpowering - maybe my half grapefruit was too large. (Had no vanilla bean or hibiscus flowers and used sliced almonds).Anonymous5/29/2020I loved the recipe so much that I made a big batch of the jam and canned it so I can have it all year. A great use for my garden’s rhubarb. Definitely chill bars before serving, otherwise they are quite crumblyENVConnecticut5/25/2020Yum! Jam is as everyone has said is excellent. The top was a bit crumbly. Make sure the brown butter is a light tea colour to get the full flavour. Used a whole grapefruit (loved the bitter/sweet combo) and pecans.  I added a wee bit of vanilla extract as I had no pods in the house. Took longer to cook then recipe said but I just kept checking it every 5 minutes.  A reminder to folks to please not rate the recipes if you have not actually cooked it.  (See the reviewer that asked if they could use store-bought jam--and also the jam is the best part don't omit). Will absolutely make them again.loutzl1027Vancouver, BC5/19/2020Seriously so good. I used the exact measurements and I ended up with around 2 - 2.5 cups of jam but I only used the 1.5 cups like the recipe called for. After cutting into it, I think the bars could have used more jam so I recommend using all of your jam if you end up with extra! These bars were still amazing and definitely making again! AnonymousCalifornia5/18/2020I used a mix of hazelnuts and raw almonds and didn't have the hibiscus. Jam is delicious but boy oh boy did it ooze and burn around the edges. Next time I will line the pan with parchment on all sides. nataliematz88Omaha, Ne5/4/2020They were phenomonal! Honestly these will be a spring must from now on. Some meassurements definitely did not turn out like in the recipe. I had twice as much jam and not as mch crumb? But not mad about it at all!! Would always double the jam from now on! Anyone know how to best freeze them? EatingberlinerBerlin5/3/2020Pro Tip: Winco (grocery store, I think only in the West/Midwest) carries dried hibiscus flowers in the bulk section.  I wonder if hibiscus tea bags would work Here as a substitute. Starbucks Ruby Mist tea is primarily hibiscus, but has other added flavor as well, I think maybe mango? Hey BA, more Sarah content pretty please 🙏🏻 Her recipes are consistently my fav (along with Sohlae’s)LovelymissjennaTacoma, WA4/28/2020These are SO delicious. Wow. I used pecans and a whole orange. Can’t wait to make this again.AnonymousNew York4/25/2020Rhubarb jam is definitely the star. Recipe worked well, but I was a bit underwhelmed by the flavour of the oaty bit. AnonymousIreland 4/22/2020Forget about the rest of it...make that rhubarb jam! Who would have ever thought rhubarb and grapefruit would marry so well. I doubled the recipe due to an abundance of rhubarb...ended up with 2 pint jars plus a little extra that I ate from the pot. So delicious! Will try the bars, but the jam is perfect on it's own, or maybe on yogurt or vanilla ice cream or pbj sandwich or....\n\n\n\nAnonymousKirkland, WA4/22/2020These were so good. I made the rhubarb jam (without the hibiscus, used half a vanilla pod, and Meyer lemon) and it was so delicious that we were eating it by the spoonful. The acidity and tartness from the jam provided the perfect contrast to the nuttiness of the crumble. I used salted butter and 1/2 a tsp of Diamond Crystal. I would do 1/4 tsp next time. I used a springform round pan lined with butter parchment and it worked out well. People in my family who normally find desserts too rich went back for seconds!AnonymousMcKinleyville, CA4/22/2020Explore Bon AppétitFruit DessertDessertCookieBar CookieRhubarbFruitHibiscusHerbs & SpicesSpringEasySnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Sarah Jampel"]}