{"id": "579ff11e3e92ed48260dbdc03a8d1635", "url": "https://www.bonappetit.com/story/tiny-baking-dish", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "This Small Baking Dish Lets Me Make All the Casseroles I Crave, Just Less of Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Mini Baking Dish Lets Me Make All the Casseroles I Crave, Just Less of ThemMy appetite is large. My household is not.By Mehreen KarimSeptember 6, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Kat BoystovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Tray bakes rule my world. Few meals are as satisfying to whip up as slabs of eggplant parm, a sheet of strawberry snacking cake, or any other dish that comes together in a single 9x13\" pan. There’s only one problem: Though my heart wants to bake for a small town’s worth of folks, I live in a household of two, and there is only so much baked ziti and custardy French toast that my husband and I can eat. My love of casseroles was a curse until I met my new kitchenware MVP.This cute, small Sweejar baking dish is designed for your cute, small, tray bake-loving households. Small but sturdy, the ceramic casserole is not only dishwasher safe, but it also comes in an array of darling colors, like buttery yellow and cherry red. (And if you want all your baking dishes to color coordinate, pick up this nesting set.) In its miniature glory, this 5x6.5\" dish allows me to bake casseroles perfectly portioned for two. And before you ask, when scaling down a recipe that calls for a 9x13\" baking dish, just divide by four, which yields enough to fill the wee Sweejar with a little bit left over. My small baking dish also frees me to experiment and throw together inspired, small-scale, recipes on a whim—all safeguarded by the knowledge that if my creation isn’t a hit, I haven’t wasted a ton of ingredients.Sometimes I simply can’t go on without a bite of warm, homemade blondies or ooey gooey butter cake. But does that mean I want an entire sheet of it in my fridge? That’s where I thank my petite baking dish for satiating my identically petite but URGENT cravings. And with fall around the corner, I’m counting down the days until I can snuggle up in a blanket on the couch and eat a single serving of chicken pot pie straight from my small-enough-to-hold casserole dish. Now that’s what my heart really wants.Photo by Isa Zapata, food styling by Kat BoystovaSweejar Mini Baking Dish$16 at AmazonExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-06", "author": ["Condé Nast", "Mehreen Karim"]}