{"id": "57a2d1e1ad51f2a4bd02ed5652c8cb52", "url": "https://www.bonappetit.com/recipe/stir-fried-noodles-with-chicken", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Stir-Fried Noodles With Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueStir-Fried Noodles With ChickenBy Christina ChaeyApril 20, 20214.2(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Maggie Ruggiero, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintLoosely inspired by Japanese yakisoba, these hearty and utilitarian stir-fried noodles are the ideal vehicle for less-than-perky scallions, that random carrot, and the last few stalks of celery you forgot about in the back crisper drawer.Ingredients4 Servings25-oz. packages fresh wavy ramen noodles (preferably Sun Noodle brand) or three 3-oz. packages dried wavy ramen noodlesKosher salt2tsp. plus 3 Tbsp. grapeseed oil or vegetable oil, divided6scallions¼medium head of green cabbage (about 11 oz.), very coarsely chopped into 1\" pieces1medium onion, sliced ¼\" thick2medium carrots, peeled, sliced on a diagonal ¼\" thick2celery stalks, sliced on a diagonal ¼\" thick1serrano or Fresno chile, finely chopped12\" piece ginger, peeled, finely chopped3garlic cloves, finely chopped1lb. skinless, boneless chicken thighs, sliced into ½\"-thick strips3Tbsp. soy sauce2Tbsp. unseasoned rice vinegar1Tbsp. Shaoxing wine (Chinese rice wine) or medium-dry sherry1Tbsp. toasted sesame oilToasted sesame seeds (for serving)PreparationStep 1Cook noodles in a large pot of lightly salted boiling water according to package directions, using a pair of tongs or chopsticks to encourage noodles to loosen up and separate. Drain noodles in a colander and rinse under cold running water to remove any excess starch. Transfer noodles to a large bowl and toss with 2 tsp. grapeseed oil to prevent them from sticking together. Set noodles aside.Step 2Separate dark green tops from white and pale green parts of scallions; thinly slice tops and set aside. Thinly slice white and pale green parts of scallions and set aside separately. Heat 1 Tbsp. grapeseed oil in a large skillet (at least 12\" if you’ve got one) over medium-high. Cook cabbage, tossing occasionally, until charred in spots but still quite crisp, about 4 minutes. Season lightly with salt and transfer to a large bowl.Step 3Wipe out skillet, pour in 1 Tbsp. grapeseed oil, and return to medium-high heat. Cook onion, carrots, and celery, tossing occasionally, until crisp-tender, about 3 minutes; season lightly with salt. Transfer vegetables to bowl with cabbage. Wipe out skillet again and let cool slightly.Step 4Heat remaining 1 Tbsp. grapeseed oil in skillet (still over medium-high), then cook chile, ginger, garlic, and reserved white and pale green parts of scallions, stirring often, until fragrant, about 30 seconds. Add chicken; stir to coat, then spread out in an even layer. Cook, undisturbed, 1 minute. Season with salt, then stir and continue to cook, stirring occasionally, until chicken is cooked through, about 3 minutes.Step 5Add cabbage mixture, soy sauce, vinegar, wine, sesame oil, and reserved noodles to skillet and cook, tossing often, until noodles and vegetables are heated through and noodles are coated in sauce, about 30 seconds. Taste and season with more salt if needed.Step 6Divide stir-fry among shallow bowls or plates and top with sesame seeds and reserved scallion greens.How would you rate Stir-Fried Noodles With Chicken?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWhat a nice thing to do with leftovers! We had some roasted chicken in the fridge and all the requisite limp veg, plus some green beans and chili bamboo shoots. Made the full amount of sauce for half the recipe and needed every drop of it. Definitely a keeper.Nancy HollandNova Scotia6/4/2021So...wow. Sometimes I feel like most of the Bon Appétit commentators (and at times contributors) are a bunch of high-falutin pureblood wizards who consider windbaggery and bashing a higher art than the food. I'm just an honest vegan squib but I recognize good magic when I taste it. I veganized this easily with chicken-style-marinated tofu--without confusion--and I see no problem leaving your chopped green onion instruction where it was placed.Food-Lover Health-SeekerAsheville, NC5/19/2021Too many ingredients and too much prep to wind up with a flavorless mess. (And not that I'm ever going to make this again, but it would be helpful if you separated Step 2 by putting the green onion prep in the ingredient list and leaving the cabbage-cooking where it is. ) AnonymousVentura, CA5/12/2021Explore Bon AppétitStir-FryJapaneseEast AsianAsianRamen NoodleNoodlePasta & NoodlesChicken ThighChickenPoultryGreen CabbageCabbageLeafy GreensVegetableQuickWeeknight MealsMainDairy-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Christina Chaey"]}