{"id": "57b9480776cf47aee48ac9d4b3abbc16", "url": "https://www.bonappetit.com/story/pesto-trapanese", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "This Pesto Pasta Recipe Changed the Way I Think About Pesto | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Easy Pesto Pasta Recipe Changed the Way I Think About PestoPesto Trapanese is all I want to eat this September.By Adam RapoportSeptember 6, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by anna billingskogFacebookTwitterEmailI got this pesto pasta recipe from Lidia Bastianich. I saw her making it one day on PBS, while I was hanging out in a hotel room somewhere, waiting for a wedding to start. As I watched her whiz together bright cherry tomatoes, almonds, garlic, just a bit of basil and plenty of good Italian olive oil into the summeriest of sauces, I got to thinking.My first thought was, “That looks really easy!” My second was, “I am totally making this.\" My third—“Wait a minute, not all pestos are basil pestos? What the what?!”I've been making this \"pesto Trapanese\" on heavy rotation ever since—I like to think of it like a summer bolognese. Except for the fact that it’s vegetarian. And instead of being rich and earthy, it’s bright and fresh. Oh, and you don’t simmer it on the stove for hours—or at all, since it's completely raw. Okay, so it just kind of looks like bolognese—ruddy-colored, with a slightly chunky, pleasantly grainy texture. But I swear it’s just as addictive! And unlike bolognese, it’ll take you no more than 10 minutes to throw together.Here’s what you do. Grab two handfuls of cherry tomatoes, one handful of roasted (but not salted) almonds, a handful of basil and dump it all in a food processor. Add a smashed garlic clove.Then, start to pulse the processor while drizzling in extra-virgin olive oil. When it looks like bolognese (saucy, but chunky), you’re done. That’s it. Well, kosher salt to taste too, but that’s obvious, right?Piping hot pasta—no need to drain, just transfer it straight from the water to the pesto—is key here.\nAnd, just as is the case with a traditional basil pesto, you don’t need to heat the sauce. You just spoon a generous amount of it into a large serving bowl. And then, right before adding the hot pasta to the bowl, thin the pesto with a splash of salty, starchy pasta water—this helps emulsify the sauce and make the whole dish glossier. Now the sauce is ready for the pasta. You can never go wrong with a basic spaghetti, but short, twisty shapes like strozzapretti and trofie are nice because their folds and ridges catch all the chunky bits.Then, you just toss, toss, toss until each strand of pasta is fully coated in that glistening pesto Trapanese.And while you might have noticed that this pesto recipe (is it really even a recipe if the only measurements are by the handful?) omits Parmigiano Reggiano or any other hard, salty, cheesy thing, there’s no reason you can’t spoon some on top at the table. I know I do. Right after I pour myself a glass of verdicchio or rosato—always the first move for a lazy summer lunch or an on-the-quick weeknight dinner.Oh, one more thing: Peak-season cherry tomatoes, the kind you can buy right this minute at your local farmers’ market, are best. And If you can get your hands on some Sungold tomatoes—those bright-orange, sweet-as-candy gems—definitely do. Their natural fruitiness is the perfect foil for the bite of fresh garlic and all that grassy olive oil.And the rest of the year? Well, if you reach for one of those plastic clam shells of cherry tomatoes from Chile or wherever, I won’t judge. The pesto won’t be quite as good, but that’s why the parmesan is on the table.If you're skeptical, why not do a side-by-side with this basil number?BA’s Best PestoThe key is to add the basil at the very end instead of blending everything all at once.View RecipeExplore Bon AppétitPestoBasicallyTomatoPastaCherry TomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-06", "author": ["Condé Nast", "Adam Rapoport"]}