{"id": "57c335a904e9641203e6cb11a416102f", "url": "https://www.bonappetit.com/story/maricela-vega-chef-8arm", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Chef Maricela Vega Made My Favorite Restaurant in Atlanta Even Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTFW One of Your Favorite Chefs Takes Over One of Your Favorite KitchensMaricela Vega ran an amazing Mesoamerican pop-up in Atlanta, and now she's the executive chef at 8ARM.By Hilary CadiganJuly 15, 2019FacebookTwitterEmailPhoto by Ryan FleisherFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The first time I tried chef Maricela Vega’s tamales was at a pop-up in the back of an Atlanta bike gear shop. They were soft, sweet, and purple; nestled in a bed of local collard greens and stewy black beans; swiped with smoky red guajillo sauce; topped with an oozy fried egg. They were a revelation. At the table next to me (the only other table in the place) sat the actual farmers who grew the greens, part of a local social enterprise called Grow Where You Are. Then out came the chef, who I’d come to know as Mari, with her septum ring and accidentally-perfectly mussed long bob. She explained, in that hyper-informed-but-never-preachy way of hers, the Mesoamerican roots of her cooking. She expressed how committed she is to decolonizing Mexican cuisine and to making healthy food more accessible to underserved communities. Oh, and she’s working on finding a way to mill her own heirloom masa, too. My mind like a siren blared: WE MUST BE FRIENDS!Then I moved to New York.But, in the year or so since, we’ve stayed in touch, mostly via Instagram (her handle is @Chicomecóatlien, a clever amalgamation of the Aztec goddess of agriculture, Chicomecóatl, plus Outkast’s second album, ATLiens—get it?). I watched her pop-ups multiply and scrolled longingly through the food pics she posted: tacos crammed with locally foraged mushrooms, coconut-cherry flan glistening with honey, a very creamy-looking plate of mole and grits (!!). And then one day in March, an announcement: She’d been named executive chef at one of my already-favorite Atlanta restaurants, 8ARM.Flowers crown Vega's Gulf snapper at 8ARM\nPhoto Courtesy 8ARMThough marked early by tragedy with the sudden death of beloved chef and co-owner Angus Brown, 8ARM never faltered. Sous chef Keith Remes took over and kept churning out an evolving menu of locally-sourced and never-boring small plates. The city’s cool kids settled into the patio outside, drinking fanciful cocktails out of cut-crystal goblets. When Remes left for a different restaurant, a void opened up, and it was Mari’s job to fill it.And fill it she has—to overflowing. Today, 8ARM’s the same ingredient-driven bastion of Very Excellent Food that the late Brown and partner Nhan Le established, but Mari has turned it into something freshly exciting and completely her own. Mesoamerican influences now feature prominently, as does a deep obsession with plants and how to make them taste amazing in unexpected ways: Red beans grown by a cousin on family land in Guanajuato, stewed into a chile negro, and topped with masa-battered mushrooms; spring peas laced with okra seed oil; a delightful green garlic mignonette for oysters lovingly sourced from a Gullah farmer on the Georgia coast. It may seem like a hustle, putting forth this kind of creativity night after night, but for Mari it’s more like a break; running pop-ups was harder.Someday not too far away, Mari will set off on her own. She’s been open about her plan to open a tortilleria and masa shop in Atlanta, and I have no doubt it will happen. But for now, I love that anytime I’m back in my city, I can go to one of my favorite spots, wave to one of my favorite chefs through the little kitchen window, and know I’m in for something special.Go there: 8ARMExplore Bon AppétitRestaurantsHighly RecommendAtlantaChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-15", "author": ["Condé Nast", "Hilary Cadigan"]}