{"id": "57c3cd785ae9e202e1620048dd943566", "url": "https://www.bonappetit.com/recipe/herby-pasta-with-garlic-and-green-olives", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Pasta with Garlic and Olives Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueHerby Pasta with Garlic and Green OlivesBy Andy BaraghaniSeptember 18, 20184.8(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintDishes that rely on a quick sauté to bring out garlic's bright side, like this herb-laced riff on aglio e olio, require planning and vigilance—you need to have all your other ingredients at the ready to cool down that pan and not let the garlic get acrid and burnt. Also, feel free to use whatever tender herb you like for this pasta (a mix of tarragon, chives, and dill works well).Ingredients4 servings12oz. pappardelle or other wide noodleKosher salt¼cup extra-virgin olive oil, plus more for drizzling8garlic cloves, smashed1cup finely chopped parsley1cup pitted Castelvetrano olives¼tsp. crushed red pepper flakes3Tbsp. unsalted butter, cut into pieces1cup basil leaves2tsp. fresh lemon juicePreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.Step 2Meanwhile, heat ¼ cup oil in a large Dutch oven or other heavy pot over medium. Add garlic and cook, stirring often and pressing down on cloves so they make good contact with the bottom of the pot, until golden and soft, about 5 minutes. Add parsley and cook, stirring occasionally, until parsley releases some of its liquid and slightly darkens in color, about 5 minutes. Toss in olives and red pepper flakes and cook another minute to let the flavors meld.Step 3Using tongs, transfer pasta to pot with sauce and add butter and ½ cup pasta cooking liquid. Cook, tossing and adding more pasta liquid as needed, until each strand of pasta is coated and pasta is al dente, about 4 minutes. Remove pasta from heat and toss in basil, lemon zest, and lemon juice. Taste and season with salt as needed.Step 4Divide pasta among bowls and drizzle with more oil.How would you rate Herby Pasta with Garlic and Green Olives?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleUpdate on prior review:\n\nPeople rely on accurate recipes directions when they cook.\n\nWhy is it that Bon Appetit makes so many editing errors?\n\nThe recipe states to use lemon zest, yet there is no directions on how much to include.\n\nThe prior comment written by \"anonymous\" is totally useless, saying if you don't know how much lemon zest to add that you should stick to TV dinners. Rude. People use recipes because they need clarity on proportions and where to start. If it isn't enough for your personal taste, you add more. \n\nMoreover, the comment says absolutely nothing about if the person enjoyed the recipe or not. Which leads me to believe the writer is employed by Bon Appetit.  Wording sounds like a person who feels he or she has been personally attacked. . .\n\nUnimpressed. Do you know what is more productive than writing a useless comment? Taking the time to actually update the recipe to clearly state how much lemon zest is needed.\n\nAnd, how about this? If Bon Appetit doesn't want negative feedback, clearly write the directions. Good grief.\n\nI stumbled on this comment to mine today after deciding to remake this recipe this evening. I was hoping the editor would take the time to correct the recipe after it was clearly noted by a reviewer, myself, that it was incomplete. But apparently employees have more time to write snarky comments than to adjust HTML.ChristinaOlathe, KS11/4/2021Lemon zest...you should stick with TV dinners if you don't know how much lemon zest to add...use the zest from the entire lemon!!!  Anonymous10/15/2021Tastier if you double up on the lemon juice and add parmesan. \n\nMy biggest problem with the recipe was Bon Appetit's sloppy editing. Not the first time I've run across a problem like this one. The recipe directions state to add lemon zest, yet there in no lemon zest in the recipe list. So I didn't know how much to add.\n\nI ended up adding 1/8 of a teaspoon but it wasn't enough. \n\nOtherwise, the recipe was good and I'd make it again. Costco has organic Castelvetrano olives for like half the price, so I'd highly recommend buying them there.\n\nChristinaOlathe, KS10/9/2021Nothing beats fresh garlic, parsley and basil...In abundance!  I had left over mushrooms which I cooked in with the garlic, and added black olives and capers to make up the 1 cup of green olives.  The lemon zest and juice is magical!  Would definitely make this again!  Oh, and we like Canada's \"Free From\" products and their \"bangers\" are excellent with this!AnonymousCalgary, Alberta7/25/2021We love this pasta. So simple but so tasty. My husband is hard to please and he comes from the East coast and he's is very particular when it comes to pizza and pasta. He absolutely loved it.AnonymousSAN JOSE, CA4/14/2021I loved it and the directions was informative.Bradford, ravenLeo,in3/30/2021This was so simple and delicious. No meat needs to be added. I think meat would actually overpower the perfectly balanced flavor of the fresh herbs in butter with toasty garlic. This is my new pasta staple. AnonymousOakland, CA1/23/2021I really loved this recipe! I'm in love since I made this dish. It's easy to cook and extremely tasty! :)\nThank you so much to share it with us.\nPaula PiresBrazil12/21/2020Amazing like from a fine Italian restaurant.  Can’t stop raving.   Reasonably quick and fool proof too.  Used the ALTERNATE recommendation in the intro-tarragon, dill, chives.   The castelvetrano olives were key due to more mild flavor than standard green olives.  I did add a small can of black olives since I was short of those divine ones though and may have sneaked in extra garlic.  Used whole wheat pasta- a fancy one from whole foods and added a can of garbonzo beans which added protein and worked great.    I did grill some sliced sausage on the side for the meat-needing.  This was truly gourmet and we all just loved it!!!!   An example of how simple can be the best- I think it is a secret to Italian cooking.  Can’t wait to make it for my vegetarian friends!  What a treat to smell it cooking, set a nice table, light some table tea lights, play some Italian dinner party music, pop open some chilled white wine, feel the late summer breeze as the sun set, and treat myself and the family to a restaurant-worthy meal while in isolation at home.  Just lovely!!AnonymousSilver Spring, MD9/6/2020This pasta doesn’t need sausages or asparagus. Make it as it is and it’s perfect!Sergey ZMoscow, Russia6/6/2020Read the comments before attempting this recipe. So cut up some Italian sausage and put that into the mix. Drizzled olive oil and as a side dish roasted asparagus.\nIt turned out quite  good.👍 \nWill put this into the quarterly rotation.  Bachelor (party of one)1/14/2020Yummy!!  I had to cheat and use pesto instead of basil because apparently there is no basil in San Antonio today.  Also I burned my garlic. But I am a huge fan of this recipe!AnonymousTexas1/3/2020Made this with Banza pasta for some added protein! AnonymousChicago7/2/2019One of my favorites! Instead of smashing the garlic I chop it into slices, just for simplicity's sake, and it still tastes delicious. The lemon adds a nice flavor to help cut through everything as well. Make this quite often, so quite and easy, goes great with roasted veggies like asparagus or even roasted potatoes for a bit more of a hearty meal. All my friends love it!ceciliadChapel Hill, NC6/20/2019Great recipe. Made with tarragon + sage in place of parsley and it worked really well.AnonymousUK2/25/2019Explore Bon AppétitPastaItalianEuropeanPappardellePasta & NoodlesGarlicVegetableBasilHerbs & SpicesOliveOther IngredientsParsleyEasyMainNut-FreeVegetarianSimmerSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}