{"id": "57c7f4d1750296e145f412f31f701b0e", "url": "https://www.bonappetit.com/story/smashed-chickpea-salad", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "Smashed Chickpea Salad Is My Go-To Work Lunch When There's Nothing Else in the Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSix Days of the Year I've Got My Life Together. On Every Other, I've Got Smashed Chickpea SaladIt loves me at my best and props me up at my worst. By Aliza AbarbanelMarch 6, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Five or six times a year, I get my life together. I pile sweet potatoes onto sheet trays. I wash huge leafy bundles of kale. I stand over my stove simmering beans that I remembered to soak the night before and bask in the satisfaction of prepping a week of healthy, relatively inexpensive lunches.The rest of the time, I rely on a decidedly less civilized strategy: Pray my dinner yields enough leftovers for lunch and scavenge in the Test Kitchen when it doesn’t. But now I have a third strategy: smashed chickpea salad.Smashed chickpea salad is the sole reason why I keep an extra can of chickpeas on the top shelf of my pantry. It’s my fallback plan when it’s 11 p.m. and I’m overcome with the urge to break my bad habits and pack my own damn lunch. It comes together in minutes, uses whatever I have on hand, and makes a seriously tasty lunch.I start by rinsing and draining the chickpeas in that can, and then I use the back of a wooden spoon to roughly smash 75% of them. (A potato masher would work even better, but I don’t own one. If you have one, use it! I salute you.) I like to leave some chickpeas intact for textural variation, but mashing most of them helps hold the sandwich together.Then I mix in all the other ingredients. When I say “other ingredients,” I’m being purposefully vague. Rather than get stuck on specifics, I aim for a one or two mix-ins from each of these categories:Something briny/acidic: capers, pepperoncini, half-sour pickles; when all else fails, a lot of lemon juice does the trick.Something punchy/sharp: sliced scallions, grated garlic, flaked smoked trout, harissa, almost-too-many red pepper flakes—the goal is to add flavor!Something creamy/rich: a good dollop of Greek yogurt, tahini, organic mayo, Dijon mustard, leftover green goddess or tahini ranch; add in a drizzle of olive oil or an additional spoonful of your chosen creamy condiment if things look dryAfter everything’s combined, I add some salt and cracked black pepper and tweak the levels of acid and spice until it tastes intense and bright.Sometimes I eat my smashed chickpea salad as is, but most of the time, I make it a sandwich. To ward off Soggy Sandwich Syndrome, I bring the salad to work in a little container, sometimes along with sliced cucumbers or quick-pickled carrots, and pack up a separate container of toast (or toast-like things) to serve underneath the salad: Toasted sourdough, rice cakes (I like this tamari with seaweed flavor), or Norwegian crisp bread, sturdy crackers. When lunchtime comes, I assemble.It goes without saying that smashed chickpea salad is more than just a panic lunch. It’s a great weeknight dinner, and it can certainly be planned in advance. But I’ll tuck that extra can of chickpeas on a high shelf in the hopes that I won’t accidentally use it for herbed or spiced chickpeas. I can never predict when I’ll need to turn it into lunch, but its time will come.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-06", "author": ["Condé Nast", "Aliza Abarbanel"]}