{"id": "57cd361710764c85ba249cd77752c76f", "url": "https://www.bonappetit.com/story/bulk-storage-containers", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Bulk Food Storage Containers for Large Quantities of Flour, Oil, Sugar, Beans, and Cans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Buy Food in Bulk, You Need Storage Containers to MatchAs in, very large ones.By Alex BeggsFebruary 26, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.During times of unknown, uncontrollable circumstances, like, say, a pandemic, people react by bulk-buying toilet paper, beef jerky, and active dry yeast. Psychologists have studied our panicked purchasing behavior during this time and it all makes sense—the term “scarcity mindset” needs no explanation. I have more yeast than I need. I’m sorry!The yeast was irrational, but even in non-pandemic times, I buy in bulk the foods that I go through quickly: rice, flour(s), sugar, oats, and cases of tuna. I get a better deal this way, it reduces my trips to the grocery store, it reduces packaging waste and time spent in the car, and yes, I feel SAFETY and CONTROL and all of those other delicious delusions happening in the brain when we bulk buy.That was a long introduction to lead me to the point. When you buy in bulk, for whatever logical or illogical reason, you’ll need bulk containers to keep those goods airtight and as long-lasting as possible. Are you storing everything in a cool, dark place? Consider a bunker. Then fill it with a few of these, my favorite bulk food storage containers.For a 10-pound bag of flourSince baking is one of my only hobbies, I go through so much flour I keep an 8-quart Cambro of flour right on my kitchen counter; that’s the perfect size for the 10-pound bag of King Arthur’s all-purpose flour. I stack a 6-quart Cambro container on top with granulated sugar. (Watch out, sometimes lids are sold separately.)Some of the many reasons restaurants, bakeries, and our test kitchen love Cambros is because they stack easily, the lids are super tight, and the square shapes can nestle together on shelves without wasting space. For flour and sugar especially, I can open them and dunk in a measuring cup without spritzing flour particles all over the counter and myself.8-Quart Cambro Square Food Storage Container With Lid$31 $30 at AmazonFor a 20–25-pound bag of riceI timed it, and my household of two went through an 18-pound bag of brown rice in six months, which is around how long dry brown rice lasts, depending on your environment (in comparison, white rice lasts years). The rice came in a big, unsealable bag, and I knew I’d need to rehouse it into an airtight container ASAP because rice can get moldy, or worse, attract a horrific nightmare known as rice weevils. Giant Cambros exist, but I prefer the 13.21-quart Tellfresh Superstorer from the Container Store because it has a nifty handle, which makes it easier for me, a relative wimp, to pull it off a shelf in my basement (i.e., my bunker). The handle is also great if you’re storing something you might be traveling with, like dog food. And it means you can use the container as a kettlebell, since I’m never not working on my bulk biceps too.13.21-Quart Tellfresh Large Airtight Superstorer$28 at Container StoreFor oats, lesser quantities of rice, or beans, I guessI could have made this entire article about Cambro, but Click Clack canisters’ “squeeze-top closures” have a purpose in my bulk life too. That lid has serious suction and it’s easier to open and close than a Cambro lid, which you sometimes have to double-check to make sure is closed all the way around the edges. However, those Click Clack lids are a disaster if there’s powdered sugar or flour in there. They send a cloud of poof every time you open and close when the suction is released. And they’re annoying to clean (the water seems to get trapped in the lid?!). All of which is to say, I like them for oats, rice I buy in smaller quantities than 18-pound bags, and, if you’re a dry beans person, that would work too.Click Clack Pantry Canisters$8 at Container StoreFor tinned fish and miscellaneousYes, I bought a case of tuna at Zingerman’s summer sale and I’m extremely proud of that sweet deal. But I also have a stash of other tinned fish (I got several for Christmas, which says as much about me as I’d expect), sprinkles for baking, bags of chocolate chips, backup cocktail cherries (important), and sheets of nori—and all those random extras need a storage home too. I make categories like “BAKING STUFF,” “FISHES,” and “CANNED BEANS” and store them in Sterilite 15-quart rectangular containers, which I chose because it fits into the narrow height of my bunker shelves. Keeping the randoms stored in these makes me feel somewhat organized and the lid keeps everything from getting dusty or spiderwebby.15-Qt. Sterilite Latching Storage Box (2 Pack)$34 at AmazonFor cooking oilSince the giant 3-liter tins of Zoe extra-virgin olive oil are nearly impossible to pour a single tablespoon from, you have to have an olive oil cruet or a squeeze bottle. I think the cruets are nice for dressing a salad (and look how pretty), but for cooking oil you use frequently, a squeeze bottle is so much better. Yes, they’re clear and let sunlight in, which can make olive oil go rancid faster, but if you’re cooking with olive oil two-to-three times a day, that won’t be an issue. I currently have a 32-ounce Tablecraft squeeze bottle for my olive oil, but it’s almost too big for my hands, I think I’d prefer a 16-ounce bottle next time. Remember to close the lids TIGHT or the oil will seep through. And no, you do not need the bottles with the little red tops, which will end up rolling under your oven anyway.Tablecraft 12 oz Plastic Squeeze Bottle$10 at AmazonIn this ongoing fight against an evermore contagious virus, a wavering economy, a frenzy for focaccia, I hope you find the minor control and comfort you seek in bags of flour as big as throw pillows. I know I will.Explore Bon AppétitShoppingStoringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-25", "author": ["Condé Nast", "Alex Beggs"]}