{"id": "57ce9f3a2bec6b990aed65e4851be7ee", "url": "https://www.bonappetit.com/story/pinky-cole-community-activism", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Aisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseAisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.”ShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020Aisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.”The founder and CEO of Slutty Vegan ATL is using her growing burger chain’s success to care for her community and get out the vote.By Aisha “Pinky” Cole, as told to Leigh-Ann JacksonOctober 13, 2020FacebookTwitterEmailphoto by Emma FishmanFacebookTwitterEmailAisha “Pinky” Cole is the founder and CEO of Slutty Vegan ATL, a vegan restaurant chain that frequently draws hours-long lines for its plant-based fast food, like burgers made with soy protein and topped with vegan cheese, vegan shrimp tossed in Buffalo sauce, and sweet jerk plantains sandwiched in a Hawaiian bun.She started making her signature bawdy burgers, like the “One Night Stand” and the “Ménage à Trois,” in a shared kitchen in 2018 before launching a food truck later that year. Cole has since opened two brick-and-mortar locations in the Atlanta area and is preparing to open a third in the Edgewood neighborhood this month.Cole describes the restaurants’ vibe as raucous and “Six Flags-ish,” but philanthropy is also a big part of her brand. Her Pinky Cole Foundation has created scholarship funds for students enrolled at her HBCU alma mater, Clark Atlanta University. She’s donated everything from laptops to haircuts to fresh produce to the surrounding communities. And after Rayshard Brooks was fatally shot by an APD officer in June, she donated a car and life insurance policies to his family and covered college tuition fees for his children.Cole’s newest initiative is Votenik 2020: Zoom the Polls, a weekly digital series of conversations aiming to increase voter turnout nationwide.Here, Cole explains how her mother inspired her altruism, how her community informed her activism, and how she wants to motivate others to vote. –Leigh-Ann JacksonMy mother is from Jamaica. She came to this country when she was 17. Once she got here, she met my dad and—long story short—he ended up doing 22 years in prison. She was always working two or three jobs and letting people from Jamaica come stay in our house until they got on their feet. So there were always six to 10 people living with us. If somebody needed money, she would give them money. We sacrificed presents on holidays so that she could help other people.At the time, I didn’t understand it. But I appreciate it now, because I am just like that. I will help anybody. And that’s pretty much the reason why I started the Pinky Cole Foundation.The goal of my foundation is to provide opportunities and financial literacy resources to people to help bridge the generational wealth gap. I’ve paid the rents of local business owners in the middle of the pandemic. I partnered with the Department of Juvenile Justice to employ ex-juvenile offenders at Slutty Vegan. I’m partnering with a local halfway house so we can give them work opportunities as well.It feels good to be able to help my young Black brothers because I know how it feels to be a part of the system. No, I wasn’t behind bars, but I was on the other side of that. To get that automated voice saying, “You have a collect call from…” Me hearing those calls—I should probably go to therapy because of it. As a young kid, I was not able to physically touch my father unless I went through a whole bunch of security guards. We would sit and talk for an hour before the buzzer went off. Having been a part of that system, I don’t wish that on my worst enemy.Now, as an adult, I’m going to use my resources so that I can help as many young Black men get out of the system early so that they don’t end up going down that path where they make bad decisions and look up one day like, “Damn, what happened with my life?” And I think that more business owners should take the responsibility to do that, especially if they are in urban communities.We also donate meals to people who need them, whether that’s homeless people, teachers, first responders, or essential workers. We want to make sure that those people are good because those are the people who really make our world go around. And we’re putting Slutty Vegan locations in underserved communities and food deserts because we want to give that level of food access for people. We want to create a space where people feel like they have options, especially in inner-city communities. If you go to your local grocery store in an inner-city community, the fruit that you see there is not going to look like the fruit that you see in Beverly Hills.So we’ve been able to step in and show them a healthier alternative. And we’re educating them on how important it is to have food access and to understand what you’re eating. Yes, it may be just burgers and fries, but it’s vegan. It’s not dead animals. And I’m also going to roll out the healthier options—salads, fresh drinks, and soup—for when it gets cold. We’re not telling you to go vegan; we’re just telling you to open up your horizons.A Slutty Vegan burger, in all its glory\nPhoto by Emma FishmanIn the next two years, we’re opening up another 13 locations. I’m going to Alabama, L.A., South and North Carolina. I was supposed to open up my third location in Atlanta on July Fourth, but COVID is just a hater. It’s thrown a monkey wrench in the program. We’ve had to pivot with the foundation and the business. Sometimes pivots are okay because they allow us the opportunity to reset, restart, research, and get better. So, right now, we’re focusing on the Votenik initiative.Votenik is a program to promote voter turnout. It’s a weekly digital conversation about the election. We’re talking about immigration issues, health care access, criminal justice reform, and gun reform. We really want to talk to the people who are not voting, the people who are not interested in voting or don’t have the access or resources to figure out how to do it. And we’re getting a surprise celebrity drop-in every single time. I reached out to Impossible Foods, then we looped [Atlanta-based rap mogul] Jermaine Dupri in. On Super Tuesday, we’re doing a big celebration where we’re going to be providing free meals for people who have shown that they’ve voted. And I’m encouraging people to exercise their right to vote on the local level, especially.Honestly—and I’m being totally transparent—I think that Americans put too much emphasis on the President of the United States without looking at our community leaders and organizations who also make decisions that will directly affect us. Presidents are not gods. So I’m starting with myself first. I was Miss Clark Atlanta University and back then my platform was “SELFLESS: Setting an Example by Listening First, then Leading Everyone to a Standard of Success.” I would use that as my platform if I was going to be a politician because it’s really not about me. It’s about how you pay it forward, how you give back and uplift the people around you.Now I call myself a “Hood Politician.” I’ve done more than some politicians have done in decades. And I’m not saying that to be cocky, I’m saying that to say that change starts from within. The change that we want to see? We literally can be that change. I know that whatever the outcome of this election is, I’m going to be all right. It’s not going to stop what I’m doing for the community.Here are Cole’s tips for making a difference in your own community this election season and beyond:1. Locate food deserts in your area, then support charities that increase access to healthy, affordable food in low-income areas, like the Food Empowerment Project.2. Donate to organizations that fund women-of-color-owned food and beverage businesses, like New Voices Fund.3. Discover, support, and amplify Black-owned restaurants by using apps, like Black and Mobile and Eat Okra.4. Bank Black—investing in Black-owned banks means investing in Black communities. Black-owned banks offer the same services as larger institutions, but with more one-on-one customer service to guide Black restaurant owners through bookkeeping, payroll, and funding opportunities like PPP loans.5. Donate to the Pinky Cole Foundation, which funds financial literacy education and mentorship programs for teens and young adults nationwide, helping the fast-food workers of today become the entrepreneurs of tomorrow.Explore Bon AppétitRestaurantsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-13", "author": ["Condé Nast", "Aisha", "Pinky", "Cole", "As Told To Leigh-Ann Jackson"]}