{"id": "57dbeac8313dd8bd2e5b65c741c70d71", "url": "https://www.bonappetit.com/story/fall-vegetable-recipes", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Fall Is for Vegetables—Not Just Braised Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFall Is for Vegetables—Not Just Braised MeatEditor in chief Adam Rapoport shares the vegetable dishes he’s excited about in his weekly newsletter.By Adam RapoportOctober 2, 2018FacebookTwitterEmailPhoto by Laura Murray. Food Styling by Judy Mancini.FacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I ate vegetables all weekendI just spent three days in Chicago—aka the meatiest city in America. And somehow, all I came home thinking about was vegetables.Chicago is the birthplace of Morton’s The Steakhouse. It’s where our own Alex Delany, clearly ignoring his doctor’s advice, once downed 14 of the city’s signature hot dogs in a single day, all for some YouTube glory. And it’s home to the famed, giardiniera-soaked Italian beef sandwich.Want this letter before it hits the website? Sign up for our newsletter!But during my weekend at Bon Appétit’s annual Chicago Gourmet festival, I managed to actually get kinda healthyish. On Day 1, I had lunch with our deputy editor Julia Kramer. We went to Cellar Door Provisions, which is one of those all-day bakery/cafés where you want to order everything on the hand-written menu. So that’s exactly what we did. We got the quiche, which is so cloud-like, so ethereal that it defies baking logic (or at least the name quiche). We got the house-baked sourdough, which comes with a little football of fancy butter, crowned with flakes of sea salt.And we ordered an apple-kohlrabi salad, which is exactly the kind of thing I want to eat all fall long. It’s crisp and bracing, like one of those October days that snaps you to attention as soon as you walk outside. And it’s a lot like this apple-celery-peanut salad (from Josh McFadden’s cookbook Six Season) that we have on our site. Both rely on a mandoline (or at least some deft knife skills); both mix fruit, veg, nuts, and herbs; and both turn to a sharply acidic dressing that brightens each ingredient without overpowering it. Give me some braised short ribs for dinner, and this is exactly the kind of salad I’m serving alongside.Michael Graydon + Nikole HerriottThe next day, at the festival in Millennium Park, I hosted a demo on the main stage with Emily Fiffer and Heather Sperling from Botanica in LA. They made this dead-simple-but-intensely-flavorful roasted carrot dish, one that balances spice with sweet. To make it, they halved some farm-fresh, multi-colored carrots lengthwise, and then they tossed them in a bowl with olive oil, salt, a few generous dashes of smoked paprika, a sprinkling of cumin seeds, and a drizzle of maple syrup (though you could also use honey or agave syrup). Then they added some halved lemons and oranges and few unpeeled cloves of garlic. Onto a sheet tray it all went, both fruit and veg cut-side down, into a 425° oven for 15–20 minutes ‘til all caramelized, roasty, and delicious. Squeeze the warm citrus all over the carrots and top with some chopped cilantro.It’s that simple. But, if you prefer a proper recipe, I’d recommend this one for harissa-roasted carrots with maple syrup, which is real similar and just as tasty.Eva KolenkoA few hours later, I did another demo with Carla Hall and Timon Balloo, chef of the Caribbean fusion restaurant Sugarcane. Timon whipped together two quick pickles, which made me wonder why I don’t make them more often. They couldn’t be easier and they’re the kind of thing you can keep in your fridge and reach for anytime you want to amp up an otherwise ho-hum meal.One was a Thai-style pickle, hopped up with fish sauce, palm sugar, and fresh ginger. I immediately asked him for the recipe and, hopefully, I can convince our test kitchen to give it a spin. The other was a classic cucumber pickle. Toast some whole spices—coriander, mustard seeds, you name it—in a dry pan, add some water, vinegar, sugar, and salt to the pan and bring to a boil. Pour it into a jar of just-sliced cucumber spears, fresh herbs (like dill), and sliced onions. Done. Munch on them for weeks to come.No, this wasn’t the Chicago I expected. But it’s one I’m happy to take home with me.Get the recipes:Celery, Apple, and Peanut SaladHarissa-and-Maple-Roasted CarrotsClassic Dill PicklesExplore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Adam Rapoport"]}