{"id": "57dc9ed2fea41a57063bf4a338acb9ce", "url": "https://www.bonappetit.com/recipe/greens-and-beans-with-fried-bread", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Greens and Beans with Fried Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueGreens and Beans with Fried BreadBy Anna StockwellMarch 20, 20184.5(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintA day-old loaf of good bread can reach new heights when it’s thick-cut and pan-fried in olive oil. We top these giant croutons with steamed clams or mussels, sink them into brothy soups, and crumble them over big salads. But this recipe, a saucy little mix of beans, greens, and garlic, gives us a reason to look forward to Meatless Monday.Ingredients2 servings½cup dry white wine2garlic cloves, thinly sliced2tsp. finely chopped oregano¾tsp. kosher salt¼tsp. crushed red pepper flakes1bunch Tuscan kale, ribs and stems removed115.5-oz. can white beans (such as butter or cannellini), rinsed½cup plus 2 Tbsp. extra-virgin olive oil; plus more for serving21\"-thick slices crusty breadWhite wine vinegar (for serving)PreparationStep 1Bring wine, garlic, oregano, salt, red pepper flakes, and ¼ cup water to a boil in a large skillet. Add kale, cover pan (a baking sheet works great if you don’t have a big lid), and cook, stirring occasionally, until greens are wilted, about 4 minutes. Mix in beans and ½ cup oil and cook, uncovered, until beans are warmed through, about 2 minutes.Step 2Meanwhile, heat 2 Tbsp. oil in another large skillet over medium. Fry bread in skillet until golden brown, about 2 minutes per side. Transfer to paper towels to drain. (If you don’t have 2 large skillets, cook the bread first and keep it warm in a low oven while you use the same skillet to make the kale and beans.)Step 3To serve, place fried bread on plates and spoon kale mixture and sauce over, dividing evenly. Drizzle with a little oil and vinegar.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Greens and Beans with Fried Bread?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis is a great vegetarian, super-fast and yummy meal that will totally be in my regular dinner lineup from now on!AnonymousLincolnville, ME3/1/2022I haven't made this yet but I'm planning to very soon! However, 1/2 cup of oil seems excessive. Is this much really necessary?Kathy R.Austin, TX10/20/2021So, I read all the glowing reviews and thought, \"there's no way this can be *that* good...it's just beans and kale.\" Well, it *is* that. good. Super delicious, creamy, and so easy. We topped ours with vegan parmesan, and skipped the vinegar. Really lovely meal and I will for sure add this to the rotation!RebeccaChicago7/28/2021Love this recipe! \n\nWe have made it with different beans and different greens and it is always delicious.\n\nSince it's been warm out I've been grilling the bread! Don't forget the parm! \n\nMy teenaged son sneaks crisp bacon on top and it is a to die for addition! Sandy Toronto5/29/2021We love this recipe.  Use good bread and a drinkable wine and it is an easy 5 stars.  Netta7 Washington, DC 12/21/2020My boyfriend and I obsess over this recipe. We make it at least once a week with a fried egg and avocado. I use 1/4 teaspoon of salt and then go to taste. We also substitute collard greens sometimes for the kale and it’s still just as delicious. Inspired by DELANEYS Instagram story. Recommend 10/10mnwils03Seattle6/15/2020SO good and easy, I haven’t been this excited for leftovers in a looong time. I used curly kale because it’s what I had and it worked fine. I loved the little hit of acidity from the vinegar and I added a little parm which I’d highly recommend! Prague, CZ6/4/2020This is a go-to recipe that I never tire of. I can't even count how many times I've made it!AnonymousMichigan 5/29/2020Delicious and surprisingly filling.  Love the acid the vinegar contributes to the dish.  Guilty admission - I crisped up some pancetta to go with it.AnonymousAshland, OR4/11/2020Very tasty, don’t be afraid of the amount of oil, it’s definitely needed.   We doubled the recipe using a whole grain crusty loaf and two bunches of curly kale, just increased the braising time.  Didn’t think it was too salty when using low sodium beans, and the vinegar is a nice finish.  Wish the Parmesan in the picture had been listed in the ingredients because that would have been a perfect addition, maybe a fried egg too.  AnonymousAK12/28/2019can I sub curly kale for Tuscan?Anonymousmichigan2/7/2019We loved it! I used sourgough bread and added a second can of beans. The meatkess dinner was filling and i will definately make this again. AnonymousFlorida, USA5/5/2018Love it! Super fun to make and taste great. Will make againchrisrollinsjrCharleston4/11/2018This was excessively salty when 3/4 tsp was used. So salty, it's impossible to rate this receipe.AnonymousCalifornia4/2/2018Explore Bon AppétitToastKaleLeafy GreensVegetableWhite BeanBeanEasyMainVegetarianVeganDairy-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Anna Stockwell"]}