{"id": "57e423fe7980aa578356dc5375cba138", "url": "https://www.bonappetit.com/story/pizza-style-eggs", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "Eggs \"Alla Pizzaiola\" Are Pizza-Style Eggs and Yes, They’re As Good As They Sound | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEggs \"Alla Pizzaiola\" Are Pizza-Style Eggs and Yes, They’re As Good As They SoundThe one rule here is to use all of the cheese.By Marianna CeriniJuly 31, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek Brown FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Every time I land in Rome, after an over 12-hour flight from Hong Kong, where I live, my mom welcomes me with eggs “alla pizzaiola” (roughly translated as “pizza-style eggs”).The minute we walk through the door of my family apartment, she heads for the kitchen, regardless of the time. To make the dish, she cooks eggs, tomatoes, and mozzarella together until they form this cheesy, pillowy, salty, and tangy gem of a dish that looks fancy yet requires zero effort.It’s one of her favorite things to put together: When she was younger, she used to make them as an afternoon snack for herself, and later, for my brother and me. It’s her cure for a hangover, her Sunday we-have-nothing-left-in-the-fridge lunch staple, her late night munchies’ remedy and, of course, her “welcome back” whenever I visit.Needless to say, home is not where I’ll be going this summer (or year, likely). So I’ve started making eggs “alla pizzaiola” in my own tiny Hong Kong kitchen instead. Here’s how you can make it too:Start off by frying 1 clove of thinly sliced garlic in a medium skillet with a generous glug of olive oil and a pinch of salt until softened and slightly golden, about 3 to 4 minutes. Next, add the tomatoes, either from a 28-oz. can or fresh—both cherry (a handful, halved) and ripe plum ones, chopped (3 should be about right)—work, depending on what you have on hand. Let them cook for around 5 minutes, until they start to break down and become jammy. You could rip some basil leaves and throw them in at this point, to wilt, or not—it’s up to you.Turn down the heat, make four small wells in the pan and crack an egg into each. Now grab a 5-oz. fresh mozzarella, slice it into thin strips, and arrange the strips around the eggs. Feel like tearing the cheese over the skillet instead? No one’s stopping you. The only rule here is to use all of it: You want voluptuous creaminess to be the star trait of the final dish.Sprinkle some more salt and a grinding of pepper, then place a tight-fitting lid over the skillet. This will make the mozzarella melt faster, and turn the egg yolks into their best version of themselves: runny, soft, gooey pockets of flavor. The whole thing should wobble slightly, with the mozzarella bits bobbing on the surface, floating like fat clouds.Take off the heat, place the skillet on your dining table, and eat straight from it, like my mom and I do. One small but major note: Make sure you’ve got bread to go with it. This is a meal that begs to be mopped up with a crusty loaf of sourdough or a fluffy pull-apart dinner roll.Just like a pizza, from which they get their name, snazzing up your eggs “alla pizzaiola” with different toppings is 100% encouraged once you’ve got the foundation down. You can play with different herbs and spices, from parsley and oregano to crushed red pepper flakes; add a heaped tablespoon of tomato paste to make the sauce a little heftier; sprinkle Parmesan on top for extra cheesiness or pecorino for a saltier, sharper edge.The eggs, too, leave room for experimenting. They can be scrambled, poached, left to set to the point of resembling a frittata—anything works, really.This is the kind of dish that’s dependable regardless of techniques. It’s comfort food in its essence, both easy and soul-soothing. A homecoming.Marianna Cerini is a freelance writer based in Hong Kong.Explore Bon AppétitIt's That SimplePizzaPoached EggsEggMozzarellaTomatoItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-31", "author": ["Condé Nast", "Marianna Cerini"]}