{"id": "57e5946bbeaafbe4ddf43cefe3780704", "url": "https://www.bonappetit.com/recipe/silky-pork-and-cumin-stew", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Silky Pork and Cumin Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueSilky Pork and Cumin StewBy Claire SaffitzSeptember 18, 20183.6(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintYou know what takes a lot of time? Standing over the stove and browning every cube of stew meat on all sides and in batches. That’s why we brown the pork shoulder whole, which develops a ton of flavor with a fraction of the time and effort. You can let the stew sit for a full 12 hours so all the flavors have a chance to really meld together, but this step is totally optional. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servings Tangy Red Cabbage½small head of red cabbage, very thinly sliced2Tbsp. apple cider vinegar1tsp. sugarKosher salt, freshly ground pepperCharred Avocado with Chili Powder2ripe avocados, unpeeled, halved, pits removed½limeKosher saltChili powder (for serving)Stew and Assembly15-lb. piece skinless, bone-in pork shoulder (Boston butt), patted dryKosher salt, freshly ground pepper3Tbsp. extra-virgin olive oil3medium onions, peeled, cut into 1\"-thick wedges2heads of garlic, top third removed½cup fine-grind cornmeal4dried chiles de árbol2tsp. cumin seeds3Tbsp. apple cider vinegarCrushed corn nuts, chicharrones, hot sauce, and/or sour cream (for serving; optional)PreparationTangy Red CabbageStep 1Toss cabbage, vinegar, and sugar in a medium bowl; season with salt and pepper and vigorously massage with your hands until cabbage is softened and slightly wilted.Step 2Do Ahead: Cabbage can be made 1 day ahead. Cover and chill.Charred Avocado with Chili PowderStep 3Cook avocados, cut side down, in a large skillet, preferably cast iron, over medium-high heat, until cut sides are blackened, 5–7 minutes. Transfer to a plate and let cool.Step 4Use a spoon to scoop avocados out of their skins, then cut each half lengthwise into quarters. Transfer to a plate and squeeze lime over top. Season with salt and sprinkle with chili powder.Stew and AssemblyStep 5Season pork generously all over with salt and pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Cook pork, turning occasionally, until browned all over, 15–18 minutes. Transfer to a cutting board and let cool.Step 6Reduce heat to medium and cook onions and garlic, cut side down, in the same pot, tossing onions occasionally, until onions are browned in spots and garlic is golden brown, about 5 minutes. Add cornmeal, chiles, and cumin seeds and cook, stirring constantly, until cornmeal is toasty smelling and cumin is fragrant, about 5 minutes. Add vinegar, stirring to release any bits stuck on bottom of pot, then add 8 cups water. Season generously with salt and pepper and bring to a simmer.Step 7Meanwhile, use a knife to slice pork meat from the bone, discarding any large pieces of fat. Cut meat into 2\" pieces.Step 8Return pork meat and bone to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is fork-tender, 1½–2 hours. Uncover pot and let stew cool (bone and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).Step 9Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bone and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Charred Avocados with Chili Powder, Tangy Red Cabbage, corn nuts, chicharrones, hot sauce, and/or sour cream as desired.Step 10Do Ahead: Stew can be made 3 days ahead. Keep chilled.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethHow would you rate Silky Pork and Cumin Stew?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleIf you can find them consider using a mix of smoked chiles in this dish. I used a combination of smoke dried chiplote Mecca, ancho, morita and guajillo chiles. These chilles range from low to medium in terms of heat. They combined flavors of the chiles result in a rich multilayered flavor to the dish. RBIthaca11/12/2021This soup is wonderful! I can’t help but think that people who thought it was “bland” really took a wrong turn somewhere. Love the cornmeal in it, I’ll be doing this more often in soups. The confusion about the garlic blows my mind, as it’s a pretty common method of infusing garlic flavor but keeping it in the background. The head shouldn’t be falling apart if you only cut the top. Don’t peel any skins off unless there are a few really loose ones. Discard it at the end. The only change I made is that at the end, I blitzed the rehydrated chiles in my little smoothie maker with about a half cup of the soup liquid and added it back in, which added a lot more heat. Loved this, will be making it again and again.Jessamin Raleigh, NC12/25/2020We thought this recipe was delicious! A few slight changes were made. I used a 4lb pork sirloin instead of the pork shoulder. 1.5 heads of garlic, peeled, with large pieces cut in half. At the end, all the garlic melted into the stew, and we didn't have to worry about pulling flakes of garlic out. I couldn't get ahold of chiles de arbol, and replaced them with 1/2 tsp of red chile flakes + 1/2 tsp cayenne pepper. I think this change was important, because it added a firm, smooth heat to the stew. The big issue others have complained about is that there isn't enough flavor in this stew. Keeping in the garlic and replacing the chiles should do the trick!Kristie UNew England11/24/2019Right. So here's how to save this recipe.\n First, the recipe has been changed to tell people to remove the garlic heads after cooling the soup. That's helpful. Yes the garlic will fall apart when you cut it in half. If you cut closer to the root end it stays together a bit better. Any little separate cloves of garlic I just left out of the pot and tossed.  You're also going to need to sift through the soup for random bits of fat from the pork and garlic skin before serving. When I tasted the stew (after the three days in the fridge to blend flavors) it was ...porky, and bland. None of us were impressed. So I tried charring the avocado and it seemed to add nothing except something green and pretty for the magazine photo shoot. Instead I ended up dumping a whole container of salsa verde into the stew, then I added some salso verde gauc as a topping along with the sour cream, and corn nuts. I didn't do the cabbage, but I think it also would improve the flavor. By the time I was done it was pretty fabulous. I served it on Halloween (made a triple batch and served 30), and everyone loved it. It really does need something tangy and citrusy like the salsa verde though, otherwise it's pretty blah and not worth the time and effort.Anonymous11/4/2018loved it.  had never put cornmeal in a soup/stew before and it gave it a great consistency.  cooked it in the instant pot for 30 minutes after browning the meat and onions which i doubled.  put in abotu 10 roughly chopped garlic cloves and add some soaked navy beans.  the cabbage was a  great addition.  don't think charring the avocado added anything so will skip next time.  all was much better the next day.redwood shores, Ca11/3/2018Also, the garlic! What was I supposed to do with that? Was I meant to pull the heads out and squeeze the cloves into the soup after it had simmered? That seemed to make sense, but I was afraid with 2 whole heads of garlic, that kind of addition would overwhelm the other flavors.stickyheelsDurham, NC10/15/2018This stew was just \"fine\". Without the cabbage or the sourcream/yogurt topping I found it to be very bland. I'm not sure the chiles did anything at all? I found the instructions confusing and unclear - was I to leave the chiles whole? was I to dice them before adding (for the record, I chopped off the  green tops and tossed them in)? The entire pot, cooled, had a gelatinous texture so it was very difficult to remove the fat from the \"top\" without losing a decent quantity of the soup itself? Overall I was disappointed - a $15 cut of meat that I actually forgot was in the fridge for leftovers because it wasn't much to remember! stickyheelsDurham, NC10/15/2018Holy cow this is a stunning stew. I made it on a Sunday for a Wednesday dinner party and those three days in the fridge made a load of difference to the flavor and texture. The chilies dissolve and  transform the broth into something much smoother and richer. Everyone went for seconds and thirds and demanded I sent them the recipe on the spot. This is going in the steady rotation.\nI agree with the other comments that the garlic step is confusing. Next time I'll peel the individual cloves instead of messing around with the halves.\nI served these accompaniments: Charred avocados (worth taking the time to char them), Fritos, jalepenos, pickled red onions, cabbage, sour cream, cilantro, lime wedges Anonymous10/11/2018So the soup tastes amazing...but Here’s what I’d do differently. \nOne I like clear broth, so prior to cooling the stew I would strain it. You may have to adjust the seasoning, but the toasted cumin & cornmeal flavor would be there. I also squeezed out the garlic & discarded the peel..who wants to eat that? \nI would also like to suggest to be sure to render as much fat as possible or trim it before cutting into pieces because chewy fat is no good. When they say be generous with salt & pepper they mean it! \nI could not find the dried chilies so I used 3 fresh red fresco Chile’s diced up and it created the perfect amount of heat! \nWill make again with a few adjustments,  such a warm comforting dinner! Krysi008Michigan 10/10/2018As much as I wish my stew turned out looking like the picture in the magazine, it didn't even come close. I had made the slow cooked chicken with kale soup and it had turned out SO well (seriously, go make it), so I had hoped that this would yield the same results since they're very similar. Unfortunately, I found the broth to be incredibly bland, and the pork much the same. I think there is potential, but there are just some taste elements lacking in the soup itself--more spices, maybe some more veggies. The grilled avocado and cabbage are great additions, but I believe that the soup itself should also be a good stand alone dish. I'm still giving it two stars because I think some other ingenious chef can find a way to take this stew recipe and make it great. However, for me this recipe will be relegated to my \"never again\" list. Anonymous10/10/2018This was so good and easy.  Great one dish meal.  Kids loved it. bjherman22Maryland10/10/2018We're making the recipe right now—it says to use two heads of garlic cut crosswise. When you cut the garlic crosswise, the half not attached to the root half, falls apart. If they had stayed together, you're supposed to put the four halves into the pot with the garlic skin/paper on them, but no where does it say to take them out. I'm not understanding, when you take this out—or do you squeeze the garlic out at some point? Please clarify this for us. THXAnonymousR3M 0X610/8/2018We're making the recipe right now—it says to use two heads of garlic cut crosswise. When you cut the garlic crosswise, the half not attached to the root half, falls apart. If they had stayed together, you're supposed to put the four halves into the pot with the garlic skin/paper on them, but no where does it say to take them out. I'm not understanding, when you take this out—or do you squeeze the garlic out at some point? Please clarify this for us. THXAnonymousR3M 0X610/8/2018Explore Bon AppétitStewSoups and StewsMexicanLatin AmericanPork ShoulderPorkMeatChile de ÁrbolChileVegetableWinterMainDairy-FreeNut-FreeGluten-FreeBraiseSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}