{"id": "57ff0e5752e6a7cc3efe57e0dfdf64e3", "url": "https://www.bonappetit.com/story/basically-baking-is-over", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Don’t Cry Because Basically Baking Is Over | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Cry Because Basically Baking Is OverSmile because it happened!By Sarah JampelApril 15, 2020FacebookTwitterEmailPhoto by Sarah Jampel FacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hi Basically readers,This week the Guide to Better Baking came to a dramatic end with the most challenging (and rewarding) recipe of the bunch, Sohla El-Waylly’s Cinnamon-Date Sticky Buns. The buns themselves are light and feathery, almost like challah or brioche, and the cinnamon-spiked date purée is caramelly and not too sweet.They’re high on my list of things to make as soon as Passover ends (two more days!), along with Soba Noodles with Crispy Kale and homemade bagels. If you, too, want to make the buns but you’re like “How will two of us finish all of these?!” make a third of the glaze recipe, pour it generously over your portion, and freeze the rest, bare, for later.On Sunday we’ll leave baking behind for more dinner-appropriate Basically recipes, but we’ll still be checking on the baking forum to answer your questions.One Good TipTake InventoryPhoto by Sarah Jampel A few days ago my brilliant friend (...uh, can you tell what series I’ve been watching?) Mackenzie sent me this unsolicited photo of her refrigerator inventory list. I took many minutes to admire her organization, her handwriting, her use of recycled paper, and the amount of cheese she keeps on hand at any given moment. (She wanted me to note that this was a fridge primed to make potatoes au gratin and cinnamon rolls for Easter Sunday.) I’m feeling inspired to keep closer tabs on my fridge and to use Mackenzie’s star system to indicate what’s, um, “on its merry way” (that is, ready to get used up).The Most Comforting BowlIs Full of Priya Krishna's KhichdiPhoto by Sarah Jampel To make it, you simmer split mung beans and rice together, then season it with chhonk—spices, specifically cumin seeds and chiles, bloomed in hot ghee (I used butter). It took me all of 25 minutes from start to finish—the exact amount of time I can leave my computer and feel re-energized but not panicky. Priya shared the recipe on Basically this week—rejoice!Photo by Sarah Jampel This Week I’m Going To…Eat posset: I made this stupid-simple dessert—just cream cooked with sugar, then set with citrus juice—to carry me through the week-plus of Passover; it’s creamy, it’s tart, and you get to portion it into cute jars! I used lemon juice and layered in guava jamMake my first Caesar salad? TBH I’ve always thought of Caesar as a bowl of heavily-dressed greens, but Molly Baz has convinced me it’s one of The GreatsTry that frothy coffee thing but with matcha (what I’ve got) instead of instant coffee (what I’ve not got)Read! Finish Say Nothing and move onto Girl, Woman, OtherPut my sweaters in the closet and bring out the spring clothesAnxiously await the next episode of Samin Nosrat and Hrishikesh Hirway’s new podcast Home CookingSee you here next week!P.S. You all cared more deeply about the great banana bread vs. banana cake debate than I could have ever imagined. I loved reading your thoughts. A selection:Katie told me exactly what I needed to hear: “I'm happy to say that I agree with you 100%. Even if (and this isn't the case) the sole difference between the two lies in a smidge of icing and an extra hint of sugar, it would still be analogous to comparing sushi and sashimi. ““Rcwillman,” on the counter argument, put this horrifying thought in my head: “Turkey on banana bread? Tuna salad? Chickpea salad? NOPE! Some banana bread is like feather-light cake and some is like pound cake. But cake by any other name is still cake.”Suzanne’s husband buys bananas just so he can ignore them, knowing she will make them into banana bread. Oh, is that what’s happening in my apartment?Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Sarah Jampel"]}