{"id": "5804d38bde1d899346ad341dd47a40f7", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/hotel-sanders", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Hotel Sanders Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenHotel SandersHygge it up at this cozy boutique hotel near Copenhagen’s Royal TheatreFacebookPinterestTwitterEmailPhoto Courtesy of SandersGO HERE: to feel like a character in a Graham Greene novel—set in 1930s Copenhagen, of course. This luxurious boutique avoids the current hotel design tropes by going back to an earlier period of Danish design. Here you’ll find a more wicker-and-velvet mood, populated by a stylish mix of international design travelers.THE VIBE IS: in-the-know and elegant. Rooms are lovely, though the common spaces, from the fireplace-filled lobby to the rooftop atrium and bar, are even more atmospheric.WORD TO THE WISE: Stay in the the Coup´e room on a “budget” and in a Sanders apartment on an expense account. The location, on a magical block in the elegant design and theater district, puts you close to some of the city’s best eating spots, be it Apollo Bar or Ved Stranden 10. The staff is young, excellent, and used to demanding folks. Ask them anything!PRACTICAL STUFF: Rooms start at $375.—Christine MuhlkeWE ALSO LOVEHotel AlexandraTake home design tips from this midcentury City Hall Square hotel Slurp Ramen JointObsessively, meticulously made ramen that’s got people lining up in Indre ByNobis Hotel CopenhagenReally treat yourself at this luxe downtown district lodgingExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}