{"id": "5816b2de01619eb031c839868f081e0b", "url": "https://www.bonappetit.com/story/coronavirus-panic", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "As Coronavirus Panic Spreads, I Went in Search of Wuhan’s Defining Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAs Coronavirus Panic Spreads, I Went in Search of Wuhan’s Defining DishA bowl of re gan mian is economical, tasty, and filling, and if I’d tried them any other week, that would have been it.By Zoe YangFebruary 6, 2020FacebookTwitterEmailFacebookTwitterEmailThis week I learned that the defining dish of Wuhan, China is sesame noodle. In Wuhan, it goes by a name that is so on the nose that translation becomes pointless—re gan mian means “warm dry noodle.” The noodles are indeed warm and dry, and aside from sesame paste and sesame oil, they’re flavored with dark soy and chili oil, then topped with a smattering of crunchy, pickle-y things—eater’s choice.I went looking for re gan mian after becoming unmoored in a sea of coronavirus reportage, statistics, and takes. I was looking for grounding, for truth, for anything that could qualify as a primary source. In Flushing, at the New World Mall Food Court, there is a stall called Heat Noodle. According to the internet, Heat Noodle is the only place that serves re gan mian in New York, yet it’s a stall I’d previously overlooked on dozens of visits in favor of shinier things. Coming upon it was like entering Diagon Alley—oh, how did I not notice you before?I tried to attune myself to the mood in Flushing that day. Did the shoppers at JMart seem a little more hurried? Was the Food Court emptier than usual, or was it just in between mealtimes? The cashier at Heat Noodle wore a mask, and did she seem mildly surprised by my patronage, or was I projecting? It was hard to tell; in most ways, Flushing was Flushing, just with more masks.If all you knew of the virus was what you saw in public, you might think that only Chinese (or Chinese-looking) people are susceptible—that we are the virus.A few days before I went in search of re gan mian, a friend urged me to cancel our Chinese New Year plans because other Chinese people were canceling theirs, and my concern grew. Not for my personal health, but over the unfolding optics: more and more Chinese people were wearing masks and self-isolating. If all you knew of the virus was what you saw in public, you might think that only Chinese (or Chinese-looking) people are susceptible—that we are the virus.Indeed, a newspaper in France published an article about the epidemic under the headline “Yellow Peril?”, a phrase that is impossible to use in 2020 without understanding and thus participating in its ugly history. I saw photos of “Chinese not welcome” signs at restaurants in Vietnam and Thailand, and realized that the “bad Chinese tourist” meme had stopped being at all funny. The worst was when I fell into a Twitter wormhole and found all these posts by Uyghurs, the Muslim ethnic minority of Xinjiang province currently being “detained for re-education” by the Chinese government, rejoicing that God was punishing Han Chinese with a plague that forced them to wear face coverings. It was a gut punch, the same nauseous horror I had tuning in the days after 9/11 to images of people celebrating. Then, and now, it feels both urgent yet futile to point out that it’s the people who are dying, not their governments.I feel like I’m waking up to resentment against Chinese people that has been building all this time, and now the virus is laying it bare. A real tragedy, and the world is responding on a spectrum ranging from scientific detachment to open Schadenfreude. The sad thing is, I think I understand the xenophobia—the world has been fed a news diet of Chinese wealth and Chinese oppression—of trade, of information, of dissent, of ethnic minorities. As a Chinese immigrant, my body is seen as a fruiting body in a sinister yellow fungal network, grown too fast and too powerful, primed to release spores of disease across the world. I worry that the sight of Chinese people wearing masks in New York, where there are still no confirmed cases as of this writing, will only feed this perception, but I also know why people do it.In 2011, the year I lived in China to go to culinary school, the first thing that all my relatives—to a person—warned me about was getting scammed by people pretending to be hurt. I thought it was absurd until I read about the Nanjing judge case and its fallout: an elderly woman fell while getting off the bus, a young man helped her up and brought her to the hospital, whereupon her family arrived and promptly sued him, claiming that he’d pushed her. The judge ruled in her favor, reasoning that people don’t go so far out of their way to help strangers if they aren’t guilty. That year, I heard one horrific story after another of people dying while surrounded by other people because everyone was afraid they were faking it. To this day, I don’t even know if the original old lady in the story really was pushed, and it doesn’t matter—the judge’s opinion was the virus.So many things happen in China that feel fake, so many things happen in China that are fake, that people are never quite sure what to trust. Every day, there is a new exposé on food—oil collected from gutters and resold, plastic in boba balls, thousands of dead pigs washed up in a river and turned into pork.In July of 2011, two high-speed trains collided near Wenzhou, killing 40 passengers. Because the accident happened out in the open, government attempts to control reporting were painfully unsuccessful, and pictures circulated on social media of bulldozers supposedly burying evidence at the crash site. Almost overnight, public sentiment turned: the high-speed rail went from China’s pride to an extremely unsafe means of transportation to be undertaken with precaution. Heeding my aunties and uncles, I asked for a seat in one of the middle carriages every time I bought train tickets. On air, a CCTV anchor (a CCTV anchor!) wondered, “If nobody can be safe, do we still want this speed? Can we drink a glass of milk that's safe? Can we stay in an apartment that will not fall apart?”You understand that everyone is at most one generation removed from scarcity, and even the most prosperous know how precarious their fortunes are.I was not living in China during the SARS epidemic of 2003, and I arrived a few months after the Fukushima nuclear meltdown of early 2011, but I heard about the run on salt during Fukushima, and the run on turnips during SARS. And of course, the face masks. Living there, I came to understand the atmosphere of disorientation that breeds these extreme responses to disaster. Not living there, I’d forgotten what it feels like to be in it—to acclimate to it so fully that when people buy salt or middle carriage seats, you follow right along. You understand that people are not panicking, just acting on limited resources and different odds. Because these responses seem panicked only until you realize that Chinese people have survived so many weird apocryphal events in the time that living memory covers. You understand that everyone is at most one generation removed from scarcity, and even the most prosperous know how precarious their fortunes are.That year in China, I often thought about the Great Gatsby line: “a new world, material without being real, where poor ghosts, breathing dreams like air, drifted fortuitously about,\" and every day I felt like I knew less about my daily reality even as Chinese-ness resettled into my bones. Huckster ghosts were everywhere playing tricks, material things like buildings and trains crumbled like houses of cards, one day food was food and the next day it was not. I believe that everyone knows, deep down, that turnips and masks cannot actually keep you safe, but are necessary as talismans when there is so little in the way of real protection.I’ve been reminded this week that disasters are perfect opportunities for propaganda, and I’m not talking about in China. I don’t know to what extent there is a government cover-up going on there, but on mainstream American news, I’m unsettled by how a nascent story becomes The Narrative so quickly and so neatly, like concrete poured onto a pre-cleared path. The American Narrative is reminding us that China is home to gross-out foods and reckless appetites for wildlife (even though no Chinese person I know has eaten bat or civet, yet plenty of non-Chinese people I know have drunk coffee picked out of civet poop. Also, the virus may not have started in a market at all.) The Narrative characterizes the Wuhan quarantine as typically authoritarian Chinese behavior (I’m pretty sure the fictional city of Cedar Creek gets quarantined in the first 20 minutes of Outbreak and we were all okay with that). A New York Times reporter on The Daily blames “China’s authoritarian culture” as the reason the outbreak seemed to explode out of nowhere. A man whose relative just died is interviewed to make the point that because his relative wasn’t tested, the government is likely purposefully underreporting cases.I feel like I’m back in China, where truth was evasive, only now American Narratives have thickened the fog of uncertainty. The world seems convinced that China is faking something, and I’m reminded of the Nanjing judge case: Will Good Samaritans shun rather than help? Outside of China, are the face masks that people have relied on to feel safer in times of uncertainty now marking them as targets for hate?Exhausted by it all, I try to burrow into the spaces where Chinese people are speaking to one another. It’s not easy—my online habits do not contain the right infrastructure: I don't have a Weibo account or a VPN, and my Wechat contacts consist of immediate family and people who sell fake Givenchy bags. And even if I inhabited these spaces, I would only be able to read 40 percent of the content.Like a dog scratching at a closed door, I catch glimpses that make me emotional. There’s a short clip posted to WeChat of Wuhanese shouting encouragement to each other from high-rise to high-rise, making the air ring with “Wuhan jiayou!” There is a YouTube video called “My Boring Vacation” that purports to be a compilation of TikToks made by Wuhan people confined to their apartments. In it, people are doing all the things you do when you’re trapped at home—putting your dog in dumb costumes, choreographing dances, playing floor sports and pranks. And finally, there was the cartoon by Weibo artist @Chenxiaotaomomo, depicting a bowl of re gan mian in a hospital bed. Outside, a throng of friends—hot pot, soup dumplings, fishball skewers—gather holding signs saying “Re Gan Mian, jia you!” This cartoon slayed me and sent me in search of noodles.A bowl of re gan mian is economical, tasty, and filling, and if I’d tried them any other week, that would have been it. But last week in Flushing,  I thought about Wuhan, this modern metropolis of 12 million straddling the Yangtze in the agricultural heart of China. A city that has a cornucopia, but chooses these lowly breakfast noodles as its culinary soul. Noodles so simple they haven’t even bothered to try to become a thing outside of Wuhan. But then, everywhere I’ve been in China, I’ve learned about a humble dish like re gan mian, hardly recognized beyond the borders of that region, that is a source of local pride. Something untranslatable, unassuming, and self-possessed. Not meant to be eaten by outsiders but by the people who created it, dependable even if the world turns away.Explore Bon AppétitHealthyishNew York CityCoronavirusessayRead MoreLifestyleAs Protesters March in Hong Kong, I Cook to EscapeBy Mandy LeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-06", "author": ["Condé Nast", "Zoe Yang"]}