{"id": "583c7c02ed92baee521fdce0d02e32b6", "url": "https://www.bonappetit.com/story/food-tour-the-met", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "We Went on a Field Trip | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingInside Our Food-Themed Field Trip to The Metropolitan Museum of ArtSenior editor Alex Beggs details the “glorious” food tour in her weekly newsletter.By Alex BeggsJuly 30, 2018FacebookTwitterEmailPhoto by Rachel KartenFacebookTwitterEmailEvery Friday morning, Bon Appétit senior web editor Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.Art and food and pickles“YUM YUM MET!” Angelis shouted at the top of his museum voice. That’s the hashtag for his food tour of The Metropolitan Museum of Art, which a handful of BA’s digital team took this week. We followed the bouncy self-proclaimed “hyperactive dude” in a navy blue suit (silky pocket square and all) with a straw fedora through the museum, pausing to chat about art and food, symbolism, and oysters.“The Met is one of the biggest restaurants in the world!” he declared, holding up his menu for the day, a listing of the pieces we’d see. First up, Saint Nicholas with the Three Boys in the Pickling Tub, ca. 1500, a medieval wooden sculpture depicting the grotesque legend in which an evil butcher murders and PICKLES these kids, but Saint Nick saves ‘em. “This story, first of all, it’s creepy,” Angelis said. Yes. But no matter where you are in the world, “pickles is always there,” he mused in his delightful Greek accent, before handing us all some tiny plastic Heinz pickle pins. Go with it.We dodged tourists taking selfies in front of ancient nudie sculptures to see “the beer pong of the 1600s,” a wind-up gilded automaton. “Diana and the Stag” rolls around a table until it stops in front of a (super rich) guest, who has to chug wine from the stag. Next up: a Jean-Baptiste Greuze painting of a woman looking forlorn next to a basket of broken eggs, pictured above. Angelis asks us, “So, what is it about?” Healthyish editorial assistant Aliza Abarbanel knew right away: “She lost her virginity!” “DING DING DING!” Angelis replied (a signature move of his, the Met security guards love it). And we all laughed, proud of Aliza and embarrassed at our own cultural lackings.Want this letter before it hits the website? Sign up for our newsletter!I won’t give away any more, but we spanned centuries and mediums, with a brief spiel into the history of oysters in New York that lost me for a minute, but we left the museum with a new appreciation for drinking games, honestly. Oh, and art.Smart post-Met move: We went to Pastrami Queen for lunch after, pictured above.The most popular recipe this weekBy a LANDSLIDE was this life-changing (seriously!) recipe for chicken thighs cooked in a cold pan. Read about why that’s such a big deal here, and then try the new Basically recipe or my recent personal fave chicken thighs, these hot honey ones (with toast cooked in chicken fat, hello).Vaguely food-relatedI read Shirley Jackson’s The Haunting of Hill House last weekend, one of the best spooky books of all time. I highly recommend it for whatever the opposite of a beach read is—maybe with a headlamp next to a campfire? (Oh, I read it on the beach. Who cares!) I won’t give anything away but I swear there’s a food angle here. One of the caretakers of the house, Mrs. Dudley, cooks for the guests of the (obviously) haunted house, and I loved the descriptions of her cheese soufflés, caper sauce, peach shortcake (!), and more gourmet foods. If I were cooking in a haunted mansion I’d probably order in pizza, but Mrs. Dudley never sacrifices decorum.Chelsie CraigTaste the what now?From now through September, Lay’s is releasing “Taste of America” chips (“regionally-inspired flavors that represent distinctive tastes from every part of the country”). These are the kind of proto-kettle chips that crumble in your hands before they reach your mouth, and yet you find yourself SHOVING handfuls into your face anyway. A quick rundown:Deep Dish Pizza: Reminiscent of flavor-blasted pizza Goldfish (with less flavor blast), and strong hits of oregano and canned tomato sauce. Needs more “deep.” (The region, according to Lay’s: Heartland & Mid-America)Fried Pickles and Ranch: Intense dill pickle flavor, exactly as promised, with an ignorable plasticky note. (Midwest)Chesapeake Bay Crab Spice: An overpowering saltwater stank, the taste of biting into a bay leaf, flashbacks to accidentally eating grandma’s potpourri. (Mid-Atlantic)Thai Sweet Chili: Very sweeeeet. (Pacific Northwest)New England Lobster Roll: FAVORITE. Could’ve convinced me it was sour cream and onion, but this was the winner, despite not tasting lobster at all. (Northeast)Chile Con Queso: Unfortunate strong green pepper (the worst pepper) overtones, as with most things in life, needs more cheese dust. (Texoma aka Texas + Oklahoma, Mountain, SoCal)Cajun Spice: Burnt salsa. (Central Gulf)Pimiento Cheese: A nice matte orange hue, but odd off-milk, chemical aftertaste. Still smashed half the bag. (Southeast)Unnecessary food feud of the weekOn Tuesday and Wednesday we hit the peak of Thanksgiving in July. We almost went around the table professing what we’re thankful for (amaro, mostly). Andy Baraghani referred to the drippings inside of the (second in two days) roasted turkey as “turkey sauna steam water,” rejecting it for his gravy recipe. (Chris Morocco waved this off as silliness, all turkey sauna steam water should be valued equally.) On day two of making four Thanksgiving desserts at a time, Claire Saffitz watched her stunning cranberry tart leap off the tray and onto my dress (and soon after, the floor.) Someone gasped. Gaby Melian came running with the dustbuster, Brad Leone stood nearby pointing and laughing like Nelson on The Simpsons, and Good Guy Chris knelt down to help scoop the salvageable tart back onto the tray. I don’t think, however, the broken tart represented virginity, but Aliza can let us know. [Aliza: Nah. Just a long week.] Oh we ate it anyway—we had to!—testing out the balance of sweet, tart, and buttery. The pile of tart crumbs sat in a bowl on the counter, until photographer Alex Lau appeared with fork in hand, not here to judge, but to feast.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Alex Beggs"]}