{"id": "5842dfc809ec17c47ab8e6e36de3a83c", "url": "https://www.bonappetit.com/story/unfiltered-marto-weiss", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "It Didn't Feel Like Summer Until I Drank This Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIt Didn't Feel Like Summer Until I Drank This WineThe Marto “Weiss” is a bottle for blasting your summer playlist and dancing alone in your yard. By Marissa A. RossMay 28, 2020FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.It was Memorial Day weekend. Supposedly. All signs of the holiday were absent. There wasn’t grill smoke or laughter in the air, no frantic texts to pick up more ice, or buckets of wine to even put ice in. I laid a towel in a patch of sunshine and looked around our empty patio in our eerily quiet neighborhood, missing past summers, wondering about summers to come. I was bummed. Then I opened my bottle of 2018 Marto “Weiss.”The skin-contact blend of Muller-Thurgau and Riesling from young German winemaker Martin Wörner, aka “Marto,” is a hazy golden yellow, the same color as the fuzzy clustered flowers on my Jerusalem Sage plant that’s grown twice in size this spring. I’d be lying if I didn’t say the wine was slightly reductive, but it blew off quickly (without decanting) and was as fragrant as our Meyer Lemon tree with added aromas of honeysuckle and warm green melon left on a party platter. It tasted of smoked ripe cantaloupe freckled with sea salt and finished with energetic lemon squeezes; its soft, fleshy texture felt like tanned skin coming out of the shower after a long day in the sun.The Marto “Weiss” had me wishing I had buckets of ice to throw the bottle in, and a crowded patio, people shouting over my 11-hour “ULTIMATE SUMMER VIBES 4EVERRR” playlist. But instead of still feeling sad about everything that was missing, I tried to appreciate what I did have: A beautiful wine, full of life, which made me see quiet signs of more life around me: the fuzzy yellow flowered plant I didn’t know the name of until now and baby green lemons barely hanging onto their blooms.It also made me see the life that was still in me. With a fresh glass of “Weiss” in one hand and a Bluetooth speaker in the other, I blasted my playlist and danced alone in my yard. This summer isn’t going to be like others, but it’s still going to be summer. We just have to make it so.Explore Bon AppétitHealthyishUnfiltered Summernatural wineessayRead MoreLifestyleEverything Is Different So I'm Drinking a Wine That Doesn't ChangeBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "Marissa A. Ross"]}