{"id": "584ab5dfe277235b36f88136dae74d72", "url": "https://www.bonappetit.com/story/mushroom-jerky-roundup", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Mushroom Jerky Is Like Beef Jerky but With One Major Difference | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingMushroom Jerky Is Like Beef Jerky but With One Major DifferenceIt’s made of mushrooms!By Ali FrancisJuly 27, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Like a puppy with the zoomies after being stuck inside all day, I decided this summer to get out of Dodge. The vision: Drive around the U.S. with my boyfriend, chowin’ down on jerky with my feet on the dash. “Just the Slim Jims,” I imagined myself saying to every gas station attendant, ushering an armful of meat twigs across the counter. I mean, what’s not to love? They’re sweet-salty, chewy, filling, and arguably better for me than my other road trip kryptonite: Pringles. But then one night my boyfriend sent me an Instagram reel of a fluffy calf trotting happily about a farm, which triggered an hours-long baby cow video spiral, and a hysterical declaration that “You can’t love something *and* want to eat it!!!” So now I’m all stocked up on mushroom jerky instead.So, how does mushroom jerky compare to the meat stuff?First, allow me to state the obvious: mushroom jerky tastes like mushrooms—not beef. So if you don’t like fungi’s earthy flavors, this probably isn’t the product for you. But! If, like me, you’re trying to eat less meat and you’re down with ’shrooms, mushroom jerky is a great alternative. It’s immensely satisfying—fleshy, umami-packed, and filling—and fibrous mushrooms seem to soak up flavors and seasonings like nature’s little sponges. As chef, writer, and Emmy Award–nominated TV host Sophia Roe says, mushroom jerky “makes you think, ‘Wow, this is definitely made of meat,’” without, well, being made of meat.Another perk of going full fungi: not only is mushroom jerky delicious and seriously nutritious, but I also feel better knowing it’s gentler on the earth than beef. And mushrooms are a sustainable alternative to more than just fake meat. Thanks to their unique structure and chemical properties, they provide the ideal building blocks for everything from housing insulation to faux leather.I’m sold. Can I make it myself?Yes! However, I am but a mere mushroom stan, so I asked Roe for advice. Here’s how she makes mushroom jerky:Toss 8 oz. mushrooms (Roe usually goes for shiitakes, but choose your faves. Know this: Your jerky will only be as good as the mushrooms you buy, so opt for something “meaty” and flavorful) and coat them in about ¼ cup coconut aminos, 2 tsp. apple cider vinegar, 1 tsp. paprika, a splash of liquid smoke (optional), and a few cracks black pepper. (For extra flavor oomph, store marinated mushrooms in a resealable bag and refrigerate overnight before dehydrating.)Preheat your oven to its lowest temperature (usually around 250℉). Line a sheet pan with a Silpat, spread out your mushrooms, and bake for an hour.If your mushrooms are large or still wet-looking, flip them with tongs and bake for another 30–45 minutes. The finished product should look wrinkly and shrunken, like dried fruit. Let cool and store in an airtight container.I’m not that guy. Can I buy mushroom jerky instead?Great news: There are plenty of store-bought jerkies that are just as delicious as the homemade stuff AND easier to acquire for lazy people and people on road trips (me and me!). The ones below are some of the best I’ve sampled, but the world is really your oyster (mushroom).Moku Hawaiian Teriyaki Mushroom JerkyWith a moderately sticky texture and a sweet-salty flavor, thanks to pineapple juice and coconut aminos, Moku’s king oyster mushroom jerky is the ideal gateway to fungi fandom.$21 at Amazon (3-Pack)VEGKY Pepper Shiitake Mushroom JerkyIf you love Chinese Five Spice, you’re going to love this shiitake jerky, which, textually, seemed most similar to the beef stuff.$8 at AmazonPan’s Applewood BBQ Mushroom JerkyIf you’re having a hard time getting your hands on this smoky-chewy shiitake jerky, that’s because it’s flying off the virtual shelves. Worth the wait!$7 at Thrive Market$8 at HiveEat the Change Habanero BBQ Mushroom JerkyLike things hot? Then you’ll love this portabella and crimini jerky, flavored with spicy peppers, sweet pineapple, and tart tamarind.$6 at Thrive MarketSavory Wild Sesame, Ginger & Korean Chili Portabella Mushroom JerkyMild, sliced portabella mushrooms are marinated in soy, garlic, and gojuchang for a lightly spiced, umami-packed riff.$10 at Amazon$10 at WalmartI bought...a lot of mushroom jerky. What can I do besides eat it right out of the bag?Here’s what I’ve realized on my road trip thus far: Because it’s already “cooked” and seasoned, mushroom jerky is a superfast route to flavorful and substantial meals and snacks. I’ve tossed many a packet in salads for some textural heft. I’ve stir-fried those little hunks with broccoli and rice as a shortcut to various Airbnb dinners. I’ve snuck a few slices into sandwiches for a little fleshy kick. And I’ve sliced them into a sort of savory trail mix with nuts and seeds. But don’t let me limit your magical mushroom jerky journey. Go wild! Try it all! And know that Mother Earth and her sweet baby moo-moos will be grateful you did.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-27", "author": ["Condé Nast", "Ali Francis"]}