{"id": "5852073f5c7c35e4bb2ad3a02e7c8fad", "url": "https://www.bonappetit.com/story/lake-champlain-5-star-peanut-bar", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "The Lake Champlain 5 Star Peanut Bar Is My Candy Holy Grail | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Candy Bar Is 75 Percent Peanut Butter, So Of Course I’m ObsessedIf you eat jars of nut butter by the spoonful, you’ll love Lake Champlain’s Peanut Five Star Bar.By Aliza AbarbanelApril 9, 2020FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.In my mind, there are only two types of candies: those with chocolate-peanut butter, and everything else. As a kid, I swapped Jolly Ranchers, Snickers, and the rest of my trick o’ treat spoils for all the Reese’s in my sister’s pillowcase. Now that I’m an adult who can buy my own damn candy, I have a new peanut butter-laced fixation: Lake Champlain’s Peanut Five Star Bars.If you happily subsist on daily PB&J sandwiches and inhale jars of nut butter by the spoonful, you need this bar in your life. The magic lies in its ratio of peanut butter to chocolate, which is absurdly high in favor of gooey peanut butter—about 75 percent! While this guess is wholly unscientific, it’s been tested over many late-night snacks...and I can say with confidence, it feels right.) The nut butter is studded with crispy rice and salted peanuts, creating contrasting textures to ward off that sticky mouth feel that comes from eating too much nut butter. (Don’t lie, you know the feeling.) And while I usually prefer dark chocolate, the sweet milk chocolate coating here ties each component together.To state the obvious, this is one rich candy bar. It’s reminiscent of the thick slabs of peanut butter fudge sold at charmingly kitschy roadside attractions, and that’s exactly what I want anytime I need something sweet.I don’t even pretend to have willpower when I have one of these bars in my clutches, which is why I stuff them in my freezer to stretch out the experience as long as possible. Instead of chomping down with reckless abandon, I slice frozen bars into delicate shards, then slowly, luxuriously pop each piece into my mouth like a Roman emperor. Or at least, things start out that way. Inevitably, my nut butter-addled brain short-circuits, and the last few slices disappear in a blur of chocolate-smeared fingers. It’s messy, peanut-buttery bliss.Buy it: Lake Champlain Peanut Five Star Bar, $4 at Lake Champlain ChocolatesAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendCandyShoppingRead MorecultureLotus Biscoff Cookies Are My Coffee’s Best FriendBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Aliza Abarbanel"]}