{"id": "58600d98ac4955a7ef0a17096dcb6205", "url": "https://www.bonappetit.com/story/zaid-renato-consuegra-sauza-pirates-bone", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "The Undocumented Chef Behind Kansas City’s Most Inclusive Restaurant, Pirates Bone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Undocumented Chef Behind Kansas City’s Most Inclusive RestaurantZaid Renato Consuegra Sauza got into cooking because he had few options. Now, with his vegan restaurant Pirate’s Bone Burgers, he’s one of the city’s rising stars, and most outspoken advocates for justice for all. By  Eric GinsburgNovember 21, 2019FacebookTwitterEmailPhoto by Barrett EmkeFacebookTwitterEmailZaid Renato Consuegra Sauza never dreamed of becoming a chef. Under other circumstances, he might be living in Boston instead of Kansas City. He might have finished school. He might be making movies for a living, as he’d originally planned.“If I was documented,” he says, “I’m 90 percent sure I would’ve taken my life a different way.”With a tattoo wrapped around the back of his right hand and a colorful calavera and crossbones taking up most of the inside of his right forearm, Sauza certainly looks like a millennial chef. His scraggly beard and the colorful beanies he wears atop his closely cropped head seem right at home behind the counter of Pirate’s Bone Burgers, the vegan restaurant he opened in Kansas City, Missouri, earlier this year. Here, in the high-traffic Crossroads neighborhood, Sauza slings juicy beet burgers and fries topped with melty cashew cheese. His deftly executed plant-based menu and determination to build a welcoming space set him apart. “It has definitely opened a lot of eyes as to whether or not people want more vegan food here,” Kansas City food writer April Fleming says. “I think it’s clear by the response that people do.”Named one of the city’s “rising stars” last year, fitting in is new for Sauza. He wasn’t quite 11 years old when he and his family immigrated from Mexico City to Shawnee, a porcelain-white suburb to Kansas City’s southwest. “When I got to Kansas, I realized how different it was than I had envisioned,” he says. “I thought everyone in America lived like The Nanny. That balloon popped real quick.”At school, his classmates often bullied him for being Mexican, and being short didn’t help. And although he came to the U.S. legally on a tourist visa, he became undocumented just six months later, after overstaying the cutoff.“I remember quite clearly when a classmate of mine called me an illegal alien,” he says. “At the time I didn’t know what that was. I knew it was bad. I knew that I was being picked on. But my only conclusion was that I looked weird—that I looked like an alien.”In high school his family opened a movie rental shop, later expanding into a robust corner store with an array of products and its own kitchen. Working there consumed Sauza’s social life. “I remember birthdays and Christmas not being a thing,” he says. “It’s the same immigrant story you’ll hear from other people—always striving for more, but not necessarily being in the now.”Eager to escape Kansas, Sauza moved to Boston after high school and enrolled in a continuing education film and television program at Emerson College. It was all he could afford, and it didn’t require him to provide a Social Security number. He thrived there, but when he tried to level up to a bachelor’s degree, the school refused to admit him without proof of legal status. He threw himself at the mercy of a college administrator, literally begging her, down on his knees in her office, to help him. It didn’t work.So instead, Sauza enrolled in a community college where the rules were more lax and graduated with an associate’s degree. But then his status intervened again. He’d gotten a driver’s license—his best form of legal ID—back in Kansas, but state law had changed, and it was set to expire. There was nothing to be done but move back, where he took a job as a server at a Mexican restaurant, one of the few places that would hire him as an undocumented person.“It was one of those restaurants that just beats your life out of you,” Sauza said. At one point while cleaning tables, Sauza told his manager that he had a college degree. “If you actually had a degree, you wouldn’t be working here like any of these other wetbacks,” the manager replied.The beet burger on a charcoal bun at Pirate’s Bone Burgers.\nPhoto by Barrett EmkeSauza quit on the spot and soon returned to his mother’s store. A new Walmart was threatening to force the small business into the ground, so in a desperate attempt to save it, Sauza offered to take over the kitchen. “That was the silliest thing I could do,” he says. “I had never been in a kitchen before.” Yet he reveled in the chance to experiment and felt proud of what he was creating without any guidance: Fresh-baked focaccia and ciabatta. Meats he learned to butcher himself. New dishes pulled straight from his imagination, like drunken fish marinated in white wine and served with spicy Thai peppers.\nIn time he managed to attract a couple of regulars and confided in one that he secretly longed to open his own coffee shop. To his surprise, the customer offered him a loan.Sauza taught himself skills by watching YouTube videos. He found an espresso machine at a yard sale and perfected a method of pan-roasting his beans on the stove—a time-consuming process but one that’s more aromatic and offers intense flavor. And then, in January 2014, as he prepared to open his coffee shop in a tiny plaza in Kansas City’s Brookside neighborhood, Sauza got another break: He was approved for DACA. The Obama administration had issued an executive order on immigration two years earlier, and Sauza was among more than 800,000 recipients, all of whom were brought to the U.S. as children.The program provided Sauza with deportation protection, making it possible for him to drive to work without fear for the first time. Soon after his approval, Sauza hung a pirate flag on the wall of his shop and opened for business. He called the place Pirate’s Bone.Customers came slowly at first, but the shop began attracting citywide attention when Sauza put more experimental drinks—like a chocolate latte with subtly spicy guajillo peppers—on the menu. Then he expanded to food, and in 2017 switched to all vegan products, pulling from his Mexican roots to invent new dishes. There was a jackfruit pozole that used the dense, fibrous fruit to mimic the taste of pork. A pinto bean and cactus soup topped with greens, a dash of olive oil, and sesame seeds to round out the flavor. His vibrant beet-based veggie burger, served on an inky-black activated charcoal bun, became his local calling card. With it, Sauza started drawing press coverage and customers from around the city.Zaid, behind the counter.\nPhoto by Barrett EmkeAround the same time, the Trump administration was attempting to quash DACA despite the program’s strong bipartisan support. More than 10 lawsuits were filed challenging the move, and court injunctions kept the program partially intact. Three cases went to the Supreme Court in early November, and rulings are expected to come in the spring of 2020. The results will determine the fate of nearly a million DACA recipients like Sauza who would become targets for deportation if the court rules against them.Though DACA provides deportation protection, the risks Sauza runs by being public about his status are real. Some immigration activists say ICE is targeting them, and it’s unclear how the Supreme Court will rule. Sauza has already faced some conservative backlash online. It’s hard for him to shake the fear ingrained from years of being undocumented. “The other day I was driving to work and I passed a yellow light that turned red quickly,” he says. “I had a cop right behind me and man, did I get chills. Once you live a certain way most of your life, it’s really hard not to live that same way. Even with a license.”But that hasn’t stopped him from becoming an activist. In the years since he opened his shop, Sauza has written an op-ed for a local newspaper, lobbied in Washington, D.C., shared his story on YouTube to inspire others, and joined national activist group United We Dream and a Kansas City–based immigrant rights coalition called KSMODA that advocates for local undocumented immigrants. He also agreed to be a part of an amicus brief accompanying the cases at the Supreme Court. Sauza is one of 27 DACA recipients who shared their stories in the hopes that it will help sway the justices.“Nobody that hasn’t been in these shoes can know how hard it is to live in the shadows,” he says. “I can’t just cross my arms and hope somebody changes their minds. If I keep silent, nothing will get done.”But Sauza refuses to let fear rule him. Like becoming an entrepreneur, it’s one of the things you learn to conquer out of necessity. “I can’t take minimum wage,” he says. “I will not be satisfied with the breadcrumbs that we get as immigrant people. We’ve only been taught to settle, but we want to do better than settle.”To this end, Sauza decided to close his coffee shop and go bigger. This past September he and his business partner, Lydia Palma, opened a fast-casual restaurant, Pirate’s Bone Burgers. With the tagline “Feeding more plants to more people,” the restaurant trades on its iconic black charcoal buns. It pulls from Sauza’s success at the coffee shop, offering his beloved Dirty Horchata and the beet burger with guacamole, pickled cabbage, and greens. Sauza wanted to keep the menu simple in order to focus on quality, and most items follow the burger or sandwich approach, though he’s also incorporated items like maduros (sweet plantains) and tostones (green plantain chips).A quiet day at the restaurant.\nPhoto by Barrett EmkeAlmost as soon as the restaurant opened, demand overwhelmed the small staff. Sauza and his team went through more food in a week than they’d expected to need all month. It’s exhausting yet thrilling, he says, to have a vegan, plant-based restaurant become so popular “in the middle of meat and potatoes country.” Just a few weeks in and still staffing up to meet demand, he’s already thinking about how to expand to other cities.Yet the significance of Pirate’s Bone Burgers extends well beyond the food. It’s essential to Sauza that his restaurant is as inclusive as possible, an effort that takes a variety of forms. Pirate’s Bone Burgers is one of the most ADA-accessible restaurants in Kansas City, and he’s having the menu translated into Braille. To reach across class lines, the restaurant is accessible to public transit and nothing costs more than $5. Sauza will help offset operating costs by hosting occasional fancier pop-ups in the restaurant. Staff will go through various sensitivity and bystander trainings to build the most welcoming space possible.“I think he’s inspiring because he’s built something lovely despite a lot of obstacles,” April Fleming, the food writer, says. “Obstacles that would be really difficult for most people to overcome. I don’t think he had a ton of support before he opened, meaning he wasn’t one of the ‘cool kids’ in the industry here.”Sauza’s activism and social conscience have made him “a leading voice” in the city,  especially on immigration, says acclaimed local chef Howard Hanna, who owns two Kansas City restaurants, including The Reiger next door to Pirate’s Bone. “That’s what we need, that kind of creative drive, and being a good employer and a good neighbor,” he says. “Immigration is a key issue for all of us in the food industry. When Trump’s DACA repeal was announced and Zaid was vocal about that, for many of us, that was really important.”Food may not be the future Sauza envisioned for himself, or the path he would’ve chosen if our country’s immigration laws were different. But as someone who’s spent most of his life feeling marginalized, he’s managed to turn food into an instrument of inclusion. Here at Pirate’s Bone, he’s carved out a space for not only himself, but anyone else who needs it.“I guess it’s because I’ve always been the outsider,” he says. “I can totally understand what it feels like to not be wanted—just for being different.”Explore Bon AppétitChefsRestaurantsKansas CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-21", "author": ["Condé Nast", "Eric Ginsburg"]}