{"id": "586a94fa2c3c7e2614267a72a539c202", "url": "https://www.bonappetit.com/story/beef-brisket-recipe-alison-roman", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Alison Roman’s Brisket Is Nothing Like Her Grandma’s—and That’s a Good Thing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAlison Roman’s Brisket Is Nothing Like Her Grandma’s—and That’s a Good ThingThe best-selling cookbook author shares her recipe for a tangy, herby brisket—no ketchup required.By Alison RomanDecember 3, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Pearl Jones, prop styling by Sophie StrangioFacebookTwitterEmailMy grandmother is a horrible cook with a lot of heart. The kind of woman who’d spend hours carving swan figures out of crookneck squash but couldn’t even make a good brisket (the fattiest, most mess-up-proof cut of meat). Unfortunately for my family, this was what she made for literally any holiday. The Jewish ones, the non-Jewish ones, the Jewish-ish ones.Jews and those who love them know the kind of brisket I’m talking about: smothered in ketchup with too much sugar and too little salt, cooked either not enough or too much but somehow either way results in a sweet, gloppy, underseasoned, too-tough hunk of meat. And to those rings of uncaramelized onions, I ask, who sent you?As I sampled other briskets from other home kitchens over the years, I realized I was maybe being too hard on Grandma because I couldn’t really get behind, well, any brisket. Even recipes from this very website follow that same ketchup-y, meatloaf-inspired formula. How could Grandma have known better?I refuse to accept this brisket narrative.I want to make brisket worth looking forward to. I want to cook brisket like I’d cook any tough, beefy cut: seasoned heavily with salt and pepper, seared until deeply browned, strewn with caramelized savory aromatics (no mushy carrots!), and braised until fall-apart tender.I want to uncover that perfect piece of meat, crank the oven, and brown the top again, restoring the crust lost in the braise and reducing the liquid to a rich spoonable sauce. And I want to scatter the whole thing with fresh herbs. And yeah, of course there will be red pepper flakes because every hunk of meat deserves some heat and I like what I like.My grandma is unfortunately (or fortunately, depending on how you see it) past her brisket-making prime, and I don’t think she’d easily embrace this new- school ideology. But if she really wants, I’ll serve hers with a side of ketchup.Get the recipe:Tangy Brisket With Fennel and HerbsAlison Roman made a brisket worth looking forward to. No ketchup—no mushy carrots.View RecipeExplore Bon AppétitBrisketPartyRead MorecultureHow to Host a Dinner Party Without Losing Your Mind, According to Alison RomanBy Alison RomancookingSteak and Potatoes Night in AmericaBy Adam RapoportcookingIf You Can Open a Cheap Beer, You Can Make This CocktailBy Alison RomancookingWhen a House Full of Hungry Friends Calls, Alison Roman Makes Brothy MeatballsBy Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-03", "author": ["Condé Nast", "Alison Roman"]}