{"id": "586e754b9e2bfd573b2fca1f01186de2", "url": "https://www.bonappetit.com/recipe/candy-cane-ice-cream-in-a-bag", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Candy Cane Ice Cream in a Bag Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCandy Cane Ice Cream in a BagBy Kendra VaculinNovember 23, 20214.8(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Josephine Schiele. Food styling by Rebecca Jurkevich.EmailPinterestPrintEmailPinterestPrintNo ice cream maker, no problem. With this technique, you can whip up a bowl of ice cream all by yourself using just two zip-top bags, rock salt, and a bunch of ice. Shaking the bag for a full 10 minutes, which is longer than you might think, is critical! Wear gloves and shake outdoors or over a sink to catch any drips.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChefmaster Liqua-Gel Starter Set$16 At AmazonIce Cream Scoop$13 At AmazonGlass Measuring Cup$19.99 At AmazonWhisk$10 At AmazonIngredients1 Serving½cup half-and-half¼cup heavy cream1Tbsp. sugar½tsp. peppermint extractPinch of kosher salt½cup rock saltRed gel food coloring and crushed candy cane (for serving)PreparationStep 1Whisk half-and-half, cream, sugar, peppermint extract, and kosher salt in a small bowl to combine; chill ice cream base in freezer 15 minutes.Step 2Fill a 1-gal. resealable plastic bag two thirds of the way with ice (4–8 cups, depending on the size of your ice). Add rock salt, close bag, and shake to combine. Remove ice cream base from freezer and stir to incorporate any sugar at the bottom of the bowl. Pour into a sandwich-size resealable plastic bag and close. Place into larger bag with ice. Seal larger bag and shake and smush ice around until ice cream is firm, 10–12 minutes.Step 3Remove ice cream from bag of ice. (If it is too firm to scoop from bag, massage with your hands for a minute to soften ice cream.) Scoop ice cream into a clean small bowl. Using a toothpick, add food coloring to ice cream, dragging it through to create streaks. Top with candy cane pieces.How would you rate Candy Cane Ice Cream in a Bag?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleYes, Doby, who knew 2nd grade kitchen science would end up in the pages of BA!MacyeMaeMadison, WI12/25/2021I used to teach science in elementary school. Making ice cream with this recipe was a standard second grade lesson to discuss properties of solids and liquids. Now it is in Bon Appetit. Who knew?DobyBellingham, WA12/25/2021Good idea for a single serving when you have the time to make it. However, if you want some Ice Cream now, a good quality ice cream directly for the freezer previously purchased at a store is really really good.Baker TedNE Florida12/25/2021Explore Bon AppétitDessertFrozen DessertEasy5 Ingredients or FewerNut-FreeGluten-FreeIce CreamChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kendra Vaculin"]}