{"id": "58729909a272a5b3bf21c012840acef4", "url": "https://www.bonappetit.com/recipe/white-bean-and-spring-vegetable-stew", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "White Bean and Spring Vegetable Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWhite Bean and Spring Vegetable StewBy Amiel StanekJune 12, 20194.5(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis stew recipe is all about those lovingly cooked and seasoned dried beans and the glorious (vegan!) broth they create. Just keep in mind that for the best results, you have to soak the beans overnight. Though asparagus and peas scream “spring!” this really is a stew for all seasons—those veggies can be swapped with whatever looks good at the market, as long as they’re quick-cooking and/or thinly sliced.Ingredients8 servings1lb. dried large white beans (such as lima or gigante), soaked overnight, drained1onion, trimmed, peeled, halved through core3ribs celery, trimmed, halved1oz. dried shiitake mushrooms (about 10 large caps)8sprigs parsley, plus ¾ cup parsley leaves with tender stems1head of garlic, halved, plus 1 garlic clove, finely grated1Tbsp. plus 1 tsp. kosher salt, plus more¾cup plus 3 Tbsp. extra-virgin olive oil, plus more for drizzling, divided¾cup mint leaves1bunch radishes1bunch medium-size asparagus (about 1 lb.)110-oz. bag frozen peas, thawed8thick slices country or sourdough bread14\" piece fresh horseradish root, peeled1lemon, cut into 8 wedgesPreparationStep 1Preheat oven to 300°. Combine beans, onion, celery, mushrooms, parsley sprigs, halved head of garlic, 1 Tbsp. salt, 3 Tbsp. oil, and 2 qt. water in a large Dutch oven. Bring to a simmer over medium-high heat, cover, and transfer to oven. Bake until beans are fully cooked, tender, and creamy through and through but as intact as humanly possible, about 1 hour, depending on the type, brand, and age of beans; start checking every 10 minutes after the first 45 minutes. (When checking beans for doneness, stir gently and taste at least 3 beans—it isn’t finished until they’re all tender!)Step 2Using tongs, fish out aromatics and discard. Season with salt. Be generous! Under-seasoned beans are barely worth eating. Let sit on stovetop, uncovered, until ready to serve.Step 3While beans are cooking, make your pistou and prep the vegetables and garnishes. Using your sharpest knife, finely chop mint and ¾ cup parsley leaves. (A dull knife will just mash your herbs and cause them to turn dark around the edges.) Transfer to a small bowl. Add ¾ cup oil, grated garlic, and 1 tsp. salt and stir to combine; set pistou aside.Step 4Trim and wash radishes, then slice as thinly as possible into coins (a mandoline really helps here). Transfer radishes to a small bowl, cover with cold water, and chill until ready to use.Step 5Wash asparagus and trim woody stems by bending each spear near the cut end until you find the place where it wants to break naturally. Cut off tips, then cut each tip in half lengthwise. Slice now-tipless stalks crosswise into thin coins. Toss asparagus coins and tips and peas in a medium bowl; set aside.Step 6When you’re almost ready to serve the stew, return beans to a gentle simmer over medium heat, taking care not to stir too much—you don’t want to bust up those beans!Step 7Generously drizzle oil into a large cast-iron skillet and heat over medium until shimmering. Working in two batches, fry bread slices until golden brown on both sides, about 2 minutes per side. Season with salt and transfer to a plate. (You may have to add more oil between batches, as the bread will soak some of it up.)Step 8When beans are simmering, add reserved asparagus and peas and cook, stirring gently, until asparagus coins are barely cooked but still bright green and crunchy, about 2 minutes.Step 9Drain reserved radishes. Place horseradish root on a plate with a Microplane (the way you’d serve Parmesan). Bring Dutch oven full of stew directly to the table. Serve with fried bread, pistou, radishes, lemon wedges, and horseradish alongside.How would you rate White Bean and Spring Vegetable Stew?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleSpringtime in a bowl!  Used our precious Rancho Gordo cassoulet beans and they were perfectly creamy at 75 minutes in the oven (after an 18 hour overnight soak: we are at 3800' elevation). I also added a few swipes of lemon zest into the piston which added more brightness and zing an already amazing dish (and made up some for my lack of horseradish). 5 stars!AnonymousRockies3/14/2021I love this recipe! So stoked that it is springtime and I can make this again! I used my extra special Rancho Gordo cassoulet beans last year and it turned out great--I think this year I'll try it with limas. Another thing: prepared horseradish is not as great as fresh but works just fine in a pinch for this recipe.  ErinPortland, OR3/3/2021The article was endearing enough for me to try, but honestly, the most dull combinations of flavors ever put together.  Flavorless, even with the garlic, aromatics, horseradish and radishes.  It needed more spice, heat and, possibly, acidic.Eric MilletichAstoria, NY6/22/2020delicious :)Anonymous6/6/2020Deeply satisfying, especially for a vegan recipe! We subbed fresh shiitakes for dried and used prepared horseradish. I swapped the parsley for cilantro because I think fresh parsley can be overpowering. Just brilliant!! Alexandria, VA 5/24/2020When it says to remove aromatics. I assume it means garlic, onion, parsley, and celery. What do i do with them throw them out?AnonymousOhio5/18/2020This recipe was such a delight! So many different bright spring flavors and really easy to make! I was able to get everything called for, including horseradish! I used Rancho Gordo Cassoulet (Tarbais) Beans, which after soaking 18+ hours cooked a little faster than the recipe called for since they were really falling apart after 45/50 mins in the oven. I served it with NYT no-knead bread which was well paired in its ease of making and long prep times - both perfect for SIP!AnonymousSan Francisco, CA5/7/2020This was........... STUNNING. I made lots of changes because of lack of ingredients in quarantine (miso instead of mushrooms, yellow eye beans, put the beans on the stovetop after the oven because they weren't done yet, cilantro and dill instead of parsley and mint, sugar snap peas instead of frozen) but let me tell you, it worked! Also, I spooned the beans & broth into bowls and then topped with the raw asparagus and peas. Also topped with crushed fried & dried red italian peppers. Never felt so proud of a meal I've made in my own kitchen. I will make this many times over!meghannashLos Angeles, CA5/2/2020Amiel. I love you. This is the bombest thing we've eaten in six weeks. We finished dinner 10 minutes ago - the beans were so creamy! the broth, so flavorful! the asparagus and peas, so fresh! - and I'm compulsively dipping the leftover radish slices into the pistou. I can't stop. It's perfect. (I, too didn't have horseradish, and we used the .6 oz of dried maitakes we had in the pantry, and it was nonetheless unimaginably delicious.) AnonymousWaltham, MA5/2/2020OMG! AMAZBALL!\nSo delish! I used Lima beans, and fresh shiitake ( didn’t have dried). I peeled and cut up all the aromatics and just left them in the broth, I didn’t bother to remove them, I also used a little bit of chickpea water from the best chickpeas ( another amazing recipe from BA) I made last week, yum!! I didn’t have mint or horseradish so skipped them and it was still amazing!! My husband loved it!AnonymousJacksonville Florida 4/19/2020This was totally delicious! I used Rancho Gordo Corona beans (I kid you not) and they took forever to soften. I ended up finished them up on the stovetop. But pay no mind, the final result was fabulous. Don't substitute if you don’t have to... it’s perfect just the way it is! Kristina PhippsWoodside, CA4/11/2020I made this last night and it was really great. In quarantine, so had to make do with a couple things (green beans instead of asparagus, dried porcini instead of shiitake), but it came out perfectly. Really filling and interesting flavors - the mint/parsley pistou complements the soup really well.AnonymousLos Angeles, CA4/2/2020I totally forgot to soak the beans and thought: oh I can just cook them in my instant pot like chickpeas. Nope. Don't do that. They totally fall apart. All that was left 85% of them were shells. Still the ones that survived were very tasty. Would recommend using lima beans if you can find them. It's so fun to eat a big bean.AnonymousVancouver, BC3/27/2020I didn’t have big beans, so used navy beans (they were done in 55 minutes). I didn’t have dried shiitake, but I had a pound of crimini mushrooms, so I seared those in a pan with butter, salt & pepper, and added to bean pot. My husband doesn’t like mint, so I skipped that. My bag of frozen peas was 16 oz, so I threw them all in. I didn’t have horseradish root (and these are shelter-at-home times) so I skipped that part. Ya know what? It was an amazing meal. So glad we have leftovers for tomorrow night and will be making this (or a version thereof) again and again. andie1024San Rafael, CA3/24/2020Love love love this ! I didn't have mushrooms so I added a good tablespoon of marmite to the broth (and adjusted the salt accordingly). If this seems like a crazy swap, don't worry, it works very well ;)\nAside from that followed the recipe exactly and it was super easy and a huge success. Will make again every year for spring for sure.Isabel helloMontreal, QC3/24/2020Explore Bon AppétitStewSoups and StewsAsparagusVegetablePeaLima BeanWhite BeanBeanGigante BeanRadishSpringMainDairy-FreeNut-FreeVeganVegetarianHealthyishSimmerEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Amiel Stanek"]}