{"id": "587cc335a5152560cf43a2e2113fb99f", "url": "https://www.bonappetit.com/recipe/spiced-dal-with-fluffy-rice-and-salted-yogurt", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Spiced Dal with Fluffy Rice and Salted Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSpiced Dal with Fluffy Rice and Salted YogurtBy Andy BaraghaniJanuary 9, 20184.1(38)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintDal tends to firm as it sits, so make sure to add a splash or so of water if you’re reheating it. Stews and braises need acidity for balance. In this dish, lentils get a double dose of tartness from lime-marinated red onion and a drizzle of tangy yogurt.Ingredients4 servings2tablespoons ghee, virgin coconut oil, or vegetable oil1medium yellow onion, finely chopped12-inch piece ginger, peeled, finely grated2garlic cloves, finely grated1½cups red lentils (masoor dal), rinsed2teaspoons ground coriander1teaspoon ground turmeric½teaspoon ground cardamomPinch of crushed red pepper flakesKosher salt1lime1small red onion, very thinly sliced into rounds, rinsedPinch of sugar½cup plain whole-milk Greek yogurtCooked Jasmine or basmati rice (for serving)Freshly ground black pepperPreparationStep 1Heat ghee in a medium pot over medium-high. Add onion and cook, stirring occasionally, until softened and lightly browned around the edges, 5–7 minutes. Add ginger and garlic and cook, stirring often, just to take the edge off garlic, about 30 seconds. Add ⅓ cup water and simmer, stirring occasionally, until water evaporates, about 1 minute. Add split peas, coriander, turmeric, cardamom, and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Add 4 cups water and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until split peas are very tender and most of the liquid is absorbed, 12–14 minutes; season with salt. Cover with a lid and keep dal warm over low heat while you make the toppings.Step 2Finely grate zest from lime into a small bowl. Cut lime in half and squeeze juice into bowl (you’ll have about 2 Tbsp.). Add red onion, sugar, and a large pinch of salt and toss, squeezing onion with your hands to help it soften quickly.Step 3Mix yogurt and 2 Tbsp. water in a small bowl; season with salt.Step 4Serve dal over rice drizzled with salty yogurt and topped with onion and pepper.Step 5Do Ahead: Dal (without yogurt and onion) can be made 1 day ahead. Let cool; cover and chill.How would you rate Spiced Dal with Fluffy Rice and Salted Yogurt?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThe recipe keeps jumping away\nIs it intentional?I just started to eat plant based\nYou are getting a lot of replies like thisBettySan Diego3/22/2022I’ve made this recipe a few times, and it’s so incredibly delicious. I was surprised to read through so many negative comments below, but it probably does vary wildly depending on the type of bean you use. I use red lentils, and they were super soft and mushy right around 12 minutes like the recipe states. Since this recipe doesn’t have any veggies I also chopped two carrots in the food processor until they were very fine, added them to the mixture along with the lentils and a cup more of water, and this was my best tasting one! Just stick to red lentils and this recipe will be a total breeze. Valeria1/29/2021I see after a pile of complaints, this recipe must have been updated from split peas to red lentils.  If it wasn't for the intern that made the update only in the ingredients and not in the instructions, I new would have understood why so many people had used the wrong thing.  Pretty lame job, editors.Anonymous1/16/2021Kicking myself for not reading the reviews first. The Dal is simmering on my stove right now, going on about an hour of cook time. I am sure I have the correct ingredient, I went to my local Indian grocery and bought a package labeled Yellow Split Peas. I imagine this would work if the split peas were soaked overnight, not rinsed as the recipe states, it would have cooked in the 14 minutes accounted for. This was supposed to be my lunch tomorrow, so we will have to see what happens.Julia PUlm, Germany10/27/2020Been making this for a little while now and editing steps but keeping pretty true to the ingredients and measurements. My lentils never cook in 15 minutes and I honestly don’t mind but that just screws up my timing. So yeah, I’ve experimented and what I’ve found to be best, at this point at least, cook the lentils as directed. Add powdered spices (I add a little powdered ginger, too) and in the meantime chop onions, and mince garlic and ginger with a microplane. Make the onion/lime and yogurt/salt mixture during this time as well. Just keep cooking down until things look nearly (20 mins?) ready and then cook onions, ginger, garlic and add to the lentils while the basmati rice is cooking. At this point, pretty much everything comes together beautifully (and as intended, I believe) and I have a very happy vegetarian fiancé and a very happy me. And oh, a little freshly chopped cilantro doesn’t hurt. Mendocino, CA10/13/2020trash recipe. no instruction for type of yellow split pea. takes forever to cook, not \"14 minutes\", try an hour. super bland, way too little spice.Anonymous8/6/2020As other reviewers have mentioned, there is some lack of information in this recipe. I would not consider the recipe incorrect, but the type of bean is not described well enough. I used “Yellow Split Peas”, whatever generic version you can get at an American grocery store. My dal has been boiling for almost an hour (which is also what the package directions say to do). It would be helpful for this recipe to be more specific about how to choose the right bean, since other reviewers seemed to have the correct type for this recipe. Obviously just saying yellow split peas on the package does not mean the same thing for everyone. AnonymousSt. Louis6/9/2020It has now been 1 1/2 hours, and this dal is still hard. I used chana dal peas, soaked overnight. I ate it anyway, and it’s very bland. Double the spices, maybe more onion/ginger/garlic. And use some other yellow split peas because chana dal will not work for this. AnonymousWashington, DC6/7/2020Done it multiple time now, without the yogurt but with a bunch of frozen spinach and, and that's the most important, with a good drizzle of chhonk.\n\nI always pre-soak the lentils the day before to cut cooking time and improve the flavor. I add rinsed and firmly squished frozen spinach 10 minutes before serving.AnonymousFrance5/28/2020Used red lentils, powdered ginger, whole cardamom seeds, and cashewmilk yogurt.  I cooked the onions low & slow at the beginning, essentially caramelizing them.  During that time I made the red onions - I recommend making them early on to allow time to soften.  My rend lentils took less than 15 minutes to cook.  Delicious!!! Will definitely make many more times.noramayeBuffalo5/9/2020The comment from Nicboz is not accurate. I had yellow split peas, and they took upwards of an hour to fully soften. Sadaf brand- the catch is that in small text on the bag, it also said chana dal. I'm guessing other folks might've also purchased chana dal, which cooks much slower than yellow split peas (matar dal).\n\nThis recipe was tasty! I didn't have much yogurt, so I mixed in buttermilk instead of water to thin it but keep it flavorful + increase quantity. The onions were amazing, and I would make as a topping for other dishes.pdJeed4/26/2020I came here to educate you. Folks complaining about needing upwards of 45min, congratulations, you used green lentils. Folks that only needed the 15-20min, good for you!, you used red lentils which really range from gold to orange color. Needed somewhere closer to 30min? That's the brown variety. Use google for good. Great recipe. Don't hesitate to add extra spices. nicbozOrange County, CA4/23/2020This is so good!!! I had red lentils on hand so I used those instead. Did everything else the same. Greater than the sum of its parts. AnonymousWisconsin4/2/2020This recipe is awesome! I have never found a recipe for dal that I liked before this one. I dislike red onion so I just added lime juice to the yogurt mixture instead and found that was perfect. Ainsley MacDougallVancouver Canada3/31/2020Meh. The peas took waaay longer to cook than the recipe said (maybe 45 minutes, and even then it was pretty liquidy and I wasn't sure if I should let it keep cooking??) and I needed to add more of the spices and a good bit of salt to make it taste like much. It also makes A LOT, I'd say at least 6 servings. I LOVED the salted yogurt though and will absolutely add that to future dals! AnonymousPrague, CZ3/30/2020Explore Bon AppétitDalIndianSouth AsianAsianRed LentilLentilVegetableRiceRice & GrainsYogurtOther IngredientsQuickEasyOne-Pot MealsWeeknight MealsMainGluten-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}