{"id": "587d2a4c99a0e1a639103b3ca906ab41", "url": "https://www.bonappetit.com/story/square-biscuits", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Why Square Biscuits Are Superior to Round Biscuits | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy You Won't Find Round Biscuits in My KitchenHaven't you heard that it's hip to be square? By Sarah JampelMarch 17, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Once upon a time I worked at a company that sold thousands of beautiful hand-carved biscuit cutters. The cutter was made of light wood, pleasingly round but not bulbous (a shape I admire!), and front and center on my  \"What I'm Coveting Now\" Pinterest board I created. (This was a while ago, okay?)I never did spring for one—and I'm glad I didn’t. Because the best biscuits—and by \"best,\" I mean the tallest and the flakiest—are square biscuits. In both BA's Best Buttermilk Biscuits and our latest Sour Cream and Onion Biscuits, the biscuits are cut into rectangles (all squares are also rectangles, so don't @ me) with a bench scraper or chef knife. That’s right: You don’t need a biscuit cutter to shape them.But a cutter isn't only unnecessary—I'd also argue that it's detrimental to the architecture of your biscuit. First and foremost, using a biscuit cutter smooshes the biscuit down. You've just worked so hard to fold, pat, and fold your dough to [build those beautiful layers](https://www.bonappetit.com/story/best-biscuit-tips). Unless your cutter is razor-sharp (and frankly, that sounds dangerous), the all-around downward pressure is going to squash the dough, meaning that the biscuits won't rise to their full potential in the oven.Second, a biscuit cutter creates scraps that have to be rerolled. As you rework the dough, you'll continue to develop gluten, yielding a second round of cut-outs that are tougher and shorter than the first. You know how the initial pancake is always the worst? It's the same with the final biscuit. By cutting the slab of dough into rectangles, you eliminate all scraps. It's efficient.And lastly, I'd argue that the square biscuit makes for a neater, more contained sandwich. If you think about the best sandwich bread—I'm envisioning a pullman loaf, brioche, Japanese milk bread—it typically has at least a few straight sides, which are box in the roly-poly inners. If you try to put a fried egg or a slice of tomato or some curvy slivers of avocado on a round biscuit, those fillers are going to poke past the biscuit's circumference.But even if you're not making a sandwich, a 3-inch square biscuit has more surface area than a 3-inch round biscuit, which means you can slather on more butter, jam, or sour cream. It's simple math.Don't get me wrong: I'll still gladly accept that artisan biscuit cutter. But I'll use it for decoration and stick with my bench scraper for cutting biscuits.Get the recipe:Sour Cream and Onion BiscuitsIf you've ever had trouble making biscuits in the past, consider this recipe your saving grace. While many other methods count on pockets of butter and an angel’s touch for pull-apart flakiness, we weren't willing to leave it to chance. Our simple folding technique manually multiplies the number of layers for guaranteed, no-risk success. View RecipeExplore Bon AppétitBasically BakingBiscuitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Sarah Jampel"]}