{"id": "5880e21a26e8186a271f068dc2238869", "url": "https://www.bonappetit.com/story/black-pepper-tofu", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "This Black Pepper Tofu Recipe Gets Tons of Flavor From One Stealth Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Stir-Fry Recipe Gets Tons of Flavor From One Stealth IngredientBlack pepper deserves to be the star, not the sidekick.By Sarah JampelMay 11, 2020FacebookTwitterEmailPhoto by Emma Fishman, Bowl by Meilen Ceramics FacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.Approximately 95 percent of the flavor in this Black Pepper Tofu and Asparagus, which is inspired by a favorite Yotam Ottolenghi recipe, is built on one tablespoon of humble black peppercorns, coarsely crushed.Of all the sources of heat—fresh chiles, dried chiles, crushed chiles, fermented chiles (a.k.a. hot sauces)—black pepper is the one I can always count on to be around, but also the one that I’ve consistently taken for granted. Because black pepper’s on the counter, just lying in wait in the grinder, I tend to forget it exists. It doesn’t feel special. (Sounds like a lot of quarantine relationships, huh?) I grind it over eggs and into salad dressing, but, full disclosure, I sometimes worry that it’s just for show. Can I even, um, taste it?But the truth is that black peppercorns can be as fruity, fragrant, and downright spicy as other sexier (or at least more colorful) pepper products. Treat them right and they’ll be so flavorful as to make other aromatics unnecessary. Just look at Chinese salt and pepper fish, Roman cacio e pepe, Cambodian beef lok lak (black pepper beef), and the Indian murgh kali mirch (black pepper chicken), among so many other examples.In dishes where black pepper serves as a foundational flavor, not just a garnish afterthought, the key is to crush whole peppercorns, then bloom them. Freshly cracked pepper (do this with a mortar and pestle or a spice mill, or dump the peppercorns onto a rimmed baking sheet and use a cast iron to pound them) is coarser and more potent than the pre-ground stuff; cooking it in hot fat does even more to extract its best flavors, which will be passed on to whatever you add to the pan next.In this tofu stir-fry, you’ll sizzle cracked peppercorns in oil until the spice makes you want to crack a window. Once it’s smelling good, add chopped asparagus (though another quick-cooking vegetable, like peas, chopped cabbage, peas or sliced snap peas or snow peas, would work), tofu that’s been coated with cornstarch and pan-fried (drained and rinsed chickpeas would also be good, as would crumbled tempeh), and ginger, garlic, sugar, and soy sauce. The veg is crisp-tender, the tofu is crispy-gone-soggy, and both are coated in a super savory sauce that adds a sinus-clearing heat. Oh, and once you’ve got the tofu pressed, it comes together in about 15 minutes.For me, someone who hasn’t seen a serrano in weeks and can’t remember the last time I had a bottle of sambal in the fridge (I MISS YOU), it’s nice to realize that black peppercorns are all I need to bring that heat. Like my quarantine buddy, they’ve been there all along.Get the recipe:Black Pepper Tofu and AsparagusIn this 30-minute dish, which is inspired by Yotam Ottolenghi's recipe in his 2011 book Plenty, black pepper is the star, not the sidekick: When bloomed in oil, the coarsely ground peppercorns become piquant and fragrant enough to flavor the entire sauce, no red pepper flakes, dried chiles, or hot sauce needed. Take care not to burn the peppercorns as you toast them or the flavor could swing from spicy to bitter.View RecipeExplore Bon AppétitThe Not Depressing VegetarianTofuAsparagusBlack PepperRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-11", "author": ["Condé Nast", "Sarah Jampel"]}