{"id": "588c8581073ac065f3cdba8e427448d7", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/bi-rite-market", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Bi-Rite Market Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoBi-Rite MarketThe cramped, well-curated grocery shop (with ice cream!)FacebookPinterestTwitterEmailBi-Rite Family of BusinessesGO HERE: for pure grocery store nirvana. There’s air conditioning via the refrigerated shelving situation, responsible sourcing, beautiful produce, well-marbled meats, and even a teensy ice cream shop (technically across the street but still in the family), all at Bi-Rite Market.BUY: local heirloom tomatoes from produce buyer Simon Richard, gouda from cheese buyer Jon Fancey, or whatever else catches your eye. Bi-Rite gives really sweet shout-outs to its very experienced staff (you can’t help but smile reading their bios on the website), and they won’t steer you wrong with edible souvenirs to bring home.THE VIBE IS: fluorescent. It’s still a grocery store! It’s fairly laid-back, though a line can pile up at the deli sandwich counter. Make sure you cap off your grocery run with a scoop of ice cream at Bi-Rite Creamery (Ricanelas, a.k.a. snickerdoodle, is our jam).PRACTICAL STUFF: Check the website for opening hours for the two locations in the Mission and Divisadero and Bi-Rite Creamery’s shop details.—Elyse InamineWE ALSO LOVEHeathThe mother ship for ceramics (and way more)Tartine ManufactoryThe megabakery-slash-wine-bar-slash-ice-cream-shop-slash-restaurantMarchA Pacific Heights shop for the (extremely well-) curated homeExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Elyse Inamine"]}