{"id": "5899adbbcf998e14e536e62490dd539a", "url": "https://www.bonappetit.com/story/5-essential-vegan-friendly-spots-to-explore-in-st-catharines", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "5 Essential Vegan-Friendly Spots to Explore in St. Catharines | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Essential Vegan-Friendly Spots to Explore in St. CatharinesBy Destination Canada/Tourism Partnership of NiagaraOctober 2, 2018FacebookTwitterEmailPHOTOS BY SUECH + BECKFacebookTwitterEmailWith its famously majestic waterfalls and fertile fields, Canada’s bountiful Niagara Region has long been associated with earthly wonders. From rolling hills lined with neat rows of carefully tended grapevines to roadside stands overflowing with ripe fruit, this green stretch of the world is a must-visit for anyone who appreciates pristine produce bursting with flavor. It only makes sense, then, that the area’s largest city, St. Catharines, is home to an impressive, burgeoning vegan dining scene. With this in mind, we recently went on a quest for plant-based perfection; these are the five spots that any self-respecting vegan (and vegetable lover) should have on their must-visit list.Rise AboveFirst stop on “Operation Vegan”? Rise Above. The Niagara Region’s  first 100-percent-vegan restaurant and bakery promises to be an oasis for those seeking meat- and dairy-free comfort food and fresh-baked goods, and we’re not disappointed. We order the “cheddar” macaroni and cheese, which comes smothered in a velvety cashew cheese sauce and topped with a crunchy broccoli crumb, and the curried cauliflower tacos, packed with spiced chickpeas, tahini, and crispy jalapeños. We’ll most certainly swing back around at Sunday brunch for the weekly pancake special, which can come topped with anything from a sweet-tart peach crumble to a sticky mix of banana slices, walnuts, and toffee.Bella Noella's PizzeriaBella Noella’s is practically next door to Rise Above, so we pop over for a few slices of hot pizza. We soon realize there’s no need to feel like the odd one out when dining with dairy-eating friends at this quaint, brick-walled spot, because nearly all of its 20-plus pies can be vegan-ified and made with gluten-free crust. We go for the “Hawaiian,” which comes topped with pineapple, jackfruit, and marinara sauce, and the “Greek,” which is piled high with pesto, spinach, red onion, tomatoes, and black olives. The pies run big—they fill an entire plate!—but we’re not complaining.The Lemon TreeNext up, we pile in the car and drive across town to The Lemon Tree. (Don’t worry, it’s only 10 minutes away—that’s the benefit of a small town!) It doesn’t look much different from any other strip-mall restaurant at first blush, but once inside we see what the hubbub is about: Owners Billy and Isabella Qorri gave the menu a complete vegan makeover in March. Instead of squid, the “calamari” features delicately battered and deep-fried root vegetables served with house-made tzatziki. We’re also keen on the savory spinach burek pastries, here constructed with flaky layers of vegan pastry and plant-based feta cheese. Of course, we can’t leave without ordering a fat burger made with Beyond Meat, the meat substitute that’s earned a cult-like following thanks to its ability to “bleed” ruby-red beet juice. Go for dessert, too: Today’s special—a vegan Ferrero Rocher-inspired confection packed with hemp hearts, flax seeds, and coconut—makes our eyes roll into the backs of our heads.Beechwood DoughnutsMoving further into the sweet portion of our tour, we head to Beechwood Doughnuts’ petite glass-enclosed storefront. Canadian Prime Minister Justin Trudeau went out of his way to visit this vegan establishment on a trip to the region in 2016, opting for a half-dozen piping-hot, made-fresh-on-site doughnuts blanketed with a craggy topping of cinnamon and sugar. It’s hard to decide what to order—the shop cranks out more than 20 varieties in all, with a menu that rotates daily—but we finally settle on two: a chocolate-glazed s’mores offering capped with a torched marshmallow and a golden-hued tropical number smothered in a sugary dip spiked with orange, pineapple, mango, passion fruit, and guava. We’re pretty sure Justin would approve.Hometown Ice CreamWe save just enough room for a few final treats at Hometown Ice Cream. You won’t find a lick of additives or preservatives in this shop’s all-natural, from-scratch frozen goodies, which span ice cream, sorbet, and sherbet. We go for scoops of the dark rum-infused piña colada and roasted peach sorbet, plus a few classics like chocolate and cookie dough. We can’t say no to the homemade pop tarts, though: The jammy, all-vegan raspberry-rhubarb flavor is a real winner, as is the zingy and sweet peach-ginger flavor. Both come slicked with icing and finished with a flourish of sprinkles, and we’re not mad about it.After making the rounds at the best vegan spots around St. Catharines (and testing the limits of our belt buckles), we had to call it a day. But you can bet we’ll be back.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Destination Canada Tourism Partnership Of Niagara"]}