{"id": "589fe94665ce9515adc1ac240a8eff10", "url": "https://www.bonappetit.com/story/air-fryers-cyber-monday-2021", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "7 Best Air Fryer Cyber Monday Deals (2021) to Shop Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping7 Best Air Fryer Cyber Monday Deals to Shop Right NowLooking for the best deals on Breville, Cosori, Ninja, and CRUXGG air fryers? We've got you covered.By Alex Beggs and Tiffany HopkinsNovember 29, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you’ve been on the fence about whether or not to go all in on air fryer Cyber Monday deals, I get it—it’s a cost and counter space commitment. But this appliance is a lot of fun, and I'm fully a convert; read more about the detailed ins-and-outs of air frying here. I made extra crispy brussels sprouts in mine last week in 11 minutes flat. Still unsure? If you're hesitant to pay full price on a kitchen appliance you’ve never tried before, these Cyber Monday sales (see our full list of Cyber Monday cookware and kitchen deals here) are the perfect excuse to go for it. C'mon, live a little! If you’re just cooking for one or two, I’d recommend a basket-style air fryer like the Cosori or CRUXGG because they take up less space than a toaster oven-style fryer while still getting the job done. But if you need one that can do multiple racks of food, dehydrate apple slices, toast bread, and serve as an extra oven for holiday pie marathoning, go with the Breville Smart Oven Air Fryer Pro, which a few food stylists I know swear by as secondary ovens. That thing can do it all. Now, onto the best air fryer Cyber Monday deals! —Alex Beggs, senior staff writerBreville Smart Oven Air Fryer ProThis is an all-in-one air fryer–toaster oven combo, so if you’re looking to upgrade your existing toaster oven, this is an excellent choice. The Breville Smart Oven Air Fryer Pro can tackle a batch of crispy chicken tenders, cook a frozen pizza, and even roast a 14-pound turkey should your full-sized oven crap out on you. Its Super Convection setting reduces cooking time by 30%, and its 13 preset functions can do everything from bake to reheat to dehydrate. This is certainly an investment appliance rather than an impulse buy, but right now, it’s $100 off.Breville Smart Oven Air Fryer Pro$750 $400 at Sur La TableCosori Air Fryer Max XLOur favorite basket-style unit is the Cosori Air Fryer Max, and it's what associate food editor Rachel Gurjar uses to develop all her air fryer recipes. It has a 5.8-quart capacity—larger than many other basket-style air fryers—but it doesn’t take up too much counter space. The super straight-forward touchscreen makes this air fryer incredibly easy to use. It even has a \"shake\" reminder alarm to ensure all of your potato wedges, chili-honey glazed fries, and brussels sprouts come out super crispy.Cosori Air Fryer Max XL$120 at AmazonCRUXGG Countertop Air FryerBA editorial director Amanda Shapiro loves her CRUXGG air fryer, and with good reason. It’s got a 6-quart capacity and the ability to fry, bake, sauté, steam, grill, and roast in addition to air frying. Plus, it comes in two different matte colors: snow white and smoke grey. Get it for 20% off at Target along with the rest of the CRUXGG line.CRUXGG Digital Touchscreen Countertop Air Fryer$100 $80 at TargetPhilips Premium Digital AirfryerOur friends at Epicurious tested a bunch of air fryers to find the best one on the market. Their favorite was the Philips Premium Digital Air Fryer—not only because it made the crispiest, most evenly-cooked French fries, but also because of its attractive, very easy-to-use interface.Philips Premium Digital Airfryer$250 $210 at AmazonNinja Foodi DualZone 2-Basket Air FryerLove your air fryer so much that you wish you had space for another one? Consider upgrading to the Ninja DualZone air fryer. Equipped with two independent baskets and smart technology, this fryer allows you to cook two different dishes with different temperatures and cook times simultaneously. Choose between the 8- and 10-quart models.Ninja Foodi DualZone 8-Qt. 2-Basket Air Fryer$200 at Amazon$160 $140 at WalmartNinja Foodi DualZone 10-Qt. 2-Basket Air Fryer$200 $140 at Target$230 at AmazonDash Tasti-Crisp Electric Air FryerIf you’re working with limited counter space or you’re mostly cooking for one, the Dash Tasti-Crisp air fryer is an excellent option. With a small-but-mighty 2.6-qt. capacity, it’s the perfect size for smaller kitchens or even dorm rooms. This Cyber Monday, it's on sale for 40 bucks—air fryer stocking stuffers for everyone? Find it in white, gray, and cheery aqua blue.Dash Express Tasti-Crisp 2.6-Qt. Air Fryer$50 $40 at Target$60 $50 at AmazonInstant Pot Duo CrispIf you’re into the idea of making super crispy fries and easy pork carnitas, beef pho, and black bean soup, consider an air fryer that’s also an Instant Pot, like the 6-quart IP Duo Crisp.Instant Pot Duo Crisp, 6 Qt.$150 $100 at AmazonHere's what you should make first:Air Fryer Sesame-Coconut Chicken TendersAll the giddy deliciousness of crispy chicken tenders, all the convenience of air frying in one easy, crowd-pleasing recipe.View RecipeExplore Bon AppétitShoppingequipmentRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-26", "author": ["Condé Nast", "Alex Beggs", "Tiffany Hopkins"]}