{"id": "58acc5423a459f59b77370532e5e603f", "url": "https://www.bonappetit.com/story/pre-order-franklin-bbq", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "The Best Way To Eat Franklin BBQ is to Pre-Order | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Way To Eat Franklin BBQ is to Pre-OrderSorry, but I’m not about waiting in a four-hour line for brisket.By Rachel KartenApril 29, 2019FacebookTwitterEmailPhotograph by Dominque LafondFacebookTwitterEmail“But the line is part of the experience!” This is what a handful of people commented after I posted that I went to famed Franklin BBQ in Austin...and ordered ahead for pickup. And, sure, if you want a four-hour wait to be part of your experience, go ahead. But I am here to tell you that my experience, which included moist, fall apart-y brisket, black pepper-dotted ribs, and smoky beans was absolutely perfect. And I didn’t have to sacrifice my entire morning standing around on a rainy Austin day to get any of that.But if you are going to go the pre-order route, there are a few key things you need to know in advance. (Considering Franklin BBQ is the kind of legendary spot that you plan an entire trip around, the whole thinking ahead thing shouldn’t be an issue.) First, you have to place your order here at least a week in advance. And, it needs to be a minimum of five pounds of meat. But you’re bringing friends, right? Plus, late-night leftovers are never a bad thing. You then select your pickup time and date, pay a deposit, and you’re set. The day of your pickup, simply walk past all the people standing in the line that wraps around the entire block (the experience, if you will) and head to the food truck in the back. Tell them you’re picking up a pre-order and minutes later you’ll be handed a bag full of smoked meat glory. On my recent visit I went with the brisket, pork spare ribs, sausage, pulled pork, turkey, potato salad, slaw, and pinto beans. We drove quickly (and safely) home, and put out the spread. As expected, it ruled. As we licked our fingers and sat back to admire the wreckage, the most important comment came in, from none other than Austin resident/Bon Appétit editor at large/part-time Franklin BBQ employee Andrew Knowlton: “Pro move,” he wrote. I thought so too.Go there: Franklin BBQExplore Bon AppétitHighly RecommendAustinFranklin BarbecueRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Rachel Karten"]}