{"id": "58c3f2462c40b8fb6205cf389acac29d", "url": "https://www.bonappetit.com/story/amul-cheese-indianish", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "I Accept Amul Cheese Exactly As It Is: Canned, Processed, and Perfect | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Accept Amul Cheese Exactly As It Is: Canned, Processed, and PerfectAnd I’ll take it over American in my grilled cheese any day of the week.By Priya KrishnaJuly 11, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ve never liked American cheese.Before you lambast me about being a cheese snob, hear me out: the reason I dislike American cheese has nothing to do with the fact that it’s processed. Quite the contrary. I don’t care for American cheese because I grew up with a processed cheese that is far superior. Allow me to introduce you to Amul cheese, India’s greatest dairy product to ever come from a can.Amul, an Indian dairy company based in Gujarat, specializes is butter, yogurt, ice cream, and cheese made using milk from Indian buffalos, which lends a very specific flavor—it’s richer, a little nuttier, a little funkier. It started in 1948 as a dairy cooperative meant to help bring milk products to smaller cities in response to a monopoly created by a company called Polson. Many of the people Amul was selling to didn’t have access to refrigeration, so shelf-stable, long-lasting products were developed, like the cheese (its official shelf life is nine months). People in India are crazy loyal to Amul products, but it’s that cheese that inspires by far the most cultiness. #Amulcheese is a trending hashtag with close to 2,500 posts. And then there are these ads, in which a reserved boy eats a slice of Amul cheese before a big game/when he is about to perform on stage/when he finds a monster in his closet—and he somehow gains cheese-powered super-confidence. People love them.Imagine the super-confidence that awaits you.\nPhoto by Chelsie CraigAmul cheese is a hard, canned cheese that tastes like cheddar with a plot twist. It’s got a familiar buttery flavor, but it’s slightly sour. It’s hard but pliable, melts beautifully, and is saltier than you’d expect. Because it’s canned and packed with who knows how many preservatives, it will last forever. I distinctly remember when my dad would stockpile cans and cans of Amul cheese at the top of our pantry, and those would last us for the year. Our favorite way to eat it was grating and then melting it onto tomato toast, with a sprinkling of chaat masala, which brought out all of Amul cheese’s wonderfully weird flavors. In my cookbook, the tomato-cheese toast recipe calls for cheddar, because Amul cheese isn’t widely available—but if you really want to eat the dish as the Krishnas do, you should order a can online. Once you’ve had a grilled cheese made with Amul cheese, the American cheese version will forever taste bland and boring.Beyond the taste, the cult of Amul cheese has mainly to do with the nostalgia that it carries. Like Maggi noodles, India’s Instant ramen of choice, or Parle-G cookies, our preferred tea accompaniment, Amul cheese takes Indians of multiple generations back to their childhoods. My dad always told me that Amul cheese, more than anything else, tasted like India to him. To me, it tastes like being at my parents’ house in Texas.Because it’s such a home pantry staple, I’ve been surprised to see the cheese in dishes at popular Indian restaurants: mixed with chilies and stuffed in naan at Adda in Long Island City, in a grilled cheese with mint chutney at USHA foods in Queens, and in a chicken-chutney sandwich at Pondicheri, in Houston and New York.Chintan Pandya, the chef of Adda, told me that he first tried Amul cheese when he was 9 or 10—it was a luxury to his family, something that he was only able to eat on special occasions. “I still crave the taste of it. Every other cheese, despite the best of taste and ingredients, just feels a bit cerebral.”Last year, he says there was a shortage of Amul cheese in New York and New Jersey. “I ended up personally driving to stores in Philadelphia to pick up as much Amul cheese as I could,” he says. “My chefs recommended that I use cheddar, but I would not do it as I felt it would be affecting the integrity of the Indian dish.”Similarly, Anita Jaisinghani, the chef of Pondicheri, grew up in India with Amul as the only cheese available in stores. She calls it her “secret weapon” in her restaurants. “It has a creamy, intense flavor that is like none other,” she says. “And this is from a person who eats almost nothing processed.”Amul cheese’s success is somewhat improbable. Here’s an almost completely artificial food that has depth and complexity, that’s beloved by Indians alike (even chefs!), and that I would take over cheddar any day of the week. I am fully aware of its flaws, but I love it so much anyway. Unlike most other things in my life, I accept Amul cheese for exactly what it is. And there’s something pretty wonderful about that.Buy it: Amul Cheese, 14 oz., is $12 at Snuk FoodsPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, is now out from Houghton Mifflin Harcourt! Follow her on Instagram @PKgourmet.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitIndianishCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Priya Krishna"]}