{"id": "58c67024dcbca7fe8acb6a86c4a9c02a", "url": "https://www.bonappetit.com/recipe/pomegranate-parsley-tabbouleh", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Pomegranate-Parsley Tabbouleh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssuePomegranate-Parsley TabboulehBy Carla Lalli MusicJune 1, 20194.1(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintFreekeh is used in this nonconventional tabbouleh because of its smoky, slightly lemony flavor, which is amplified by the sweet-sour pomegranates and punchy dressing, but feel free to sub farro, brown rice, or barley. Soaking the whole grains shortens the cooking time. Reprinted With Permission From Where Cooking Begins. By Carla Lalli Music, published by Clarkson Potter, March 2019Ingredients6 servings1cup whole freekeh, soaked overnight if possibleKosher salt, freshly ground pepper1small shallot, finely chopped1small serrano chile, finely grated11\" piece ginger, peeled, finely grated½cup extra-virgin olive oil¼cup fresh lime juice1tsp. pure maple syrup2tsp. sumac, plus more for serving2pomegranates1big bunch parsley, leaves and tender stems very coarsely chopped (about 1½ cups)1small fennel bulb, fronds torn, bulb and stalks thinly slicedHandful of mint leaves, torn if largeFlaky sea saltIngredient InfoSumac can be found at Middle Eastern markets, specialty food stores, and online.PreparationStep 1Cook freekeh in a large pot of boiling salted water until al dente, 20–30 minutes. Drain and spread out on a rimmed baking sheet; season with kosher salt and pepper while still warm. Let cool.Step 2Meanwhile, whisk together shallot, chile, ginger, oil, lime juice, maple syrup, and 2 tsp. sumac. Taste dressing and season with kosher salt. Let sit 10 minutes.Step 3Cut pomegranates in half. Working over a large bowl, hold a pomegranate half cut side down in your palm with your fingers stretched wide. Use a wooden spoon to forcefully and repeatedly smack pomegranate skin, which will send the seeds raining down into the bowl. Repeat with remaining pomegranate. Fill bowl with cold water to cover seeds. Skim off any little bits of pith that float to the surface; drain seeds and shake off excess liquid.Step 4Toss parsley, fennel, fennel fronds, and mint in a large bowl. Add freekeh, season with kosher salt, and toss gently to combine. Add dressing and toss with your hands to thoroughly coat ingredients. Add pomegranate seeds and toss gently to disperse. Sprinkle with sea salt and more sumac.Step 5Do Ahead: Freekeh can be cooked 3 days ahead. Cover and chill.How would you rate Pomegranate-Parsley Tabbouleh?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI made this with slightly crunchy pear instead of pomegranate since it was out of season, and it turned out  delicious! Slightly sweet and tart, the more herbs the better!Seattle,WA7/30/2020LOVED this!  I would like to know what could be substituted for pomegranates if they are not available?\n AnonymousCA12/3/2019Delicious! \nI hate to be that person, but I didn't follow the recipe closely because I didn't have the ingredients. I cooked 1 cup dried barley instead of freekeh and used diced orange slices instead of pomegranate seeds. Turned out delicious and a great dressing. Loved the use of herbs. \nAnonymousOakland3/20/2019This was a super pleasant reprieve from the staleness of winter. Loved it exactly as is and would definitely make again. maroxy01Boston3/7/2019Was* sorry typo AnonymousMinnesota 2/23/2019I loved this recipe! I added pine nuts because, well I love pine nuts. It wasn’t delicious. AnonymousMinnesota2/23/2019Explore Bon AppétitSaladLebaneseMiddle EasternFreekehRice & GrainsFarroBarleyPomegranateFruitParsleyHerbs & SpicesRiceFallEasyWeeknight MealsSideDairy-FreeNut-FreeVegetarianGluten-FreeVeganHealthyishRosh HashanahHanukkahLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}