{"id": "58ea3a26e476cd3ee1b1f12d866360c6", "url": "https://www.bonappetit.com/recipe/dry-rubbed-pork-roast", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Dry-Rubbed Pork Roast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueDry-Rubbed Pork RoastBy Janice TiefenbachNovember 19, 20194.6(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA straightforward roast with porchetta-like seasonings (fennel-peppercorn-garlic), but it makes a huge difference to use a skin-on rib roast with a big fat cap, which will insulate the meat and make it juicier while the skin will crisp up into an incredible pork cracklin’. Because pork roasts vary drastically in size, use about 1 tsp. Diamond Crystal or ¾ tsp. Morton kosher salt per pound as your guide. Serve with Creamy Cheesy Polenta and Brussels Sprouts With Cranberry Mostarda, all of which come from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8–10 servings3dried bay leaves2Tbsp. black peppercorns2tsp. coriander seeds2tsp. fennel seeds2sprigs rosemary, leaves stripped, finely chopped2Tbsp. Diamond Crystal or 4½ tsp. Morton kosher salt3Tbsp extra-virgin olive oil, divided18-bone pork rib roast (about 6 lb.), preferably skin-on and with fat cap, chine bone removed2large onions, coarsely chopped3garlic cloves, crushed2cups dry white wineFlaky sea saltPreparationStep 1Preheat oven to 500°. Coarsely grind bay leaves, peppercorns, coriander seeds, and fennel seeds in a spice mill, mortar and pestle, or blender. Transfer spice mixture to a small bowl and mix in rosemary, kosher salt, and 2 Tbsp. oil.Step 2Using a sharp knife, score fat cap in a crosshatch pattern, spacing cuts about ½\" apart and avoiding cutting into flesh. Rub spice mixture all over pork, making sure to work it into the cuts. Set pork on a wire rack set inside a roasting pan.Step 3Toss onions, garlic, and remaining 1 Tbsp. oil in a medium bowl to coat, then scatter around pork. Roast in oven until skin begins to puff and crisp, about 30 minutes. Remove roast from oven and reduce oven temperature to 350°. Pour wine and 1 cup water into pan and return to oven. Roast until an instant-read thermometer inserted into the center of roast registers 150°, 45–75 minutes (time will vary depending on how thick your roast is). Let rest at least 30 minutes and up to 2 hours before carving.Step 4Sprinkle roast with sea salt and serve with any pan juices spooned over.Step 5Do Ahead: Pork can be rubbed with spice mixture 2 days ahead. Cover; chill.How would you rate Dry-Rubbed Pork Roast?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleUsing the rib end cut of pork is key. My butcher recommended it years ago and it’s been my cut of choice. And if it’s a local farm raised pork even better. I just rub mine with crushed fennel seeds. And it’s the most delicious roast. And thick fat can is essential John GoldenPortland, ME5/12/2021Good recipe, I use a similar version, the dry rub looks very much like the one in \"Jamie at home\" 2007 Jamie Oliver roast pork page 150 the one big difference is he does not use coarsely ground bay leaves in the rub (bay leaves are not very digestible) Jamie does use them whole in the cooking process then removed, not eaten.\n\npacepuleoMilano, Italia12/21/2020After 5 stores, I couldn't find a skin-on pork rib roast, so I used a pork loin roast with the same proportions of the herb-spice mix and oven temperatures (obviously adjusting cooking times because of the different shape). It came out magnificent! People told me it was the best pork they have ever eaten! I paired it with the polenta (excellent). Because of the reduced cooking time the white wine wasn't able to reduce as much as I'd liked so I just finished that over the stove. Thank you!!!!nick016NYC1/20/2020This recipe was so so good! Made it for my family and one member even mentioned it was the best meal she’d ever had. AnonymousIndiana1/11/2020As a native of Denmark, it has long been a mystery to me why Americans are the only pork eaters on the planet who do NOT roast the meat with the skin on for cracklings. I am thrilled to see this recipe, but not surprised to see that it comes from Canada. Our family's traditional Christmas Eve (when we celebrate Christmas) dinner is a boneless pork loin with the skin on scored as pictured - NOT in a crosshatch pattern - for easy slicing as well as proper crisping. We score the fat layer down to the meat - careful not to cut into the meat - and then fill the grooves with generously with salt to draw out the moisture and ensure crisp skin. Very little warms the heart of most Danes more than such a pork roast, and several different cuts can be used to good effect. Bless you for promoting this deliciousness in America at last.a23Oakland, CA12/27/2019Help!  I want my pork to look like the one in the picture.  Instructions do not suggest searing the pieces individually, but I think that must be the solution.  Am I right?AnonymousChicago12/24/2019Explore Bon AppétitItalianEuropeanPork Rib RoastPorkMeatMainGluten-FreeDairy-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}