{"id": "5909d5d82150a18395744acda899c14e", "url": "https://www.bonappetit.com/recipe/bagna-cauda-with-spring-vegetables", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Bagna Cauda With Spring Vegetables Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueBagna Cauda With Spring VegetablesBy Stefano SecchiMarch 15, 2022EmailPinterestPrintPhotograph by Paola + Murray, food styling by Rebecca Jurkevich, prop styling by Marina Bevilacqua EmailPinterestPrintEmailPinterestPrintThis warm anchovy dip has been made in Piedmont, Italy, since at least the 16th century, where it’s often paired with cardoons and sweet peppers. Bagna cauda (the name translates to “hot bath”) is a dish with humble roots, made by vineyard workers as a warming snack during colder months. Classically, it’s served in an earthenware vessel over embers or an open flame, as with fondue.Though American versions of the dish sometimes include cream, chef Stefano Secchi of New York City’s Rezdôra keeps his version classic to Piedmont: nothing more than anchovies, olive oil, and garlic, paired with the season’s snappiest raw vegetables. The dressing will separate and settle rather than form a cohesive emulsion, so use your best olive oil—you’ll taste it.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan$60 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonIngredients4 servings½cup extra-virgin olive oil14garlic cloves12olive-oil-packed anchovy fillets (from at least a 2-oz. tin)Chilled crunchy raw produce (such as radishes, carrots, baby lettuces, fennel, romanesco,endive, and/or unripe pears; for serving)PreparationStep 1Pour water into a small pot or large saucepan to come 2\" up the sides; bring to a simmer. Combine oil, garlic, and anchovies in a bowl that will fit snugly on top of pot without touching the water. Set over simmering water and cook, without stirring but adjusting heat as needed so only a few bubbles are breaking on the surface of the oil, until mixture is hot and garlic is soft, 75–85 minutes. Remove pan from heat with the bowl still set on top. Let cool 15 minutes, then smash garlic with a fork or wooden spoon and mix well with anchovies.Step 2Transfer warm bagna cauda to a small bowl and serve with produce alongside for dipping.How would you rate Bagna Cauda With Spring Vegetables?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerStarterSnackEasy5 Ingredients or FewerGluten-FreeNut-FreeDairy-FreeSimmerItalianEuropeanAnchovyFishSeafoodGarlicVegetableDipCruditéSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Stefano Secchi"]}