{"id": "590d20707bf1a4a69fcadfecc74b9a59", "url": "https://www.bonappetit.com/recipe/grilled-lemongrass-lamb-chops", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Grilled Lemongrass Lamb Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueGrilled Lemongrass Lamb ChopsBy The Slanted DoorSeptember 14, 20215.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThese intensely aromatic grilled lamb chops from The Slanted Door in San Francisco are packed with the flavors of lemongrass, shallots, and Thai chiles. Lamb chops have plenty of fat, which can make them prone to flare-ups on the grill. Turn them often and move them around so they brown without taking on an acrid charred flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonInstant-Read Thermometer$35 At ThermoworksHeat Resistant Leather Gloves$22 At AmazonTongs$13 At AmazonIngredients4 Servings4shallots, coarsely chopped4lemongrass stalks, bottom third only, tough outer layers removed, coarsely chopped4Thai chiles, coarsely chopped½cup plus ½ tsp. sugar2Tbsp. plus ¼ tsp. fish sauce4Tbsp. grapeseed or vegetable oil, divided, plus more for grate121\"–1¼\"-thick lamb rib chops (about 2¼ lb. total), frenchedKosher salt1Tbsp. fresh lime juice1small garlic clove, finely grated½tsp. finely grated peeled ginger1bunch mature arugula, trimmed½Asian pear, thinly slicedPreparationStep 1Blend shallots, lemongrass, chiles, ½ cup sugar, 2 Tbsp. fish sauce, and 2 Tbsp. oil in a blender until smooth. Season lamb chops generously with salt; place in a baking dish. Pour marinade over chops; turn to coat. Cover and chill 2 hours, then let sit at room temperature 30 minutes.Step 2Prepare a grill for high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); oil grate. Scrape excess marinade from lamb; grill over direct heat, turning every minute or so and moving to indirect heat as needed, until deeply browned and an instant-read thermometer inserted into thickest part registers 130° for medium-rare, 6–8 minutes. Transfer to a platter and let rest 5 minutes.Step 3Meanwhile, whisk lime juice, garlic, ginger, remaining ½ tsp. sugar, and ¼ tsp. fish sauce in a medium bowl until sugar is dissolved. Gradually drizzle in remaining 2 Tbsp. oil, whisking until emulsified; season dressing with salt. Add arugula and pear to bowl; toss to coat.Step 4Serve lamb chops with salad.How would you rate Grilled Lemongrass Lamb Chops?Leave a ReviewTell us what you thinkReviews (5)Back to TopTrianglecan you marinate overnightMargieUnion dale, pa10/15/2021I forgot how much I enjoyed eating at The Slanted Door, this dish in particular, but I saw the recipe and had to make it immediately.  This recipe brought it all back.  It's perfect in every way.  I also tried it using pork shoulder, which I cut into chops and served sliced in small pieces with sticky rice and basil, cilantro, mint, and a sprinkle of Nuoc Cham, all wrapped up in butter lettuce.  Divine.  Thank you so much to The Slanted Door for sharing this recipe !sem2goPortland, OR10/4/2021The lamb flavour was great! My wife isn’t a big lamb fan but it won her over. We added rosemary roasted potatoes and they fit in perfectly AdamOVancouver 9/23/2021Excellent, fresh tasting—will make again.BLieseModesto CA9/22/2021This recipe is delicious. I wouldn’t change a thing. They taste just like the ones at Slanted Door. Camille Burlingame, Ca9/21/2021Explore Bon AppétitLambMeatLemongrassHerbs & SpicesGrillRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "The Slanted Door"]}