{"id": "5922fdb530320830a7aa54847bc0b4ff", "url": "https://www.bonappetit.com/story/label-disposable-party-cups", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Writing Celebrity Names on Disposable Cups Was the Best Hosting Move I Ever Made | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWriting Celebrity Names on Disposable Cups Was the Best Hosting Move I Ever MadeAnd yeah, it’s still way cooler than wine charms.By Meryl RothsteinDecember 22, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmail“Obviously we need a Beyoncé,” I say. “Does baby shark count as a celebrity?” It is the night before a holiday party I’m throwing, and my husband and I are labeling disposable cups.There is no party problem as guaranteed as this one: You will put down your glass of punch to reach for a cucumber spear loaded with dip, then reach back for your glass and realize you have no idea which of the four on the coffee table is yours. It’s the challenge that gave birth to wine charms, but a) I’m using disposable cups, not wine glasses, and b) I am not especially cool, but I am definitely cooler than wine charms. In the past I’ve asked guests to write their names on their cups, but unless you’re standing guard by the bar, that directive gets lost pretty quickly. Plus I learned I have a lot of friends named Dan.So I deployed a strategy I picked up at a Friendsgiving a few weeks before: pre-labeling disposable cups with celebrities’ names. It is now my new favorite party trick. Even the brainstorming was fun, as we threw out names we thought would be familiar to the group—athletes, actors, politicians, musicians, writers, our new five-month-old baby—then committed them to cups. We stacked these cups next to the cider, then waited to see just how unconfused people would be about their ownership.It worked. (Though not perfectly, I realized as I took a sip of what I was sure was my Ariana Grande cup, then discovered it was actually Aretha Franklin.)Beyond practicality, it was a legit highlight of the party. It was an icebreaker among people who didn’t know each other (“Who’s on your cup?”). And people were excited to talk about “their” celebrities. My friend Yaran told me repeatedly that he was upset he drew Les Moonves. I learned that Teddy has an inexplicable beef with Lin-Manuel Miranda. Laura was jealous that someone else had gotten RBG. Have you ever seen anyone get this animated over a wine charm?Explore Bon AppétitEntertainingholiday2018Holiday DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-22", "author": ["Condé Nast", "Meryl Rothstein"]}