{"id": "59281fd1b4cda759b17e12ae0f6cf774", "url": "https://www.bonappetit.com/story/grilled-carrots-with-avocado", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "These Grilled Carrots with Avocado and Mint Are My Perfect Summer Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSorry, Hot Dogs: These Grilled Carrots With Avocado Are My Perfect Summer FoodHunks of avocado and fresh mint? I'm in love.By Aliza AbarbanelJune 18, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailEach summer, I divide food into two categories: picnic food and everything else. If I can’t eat it outdoors, surrounded by friends with an Aperol spritz in hand, I’m not interested.These grilled carrots with avocado are the epitome of picnic food: fresh and delicious, especially at room temperature. Growing up, I regularly ate a version of this dish at Huckleberry, a seminal L.A. all-day cafe. Their version used cilantro and oven-roasted carrots, but, we figured, why turn on another appliance if you have the grill going already?Accordingly, senior food editor Andy Baraghani's take on this classic cold salad features grilled carrots, a honey-chile dressing, and fresh mint. “You have really really nice, charred carrots, and then the smoky cumin, some heat from the chile, sweetness from honey, bright herbs,” says Baraghani. “The neutralizing avocado cuts through the heat and smokiness.”Start by preparing a grill for medium heat. If you don’t have access to a grill because you live in a tiny apartment, same. Just preheat your oven to 425 and crank up your kitchen fan if it’s especially toasty. You’re going to sweat for these carrots, and it’ll be worth it.Toast cumin seeds in a small dry skillet over medium heat until fragrant, tossing often to prevent burning. Once cooled, coarsely crush them with a mortar and pestle (or just the flat side of a chef’s knife) and transfer to a large bowl. Add lemon juice and honey, whisk in ¼ cup of olive oil until emulsified, then stir in a thinly sliced serrano chile and some finely grated ginger. Let it hang out on the counter until everything is ready to serve, which will give the aromatics time to really infuse into the dressing.This recipe really allows carrots to shine, so do them justice with a good scrub. Trim the tops to about one inch, and halve the carrots lengthwise, so you still have that distinctive carrot shape. Don’t bother peeling them—not only do the thin skins pack lots nutrients, but you’ll also get a better char with them on. Leave any especially skinny carrots whole, and whack any especially thick carrots into quarters so they’re all relatively uniform. Toss them with two tablespoons of olive oil and some salt, then grill them, turning occasionally, until lightly charred in spots and tender, 14–18 minutes. Immediately transfer carrots to the bowl with sauce and toss to coat, to ensure the sauce coats evenly. We’re going for maximum spicy-sweet goodness here.Now, it’s time to cut the avocado. Think big, audacious hunks, not dainty cubes. “I don’t want to see chopped avocado, ever, on anything,” says Andy. “It’s boring to eat.” Strong words from a man who has opinions on everything from herb placement to cabbage color (for grilling, always use purple), but trust me: He’s right. Big avocado chunks swathed in honey and little salt specks are downright luxurious, especially when you consider how much a good avocado can cost.Arrange avocado and carrots on a platter, spoon any remaining sauce over, then top with mint leaves. You can go ahead and serve right away, but I love this salad best at room temperature. Find a festive beverage, some friends, and a spot in the sun. Then dig in—and try not to eat all the avocado first. Get all the ingredients in one bite, and you'll see how truly perfect this salad is.Get the recipeGrilled Carrots with Avocado and MintYou actually don’t have to bother with peeling the carrots for this recipe—not only do the thin skins pack lots nutrients, but you’ll also get a better char with them on.View RecipeExplore Bon AppétitHealthyishCarrotGrillAvocadoSaladSummer SidesRead Morecooking55 Healthy Grilling Recipes to Make This SummerGallery65 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-15", "author": ["Condé Nast", "Aliza Abarbanel"]}