{"id": "5955aa707e2323fd02d9a72722815bbd", "url": "https://www.bonappetit.com/story/whisky-highball", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "The 5 Elements of a Flawless Highball | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe 5 Elements of a Flawless HighballAfter a year of R&D, bartender Bobby Heugel landed on this near-perfect version of the whisky highball.By Elyse Inamine and Robert SimonsonJuly 16, 2019FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.In Japan, the proper execution of the highball amounts to a religion. It’s a simple cocktail that’s literally just booze and mixer, but it has a cult following among serious bartenders throughout the country. “It’s an exercise in simplicity,” says Bobby Heugel, the bartender behind Tongue-Cut Sparrow in Houston. For his own house highball, he studied the best versions in Japan, like the ice-less version at Bar Track in Tokyo, and worked on his recipe for over a year. “How cold is the whisky? Does the sparkling water have the right texture from the carbonation and subtlety so it doesn’t cover up the particular delicacies of Japanese whisky? How cold is the glass? Lemon twist or not?” he rattles off all the questions he considered during R&D. “I love Japanese highballs because of how simple they are, and that simplicity is a real test for bars that claim to make exquisite cocktails.” Here, Heugel breaks down every little detail that goes into Tongue-Cut Sparrow’s near-perfect version.The GlassThe HS (hard strong) glass is made by famed Japanese glassware brand Toyo-Sasaki and was selected by Heugel for its delicate yet sturdy build.The WaterHeugel uses Mountain Valley Spring Water because he believes it most closely mirrors the softer, less minerally flavor of Japanese sparkling waters.The WhiskeyIt’s got one and a half ounces of Suntory’s bargain brand Toki, which has become the industry standard for highballs. (Other Suntory whiskies are too expensive and rare.) It’s kept in the freezer until needed.The IceMost highballs take ice. Heugel opts for none; he likes the attractive simplicity in this presentation. But the drink is still plenty cold thanks to the chilled whisky.The TwistA lemon twist is optional, but Heugel likes to garnish with one in the summer because it brightens the drink in the Texas heat.Explore Bon AppétitCocktailSummer DrinksDish DecodedRead MorecookingKick Off Summer with a Big Ol' Pitcher of Pimm's CupsBy Al Cullitoncooking4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in SightBy Al CullitoncultureI Fly This Airline Just for the Cocktail MixersBy Amiel StanekLifestyleMy Intrepid Quest for a Non-Alcoholic Cocktail I Actually Want to DrinkBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Elyse Inamine", "Robert Simonson"]}