{"id": "595cf1c725a669a9ee804cb9bedd461d", "url": "https://www.bonappetit.com/story/fake-manuka-honey", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Mānuka Honey Is a Wellness Wonder—But Your Jar Could Be a Fake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMānuka Honey Is a Wellness Wonder—But Your Jar Could Be a FakeHere's how to make sure you're buying the real thing.By Hillary EatonMay 13, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn the jade roller–colored realm of wellness, where you can pick up $80 crystal water bottles, adorably packaged ceremonial-grade matcha, and reishi-infused wellness shots, there’s nothing like mānuka honey.Made from the nectar of New Zealand’s mānuka tree, mānuka honey is prized for its antibacterial, antiviral, and anti-inflammatory properties. New Zealand’s Māori people have used the mānuka plant for medicinal purposes for centuries, but mānuka honey didn’t gain global popularity until the late 1980s after New Zealand biochemist Peter Molan’s discovery of methylglyoxal (MGO), an antimicrobial and antibacterial compound found in high concentration in mānuka honey. (Some honeys have it in trace amounts, but not nearly as high as in mānuka honey.) Today mānuka honey can be seen across Instagram slathered on skin to fight acne and recommended by holistic health practitioners for its ability to fight throat infections and help heal wounds.A small jar of high-grade mānuka honey can run upward of $180, making it one of the world’s most expensive honeys. It’s also reportedly one of the world’s most fraudulently labeled ingredients.According to a 2014 report by the New Zealand Ministry of Primary Industries, New Zealand produces about 1,700 tons of real mānuka honey each year, but over 10,000 tons of “mānuka honey” is sold on the global market. The truth is, that pretty jar of mānuka in your medicine cabinet might be adulterated or diluted with other honey. It might not be mānuka honey at all.Up close and personal with a mānuka honey hive.\nThe mānuka flower blooms for only two to six weeks each year and only grows in New Zealand  (and, according to Australia, Australia). Hives produce a limited amount of high-grade monofloral mānuka honey each season, driving prices up to $1,000 per kilogram. Those sky-high prices are one of the main reasons the product is frequently mixed with other honey and even synthetic chemicals. According to The Guardian, New Zealand’s historic case again Evergreen Life Ltd. earlier this year included 67 charges of alleged adulteration of mānuka honey with chemicals, including dihydroxyacetone, a chemical used in tanning lotions.Inaccurate labeling is another rampant issue. Just last year, Trader Joe’s had a class action lawsuit filed against it for selling mānuka honey fraudulently labeled as 100 percent pure that tested between 57.3 and 62.6 percent mānuka honey. (There’s a motion to dismiss the lawsuit this month.)Fera Science Ltd., a British research company that investigates and tests food products, found that mānuka honey sold in America was much lower quality mānuka than advertised on the jar. Manuka Doctor 20+ was shown to have such low levels of MGO that it didn’t even register on the test, suggesting that it was possibly not mānuka at all. Wedderspoon’s honey, which is labeled with the brand’s own grading system, “KFactor,” showed low levels of mānuka’s unique compounds. (While the K Factor system is approved by New Zealand’s Ministry of Primary Industries to quantify mānuka’s honey by MPI standard, it does not measure for mānuka’s prized antibacterial methylglyoxal component. Instead, it looks at the pollen count and four other unique chemical markers.)Labeling and terminology are two of the biggest hurdles consumers have to overcome when searching for a jar of authentic mānuka honey. “Labels with ‘Active’ and ‘KFactor’ can easily mislead consumers,” Sunil Pinnamaneni, Chief Technical Officer of Agritesting laboratories, tells Healthyish.MGO, a measure of how much methylglyoxal is present in the honey, is the most widely known mānuka honey grading system in the United States. The higher the MGO rating (it maxes out at 1000 mg, which is where things get pricey), the higher the antibacterial strength in the honey. However, MGO grades are determined by the company selling the honey with no third-party market authentication.That lack of oversight led to the creation of The Unique Mānuka Factor Honey Association (UMFHA). It’s an independent third party that devised a grade scale ranging from UMF 5+ to UMF 25+ .“Anyone can put any MGO rating on their honey,” John Rawcliffe, a UMFHA administrator tells Healthyish. “But to use the UMF you must have a license and follow the set rules and obligations to guarantee authenticity to the customer.”For a honey manufacturer to acquire a UMF rating, the UMFHA tests for unique compounds found in mānuka, including leptosperin, which is difficult to adulterate. It’s an important qualifier now that fraudulent producers have developed synthetic methylglyoxal, which can be added to honey to dupe authenticity tests and consumers (yes, that really happens). If a honey tests for MGO but not leptosperin, it’s not real mānuka. The UMFHA carries out blind marketplace testing to ensure authenticity.Flora's double-certified honey.\nPhoto by Alex LauSome mānuka honey producers are also working to shape the future of what is projected to become a $1.2 billion industry by 2028.A partnership between the U.S. manufacturer Flora Health and the Te Arawa Māori tribe of New Zealand’s Onuku Māori Land Trust sends a percentage of proceeds to support the Te Arawa people. [Editor’s note: In a previous role, Hillary Eaton consulted for Flora Health on social media strategy and social partnerships.] Flora’s honey uses both MGO and UMF labels along with a scannable microchip that provides harvest information, supply chain, and individual UMF lab tests for each jar.As the mānuka honey industry grows, protection against counterfeiting, product verifiability, and transparency will need to grow too. Lobbyists are pushing the New Zealand’s Ministry of Primary Industries to create more definitive export guidelines, and emerging honey brands seem to be adhering to ingredient transparency. But as in cases of other food fraud around the world (we’re looking at you, Parmesan and wagyu), consumer discretion and education is your number one fail-safe. After all, if you’re going to spend the big bucks on some of the most precious honey in the world, it better be real.Explore Bon AppétitHealthyishhoneyNew ZealandTrendsRead MoreLifestyleActivist Manuka Honey Is the Superfood Sweetener We're Obsessed With Right NowBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-13", "author": ["Condé Nast", "Hillary Eaton"]}