{"id": "595c31084763297ec7cfc899c6d3ec66", "url": "https://www.bonappetit.com/recipe/radishes-with-creme-fraiche-and-furikake", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Radishes With Crème Fraîche and Furikake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueRadishes With Crème Fraîche and FurikakeBy Andy BaraghaniApril 14, 20205.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintThis appetizer is a play on radishes and butter with tangy, saucy crème fraîche and a sprinkle of spicy-umami furikake. You can find furikake, the Japanese seasoning and condiment, in many store-bought styles, but this streamlined homemade version has just five ingredients and is equally versatile on fish, steamed rice, popcorn, or roasted vegetables.Ingredients8 servings1toasted nori sheet, coarsely torn1Tbsp. mild red pepper flakes (such as Aleppo-style, Maras, or gochugaru)1Tbsp. toasted sesame seeds1tsp. flaky sea salt, plus more½lemon1½lb. mixed radishes (such as red, watermelon, and/or black), trimmed¾cup (or more) crème fraîcheSpecial Equipment:A spice millPreparationStep 1Finely grind nori in spice mill; transfer to a small bowl and mix in red pepper flakes, sesame seeds, and 1 tsp. sea salt. Using a Microplane, finely grate zest of lemon half into bowl and use your fingers to work it into nori mixture (this will keep the zest from clumping). Set lemon half aside.Step 2Cut radishes into a mix of ¼\"-thick rounds and 1\"-thick wedges, depending on their size (you just want pieces that are easy to pick up and eat).Step 3To serve, spoon crème fraîche onto one side of a platter or large plate and sprinkle furikake over. Pile up radishes on the other side of the platter. Squeeze juice from reserved lemon half over radishes and sprinkle with a bit of sea salt.How would you rate Radishes With Crème Fraîche and Furikake?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI basically make this except instead of lemon juice I drizzle EVOO.mikeinwnyBuffalo, NY12/21/2020Simple and delicious. I haven't been able to find any watermelon radishes as of late, but regular reds do the trick. A lovely addition to any summer charcuterie set up.Chef_sadgalLos Angeles7/24/2020sukkah = dukkah :)AnonymousLos Angeles5/12/2020This was really good. Our radishes were spicy and the creme fraiche really mellowed it. We didn't have furikake so used sukkah... I know totally different flavor profile but it was perfect and used what we had. AnonymousLos Angeles5/12/2020Amazing! never thought to put furikake on anything other than asian based dishes, but this one is a go. I eat sliced radishes with fresh salted butter almost every damn day, can't wait to try this one out :) goodbyekissPortland OR4/15/2020Explore Bon AppétitCruditéDipRadishVegetableNoriSeaweedOther IngredientsSpringEasyQuickSnackStarterGluten-FreeVegetarianKetoHealthyishNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}