{"id": "59628ed41ed7b0cbc542e53620c42ea1", "url": "https://www.bonappetit.com/story/hanger-steak-scallion-sauce-recipe", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Let This Hanger Steak with Scallion Sauce Be Your Life Coach | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLet This Hanger Steak with Scallion Sauce Be Your Life CoachWe have a new recipe that swaps your usual chimichurri with a charred scallion sauce instead, and is easy enough to pull off on a weeknight.By Carey PolisJune 1, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailYou know when you get back from vacation and you’re like “I’m going to eat so healthy and treat my body right and even go to the gym in the morning”? Well good on you if you actually do that, but I tend to... not.Which is how I found myself deciding to make this Hanger Steak with Charred Scallion Sauce the day after a four-day eating bender in London. And eating it for dinner... and lunch the next day... and then dinner again. I didn’t even warm it up for dinner number two. I just ate cold steak and cold rice. So uh, I’ve pretty much eaten only steak for the past two days. Cool. Maybe I should be a life coach.Onward!Here’s a thing I don’t like about toasting nuts: In most recipes, you always have to wait for them to cool before moving onto the next step. I don’t have that kind of patience. But in this recipe, you grate garlic and add olive oil while the nuts are still warm. This is how I knew we were meant to be. Me and this steak.From there, you cook the hanger steak in a cast iron pan, let it rest, and add scallions to the pan. Hot tip: You need two bunches of scallions. But, if you only buy one bunch because you’ve literally never had a recipe call for two bunches, for example, it’s all going to be fine. Let the scallions char and shrink a bit, then slice ‘em into one-inch pieces.Like so.\nAdd them to the nut mixture, plus 5 tablespoons red wine vinegar (this recipe is great for vinegar-fiends), 1 tablespoon chopped cornichons (okay let’s be real, you’ve already eaten six cornichons while the steak was cooking, so chop whatever you have), 1 tablespoon chopped capers, 1 tablespoon mustard, and a pinch of sugar.This sauce is everything. You’ll keep eating more steak not even because steak is always delicious but because the super acidic sauce mixed with the steak is apparently an effective antidote to jet lag, that itchy cut on your arm, your mounting credit card bill from said London weekend, and that one reply-all thread that just. won’t. die.So eat the steak. Spoon the sauce straight from the bowl if you need to. Everything is gonna be fine. Now accepting clients for my new life coaching side hustle.Get the Recipe:Hanger Steak with Charred Scallion SauceFirst you get excited because: hanger steak. And then you taste that scallion sauce...View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-01", "author": ["Condé Nast", "Carey Polis"]}