{"id": "596548f2cc409bd8c728c5343f585622", "url": "https://www.bonappetit.com/story/a-locavores-guide-to-south-carolinas-charming-culinary-gem", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "A Locavore’s Guide to South Carolina’s Charming Culinary Gem | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Locavore’s Guide to South Carolina’s Charming Culinary GemBy Greenville, SCMarch 1, 2018FacebookTwitterEmailBacon Bros. Public House // Stephen StinsonFacebookTwitterEmailYou may be surprised to hear that Greenville, South Carolina  has a burgeoning culinary scene. One so interesting and ripe with delicious choices of cafés, breweries, bars, and restaurants that we recommend you head there and start exploring before the secret gets out. It’s a city that takes its farm-to-fork food movement seriously—you’ll see it across a multitude of spots, from local breweries, restaurants serving thoughtfully prepared small plates, multiuse food communities, and even speakeasy cocktail bars. Here, a few of our favorites that you should try on your next visit.Where Simple Ingredients Meet Unique Small PlatesThe Anchorage // Stephen StinsonIf you love the vibe of casual neighborhood spots, the Village of West Greenville’s The Anchorage should be high on your must-visit list—especially after their recent selection as a Best New Restaurant semifinalist in this year’s James Beard Awards. They are focused on working one-on-one with local producers, artisans, and craftsmen to create a unique menu and dining experiences for their guests. Whether it’s their small plates (don’t miss the chilled local trout with apple, scallion, and jalapeño) or their list of craft cocktails, beers, and sustainable wines—it’s the kind of place where you’ll want to hunker down and stay awhile. Grab a table or a spot at the bar and try an assortment of their eclectic dishes that beautifully showcase simple ingredients.The Food Community You’ll Want to Be a Part OfSwamp Rabbit Cafe & GroceryThe once abandoned building along the GHS Swamp Rabbit Trail now houses the multiuse food community Swamp Rabbit Cafe & Grocery. Their (delicious) mission is to buy, sell, and cook with fresh, local food, which in turn helps local farmers thrive! Whether you stop by to visit their grocery store, café, butcher, or bakery, make sure to spend time at their wood-fired pizza restaurant, Swamp Pizza. A standout order is the veggie pie. It’s packed with Crescent Farm organic sweet potatoes and kale, organic cabbage, and red onion, with house-made red sauce topped with Possum Kingdom Kreamery fresh mozzarella and Forx Farm Gouda. A bonus: Even their crust is made using local Carolina Ground flour.Fly By for a Farm-to-Pint ExperienceBirds Fly South Ale ProjectThe family-owned and -run brewery Birds Fly South Ale Project crafts their beer with a throwback approach. The urban farmhouse tasting room at Hampton Station in the Water Tower District houses two bars, an outdoor patio, and a Biergarten where you can kick back and try a variety of their brews while listening to live music. You’ll find lots of beer styles on their list, from sours to porters, and a focus on saisons. Don’t miss the farm-to-pint Birds and the (Bee)ts made with local honey and beets—a beer brewed in collaboration with and for James Beard Award–winning chef Sean Brock’s local-food-focused Husk.House-Made Charcuterie, BBQ, and the Freshest ProduceBacon Bros. Public HouseDon’t let their name fool you. Bacon Bros. Public House is much, much more than just bacon. The acclaimed East Greenville restaurant has its own full charcuterie program and offers a delicious made-from-scratch menu. The vibe inside is rustic and comfortable with upcycled interiors made of local pallet wood. If you are seated in the dining area, be sure to take a peek into their cure room to see what the team is working on. Yes, the charc is obviously a hit but they also offer their spin on traditional BBQ, a variety of colorful salads, fresh seafood, and entrées that use fresh local produce.Sip on Seasonal Favorites at This Underground BarVault & Vator // Kevin HarringtonWhen you’re in downtown Greenville, SC, don’t forget to look “underground.” The subterranean speakeasy Vault & Vator creates a sophisticated environment where you can sip on made-to-order libations and discover a multitude of drinks inspired by the Golden Age of cocktails during pre-Prohibition and Prohibition times. Their craft cocktails (like the Pina Pisco Sour) utilize local herbs, spices, fruits, and spirits—perfect to pair alongside a small but well-curated light bites menu.Discover tips and ideas on what to do on your Greenville, SC, trip at VisitGreenvilleSC.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Greenville"]}