{"id": "59844a6404539805df449da01c7f3039", "url": "https://www.bonappetit.com/recipe/steak-and-eggs-with-saucy-beans", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Steak and Eggs with Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSteak and Eggs with Saucy BeansBy Molly BazNovember 20, 20184.9(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe diner classic gets a boost from a pot of zesty, creamy beans and sweet charred limes.Ingredients4 servings2tsp. hot smoked Spanish paprika2tsp. Aleppo-style pepper2½tsp. kosher salt, plus more1tsp. freshly ground black pepper, plus more21¼\"-thick boneless New York strip steaks (about 14 oz. each), patted dry7Tbsp. extra-virgin olive oil, divided2medium shallots, finely chopped4garlic cloves, thinly sliced1small bunch cilantro, stems finely chopped, leaves coarsely chopped115.5-oz. can pinto beans, drained2Tbsp. unsalted butter3limes, halved4large eggsPreparationStep 1Mix paprika, Aleppo-style pepper, 2½ tsp. salt, and 1 tsp. black pepper in a bowl. Rub all over steaks, pressing to adhere. Let sit while you make the beans.Step 2Heat 2 Tbsp. oil in a medium saucepan over medium-low. Cook shallots, garlic, and cilantro stems, stirring often, until softened but not yet browned, about 3 minutes. Add beans, butter, and ¾ cup water. Bring to a simmer and cook, stirring occasionally, until beans are saucy, 6–9 minutes. Remove from heat and stir in cilantro leaves. Finely grate some lime zest from one of the lime halves into beans, then squeeze in its juice. Season with salt and pepper. Cover to keep warm.Step 3Heat a dry 12\" skillet, preferably cast iron, over medium-high. Rub steaks with 3 Tbsp. oil and cook, undisturbed, 3 minutes. Turn and cook on other side 3 minutes, then turn again. Add all remaining lime halves, arranging cut side down. Cook until steaks are medium-rare (a thermometer inserted into thickest part should register 120°) and limes are nicely charred, 2–3 minutes. Transfer steaks and limes to a cutting board. Wipe out skillet.Step 4Heat remaining 2 Tbsp. oil in skillet over medium-high. Cook eggs sunny side up until whites are golden brown and crisp around edges and yolks are runny, about 2 minutes.Step 5Slice steaks against the grain. Divide beans and steaks among plates and top each with an egg. Serve with charred limes for squeezing over.How would you rate Steak and Eggs with Saucy Beans?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis is a winner of a recipe. The lime and cilantro balanced out the richness of the steak and eggs. I added a small heap of dressed frisée and avocado slices. AnonymousSan Francisco8/2/2020Yes it was very good, but I do not like my eggs cooked with crispy bottoms. If I were served eggs done this way I would send them back!  I would rather have them over easy, they look nicer and definitely taste better than burnt eggs.  Sorry I don't even like my omelets browned.peggyk2717Indiana5/19/2019PS...did the Tri Tip on the barbecue!Julianne6Los Angeles3/23/2019What a big surprise!  To cut $$ corners I made this with a marinated tri-tip...and it was DELICIOUS!!  For a family of 4 I made it with 2 cans of beans, 1 cup of water, extra shallots/garlic and 3 tablespoons of butter.  So GOOD!!  I've always been challenged in making sunny-side eggs; following their directions, my eggs turned out perfect.  I Served the meal in pasta bowls with flour and corn tortillas on the side.  This was a big hit and repeat!!Julianne6Los Angeles3/23/2019As I do not eat beef or dairy I did make some adjustments. In place of the steak I used a thick slice of squaw bread slathered with faux butter and coated with the spice which I gently crisped in the skillet. \nI did prepare the beans and eggs to top, made this for a Tapas brunch. Good thing I started a second batch, they inhaled it!!raf \nI have become addicted to Aleppo chilies, used in 93% of food I prepare!rafchardbonesLos Angeles, Ca.3/12/2019Wow, this turned out better than I could’ve imagined! I used ribeye steaks because that’s what I had on hand, and it was amazing! Never squeezed lime on steak or eggs before, but I’d put that charred lime juice on absolutely everything.AnonymousDetroit3/3/2019The beans themselves are good enough to have alone!! But everything worked great together. Love a charred lime. bethwangWashington, DC1/12/2019Wow really delicious food made it www.allrecipiez.com \n#allrecipiez\n@allrecipiezAllrecipiezUSA1/7/2019Explore Bon AppétitSteakBeefMeatEggPinto BeanBeanVegetableAleppo-Style PepperHerbs & SpicesLimeCitrusFruitEasyWeeknight MealsMainNut-FreeSimmerSearBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Molly Baz"]}