{"id": "598c5b5ca2071c56a77145e2fe2c9a3e", "url": "https://www.bonappetit.com/recipe/winter-squash-and-kale-pasta", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Winter Squash and Kale Pasta With Pecan Breadcrumbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueWinter Squash and Kale Pasta With Pecan BreadcrumbsBy John Dearth, Lantern InnSeptember 14, 20214.6(90)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis cozy winter squash and kale pasta from The Lantern Inn in Wassaic, NY, uses an entire butternut squash, a whole bunch of kale, and crunchy pecan breadcrumbs for total fall bliss in dinner form.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonTongs$13 At AmazonMicroplane Grater$16 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 Servings½cup finely chopped pecans½cup panko2tsp. finely grated lemon zest1tsp. plus 3 Tbsp. extra-virgin olive oil, dividedKosher salt1large butternut squash (about 3 lb.), peeled, halved, seeds removed, cut into 1\" cubes2tsp. dried oreganoFreshly ground black pepper12oz. spaghetti or other long pasta6garlic cloves, thinly sliced1large bunch kale, ribs and stems removed, leaves torn into 2\" pieces½cup (1 stick) unsalted butter, cut into pieces1oz. Parmesan, finely grated¼cup chopped parsley¼cup fresh lemon juicePreparationStep 1Place racks in upper and lower thirds of oven and preheat to 350°. Spread out pecans and panko on a small rimmed baking sheet and toast on upper rack, tossing halfway through, until nuts are slightly darkened and panko is golden, 7–9 minutes. Let cool slightly, then transfer pecans and panko to a small bowl and stir in lemon zest, 1 tsp. oil, and a pinch of salt. Set pecan breadcrumbs aside.Step 2Increase oven temperature to 400°. Divide squash between 2 rimmed baking sheets; drizzle with 2 Tbsp. oil. Sprinkle oregano over, season with salt and pepper, and toss to coat. Roast, tossing halfway through, until tender and browned in spots, 25–30 minutes.Step 3Meanwhile, cook pasta in a large pot of generously salted boiling water, stirring occasionally, until very al dente, about 2 minutes less than package directions. Drain, reserving 1½ cups pasta cooking liquid.Step 4Heat remaining 1 Tbsp. oil in a medium Dutch oven over medium. Cook garlic, stirring, until tender but not browned, about 1 minute. Add kale and cook, stirring, until beginning to wilt, about 2 minutes. Add 1 cup reserved pasta cooking liquid, cover pot, and cook until kale is completely wilted, about 4 minutes. Uncover pot, add butter, and stir until melted. Add Parmesan and pasta and cook, tossing vigorously with tongs and adding more pasta cooking liquid if needed, until pasta is al dente and sauce coats pasta, about 2 minutes. Remove from heat and toss in squash, parsley, and lemon juice. Taste and season with more salt if needed.Step 5Divide pasta among shallow bowls; top with reserved pecan breadcrumbs and season generously with pepper.How would you rate Winter Squash and Kale Pasta With Pecan Breadcrumbs?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleHonestly found this pretty bland and in serious need of extra flavor. The sauce was also very thin. AnonymousSt. Louis 3/11/2022Pretty bland to be honestAnonymous2/21/2022Good, but I would halve the butter next time and add way more greens.SkankasaurusPhiladelphia2/1/2022Well balanced, flavorful. I recommend making more broth. I also used a lot more Thai chilis, but I like the heat. Nice recipe, it's now a part of my monthly meal plan, thanks!Ed Y.Dogtown, Mo. USA1/30/2022I didn't use kale either time I followed the recipe, but the lack of extra veg didn't take away from the dish. I liked the lemony freshness throughout every bite. I tried with mushrooms which turned out pretty great. A good base recipe to make your own.KateAshland, WI1/22/2022Would not make this again. I truly don’t understand the previous reviews. This pasta was bland, the butternut squash mushy despite crisping them and spreading them between two different sheets. The only redeeming quality was the crisp on top, but even that didn’t have much flavor. The “sauce” is barely any cheese and mostly water, with very little acidity from the lemon juice. In the end, this was just a dressed up version of the butter noodles I ate as a kid. Very disappointing.AshMonroe, WA1/12/2022made it vegan by using earth balance vegan butter & nutritional yeast for the parmesan. made it gluten free by using gf rummo spaghetti & gf panko (which i made more palatable by crushing with a tenderizer). i also increased the garlic & added red pepper flakes. highly recommend- i crave the beautiful lemon notes days after having it.moonbeamsanta cruz, ca1/9/2022Yay, a recipe I can manipulate into a whole food plant-based/vegan indulgence! I used acorn squash and baby spinach for this, and to cut back on fat, I avoided using any oil until starting to wilt my spinach. I also substituted 1/4 cup of Earth Balance for the 1/2 cup of butter, and instead of your typical parmesan, I used Follow Your Heart's dairy-free parmesan. For the pasta, I used Mantova's organic whole wheat spaghetti. This came out absolutely delicioso! And ohmigosh, that crusty pecan/panko, that right there is where the money is at! Oh, and the lemon zest is completely necessary if you want a true explosion of flavor!!! RikaGrove City, PA1/6/2022It’s really good, but it is so much better with red pepper flakes.AnonymousNew Haven, CT12/30/2021Delicious vegitarian dish! Im always looking for good recipes without meat and this one is a winner. Followed recipe as is! SherryJacksonville, FL12/28/202112/27/21 - Delicious! Lots of prep so start early!JaneHolden, MA (Central MA)12/28/2021sooo delicious, surprised my roommate with it and we both ate so much we got sleepy. replaced squash with sweet potato and kale with baby spinach, since that's what i had, but still totally yum. the topping is perfect. flexible, tasty, somewhat involved dinner.laurenChicago, IL11/30/2021I would spend $25 on a serving of this at a restaurant, and would be pleased! This is a special recipe. I used a whole kabocha squash with the skin on - excellent! Used about 2/3 the butter and would do the same again. The lemon zest + pecans are a complementary duo!AnonymousSeattle, WA11/16/2021Delicious. We used a flavored pasta which only added to the final dish. Used about half the butter and it was still plenty rich and flavorful.Anonymous11/14/2021You know it’s good when you’re supposed to be cleaning up but you’re eating the leftovers out of the pot. 10/10\nMegan MChicago11/14/2021Explore Bon AppétitWinter SquashKaleLeafy GreensVegetableBreadcrumbsPastaPecanNutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "John Dearth", "Lantern Inn"]}