{"id": "598d715f87e72c39f345ace9541339d6", "url": "https://www.bonappetit.com/story/thirties-dinner-party", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "30-Something Dinner Parties Are the Best Dinner Parties | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle30-Something Dinner Parties Are the Best Dinner PartiesBy this point in your life, you know that all the cooking you're doing isn't for your friends. It's for you.By Amiel Stanek and Lauren SchaeferJune 12, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailThis story is part of the Healthyish Guide to Your 30s, our best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.So: You’re in your 30s. And you’re going to have a dinner party.You know what, scratch that: You are, to quote Alison Roman, the Martha of our time, Having people over. “Dinner party” has such a try-hard ring to it, smacks of dinner plates and salad plates and separate glasses for water and wine (you’re doing those dishes, remember?). You’re not a 20-something playing House. You’re not “adulting”; you’re a goddamn Adult. And inviting people over to your place for food and drink and good-time having doesn’t have to be a thing.You’re going to plan a menu. As in, decide what you’re going to serve in advance. What you’re not going to do is put together a multi-course Menu with a capital M assembled from four different of-the-moment cookbooks full of recipes you’ve been dying to try ever since so-and-so posted photos of them on Instagram. You’re not going to scramble to eight different stores to get a bunch of ingredients that you’re probably never going to use again, or realize only while you’re checking out at the butcher shop that that quantity of ribeye is going to cost as much as your monthly Metrocard. Those days are over. Because the whole you-in-the-kitchen-all-day-and-all-night-don’t-serve-dinner-until-eleven-p.m. thing ain’t your speed anymore. And literally none of your friends are even going to notice how much work and expense went into the damn thing.No, you’re going to make something simple, but beautiful. As in, easy to love with but not a pain in the ass to make. And you’re not going to generate any more dishes than you want to wash. And you’re going to be able to have it all ready before your guests arrive. Oh, and it’s going to be vegan and mostly gluten-free, because if someone put a gun to your head and asked you to correctly identify ten of your friends’ dietary restrictions at any given moment—let alone their plus-ones—you’d be a goner.You’re going to make them beans. And they’re going to like it.Seriously though! They’re going to like—no, love—those beans because, at this point in your cooking life, you know that patience and care and more salt than 22-year-old you would ever think to use are all you need to turn humble (read: cheap) ingredients into delicious, nourishing, soul-satisfying meals. You’re not looking for fireworks; it’s the fireflies you’re after.Inviting people over to your place for food and drink and good-time having doesn’t have to be a thing.Right, so: You’re having people over on Saturday. On Friday, you hit the farmers’ market on the way in to work, because waking up an hour earlier than usual doesn’t feel like such a Herculean feat anymore, and you know that the Saturday market is for tourists. You snag the good-good before it’s completely picked-over and sun wilted. Asparagus. Radishes. Celery. Bunches of mint and parsley. You spring for the eight dollar bag of local heirloom beans because, hey, it beats spending a hundred dollars on beef. You pick up a few loose ends from the grocery store, and stash it all in the lunch fridge when you get to work; let them get mad.That night, you don’t forget to soak those fancy beans in plenty of water so they’re ready to go the next day. You do this because you’re definitely not going out on Friday. How did you ever party on Friday night, anyway? Was there a time when you weren’t this tired all the time? You muse on this while eating Chinese food, watching Netflix, and accidentally drinking one too many glasses of wine before passing out before midnight. T.G.I.F.You sleep in until 9 on Saturday. You wake up refreshed(ish), not (too) hungover, and (mostly) ready to cook. You take a moment to remember what it was like to wake up at noon on the day of, beat as all hell, and realize that you hadn’t even gone shopping yet. A self-satisfied smile is plastered across your face as you transfer your soaked, drained beans to a handsome Dutch oven, cover them with water, and add aromatics until the whole thing looks like a witch’s brew—celery, onion, parsley, garlic, dried mushrooms, plenty of olive oil and salt. These are beans. You bring them to a boil, cover them, and transfer them to a low oven to cook ever so gently. (And because you know that you’ll just mess with them when they’re on the stove, and the beans will get all broken if you do that, and you are a Grown Adult who definitely doesn’t futz with food while it cooks or pop pimples or pick scabs even though you know you shouldn’t.)The bean bath\nPhoto by Emma Fishman, Food Styling by Susie TheodorouPeople are always whining about how long beans take to cook, but you know better. They’re only going to take an hour! More self-satisfied smiling. You could do some prep work, but you’ve got nothing but time on your hands, and getting back in bed with coffee sounds really nice, so you do. You deserve it. You’re all kinds of set up. Look at you!The bean timer goes off and they’re perfect. You make sure to check at least three beans to make sure they’re actually done, perfectly creamy and not at all mealy; this will absolutely not be a repeat of the crunchy kidney bean chili debacle of 2013. You’re going to fish out all of those aromatics and pitch them—they’ve done all they can—and make sure that delicious bean broth is riiiiiiiight on the edge of too-salty. You wonder for a moment if it’s weird to be this excited about bean broth, but only for a moment, because you’ve got half of dinner ready and it’s not even noon.You put on a podcast and get the rest of your prep work out of the way. You wash and thinly slice radishes with a mandoline, a tool you used to be terrified of and kept on using even after you cut yourself that one time—which actually wasn’t even that bad—because it makes food look so fancy. You are strong. You are tenacious. You are resilient and brave. You keep the sliced radishes in cold water in the fridge so they won’t get all dried out and weird. You are a good cook.You move the frozen peas from the freezer to the fridge to thaw. (What is this, Chez Panisse? You’re not shucking your own peas.) You cut lemons into nice little wedges. You make a salsa verde, or a pistou, or a chimichurri, or whatever you want to call it; you don’t really know the difference, but neither do any of your friends.Instead of chopping through the whole bunch of asparagus like you used to, you take the time to bend each one so that it breaks naturally, right where it starts to get woody and tough. You slice the asparagus into thin coins but separate out the frilly tips and cut each one in half lengthwise, so it looks extra cute and cooks at the same rate as the rest of the asparagus. This is the kind of shit you do when you cook now: little things that take time and energy and focus that literally nobody else is going to notice except for you. Because at this point, that’s who you’re cooking for at the end of the day.This is what all this hard work is for.\nPhoto by Emma Fishman, Food Styling by Susie TheodorouAnd all of a sudden there you are, standing in your kitchen, dinner all ready to go, all of the dishes done, counters wiped down, ready for guests to arrive. And it’s only 3 p.m. You have time to set the table. You have time to make a last-minute appetizer from odds and ends you find in your fridge. (How do you still forget the appetizer?) You have time to take a shower. Hell, you have time to take a bath. That self-satisfied smile? Still there.Some things never change. A few of your friends arrive annoyingly early; a few arrive comically late. But what has changed is that you don’t even care, because you’re just kicking it, drinking the surprisingly good wine some of your friends can be counted on to bring now, knowing that you can have dinner on the table in 15 minutes flat.So you wait for the final “SO SORRY just got off the train!!” text to bring the pot of beans to a simmer. You fry some thick slabs of sourdough in plenty of grassy olive oil and shower them with crunchy salt and pile them on a platter. When your friend asks if they can help, you are poised and collected enough to actually delegate for once in your life—they can bring out all of the garnishes, and light the candles, and fill a couple of empty wine bottles with water for the table. And when that last guest walks through the door, you can throw your lovingly prepped veggies into your Dutch oven full of lovingly cooked beans to cook ever-so gently, and ferry it out to a table full of people you know and love who know and love you back. And you pass bowls and garnishes and eat and drink too much and stay up too late talking too loud and smoke cigarettes out the window as if it even makes a difference.And you never for one moment wish you were even one day younger than you are today.Get the recipe:White Bean and Spring Vegetable StewThis stew recipe is all about those lovingly cooked and seasoned dried beans and the glorious (vegan!) broth they create.View RecipeExplore Bon AppétitHealthyishDinnerPartyGuide to Your 30sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Amiel Stanek", "Lauren Schaefer"]}