{"id": "5992d157ff48a000dd781291761f133f", "url": "https://www.bonappetit.com/story/wet-city-brewing-spaghett", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "It’s Called Spaghett and It’s Now My Favorite Summer Cocktail | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIt’s Called Spaghett and It’s Now My Favorite Summer CocktailI ordered this drink based on the name alone. How could you not?!By Alex DelanyAugust 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Last time I was in Baltimore, I was thirsty. Really thirsty. As I perused the little happy hour menu card at Wet City Brewing, I waited for something extra cold and quenching to catch my eye. I got all the way to the end when I spotted it: Spaghett - $5. I ordered it based on the name alone. How could you not!?! Spaghetti without the eeee?!?Truly, I’m thankful I did, because this cocktail has become my official drink of summer. It’s got just three ingredients—Miller High Life, Aperol, and lemon juice—and had all the characteristics I was looking for without my even knowing it: light, fruity, slightly bitter, and just tart enough to lead you back for another sip.It’s so straight forward, I’ve brought the recipe home. I just pour an ounce of Aperol and lemon juice directly into a bottle of High Life, aaaand done. The bubbly, rose gold liquid goes down easy, especially when it’s cold as it can be without turning into a beer slushie. Which, now that I’m thinking of it, might not be that bad of an idea. Regardless, this is on deck for the rest of August and most of September for me. Long live Baltimore. Long live summer. And long live the Spaghett.Go there: Wet City BrewingExplore Bon AppétitHighly RecommendCocktailBaltimoreRead MorecookingIf You Can Open a Cheap Beer, You Can Make This CocktailBy Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-06", "author": ["Condé Nast", "Alex Delany"]}