{"id": "59945d8c38adf225e5c41ffaa0973988", "url": "https://www.bonappetit.com/story/pogiboy-to-chino-burger-washington-dc", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "This Burger at D.C.’s Pogiboy Is Savory, Sweet, and Distinctly Filipino | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Burger at D.C.’s Pogiboy Is Savory, Sweet, and Distinctly FilipinoChefs Tom Cunanan and Paolo Dungca bring Filipino flavors and burger-joint-honed techniques to their crowd-pleasing To “Chino” burger.By Joseph HernandezJuly 23, 2021FacebookTwitterEmailPhoto by Costa KirkwoodFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s...well...dish that we’re obsessed with right now.For many Filipinx people Jollibee is synonymous with fast food, particularly its shatteringly crisp chicken and spaghetti studded with fiery red hot dogs. But even as the Philippine’s fastest-growing restaurant export expands throughout the U.S., it is far from ubiquitous. “Some people will drive three hours just to have a taste of it, which is wild,” says Tom Cunanan, one of the two chefs behind Pogiboy in Washington, D.C. “We thought, Why not do our own version here?”Cunanan and co-chef Paolo Dungca—they worked together at the groundbreaking restaurant Bad Saint—opened Pogiboy in March. Tagalog for “handsome boy,” Pogiboy is a term of endearment which aunties from all walks of life generously shower upon pretty much every Filipino boy. It is also a wink to the nostalgia the team serves. Rather than focus on exclusively traditional dishes, the duo draws from their childhood memories of drive-thru hamburgers, their identities, and suburban dining.Where Bad Saint was a game-changing celebration of Filipinx fine-dining, Pogiboy is more low-key and casual. For starters, there’s the splashy primary-blue-and-yellow Pogiboy logo that’s a callback to suburban Maryland Bob’s Big Boy, where Cunanan and his siblings regularly dined as kids, and references on the menu to Jollibee and Outback Steakhouse favorites: sinigang fried chicken, which draws flavors from a classic sour soup, and a deep-fried blooming onion served with a genius crab-fat mayo and scallion seasoning.But the main event is the To “Chino” burger, a stacked smash burger that rethinks Filipino flavors and execution. “We can’t claim this burger as our own,” Cunanan says. “Our friend Charles Olalia [chef of the shuttered Ma’am Sir in Los Angeles] had a longanisa sandwich on his menu, and this is our homage to him—we wouldn’t be here without our friends and family.”Here Cunanan and Dunga break down their version of the burger.The PattiesThese are a 50-50 blend of tocino, pork belly cured in annatto and garlic, and longanisa, a type of sausage found across the Philippines. Smashing the patties enhances the slightly sweet flavor both meats are prized for—something Cunanan learned as a burger joint line cook in his 20s.The BunCunanan and Dungca couldn’t do brioche (too sweet for the patties) or typically soft potato buns (too gummy after soaking up the patty juices). Their business partner, Arturo Mei, recommended the sturdy, savory potato buns from Ottenberg’s Bakers in Baltimore. Just right.The Pineapple“In my experience, if you’re a Pacific Islander, say from Guam, the Philippines, or Hawaii, you always want pork with pineapple,” Cunanan says. Sliced thinner than the canned stuff and quickly charred on the grill, fresh pineapple rings “add acid and texture, plus a caramelly note.”The PickleEvery burger needs a pickle. Enter the house atchara, a Filipino green papaya pickled with Datu Puti sugarcane vinegar, that’s bolstered with carrots and onions. “Vinegar is almost sacred to Filipinos,” Dungca says. “It’s served in some form with every meal.”The Secret SauceJufran banana ketchup, another Filipino kitchen staple, is blended with Duke’s mayo, gochugaru, cornichons, house-made chile vinegar, and Maggi Magic Sarap seasoning. “It’s Filipino Thousand Island,” Cunanan says. “When they eat this I want Filipino customers to be smacked in the face with nostalgia.”Explore Bon AppétitRestaurantsDish DecodedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-23", "author": ["Condé Nast", "Joseph Hernandez"]}