{"id": "599ce386a155237105638145eea7f89f", "url": "https://www.bonappetit.com/story/norwegian-crisp-bread-knekkebrod", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "I Eat an Unhealthy Amount of These Healthy Norwegian Knekkebrod Crackers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Eat an Unhealthy Amount of These Healthy CrackersCrispy, crunchy, and packed with seeds, I don’t feel so bad about how many bags I go through.By Molly BazJune 26, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m embarrassed to admit it, but I first encountered these supremely crunchy, seedy, savory Norwegian Knekkebrod during a short-lived attempt at conscious, “clean” eating. It was four months before my wedding and obviously I needed to look really friggin’ good in my two-piece, crop-top wedding dress. I’m not usually one to impose restrictions on what I’m eating (I’m just not about that life; okay, maybe I’m just not that good at that life—whatever!), but in this case I was willing to choose something a bit more wholesome than the Dipsy Doodles I usually snack on.It was baker Hedvig Bourbon’s nutritious mix of rye flour and seeds (pumpkin, sesame, sunflower, and flax) that first caught my eye—lots of fiber and healthy fats; no white flour, and definitely nothing fried. But then I tried one, and all my well-intentioned motivations became way beside the point: These crackers turned out to be outrageously tasty.Crispy, crunchy, seedy heaven.\nPhoto by Chelsie CraigSturdy and versatile enough to hold up to whatever I schmeared on them (labneh! nut butter! paté!) or dipped them into (hummus! tomato soup! tzatziki!), I started eating them with anything and everything I could find. And when there was nothing, there was Knekkebrod on its own. Salty, earthy, nutty and crisp as hell, it’s not for nothin’ that the Norwegians call ‘em crisp breads. They were so good, they edged their way into my regular rotation of snicky-snacks, and have stayed there ever since.Years later, my days of virtuous eating are long behind me, but my love for these addictive crackers is forever.Buy it: Norwegian Baked Knekkebrød 2-Bag Sampler, $20 on EtsyExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-26", "author": ["Condé Nast", "Molly Baz"]}