{"id": "599fda2138520ecb1e152fffbca830da", "url": "https://www.bonappetit.com/story/tea-strainer", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "This Tea Strainer Made Me a Loose Leaf Convert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Tea Strainer Made Me a Loose Leaf ConvertMost strainers are annoying to use, but this one is the highlight of my day.By Meryl RothsteinMarch 3, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Ever heard of “tea dust”? That’s what tea experts call the stuff inside a standard-issue, single-use tea bag, and it’s not a compliment. Ground leaves are usually lower quality than loose-leaf tea, and they oxidize more quickly, taking flavor and aroma along with it.I’m no tea expert—just a tea fan. But in the last decade, I’ve become a loose leaf convert. It started when my friend Erin gifted me the For Life tea strainer, and I noticed a difference right away. Loose leaf tea has more nuance and depth: I can really taste the bergamot in Earl Grey, and smell those roasty, nutty notes in hojicha. I also like that it’s less wasteful than individually wrapped, single-use tea bags.The knock on loose leaf is that it’s more work. And with most strainers, that’s true, because most strainers are annoying. You have to scoop the tea, then get it into one of those tiny tea balls without spilling all over the counter. Tea balls have fine, flexible mesh that can also be hard to clean and they typically don’t seal perfectly, so rogue leaves float into the tea. (DIY loose leaf tea bags are a decent option, but they still require packing and they’re also a bit more wasteful than reusable strainers.) But the For Life strainer avoids all of that.This strainer is as wide as most standard mugs, so dropping in a few leaves is no balancing act. That extra space also lets the tea leaves bounce around like the inflatable guys outside a car dealership, exposing them to more heat and water, which releases more flavor. The firm material makes cleaning easy. Plus, the nifty lid acts as a landing pad, holding the strainer when you take it out of the tea with minimal mess. I keep one at home and at work, because now that I’ve started making tea with this strainer, I’d rather not do it any other way.Honestly, my favorite part of making tea with the strainer is the ritual of it all. Scooping in the leaves, removing the strainer and letting the liquid drip down, placing it in its little lid. Sure, it’s a *little* more work than a tea bag, but to me, it feels like a welcome, forced meditation—a couple minutes in the morning where I’m focused on my tea, and nothing else.Buy it: ForLife Brew-in-Mug Extra-Fine Tea Infuser with Lid, $24All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThe Low-Key Caffeinated Iced Tea I’m Drinking to Hold on to SummerBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-03", "author": ["Condé Nast", "Meryl Rothstein"]}