{"id": "59a9cc8b30c3d648299dc4b37cb61da9", "url": "https://www.bonappetit.com/recipe/shrimp-and-cabbage-curry", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Shrimp and Cabbage Curry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueShrimp and Cabbage CurryBy Devonn FrancisJanuary 1, 20214.3(70)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintA winter curry is a one-stop-shop for comfort and flavor. You can turn the heat level up or down based on your preference, but best not to skip the key accessories: lots of herbs and lime. Ready-made red curry pastes are available, but making your own paste allows you to perfectly calibrate the heat according to your taste. To make this dish vegetarian, skip the shrimp and add cubed pumpkin or squash instead. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servingsCurry paste1red bell pepper, ribs and seeds  removed, coarsely chopped2red Thai chiles or 1 small red Fresno chile, seeds removed if  desired, coarsely chopped1lemongrass stalk, bottom third only, tough outer layers removed, finely chopped4garlic cloves, smashed14\" piece ginger, peeled, finely  grated2Tbsp. smoked paprika2tsp. ground coriander1tsp. ground cumin1tsp. ground turmericKosher saltAssembly3Tbsp. (or more) virgin coconut oil½medium head of green cabbage, cut into 4 wedges through  root end113.5-oz. can unsweetened  coconut milkKosher salt1lb. large shrimp, shelled, deveined4scallions, chopped2tsp. finely grated lime zest2Tbsp. fresh lime juiceSmall handful of torn tender herbs (such as cilantro, basil, and/or  mint)Lime wedges (for serving)PreparationCurry pasteStep 1Blend red bell pepper, chiles, lemongrass, garlic, ginger, paprika, coriander, cumin, turmeric, and a couple of big pinches of salt in a blender until a smooth paste forms.AssemblyStep 2Heat oil in a large pot over medium-high. Cook cabbage until deeply browned on both cut sides, about  2 minutes per side. Transfer to a plate.Step 3If pot looks dry, add another 1 Tbsp. oil. Add curry paste to pot (still over medium-high heat) and cook, stirring often, until paste is slightly darkened in color and beginning to stick to bottom of pot, about 5 minutes. Pour coconut milk and 2 cups water into pot and reduce heat to medium; season with salt. Cook, scraping up any curry paste stuck to pot until flavors come together and curry is slightly thickened, 10–12 minutes.Step 4While the curry is cooking, coarsely chop cabbage.Step 5Season shrimp with salt and add to curry. Cook, stirring, until shrimp are just cooked through, about 3 minutes. Remove pot from heat; stir in cabbage, scallions, and lime zest and juice.Step 6Divide curry among bowls and top with herbs. Serve with lime wedges.How would you rate Shrimp and Cabbage Curry?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleWhy would this show up in a list of vegetarian dishes?BraxPortland7/29/2021I’ve made this twice now, once with shrimp and once with scallops, and I love it.  This last time I doubled the curry so I can use it again. I pretty much stuck to the recipe but bumped up the spices a bit. I’m not a huge cabbage fan so next time I will be using some other sautéed veggies. LJNElk Grove, CA2/21/2021This was good, though I'm not sure I achieved the right flavor of the sauce. I must not have trimmed the lemongrass properly as the sauce had a strong and bitter lemongrass flavor. I took the advice of cutting down the water to 1 cup. The prominence of smoked paprika here is curious, but kinda works. Next time, I would probably take suggestions of upping the coriander and cumin, cutting down the smoked paprika. Maybe subbing some garam masala?Area ManDenton, TX2/9/2021I pretty much followed the recipe.  Added more salt.  Added currants and peanuts.  Served over rice.\nOK but not memorable.  Probably won’t make again.SuzyQNorthport, MI2/1/2021USE MORE SALT FOLKS! I basically followed the recipe (though I eyeballed some of the spice amounts) and it turned out fanTAStic. Regarding some of the prev comments about it being bland - coconut milk (especially if you're buying the right kind: my fav is Chaokoh. A lot of American brands are really watery) can be strong and naturally sweet and needs a lot of salt to help the curry paste shine through. If it tastes bland, add more salt! Don't skip the lime at the end too, because both the salt and the acidity of the lime is needed to make the flavors come out. I think this would taste great with salmon instead of shrimp too. CorinneCalifornia1/26/2021USE MORE SALT FOLKS! I basically followed the recipe (though I eyeballed some of the spice amounts) and it turned out fanTAStic. Regarding some of the prev comments about it being bland - coconut milk (especially if you're buying the right kind: my fav is Chaokoh. A lot of American brands are really watery) can be strong and naturally sweet and needs a lot of salt to help the curry paste shine through. If it tastes bland, add more salt! Don't skip the lime at the end too, because both the salt and the acidity of the lime is needed to make the flavors come out. I think this would taste great with salmon instead of shrimp too. CorinneCalifornia1/26/2021This recipe was amazing. I didn’t have cabbage so I subbed for roasted cauliflower. The sauce was excellent. I didn’t add any water at all. I for sure will make againMay JuneSeattle,WA1/23/2021We really enjoyed this, and would make it again! Our only criticism was that the seasoning (in particular the paprika quantity) does seem somewhat aggressive - we would probably go a bit lighter on the spices in the curry paste next time. We used two jalapeños instead of the red chile since that’s what we had, and it was a great medium spice level. We thought this was the perfect consistency - not watery at all! We did use a can of coconut cream instead of coconut milk since that is what we had. I let it reduce about 20 min. We ate it just by itself! LeahBellingham, WA1/20/2021Per others, I made a number of changes to up the 'umph' of the curry sauce while also keeping the smoked paprika from upending the flavor profile. Here are my changes: 1) halved the 2c of water to 1c. 2) increased the cumin and coriander by 50%. 3) halved the smoked paprika. 4) used fish sauce wherever they called for salt. Even with halving the water, I still needed to keep an aggressive simmer to cook it down a bit before adding the shrimp. I also separated the scallion greens from the whites, and used the greens as a fresh garnish along with the herbs (basil) and lime wedges.Eric W.Durham, NC1/20/2021I appreciate the effort of making your own curry paste but this was very lackluster in flavor. I would definitely pan fry the shrimp with some garlic and add it on top once the curry is finished, or just sub shrimp for a more substantial and flavorful meat/fish to add more oomph to this dish. I cut the amount of smoked paprika because 1 Tbsp was surely enough (and too smoky for this dish) and 2 cups of water is ridiculous so I added just one cup. I had to cook the cabbage in the curry after sauteing it because it would not have been cooked through otherwise per the recipe instructions. I did not find lemongrass but doubt it would have made the dish substantially better. Would use curry powder instead of Smoked paprika if making this again.Anna S.Wayne, PA1/19/2021The. Cabbage. I loved the cabbage in this - so simple but such a tasty addition. The curry paste? I’m not sold if it was delicious enough to warrant the effort. Very paprika forward. Good, but probably in the essence of time I’d skip next time around to make it more work night friendly. And will hands down decrease the amount of water (significantly) next time. AlySeattle1/19/2021for the amount of time I spent making this recipe, I feel like a fool. Totally lacking in flavor, which is bizarre considering the ingredients. The \"curry paste\" was so overwhelmed by the smoked paprika...it was not a good combo. Only thing I liked was the cooked cabbage. the rest was so flavorless. I'm so disappointed \nAmy Arcata, CA1/18/2021It's fascinating to me that people either love or hate this recipe ...... add me to the hate column.  We ate it for the dinner I made it for and I threw the rest (which was a lot) in the trash. Boring and disagreeable.\nAnonymousNewport News Virginia1/15/2021This is so good! I made 0 changes and it came out great (I only added a splash of water to the paste because my blender couldn't blend properly haha. I didn't find it to be watery or diluted like other comments said. We served it with some jasmine rice and it was very filling. I'm actually gonna make it for the second time today!! This is probably my favorite recipe from the 2021 Feel Good Plan :-)Laura EChula Vista, CA1/13/2021I was very disappointed with this recipe. At first, it looked fairly simple but it took much longer than expected. I have been cooking for over 30 years, I'm a registered dietitian and have a cooking blog so I'm not a novice to following recipes. From the list of ingredients, I thought this would be intensely flavorful but I was so disappointed. I think the addition of the 2 cups of water diluted all of the flavors. I was planning on posting this recipe on my blog but will not be recommending it. JudyArdmore, PA1/13/2021Explore Bon AppétitRice and Grain BowlShrimpShellfishSeafoodCoconut MilkOther IngredientsGreen CabbageCabbageLeafy GreensVegetableEasyMainGluten-FreeDairy-FreeKetoHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}