{"id": "59af0116a00420b767ae68eb1162c638", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/nunotsunesarashina", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Nunotsunesarashina Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoNunotsunesarashinaBy-the-books soba in a fittingly classic environment.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for a bowl of soba. To add the words old-fashioned or traditional would be redundant—because whereas ramen exists in a world of infinite variation, soba only ever dreams of being soba. And in that regard, Nunotsunesarashina is strictly by the books. The noodles are always fresh, and the dashi is always dense with umami. This is a shop where you get what you came for and expectations are exactly met. Though when the standards being measured against are as high as they are for soba in Japan, getting what you expect is a very good position to be in.ORDER THE: kamo-nanban soba for a bowl of hot soup and noodles topped with charred green onions and slices of duck. One special touch of this shop is that they give you a choice of thick or thin slices of meat, but the only right answer is thick. A bit of yuzu adds fragrance, and a dusting of sansho pepper gives the bowl spice and complexity.THE VIBE IS: classic, much like the food itself. The shop is dark and understated, a place for old men to eat lunch. Here, the long continuity of soba is, not just alive but thriving.PRACTICAL STUFF: Open Monday to Friday from 11 a.m. to 3 p.m. for lunch and 5 p.m. to 8 p.m. for dinner. Open Saturday from 11 a.m. to 3 p.m. Closed on Sunday. The nearest subway stations are Tsukiji and Tsukijishijo.Photo by Xavier Girard LachaîneThe shop decor is as classic as the noodles themselves.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}