{"id": "59b067a4537ae60442fbe433d261cbd9", "url": "https://www.bonappetit.com/story/valeria-taylor-chicago", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Valeria Taylor's Chicago Travel Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatValeria Taylor’s Guide to ChicagoThe pastry chef breezes through the city’s best bakeries, breweries, and hot dogs.By Valeria Taylor, as told to Angela BurkeJuly 14, 2021FacebookTwitterEmailPhoto courtesy Marz Community Brewing CoFacebookTwitterEmailYes, there is a hot dog rec on this Chicago guide from Valeria Taylor, the pastry chef and owner of Loba Pastry + Coffee. But there’s also the most charming coffee shop, a pop-up within a brewery that’s worth lingering in a little longer, and creative neighborhoods to wander and walk it all off. Looks like you’ll be heading to the Windy City very soon.Check out more food-focused itineraries from our favorite food people here.A pile of hot dogs and fries at Gene & Jude’sPhoto by Nick Holmes, @nickdoesfoodInside Four Letter WordPhoto by Nathan Michael ChicagoChicago is known as the city of neighborhoods—let that be your guide when visiting, even if only for a day. Start in Logan Square at one of my favorite bakeries, Pan Artesanal. It’s a mix of old-school Mexican and new-school American pastries and full of creative flow. The menu is constantly changing and they sell out quickly, so get there early!Then savor your morning cup at Four Letter Word, a beautifully designed but cozy café. I like to begin with an espresso, then take a drip coffee to-go.For lunch, hop over to West Town’s All Together Now. I usually grab a sandwich or salad, but it’s also perfect for filling a basket with artisanal cheeses, snacks, and wine to enjoy at one of the city’s beautiful parks.In McKinley Park, Marz Community Brewing Co. has more than 20 beers on tap and serves some of Chicago’s best beer, but stay for the food: Chefs Randi Howry and Kelly Ijichi run Mom’s, a Japanese-inspired concept. My favorite dishes are the doughnuts (Sundays only!), the katsu sando, and the fried Spam musubi—it’s all so good!A few miles north in Pilsen, you’ll find the perfect mix of art, music, and food. Be sure to check out the murals on 16th and 18th Streets and Semillas Plant Studio for the cutest plants (my pandemic hobby!), pots, and other locally-made curiosities.Just beyond city limits, in River Grove, sits the classic late-night hot dog stand, Gene & Jude’s. There you’ll find a snappy Vienna Beef hot dog, stacked with sport peppers, relish, onions, mustard, and tons of fresh-cut fries. Gene & Jude’s also offers another Chicago staple: tamales. Chicago-style “tamales” aren’t anything like the tamales that I grew up eating in Mexico. They’re similar to steamed polenta filled with what reminds me of an Indian curry. The first time that I had one I was in disbelief. But after living in Chicago for 10 years, I can accept that this dish is called tamale. It’s a thing of its own and it’s delicious.WHERE TO STAY:The Robey, in Wicker Park, for spectacular skyline viewsWHAT TO BRING BACK: A jar of giardiniera from West Town’s Bari Subs and Italian FoodsExplore Bon AppétitRestaurantsTravelChicagoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Valeria Taylor", "As Told To Angela Burke"]}