{"id": "59b4d90fd4b080b42d9d843e47a16cf2", "url": "https://www.bonappetit.com/recipe/chocolate-almond-fridge-fudge", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Chocolate-Almond Fudge Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChocolate-Almond Fridge FudgeBy Chris MoroccoJuly 23, 20194.3(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe key to a firmly set but fudgy texture is using bittersweet chocolate with minimum 60% cacao. Lower percentages will result in fudge with a scoopable ganache-like texture. There's also a secret ingredient that helps replace the dairy in this vegan, fudgelike treat. Just kidding; it's not a secret...it's avocado!Ingredients8 servings¼cup sliced almonds4oz. vegan bittersweet chocolate (must be at least 60% cacao in order for the fudge to set properly), broken or chopped into small pieces if neededNonstick vegetable oil spray½ripe avocado⅓cup pure maple syrup⅓cup almond butter1Tbsp. cocoa powder, preferably Dutch-processed¾tsp. kosher saltFlaky sea saltPreparationStep 1Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing halfway through, until golden brown, about 5 minutes. Let cool, then coarsely crush. Set aside.Step 2Meanwhile, place chocolate in a small glass or ceramic bowl and microwave in 20-second bursts, stirring well between each, until melted and smooth, 1–1½ minutes. Let cool slightly.Step 3Spray a 9x5\" loaf pan with nonstick spray. Line with parchment paper or plastic wrap, leaving plenty of overhang on 2 sides (the spray will help it stick to the pan and cooperate more).Step 4Purée avocado, maple syrup, and almond butter in a food processor until very smooth, about 1 minute. Add cocoa powder, kosher salt, and 2 Tbsp. cold water. Pulse until smooth, then add melted chocolate. Pulse just until combined, scraping down sides of bowl as needed.Step 5Transfer chocolate mixture to prepared pan and smooth top. Scatter reserved almonds over, then season with sea salt; press in lightly. Chill until firm, about 1 hour. Remove by lifting up parchment, then cut into squares or bars to serve.Step 6Do Ahead: Fudge can be made 1 week ahead. Keep chilled.How would you rate Chocolate-Almond Fridge Fudge?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangledefinitely a good replacement for regular fudge. It nails the texture and the chocolatey flavor. Not as sweet as other recipes I've made, so it depends on how much of a sweet-tooth you havemercyPittsburgh, Allegheny, Pennsylvania, USA8/6/2021ok LOVEDDD this. I used 67% cacao chocolate which I think may have led to the fudge being extra gooey so that it was more like eating play-dough than fudge, but tbh I didn't mind that. It tastes SO good and the whole-food ingredients made me feel lighter than a normal dessert after eating (at least as a placebo lol). In the morning I put a big chunk on my oatmeal with some berries which was heavenly. AmandoBrooklyn, NY6/22/2021Great recipe! \n\nFirst time trying it, here are my thoughts;\n\nI used a perfectly ripe avocado and neither my wife or I tasted any avocado.\n\nI used 71% chocolate, and let the fudge chill in the freezer for an hour before cutting. If overly handled, it can turn into a mess, but holds its own nicely after being cut (I’m currently keeping it in the fridge).\n\nI subbed out the almond for pistachios, which I quickly burned in the oven, so tossed them- the added crunch would have been a nice textural component, but my wife (who thinks mixing nuts with chocolate is sacrilegious) says they aren’t missed.\n\nA nice flake salt on top really brings this recipe together.\n\nThe fudge has a great bite to it, is extremely rich (I mean, it IS fudge, after all) which may also be a result of 71% chocolate.\n\nAll in all, I will probably make this recipe again (as it’s super simple, I didn’t even use a food processor for the first step, just a whisk and elbow grease), but next time I will likely add crushed pistachios for a textural element, as well as use some milk chocolate to experience by with a ganache-like consistency.Alex PikeNew Jersey11/14/2020Loved this. Used a small Florida avocado, natural peanut butter, and 60% cacao bittersweet chips. Set up a little softer than other fudge recipes, but still able to cut it. Absolutely no avocado taste whatsoever. AnonymousOrlando, Florida 9/27/2020Loved this! So easy to make too! I followed the suggestion of reviewer below and omitted salt since the nut butter I used (peanut; didn’t have almond butter on hand) was salted.\n\nUsed a 75% cocoa bar, and found that it needed a Tbsp more of honey. I was wary of making this with butter fruit (locally grown Indian variation of Haas avocado) but it worked 🙌🏼 And there’s no taste of the avocado either, like you can’t make it out, which is a win for me. AnonymousIndia6/30/2020Loved this! I used 70% cocoa chocolate, and this set to the perfect fudgy texture. Skipped out on the almonds on top, used cacao powder instead of cocoa, and left out the salt in the mixture as my almond butter was already salted. Flaky salt on top is a must, though!AnonymousAustralia3/2/2020Mine set up just fine using 70% cocoa chips.  Although the recipe's intent is to be a healthier version, I just found this to be too \"avocado-y\".   The sweetness level was fine using the syrup but seriously, how much more \"healthy\" is maple syrup over sugar?  Yes, lower on the glycemic index but still not great for you.AnonymousDallas, TX1/27/2020I used 85% cocoa chocolate, which gave it a very firm texture (akin to real fudge). But this also gives it a very 'healthy-ish' flavour profile since it's not super sweet. I like it, but I think using a significantly higher cocoa content than the suggested 60% is needed to get it to set.AnonymousNew York1/25/2020Yes, the fudge is extremely sticky but it makes the texture great. It's still easy to cut and definitely has integrity. I stuck mine in the freezer for an hour and it was long enough to cut properly, then I stored it in the fridge. Next time I might sub out toasted almonds for a classic walnut or pistachio. A great twist would be dried apricot pieces on top! Make this fudge tonight and use up that avocado you probably won't eat tomorrow. Thanks, Chris! AnonymousSeattle, Washington1/17/2020Very soft (used 60% chocolate, perhaps I should have gone higher). Biggest issue was that it tastes like avocado..which shouldn't be entirely unexpected, I guess. It's ok but not great.AnonymousBoulder, CO1/17/2020Totally delicious! However, it never set hard enough to cut, even after being the in the refrigerator for a few hours. Instead, I scooped, rolled into balls, then dusted/rolled around in cocoa powder and made like a truffle. They are in the freezer at the moment. We'll see how long they stick around. AnonymousCalifornia9/23/2019This was insanely good! Found milk free chocolate and made it for my vegan brother and he inhaled it all in less than an hour. The slight almond taste was really nice and it wasn't overly sweet. I put mine in the freezer since it wasn't setting well in the fridge and that did the trick. Definitely making this again!AnonymousNorth Carolina8/19/2019Mine did not set up either. Even after being in the freezer it is still soft. I agree with the other reviewer who had the same problem about flavor and texture. I would love to figure it out too so that it set properly!\nAnonymousMontana8/8/2019Mine set up fine! It's very tasty but does have a slight vegetal note if you focus hard. May be my fault; my avocado was slightly underripe. Anonymous8/4/2019This recipe comes out delicious BUT entirely too soft and sticky. I had mine in the fridge for two hours, was too sticky to cut so moved to the freezer for an hour and it was still a little soft. While not firm enough to handle, the texture is otherwise great, really smooth and fudgey when icy cold and the flavour is super satisfying. Would love to figure out how to keep this solid at fridge temperatures because it's really delicious.t1na8/3/2019Explore Bon AppétitDessertChocolateOther IngredientsAlmondNutEasySnackDairy-FreeGluten-FreeVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Chris Morocco"]}