{"id": "59b99b024dd55d9fa3aa47e139e0cfc6", "url": "https://www.bonappetit.com/recipe/roast-chicken-with-bell-peppers-lemon-and-thyme", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Roast Chicken with Bell Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueRoast Chicken with Bell Peppers, Lemon, and ThymeBy Claire SaffitzAugust 14, 20184.4(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintHow to pull off a weeknight roast chicken: Set it over a bed of peppers for a two-for-one deal.Ingredients4 servings 4large bell peppers (any color)1large shallot, thinly sliced1Fresno chile, thinly sliced crosswise5sprigs thyme, dividedKosher salt, freshly ground pepper¼cup plus 1 Tbsp. extra-virgin olive oil13½–4-lb. chicken, patted dry1lemon, halvedPreparationStep 1Place a rack in middle of oven; preheat to 425°. Heat a large ovenproof skillet, preferably cast iron, over medium-high. Cook bell peppers in skillet, turning every minute or two, until blistered in several spots, about 5 minutes. (You aren’t trying to cook them, just get some color on them.) Transfer bell peppers to a cutting board and let cool slightly; reserve skillet. Stand a pepper upright and slice off sides, working your way around stem in 3 or 4 cuts. Pull out ribs and seeds; discard along with stems. Repeat with remaining peppers.Step 2Return peppers to skillet and add shallot, chile, and 3 thyme sprigs. Season generously with salt and black pepper and drizzle ¼ cup oil over. Season chicken all over with salt and black pepper and set on top of peppers. Place a lemon half and remaining\n2 thyme sprigs in chicken cavity and rub skin all over with remaining 1 Tbsp. oil. Roast in oven until skin is golden brown and crisp all over and an instant-read thermometer inserted into the thickest part of breast registers 160°, 60–80 minutes. Remove from oven (be careful; handle is hot!) and let rest 15 minutes before transferring chicken to a cutting board and carving.Step 3Just before serving, squeeze remaining lemon half over chicken and bell peppers.How would you rate Roast Chicken with Bell Peppers, Lemon, and Thyme?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleYes to the earlier comment on “gahlic”, but this works incredibly well. Other spices to consider on the outside would be a good smoked paprika, or maybe some cumin and turmeric. dwilkinsboise2581Boise9/18/2020Make this at least once a month. One of my fave recipes in the last few years from BA!AnonymousBrooklyn12/9/2019I make a recipe which is very similar to this, only thing missing in my opinion, is some garlic cloves. Great idea to add a jalepeno pepper to the mix!AnonymousOrange county, Ca9/23/2018Easy delicious weeknight dinner.  Use a kitchen torch to char the peppers, rather than the skillet method: better char, less time.  Leftover chicken and peppers make a great sandwich.  \nstanmPhiladelphia 8/27/2018Explore Bon AppétitAmericanBell PepperVegetableChickenPoultryFresno ChileChileWeeknight MealsEasyMainDairy-FreeGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}