{"id": "59be6339502e68fcd222ca463387f0e4", "url": "https://www.bonappetit.com/story/sour-soups", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "You Should Absolutely Be Adding Pickle Brine to Your Soups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Absolutely Be Adding Pickle Brine to Your SoupWake up, soup!By Heather EddyDecember 4, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.There are good friends, and then there are friends who give you soup. Soup friends are besties with the wisdom of babcis (Polish grandmothers)—they know that no matter what’s troubling you, a nice bowl of soup will make everything better. And it's a bonus when that soup also happens to be their babci's recipe.My friend Holly gifted me a jar of her famous Polish pickle soup, a recipe handed down by her grandma Helen. Rich, porky broth electroshocked with garlicky brine, it was a revelation, a study in contrasts with mouthfuls of shredded Polish dills melting into creamy pearl barley with a satisfying bite. The puckery zing of the pickles brought what might otherwise be a stodgy soup to life and got me thinking about the strong tradition of sour soups in Eastern European cuisine.My Polish grandma used to make a cabbage soup called kapusta that filled the house with heady funk and was tangy with fresh sauerkraut and earthy with the musk of borowik, dried boletus mushrooms. The complex sweet-sour-salty broth of pink borscht is traditionally built on kvass, a base of fermented beets. The white version is made by fermenting the crusts of rye bread. In the spring, my family would pick sorrel, eating handfuls of the citrusy leaves raw before whizzing the rest of our haul into a neon green tonic. These soups are as much a lesson in thrift, turning nothing—some picked-over bones, veggie scraps, stale bread—into something, as they are in balance. As it turns out, many other recipes in the soup season repertoire can benefit from a pickleback.To follow in the tradition of our babcis and experiment with briny, tangy, sour soups yourself, start by substituting between ⅛ and ¼ of the liquid in your soup base with pickle juice. Brines can pack a salty punch; taste yours first and proceed cautiously. You can always add more. Or, if you’d prefer a more subtle approach, try tossing in a handful or two of chopped or shredded pickles instead, for little bursts of brightness. But if you’re like me and have vinegar running through your veins, go big and add both!Traditionalists might recoil in horror, but why not add a few splashes of pickle juice to a nice, steaming bowl of matzo ball soup, doubling down on the big dill energy. Chopped gherkins would bring some welcome zest to anything with rich, umami depth, like a hearty mushroom soup. And there’s no need to stick to dill—consider adding a splash of japleño pickle brine to add just a touch of mild heat to brothy, light tomato soups, or Italian giardiniera-style pickles to pasta-loaded meatball soups, or even slightly sweet bread-and-butter brine to summery gazpacho to inch it towards a Bloody Mary. Just stay away from any soups with dairy to avoid a curdled disappointment.Techniques like this never seem to get written down. They’re passed along as one generation stands next to another at the stove. Their origins are debated with family members, the ingredients discerned through the power of taste memories. And sometimes, soup is simply placed in our hands by those who love us with no further explanation needed. For any soup recipe that needs a punch of zippy brightness to wake it up, turn to pickles—then share a bowl with others to join the ranks of the esteemed soup friend.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-04", "author": ["Condé Nast", "Heather Eddy"]}