{"id": "59cc8aee8dea8cd6e1e31bd754cad78f", "url": "https://www.bonappetit.com/recipe/chicken-with-lemon-and-spicy-spring-onions", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Chicken with Lemon and Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueChicken with Lemon and Spicy Spring OnionsBy Alison RomanApril 16, 20194.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintRoasting two chickens on one baking sheet is an effortless but strategic way to cook for a crowd. As the fat renders, it bastes the vegetables for a built-in side dish.Ingredients6–8 servings1lemon23½–4-lb. chickensKosher salt, freshly ground pepper2large red onions, quartered2bunches spring onions or 3 bunches scallions, trimmed, divided4green garlic bulbs, very finely chopped, or 4 garlic cloves, finely grated½cup extra-virgin olive oil½cup (1 stick) unsalted butter6–81\"-thick slices crusty bread¼cup parsley leaves with tender stemsCrushed red pepper flakes (for serving)PreparationStep 1Preheat oven to 350°. Very thinly slice 1 lemon; tease out seeds. Place chickens on a rimmed baking sheet; season outsides and insides all over with salt and black pepper. Scatter red onions, three-quarters of spring onions, and half of lemon slices around.Step 2Cook green garlic, oil, and butter in a small saucepan over medium heat, swirling occasionally, until butter melts and garlic starts to lightly sizzle; season with salt and black pepper. Pour over chickens, letting some of the mixture drip onto onions and lemon.Step 3Roast chickens, tossing onions and lemon and basting chickens with drippings in baking sheet occasionally, until chickens are golden brown all over, an instant-read thermometer inserted into the thickest part of the breast registers 160°, and onions and lemon are softened and starting to brown, 80 minutes–2 hours.Step 4Remove baking sheet from oven and transfer chickens to a cutting board, leaving onions and lemon behind. Place bread slices on baking sheet and turn once to coat in chicken fat. Return baking sheet with bread and vegetables to oven and roast until vegetables are starting to sizzle and crisp and bread is toasted, 10–15 minutes.Step 5Meanwhile, thinly slice remaining spring onions and toss in a medium bowl with parsley and remaining lemon slices. Season with salt, black pepper, and enough red pepper flakes to achieve your desired level of spiciness.Step 6Carve chickens and transfer to a large shallow bowl or platter (or serve right on the cutting board). Pour any remaining juices on baking sheet over chicken and scatter roasted onions and lemon slices around, followed by raw spring onion mixture. Slice each toast into a few pieces and serve alongside.How would you rate Chicken with Lemon and Spicy Spring Onions?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMade this tonight for a party of 5. Rave reviews from everyone, even my picky husband! Chicken was so juicy and flavorful. I doubled the garlic and butter. 100% will make this again. Our guests were asking for the recipe. LornoBuffalo NY12/23/2021SO good - only change i made was that I used one chicken instead of two and kept everything else the same, so it was extra juicy! AnonymousWashington, D.C.5/19/2020The chicken in this recipe is absolutely fabulous and delicious. My biggest complaint is that the vegetables burnt to a crisp and were completely charred by the time the cooking was done. The lemons had practically disintegrated. If I make this again, I would probably add the vegetables about half way through, or make a separate roasting pan of veggies to accompany as a side dish for the meal. danimalcrackersChicago4/24/2020Have never been a huge fan of parsley (perhaps due to years of avoiding the saltwater-soaked type during Passover seder), but this recipe made me do a total 180! Made it for a dinner party recently and have zero complaints. For simplicity I substituted the 2 chickens with ~4lbs of boneless thighs. Same cook time (90min). Also skipped the green garlic for the ol' regular type and it turned out perfectly. Only note- like @abbyr mentioned, would definitely at least double up on the parsley/lemon/onion mix depending on how much meat you're cooking.rosie_rosieLos Angeles, CA1/13/2020I made this for my family for mother's day and it was a hit. My biggest note is that you should almost certainly triple the amount of the parsley/lemon/onion condiment you make. It really made the meal and there wasn't nearly enough to go around. Also, the portion sizes are a little wild. I made it for 7 people, and served it with rice pilaf. We didn't even cut into the second chicken. Granted, my birds were around 4.5 lbs each because that was what they had at the store, but if you make this, expect a ton of leftovers. AbbyRAlabama5/17/2019This sounds delicious! However, I'm wondering about the ”green garlic.” What is it compared to the fresh garlic I use all the time? Can my regular garlic be used instead?cmjross4/29/2019Explore Bon AppétitChickenPoultryScallionOnionVegetableGarlicSpring OnionSpringSheet-Pan DinnersMainDairy-FreeGluten-FreeNut-FreeHealthyishRoastEasterPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alison Roman"]}