{"id": "59dba6a1ea48e85eb6378887fbc4f2c7", "url": "https://www.bonappetit.com/story/weleda-salt-toothpaste", "year": 2018.0, "month": 6.0, "day": 5.0, "content": "Weleda Salt Toothpaste Makes My Teeth Feel Super Clean | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Salty Toothpaste That Makes My Teeth Feel Super CleanSenior food editor Andy Baraghani swears by this natural toothpaste.By Andy BaraghaniJune 29, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, senior food editor Andy Baraghani shares his favorite feel-good tip on our Instagram Story series ‘30 Healthyish Seconds with Andy’. And you guys dig it. So we’ll be translating some of our favorite segments into articles. First up, the Weleda salty toothpaste that Baraghani swears by.I first discovered Weleda Salt Toothpaste four years ago by stealing it from my roommate at the time. (Sorry Katherine.) I’ve always used a natural toothpaste of some sort, but when Katherine would talk about how no other toothpaste made her teeth feel so clean, I knew I needed to try it. I eventually “borrowed” it enough times that I invested in my very own tube on Amazon. I’ve been buying it ever since.The first thing to get out of the way is that this is definitely a salt-forward toothpaste. The sea salt essentially exfoliates your teeth—but not in an aggressive way that ruins your enamel or anything. The texture really does leave your teeth feeling super clean, and stripped of any residue from the day. Since it’s somewhat abrasive I use it with a dry soft-medium bristle toothbrush. With past toothpastes that I’ve used, the just-brushed feeling disappears after 10 minutes, but the Weleda toothpaste really does linger and makes my teeth feel super clean and glossy throughout the day.Also the fact that it’s a natural toothpaste is important to me. There are no synthetic sweeteners, preservatives, or colorants. Yes, it’s an ugly pink-ish brown, but you’ll get over that. Essentially, the toothpaste gets the same job done as a mainstream one, but without all the hard-to-pronounce chemicals. As their website says, “Weleda formulated this toothpaste to let saliva’s enzymes do their natural work, gently flushing your whole mouth clean. Fine extracts of ratanhia root, myrrh, and chestnut bark help to tone gums, while gently abrasive particles clean the teeth. The zesty, salty taste is further freshened with essential oil of peppermint for tingly-fresh tooth-cleaning without fluorides.”One thing to note is that it does contain lactose, so it’s not vegan-friendly. It also doesn’t foam, which can bother some people, but I actually prefer it that way. (It means there are no foaming agents or detergents, which I don’t want in my mouth anyway.) And since it’s SO concentrated, you really don’t need that much. My tube lasts me about two or three months. Well worth the $12 I spend on a pack of two on Amazon.Here’s the thing: Weleda Salt Toothpaste is so minty and exfoliating that I actually look forward to giving my teeth a scrub down at the beginning and end of each day. It also makes me want to make out with the entire city. But we can talk about that a different time.BUY IT: Weleda Salt Toothpaste, 2.5-Fluid Ounce (Pack of 2), $12 on AmazonAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish30 Seconds With AndyRead MoreLifestyleThe 7 Supplements That Healthyish Staffers Swear ByGallery7 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-29", "author": ["Condé Nast", "Andy Baraghani"]}