{"id": "59e0afdeb62298d4bdc9f5bd3a0f3771", "url": "https://www.bonappetit.com/story/scent-pantry", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "The Best Candles, Sprays, and Incense to Lift Your Mood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle7 Candles, Incenses, and Sprays for an Instant Mood Boost Stuck inside all day? Change up the vibe with scent.By Aliza Abarbanel and The Healthyish TeamJanuary 25, 2021FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This article is part of Healthyish at Home, our expert-sourced guide to making our living spaces feel great. Incense isn’t just essential for clearing the air of last night’s salmon. “Especially if we’re not leaving home much, you can create different emotional and psychological environments by using scent,” says neuroscientist Rachel Herz, Ph.D., author of Scent of Desire and researcher on the psychological science of smell.Smell and emotional memory have a fundamental neurological link, making it possible (but not guaranteed) to change your mood with a whiff of freshly baked cookies. But there’s a catch: Our brains quickly acclimate to scents—15 minutes, max—so a single candle will only go so far.“My recommendation is to have a bunch of different scents to create emotional atmospheres and transport yourself somewhere else,” Herz says. When stocking your scent library, consider personal significance. Scents linked to memory, like a flower you grew up smelling or a perfume worn on a special vacation, are especially emotionally potent.If you’re starting fresh, Herz recommends practicing some form of mindfulness technique to cultivate a positive mental state while focusing on the scent. “If you take a novel scent that you don’t have an association to and smell it in the context of ‘I’m in lockdown,’ it could take on a negative meaning,” says Herz. “It’s a cautionary tale for not using the same scent too much, but rather having a collection.”Need some inspiration? These are the candles, incense, and sprays in our scent pantry:I light one of these quince candles when I’m trying to get out of a design rut—or after my roommate exercises in the living room. Unlike most scents, it doesn’t trigger my migraines, and one lit candle fills a large space faster than my fancy routers spread Wi-Fi. –Christa Guerra, art director.Photograph by Laura MurraySeda France Japanese Quince Candle$35 at Coming SoonI use Studio Cue’s deodorizing and antimicrobial Hiba Wood Atmosphere Mist to freshen up bed linens and anywhere else my dog has decided to lounge. Hiba is a type of cypress tree closely related to the hinoki wood of Commes des Garçons fame, and it smells like you’re walking through a Japanese forest. –MacKenzie Chung Fegan, commerce writerPhotograph by Laura MurrayHiba Wood Pillow Spray$18 at East ForkI tend to switch between breu resin and palo santo incense from Incausa, which partners with Indigenous artisans in the Amazon basin to sustainably hand-harvest materials. These days it’s a nightly ritual to provide some calm while still working from home. –Andy Baraghani, senior food editorPhotograph by Laura MurrayIncausa Breu Resin Incense Blends$19 at IncausaFig and vetiver promotes a good creative flow, landing somewhere between warm desert evening and aspirational design atelier. When it’s burnt out, the ceramic vessel reincarnates as a planter, complete with a drainage hole at the bottom. –Miriam Ross, associate art directorPhotograph by Laura MurrayPaddywax Wild Fig + Vetiver Form Candle$32 at PaddywaxUnlike floral or even most woodsy sprays, this one has a distinctly exuberant and crisp smell: fresh linen, lemons, and paper with a sharp burst of wintry pine. I use the atmosphere mist in my bedroom and kitchen, especially in the morning. We could all use a renewing and soothing pine-needle scent to start our quarantine work days. –Allie Wist, visuals editorPhotograph by Laura MurrayHinoki Atmosphere Mist$46 at Te Plus TeI'm loyal to Shoyeido’s tea leaves incense. The scent is light and green and clean with a touch of sandalwood, but it doesn’t remind me of falling asleep in church or being seduced by a cult leader. I have a different set of incense for that. –Alex Beggs, senior staff writerPhotograph by Laura MurrayShoyeido Tea Leaves Incense$6 at AmazonMy current favorite nighttime routine is to burn this hand-poured soy candle for half an hour or so as I read before bed. The earthy and grounding aroma of cedar, jasmine, and fig reminds me to take a few big deep breaths before lights out. –Christina Chaey, associate editorPhotograph by Laura MurrayRikumo Five Elements Earth Candle$40 at RikumoExplore Bon AppétitHealthyishHealthyish HomeTrendsRead MoreLifestyleHealthyish at Home: 7 Ways to Make Your Space Feel GreatBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Aliza Abarbanel", "The Healthyish Team"]}