{"id": "59e36a0645427fa2e22a7bd2c7a150d0", "url": "https://www.bonappetit.com/story/aarke-sparkling-water-machine", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "This Sleek Sparkling Water Machine Helps Me Hydrate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Sleek Sparkling Water Machine Makes Hydrating a DelightTiny bubbles everywhere!By Cristina MartinezSeptember 18, 2020FacebookTwitterEmailPhoto COURTESY OF AARKEFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I hate flat water. It’s boring. Oh, sure, it comes in handy after a long morning run, but how often is that? I much prefer bubbles. Bubbles are extra. They make everything more fabulous, from sweltering forest baths to I’ll Be Gone in the Dark marathons. Hydrating becomes a delight rather than a chore.The problem is that I don’t live by a naturally effervescent spring. I hear there’s one in Colorado or Utah, but that’s too far for me. I know, I know, sparkling water is sold in grocery stores—but in disposable plastic! I may as well fly to Utah for all the good I’m doing the planet. A dandy friend I know has it delivered to his door in a wooden crate once a week. Very posh, but above my pay grade. Then I learned about these machines that make sparkling water for you right in the comfort of your own home! Well, hello! Unfortunately most of those machines are also made of plastic and take up way too much real estate on my minuscule New York City kitchen counter! I thought I was damned to choose the lesser of these evils—until I came across the Aarke Sparkling Water Maker.Leave it to the Swedes to design a practical yet beautiful solution to my conundrum. Maybe that’s what happens when you get free health care and free education and the government actually pays you to have babies—and then pays you to stay home to take care of those babies! Everyone is happy, well rested, and has the mental space to think about improving our lives and answering big questions like: How do I get bubbly water without having to go to Utah?The Aarke produces 60 liters of perfect bubbly water from one CO2 canister. That’s 30 two-liter plastic bottles I didn’t add to that insane ocean flotilla we “accidentally” created in the Pacific. Now I can drink all the sparkling water I want with one less care in the world. Just add ice and vodka. Enjoy.Photo courtesy of NordstromAarke Sparkling Water Maker$249 $164 at Nordstrom$219 $164 at AmazonExplore Bon AppétitHighly RecommendShoppingRead MorecookingSummer’s Last Hurrah Calls For Fruit in All Your CocktailsBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-18", "author": ["Condé Nast", "Cristina Martinez"]}