{"id": "5a098557729c0362318196cd46d29e30", "url": "https://www.bonappetit.com/story/instant-pot-butternut-squash", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "How to Cook Butternut Squash in the Instant Pot—and Other Huge Things You Don't Want to Cut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Most Underrated Instant Pot FeatureBuy all of those knobby, unwieldy vegetables that have intimidated you in the past. Your Instant Pot can put them in their place.By Sarah JampelFebruary 22, 2018FacebookTwitterEmailFacebookTwitterEmailSome may wonder—some have wondered, aloud and to my face—what a vegetarian like me does with an Instant Pot.And to that question, I answer: How else can you cook an entire kabocha squash—no cutting, peeling, or deseeding—in 20 minutes? (My next answer: Have you tried these magically creamy pressure cooker beans? My third—but not final—answer: I steam-cook eggs.)Ready to become an Instant Pot convert?Sure, the Instant Pot has proven itself most helpful for tenderizing tough cuts of meat or zooming through low-and-slow braises (like coq au vin) in record time. But the most underrated feature—and a huge helping-hand to vegetarians during the winter doldrums—is that your Instant Pot can turn an intimidating squash, root, or tuber from rock-solid to approachable and sliceable. And it does it in a whooooole lot less time than it’d take to roast that same sweet potato, turnip, or—heaven help you—spaghetti squash in the oven (on a weeknight, the gods forbid it!).Once the vegetables are even partially cooked, they’re easier to cut, scoop, and, if applicable, deseed. That means that all of those hairy, gnarly things (some may call them “vegetables”) that you run away from at the market—rutabaga, kohlrabi, celeriac, you know the type!—are also worthy candidates. And bring on the beets, those dreadful taproots that always, always, always take 30 to 40 minutes longer to cook through than I’ve allotted for. Cauliflower, too.The Instant Pot can—and will—defeat you.\nHere’s how you’ll do it: Scrub the outside of your vegetable, pour a little water in the base (so that it will steam), then squeeze the veg into the IP, resting it on the steaming rack that came with it, and cook on high for 6 to 15 minutes, depending on your specimen’s size. (If you’ve got a mammoth squash that’s too big to fit into a six-quart Instant Pot as one piece, remove its stem and cut it in half.) You won’t be sure exactly how long it will take your vegetable to cook through, so start with a cautious estimate, then do a quick-release, prod it with a fork, and reassess. For sweet potatoes that are on the small side, I start with 6 minutes. For a big butternut, I go for 9.If you’re planning to blend said vegetable into a soup or blitzing into a purée, you can pressure-cook it to the point of mush. But if you’re going to roast, sear, grill, sauté, cube, or slice, or stuff it, you’ll want to remove the vegetable when it’s still-firm but much easier—and safer—to slice through.When life gives you Instant Pot squash, make this quick soup.\nPhoto by Alex LauI was in disbelief when my hefty kabocha squash came out of the Instant Pot fully cooked after 12 minutes. I let it cool for 10-ish minutes (a.k.a. my patience threshold) before I sliced it open, removed the seeds, and put it to use in this One-Skillet Squash with Spiced Chickpeas. I wish I could say I did something productive with the 45 minutes I shaved off my prep time (take that, oven-roasting), but I think I just gazed at my Instant Pot, love in my eyes.Ready to try it for yourself?One-Skillet Roasted Butternut Squash with Spiced ChickpeasStop struggling to peel and slice squash. Just roast it whole, tear up the flesh, then sear it off.View RecipeExplore Bon AppétitVegetableRoot VegetablesInstant PotRead MorecultureWhat's the Difference Between a Sweet Potato and a Yam?By Alyse WhitneycookingThis Roasted Squash Recipe Is the Ultimate Vegetarian MainBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Sarah Jampel"]}