{"id": "5a194999358672cefcd26ed811b15618", "url": "https://www.bonappetit.com/story/honey-mama-chocolate-bars", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Fudge Fans, Honey Mama's Chocolate Truffle Bars Are For You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingFudge Fans, Honey Mama’s Chocolate Truffle Bars Are for YouAn ode to the sweet, squishy side of life.By Ali FrancisMarch 15, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Chocolate calls to me everywhere. I hoard gas station Twix. In my small town grocery store, blocks of a large square 58% cocoa number that costs eight literal dollars follow me home in droves. Foreign airports are my favorite; the blind roulette of surprise waits behind shiny wrappers. What is it? A brown brick of delight, that’s what. There is only one thing that deters me: cold straight-from-the-fridge chocolate. It’s chalky, firm, and uninviting. One clench of the molars and the whole thing breaks apart like a hunk of dense clay. The best chocolate is fudge-like, so soft it almost melts on the tongue. For that kind of pliability, you either need to leave your squares on the coffee table through a full episode of Euphoria, or you can buy a variety pack of Honey Mama’s Cocoa Truffle Bars.Photograph by Isa Zapata.  Food Styling by Thu BuserChocolate Truffle Bars$30 at Honey Mama's (Small Bar Variety Pack)$54 at Honey Mama's (Large Bar Variety Pack)Made from a core triumvirate of tasty ingredients—cocoa, raw honey, and unrefined coconut oil—they’re a textural masterpiece. These truffle bars are rich and buttery; every bite is like the middle piece of a brownie batch. They’re also a little chewy, which I expect we can thank drippy-drizzly honey for. Straight from the fridge (which is where you should keep them, lest they actually do melt), a fingernail can be driven into them with barely a shred of resistance. Honey Mama’s are always ready to be eaten, and I love them for this.The flavors are dynamic, which is why you need the variety pack. Some are laced with desiccated coconut, sprouted almonds, or coffee grounds; others are smooth like ganache. Tahini Tangerine—both earthy and bright with citrus—whisks me away to somewhere warm, with palm fronds. The Ginger Cardamom is peppy and bracing, a little bit like masala chai in chocolate truffle form. I like to cut the roasty Coffee & Nibs flavor into little squares when I’m on deadline and pop one as a reward every time I finish a paragraph. (Almost there!) And while the namesake honey in each bar delivers my ideal texture, it’s also more floral and caramelly than plain old sugar.As you can probably discern from the ingredients mentioned thus far, these truffle bars are virtually health foods. (Honey Mama’s was born in Oregon.) They contain no refined sugar, are made in a gluten-free kitchen, and are technically raw. This is not why they’re worth buying, though it certainly feels like a boon to be eating something that tastes like buttercream frosting but, nutritionally speaking, is more like trail mix.By the final bite Honey Mama’s Truffle Bars are almost mousse-like and leave a pleasant residue of coconutty oil on my fingertips. It’s a hard world out there, but fudgy chocolate is a reminder that from squish we came and to squish we will go. My Twix are quivering in their foil.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Ali Francis"]}