{"id": "5a24aed219ec264b719cbbb6702ecd23", "url": "https://www.bonappetit.com/recipe/tomatoes-with-fig-and-prosciutto", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Tomato Salad with Fig and Prosciutto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopAugust 2019 IssueTomatoes with Fig and ProsciuttoBy Andy BaraghaniJuly 9, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis salad is a riff on melon and prosciutto. We swapped the melon for jammy figs and sweet tomatoes.Ingredients4 servings¼cup sherry vinegar or red wine vinegar1Tbsp. honey1Tbsp. extra-virgin olive oil, plus more for drizzling16figs, torn1lb. small or medium heirloom tomatoes, halved crosswise or sliced into ¼\"–½\"-thick rounds½cup mint leaves, torn if largeKosher salt2oz. thinly sliced prosciuttoPreparationStep 1Whisk vinegar, honey, and 1 Tbsp. oil in a large bowl to combine. Add figs, tomatoes, and mint, season with salt, and  toss gently to combine.Step 2Transfer salad to a platter and spoon any excess dressing in bowl over. Tuck prosciutto around; drizzle with more oil.How would you rate Tomatoes with Fig and Prosciutto?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladItalianEuropeanTomatoVegetableFigFruitProsciuttoHamMeatSummerQuickEasyWeeknight MealsStarterSideDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}