{"id": "5a29271094772fbb7b520f0cc9b68210", "url": "https://www.bonappetit.com/story/donny-sirisavath-khao-noodle-shop", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Everything I Know About Running Restaurants, I Learned From My Mom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEverything I Know About Running Restaurants, I Learned From My MomThe chef and owner behind our No. 2 Best New Restaurant in America, Khao Noodle Shop in Dallas, shares his story.By Donny Sirisavath, as told to Hilary CadiganSeptember 17, 2019FacebookTwitterEmailFacebookTwitterEmailIt’s no coincidence that our pick for 2019’s No. 2 Best New Restaurant in America sits in the very place we named 2019’s City of the Year. Donny Sirisavath, the chef and owner behind Khao Noodle Shop, is a huge part of why Dallas is suddenly such an exciting place to eat. Partly because his Laotian small plates are so good they could make you cry. But also because of the energy Sirisavath's success has generated in the city, his role as a second-generation chef in a city made great by immigrants, and the twisting-turning story of how it all happened—which starts before he was even born. Here, in his own words, is that story. —Hilary CadiganIt wasn’t until after my mom died that I learned her real name. When she escaped her home country of Laos during the civil war, she had to change it so the government wouldn’t find her. Her birth name, Vieng Sai, became Phaysane. It was my dad’s idea to change it, to keep her safe. It was one of his old girlfriends’ names. He was working for the Thai government at the time, and helped my mom get out of a refugee camp in Isaan, the northeast part of Thailand.In 1977 my parents got sponsored by a Baptist church and moved to Amarillo, Texas. My mom got jobs where she could, mostly in factories: Levi’s, Fruit of the Loom, a meat processing plant. Three years later, she had me and started cooking for friends out of her house, dropping food off at stores around town. I grew up in her kitchen, learned early how to pound garlic with a mortar and pestle.Even though I was born in Texas, I always felt more like a refugee. I got held back in first grade because I didn’t want to speak English. My family and I were part of a strong Laotian immigrant community, the kind where everybody helps each other out. We lived off what we grew and raised ducks, chickens, and rabbits in the backyard. I bled my first duck at seven years old!When I was nine, we moved to San Antonio. There weren’t as many Laotians there, so I didn’t have many friends. I spent most of my free time with my mom, helping her in the kitchen. Then she took over a Thai-Chinese restaurant called Rama Garden. And after that closed, a Chinese place called Taste of the Orient. I mean, it was technically Chinese but my mom made it her own. She’d add fish sauce, make things taste funkier, more Laotian. At the time, the only Asian food people knew was Thai and Chinese. That’s why a lot of Laotian immigrants opened those kinds of restaurants—familiarity. They didn’t think the American public would be able to understand fermented fish.Everything my mom made was the best. And I’m not just saying that because she’s my mom. She’d never been formally taught, but she looked at recipes, understood flavor profiles, and just went for it. Julia Child was her thing. When she finally had the opportunity to open her own restaurant, it was a Thai place called Bai Bua. There she made the best pad thai in San Antonio. At first she was just following a recipe, but then she actually went to Thailand and sought out this lady—the OG, the queen of pad thai. She brought what she learned back to San Antonio and the local news called Bai Bua the best Thai restaurant in the city. It was in the ’hood but all these doctors, lawyers, and judges would come out for my mom’s food. She had lots of regulars.As a teenager, I’d help out in the restaurant: front of house, back of house, busboy, dishwasher. It took a year before mom gave me the OK to help cook. And even then it was just one dish at a time, until I mastered it. She was a perfectionist. Pad kee mao was the first dish she let me make. Once I finally got to do fried rice on the wok, I knew I’d made it. But mom was still the boss.Donny Sirisavath holds a photo of himself and his mother, Phaysane.\nPhoto by Alex LauI worked at Bai Bua on and off all through high school. When I turned 20, I was trying to figure out what to do next. My mom was ready to retire, and asked me to take over. But I said no, because I knew the toll owning a restaurant takes. Plus, I was still trying to learn about myself—and I’d met a girl. So I moved to Dallas instead.College wasn’t for me, so I dropped out and just took a bunch of odd jobs: worked on airplanes with my brother, worked in IT, worked for Samsung. I became a mailman for a minute. That was brutal because, you know, you have to walk… a lot. I considered going back to school for cooking at Le Cordon Bleu.Then my mom got sick. It was cancer, and it was bad. So I put my plans on hold, took a leave of absence from work, and brought her to Dallas to stay with me.I remember the moment it all came back: I was just standing there, watching my mom cook bitter melon, same way she always did it—scrambled eggs, liver, garlic, and onion. She was so concentrated, it was almost zen-like. And then it just literally hit me in the face, like, oh my god, this is it. I had goosebumps that did not go away for a good three minutes. Because this was what I had been wanting, all that time: Just to be there in the kitchen with my mom, watching her cook, cooking with her, reminiscing about my childhood. This was the happiness I had been missing.Every day from then on out it was, “Mom, what are we cooking today? What are you hungry for?” And then I’d make it, from memories of when she made it for me. I remembered the smells, the textures. My brain is like a rolodex of all the food I’ve eaten throughout my life. That’s why I don’t write down recipes—even my mom’s. I’d rather keep that memory inside. Cooking is like meditation for me. I forget about everything: stress, money, problems.Turns out, this is what my mom had planned all along: Before she died, she was going to teach me everything that she how to make, and in the process help me find my path. Le Cordon Bleu could not have taught me the complexity of Laotian food. Only my mom could do that.Funny story, I actually tried out for MasterChef. When I got there I was wearing my Chucks and my hoodie and they thought I was a breakdancer. Then I started cooking this fresh spring roll my mom taught me: cucumber, eggs, and the egg roll wrap. I just really wanted to make her proud. I didn’t get on the show, but at least I tried. Afterwards I was like, “I’ll make her proud in a different way.”Small plates at Khao Noodle Shop are inspired by the food Sirisavath grew up eating.\nPhoto by Alex LauWhen my mom died, I was 31. I was still trying to figure things out, but I knew what I didn’t want: No more aviation jobs, no more customer service, no more tech support. I applied for a job at Hewlett-Packard on a whim—it required a bachelor’s degree and four years experience, which I didn’t have. But somehow, I got it: Field service engineer. It was a dream job, and  I did it for six and a half years, but the whole time I was also cooking at home for friends and family.Friends would say, “Can you make this for me? I’ll pay you.” And I’m like, whoa, you want to pay me to cook? So I started catering. Then my buddy was like, “Why don’t you do pop-ups? L.A. does it, New York does it. Dallas doesn’t really have a big pop-up scene.” So I started dabbling, doing some test dishes at home. Inviting a couple friends over for honest opinions. And then it went from like three people to five people to ten people. I’m like, “Wait, wait, hold on, hold on. I didn’t tell you guys to invite your friends!”Things got bigger and we ended up taking over the kitchen of a local bar for the pop-ups—all they had was campfire burners but we made it work. My buddy Tex joined me and soon we were doing like 65 people. We actually sent up a tent outside the bar, and cooked out there. Propane burners, a grill. Street food style: Two-bite dishes, noodles. We were reintroducing Laotian food the way we eat it, but with a more modern interpretation—my interpretation. From there we just popped up all around town. Making fresh noodles, rice flour tacos and whatnot. Oh, it was amazing. It was freedom. Just trying to understand what people like, and having fun with it.That lasted about five years. And then one day I told Tex: “Look I’m ready to open this restaurant.” He’s like, “Are you serious?” I’m like, “Yeah, I’m dead serious. I’ve been talking about it and talking about it; I think this is our time.” I gave my boss a year and a half notice, and he didn’t believe me. But then in November of 2017, I quit my job. We found this place, in a neighborhood where there were a whole bunch of Southeast Asian refugees back in the late ’70s and early ’80s. And it turned out my wife, Noy, who is also Laotian, used to live across the street as a kid! Clearly, it was the right spot.We did everything ourselves, even the demolition. We made the tables, the lights, the awnings. I wanted an open kitchen so you could actually see the cooks and have more appreciation for what they do. I wanted communal tables so people could talk to each other and eat family-style. Because like my mom always said, food is what brings people together. And man, she’s so right.Sirisavath's famous boat noodles with pork blood broth\nPhoto by Alex LauLaotian food has been here for a long time. But it never had any light shined on it, you know? Same thing with my mom. She worked in a Thai restaurant cooking Thai food, but then also cooking Laotian food. And oftentimes people didn’t—and still don’t—understand. I have to deal with that every single day. It’s like, “Are you Thai or are you Laotian?” We’re both. I’m both.But the thing is, what I’m making now is more my interpretation of what I ate throughout my childhood, throughout my adulthood, and throughout my travels. Laotian food can be elevated. It can be bigger than what we are. I tell people, don’t expect to come here and get your mom’s cooking. My dishes are my own. I’m not your mom.I’m not taking away from our tradition; I’m just interpreting it my way, making what I think Laotian food can be. It’s not about convenience. It’s not fast food. It’s about this hearty, sit-down depth of flavor, this umami. I want to do it right and give it justice. I want it to be spicy, pungent, funky, all of that. I don’t want to dilute it or whitewash it. Because people will understand more about our culture by eating that dish full force.Any food can be elevated. Italian food, French food. Why can’t Laotian food be elevated too? And by elevated I mean having individuality in our food, individuality in our dishes. At the end of the day, that’s what it’s about. This is what I grew up doing, and it’s why I want to showcase something more meaningful. Something simple and honest but also complex.Almost 20 years ago, my mom asked me to take over her restaurant. I said no because I wasn’t ready then. But I’m ready now.Explore Bon AppétitHot 10 2019RestaurantsFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Donny Sirisavath", "As Told To Hilary Cadigan"]}