{"id": "5a454be111258149783bd231755b4324", "url": "https://www.bonappetit.com/recipe/chile-peanut-rice", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Chile Peanut Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueChile Peanut RiceBy Priya KrishnaMay 24, 20194.6(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chelsie CraigEmailPinterestPrintEmailPinterestPrintEvery ingredient in this throw-together side plays its part beautifully: crispy leftover basmati; earthy fried mustard seeds and curry leaves; mildly sweet, almost-caramelized onions; crunchy peanuts; and lingering heat from chiles. Altogether, it’s a glorious study in balance.Excerpted from Indian-ish © 2019 by Priya Krishna with Ritu Krishna. Photography © 2019 by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4 servings3cups cooked basmati rice (from about 1 cup dry rice)2Tbsp. (or more) fresh lime juice (from about 1 lime)1tsp. (or more) kosher salt½cup ghee or extra-virgin olive oil, divided1Tbsp. black mustard seeds10fresh curry leaves1cup roasted, unsalted peanuts1medium onion, sliced into thin strips2small Indian green chiles or serrano chiles, halved lengthwise (no need to stem them)2Tbsp. chopped cilantro leaves with tender stemsPreparationStep 1Combine rice, lime juice, and salt in a large bowl; set aside.Step 2Heat ¼ cup ghee in a shallow medium pan over medium. Once ghee melts (or oil begins to shimmer), add mustard seeds. As soon as they begin to pop and dance around in the ghee, which should be within seconds, remove pan from heat. Add curry leaves, making sure they get fully coated in ghee (there may be more popping and splattering, and that’s okay!). The leaves should immediately crisp up in the residual heat.Step 3Return pan to medium-low heat and add peanuts. Cook, stirring, until peanuts turn a medium shade of brown and become fragrant, 5–8 minutes. Pour peanut mixture over reserved rice mixture and toss gently to incorporate.Step 4Heat remaining ¼ cup ghee in same pan over medium. Once ghee melts (or oil begins to shimmer), add onion and chiles, spreading in an even layer, and cook, stirring occasionally, until onion is lightly browned and starting to caramelize, 5–7 minutes. Stir onion mixture into rice. Taste and add more salt and lime juice, if needed. Garnish with cilantro before serving.Excerpted from Indian-ish © 2019 by Priya Krishna with Ritu Krishna. Photography © 2019 by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.How would you rate Chile Peanut Rice?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThis is a glorious rice dish. It’s so fresh tasting with curry leaves, lime and fresh peanuts. We love this by itself or with lamb, fish, salad or chicken. Fabulous. Barb LundgrenColleyville, TX1/1/2022Firstly, to answer the question about curry leaves - leaves that are dried whole can be substituted for fresh (in my experience). If they are ground, then use much less and add just at the end of frying. my family just freezes them (I chuck the whole bag in the freezer) and uses them as needed. \n\nSecond, I just made this, but with slivered almonds as we had no peanuts. Really easy, though I cooked the onions until they were really brown (almost as dark as for biryani) and threw the rice into the skillet with the onions at the end to crisp it up a bit. Just seemed logical to me. I might actually reverse the process if I make it again, cooking the onion and chili, adding the rice to the skillet, removing it and then doing the tarka with mustard seed, curry leaves and nuts at the end. I also cut down on the ghee a bit - probably 1/3 cup overall. I would reduce it a bit more next time, as I found so much ghee for only 3 cups of rice dulled the flavour a bit. RachelCanada4/1/2021Question - what happens if you use dried curry leaves?  And a corollary - how long do fresh ones last?JTK DCWashington, DC1/15/2021Simple and really delicious – a definite crowdpleaser. Putting this into the regular rotation!Anonymous4/18/2020Background: I started watching Test Kitchen on Pluto and truly appreciate your chefs, show and recipes. I’ll give credit due on other recipes on subsequent reviews. \nI learned to cook and bake from my mother and grandmother until I became a single father and began cooking for my son and I from sheer embarrassment telling friends I was buying prepared and instant foods for us, that evolved into cooking everything from scratch- the past 22 years. \nI write today because since watching Chile Peanut Rice made, I’ve made it nearly a dozen times now. Recently replacing with Thai peppers and quinoa. I LOVE this dish. \nThank you for your work. RGLancasterCharlotte, North Carolina3/13/2020Surprised by this one! Fiance doesn't like much peanut flavor, but this is well balanced enough to make it into our regular rotation. This really hits the spot after an evening of heavy drinking & great company, too. Definitely worth sourcing fresh curry leaves for this one.Anonymous1/3/2020Oh wow!  Love this dish! Im surprised how good it taste. The fried curry leaves give the dish a such nice flavor. Definitely a keeper!AnonymousWestlake,Louisiana10/9/2019The effort to deliciousness payoff for this dish is ridiculous. Made this for the first time for something low effort on late night and I was expecting it to be good, but it turned out positively addicting. This will show up in my rotation again for certain. juniperjuiceEdinburgh, UK6/9/2019Delicious!!  Easy to make and will be a crowd pleaserfnikchehiSan Francisco5/31/2019Really great dish. Will definitely make it againajsheppard47Austin, TX5/30/2019Loved Priyas recipe. I only had 4 small curry leaves so I added some whole basil leaves with lime zest to mimic the flavors, it was still delicious :)AnonymousNew York, NY5/25/2019Explore Bon AppétitPeanutNutCurry LeafHerbs & SpicesSerrano ChileChileVegetableRiceRice & GrainsQuickEasyWeeknight MealsOne-Pot MealsSideGluten-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-24", "author": ["Condé Nast", "Priya Krishna"]}