{"id": "5a5f38f53c6787ccf3e80ed72676c6ae", "url": "https://www.bonappetit.com/story/about-last-month", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "About Last Month | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureAbout Last MonthIf it weren’t so awful and terrifying, I could’ve laughed at the pandemic’s timing.By Amanda ShapiroMay 7, 2020FacebookTwitterEmailIllustration by Sofie BirkinFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’ve been thinking about how much can happen in a month...and in a year.If you asked me at the beginning of March, I’d say that April 2019 was the hardest month on record for me. Relationship stuff, health stuff, money stuff: all things I’ve written about before. Back then, my definition of “hard” was completely personal. Bad things had happened to me—my world had imploded—meanwhile, the world outside couldn’t care less. And, in hindsight, I took great solace in that. I could escape: into the city, into other people. Even if it was temporary or artificial, I could live a different life.The year passed at what felt like hyperspeed. Meanwhile—haltingly and imperfectly—I built an ~actual~ new life. As we turned the corner into March, I was all geared up to celebrate the one-year anniversary of my Great Implosion. I was even considering a party.If it weren’t so awful and terrifying, I could’ve laughed at the pandemic’s timing. It was as if the universe said, “You thought last April was hard? LOL.’” As everything locked down, there were no other worlds to escape to. The only safe place was in my home, with only myself for solace.For a lot of us, this has been our first experience with collective hardship. It’s our first time seeing the systems that were already failing our most vulnerable fall completely apart. It’s our first time feeling like there’s no safety net, no one in power we can trust, no one to tell us when it will all be over or whether we’ll be okay.All this is to say: last month has the honor of being the new hardest month on record, and I know I’m not alone in feeling that way. There’ve been a lot of saving graces, though, which I’ve written about in recent weeks. And putting together The Guide to Being Alone along with assistant editor Aliza Abarbanel and Basically editor Sarah Jampel felt like one small thing we could do here at Healthyish to help.A few of my favorite stories in case you missed them: Healthyish newsletter columnist (and associate editor) Christina Chaey is the reason I wash and prep my produce now. Associate editor Hilary Cadigan is the reason I dance alone in my living room on Friday nights. Contributor Phillip Picardi is why I remember to call my mom (almost) every single day. Recipe developer and entrepreneur Hawa Hassan has been a constant inspiration through this time. So has Alison Roman, but for, uh, very different reasons (on a related note, guess what’s at the top of my wish list?). Contributor Chace Beech reminded me that a lot of us have been helping each other through hard things for a very long time.I hope you find some inspiration, or at least distraction, in these stories and the rest of the guide. And let me know how else Healthyish could be helpful in the coming weeks and months by DMing us @healthy_ish or emailing healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitessayRead MoreCoronavirusWhat Do You Want to Remember About This Time?By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Amanda Shapiro"]}