{"id": "5a759ac10e873a386f9331c59af91c5c", "url": "https://www.bonappetit.com/story/best-restaurant-meals-2021", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "The Best Restaurant Meals of 2021, According to BA Staffers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Restaurant Meals of 2021, According to BA StaffersFrom street cart skewers to perfect pastas, these are the meals that mattered most.By Ali FrancisDecember 30, 2021FacebookTwitterEmailPhotograph by Christine DongFacebookTwitterEmailNo, we’re not talking about the fanciest spots. Or the most hyped. Or even the newest. The best restaurant meals, to us, were the ones that stayed seared in our memories long after the last french fry was dipped and the final sip of a perfect pét-nat thrown back. These are all the places we turned to for quiet solo dinners with a book, vaxxed brunches with missed friends, and boxes of weeknight takeout when we just couldn’t with cooking anymore. In other words, these, our best restaurant meals, are all the ones that mattered most. From the street cart skewers that transported lifestyle editor Karen Yuan back to the Beijing neighborhood she grew up in to senior cooking editor Sarah Jampel’s best-ever post-baby bagel and assistant editor Chala Tyson Tshitundu’s flaky, perfect fried catfish biscuit sandwich—“a gift from the ancestors”—here are all the meals we ate (and loved) this year.Photograph courtesy of Mi Tocaya AntojeríaMi Tocaya Antojería, ChicagoTo my left: margarita. To my right: a couple arguing. In front of me: a platter of goat birria covered in bubbling cheese from Mi Tocaya Antojería. These three things are my restaurant dream combo. I don’t think, at any moment in 2021, I was happier than eating that meal. You make a taco with the cheesy birria, then dip it in a bowl of warm consomé, the savory broth dripping down your hand. We also ate a spicy, bright aguachile, chile-rubbed fish collar, and a side of chicharos, green peas with baby corn and Cotija cheese, and other goodies. I loved this meal so much I went back, a week later, to do it all over again. —Alex Beggs, senior staff writerPhotograph by Evan SungDame, New York City Dame has been one of New York’s tougher reservations, so when I snagged one, I didn’t cancel, even when it started pouring minutes before my outdoor dining appointment. The food was perfect: crisp whitefish croquettes, tiny smoked mussels, a caper- and herb-crusted whole mackerel, fish and chips with the crunchiest golden coating. It was delicious seafood, treated with care, and it was perfect even as rain blew in sideways. I loved the meal not in spite of the conditions but ultimately because of them. We made the most of what we had to work with and found the upside, and for me, that sums up 2021. —Bettina Makalintal, associate editorPhotograph by Justin TsucalasTowson Hot Bagels, BaltimoreMy best non-home-cooked meal in 2021, hands down, was the giant bagel sandwich with cream cheese, capers, lox, and red onion that I consumed in the hospital about six hours after my daughter was born in June. (It’s like, how many times can I mention on the internet that I had a baby???) I’m normally frugal with my order—egg and cheese when I’m splurging, cream cheese on a regular day—but this occasion called for something special, and with lots of uncooked fish. It was from our local Baltimore bagel spot, THB, which makes ’em just as good, if not better, than the NYC spots. —Sarah Jampel, senior editor, cooking Photograph courtesy of SoothrSoothr, New York CityEven if I didn’t live a few blocks from Soothr, I’d walk to the edges of the earth for the koong karee—shrimp coated in a thick and gooey-in-a-good-way egg curry. Perhaps the reason I possess so much love for this dish is its likeness in texture to the egg drop soups of my childhood, but with a lot more flavor and a lot more pizzazz. It deserves to be eaten piping hot and crammed on your table next to the chicken ki-mao noodles and roasted eggplant salad. —Kate Kassin, editorial operations associatePhotograph by Sam SchwarzFradei, New York CityThe thing about Fradei—a tiny, tin-ceilinged restaurant in Brooklyn I’d walked past one million times before finally deciding to make a reservation—is that it feels like your coolest friend’s apartment. It’s extremely cozy, with a Frank Ocean and Breakbot soundtrack that undoes any of the stuffiness you might associate with a set menu. Because it was November, our meal was full of squash and apples, but the standout was a bowl of giant, chewy paccheri pasta in a creamy mushroom sauce topped with whisper-thin shavings of raw mushroom that looked like clip art pizza toppings. I could have eaten 10 bowls. —Kendra Vaculin, associate food editorPhotograph by Gentl & Hyers Hartwood, Tulum, MexicoThe platillo de pulpo at Hartwood still octopi’s my thoughts (sorry). I had a chance to try it in late August. Let me set the scene: After a long day in the sun, my friends and I are sweaty and hungry and hallucinating, shots of mezcal dancing around our heads. Then, like a mirage in the sand, our server sets a plate on our table: Thick, charred tentacles spilled over slivers of red onion and crispy potatoes atop a bright, greenish sauce and accompanied by the hugest lime I’ve ever seen in my life. Like everything else on Hartwood’s menu, the octopus is cooked over an open fire within a handmade wood-burning oven so the meat tastes tender and juicy and crunchy, which is hard to do when it comes to cephalopods. And the restaurant uses sustainable fishing methods—in fact, its entire operations are off-grid, relying on solar panels, wholesale compost, and ingredients collected from farms in the interior of the Yucatán. —Karen Yuan, lifestyle editorOma’s Hideaway, Portland, OregonThe little ray of sunshine in my otherwise extremely rainy visit to Portland, Oregon, was dinner at Oma’s Hideaway—a newish Southeast Asian restaurant from Gado Gado founders Mariah and Thomas Pisha-Duffly. The sweet potato dumplings arrived first: marshmallow-fluffy and floating in a peppy green curry sauce. The roti canai (pictured in the opening image for this article), paired with a little ramekin of curry, was the buttery, flaky follow-up that I challenge you to stop eating. And the finale: wanton mee—a gorgeous plate of handmade noodles, char siu, chili jams, and ferments. With a rhinestone bar, ornate wallpaper for days, and the funkiest bathrooms (in which you may be tempted to do a little jig), the whole vibe is as bright and memorable as the food. —Ali Francis, associate editorPhotograph courtesy of Via LocustaVia Locusta, PhiladelphiaWhen I was growing up, I spent a lot of time between Long Island and New York City—but over the years, I’ve learned something about myself: I’m a Philly girl at heart. My boyfriend grew up in Pennsylvania and he loves Philadelphia, so much so that he sings the Pennsylvania Lottery theme song every time we set foot in the city. And it was his enthusiasm that got me hooked. Now we use any excuse to go down there, whether it be to get tattoos and piercings, shop for used books at Brickbat or Molly’s, or dine at one of our favorite restaurants, Via Locusta. Handmade pastas are the core of the menu, but it’s the freshly baked focaccia and (seasonal) heirloom tomato salad that pulled us in over and over again this past summer. It was the last restaurant we went to before the entire world locked down in March 2020, and it was the first restaurant we returned to when outdoor dining took off that same summer. Every time we sit down, he reaches for my hand, gives it a kiss, and then we eagerly wait for the waiter to arrive to take our order. It feels like home. —Esra Erol, senior social media managerPhotograph by Kyle JohnsonTomo, SeattleEvery one of the five courses on the $78 tasting menu at Tomo is an absolute delight, from the roasted chilacayote squash bathed in cream left over from the house-made stracciatella to the hazelnut and sorrel kakigori, which tasted like Nutella salad (a good thing—who knew?). But the standout at Brady Ishiwata Williams’s new restaurant is his chawanmushi—silky and savory, perfectly set, and crowned with matsutake slices. It’s an adaptation of his grandmother’s recipe and a fitting tribute, since Tomo, located just outside Seattle in the neighborhood of White Center, is named after her. —MacKenzie Chung Fegan, senior commerce editorBrown Butter Craft Bar & Kitchen, New York CityI live in Bed-Stuy, so there’s no shortage of delicious things to eat right in the neighborhood. But no meal this year has nourished my body and soul quite like chef Will Coleman’s Juneteenth Jubilee brunch at Bed-Stuy’s Brown Butter Craft Bar & Kitchen. For this special pop-up, Coleman blessed us with cheesy coconut grits topped with black-eyed peas and roasted cherry tomatoes, a layered collard greens salad, and the pièce de résistance, a tender fried catfish sandwich stacked with chilies and caramelized onions on one of Brown Butter’s signature flaky biscuits. That meal truly felt like a gift from the ancestors. —Chala Tyson Tshitundu, assistant editorPhotograph by Chris RankEl Tesoro, AtlantaI spent most of the first half of the year in Atlanta, where we ordered a lot of takeout but rarely dined in anywhere—that is, until early April. The weather started to turn and the vaccination rate slowly crept up, so my husband and I decided to go out for brunch for what might have been the very first time since late 2019. With the sun shining, we ordered half the menu at El Tesoro, a taqueria serving tacos, mulitas, tamales, and so much more—along with some of the city’s best margaritas—out on a sprawling and lovely patio. If you go for brunch, like we did, don’t miss the weekend-only migas or frijalero tacos and be sure to round out your meal with a cup of the café de olla. —Sonia Chopra, executive editorPhotograph courtesy of Cellar Door ProvisionsCellar Door Provisions, ChicagoMy brother and I went to Cellar Door Provisions to celebrate my first magazine job in June, four months after I started at Bon Appétit. We were also celebrating my college graduation, which had technically happened more than a year earlier, a few missed birthdays, and some other forgotten milestones we’d passed since we’d last seen each other. That week on the rotating menu were braised short ribs and arroz con leche. We ordered a bottle of orange wine—we agreed it tasted “ripe,” whatever that means—which we sipped while shuffling our face masks off and on with each passing of a staff member. It was a smidge awkward to be sitting like that again, indoors and in person, after so long. But some things truly never change. —Nico Avalle, production assistantPhotograph by Billy CarnesEkiben, BaltimoreIn close second, and if I’m not mentioning my baby (LOL): takeout from Ekiben eaten in an empty apartment right after moving in. The tofu nuggets, doused in spicy-sweet peanut sauce and served with a heap of tangy pickles, are exactly what I want from restaurant tofu: deeply fried, almost unbelievably crispy, and impossible to stop eating. It’s the sort of tofu I could never re-create at home, no matter how many times I’ve tried. —S.J.Photograph by Briar HandlyHandle, Park City, UtahI spent five months this year on the road, and let me tell you: After days snackin’ on nada but Pringles and gummy worms, there was nothing so thrilling as making a restaurant reservation from a random roadside gas station. Filled with the promise of REAL FOOD, the last few hours of whatever leg we were on always flew by. While everything I tried at Handle was a treat—hearty, creative, and decidedly real—the mushroom bucatini (featuring truffled mascarpone and chives) was outta this world. Creamy, salty, and packed with umami notes. In other words, perfect. —A.F.Grand Street Skewer Cart, New York CityGrowing up in Beijing turned me into a snob when it comes to lamb skewers, a street snack most beloved by children and drunk people in the city, both of which I have been. I tasted some of my favorite lamb skewers outside of China at the Grand Street Skewer Cart this past summer. The auntie at the cart cooks the skewers over a tiny coal fire with the efficiency and care of someone with hungry carnivores waiting in a long line behind her. The meat is medium-ish done and the seasoning comes in regular, mild, and spicy. And the taste is smoky and nostalgic. The cart also offers pork, beef, chicken, chicken gizzard, chicken heart, tripe, fish ball, squid, everything. It’s like a tiny portal to a Beijing street corner. Bring cash. —K.Y.Photograph courtesy of FioreFiore, PhiladelphiaYou might think that bringing friends visiting from Venice to an Italian restaurant is borderline insane. I knew exactly what I was doing, however, when I took them to Fiore for our first (and only) indoor dining experience as a family in 2021. What our year lacked in terms of quantity of dinners out, we more than compensated for with the amount of food we ordered in just one dinner. But while it might have been a night of excess, each plate showcased a restraint that I was clearly not capable of, working with a few precise flavors to create dishes that sang with complexity. While it is hard to choose just one favorite, each bite of ricotta gnudi floating on a pool of buttery fresh corn took me all the way to Italy, then right back to Philadelphia. —Chris Morocco, test kitchen directorPhotograph by Aliya IkhumenPetee’s Pie Company, New York CityI’ll never forget my first fun, relaxing day in New York City during the summer of 2020, when the city had emerged from that first stretch of the pandemic: I went to McNally Jackson because I was desperate to buy a book from an actual human being and then I walked to Delancey Street to get a slice of chocolate cream pie from Petee’s Pie Company (a.k.a. heaven on earth). Here’s the thing: There is pie…and then there is pie made by owner Petra Paredez, a baker for whom pie-making is a ribbon-worthy feat every single time. This is the shop I go to when I need a pie for every major holiday or like, just because. This particular slice was my first in months and—apologies for the forthcoming cliché—I cried because it tasted just as good as it did the first time, like a warm hug. Then and there, I made a vow to never take the little things (little pies?) for granted. —E.E.Photograph by Paul McDonoughSemma, New York CityBecause I’ve covered restaurants for so long, I have to be honest that it’s rare I leave a dinner totally blown away. That changed with Semma, the newest spot from restaurateurs Chintan Pandya and Roni Mazumdar, which opened this year in Greenwich Village. My first and second meals there were so good that I already have plans to go back twice before the end of 2021, and I keep catching myself only talking about the menu in absolutes: The standout curry leaf and gin cocktail, the platonic-ideal dosa with actually perfect sambar, the best-in-class parotta. My friends who eat meat say don’t skip the snails, the banana-leaf cod, or the lamb. Go with a crew so you can try a little of everything and make your reservations now, because they’re hard to come by. —S.C. Explore Bon AppétitRestaurantsRead MorerecipesThe 10 Most Popular Recipes of 2021Gallery10 SlidesBy Nico AvallerecipesThe 10 Most Popular Vegetarian Recipes of 2021Gallery10 SlidesBy Antara SinhaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-30", "author": ["Condé Nast", "Ali Francis"]}