{"id": "5a798234dd0ee8d0fd3649c8af787069", "url": "https://www.bonappetit.com/story/easy-puff-pastry", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "How to Make Easy Shortcut Puff Pastry at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Puff Pastry for Anyone Who Ever Said They Can’t BakeIf I can make flaky, bakery-worthy puff, so can you.By Christina ChaeyNovember 12, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailMy job is to convince more home cooks out there to cook without fear. And while I have no problem confidently coaching you through how to poach an egg or make a soup, I have a secret: I’m terrified of dough. Much like dogs, dough can smell this fear, which is the likely reason why, after countless failed attempts at fluffy breads, flaky pies, and chewy pizzas, I’ve developed an extreme aversion to recipes that ask me to make dough.But a few weeks ago, as I reached into the oven and pulled out the Glazed and Flaky Apple Tart I spent the better part of a day making, I was forever changed. Maple-and-vanilla roasted apples sat atop a puffy, flaky rectangle of Shortcut Puff Pastry that I, YES I, had made. I counted at least 11 distinct, flaky layers in the tart base. \"LOOK AT MY LAYERS!!!\" I would shout to anyone within earshot. The buttery-yet-light, flavorful pastry broke into a thousand little flaky shards with each bite. I was hooked.The flaky blanket on top is all the convincing I need to make more chicken pot pie.\nALEX LAUEver since that day, I’ve been itching to make and freeze another batch or two of Shortcut Puff Pastry so I can practice rolling and folding the butter-studded dough. (The roll-and-fold process is what encases all those pieces of butter between layers of dough—as the water in the butter evaporates in the oven, the dough separates into its many layers.) I’ve also become obsessed with searching this website for all the excuses I can find to use puff pastry: Chicken pot pie. Crispy cheese twists that would go very well with an icy martini. Little hand pies stuffed with spiced lamb and currants, because you can 100 percent use puff pastry anywhere you'd use regular pie crust. This insane carrot tart spread with a thick layer of ricotta. A Butternut Squash Tarte Tatin with a puff pastry base—another Thanksgiving contender.You may be wondering how I, who can’t even tell when I’m working with dead yeast (did you know that yeast expires, because I didn’t), managed such a feat of butter-and-flour architecture. Well, Shortcut Puff Pastry is engineered to be many times easier than traditional puff pastry (which is one of the more time-consuming pastry projects you can commit to), and the difficulty-to-deliciousness ratio makes it entirely worth trying yourself rather than buying frozen puff pastry at the supermarket. All credit for this recipe goes to my guru in life and pastry, Claire Saffitz, who showed me the entire puff pastry process from start to finish.Claire demonstrates how to fold the pastry into thirds, right before rolling it out—again.\nPHOTO BY MICHAEL GRAYDON + NIKOLE HERRIOTT, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIWatching Claire make her shortcut dough (which she developed to be much easier and faster than the “real” lamination method that professionals use to make croissants and such), the thing that struck me most was that she knew within seconds of feeling the dough between her fingers whether it was the correct consistency or not. The dough was a bit too crumbly at first, so in went an extra drizzle of water. “There we go,” she said as the clumps of dough started to come together in fist-sized balls. “That’s starting to feel familiar.” I watched her use long, confident rolls to coax the lumpy mass into a perfectly smooth rectangle.But here’s the real thing Claire taught me in all this: Being a more confident baker doesn’t always mean being a slave to a recipe. Sometimes, you need to allow yourself to simply trust your instincts. Every time I used to embark on a dough project, I would painstakingly measure out each gram of flour and add exactly the amount of water called for, not a milliliter less or more, because PRECISION. Well, it turns out your dough doesn’t really give a crap about precision. Sometimes it’s just going to want more liquid, or flour. If it looks and feels dry as sand even though you measured your ingredients exactly, go ahead and add more water.And if something goes still awry, the worst that happens is you’re left with a tray of less-than-perfect pastry that was meant to live out its days dipped in a bowl of ranch or smeared with Nutella for a standing-around-the-kitchen snack. And if that’s failure, I can live with it.Get the recipe:Shortcut Puff PastryWhen this buttery, flakey puff pastry comes out of the oven, chances are you'll be shocked to remember you made it yourself.View RecipeExplore Bon AppétitDessertPastryThanksgivingPuff Pastry DoughRead Moretest-kitchenThis Glazed and Flaky Apple Tart Will Make You Forget All About PieBy Christina ChaeycookingI Almost Set My Kitchen on Fire Making These Cheese Twists, But I Still Love ThemBy Elaheh NozaricultureOnce You Have This Baking Tool, You'll Never Be Able to Live Without ItBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-12", "author": ["Condé Nast", "Christina Chaey"]}