{"id": "5a82adf677f28faaf0edc311c3c0b87d", "url": "https://www.bonappetit.com/story/biore-uv-aqua-rich-watery-essence", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Biore UV Aqua Rich Watery Essence Is the Holy Grain Sunscreen I Order from Japan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBiore UV Aqua Rich Watery Essence Is the Luxe Sunscreen I Order from JapanSenior food editor Andy Baraghani owes his glowy skin to this cult sunscreen.By Andy BaraghaniAugust 3, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, senior food editor Andy Baraghani shares his favorite feel-good tip on our Instagram Story. And you guys dig it. So Andy will be recapping some of your favorite segments here. Up next, Biore UV Aqua Rich Watery Essence, the Japanese sunscreen that Baraghani swears by.Sunscreen was the first big step I took in preserving and sustaining the skin that I have, and that’s really thanks to my mother. She was a Lancome lady for over 20 years in San Francisco, and wherever we went, she would always remind us to put on sunscreen. When I moved to New York and I was on my own, I still made sure to incorporate sunscreen into my daily skincare regimen. It doesn't matter if it's 95°F or 35°F, rainy and snowy or humid and hot—I'm wearing it, and I'm reapplying all day, because sunlight is one of the worst things you can do to your skin along with sugar and lack of sleep.But I didn’t find my holy-grail sunscreen until two years ago. I was on Reddit at /r/skincareaddiction, which is a great resource for anyone interested in skincare. There is a lot of information—you might have to filter a bit to find what feels right for your skin—and I noticed a lot of people talking about Bioré UV Aqua Rich Watery Essence.This sunscreen has a serious cult following, though it’s not technically sold in the United States. I honestly just got it because I wanted to try something new, but I quickly became obsessed because it has a great lightweight consistency in addition to serious protection. I always look for sunscreen that has UVA and UVB protection, and this product has both. It’s also SPF 50+. I order it on Amazon, and it’s so worth it.I know some people use moisturizers with SPF, but I’m a firm believer in using two separate products. I prep my skin with Embryolisse Concentrated Lait Cream, let it set, and then put Bioré UV Aqua Rich all over. I go heavy on my cheeks, forehead, and nose, then hit the forgotten places: ears, neck, throat, hands, and any exposed chest area. The lightweight consistency means it absorbs rapidly without leaving a white cast, which is never a good look.I’m not a homebody, and it’s summer—of course I’m out in the sun! So I take my vitamin D pills, I cross the street to stay in the shade, and I wear this sunscreen. Mom, I hope you're proud.Buy it: Bioré UV Aqua Rich Watery Essence, $18.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish30 Seconds With AndyShoppingRead MoreLifestyleThe Salty Toothpaste That Makes My Teeth Feel Super CleanBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-03", "author": ["Condé Nast", "Andy Baraghani"]}