{"id": "5a94e4bfde400a01d657f105def001a6", "url": "https://www.bonappetit.com/story/mashama-bailey-honors-zora-neale-hurston-feast", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Chef Mashama Bailey Honors Zora Neale Hurston With a Southern Feast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Mashama Bailey Honors Zora Neale Hurston With a Southern Feast“Zora left the South to support herself, but she never ran away from it. She told real stories of her place. She exploded the reality of Southern living for her time.”By Hilary CadiganOctober 19, 2018FacebookTwitterEmailMashama BaileyPhoto by Chia ChongFacebookTwitterEmailRumor has it, the cornbread got her walking.Zora Neale Hurston’s mother had gone out to the yard to do some laundry and left her daughter inside with a crumbly golden square to munch on. Suddenly, a wild hog broke into the house and went straight for the cornbread. Not about to be hog bait, the toddler hoisted herself up against the arm of a chair and started shuffling as fast as her tiny legs could carry her, leaving a trail of crumbs in her wake.“She got up and tried to run away from the pig!” Mashama Bailey says with a laugh. “Apparently that’s how she learned to walk. It’s one of those things about her childhood: cornbread and buttermilk.”Bailey, the James Beard-nominated executive chef and partner at The Grey in Savannah, Georgia, found the anecdote in Valerie Boyd’s seminal biography of Hurston, Wrapped in Rainbows. It was just one of many books she read to prepare for cooking a lunch honoring the late literary icon, who has been called the most significant black woman writer of the early 20th century. She was also one of the most controversial, due to the particular way she chose to celebrate black culture: writing in dialect and refusing to champion desegregation.“I’m not really from the South,” Bailey tells me. “My mom was raised in Georgia but I was born in New York. Zora grew up in coastal Florida and then moved to Harlem [where she became a pivotal figure in the Harlem Renaissance]. I felt like even though we went opposite ways as far as destination, our stories concerning food were quite similar.”That’s why, when John T. Edge called her up asking if she’d like to prepare lunch for 350 people based around a literary figure for the annual Southern Foodways Alliance fall symposium in Oxford, Mississippi, Bailey chose Hurston. “Zora left the South to support herself, but she never ran away from it,” Bailey says. “She told real stories of her place, and she had a real connection to working-class folks. She exploded the reality of Southern living for her time.”The tablescape, with pages from Hurston's books.\nPhoto by Hilary CadiganInside a high-ceilinged former power plant nestled beside Oxford’s historic main square, long communal tables are set for a feast. Shamrock green table clothes are spread beneath a runner made of pages pulled from Hurston books and glued together, their edges scalloped like lace. Clusters of lemons, pears, and oranges strewn with baby’s breath frame platters piled with pulled rabbit, bread and butter pickles, and pillowy hot buns fresh from the oven.Bailey’s first course is titled “Jook Snacks” as a nod to the ramshackle establishments where southern black folks, barred from most restaurants under Jim Crow, would gather to eat, drink, and dance. “Zora wrote beautifully about juke joints and the people who gathered there,” the menu reads. We make miniature sandwiches out of the buns, slathering them with homemade preserves and piling them high with tender strands of rabbit meat. Pickle chips add a sour snap.“The menu is very homey,” Bailey says. “One thing about Zora is that she had a very sensitive stomach. I think because she was so controversial in her time, that's where all of those things went. If you’re always anxious or always putting yourself out there, it has to go somewhere.”The meal strikes an interesting balance between Bailey’s interpretations of Hurston, a mysterious figure dead 58 years, and the chef’s own life. The Savannah-style red rice with shrimp and stewed okra that comes next feels particularly potent. “I took some of the things that I liked about her, and took some of the things that I liked about being in Savannah, and made something new out of it,” Bailey says. “I'm trying to channel myself, if I was her. What would I want on my table? What would I have in my refrigerator? What would I cook for my guests?”Smoked whiting and grit cakes.\nPhoto by Hilary CadiganThe answer: smoked whiting layered over creamy grits cakes; Tabasco-braised collards with smoked pig tails (perhaps a nod to that cornbread-hungry hog); and sweet potatoes, ash-roasted and bathed in a deep, smoky mole. Guests reach across the tables to heap food onto mismatched china plates with floral patterns straight out of grandma’s dining hutch.“I think when you have conversations with people that you are comfortable with, food always comes up,” Bailey says. “And I thought that was interesting, and so embedded into Zora’s writing. You can tell where a person's from by what they eat.” The chef reminds me that Hurston herself once opened a small restaurant, and always grew her own vegetables. Then she harkens back to her own upbringing in the Bronx, where her Georgia-born mother would serve roast chicken and rice, gravy and greens every Sunday for supper. Those meals wove themselves into her roots, and even back then Bailey would refer to herself as a Southerner, once-removed. Food, family, literature, politics, the struggle to find one’s place in the world: They’re all connected.For her finale, Bailey nods to Hurston’s most famous work, controversial in its time but found now on most high school reading lists: Their Eyes Were Watching God. Cornmeal buttermilk tea cakes, in honor of protagonist Janie’s one true love (the flawed yet thoroughly human Vergible “Tea Cake” Woods), set beside sticky peanut brittle and candied pears. “These were some of Zora’s favorite things,” Bailey tells me. “They signify courtship, love, a sweet treat for your sweet.”When the meal is over I meet Bailey under the tent in the parking lot that’s served as a sprawling outdoor kitchen. She’s breathless with relief as satisfied diners shake her hand. I ask her to explain in as few words as possible why she chose to center perhaps the biggest lunch she’s ever served around Zora Neale Hurston. She doesn’t skip a beat.“Because of black girl magic.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-19", "author": ["Condé Nast", "Hilary Cadigan"]}