{"id": "5aa1e0ef103e15dabde2743da91f48c4", "url": "https://www.bonappetit.com/story/res-ipsa-philadelphia", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "You Can Throw the Half-Order Pastas at Res Ipsa Cafe on My List of Reasons to Keep Living | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYou Can Throw the Half-Order Pastas at Res Ipsa on My List of Reasons to Keep LivingI’ll take one of everything, thank you very much.By Alex DelanyApril 2, 2019FacebookTwitterEmailPhoto by Alex DelanyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.You know what a win-win situation is, right? Where you make one choice, and you get two glorious results in return? Let me give you an example. You and a couple friends walk into Philadelphia’s Res Ipsa Cafe for dinner, look at the six pastas on the menu, and order all of them in half portions. That's a good decision. You’ll get to try all the carbs coming out of Michael Ferreri's kitchen (win), and you won't feel like a pile of garbage later after you’ve devoured them (win). In this scenario, every bit of gluten that the light from Res Ipsa’s white globe fixtures touches can be yours. And that’s a good thing, because otherwise, it’d be pretty hard to choose. There’s bucatini with monkfish and breadcrumbs. Cavatelli with beans, anchovies, and broccoli. Linguine alle vongole. Gnocchi al sardi. Orecchiette with marjoram, mushrooms, and Parm. Ferreri’s Sicilian-influenced pastas change seasonally, but with rotating specials, you’ll also find new dishes to explore from week to week. And if you're the type to get thirsty, Res Ipsa is BYOB. So on top of getting the full spread of pastas, you also get your wine of choice too. That’s a...yeah, you get it.Go there: Res Ipsa CafeExplore Bon AppétitHighly RecommendPhiladelphiaRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Alex Delany"]}