{"id": "5aa3fc7dca6ffee1b0acd91c43f04afe", "url": "https://www.bonappetit.com/story/grilling-etiquette", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Is It Ever Okay...To Take Over the Grilling at Someone Else’s Party? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Take Over the Grilling at Someone Else’s Party?And more questionable summer entertaining etiquette.By Alex BeggsMay 28, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.Is it ever okay to step in and take over grilling duties from the host to save a skirt steak from a certain dry, chewy death? —Professional PeteIf you work in food in some professional capacity, you might feel you’re better at ~entertaining~ than...everyone else. However, you’re a mere mortal. If you’d like to step in, get near the grill, and peer at the meats. Ask the host, “Sooo, whattya makin here?” Then follow up with detailed, annoying questions about how long they marinated the meat, what kind of salt they prefer, whether they like to smash or grate garlic, what their burger ratio is, etc, until they give in/up and offer you the tongs. You may NOT take the tongs without being invited. Let the meat burn, for all I care! This ain’t your castle, burger king!Men think they’re better at grilling than I am (I’m not a man). How do I let them know that I’ll be the only person “manning” the grill at my place? —Female FranSounds like you might know Pete. If he gets too close to the coals and starts talking about smashing garlic, tell him to run inside and fetch you a Negroni. Then he’ll know where he stands in this house.Put those hands to WORK.\nPeden + MunkSay I’m hosting dinner and I really have things under control, but my guests offer to help. Can I just say no? —Independent IreneYou think they genuinely want to help? LOL. Don’t let them off the hook! Open your laptop, click on the “Promotions” tab in Gmail, and kindly ask your friend to please unsubscribe you from everything except the Bon Appétit newsletter. Hand another friend your Internet bill and see if they can get Fios at no extra charge. Give another the vacuum. By the time dinner’s ready, you’ll be exactly where you started! Alone.What do you do if you’re having a party and someone you invited either tells you to invite two other relatives or goes ahead and invites them? —At Capacity CelineThis is against the LAW—even if they’re inviting family with the same strands of subpar DNA. No extra invites allowed! Only the host sends invites, and only the host gets to spark lifelong feuds, pointless rifts, and petty grudges.When offered a chocolate bonbon, do you take the chocolate along with the paper cup, or do you take only the piece of chocolate? —Detailed DoreenI’m so glad someone finally had the nerve to ask this question. Take the little paper cup, please, and then hold the bonbon in your palm and sigh, deeply and introspectively. Then pick up the chocolate and take a tiny bite to see if the filling is to your liking. If it’s something like raspberry, place the little cup and half-eaten morsel back into the box and tell the host, “No thanks.”This potato salad has been sitting out at 80 degrees for over an hour. Mmmmmm. Would eat.\nPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyIs it ever okay to ask how long a suspiciously warm potato salad/tuna salad has been out in the sun? Not trying to second guess my friend's judgement but also not trying to get food poisoning. —Worry Wart WandaThe tuna’s fiiiiiiiine.A friend of mine (definitely not me) sweats a lot when the temperature surpasses 75 degrees. What are some ways he can survive summer cookouts? —Moist MikeyWear more mesh!Nighttime parties have a natural end point. Daytime parties go on and on and on. Can I kick people out even if it’s 7 p.m.? —Sleepytime T.Daytime parties should end at 5 so people can go home, take a quick nap, and then wonder where the day went. To signal that you want people to leave, tell them there’s been a sewage incident, “someone from the city is coming,” and that if they start to feel faint, they should hit up urgent care. Put a sign on the bathroom with a skull and crossbones. Tell people there’s “something in the ice.” Start itching your elbows and howling in little yaps. Ask: “Is it a full moon tonight or just...waning…” Watch them leave and never return.How can you look kinda-cool when you can’t drink alcohol at a social event? Sparkling water can only do so much. —Phobic PhanHerewith, the best non-alcoholic bevs to add to the cooler:A growler of kombuchaTwo liter of Hawaiian punchMexican CokeHomemade spicy limeadeAgua de JamaicaGallon of Turkey Hill iced teaA pony keg of root beerDiet ginger aleKeep far from burgers.\nAndrew KnowltonI'm a picky-as-hell vegetarian, and I don't want my vegetables to be grilled in charred meat remnants. How can I communicate that politely, or should I just clean the grill myself? —Leafy LaurenBring a gift of a nice grill basket, and when you hand it over, say, “I love these because then you can grill vegetables without having the veg touch meat bits, which is great for vegetarians!” And they’ll realize something they perhaps have never thought before. Or they’ll toss the grill basket in the garage and cook your green beans in burger flecks after all. Hard to say.My in-laws are sporadic about serving alcohol at their get-togethers, for no particular reason. Can I bring my own...and then drink it? —Thirsty TaraBring wine! And when dinner begins, stand on your chair and announce: “I’m opening a bottle of Cupcake Chardonnay, does anyone want any?!” Just don’t be covert about it, otherwise the in-laws might get more concerned about you than they already are.How do you tell people that they shouldn’t use the ice cubes that are in the cooler for their drinks (you know, the stuff keeping the drinks cold)? —Icy IsabellaSprinkle cayenne pepper on it, like you do to keep your cat from peeing on the indoor plants.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexExplore Bon AppétitIs It Ever OkayEntertainingEtiquetteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-28", "author": ["Condé Nast", "Alex Beggs"]}