{"id": "5aaeed9c2176c3f60e075db03fe72573", "url": "https://www.bonappetit.com/story/6-things-to-do-with-a-can-of-chipotle-in-adobo-sauce", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Chipotles in Adobo Sauce Are Probably In Your Fridge Right Now—Here's How to Use Them Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking6 Things to Do With a Can of Chipotles in Adobo SauceHow to use up the rest of that spicy, smoky can of goodness.By Alex DelanyJanuary 14, 2020FacebookTwitterEmailFacebookTwitterEmailChipotles in adobo sauce are one of the easiest way to get deep, smoky, spicy flavor into a dish. The only problem is that no recipe ever calls for the whole can of the chiles. Cook with them once, and there are always leftover peppers. Always.We like to freeze the extra peppers and sauce, whether that be in an ice cube tray or flattened in a Ziploc bag, for future use. Kept this way, they'll last almost forever, and are super easy to thaw and bring back to life for use in a wide variety of dishes. But “wide variety” isn’t much help, huh? Fine, we’ll get a little more specific. When we see a recipe that calls for a few chipotles in adobo, we start thinking of all the other smoky, spicy, delicious things we'll make that week. It's the gift that keeps on giving. Here are our six favorite ways to use up the rest of the chiles in that can.Laura MurrayMake a Super-Rad, Super-Tasty, Super-Easy DipTwo ingredients. That’s all you need to make a killer dip for chips, crudites, crackers, and everything else that might grace an hors d’oeuvres platter. One is our good friend chipotles in adobo sauce, and the other is cashews. That’s it. Add a little salt after all that nutty, spicy goodness comes out of the blender and you’re good to go. (Pro tip: That cashew-chipotle business makes a really good sandwich spread too.)Photo by Alex Lau, styling by Sean DooleyMake SalsaYeah, another dip. But this time we’re talking tomatoes. Adding chipotles in adobo to your favorite salsa recipe offers another layer of smoke, sweetness, and intrigue to the mixture of tomatoes and chiles. Think of salsa as a dream. Adding chipotles in adobo is the dream within the dream. That was an Inception reference, because we’ll take any opportunity we can to bring up a Christopher Nolan film.Alex LauDrink That StuffSeriously. The world’s most polarizing hangover cure loves a hit of chipotles in adobo. Bloody Mary’s were built for the smoke and spice of the rehydrated chipotles, just like your morning-after was built for sunglasses, Advil, and a little hair of the dog that bit you.Marinate The MeatsAgain, purée those chipotles and add them into your marinade of choice, whether you’re working with a soy and brown sugar situation, or something more along the lines of an herby, lemony zinger. A little heat never hurt anyone. Unless you accidentally touch your eyes after touching the chiles. That hurts.© Marcus Nilsson  www.marcusnilsson.comMake Other Already Pretty Good Sauces BetterYou can add puréed chipotles in adobo sauce to a heap of sauces for some extra spice and flavor. They’re great thrown into a barbecue sauce you already love or into some mayo to get you to that intersection of spicy and fatty. (That's right, you can make your own chipotle mayo at home.) Chipotle mustard. Chipotle ketchup. Chipotle tartar sauce. The world is your oyster.Alex LauRice, Eggs, Beans, Pizza, Wings, and Just About Anything ElseYou know the stuff you put hot sauce on? Like that salmon bowl up there? Yeah, you can just drizzle some pureed chipotles in adobo on them instead. It’s an easy substitute when your sriracha or gochujang bottle finally bites the dust.Now, why don't we make some soup?Vegetarian Chili With Lots of FritosQuick, spicy, filling, and made mostly of pantry ingredients, this chili/tortilla soup/frito pie mash-up is calling your name. (Shhh. Listen closely.) View RecipeThose chipotle short ribs looked pretty good, right?Explore Bon AppétitBasicallyChileChipotleAdoboRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-02", "author": ["Condé Nast", "Alex Delany"]}