{"id": "5aba4e3c93769a2014d7e74cd5e6a26f", "url": "https://www.bonappetit.com/story/its-not-about-the-pizza", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "It's Not About the Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIt's Not About the PizzaThoughts on red sauce restaurants and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroApril 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Are red sauce restaurants healthyish? Let’s not think about it too much. Yesterday Bon Appétit launched Red Sauce America, an ode to and exploration of Italian-American restaurants across the country. If you were raised (like I was) in a town brimming with these kind of joints, you might think you already know what this cultural phenomenon is all about. In that case, I challenge you to dig into the beautiful and surprising collection of stories here. Of course there’s Roxane Gay’s moving essay on finding a home—and a favorite red sauce restaurant—in Los Angeles. I also loved this piece by Chris Ying, who asks what it will take for Chinese-American food to assimilate the way Italian-American food has. Read Hilary Cadigan’s interview with Silvio, a waiter from Croatia who’s worked at the same red sauce restaurant in Williamsburg since the ’70s. And Mike Sula’s profile of Arturo Aucaquizhpi, the Ecuadorian immigrant carrying on the red sauce legacy in Chicago. And if you want to know about the go-to Italian place in my hometown, probably don’t read this piece about my three decades at Sergio’s, because it has nothing to do with the (very good) pizza. But, going back to my opening question, Sergio’s did have a really great salad bar.This Week on HealthyishHave you heard of the climate diet? It’s hard, it’s expensive, and it’s the way we’ll probably have to eat in the not-too-distant future. Alejandra Borunda tries the diet for a week to get a peek at what’s to come. Uh, until then, how about some chicken with schmaltzy rice?! Chris Morocco adapted the recipe from Fancy Nancy in Brooklyn, and it’s definitely a plate-licker. (Don’t worry, there’s a lot of kale in there too.) Is it weird that I want to plan a trip to Florida just to check out a home goods store? Zoë Sessums, proud Florida native, reports from Yield Work Shop in St. Augustine.What I’m ReadingAriel Levy’s The Rules Do Not Apply. What’s the difference between solitude and loneliness? The link between what we eat and our mental health. The whole Belief issue of Topic, but especially these ten scammer stories and this essay about moving away from Christianity and toward a different kind of faith.What I’m CookingJust kidding. I moved this week, and cooking is still an impossibility. But I have to tell you about these pot racks I installed yesterday, which are bringing me great joy and extra cabinet space. And The Home Edit, which came into my life at just the right time and has provided me with almost too many great organization ideas.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyish NewsletterHealthyishessayRead MorerestaurantsMy Three Decades of Pizza at Sergio’sBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Amanda Shapiro"]}