{"id": "5ac484b2699c53f5a7b111c9d8e75ca0", "url": "https://www.bonappetit.com/story/vegan-coconut-tapioca-pudding", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "This Tapioca Pudding With Chia Seeds and Coconut Is The Perfect Vegan Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Vegan Chia Tapioca Pudding and Just Chill OutThere's no problem this super creamy, make-ahead pudding can't solve.By Claire SaffitzJanuary 26, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThis coconut chia pudding recipe was very much inspired by the one at Bunker, which was the only dessert on the menu when I visited. It relies on subtle flavors like tapioca and coconut milk, but it’s still rich, delicious, and hard to stop eating. Bunker’s recipe uses some ingredients that can be harder to find, so we sort of reverse-engineered our own version. There is a lot of coconut in this, between the reduced coconut milk and coconut meat, which creates a really nice richness without using any cream. In fact, this recipe just happens to be vegan.The tapioca isn’t quick cooking, so you need to have a bit of foresight to soak it in advance, but that’s truly the hardest part. Make sure you soak the tapioca and chia seeds separately—if you soak them together the dessert will be too thick.  The next day, reduce the remaining coconut milk with salt and agave, then add the drained tapioca pearls and stir to bring the pudding together.When your base is set, let it cool and stir in your toppings: soaked chia seeds, coconut meat, and pineapple. This recipe calls for white chia seeds, which is really so the pudding looks uniform without any big black speckles. If you can’t find white chia seeds, the black ones will still provide texture: a little subtle pop each time you bite into one. And the pineapple is acidic and a little sharper, but it’s also still pretty sweet. You do have to find fresh coconut—I think that texture really makes the dessert. The flesh is firm and kind of chewy, with a very refreshing flavor that’s also fatty and rich.After adding all those delicious toppings, the pudding just needs to chill until thickened and cold. Just before serving, give it a good stir and top each bowl with mango, shredded coconut, more pineapple, and a drizzle of agave. If you love coconut and tapioca, you will love this. It’s a really refreshing dessert, and so easy to make ahead because it’s served cold. Keep this in your back pocket for the next time you have people over—or when you want a big batch of something sweet for yourself.It's pudding time:Coconut Chia-Tapioca PuddingIf you love the texture of chia pudding, it gets even closer to bubble tea with the addition of tapioca pearls here.View RecipeExplore Bon AppétitHealthyishDessertVeganTapiocaCoconut MilkCoconutMake AheadPuddingHealthy DessertsRead MorecookingThe Simplest Coconut-Chocolate Mousse Just So Happens to Be VeganBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Claire Saffitz"]}