{"id": "5aca0b0abe8125ae6c2b9f0cb42a21b4", "url": "https://www.bonappetit.com/story/seasonal-produce", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Do You Really Need To Cook With Seasonal Produce? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOkay But Do You Really Need To Cook With Seasonal Produce? Because tomato season is over but your BLT craving is not. By Tyler KordOctober 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailShopping for food (not to mention cooking and eating it) can be confusing. So in Unprofessional Advice From a Professional Chef, we ask Tyler Kord (the professional chef) the hard-hitting questions.Q: Do we really need to cook exclusively with seasonal ingredients?A: Honestly, you don’t need to do anything!That’s not totally true, you need to drink water and occasionally eat food—but I think that is all you really need to do. And if that food is a vegetable that was grown someplace close to where you are, then that is way cool and I am happy for you. You’ve supported a local farm, which is a part of your local economy. Even though I’m a socialist, I am also a business owner (which tests my benevolent instincts on a daily basis) and I understand the need to support your local economy, at least until we figure out how to either tax or compost the rich. Also, the thing you’re eating didn’t need to be flown a million miles from Chile in order for it to get to you, and that just seems like a good thing, environmentally-speaking, even though growing produce in Chile, and then shipping it to your neighborhood to be stocked at a grocery store and, finally, purchased by you actually involves a ton of jobs and thus helps out a lot more people. But it’s not my job to worry about the global economy and maybe the systems just needs to change and Basically is not the place where you go to learn about how messed up the world is and what we can do to fix it—that is a magazine called Teen Vogue!So do you need to cook with seasonal produce? Absolutely not. I just mentioned some of the complications involved in the decision, but if you put all of the ethics aside, I think the best thing you can eat is the thing that you really want to eat, unless that thing is a donut, which seems like one of the worst—though most delicious—things you could eat. It’s just white bread dough that’s fried and coated in sugar and that would be fine except that unlike breakfast cereal, it comes with no fiber or iron or prizes. (That said, I let my 2-year-old daughter eat donuts all the time because it’s so cute when she says, “I want brown donut” and I’m not great at saying “no” to her because I love her so much that if she said, “Daddy, I want shark tattoo,” I would probably cave.)A tomato that has been shipped a long distance probably doesn’t taste as great as a local one that was just picked, but conversely, it’s not like everything you buy at the local greenmarket necessarily tastes better than the stuff at the grocery store. Most of the time it just gives you a feeling of superiority, which makes everything taste better. Other times, it actually does taste better. But I’ve had as many disappointing peaches, apples, and yes, tomatoes from local farms as I have from the grocery store because fruit does not care about my feelings and I can live with that, though I’ve learned that if my peach, apple, or tomato isn’t sweet enough, I can chop it up, toss it with a tiny bit of maple syrup, a few drops of lemon juice, and a few grains of salt and I can make even the dullest peach taste awesome, no matter what the season.And if you live in New York and you’re buying tomatoes in August at the grocery store and they come from Florida or Mexico and you think that you’re doing the right thing by buying in season, then I don’t think you’ve done a great job anyway. I’m not saying that to be mean, but I am saying that if that is your idea of eating with the seasons, then you may as well buy those tomatoes in January because they’re coming from the same place. That said, there have been all kinds of issues with tomato farms in Florida and Mexico exploiting labor and while they’ve taken steps to improve the situation, you’re probably already supporting those industries every time you go to a sandwich shop or burger joint anyway, so maybe you don’t need to go bring Big Tomato into your Aunt Carol’s Tomato Casserole at home. Oh my god, everything is so fraught! All of the choices are so complicated and I’m trying to write out some simple advice and it’s all so convoluted and I’m not even making sense and this website is supposed to be fun!!!I just went and drank a glass of water and I’m okay now.Let’s start over. Is there a farmer’s market near where you live? Go there and buy some stuff. Cabbage is virtually always in season at the market by my house and it’s super cheap and I love it. Oh, you don’t love it? Well, you’re an adult, learn to love it. I don’t love green beans. I don’t hate them either, but when I see them at the market I am just not particularly interested. And I was thinking about them the other day, because I am a chef and it’s my job to think about food, not because I can’t tell the difference between friends and vegetables, and I decided that now, at 41 years old, it’s time to get super into green beans. I think my issue is that I always try to keep them bright green and crunchy when in reality I want them to be soft and mushy and full of garlic and tomatoes that come from anywhere but Florida and served over rice and just thinking about them that way makes me excited to eat green beans, which is tragic because green bean season is  over!So maybe rather than trying to figure out how to get out of eating seasonally and locally, you could think about how to get into it. Like a hobby! And by doing that maybe you’ll learn to like things you didn’t used to be that into. And then you’ve grown as a person or whatever! And then in the dead of winter you can go back to eating whatever the hell you want, because up here in New York, there isn’t a ton of produce in the winter anyway and sometimes you just want a goddamn caprese salad and I think that you should have one. And a donut, too.Never out of season:Easiest Chocolate Birthday CakePure homemade birthday love. If you've got a bowl, a cheap hand mixer, and a couple of measuring cups, you can make this rich, chocolatey cake.View RecipeExplore Bon AppétitUnprofessional Advice From A Professional ChefRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Tyler Kord"]}