{"id": "5acf49a3ca961b92a29c1d09f3b795e8", "url": "https://www.bonappetit.com/story/keeping-ourselves-accountable", "year": 2020.0, "month": 6.0, "day": 3.0, "content": "Keeping Ourselves Accountable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKeeping Ourselves AccountableThree things we started doing right away.By Amanda ShapiroJune 15, 2020FacebookTwitterEmailFacebookTwitterEmailThis newsletter has historically been Bon Appétit’s Letter from the Editor. Starting now and until we have a new editor in chief, the BA and Epicurious staff will use this platform to update you on the work we’re doing to address racism and biases at the brands, both internally and in our editorial coverage. First up, acting deputy editor Amanda Shapiro on what happened in week one.Readers, viewers, subscribers, followers, and friends:How to describe all the feelings of the last week? I’ll never locate the right words, but here are some: outrage at the failures of our leaders; regret for our own complicity in racist systems; pain from airing months and years of pent-up harm; despair over the sheer amount of work ahead; awe at the opportunity we’ve given ourselves to change.Many on staff, including myself, felt that the statement we put out last week wasn’t as forceful or specific as it needed to be. But I also believe that a statement is only as powerful as the work we actually do. So, since then, we’ve focused on the work.That work happened in so many virtual meetings, in side conversations, and in private moments that I couldn’t pretend to know about or capture. So I won’t speak for all of us, but here’s my perspective on some of the work that happened this past week, and what we’re prioritizing in the weeks and months ahead.We did a lot of apologizing, and we have more to do. Both publicly and in private, I and other white staffers have apologized to our Black staffers and staffers of color for the culture we perpetuated in our offices. We’ve made personal apologies to freelance writers, contributors, and former staffers too. We recognize that we’ve lost a lot of trust among our peers, and these conversations are just one step toward regaining it.We demanded that our corporate leadership do better, and they’ve responded. We’ve had a lot of meetings with our company’s leaders, expressing our frustrations and asking for the resources we need to do better, including hiring more senior-level BIPOC staff, pay equity, transparency, investigations into wrongdoing, and training to help us build a fairer and more just workplace. The company is moving forward on some of these needs, like fast-tracking our search for a new editor in chief and prioritizing BIPOC in that search, but we know we have much more work to do.We created a manifesto for change and began to act on it. The staff has put together a document outlining specific steps we’ll take to change the culture at BA and Epicurious. We’re still refining the manifesto, but, in the meantime, we’ve seen some tangible change, like the resignation of our VP of video and a new process for handling internal investigations. We’ve also created working groups to tackle issues like reenvisioning our editorial content, addressing cultural biases in Test Kitchen videos and pay disparities among staff, expanding our pool of BIPOC freelancers, and—before we begin publishing their work—reaching out to writers, photographers, illustrators, and sources for their explicit consent. Those conversations are already happening and will continue forever because this work is never done, and that’s the point.There’s one line from our statement last week that I keep repeating to myself: We have been complicit with a culture we don’t agree with and are committed to change. To me, this line sums up the past week. It’s been a period of acknowledgment and commitment.I look forward to turning this newsletter over to the new editor in chief soon. But, in the meantime, there are so many people at BA and Epicurious doing meaningful work right now, and it’s important that their voices be heard. Next week and in the weeks following, you’ll hear from them in this letter. I join them in saying we are committed to doing better, and that work has already begun.Sincerely,Amanda ShapiroActing Deputy EditorExplore Bon AppétitLetters From the EditorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-15", "author": ["Condé Nast", "Amanda Shapiro"]}