{"id": "5ad15e9b3a6335df09f8cd5bf57e8cfd", "url": "https://www.bonappetit.com/story/how-to-keep-a-food-diary-without-losing-your-mind", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "How to Keep a Food Diary Without Losing Your Mind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Keep a Food Diary Without Losing Your MindSome helpful tips from someone who's done it for a very long timeBy Rachelle RobinettJanuary 6, 2018FacebookTwitterEmailIllustrations by Camilo HuincaFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.This month is my 10-year anniversary of keeping a food diary. I’ve used the same app (SparkPeople) the entire time, which makes browsing back through my phases—of paleo, raw, and too-many-tacos—both convenient and insightful. The app makes tracking macronutrients (carbs, fat, protein) simple, and it allows me to monitor more specific ingredients like fiber, sugar, or iron. (You can also track exercise and chat with other members in a community feed, but I’ve never used those functions.)Ten years of tracking makes me feel old, and compulsive, but also proud. Being the health-geek that I am, self-study is a source of endless fascination, inspiration, and exploration. It was especially interesting to track my transition from protein-at-every-meal to totally being plant-based, for example.The benefits of keeping a food journalFor the less data-enthusiastic, here’s some journaling motivation: simply keeping a food log can double a person's weight loss, if that's your goal. It's good for other things too:Food journaling can help you understand what’s pissing off your digestion, disrupting your sleep, or causing those afternoon energy crashes. The act of writing down what we eat and drink—and even just knowing that we’ll be tracking the trail mix—makes us more mindful of our consumption. It’s an excellent way to uncover invaluable details about our relationship with food, and to remind ourselves what we otherwise mindlessly munched on today. (I can’t count the number of times my clients have returned after a week of meal tracking with a revelation (like, I am totally addicted to almonds!) that is then theirs to choose to change, or keep.)This allows for accountability, but on your own terms. For some, a buddy-system is additionally helpful, so consider comparing notes with a friend. For others, the idea of sharing is a no-go, in which case you don’t have to show your diary to anyone, unless you’re my client.Great tools for journalingThe downside is that food journaling is another thing to do every day. But, there are apps for that. Obviously, I would recommend SparkPeople; it’s been so convenient for me over the last decade that I’ve never wanted to switch. Depending on your goals and aesthetic standards, there are a ton to choose from. MyFitnessPal and LoseIt are popular, and some newer apps on the market now positioned as macro-trackers are also great (e.g. Fitocracy Macros).The benefit of tracking digitally is that you can automate things (like saving meals or favorite foods) and save a lot of time. But they can be too obsessive for some. If you’d rather not track calories but still want to glean some broad-stroke insights about your intake, good old-fashioned paper is great, or a Google Doc, which I like because it’s accessible any time.Tracking can be quick, too. My daily entries now take less than a minute to enter. Beginning is the biggest time-investment, but over time, and especially with apps, it gets a lot easier.Some Tips Before You Get Started– Be honest! Not writing it down is just denial. (But if you do fib, you’re not alone: we tend to underestimate our calorie intake by up to 40%.)– Get to know serving sizes. For example: Three ounces of protein is as big as a deck of cards; a teaspoon is dice-sized, and a ping-pong ball-sized “scoop” of anything is two tablespoons.– It’s not all about the calories. Try tracking other things you care about or are working on, like sugar intake, energy fluctuations, or whether eating less protein actually makes you feel better. Tracking progress can be really motivating, in the same way that running a faster mile or lifting a heavier weight can be.– Consider recording how you feel, too. This ensures that it’s not just about calories (because it’s not!) but a more holistic look at a relationship with food. This is my favorite part about my clients’ diet tracking. We learn so much there. Like, your gluten-free bread might actually be causing that bloat. Avocados make you feel more full than meat. Breakfast is okay to skip because you’d rather have your smoothie in the afternoon when you’re in the mood for a treat.– Stay the course and know that it’s a new habit, harder to start than to maintain.The Hard Parts– Finding time in our busy schedules is hard when you want to start food journaling. If you’re the calendar-type, set reminders to record food a few times a day. Later on, you won’t need them. (Some apps have them built in.) For the schedule-averse try putting sticky-note reminders in your kitchen, at your desk, or wherever you tend to eat.– Don’t get caught up in the measurement details. It’s okay to estimate. If you’re not sure how many ounces something is, or what exactly is in the juicery’s smoothie, taking your best guess is allowed. So is asking your server what’s in what you’re ordering, which I do all over town.– Avoid obsession by not looking at your data until the end of the day or even weekly. Like with weighing yourself, daily fluctuations will occur.– I’d also suggest tracking your food as you’re eating it or immediately afterward. Waiting until the end of the day guarantees missed meals or food amnesia (which is actually a thing).Let's Do ThisKnow that there’s no best time to start. But, if you need some suggestions: Monday, the first-of-the-month, or right now are all great options. Give yourself a week to decide on a tracking method and how long you’ll track for (even if it’s just two weeks). Circle it in the calendar, mentally commit, then go! I guarantee you’ll learn something new about yourself.Explore Bon AppétitHealthyishFeel Good Food PlanRead MorecookingThis Recipe Will Turn All You Dinner Frittata Skeptics Into Total ConvertsBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-06", "author": ["Condé Nast", "Rachelle Robinett"]}