{"id": "5ad44617bac8058c5ebf6152bc419823", "url": "https://www.bonappetit.com/recipe/cucumber-and-melon-salad-with-chile-and-honey", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Cucumber and Melon Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCucumber and Melon Salad with Chile and HoneyBy Claire SaffitzJuly 10, 20184.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintConsider this salad more supporting evidence that, yes, you need a mandoline in your life. The shaved cucumber and melon will release some liquid and lose a bit of crunch after they’re dressed, so toss everything together just before serving.  If you’re truly averse to turning on your oven right now, buy roasted pistachios.Ingredients4 servings ¼cup raw pistachios½jalapeño or Fresno chile, thinly sliced2Tbsp. white wine vinegar1tsp. honey3Tbsp. extra-virgin olive oilKosher salt, freshly ground pepper1English hothouse cucumber, halved crosswise, then halved lengthwise, seeds scooped out with a spoon¼medium ripe honeydew melon or cantaloupe, rind removed5oz. ricotta salata (salted dry ricotta) or feta½cup basil leavesPreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 7–9 minutes. Let cool, then finely chop 2 Tbsp. pistachios. Leave remaining nuts whole; set aside.Step 2Whisk chopped pistachios, chile, vinegar, and honey in a small bowl. Gradually stream in oil, whisking constantly until emulsified; generously season dressing with salt and pepper.Step 3Using a mandoline, shave cucumber and honeydew lengthwise (or thinly slice with a knife). Place in a large bowl. Set blade to a slightly wider setting; shave cheese into planks. Add to bowl along with basil and reserved pistachios; drizzle dressing over and toss gently. Season with salt and pepper.How would you rate Cucumber and Melon Salad with Chile and Honey?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleLovely summer dinner. Made with Greek Mizithra cheese in place of ricotta salata. AnonymousIthaca, New York8/20/2019This is a fabulous recipe that really defines summer, but is still great in September.  I have modified the recipe by adding in some avocado and then any number of fish proteins:  grilled swordfish, seared scallops, Chilled grilled swordfish leftovers and even cooked shrimp.  This is just such a versatile recipe!  Thanks so much for putting it in the mag! AHM1961Maine9/19/2018Explore Bon AppétitSaladCucumberVegetableMelonFruitRicotta SalataRicottaCheeseChileSummerEasyQuickWeeknight MealsSideGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Claire Saffitz"]}