{"id": "5ad8261ea16eb71dcae8d18e2486f4b7", "url": "https://www.bonappetit.com/story/zucchini-lentil-fritters", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "These Zucchini Fritters Stay Super Crispy Thanks to One Ingredient | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Zucchini Fritters Stay Super Crispy Thanks to One IngredientDon't tell my mom I stole a trick from her Bengali onion fritters.By Sohla El-WayllySeptember 11, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailZucchini fritters aren’t a dish I’m ever inclined to make. They take the watery, bland summer staple to an all-time low, shredding the squash to oblivion and weighing it down with a stodgy mix of flour and eggs. Even if you do everything right—salt and squeeze the squash to draw out excess moisture and fry them in cast iron until crisp and golden—zucchini’s true nature comes through, the fritters growing dense and soggy as they sit.So when I was tasked with developing a zucchini fritter recipe even I could love, I stole a trick from my mother's Bengali onion fritters, piyaju. Instead of flour and eggs, they’re made with blended red lentils, which manage to stay wispy and crispy against all odds. Best of all, it's a one-ingredient batter (plus a few spices): no eggs or baking powder required.I start by soaking rinsed red lentils until they’re plump and soft before draining and blitzing them into a coarse puree in the food processor. This coarse batter is vital to the fritters final light and crunchy texture. Once cooked, the chunky lentil puree results in an open structure inside the fritter rather than your typical dense and heavy zucchini pancake. The barely blended lentils also create a rough exterior which crisps up with plenty of scraggly and craggy bits.For the squash, I ditch the classic shredding technique in favor of cutting them into thick and chunky matchsticks. The squash sticks are then tossed in salt and left to drain to remove some excess moisture, growing meaty and dense. These big pieces of zucchini don't lose their identity in the batter and instead remain distinct and tender once cooked.This is a zucchini fritter I can get behind. They remain epically crunchy long after frying and are anything but bland thanks to the nutty flavor of red lentils spiked with bright lemon zest and Kashmiri red chili. I couldn’t be happier with this new and improved fritter model. To all the zucchini haters out there: Give this one a try.It's fritter time:Zucchini-Lentil Fritters With Lemony YogurtThese crispy, crackly zucchini fritters take inspiration from the traditional Bengali onion snacks piyaju.View RecipeExplore Bon AppétitHealthyishZucchiniFritterLentilRead MorecookingThis Marinated Zucchini Recipe Is Changing the Way I Make All VegetablesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Sohla El-Waylly"]}