{"id": "5adc9d7ed2c65359267363e1b1b39155", "url": "https://www.bonappetit.com/story/electric-wine-opener", "year": 2021.0, "month": 8.0, "day": 5.0, "content": "I'm Done Being Ashamed of My Electric Wine Opener | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI’m Done Being Ashamed of My Electric Wine OpenerYes, I was a server for 10 years. No, I am not good at opening wine bottles, and this is my truth.By Tiffany HopkinsAugust 31, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.You’re probably familiar with the wine bottle up-sell at restaurants—the uncomfortable dance that occurs when you and your date each order a glass of wine and the server tries to convince you to buy a whole bottle. With my days as a server behind me (and no one to fire me for saying this out loud), I’m completely comfortable admitting that I was really good at down-selling wine. “Eh, are you sure you want that $120 bottle? How about a bright and zesty $8 glass of Pinot Grigio?” That’s because I sucked at opening wine. The anxiety of wondering whether I’d break the cork while struggling with my waiter’s corkscrew haunted me, and every time a party of five sat down to order, I prayed they’d want cocktails instead.My colleagues have told you that a wine key—that double-hinged corkscrew that other servers wield with ease and aplomb—is the only wine opener you’ll ever need. But in my opinion, the best way to uncork a bottle of wine is the way that doesn’t make you break out into a cold sweat. Today, I’m the proud owner of a Secura electric wine opener, and I open wine bottles with grace every single time. No twisting. No pushing. No pulling. I just press a button and the cork lifts out of the bottle seamlessly. It even comes with a separate foil cutter, so I don’t have to fuss with that tiny little pop-out blade on a corkscrew. I’ll admit that my Secura is initially met with skepticism and jokes, but as soon as my guests witness it at work—such speed! such luxury!—they are quickly converted.Secura Electric Wine Opener$30 at AmazonMy electric wine opener has a sleek stainless-steel finish that matches all of my other kitchen equipment, but you can find it in a variety of colors, like matte black and champagne gold. When it’s not in use, store it on its charging base, which is small enough to leave out on the counter. Did I mention the LED light that turns on while the wine opener is in use? Mine lights up in fluorescent blue. Does your waiter’s corkscrew come with a built-in Vegas-style light show?I still have a double-hinged corkscrew in my kitchen, because my boyfriend finds difficulty appealing (men, amirite?)—but I will never use one again. For me, drinking a glass of wine symbolizes relaxation and ease, while the very thought of opening a bottle of wine summons flashbacks of freaking out behind the bar at my last restaurant job. If you, like me, love wine, but hate opening wine bottles, this electric corkscrew will let you have your wine and drink it too.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-31", "author": ["Condé Nast", "Tiffany Hopkins"]}