{"id": "5aec0e3dd966c3ee40d4b3a40a4fc217", "url": "https://www.bonappetit.com/story/making-perfect-thanksgiving-sides", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "The Perfect Thanksgiving Brussels Sprouts and the Only Salad You Need This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perfect Thanksgiving Brussels Sprouts and the Only Salad You Need This YearA good side needs to do two things: Be low-effort and offer something new, just like these guys. By Alex BeggsNovember 6, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how the Squash and Radicchio Salad With Pecans and the Brussels Sprouts With Pistachios and Lime came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamChristina Chaey and Claire SaffitzThe ChallengeA good side needs to do several things: It needs to be low-effort, but it should also veer off the beaten path (something spicy! Ingredients your guest may have never tried before!). It’s also a prime opportunity to add texture to an otherwise mushy-in-a-good-way meal. Oh, and “vegetables.”The SolutionExhibit A: This squash- centric salad with an irresistible pecan dressing and hardy radicchio that refuses to wilt. Exhibit B: Roasted whole brussels sprouts that get so crispy on the outside you’ll worry they’re burnt (they’re not!), coated in a date molasses– brown butter glaze.Watch Claire and Christina make the perfect Thanksgiving sides\nMeet the 898This palm-size squash, a new cousin of the beloved honeynut developed by vegetable breeder–mad genius Michael Mazourek, tastes like a turbocharged butternut, making you question every squash you’ve ever had before. It’s now rolling out at farmers markets, select grocery stores, and online grocers across the country. If you can’t find it, honeynut or butternut will also work fine.The tiny 898 squash, up close and personal.\nPhoto by Alex LauDried Fruit Vs. Fresh FruitChristina and Claire knew they wanted to add sweetness to the salad, but how? Dried cherries and apricots were early contenders (they’re easy to find and always in season), but Asian pear won out. The dried fruit was chewy; the pear was juicy, a better counterbalance to the other ingredients. All of the crisp elements make “this salad a welcome respite from gravy and buttertown,” says Christina.Do-AheadRoast the squash a day before, store it in the fridge, and warm it up in the microwave or leave at room temp when serving.Get the recipe:Squash and Radicchio Salad With PecansThis squash-centric salad has an irresistible pecan dressing and hardy radicchio that refuses to wilt.View RecipeHalve Not Your Brussels SproutsWe start the brussels at a high heat to get the outer leaves charred and crackling, then lower the heat to finish. Keeping the brussels whole traps in steam, so the centers get creamy without drying out. It’s a nice ~textural contrast.~ “They should be mushy on the inside, and mushy isn’t a bad thing,” says Claire. “I don’t want al dente brussels sprouts.” Use small to medium-sized sprouts, the giant ones will take longer to cook and you’ll risk (actually) burning the exteriors.Christina Chaey and Claire Saffitz during the filming of Making Perfect.\nPhoto by Emma FishmanThe Ingredient: Date MolassesTypically made from dates and nothing else, date molasses brings a deep, fruity sweetness and a bit of tartness. Its thick consistency means it makes an easy, near-instant glaze. The test kitchen uses Al Wadi Al Akhdar brand, but you could also use this 100 percent date syrup.Buy it: Al Wadi Al Akhdar Date Molasses, $13 on AmazonGet the recipe:Brussels Sprouts With Pistachios and LimeThese roasted whole brussels sprouts get so crispy you’ll worry they’re burnt (they’re not!). Then toss ’em in a date molasses–brown butter glaze.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitFallMaking Perfect: ThanksgivingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-06", "author": ["Condé Nast", "Alex Beggs"]}