{"id": "5af552ddc803cb85cc72c08f316c551a", "url": "https://www.bonappetit.com/recipe/roasted-eggplant-and-pickle-dip", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Roasted Eggplant and Pickle Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueRoasted Eggplant and Pickle DipBy Lauren SchaeferMay 17, 20185.0(9)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintPlenty of creamy Greek yogurt keeps this baba ganoush-esque dip light and tangy. Briny half-sour pickle bits provide bright pops of contrast, but any chopped pickle-y thing—think spicy peperoncini, giardiniera, or full-sour cukes—would work great too.This recipe is presented to you by Samsung.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketMedium Bowl$17 At AmazonMicroplane$16 At AmazonSpoon$24.69 At AmazonIngredientsMakes about 2 cups1medium globe eggplant (about 1 lb.)2Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt1half-sour pickle1garlic clove¼cup plain whole-milk Greek yogurt4sprigs cilantroPita or flatbread (for serving)PreparationStep 1Preheat oven to 450°. Slice 1 eggplant in half lengthwise, then score cut sides in a crosshatch pattern.Step 2Place eggplant on a rimmed baking sheet and drizzle all over with 2 Tbsp. oil; season with salt. Arrange cut sides down and roast until cut sides are dark golden brown and skin sides begin to collapse, 12–18 minutes. Let cool.Step 3Meanwhile, do a little prep. First, finely chop 1 pickle. Transfer half to a medium bowl; reserve remaining half for serving.Step 4Peel 1 garlic clove and finely grate with a microplane into bowl with pickle. Add ¼ cup yogurt and stir to combine.Step 5Pick cilantro leaves and tender stems from sprigs and coarsely chop; set aside for serving.Step 6When eggplant is cool enough to handle, turn cut side up and scoop flesh onto cutting board. Coarsely chop eggplant until mostly broken down, then add to bowl with pickle mixture, leaving any excess liquid behind. Season with more salt and stir to combine.Step 7Place pita directly on oven rack and toast 1 minute. Cut into quarters.Step 8Top dip with reserved pickles, cilantro, and a drizzle of oil. Serve with pita alongside.How would you rate Roasted Eggplant and Pickle Dip?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleWow! This recipe was amazing, even to someone like me who doesn’t like eggplant! I used dill pickles instead of half sour and it was still delicious. It came together in 10 minutes and was gone in the same amount of time. Anonymous10/5/2020HUGE hit at the Christmas party. One change I'd make is even less garlic. The raw garlic was so intense it was almost spicy. Not ideal for parties where you might not want to smell like a garlic clove. Other than that, absolutely loved it! Making it again right now. kenzieforrestcanton, ohio12/24/2019Loved it! \nDesislava11/4/2018Thoughts on how to incorporate the eggplant skin?allilankNYC6/12/2018Wonderful idea with eggplant, just love it. And the article is user-friendly. It also good for vegan people.ArianaSullivanLos Angeles, USA5/25/2018Explore Bon AppétitDipEggplantVegetableQuickEasyStarterSnackVegetarianRoastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Lauren Schaefer"]}