{"id": "5af6669d3aa807a6c5d6f396bc72b3df", "url": "https://www.bonappetit.com/story/crispy-chicken-thighs-rent-week", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "These Crispy Chicken Thighs Are the Only Way to Start the Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Crispy Chicken Thighs Are the Only Way to Start the YearChicken thighs, with garlic-honey, are here for the first Rent Week of the year. Breathe. You're in a safe space now.By Alex DelanyJanuary 5, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailMy wallet is not doing well. To be completely frank, it's more depleted than my iPhone's battery after a new software update. That’s what the holidays do; they strip your checking account clean in the name of love. I bought presents for my family, because I love them. I threw a New Year’s Eve party and cooked a large (expensive) piece of pork shoulder for my friends, because I love them. I went to get beers and dinners and lunches with my high school homies while back in Philly, because I love them. And now I have to face the music. It's Rent Week. I have to pay January’s rent.And I also have to eat.So I've got some crispy, garlic-honey chicken thighs coming in hot. And there’s this Back on My Bullshit playlist (free of charge) to groove to while you’re making them. Now, let’s turn the oven to 425°, place 1 large head of garlic (wrapped in aluminum foil) on the rack, and confidently scream something encouraging, like THIS CHICKEN WILL PROVIDE ME WITH THE EMOTIONAL SUPPORT I NEED TO SLEEP SOUNDLY THROUGH THE NIGHT, into the abyss.While the garlic roasts for about 30 minutes, prep 5-6 bone-in, skin-on chicken thighs and slice some scallions. Pat the chicken thighs dry with a paper towel, to maximize crispiness. Season the outsides with kosher salt and freshly cracked black pepper, and coat the skin sides with a little bit of olive oil. Thinly slice the white ends of six scallions. Slice the wider green ends and set them aside for serving.Heat a skillet (cast-iron if you have it) over medium-low heat. Place the oil-coated skin sides of the chicken thighs down into the pan, and let them cook for about 5 minutes, until the rendered fat from the chicken covers the bottom of the pan. Once you get that shallow schmaltz-y pool (no diving, please), turn the heat up to medium-high, and readjust the thighs so the fat gets underneath. Cook the skin side of the thighs in the schmaltz until deeply browned and crispy (for about 10 minutes). Turn off the heat, flip the thighs onto the uncooked side, and throw in the sliced white ends of the scallions. We’ll be back for you, chicken.Photo by Chelsie CraigThis is a chicken recipe, but I’m not going to leave you standing in the kitchen with just some crispy thighs, roasted garlic, and pan sauce. Let’s make something to put them on. Rice works. Beans work too. But I like polenta for any and all saucy meats. You can find a formal polenta recipe right over here.While you cook the polenta, grab a leftover glass of wine or beer from the New Year’s Eve party you threw. Didn't throw one? Tap water will do. Hydration is important. Take the bulb of garlic from the oven and slice it in half from side to side, exposing cross-sections of each clove. Squeeze the now-soft cloves into a bowl (after letting them cool for 5 minutes). Mash the cloves into a paste with a wooden spoon, and squeeze about ¼ cup of honey over top (you can just eyeball this, because scraping honey off of anything is the worst. If you're a but...I need a measurement, type of person, hitting your measuring cup with a little layer of oil will make the honey slip right out. Mix the two with a spoon, until blended.Spread the garlic-honey mixture on top of the chicken thighs (which are still in the pan). Don’t go crazy. A light layer will do, and you need to save a little bit for your pan sauce. Throw the skillet into your oven (which is still at 425°), and cook the thighs until the honey caramelizes, and the chicken is cooked through to 165°, about 15 minutes.Photo by Chelsie CraigMove the thighs from the skillet onto a clean surface, not that plate that's been hanging in the sink for the last three days, and place the skillet over medium heat. Melt 3 Tbsp. butter into the pan. Add the remaining honey-garlic mixture and a couple glugs of white wine vinegar, stirring to remove the crispy chicken bits from the bottom of your pan. This will only take a couple minutes, no need to bring this to a simmer. Look at you. You have made some tangy, sweet, garlicky pan sauce. Fantastic.Scoop some creamy polenta into a bowl, load up a chicken thigh, give the whole damn thing a nice spoonful of sauce. Top it all with pepper, flaky sea salt, and sliced green scallions. Eat it. Finish it. Go for another bowl. Feel good? Proud? Satisfied? Maybe even happy? Let’s chase that feeling this year. Forget your old resolution. You have a new one—seeking happiness through crispy chicken. And maybe figuring out how to hire an accountant.Oh. You want more chicken thighs? Of course you do.Explore Bon AppétitBasicallyRent WeekChickenPolentaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-05", "author": ["Condé Nast", "Alex Delany"]}