{"id": "5b0d628dd9ebde0e8456507ed8db15a6", "url": "https://www.bonappetit.com/story/win-son-fried-eggplant", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "All Day I Dream About Win Son’s Fried Eggplant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAll Day I Dream About Win Son’s Fried EggplantI’m salivating as I type this.By Emily SchultzApril 22, 2019FacebookTwitterEmailPhotograph by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I was younger, I used to go to sleep dreaming about the boys I had a crush on. There was Eric who played the guitar at my summer camp, Jared who was in all of the school plays with me, and Mike Delfino from Desperate Housewives. As I got older, my fantasies changed. Maybe I got more cynical, or maybe my priorities have just changed for the better, because now I dream of Win Son’s fried eggplant. Trigg Brown, head chef at the Tawainese-American restaurant in Brooklyn, drew inspiration from the cold eggplant dishes you’ll find in markets in Taiwan, where the nightshade is steamed, marinated, and then served next to century-egg frittatas. For his restaurant, he decided to serve it warm, fried in a rice flour dredge and then dusted with salt and MSG, plated with a swoosh of labne and Chinese five spice–dusted cashews. The creamy-and-never-bitter interior paired with the light fry on the exterior makes the dish alarmingly addictive—kind of like the rest of the food the very inventive Win Son turns out. But in terms of dishes to dream about, the eggplant is my No. 1—and the real reason you’ll hear me throwing the restaurant into the pool of “so where are we going for dinner tonight?” options every. Single. Time.Go there: Win SonExplore Bon AppétitHighly RecommendTaiwanBrooklynRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-22", "author": ["Condé Nast", "Emily Schultz"]}