{"id": "5b0e5e2cc1cea87178fc082d5f508059", "url": "https://www.bonappetit.com/story/easy-fall-cocktails", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Two Easy Fall Cocktails That Are Better Than Mulled Cider | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMulled Cider Is Cool—But Have You Ever Had A Rattle-Skull? Good riddance to everything from the colonial era except these two cocktails.By Al CullitonOctober 18, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.Sometimes here at Happy Hour with Al, we give you a break from shaking and stirring with an easy concept for a boozy get-together at your place. Today, we’re making a couple drinks that would’ve been available in taverns 250 years ago because a) they’re super simple, and b) they’re very much in the fall spirit—with dark spirits, cider or beer, and warming spices like ginger and nutmeg.But first, a little history. Back in the 1700s, the tavern was a massively important institution. It served the public as a bar, restaurant, post office, court of law, trading post, and, as you may or may not remember from high school history class, a place for plotting revolution against tyrants. Patrons drank straight beer, cider, or liquor, but by the end of the eighteenth century, many of their favorite beverages were mixed drinks. These were often mixtures of beer or cider and spirits, like rum and brandy, plus a combination of citrus, sugar, spices, and/or eggs. They were what I’d call “proto-cocktails”: They weren’t in the category of modern cocktail, which was born sometime around 1800, but their existence presaged the rise of the great American cocktail.Lucky for us, all of these ingredients are widely available today, which means we can recreate them without having to track down any elusive ingredients. And I’ve got to say, this spread is a lot more original than mulled cider or wine.So here’s the idea: Put beer and cider on ice and set it on the table along with a bottle opener, rocks and/or Collins glasses, lime juice and wedges, ginger-honey syrup (I’ll tell you how to make that below), nutmeg (don’t forget a Microplane), and a bottle of rum or brandy. Everybody can help themselves and get lost in the fall spirit with as much ginger, nutmeg, and rich flavors their hearts desire. We advise that you and your guests start with the two colonial-era recipes below—namely, the Stone Fence and the Rattle-Skull—but if you’re adventurous, try your hand at some different combinations.Let’s get started.Photo by Chelsie CraigYour Shopping List1 bottle of aged rum and/or good brandy (Don’t skimp on this! Bad brandy is really bad! Look for Pierre Ferrand Cognac or the California brandies Bentwing or Bertoux)1 six-pack porter ale (Founder’s is very good and widely available)4 cans good, dry hard cider (I use Shacksbury)HoneyGinger8 limes1 whole nutmegThe PrepWe’re going to make a quick ginger-honey syrup. (It’s not that hard, I swear! Oh, and you don’t need ginger syrup and limes for the Stone Fence so, if you’re feeling thirsty already, fix yourself one of those while you prep!)Coarsely chop ½ cup ginger. In a small saucepan, combine ginger, 1 cup water, and 1 cup honey. Bring mixture to a boil, then turn heat down and simmer for 10 minutes. Remove from heat, cover, and let sit for 15-20 minutes. While you’re waiting, squeeze the juice of about 6 limes and cut 2 more into wedges.Strain out solids from syrup and pour into a jar. (Refrigerate if not using in the next couple of hours. Same goes for the lime juice and wedges.)1. The Stone FenceFor such a humble mixture, this drink has a pretty notable history. Ethan Allen and the Green Mountain Boys fortified themselves with a great many of these before raiding the Red Coats’ stronghold at Fort Ticonderoga in 1775. They were victorious (and maybe a little tipsy). Who knows where we might be without this simple blend of rum and cider.To make it, add 1 oz. aged rum to a glass. Top with cider. Give it a little stir. Grate nutmeg on top if you wish. (Allen probably didn’t have time for the nutmeg, but you do.)2. The Rattle-SkullPhoto by Chelsie CraigI am really into this drink. People think it doesn’t sound good. But those same people, upon tasting it, are totally blown away by how damn delicious it is. For me, this drink brings together all the good feelings from those autumnal field trips to Plymouth Plantation, but with the fun of it being, you know, a drink.To make it, combine 1 oz. brandy or rum (or do ½ oz. of each), ¾ oz. lime juice, ½ oz. ginger-honey syrup, and a pinch of salt in a glass. Give it a quick stir and top with porter. Garnish with fresh nutmeg and a lime wedge.Time to get the sweaters (and the tricorner hats) out of storage! Oh, and some tankards. After all, you’re running your own tavern now, you should probably invest in some good tankards.Oh, you're still in summer mode?This Rum Punch Is Too Good To Save For SummerRum punch is anytime punch.View StoryAl Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-18", "author": ["Condé Nast", "Al Culliton"]}