{"id": "5b10395e94bcb943d36825a3b6b9df22", "url": "https://www.bonappetit.com/story/lean-cuisine", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Lean Cuisine And Making Amends With My Mother | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMaking Amends With Lean CuisineGrowing up with a single mother who was disabled, I often fed myself. Now I’m doing my best to feed her.By Mariella RudiOctober 7, 2020FacebookTwitterEmailIllustration by vacacionessssFacebookTwitterEmailIt’s 8:30 p.m. on a school night. Seinfeld plays in the distance. Maybe it’s The Simpsons. You’ve been holding onto your hunger before the last meal of the day, because intermittent fasting doesn’t exist yet. You walk over to the top-freezer and pull out an icy Lean Cuisine and stab the cellophane film with a fork as hard as you can.Four minutes later, you carry the sweaty black plastic pie chart to your desk and stare at Facebook, smashing that refresh button over and over (you’ll do this for the rest of your life). The steam from the 260-calorie microwave entree opens up the whitehead-army occupying your forehead as you scroll through another “Mobile Uploads” photo album, hovering over faces, clocking names. You smell hot turkey water. You take your first bite, staring anywhere—screen, window, carpet—except at what’s right in front of you.The thing about Lean Cuisine is that you had to look at the picture on the box while eating it. Self-deceit was the only way to convince yourself that the low-calorie frozen entree didn’t taste like homework, Facebook photo albums, syndicated reruns, nights home alone, and, actually, hunger. (This was when TV dinners became desktop dinners but before lunch al desko and breakfast con smartphone.) With Lean Cuisine, you never knew if you were going to burn your tongue or hit a cold patch, but you could always count on feeling bad about yourself.That you were never really satisfied with Lean Cuisine, just like you were never really satisfied with your body or school or friends or life, was the reality of being a teenager in the mid-2000s, before Kim Kardashian came out from Paris Hilton’s closet to give us permission to eat a complex carbohydrate. Before Instagram taught us to ditch microwaves and calorie-counting in favor of organic, locally sourced whole foods. Before Uber. Before Postmates. Before Whole 30, we had Lean Cuisine.Growing up with a single mother who was disabled, I often fed myself. Groceries came from the EBT-friendly CVS and 7-Eleven. Anything Michael Pollan ruled about food, we did the opposite. There was no meal time, nor dinner table. And you always, always finished what was in front of you. In our bizarro version of Gilmore Girls: Los Angeles, we moved away from comfort and family in San Francisco to Los Angeles, where my mom had dreams of acting and sun. We lived in Dingbat apartments like the ones in The Slums of Beverly Hills, a mother-daughter duo a la Mermaids or Absolutely Fabulous (or Thirteen later on).The pell-mell of life with a mom with a bad back, among other things: one-bedroom apartments; newspapers—sometimes with my own bylines once I started writing for the school paper—strewn all over the floor for dogs to use; clothes that never belonged to a hanger or drawer; furniture from the street; an entire bathroom cabinet dedicated to orange prescription bottles. Marguerite Duras said “all childhoods and in all the lives that follow them, the mother represents madness. Our mothers always remain the strangest, craziest people we've ever met.” The kids are usually the last to know.Killing my mouth on a hissing Lean Cuisine activated the same synaptic response as cutting my cheek on a Tangerine Altoid or cremating my palate on a McDonald’s apple pie. It just hurt so good. Conditioned on a grade school diet of Flamin’ Hot Cheetos and Warheads, we were trained to eat through the pain because the taste was somehow always worth it. We nuked our taste buds why? Because it added a certain piquancy to recess. Because, we learned, food wasn’t always satiating. The social currency that a bag of bloody corn chips held on the playground was like showing up to school with NSYNC Hit Clips dangling off a fresh Jansport. We were all jonesing, catching the flash of a metalized bag and turning into little Tyrone Biggums begging for, come on, just a taste, man.By middle school, most of us started to take action against ourselves. Our brains ingested the commercials and magazine covers as instruction manuals for how to hack growing body parts. Moderation became the deal. If you were going to have “junk food,” you got a single, 120-calorie snack pack for lunch, and that was it. In 6th grade, I ate a one-ounce bag of Corn Nuts-Chile Picante con Limon for lunch every day. That’s it. With braces.It was the era of get-slim-quick marketing, 2-in-1 shampoo and conditioner equivalents that promised results on a budget, in the comfort of your own home. Jetson-esque inventions like Bowflex, Hydroxycut, Nutrisystem were the songs of promise; their commercials always sold the stuff you can’t buy. It was the last days of the war against fats and carbs, and mom was combat ready. Her kitchen—once home to cheap, filling meals like spaghetti bolognese and boiled, buttery potatoes—became an armory for meal replacement plans, 100-calorie snack packs, and portion-controlled, Atkins Diet-approved frozen meals. The dinner table became an unkempt desk. Meanwhile, my mom and I were leading increasingly separate lives. A teenager versus a single woman, both waging their own private battles against their hips.Daughters learn the best tricks from their mothers. We’re never not watching, learning through osmosis. There are the familiar and predictable memories: watching her apply makeup in the bathroom, matching clothes to shoes to scarves, doggie bags from date night. There are other memories. Sleeping all day, mood swings, doctor visits and operations, helping her off the couch to the bed, a standing date with the emergency room. I knew my way around the Cedars-Sinai parking lot. It’s a specific loss of innocence when your parent has to reassure you, puffy and muffled and slurring, that she’s all right, and you know she’s not, and you’re the only other person in the house, and you’re 12. So, you slide open a Lean Cuisine and do your homework and distract yourself with a screen until your eyes burn and you can fall asleep.Consider the 21st-century latchkey kid. The sound of the AIM door opening and closing was as good as the front door. Every click, beep, and buzz triggering the same activities in my developing circuitry as an actual experience. A T-Mobile Sidekick was your sidekick, a friend online was a friend no less. Offline, I noticed whispers from other moms. Pitying (or worse, disparaging) eyes from administrators. Teasing from classmates. It was one thing to have a single mother. But one who didn’t look or act like the other ones? That was a specific kind of shame, one that turned into fear every science fair or parent-teacher night.I found refuge after school and on weekends at friends’. Even if their houses were modest or outdated, the kitchens were always somehow remodeled, the family’s first and best investment in the home’s resale value and elusive “joy score.” No white stoves, no popcorn ceilings. “Kitchens sell houses,” as the real estate adage goes. When parents screamed that they couldn’t afford new shoes or toys, their pantries and appliances said otherwise. Fruit bowls on kitchen islands burst with fresh produce. This message was amplified inside the fridge: raspberries, lox, avocados—all the shit my mom told me to put back when I tried to sneak it into the shopping cart. I was the sitcom freeloading best friend; you could find me in your kitchen, eating your food, tacitly repaying the favor by making your kid laugh and letting them copy my homework.At college, women in my dorm had fewer hang-ups about convenience meals; it was just cheap gas—it got you to class or parties or wherever you needed to go. For the first time in my life, diet food and junk food held no distinction. My Texas blonde roommate, who spent “Big Daddy’s” money with drunken abandon, would chuck a 350-calorie Chicken Sesame carton at my head like some petite Guy Fieri when class was over, as if to say, eat up so we can trash our bodies like Dasani water bottles later tonight. Then, at 2 a.m., lips stained with Sigma Juice, there was always a Celeste Pizza or the Big L.C. waiting for us in the mini-fridge. In food, in substances, and in sex, we found agency over our bodies, even if that sometimes meant destroying them.This was also around the same time my mom first went to Narcotics Anonymous. I wish I had the magical formula for this self-propelled change, whether it was a symptom of empty-nest syndrome, or the line between pain-related dependence and addiction that had once again become unrecognizable. But when I was 18, for the first time in a long time, she was “all there.” I felt a sort of pride in bringing her around friends, showing her off. My puberty and her middle age weren’t at odds with each other anymore. Detox had brought a lightness to her body; she looked more beautiful than ever. She was working the program, going to meetings, and celebrating sober birthdays at bowling alleys. I read her NA literature, finding a new home in the words that finally explained why my childhood looked different. What I had lost and what I would never have. The addiction narrative, I was learning, fit squarely in our fragmented story. In dysfunctional or chemically dependent families, the parent-child relationship roles are reversed—like Freaky Friday but in the horror/drama category. The child becomes the parental or “hero” figure, and assumes a lifelong part that becomes, at best, a punchline at dinners, and, at worst, a throughline in all intimate relationships. Despite behaviors like excessive worrying, trust issues, and people-pleasing learned by rote in childhood, many codependents become self-reliant from an early age, determined to recreate and fix whatever was once out of their control. “‘You’re so mature for your age.’ ‘Thanks, it’s the trauma,’” go the memes.She stopped going to meetings a few years ago. Cultish, is what she called it. She doesn’t live within routines or anniversaries, never has. Addiction and pain are a tragic pair. Chronic pain functions beyond fatalistic binaries, unlike the program, where you’re either clean and sober, or you’re not. After all the surgeries and therapies, we’ve learned that there is no quick-fix, just good days and bad days. I try to remember all this as my mom’s bad back has devolved into a bad heart, bad stomach, bad nerves. It’s a kind of detached empathy, stopping my head-shake as I pick up broken glass from last night, again.Today, I go to the farmers market for raw, organic produce, then to the local butcher for free-range chicken, and onto Erewhon (which makes Whole Foods look like Whole Savings) for all the other high-margin, bougie products I’ve come to fetishize. Same with cookware; I’ve bought it all, researching for months, sometimes years, what’s top-of-the-line, the most pedigreed. I make lattes in the morning with my Breville Barista Pro built-in grinder and steam wand. I bake bread and simmer soup in glazed, $500 dutch ovens. I have a KitchenAid Stand Mixer that I didn’t even need a wedding registry to get.I bring all the leftovers to my mom’s. I want to impress her, maybe atone, but mostly, I want to feed her. I want to inspire the home cook I’ve heard existed before me, the one known for her lasagna, according to family lore. I’ve never tasted it. Yes you have, she tells me. (I really haven’t.) When I visit, I sweep through her cabinets and freezer, throwing out anything owned by Kellogg’s. I show her the contraband I unearth: Oreo’s, Cheddar & Sour Cream Ruffles, Red Vines. The good stuff I keep for myself. Meanwhile, I keep an eye on her pills, which have graduated from below the bathroom sink to an entire drawer in, guess where, the kitchen. I slide the drawer open and shut in the swift movement I’ve practiced all my life. I text her salubrious recipes and “food-as-medicine” articles. I buy her the $12 yogurt she likes, in all flavors. Because that’s what a good codependent child does.Unlike my mom, I’m on a heady revenge tour with food. A tormented project cook, I make everything from scratch: sprinkles for three-layer cakes with marshmallow buttercream, four-day sourdough bread for garlic-rosemary croutons, wafers to go in banana pudding with Tahitian vanilla mousse. Baking has become the best control there is, while attempting to rewrite my childhood with a Tartine cookbook. On the good days, our issues stop at food. Because it’s kind of cute and funny when she texts me that she “needs” a burrito (which, actually, I can respect). I love what has become her sing-songy, Lucille Ball-type catchphrase that she only eats this or that “once in a whilllle.” Narratively, how sweet it would be to describe in words that she learned to roast a chicken, she never took another pill again, she now takes care of me through cooking. But that’s not the truth. I know these habits don’t stop at eating. I also recognize that no matter how much I nag, police, complain, supervise, cry, plan, barter, sneak, placate or any other maneuver I have in my codependent arsenal, she can’t change unless she wants to. Control is just an illusion. No amount of spatchcocked chickens on Heath Ceramics platters will fix her, or me.Last week, I called my mom. I was house-sitting and told her I was taking advantage of the kitchen’s Blanco Carrara marble countertops and Japanese-steel knives, spending hours to make some obstinate dinner. She was having Lean Cuisine. I didn’t have the energy for another round of begging her to eat-this-instead-of-that. For once, I don’t want to play stuck-up daughter to her incorrigible mom-child. Instead, I asked what flavor. It was Swedish Meatballs, 300 calories of al dente spiral noodles and juicy peppered meat swirling in a rich and creamy umami gravy. It used to be my favorite. It was the only one that tasted better than how it looked on the box.Explore Bon AppétitFeeding A FamilyHealthyishessayRead MorecultureThere’s No One Way to Make Habichuelas Guisadas—and That’s the PointBy Ruth TerryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-07", "author": ["Condé Nast", "Mariella Rudi"]}