{"id": "5b14a54815e6eb3b61ea6b560a10be27", "url": "https://www.bonappetit.com/story/three-months-200-meals", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Three Months, 200 Meals, and a LOT of Time on the Road | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThree Months, 200 Meals, and a LOT of Time on the RoadHot 10 insights and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroSeptember 19, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Yesterday Bon Appétit dropped the Hot 10, its list of the best new restaurants in the country. The thing I love about this list is that it spotlights cities that aren’t always on the radar when it comes to amazing food, from Khao Noodle Shop in Dallas (#2) to Ochre Bakery in Detroit (#4) to The Wolf’s Tailor in Denver (#10). It’s also making me really excited for the domestic travel I have coming up. You can bet I’ll be hitting up Matt’s BBQ Tacos (#9) when I’m in Portland next month for Roux, and I’ll be first in line for a chocolate croissant at the #1 spot, Konbi, when I’m in LA after that.Deputy editor Julia Kramer spent a good three or four months criss-crossing the country to put together this list, and just thinking about her travel schedule makes my head hurt...not to mention she was pregnant the entire time she was on the road!  Traveling and eating for work sounds like a luxury, and she’s the first to admit that it is, but it can also take a serious toll. Julia told me (via text because I bothered her on maternity leave) that one of the hardest things about those months was spending so much time alone. It’s a challenge not to just stare at your phone all the time when you’re traveling solo, so Julia fought that impulse by reading actual books...and scoping out local bookstores between meals.She also takes “traveling light” to an extreme. I remember her posting a selfie as she was leaving for one of her trips, and she was carrying literally a single tote bag. “If you are traveling alone and never seeing the same person or place twice, you really only need one or two outfits,” she texted me, truly blowing my mind. I see this “no-waste” travel as a self-care strategy all its own. Schlepping your stuff in and out of cabs and through airport security is a huge drag; figuring out how to avoid that saves you tons of energy, both physical and mental.I’ve never done the kind of jetsetting that Julia does for the Hot 10, but I’ve definitely felt travel burnout before. One of my favorite ways to combat it is by doing exercise classes in different cities. I’ve taken pilates in Chicago, barre classes in Boston, Crossfit in D.C., and fitness rave in L.A. (yes, it’s as wild as it sounds). And I’ve sought out affordable spas everywhere from Berlin to Amsterdam to Hanoi, where I’ve gotten some of the most deeply restorative massages of my life.Back on the home-cooking front, I’ve been revisiting some of the recipes from this year’s Feel Good Food Plan because, yes, we’re already planning for FGFP2020, and I have to say Andy Baraghani’s chickpea and cauliflower bowls are a sleeper hit. So fast and so satisfying, even without the fennel, which I forgot to get at the store. Next up: loaded sweet potatoes with lentils, feta, and citrus. I’m curious if you have any Feel Good Food Plan favorites that you come back to again and again, and why you love them so much. Let me know: healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MorerestaurantsThe Hot 10: America's Best New Restaurants 2019By Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Amanda Shapiro"]}