{"id": "5b172869e0dec83adb8af012b11af21a", "url": "https://www.bonappetit.com/story/stretched", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "I Got Stretched By a Professional Stretcher at a Boutique Stretching Studio | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Got Stretched By a Professional Stretcher at a Boutique Stretching StudioStretch*d turns stretching from an afterthought into the main event.By Rachel Sugar June 5, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn I Did The Thing, Rachel Sugar sacrifices her time and her sanity in the name of wellness \"research.\" Up next: a day at Stretch'd, a boutique fitness studio devoted to stretching.I am not very athletic, but I am very good at stretching. You should see my toe-touching. It’s enviable, I think. Not that anyone has ever envied it, but I like to imagine they would, if they knew.This is to say that I was primed to like Stretch*d, a boutique Flatiron stretching studio nestled between a high-tech nail salon and a sex club with bad Yelp reviews. It is the rare boutique fitness experience that demands no motivation and causes no sweat. Instead you lie on a very comfortable table while a professional Stretch*r moves your body around for you. It’s a cross between exercising and being a corpse. (This is a compliment.)The problem is, people don’t stretch enough, Amanda Freeman tells me. She knows this, because before co-founding Stretch*d, she founded the hardcore boutique fitness method SLT—as in strengthen, lengthen, and tone—and noticed that half the class would leave before the final stretch. “I’d even hear instructors say, ‘...if you have time for the stretch,’ as if it’s something very secondary you could skip,” she says. But when you see people working with personal trainers at the gym, “you’ll notice them relishing the last five to ten minutes when they’re being stretched out.”People know they’re supposed to stretch, but they don’t. “It’s like the flossing of fitness,” co-founder Vanessa Chu told Ashley Mateo at The Cut last year, something you feel vaguely guilty about not doing as much as you’re supposed to, but not so guilty that you change. As Freeman sees it, this is for two reasons. One is that stretching does not come with a “superficial benefit, like calorie burn or weight loss,” and people like immediate results. The other is that self-stretching—which is to say the usual kind, where you’re responsible for holding your own ankle—feels tedious. You do a whole workout, and then there’s more?Stretch*d, though, wants to turn stretching into the main event. “I think assisted stretch is better because it feels amazing,” she explains. “It’s like giving yourself a shoulder rub versus having someone else do it for you.” It’s supposed to feel like luxury but also boost athletic performance, release stress, and reduce the risk of injury. It’s not fitness, exactly; it’s pampering with benefits.In person, Stretch*d is pleasantly non-intimidating, which is to say that I wore my only pair of brand-name workout leggings and no one cared. There are (I think) no candles and no gongs and no pretense of spiritual healing. Nobody uses the phrase “wellness” the whole time I am there. Nobody says I will become sexier. For a one-on-one boutique stretching experience that costs $100 for 55 minutes, it all feels very practical, like going to the allergist.The room where it happens.\nPhoto by Alex LauMy Stretch*r for the hour, Jeff Brannigan, leads me back to one of Stretch*d’s eight semi-private rooms, each of which is equipped with an adjustable massage table with a seatbelt on it. Brannigan asks if I have any injuries, but I don’t, which feels like a let down. He developed the company’s proprietary method and now serves as its program director, so I feel like I should have more specialized pain, but I have only the general pain of being alive. “My shoulders are tense, I think!” I offer, and then he adjusts the belt around my hips. He moves my limbs through a series of stretches, which involve him pushing and/or pulling various parts of my body in slow and methodical ways, and me becoming increasingly self-conscious about the dog hair on my socks.“I’m sorry about the dog hair on my socks,” I say, as he pushes my leg up toward my head. “Do you have a dog?” he asks.He moves my legs up, over, to the side. He adjusts the table up, and down, and up; undoes the belt, adjusts the belt, redoes the belt. He presses on the palm of my hand and the sensation up my arm is so intense I gasp. “Yeah, that one surprises people,” he observes. He moves my back. He moves my shoulders. The ceiling is decorated with are stretch-related idioms. Above me it reads, “Loose Plans.”They’re good stretches, I think. I mean, I am no stretch-spert, but I feel like my muscles are becoming less tense and more lengthened. Brannigan checks in regularly to make sure I’m doing okay, and I assure him I am, and then we return to a comfortable silence, and I close my eyes are return to eavesdropping on the woman being stretch*d one stall over, who is talking about running marathons. Should I run marathons? I wonder, luxuriating in the experience of having someone else manipulate my limbs for me. (No.)Brannigan whips out a machine called the HyperVolt, which is a massager that looks like a power drill and feels like you’re being pelted with violent hale. But, like, in a healing way. Under normal circumstances, it costs an extra 5 dollars and is nice, mostly, until we encounter a tender spot on my inner thigh, and then it is excruciating. We decide that this is because I am tense, which is either from working out or being sedentary. Then he slathers my neck with CBD cream (also 5 dollars), which is supposed to reduce inflammation. “Is that because necks get very inflamed?” I ask. He says it’s mostly because it would be weird to start massaging cream on clients other places, and I appreciate his honesty.I feel great when I leave. The change is less physical than mental, like the extra space in my body has created extra space in my brain.The extremely on-trend Stretch*d store\nPhoto by Alex LauStretch*d is part of a whole boutique fitness movement focused on recovery. “That’s what sets athletes like Tom Brady apart,” one exercise physiologist told Mateo. “It’s not how hard he trains, it’s how hard he recovers.” This is very inspiring, but I am not Tom Brady. For one thing, I don’t train very hard at all. But Freeman assures me that Stretch*d is for everyone. “It’s not just for the fitness-obsessed. We have clients who sit all day and have a bad back or neck or their wrist really hurts from texting a lot,” she says. “It’s just basically recovery from our everyday life. Our bodies weren’t necessarily intended to sit at a desk eight hours a day, or to do HIIT four days a week. But we’ve evolved so that’s where our lifestyle is now.”It doesn’t hit me until now how depressing this is, that the thing we’re all supposed to be recovering from might just be the unrelenting strain of being alive. That, were it not comped because of this article, I would be spending $100 to have a professional relieve the pressure of my own physical existence. Should we be worried about this?But this is not Stretchd’s fault. Stretchd is just responding to the circumstances that are. And they’re right. I do text. I hunch over a laptop, and then I go to the gym to try to make up for it, and while I could try to change all that, it seems much easier to have a nice trained professional twist my legs for a while.You don’t need a Stretch*r to stretch. But, for me, the benefit of Stretch*d isn’t really about the stretching. It’s that, for an hour, you are required to make no decisions at all. At home, alone, stretching is a constant set of questions: Should you stretch? What stretch? For how long? Are you doing it right? Are you sure? But at Stretch*d, there are no decisions, except that you have to show up. You can’t make a bad choice, because there are no choices. It is a 55-minute (or 25-minute, or 75 minute) vacation from responsibility and nobody even gets mad at you for it, because sure, it’s indulgence, but it’s also enrichment, like a nature cruise instead of Tulum. And you don’t even have to keep track of the precise whereabouts of your legs.Explore Bon AppétitI Did the ThingHealthyishessayRead MoreLifestyleI Tried 'Wellness Coworking' and It Made Me Feel Profoundly AloneBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-05", "author": ["Condé Nast", "Rachel Sugar"]}