{"id": "5b336874684abd0e3091dfad9c9ac21c", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/kitsune-ya", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Kitsune-ya Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoKitsuneyaThe real reason to go to Tsukiji fish market is not fish at all.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: to learn that the best thing to eat at Tsukiji has nothing to do with fish. Most visitors think they must eat sushi in the market, but this is an illusion—good fish can be enjoyed anywhere in the city and often at a better price and with less interminable lines. Instead, eat the thing that can only be had at Tsujiki: gyu-don. Yes, you can find these bowls of beef, onion, and rice everywhere in Japan, but they’re cheap pretenders compared to the rich stew made here. It’s the difference of pizza from Di Fara’s in Brooklyn versus the cheese-laden cardboard of a national chain. One is an act of love and one is an act of efficiency.ORDER THE: well, gyu-don. Its chief components are beef and onion, but they have been stewed in a stock that‘s been fortified with chocolaty hatcho miso, which is the addition that makes Kitsuneya‘s special. If you‘d like something with more intrigue, order the horumon-don, which is a bowl of stewed cow intestines over rice. Both can be gilded with the addition of a raw egg or ordered over a block of tofu instead of rice.THE VIBE IS: frenetic, like the market itself. Kitsuneya is a stall with only a few seats at the counter and a couple of standing metal tables on the sidewalk. It sits at the front of the outer market, so the traffic—both human and motorized—never stops.PRACTICAL STUFF: Open Monday to Saturday from 7 a.m. to 1:30 p.m. Closed Sundays,  some Wednesdays. No English menu is available and the staff does not speak English. The nearest subway stops are Tsukiji and Tsukijishijo.Photo by Xavier Girard LachaîneA decidedly not-fishy reason to journey to Tsukiji fish market.\nPhoto by Xavier Girard LachaîneKitsune-ya is not as much a restaurant as it is a stall with a few metal tables.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}