{"id": "5b3f91dd27c48c1e02fdbc9aca982873", "url": "https://www.bonappetit.com/story/how-to-use-tamarind", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "What Is Tamarind and How Do You Use It in Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHonestly, What Can’t Tamarind Do?This sweet-sour Indian pantry staple makes everything better.By Rathina SankariJanuary 13, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe food of my childhood is incomplete without the flavor of tamarind: Cycling to school meant sucking on one of the tamarind candies stuffed in my pockets. Meeting friends for paani puri, a crispy fried dough filled with a medley of chutneys, including the ubiquitous tamarind chutney, was a weekly affair. And on the long train journey from Pune in western India to my hometown in Tamil Nadu, I eagerly dug into the South Indian dish puliyodharai, tamarind rice wrapped in a banana leaf parcel.In Indian cuisine, tangy tamarind plays many roles. It acts as a preservative, a cooling agent, and a remedy—its paste relieves the itchy mouthfeel that comes from eating tubers like yam and taro. It’s also sour and sharp; as Saee Koranne-Khandekar explains in her book Pangat, a Feast, tamarind plays a crucial part in balancing flavors. When added to the lentil vegetable stew sambar and to other curries like puli kuzhambu, which consists of vegetables like moringa pods, eggplant, or okra cooked in a tamarind base, its sharpness contrasts with the spices.Because tamarind comes in so many forms and is consumed in countless ways, below, I’ll walk you through its wide usage in Indian cuisine as well as its excellent benefits (tamarind is also an important ingredient in Southeast Asian and Central and South American cuisine).First off, what is tamarind?Widely used in India, tamarind is a plump pod-like fruit with a sweet, tangy flavor that is indigenous to tropical Africa. The word tamarind itself is derived from the Arabic tamar hind, meaning “Indian date.” When the fruit is mature, the pods are opened and seeded to reveal the dark chocolate flesh, a staple in Indian cuisine. But every part of the tree is useful: The leaves are used as an anti-inflammatory in home remedies; the wood is harvested for carpentry; and the seeds are pieces in playing traditional Indian board games.What forms does tamarind come in and how is it used?You’ll find tamarind in several forms; some are interchangeable in recipes while others are not great substitutes. Raw tamarind, for example, cannot stand in for ripe tamarind as the flavor and texture are significantly different.Unripe green fresh fruit: Super tart and sour, it’s chopped for pickles and chutneys without being seeded.Brown ripened fruit or pulp: Tamarind comes in whole pods but is also commonly sold in Asian shops as blocks. The fruit serves as an excellent marinade for meats and seafood. Before pan-frying fish, I’ll glaze it with a paste made from a small piece of ripened tamarind, green chiles, chili powder, turmeric, and onions. The ripe fruit is also added to a wide range of chutneys.Paste, concentrate, or extract: Ripe fruit in a more user-friendly form, these can be bought from the store or made at home. To do it yourself, soak the tamarind pulp in hot water, remove the fibers and seeds, and squeeze to extract the dark, smooth paste. It has a long shelf life when refrigerated and acts as a souring agent in meat and vegetarian curries and as a natural coolant for the body.Chutney: Store-bought tamarind chutney or sauce should not be confused with paste or concentrate as it comes already sweetened and seasoned.Powder: When added to candies, beverages, and snacks, this dehydrated form of the fruit gives a much-appreciated extra punch.In this recipe, tamarind concentrate is incorporated into a glaze that’s slathered over black bass.\nPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioHow can you use it?Raw tamarind is highly acidic and pucker-inducing. Pickle chunky pieces with tomatoes, chiles, or carrot to enjoy with Indian bread like paratha. Grind into a thokku or chutney for a tart accompaniment to dosas and idlis. To offset comforting curd rice, make chintakaya thokku, the green tamarind pickle that’s a delicacy of Andhra Pradesh and Telangana.When ripe, the fruit is sweeter and less sour and used in Indian cooking in countless ways. Add the extract to a fiery red fish curry to round out the flavors like they do in Tamil Nadu and Kerala, or to your duck or lamb vadouvan curry for the Puducherry delicacy. Because tamarind paste is acidic, a slathering can also be used to tenderize a hunk of protein.Blend a piece of tamarind pulp with your coconut chutney, beet chutney, or cilantro chutney and it will go a long way thanks to its preservative characteristics. Next time you prepare chaat, like dahi vada, bhel puri, samosa, or kachori chaat, be generous with tamarind chutney, a sweet-and-sour condiment that’s a mixture of tamarind extract, jaggery, dates, and spices. If you are looking for a tongue-tingling snack, dust roasted peanuts with powdered tamarind for a quick fix.Tamarind is perfect to serve alongside samosas.\nPhoto by Laura Murray, food styling by Yekaterina BoystovaWhat are tamarind’s other benefits?Ayurveda dictates the consumption of six tastes—sweet, sour, salty, pungent, bitter, and astringent—in every meal. Dishes made with tamarind, like rasam, impart sourness in an Indian spread. A thin soup-like extract, rasam can be ladled over a mound of steaming rice or sipped like a soup.Rich in thiamin, iron, magnesium, and phosphorus, tamarind is also a treasure trove of antioxidants. “Tamarind leaf paste aids in healing inflammation and sprains,” says Regi Mathew, co-owner and culinary director of Kappa Chakka Kandhari in Bengaluru and Chennai. “A hot tea made with these leaves is a balm for an itchy throat,” he adds.The next time you crave a fish curry or have a sore throat, you know what to do. As for me, I still yearn to go on those train journeys for the simple pleasures of tamarind-flavored puliyodharai. Rathina Sankari is a freelance writer from Pune, India, and loves to explore the intersection of history, culture, and food. Follow her on Instagram.Got tamarind? Now try this recipe:Tamarind Chicken Thighs With Collard Greens SaladTamarind concentrate gives this chicken its sticky, glossy quality, not to mention its sweet-and-sour flavor.View RecipeExplore Bon AppétitBasicallyIndianTamarindRead MoreBuss Up Shut Paratha RotiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-13", "author": ["Condé Nast", "Rathina Sankari"]}