{"id": "5b4125c0afe02d387103867d30b4fda1", "url": "https://www.bonappetit.com/story/talking-to-men", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "How I'm Talking to the Men in My Life Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I'm Talking to the Men in My Life Right NowThere’s no one-size-fits-all way for men to support women right now, because women are not one-size-fits all.By Amanda ShapiroOctober 1, 2018FacebookTwitterEmailPhoto by Photo by Zach Gibson/Getty ImagesFacebookTwitterEmailIt’s like I’ve been holding my breath. I’m exhausted by what’s already happened and afraid of what’s next. I’m burned out on constant news alerts and talking heads, but I can’t turn away from the screen. Sometimes I catch myself thinking, “When will this shit be over?” Then I remember that Brett Kavanaugh is not just a bad dream we’ll wake up from. Dr. Christine Blasey Ford isn’t the first woman in America to be sexually assaulted. And the hardest fights are still to come.We all know too many women like Ford, who’ve survived by being quiet and following the rules. We all know too many guys like Kavanaugh who’ve escaped responsibility by being privileged and loud. I’ve talked with nearly all my female and non-binary friends about this and about the state of our mental health right now. But I realized, toward the end of last week, that I hadn’t been talking to men, and I wanted to be. I don’t mean flagging down men on the street and handing out primers on the patriarchy. I mean talking to my partner and my male friends, the men I know who “get it” and are also horrified by what’s happening right now. I wanted to hear their support, and I wanted to know that they understood.When I saw this GQ post last week, I was grateful to Marian Bull for writing it, and I wished there were something similar for people like me, people who want to ask men—or anyone in their lives—to show up for them right now. How do I convey what it feels like to be so triggered, exhausted, and scared? How do I simply ask for support? How do I have the conversations I want to have and not the ones I don’t? Below are some strategies that I’ve found helpful these past few days. I’m thinking of it like my mantra for the next week and beyond.I don’t have to say anythingFirst thing’s first: I don’t owe anyone a lesson in feminism, the patriarchy, or basic human decency. It’s not my job to turn every guy in the world into an enlightened ally, because that gets exhausting fast. I have to decide who’s worth my time, and it’s probably the people I love and care about the most.I'm talking about how I’m doingYes, men should be checking in with the women they care about right now. But I don’t have to wait for that “How are you?” text to come through. A couple ways I’ve been practicing reaching out: “I could really use a reminder that guys aren’t all terrible. Want to take a walk later?” or “All this white male rage is really getting me down. Can we just get takeout tonight?” The responses I get tell me what I need to know about whether this person is ready to be an ally.I'm sending people stuff to readEven if the guys in my life are glued-to-Axios politics nerds, they may not be reading the same articles, Tweets, podcasts, etc. as I am, and that can make it feel like we’re on entirely different wavelengths. Andrew Sullivan is smart and all, but have they read Kimberlé Crenshaw, Noreen Malone, or Rebecca Traister? It’s good to talk about how this Supreme Court appointment will affect U.S. law and policy, but do they understand how this process is affecting women’s bodies and minds right now? I’ve been sending links to my male friends along with some follow-up thoughts: “Malone really nails the problem of inherited privilege here, don’t you think?”I'm asking for what I wantThere’s no one-size-fits-all way for men to support women right now, because women are not one-size-fits all. I’m thinking about what I want from the men in my life. Many women have been taught for so long to not ask men for things, and so we have no idea where to start with this. So that’s step one: Figuring out what I need. And every answer is valid. Maybe it’s important that my best guy friend call me more regularly to check in. Maybe I want my other friend to use his sizeable Twitter following to speak out against the bullshit. Maybe I want my dad to donate to the national sexual assault hotline or another organization that supports victims of sexual abuse. Next step: Telling them.I'm asking for quietSometimes I just don’t want to hear guys talk. It doesn’t matter whether I agree with them or not. When this whole situation feels like one big trigger factory, when I’m tired of men raging on all sides of the political spectrum, it’s okay to ask for some quiet. When it comes to silence, there's the kind that feels like a cop-out and there's the kind that feels like listening. I'm looking for the second one.Explore Bon AppétitHealthyishSelf CareRead MorecultureWhy We Learned to FightBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Amanda Shapiro"]}