{"id": "5b6453c02aace9c9b8b3ef7353f1cf08", "url": "https://www.bonappetit.com/recipe/shrimp-tacos-with-pineapple", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Shrimp Tacos with Pineapple Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueShrimp Tacos with PineappleBy Jenny RosenstrachJanuary 9, 20184.8(9)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintThe shortcuts to a super-speedy taco night: one baking sheet and a hot broiler. If you're using frozen shrimp, throw them in a resealable bag and set in a bowl of cool running water in the sink—you'll be good to go in 10-15 minutes. When shopping for pineapple, choose one that's fragrant, feels heavy for its size, and gives slightly when pressed at the base.IngredientsMakes 8½small red onion, thinly sliced2tablespoons fresh lime juicePinch of sugarKosher salt¼medium pineapple, peeled, cored, cut lengthwise into spears, then crosswise ½ inch thick (about 2 cups)2tablespoons extra-virgin olive oil, divided1¼pounds shrimp, peeled, deveined1tablespoon SrirachaFreshly ground black pepper8corn tortillas, warmed1avocado, sliced1jalapeño, very thinly sliced, seeds removed if desired½cup cilantro leaves with tender stemsLime wedges (for serving)PreparationStep 1Place a rack in the highest position in oven; heat broiler. Toss red onion, lime juice, sugar, and a pinch of salt in a small bowl; set aside.Step 2Toss pineapple and 1 Tbsp. oil on a rimmed baking sheet and arrange in a single layer on half of baking sheet; reserve bowl. Broil pineapple until lightly charred around the edges, 5–8 minutes.Step 3Meanwhile, toss shrimp, Sriracha, and remaining 1 Tbsp. oil in reserved bowl until shrimp are evenly coated; season with salt and pepper and toss again.Step 4Remove baking sheet from broiler and use a spatula to turn pineapple pieces over. Arrange shrimp in a single layer on empty half of baking sheet. Broil until shrimp are cooked through on top, about 2 minutes. If your shrimp are opaque and springy to the touch, they're done. Remove from broiler and turn shrimp (leave pineapple alone). Broil again until shrimp are cooked through, 1–2 minutes. Transfer shrimp and pineapple to a large bowl and season with more salt and pepper.Step 5Drain soaking liquid from onion into bowl with shrimp and pineapple; set onion aside and toss shrimp and pineapple in pickling liquid.Step 6Serve shrimp mixture with tortillas, avocado, jalapeño, cilantro, lime wedges, and reserved pickled onion for making tacos.How would you rate Shrimp Tacos with Pineapple?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI love this recipe. The shrimp might have needed more flavor, but that could have been me. We added a mango salsa to increase the sweet/spicy mix. Do recommendAnonymousFairfax, VA9/5/2020Delicious, especially the grilled pineapple. We sadly cannot get as nice shrimp as shown in the picture in our country (at least, not without selling a kidney), but the flavours here more than make up for it. Nice and quick even for a weeknight. Anonymous5/25/2020So easy , so delicious! rosdianeEvanston Illinois4/25/2020We love these. They’re super quick and easy to make and are delicious! We paired it with a cilantro lime rice and it was perfect together! SearcysledgeMadison, al4/23/2020Easy and delicious!AnonymousRichmond, VA3/21/2020This is one of my absolute favorite quick dinner recipes!Anonymous12/31/2019Explore Bon AppétitTacoShrimpShellfishSeafoodPineappleFruitQuickEasyWeeknight MealsSheet-Pan DinnersMainDairy-FreeGluten-FreeNut-FreeHealthyishBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Jenny Rosenstrach"]}