{"id": "5b65f31dfd54afa9b8517c1d4afa0cfb", "url": "https://www.bonappetit.com/story/whole-roasted-squash", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Whole Roasted Squash Is the Secret Best Way to Make Squash on a Weeknight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhole Roasting Is the Secret Best Way to Make Squash on a WeeknightStill peeling, scooping, and cubing your squash? We're over it.By Ashley MasonMarch 2, 2018FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyFacebookTwitterEmailTypically I file roasted squash recipes away into my mental “weekend food” folder, along with sticky braised short ribs and comforting baked pasta. That’s because getting squash to an appropriate state to cook—peeling it, wrestling with the knife, scooping out the seeds, cubing the flesh—is such an ordeal that I need a full pot of coffee in me to even consider the attempt.That is until I made twice-roasted squash with parmesan butter. Instead of finding myself in a swearing match with a vegetable, I slid the butternut squash into the oven whole and let the slow, even heat force the gourd into submission for me. The flesh steams inside the thick skin and becomes scoopably soft in three hours at 300°, but if you want to speed it up, one hour at 425° will also do the trick. After, I didn’t even need a knife. It was so soft that I tore it open with my hands, spooned out the flesh, and mashed it together with grated parm, lemon zest, and butter. Just to give it some color, I transferred the mixture back into squash skins and blasted it in the oven for 10 minutes. I was so pleased with how well it turned out—the usually one-noted butternut transformed into a rich and lemony mash—that I happily ate it again for lunch the next day.Roast a whole squash on Monday; make baked squash pasta on Tuesday.\nPhoto by Alex Lau, Styling by Andy BaraghaniThe whole roasted squash method opened my mind to a world of other meal prep possibilities. Senior food editor Chris Morocco, this recipe’s creator, suggested lining a baking rack with red kuri, kabocha, buttercup, or whatever tough-skinned squash your heart desires. Read a book, take the dog for a walk, come back, and you have quarts of the stuff ready to be eaten.Slide them out of their skins and mash or slice them up (which is super easy now), then use them in place of cut, peeled squash. Transform the buttery flesh into a smooth curried soup. Fold cubes into shakshuka. Slice them into wedges and assemble a hearty grain bowl on the fly. Or throw torn pieces back in a skillet with vadouvan and chickpeas and you’ve got dinner. Squash on a weeknight? That’s a big deal.Go whole or go hungry:Twice-Roasted Squash With Parmesan Butter and GrainsSlowly roasting whole, skin-on squash until it’s buttery soft means you can break it open with a spoon.View RecipeExplore Bon AppétitHealthyishSquashRoasted VegetablesRead MorecookingButternut Squash Baked Pasta Is the Ultimate Healthy Winter Comfort FoodBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-02", "author": ["Condé Nast", "Ashley Mason"]}