{"id": "5b66a54f22db5f5090aa8309569e9c36", "url": "https://www.bonappetit.com/recipe/salsa-macha-with-crudites", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Salsa With Crudités Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueSalsa Macha With CruditésBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20204.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintUnlike most salsa machas, this kicky chile-and-peanut-laced one from Lil’ Deb’s Oasis in Hudson, New York, incorporates vinegar and orange juice for more rounded flavor. Use it as a dip for vegetables or sweet tropical fruit. Co-chef-and-owner Carla Perez-Gallardo calls it one of her favorite sauces in the whole world: “Crudités gets so French-ified and ranch-ified, and this feels more true to our tropicalia.”Ingredients4 servings3guajillo chiles, seeds removed, torn or cut into 1\" pieces3dried chiles de árbol or 1 tsp. crushed red pepper flakes½cup vegetable oil½cup fresh orange juice2Tbsp. red wine vinegar1Tbsp. sugar¾cup finely chopped peanuts3Tbsp. toasted sesame seeds1Tbsp. unsweetened cocoa powder2garlic cloves, finely choppedKosher saltPineapple spears, mango and dragon fruit slices, and celery sticks (for serving)PreparationStep 1Bring guajillo chiles, chiles de árbol, and oil to a gentle simmer in a small saucepan over medium heat, stirring constantly. Cook, still stirring, just until chiles darken in color, about 2 minutes total. Let cool.Step 2Transfer chiles and oil to a blender and add orange juice, vinegar, and sugar. Purée until nearly smooth. Transfer to a small bowl and stir in peanuts, sesame seeds, cocoa powder, and garlic. Season with salt.Step 3Serve salsa macha with pineapple, mango, dragon fruit, and celery alongside for dipping.How would you rate Salsa Macha With Crudités?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI might’ve cooked the chiles too long but this didn’t come out great. Very bitter yet also too sweet? Bizarre flavor. I’m going to try the other salsa macha BA recipe.  This also won’t let me leave a 2 star review AnonymousSeattle WA4/16/2021Explore Bon AppétitSalsaCondimentCruditéMexicanLatin AmericanPeanutNutOrangeCitrusFruitChile de ÁrbolChileVegetableSnackStarterGluten-FreeDairy-FreeVeganVegetarianHealthyishNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}