{"id": "5b7ab1608ca3adff24587058878f66cd", "url": "https://www.bonappetit.com/story/desperation-cooking", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "A Week of Desperation Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Week of Desperation CookingRecipe recommendations and other thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroJanuary 23, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Happy belated MLK Day. I really needed Rachel Cargyl’s reminder, and maybe you do too: “The action...the work...it isn’t in simply following educators, double tapping activists’ posts, or commenting that you hear us. The work is in the the every day, on the ground, in your heart, with your voice, in your homes, with your vote, on your campuses, off the screen and in the streets.”I went to Chicago for the long weekend, though it turned into a shorter weekend than planned thanks to a cancelled flight and that dreaded ~winter weather.~ So instead of flying out on Friday, I had the kind of serendipitously fun, falling-together-of-plans kind of night in New York that only happens when you’re supposed to be somewhere else.Then, 12 hours behind schedule, I was somewhere else, fighting off single-digit temps with fiery Sichuan, a sauna-esque dance party, and a couple hours in the Garfield Park Conservatory aka the tropical bubble of my winter dreams.Kale pesto pasta is always in season. \nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioLuckily I’ve found a reason to head to warmer regions this weekend, specifically Palm Springs and then to LA, where Sara Kramer and Sarah Hymanson at Kismet are hosting Healthyish, Future of Women, and 50 of our guests for a breakfast convo about how climate change is affecting the food, fashion, and products we buy. The breakfast is sold out, but if you snagged a ticket I’ll see you there.I’ve seen a lot of you still making your way through the The Feel Good Food Plan, and that makes me happy! It’s not a race; it’s a journey. Between travels, I’m cooking as much as possible too, albeit not always with recipes. Of course I’ve bookmarked Basically’s new congee, and we’ve got a cabbage thing coming out soon that’s the best thing to happen to cruciferous vegetables since Big-Flavor Broccoli. But more often I've been defaulting to something like elevated gym bro cuisine: steamed Japanese sweet potatoes, greens sautéed in garlicky olive oil, shallow-fried chickpeas, and blender sauces made from whatever nuts, herbs, citrus, and flavor heavy-hitters (miso, fish sauce, anchovies, parm) I find in the fridge.I love these meals because they double as meal prep if you cook enough, and the components can be nudged into all kinds of other dishes: soups, pastas, or Desperation Shakshuka, named for the state of hunger and anxiety I was in when I made it earlier this week. I wasn’t thinking straight, but I believe I was channeling David Tamarkin’s Baked Feta, though I went pretty far afield: a half jar of harissa simmered with a can of whole peeled tomatoes then poured into a skillet with the aforementioned crispy chickpeas and a few giant handfuls of kale. I didn’t have any feta so I cracked some eggs over the top instead—voila, shakshuka?—baked it until the eggs were just runny, and ate it with some lemon-spiked yogurt on top. Sure it would’ve been better with pita or flatbread, but that’s not what desperation cooking is about.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleI'm Feeling Better This YearBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-23", "author": ["Condé Nast", "Amanda Shapiro"]}