{"id": "5b87f3ecf8dbd6a29912d22429ce3508", "url": "https://www.bonappetit.com/recipe/salted-butter-and-chocolate-chunk-shortbread", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Salted Butter and Chocolate Chunk Shortbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Butter and Chocolate Chunk ShortbreadBy Alison RomanJanuary 4, 20184.2(167)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole HerriottEmailPinterestPrintEmailPinterestPrintThere is a cookie craze online for this recipe from Alison Roman's Dining In—read more about it here. Roman writes: “Less chocolate chip cookie, more brown sugar shortbread with chocolate chunks—they just might be the cookie you’ve been looking for. Made with lots of salted butter (it has a slightly different flavor and a deeper saltiness than using just salt), the dough has just enough flour to hold it together and the right amount of light brown sugar to suggest a chocolate chip cookie. If you find it tragically annoying to buy salted butter just for this recipe, you can use unsalted butter and add ¾ teaspoon kosher salt to the flour.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonPastry Brush$9 At AmazonGet It Right Spatula$13 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonIngredients1cup plus 2 tablespoons (2¼ sticks) cold salted butter, cut into ½-inch pieces½cup granulated sugar¼cup (packed) light brown sugar1teaspoon vanilla extract2¼cups all-purpose flour6ounces semisweet or bittersweet dark chocolate, chopped (but not too fine, you want chunks, not thin shards of chocolate)1large egg, beaten to blendDemerara sugar (for rolling)Flaky sea saltPreparationStep 1Using an electric mixer and a medium bowl or a stand mixer fitted with the paddle attachment, beat butter, granulated sugar, brown sugar, and vanilla on medium-high speed until super light and fluffy, 3–5 minutes.Step 2Using a spatula, scrape down sides of bowl. With mixer on low speed, slowly add flour, followed by chocolate chunks, and beat just to blend.Step 3Divide dough in half, then place each half on a large piece of plastic wrap. Fold plastic over to cover dough and protect your hands from getting all sticky. Using your hands (just like you’re playing with clay), form dough into a log shape; rolling it on the counter will help you smooth it out, but don’t worry about getting it totally perfect. Each half should form logs that are 2–2¼\" in diameter. Chill until firm, about 2 hours.Step 4Preheat oven to 350°. Line a rimmed baking sheet (two, if you’ve got 'em) with parchment paper. Brush outside of logs with egg wash. Roll logs in demerara sugar (this is for those really delicious crispy edges).Step 5Slice each log into ½\"-thick rounds. Arrange on prepared baking sheet about 1\" apart (they won’t spread much). Sprinkle with sea salt. Bake cookies until edges are just beginning to brown, 12–15 minutes. Let cool slightly before eating them all.Do Ahead: Cookie dough can be made 1 week ahead. Tightly wrap in plastic and chill, or freeze up to 1 month. Cookies can be baked 5 days ahead. Store in plastic wrap or an airtight container.Reprinted from Dining In. Copyright © 2017 by Alison Roman. Photographs copyright ©2017 by Michael Graydon and Nikole Herriott. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House, LLC.\n\nBuy it on Amazon or BookshopHow would you rate Salted Butter and Chocolate Chunk Shortbread?Leave a ReviewTell us what you thinkReviews (102)Back to TopTriangleYum! These are the moistest shortbread cookies I've ever had. I did have a slight complication with the dough - I think my butter was TOO cold and the dough didn't hydrate properly, so it was a little crumbly. In the future, I won't use fresh-from-the-fridge butter. The flavor was delicious though!CaseyArlington, VA2/13/2022I discovered this recipe in 2019, and fell in love with this cookie! I've made them every Christmas since then. \n\nI absolutly adore shortbread (it's not for everyone), and the pecans bring me back to my childhood.  My mother loved pecan shortbread cookies, albeit they were store-bought.\n\nThese are hands- down the best shortbread cookies I've ever come across.  \nLisa Welch Linden, NJ12/25/2021Those who think that these are bland just don't like shortbread. Shortbread cookies aren't supposed to be soft, gooey, and ultra-sweet. They are supposed to be crisp, subtly sweet, and super buttery. That is just what these cookies are. I actually found the sugar coating on the edges to be a bit too sweet, but its textural addition is wonderful. The bottoms of the cookies are beautifully golden, crisp, and buttery. This is just a perfect shortbread cookie. If you don't know the difference between a shortbread cookie and a regular chocolate chip cookie, you may be disappointed or surprised by your results. All of the reviewers bashing this recipe and comparing it to non-shortbread cookies are making my eyes roll. I love gooey chocolate chip cookies too, but these are a delicious option for those who prefer crispy or who just want something different from the typical chocolate chip cookie. This will definitely remain in my cookie rotation. HaileighAtlanta, GA12/14/2021My six year old Granddaughter gave these cookies her seal of approval. She noticed the salt, said it made it the best. We're in New Zealand and our butter is excellent. Considering that half the population probably has some Scottish ancestry we like the shortbread taste too. The sugar coating and salt sprinkle elevate it immensely. I love the idea of using salted caramel European chocolate. This recipe is a winner. AnonymousAuckland, New Zealand9/6/2021Best cookies ever. That is all there is to say!Laura BNashville, TN3/15/2021These cookies were very good. I found that if you don't use high quality chocolate, vanilla, demerara sugar or flakey salt they are ok, but not great. Once you use good quality ingredients the taste is magnified. For those that thought they were \"sub-par\" maybe you should check what your using and they cook time. Sometimes they vary depending on oven, sea level and experience. AnonymousWashington State2/5/2021I’m an Alison Roman fan, but I found these cookies dry and bland. My boyfriend tried these and they’re sub par for any type of cookie in his opinion, he doesn’t understand why everyone loves them. For anyone who said that they’re delicious or amazing, you’re straight up LIARS!! MarcoMiami1/24/2021So. Good. I had been meaning to make these for so long and finally got around to it over the holidays. I’m so glad I did because these are my new alltime fave. Perfect mix of sweet and salty and if you bake for 12-13, are the perfect softness - not too hard like some shortbreads. Everyone who’s tried them loves them and wants the recipe !AnonymousToronto 1/10/2021This is the first cookie I made breaking into my new stand mixer.\nBoy am I disappointed.\nI love the concept but the flavour of the cookies was bland, not sweet enough (I don't like overly sweet food, so this really did lack the sugar) and the salt-sweet combo just did not exist. The chocolate did take centre stage but it would have been better to eat the chocolate bar separately instead of in these cookies. I would love to try these with a little more sugar in the recipe, but not sure how the dough will turn out.\nAlso found rolling in sugar after it chilled hard to do, maybe doing it before is easier. Aashna Jay.India1/8/2021Like other reviews state, this recipe is easy to do and is definitely an easy way to elevate your cooking and overall elevate the simple chocolate chip cookie. But (this is the part where I get critical), these chocolate chip shortbread cookies will never be better than ordinary chocolate chip cookies. They are quite dry and with that dryness, the flavor becomes dull. You need to have a large glass of milk right beside you if you wish to devour this cookie. Many might say, \"Oh, Deanna, you just baked it for too long,\" and I would have to disagree. I baked the cookies for fifteen minutes, like the recipe called for. So the dry attitude from these cookies isn't my fault. If you look at all Shortbread cookies, they tend to be on the dryer side and this dryer side definitely doesn't agree with the high moisture content chocolate chip cookie (ooh alliteration). \nThis is more of a premonition than it is to dissuade you from attempting this recipe. This recipe is fun to make, but less fun to eat, so if you have a neighbor that you just don't like, give them these. It's a win for you and your neighbor. Why? Obviously you have fun making them and you're mean neighbor who gives your yard some of the 'dryest' most rude comments can eat what he/she sows. \nMerry Christmas, Everyone. \n\nP.S.\nI clicked the \"Would you make this recipe again?\" Button so that you had a higher chance of seeing my review. My real answer to that question would be no, unless I'm in the mood for a cookie that makes my mouth feel like the desert which oddly could happen. Deanna WMadison, Mississippi12/24/2020So easy to make and possibly the best cookie I’ve ever tasted. They’re always a big hit and make a great gift as they travel well. GGPalm Springs 12/20/2020The first time I made these fabulous cookies, I used a Lindt Dark Chocolate and Salted Caramel bar for the chocolate and it was so good that that's the only thing I've ever used for the recipe since. Many people who've tasted them have said they're the best cookies they've ever had, and, although I've made countless other chocolate chip cookies (that got no such accolades) over the years, I have to agree. So thank-you, Alison Roman! \nBTW, Alison Roman's Tiny Salty Chocolate Cookies recipe is also outstanding, and contains no gluten, so you can make those for your envious but gluten-avoiding friends. And her Key Lime Pie is the bomb. Kate Z.Vancouver, BC12/16/2020These are my go to cookies right now.  I usually use chocolate chips and skip the sugar half the time and they are very yummy.  allisonillinois12/13/2020Okay, I finally made these cookies after having this recipe in the back of my mind for a long time. They were great for my criteria: came together easily (I have a stand mixer so \"easy\" is relative to that), not too many ingredients, tasty. They were a little on the sweet side for me but it's a cookie - so of course they should be sweet. I personally prefer ooey-gooey chocolate chip cookies, but the shortbread was a nice option. It turned out great for me, a nice, tender, crumbly, rich and buttery shortbread. The salt was an excellent touch and very much needed. The sugar around the edge makes the cookies look finished, but doesn't add too much to the flavour. I followed the recipe to a T and it was a tad crumbly before I rolled it into logs, but I just pressed it together with my hands and it stuck together just fine. I see that a lot of other people had trouble at this step, but my experience was just to sort of ball it up and then roll it, without any sort of kneading motions to avoid building the gluten. Jay BeeVancouver12/13/2020This cookie was fine, but not my favorite. I'll stick with my Stella Parks Chopped Chocolate Chip cookie recipe instead.Alex the Baker12/7/2020Explore Bon AppétitCookieDessertChocolateOther IngredientsSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Alison Roman"]}