{"id": "5ba67aad778d2cc828fd4740a186658a", "url": "https://www.bonappetit.com/story/creamy-custard-tart-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "This Custard Tart Makes Me Feel Like a Pastry Pro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Creamy Custard Tart You’ll Want to Belly-Flop IntoIt’s like crème brûlée for us lazy, fearful folk.By Sarah JampelSeptember 20, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Claire SaffitzFacebookTwitterEmailThere are egg lovers and then are egg lovers.Where fair-weather egg devotees enjoy the occasional egg for dinner, true egg devotees get down with egg custard tarts, clafoutis, flan, cannelés, cream puffs, and rice pudding—the sweets that rely on the unique richness of egg yolks for color, flavor, and texture.If that sounds like you, buy a dozen on your way home and make Claire Saffitz’s new Custard Tart recipe TONIGHT.Eggs for brunch, also good:It’s a big cushion of a dessert, bouncy and buoyant, like a lighter, low-profile cheesecake or the center of a very good éclair. When it comes out of the oven, it’s still jiggly in the center, which means you can sing “gettin’ jiggy with it” if you’re the type to serenade your dessert. And while it has been named a tart formally, it’s essentially a giant baked pudding—the custard, thickened with egg yolks and cornstarch, is made on the stove, then transferred to a sugared cake pan and sent into the oven until it’s firm enough to slice.The finished tart tastes like crème brûlée after the shattering sugar top has capsized into the middle—milky caramel, burnt sugar. But in this recipe, you don’t have to portion custard into individual ramekins, set up a water bath, or hold your breath and flip it out like a flan. It’s a victory for those of us who are just as determined to eat homemade desserts as we are lazy and hesitant.Top with whipped cream that billows like a sail.\nPhoto by Chelsie CraigAnd that’s not this tart’s only trick. See, normally a pastry cream needs to be babied (a.k.a. “tempered”): Warm up milk on the stove, then ladle some of it gradually into a bowl of egg yolks whisked with cornstarch and sugar to heat the eggs slowly, lest they scramble. Then, add the newly-hot eggs back to the pot of milk, stirring all the while. Claire, our hero, dreamt up a less fussy method: Just whisk all of the ingredients together from the get-go, then bring the mixture up to heat very slowly, continuously whisking.I can’t sugarcoat it—you’ll do a lot of whisking—but for the first two-thirds of the process, until the custard starts to thicken, you can read a whole (short) New Yorker article on your phone and get a solid forearm workout. Most importantly, Claire’s whisk-a-lot technique is less prone to egg clumping, meaning your custard tart will be smooth and silky when it comes out of the oven, golden and beautiful. If the custard is set on the perimeter but paler than you like, stick it under the broiler for 2 to 3 minutes (watching carefully) until it’s as burnished as you’d like.Instagram contentThis content can also be viewed on the site it originates from.To make the finished tart extra fancy, top each slice with whipped cream and macerated peaches, plums, and berries. But the end of stone fruit season is nigh and this cozy, pudding-y tart is too good to save ‘til next year. I suggest switching out the summer produce for caramelized apples or pears, or even jam or citrus curd. When I made it recently, I topped each slice with preserved white mulberries I found in the recesses of my pantry and a couple halved figs.If you’re not a fan of soft-on-soft (maybe you‘re one of those people who lives for a firm mattress), you might consider adding an element of crunch, like toasted nuts, cacao nibs, or crumbles of the meringues you made with the whites leftover from the custard....What? I said was feeling fancy.Your creamy, eggy, caramel-y tart awaits:Custard Tart with Cream and Fresh FruitIf eggy flan-like desserts are your thing, you are going to love this crustless vanilla-infused tart.View RecipeExplore Bon AppétitDessertCustardRead MorecookingA Rhubarb Custard Cake Somewhere Between Pudding and HeavenBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Sarah Jampel"]}