{"id": "5bb6e0dce32640f5ab9d1d1d99a31498", "url": "https://www.bonappetit.com/story/devonn-francis", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "DeVonn Francis Is Changing the Way We Go Out to Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDeVonn Francis Is Changing the Way We Go Out to EatFor Francis, who's at the table is just as important as what's on the plate.By Christina ChaeyJanuary 17, 2019FacebookTwitterEmailFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.I’ve met a Parisian jumpsuit designer, a performance poet, and a writer who hosts a sex and culture podcast on queer brown identity (called Food 4 Thot), and I’ve only been at DeVonn Francis’s pop-up for 30 minutes.Francis, our cohost for the night, is standing at a marble kitchen counter garnishing a plate of charred okra strips and magenta pickled carrots. The tight curls of his dyed blond hair are piled high atop his head, adding another four inches to his six-foot-two frame. (Did I mention he’s basically a supermodel?) His voice is soft and gentle as he stops to chat with friends, and he’s way more zen than anyone cooking a meal for 50 should be.There’s a long table set for dinner. Well, kind of. It looks more like an art installation, with platters of smoked tamarind chicken wings and fragrant turmeric rice nestled among miscellaneous objects I may or may not be supposed to eat. Among them: knobby whole yucca and cassava roots stuck with blades of dried grasses and mounds of what I thought was pink sand but later find out is kosher salt dyed with hibiscus powder.Yardy's charred okra salad with pickled red onions, pickled carrots, and lime zest.\nThere aren’t enough serving utensils—and actually, there aren’t even tables to sit at—but no one seems to mind using their hands to dig into the spread. And the meal is only the beginning. As the night goes on, new friends pass rum cocktails and thick slices of coconut cake while we listen to a panel led by Francis on the erasure of black lesbians from the AIDS movement. We go back for seconds of rice and wings before a spontaneous dance party strikes up, the room a blur of sequins and glitter and neon.Francis throws pop-up dinners like these through his food and events company, Yardy, and he attracts a steady (and steadily growing) crowd of NYC creative types. The son of immigrants, Francis adopted the name Yardy from the patois word yaadie, a colloquial term of endearment that Jamaicans and Jamaican-born Americans call one another to acknowledge that they come from the same place. And although Yardy parties are a way for Francis, 26, to explore his own relationship to his Caribbean heritage through food, he also sees them as a platform to promote and support queer and migrant culture. “I think of Yardy as this house for people who are trying to find their way back home, figure out who they are, and learn about where they come from,” he says.The night's attendees included Lalito executive chef Kia Damon.\nPhoto by Emma FishmanFrancis has quickly become a prominent face of a new generation of chefs who are reshaping what it means to eat out right now. Pop-up dinners like Yardy, Savage Taste in L.A., and Babetown in New York are as much about creating welcoming community spaces as they are about the wildly creative food on your plate. Many of these events are run by people like Francis, who didn’t go to culinary school or spend years working the line in restaurant kitchens. They’re not obsessed with best-of lists or critics’ reviews. They’re cooking food that’s driven by a desire to honor their personal experiences.Francis frequently collaborates with other chefs, makers, artists, and small-business owners who are committed to increasing queer visibility through food. Past Yardy affairs have included a dinner with Andre Springer, whose drag alter ego Shaquanda Coco Mulatta is the face of his Barbadian hot sauce brand, Shaquanda’s Hot Pepper Sauce, and a dance party with Papi Juice, a Brooklyn-based DJ collective that throws events for queer and trans people of color.Even with dozens of dinners under his belt, Francis is still reluctant to call himself a chef. He likes to cook, sure, but he also likes to write, give talks, and make art. He’d much rather spend his free time making custom placemats printed with articles about Jamaican politics than learning about the differences between velouté and béchamel. Food will always be the lens of his work, but he doesn’t feel the need to be defined by his cooking.“I don’t want to serve food that makes you feel like you have to focus so much on the actual food,” he says. “Forcing people to use their hands, walk around, pick up things—that’s what makes a dinner interesting.”Creative director Jae Joseph.\nPhoto by Emma FishmanPeppa shrimp with coconut and lime.\nPhoto by Emma FishmanYardy co-chef Charlie Anderle.\nPhoto by Emma FishmanArtist and writer Sable Elyse Smith.\nPhoto by Emma FishmanExplore Bon AppétitHealthyishEventsprofileThe Healthyish 22TrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Christina Chaey"]}