{"id": "5bb9b4cfc05eef630a69b92c92323c84", "url": "https://www.bonappetit.com/recipe/spicy-spinach-and-sausage-frittata-affogato", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Spicy Spinach & Sausage Frittata Affogato Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesSpicy Spinach & Sausage Frittata Affogato2 RatingsFacebookPinterestTwitterEmailFor the cook who loves breakfast for dinner.PrintIngredientsSpicy Spinach & Sausage Frittata Affogato2 tablespoons unsalted butter½ pound loose sweet italian sausage (or removed from two standard links)5 packed cups baby spinach (5 ounces)12 large eggs1/4 cup whole milk½ cup plus 2 tablespoons finely grated parmesan cheese (1 3/4 ounces)Kosher salt, freshly ground pepperOne 24 oz. jar Rao’s Homemade Arrabbiata sauce4 ounces low-moisture mozzarella cheese, thinly sliced¼ cup loosely packed basil leaves, torn if largeRecipe PreparationInstructionsPreheat the oven to broil with a rack in the upper third. Melt the butter in a 10-inch nonstick ovenproof skillet over medium-high. Add the sausage and break up meat into small pieces with a wooden spoon then spread out in the pan to create a single layer. Cook, undisturbed, until the bottom side is browned and crisp, about 3 minutes. Break up meat again and turn over pieces. Cook until the other side is browned and crisp and meat is cooked through, about 3 more minutes.Increase the heat to high and add the spinach. Cook, tossing with tongs, until the spinach is wilted and all the liquid has evaporated, about 3 minutes.Meanwhile, using a fork, beat the eggs with the milk until well combined. Beat in ½ cup of parmesan, 1/2 teaspoon salt, and ¼ teaspoon pepper.Pour egg mixture into skillet; cook over medium-high, slowly stirring with a spatula, scraping the bottoms and sides, to create large curds, until eggs are wet on top but otherwise set throughout, 2 to 3 minutes.Transfer to oven; broil until puffed and browning in spots and eggs are just set, about 3 minutes.Remove from the oven and spread Rao’s Homemade Arrabbiata sauce over the top of the cooked frittata. Arrange the mozzarella over the sauce. Return to the oven and broil until sauce is hot and cheese is golden and bubbly, 4 to 5 minutes.Top with remaining 2 tablespoons of parmesan and basil leaves. Let stand 5 minutes before slicing.Recipe by Rao’s Homemade®Reviews SectionReviewsWrite a review…This is delicious!!! I've made it several times and it's a huge hit. This recipe is so easy and versatile. It's now my go-to Friday night dinner instead of pizza. Dinner, breakfast, brunch, DELICIOUS!!! \nThe last time I made it I only had 10 eggs, and it turned out just fine. I also cut back on the sauce a bit. I don't eat pork but found a delicious chicken sausage substitute. AnonymousNashville, TN09/12/19This is delicious.  I baked the frittata to set the eggs, and broiled it after adding about 3/4 of the jar of sauce and the mozzarella.  I’ll definitely make this again.Maggie945Alamo CA05/31/19GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitRao’s Homemade®SponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2019-12-09", "author": ["Rao S Homemade"]}