{"id": "5bbb6a885b71def0eb19cf2e54a0ff05", "url": "https://www.bonappetit.com/recipe/bas-best-chocolate-chip-cookies", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "The Best Chocolate Chip Cookie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best Chocolate Chip CookiesBy Chris MoroccoDecember 14, 20214.5(1313)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintBA’s own Chris Morocco spent months (truly) developing these chocolate chip cookies—making nearly 30 batches, plus 10 more in the cross-testing phase—to ensure they were the absolute best they could be. What makes this recipe deliver on that promise? Crispy edges, a chewy center, and a recipe that turns out consistently delicious homemade chocolate chip cookies every single time—all without a mixer.The browned butter is key to this recipe, helping it stay rooted in classic cookie flavor while also contributing to that perfect balance of crisp-chewy textures—an ideal combo whether you dunk your cookies in milk or not. The quality of the vanilla is also important here; Chris recommends Heilala or Neilsen-Massey, which both have enough heft to stand up to bitter chocolate and molasses-y dark brown sugar.There’s no machinery required and minimal cleanup, meaning there’s no excuse not to make these. But if your Platonic ideal of a chocolate chip cookie recipe includes nuts, oats, and seeds, this one has you covered. And if you want cookies with a more earthy, nutty flavor, give this salty buckwheat chocolate chip recipe a try.Editor’s note: This recipe was originally published April 25, 2019.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronGuittard 70% Bittersweet Cocoa Baking Bars$28 $25 At AmazonMedium #40 Cookie Scoop$16 At AmazonGet It Right Spatula$13 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketLadle$8 At AmazonLadle$27 At AmazonIngredientsMakes 161½cups (200 g) all-purpose flour (spooning into measuring cups, then leveling)1¼tsp. (4 g) Diamond Crystal or ¾ tsp. (4 g) Morton kosher salt¾tsp. (4 g) baking soda¾cup (1½ sticks; 169 g) unsalted butter, divided1cup (200 g) (packed) dark brown sugar¼cup (50 g) granulated sugar1large egg2large egg yolks2tsp. vanilla extract6oz. (170 g) bittersweet chocolate (60%–70% cacao), coarsely chopped, or semisweet chocolate chipsPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 375°. Whisk flour, salt, and baking soda in a small bowl; set aside.Step 2Cook ½ cup (1 stick; 113 g) butter in a large saucepan over medium heat, swirling often and scraping bottom of pan with a heatproof rubber spatula, until butter foams, then browns, about 4 minutes. Transfer butter to a large heatproof bowl and let cool 1 minute. Cut remaining ¼ cup (½ stick; 56 g) butter into small pieces and add to brown butter (it should start to melt but not foam and sizzle, so test with one piece before adding the rest).Step 3Once butter is melted, add both sugars and whisk, breaking up any clumps, until sugar is incorporated and no lumps remain. Add egg and egg yolks and whisk until sugar dissolves and mixture is smooth, about 30 seconds. Whisk in vanilla. Using rubber spatula, fold reserved dry ingredients into butter mixture just until no dry spots remain, then fold in chocolate (the dough will be soft but should hold its shape once scooped; if it slumps or oozes after being scooped, stir dough back together several times and let rest 5–10 minutes until scoops hold their shape as the flour hydrates).Step 4Using a 1½-oz. scoop (3 Tbsp.), portion out 16 balls of dough and divide between 2 parchment-lined rimmed baking sheets. Bake cookies, rotating sheets if cookies are browning very unevenly (otherwise, just leave them alone), until deep golden brown and firm around the edges, 8–10 minutes. Let cool on baking sheets.Do Ahead: Cookies can be made 3 days ahead. Store airtight at room temperature.How would you rate BA’s Best Chocolate Chip Cookies?Leave a ReviewTell us what you thinkReviews (815)Back to TopTriangleThis is my ultimate favorite way to make chocolate chip cookies now. Nicole D.930363/21/2022A lot to like about these, flavor wise.  I followed the recipe to the letter, and used gram weights.  My only issue is that the cookies spread to a degree that was not what I wanted.  4 1/4 inches.  Jeff WinettSherman Oaks, California3/8/2022My family has had me make this recipe every day for the past week!! Loved it. I prefer  Callebaut 54.5% chocolate or Valrhona personally and that’s what I used. I also used Kerry Gold butter. To me the browned butter made an amazing difference!  I ended up with 20 cookies using a #40 scoop and 9 minutes of baking. They came out perfect every time ! Thank you !! Lisa in Georgia Griffin GA2/23/2022These cookies are delicious, my only recommendation is to use a thicker cookie sheet - they baked much more evenly and the edges didn't get too dark. This was my first time making them and they turned out great.LaurenOntario, Canada2/17/2022Followed recipe to a T.  Using a 3 tablespoon scoop, confirmed by measurement, my batch produced only 12, not 16, cookies.  I did not have Guittard baking 70% bar, so like directions said, I used a 70% chocolate bar (Lindt) and chopped each square into four rough squares. I cooked cookies for 8 minutes.  This produced oversized, under cooked cookies with melted ponds of chocolate streaming from and over cookies, a mess.  Directions should have called for 70% baking chocolate.  Also, the math suggests a 2 to 2.5 tablespoon scoop, not 3.  Cookies have promise, so I will make again with Guittard baking chocolate and a 2 to 2.5 tablespoon scoop.AnonymousFlorida2/17/2022When cookies come out of the oven, drop the cookie sheet on the counter a few times to condense the baked cookies. Makes them more dense and chewy. Excellent recipe. AnonymousColumbus 2/16/2022I would like to know if those who said the cookies were too salty are\na) using unsalted butter? \nb) using kosher salt per the amounts per brand noted in the ingredients? Kenneth AthonFort Wayne2/15/2022These cookies are super. But, even more super are the ones made by Ricky Martinez. They have brown butter as well as dark chocolate disks rather than chips. They are called Brown Butter and Toffee Chocolate Chip cookies. They are to die for. I have made them many times.Sylvia PrydeMississauga, ON in Canada2/15/2022These cookies are by far my favourite! Not sure why the bad reviews, but everyone has their preference in cookies I suppose. Yes these bake flat, they will spread ALOT. They will have crispy edges and a chewy centre, and you will taste the salt. I love that in a cookie! I’ve made several times and have a few trial and error tips:\nI find if you over mix (even a little) they will come out more cakey. I usually mix the dry into the wet until almost no dry streaks remain, then I fold in the chocolate. That way by the time the chocolate is incorporated the dough is perfectly mixed.\nBrown butter will go from brown to burnt very quickly! Stir every few seconds once it starts to brown and be sure to transfer to a bowl once browned (as the recipe states) to stop the cooking process \nAlso I find they take different cook times depending on the day? I just put them in and watch carefully and then pull them out when they’re done. Delicious!!Anonymous2/14/2022kinda shocked reading these reviews...ive made this cookie OVER AND OVER ...always perfect.\nann Barizona2/13/2022Its trash Fortnite bugar is betterAnonymousDubai, UAE2/10/2022Good flavors but flawed from a technical standpoint. The batter spreads far too much. Definitely need to chill these in the fridge so that the batter can reach a consistent temperature and resist turning into a puddle. Adam2/7/2022This was terrible you have to stir and stir to make the flour brome streatchy it turned into a big blob of burnt butter and sugar. Why I’m the world would you put to use kosher salt yet it makes the whole cookie after taste salty as all get out. Not good at all. I thought oh man brown butter seems like it would be great until I tasted a cookie. Never would cook this again. It needs to be wrecked so badly. Go back to the kitchen this one don’t work. Don’t waste your ingredients in it. Dawn Usa2/4/2022Love the concept behind this - a little extra work to brown the butter, etc. However, I feel like BA's Best for a chocolate chip cookie shouldn't be easy to mess up, and these baked totally flat for me. I even measured ingredients using a scale. I'm sure there's a technique I'm not getting, but I'd love a simpler recipe that you endorse.Laura BNashville, TN2/3/2022The best chocolate cookie recipe I've ever used!Anonymous2/2/2022Explore Bon AppétitCookieDessertChocolateOther IngredientsSnackBakingSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Chris Morocco"]}