{"id": "5bbf2fd1115b72a401442bdd343c0f45", "url": "https://www.bonappetit.com/story/forthave-red-aperitivo", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "My Favorite Campari Substitute Is This American Aperitivo | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’ll Always Love Campari, But This American Aperitivo Is My New One and OnlyMaking your negroni or spritz more interesting is as easy as buying a bottle of Forthave Red.By Alex DelanyMarch 6, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWelcome to Glass Half Full, a monthly column from drinks editor Alex Delany about what he’s drinking (and loving) right now.Chances are you’ve had an aperitivo before. If you’ve ever ordered a negroni, an Aperol spritz, or an Americano (the cocktail not the coffee), then you’ve definitely tasted the bitter, rosy-hued Italian pre-dinner liqueur.Chances are also high that whatever you’ve been drinking—whether Campari, Aperol, Cappelletti, or Luxardo Bitter—probably came from Italy, where hyper-regional aperitivi are part of the culture. Or at least, that would have been the default up until a few years ago, when the United States decided to get into the game.We happen to be living in a new era of American aperitivo. Right now, small producers in cities like San Francisco, Washington D.C., and Denver are turning out their own delicious expressions of the appetite-inducing liqueur, bringing a range of new flavors and formulas to what Italy’s Campari-adjacent classics (typically reliant on dried bitter orange) already offer. Each label macerates a different blend of spices, barks, herbs, fruits, flowers, roots, and leaves from near and far to create unique flavor profiles, but my favorite of the bunch is Forthave Red, made in a cozy, single-room facility Bed-Stuy, Brooklyn.This negroni gets even better with my No. 1 Campari substitute.\nPHOTO BY CHELSIE CRAIGWhat makes it my number one? In short: balance. A lot of aperitivi lean on bold, aggressive flavors to separate themselves from the rest of the pack. But in Forthave Red, no ingredient shouts over the others. The notes of bright orange and floral honey and gentle chamomile and bitter rhubarb are all having a civilized, lovely conversation with one another, packing a bright bitterness and warm spice that you can taste in each sip.Speaking of sipping, while I’ll use Red the same way I use the Italian stuff—subbing it in for Aperol for a more nuanced spritz or as a Campari substitute in a Boulevardier for a tad more vegetal bitterness—my favorite way to drink it is alone in a rocks glass, with a single ice cube. If that’s not a testament to how balanced and layered and downright delicious Red is, then I don’t know what is.Right now, you can find Red in cities like New York, Los Angeles, Philadelphia, San Francisco, and Washington D.C. And if you don’t happen to live in those areas, I’d say get your hands on whatever you can find in the city you’re in. You know, like the Italians do.Explore Bon AppétitGlass Half FullRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-06", "author": ["Condé Nast", "Alex Delany"]}