{"id": "5bc3962a124abbec4e8c252cab2bb6f0", "url": "https://www.bonappetit.com/story/meal-prepping-anxiety", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Meal Prep Helped Me Deal with My Anxiety, Then Made it Worse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMeal Prepping Helped Me Deal with My Anxiety, Then Made it WorseI knew I had to stop obsessing over the contents of my fridge.By  Aleksandra AppletonMay 17, 2018FacebookTwitterEmailFacebookTwitterEmailAt the end of my first week living alone, I became convinced I was going to starve. I didn't cook much, but I had come to expect scrambled eggs in the morning before class. It was 11 p.m. and my fridge was bare except for some candy corn I had bought long before Halloween. I panicked, plotting to get an early start to go to the grocery store or swing by a coffee shop, but found myself fretting again at the thought of waking up late or missing the bus. Logically, I knew I would be fine without breakfast. But my brain was fixated on eggs as a necessity. So I left my apartment in my pajamas to find a store open past midnight that might have a half dozen.I didn’t know it then, but these endless trains of doubt and worry that preceded my every routine task were the hallmarks of an anxiety disorder. When meal prepping first found its way onto the food and culture sites I frequented, it seemed like the perfect way to eliminate that anxiety by planning out what I had often left to last-minute whims and Seamless. I set aside a Sunday to shop for the ingredients I needed for a big batch of chicken burrito bowls, breakfast sandwiches and salads. Overwhelmed at the grocery store, I spent over $200 on bok choy, at least half a dozen avocados, turkey bacon, and organic snacks.For a while, meal prepping worked exactly as it was supposed to. With breakfast ready in the mornings, I could get to my classes on time, and I'd look forward to coming home for a ready-made and healthful dinner. I didn’t even mind the repetitiveness of eating overnight oats and chicken with roasted vegetables every day for a week. It was reassuring.But I often underestimated how hungry I would be on a day of work and classes. I would eat my preallocated lunch and my snack, but be starving long before dinner time. I grew frustrated with my appetite for not sticking to the schedule, although I realized it was a fault of my poor planning and that I still needed to eat. But on top of that, I felt like I couldn't go out to eat if I already had a dinner prepared and had spent a big chunk of my time and money making it. I was back where I started: thinking obsessively about what was in my fridge, even adding my meals to my planners.My breaking point came when I got home one night to find that my bananas had gone bad before I could make the smoothies I was counting on. Paralyzed with indecision and guilt, I went to bed hungry rather than swerve from my plan. When I finally talked to a therapist, she clued me in to the fact that it's impossible to be truly prepared for everything. She asked what I would do if I got sick on the day I set aside to batch cook, or if my freezer meals were freezer burned. I was at a loss. I realized as she guided me that instead of making plans for those eventualities too, that I would be better served developing the ability to improvise.I didn't cease meal prepping entirely, especially for lunches on busy workdays. But I did make some changes, including budgeting for takeout. Once I started building loose menus for the week based on what was in season and on sale, grocery shopping came more naturally. I also learned to always have on hand the ingredients I needed for a few simple meals like pesto pasta. Because I know they’re such a staple for me, I also always pick up a dozen eggs whenever I go to the store.Meal prepping was supposed to make things easier, but it actually made my anxiety worse as I fell short of my plans every week. One essential step I had missed was actually learning how to cook: I overcooked rice and chicken to flavorless rubber.When I relieved myself of the pressure to make meals for a whole week, I gave cooking another chance. I went back to a fried rice recipe I had first prepped, going slowly, paying careful attention to the ratio of water to rice. I mixed in frozen vegetables, tossed it with soy sauce and topped it, of course, with a fried egg.Explore Bon AppétitHealthyishMeal PrepessayRead MorecookingWhy I Hate Meal Prep and How I Feed Myself Without ItBy  Lizz SchumerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Aleksandra Appleton"]}