{"id": "5bc92eec8ced14024a424d43e7b5bf26", "url": "https://www.bonappetit.com/story/labor-day-sales-2021-2", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "27 Best Labor Day Sales (2021) For Your Kitchen, Campsite, Dining Room and Beyond | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe 27 Best Labor Day Sales for Your Kitchen, Campsite, Dining Room and BeyondBreville espresso machines, Dyson vacuums, plus Le Creuset, Instant Pot, and Smeg—all on saleBy Tiffany HopkinsSeptember 3, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The end of summer has us feeling all the feels. Goodbye, peak season tomatoes! We’ll miss you, dining al fresco sans jacket! But some solace: The best Labor Day sales are here. There is no better time to finally move that Vitamix from your virtual cart to your actual kitchen. This weekend through Tuesday, you can score big on everything from stand mixers (for all the fall apple pies in your future) to outdoor fire pits (because those s’mores aren’t going to toast themselves). Whether you want to save or splurge, we’ve found the best Labor Day sales 2021 to quell your end-of-summer sadness.AmazonWeber Spirit II 2-Burner Propane GrillGrilling isn’t a season—it’s a whole personality. Labor Day is the perfect time to snap up deals on high-quality grills like this propane Weber, which comes with side tables and a built-in thermometer.\n$551 $459 at AmazonSur La TableCourtesy of Le CreusetLe Creuset Enameled Cast-Iron Sauteuse Oven (3.5 Qt.)Take $120 off this enameled cast-iron sauteuse (like a small Dutch oven with gently sloping sides) or—if you’re feeding a crowd—Le Creuset’s 8-quart signature oval Dutch oven.\n$180 at AmazonPhoto by Emma FishmanOXO Locking Tongs with Nylon HeadsYou can never have too many tongs, so take advantage of this buy-two-get-one-free Labor Day sale at Sur La Table.\n$13 at Sur La TableAll-Clad Stainless Steel Skillet with LidAn All-Clad sale is a very big deal. Sur La Table has deals on stainless-steel skillets and saucepans as well as nonstick pans and even a barbecue tool set.\n$180 $100 at Sur La TableThermoWorksTake a very specific 18% off all full-priced ThermoWorks products using the code SHAREBBQ.Photo by Emma FishmanThermoPop ThermometerIf you cook meat, an instant-read thermometer like the ThermoPop will change your life.\n$35 $21 at ThermoWorksPhoto by Emma FishmanThermoWorks DOT ThermometerThanksgiving will be here before you know it, so if you don't already have an oven thermometer, now is the time to get one. Our favorite is ThermoWorks' DOT Thermometer, which comes with a probe that you can insert into your bird before popping it in the oven.\n$45 at ThermoWorksDysonDyson V8 Fluffy vacuumSome of the best Labor Day sales are on vacuums, including this cordless Dyson model. The V8 Fluffy has two different power modes, easily transforms to a handheld, and has a 40-minute run time.\n$400 $300 at Dyson$429 at AmazonMisenEnter the code READYFORFALL for 20% off on all Misen products.Essentials Knife SetPSA: You don’t need a bulky 15-piece knife set! A chef’s knife, serrated knife, and paring knife can handle almost all of your kitchen cutting tasks. This set from Misen is designed to help you achieve the perfect pinch grip and is made with durable high-carbon stainless steel. \n$180 $150 at Misen2-Quart SaucierThis stainless steel saucier’s rounded walls make stirring and whisking a breeze—and the cleanup even easier. Never fear homemade chocolate sauce again! \n$85 at MisenDutch OvenThe forecast: Braising, braising, braising. Get prepared for stew season with this high-quality Dutch oven (minus the $400 price tag). It’s made with premium enamel and has a cast iron core for durability that’ll last a lifetime.\n$165 $132 at MisenMYSA WineScore free shipping on three or more bottles using code LABORDAY at check out. A bevy of individual bottles of natural wine are also on sale, including selections from Swick, Gut Oggau, and Domaine de L'Octavin.Photo by @hellopiacereMYSA Natural Wine Club SubscriptionPlus take an additional 5% off the first month of MYSA's wine club subscription—which translates to 20% off total—using code CLUB20.\n$150 $105 at MYSA WinesCorkciclePhoto courtesy of CorkcircleNeon Lights CanteenThis colorful canteen has a soft, buttery finish and triple-insulated walls that’ll keep iced water cold for 24 hours and coffee hot for 12. But let’s be honest: We mostly love it for keeping wine at the perfect temp.\n$30 $24 at CorkciclePhoto courtesy of CorkcircleBaldwin Boxer Insulated LunchboxEquipped with handles and an adjustable strap for holding your matching canteen, this floral lunch box was designed to take on the go and maintain the temperature of your food for hours.\n$60 $48 at CorkcicleMaisonetteMaisonette is offering discounts of up to 40% this Labor Day weekend. Plus, take an extra 10% off sale items using code FUN10.Aegi Ceramic ContainersSure, they’re for babies. But you don’t have to be one to use these cute ceramic containers (with airtight silicone lids) for snacking on the go. \n$38 at MaisonetteHomesickUse the code WAVES for 20% off.Ciderfest Candle BundlePumpkin! Apples! Fall spices! This Ciderfest Bundle includes two fragrant soy candles that’ll make you feel like you just dived into a pile of autumn leaves.\n$68 $54 at HomesickBurrowThis Labor Day Weekend through September 12, use the code LDW21 to save up to $750 off on all Burrow orders.Bar cartCall it a bar cart, a plant cart, a cookbook cart—or an anything cart. With a powder-coated metal frame, two plywood trays, and functional wheels, it’s ready to roll however you do. \n$295 $265 at BurrowMINNAMINNA is offering site-wide savings from September 3–6. Save 20% on orders up to $500; 25% on orders between $500–2,000; and 30% for orders over $2,000. Discount is applied at checkout, no code needed.Photo courtesy of MINNAGrid Apron CreamWe’ve got our eye on this sustainably made cotton apron, which features adjustable ties, a front pocket, and loops for holding all of your kitchen tools.\n$125 $95 at MINNAEast Fork MugAsheville, North Carolina–based brand East Fork makes some of our very favorite ceramics. Sip your coffee in style with this perfect mug glazed in a creamy panna-cotta-hued mug.\n$38 at MINNALagos Del Mundo Recycled Glass TumblersLike the best outfits, this set of two recycled glass tumblers will take you from fresh OJ in the morning to a boozy spritz at night.\n$30 at MINNAPhoto courtesy of MINNAYIELD Ceramic French Press Matte SandMeet your new a.m. best friend. This heavy-walled, ceramic press pot maintains consistent temps and brews delicious full-bodied coffee.\n$120 at MINNAJCPenneyInstant Pot 6qt Vortex Air FryerYes, the Instant Pot Vortex can air-fry your potato wedges to a crisp—but it can also roast, broil, bake, reheat, and dehydrate. Just press a button and let this thing do all the cooking for you.\n$160 $70 at JCPenny$130 at AmazonBioLiteBioLite AlpenGlow LanternBioLite is offering 20% off site-wide for Labor Day Weekend. We’re all about this portable, rechargeable LED lantern with programmable lighting modes like flickering candles and fireworks (!). Use it everywhere from your backyard to the campsite.\n$60 $45 at BioLiteBioLite FirePit+Enjoy the warmth, smell, and crackle of a campfire—minus the smoke. The BioLite FirePit+ can burn wood and charcoal, and it doubles as both a grill and portable pit. Consider this your route to COVID-safe outdoor hangs even once summer ends.\n$250 $200 at BioLite$250 at AmazonGOLDEPhoto courtesy of GoldeMatcha Turmeric Latte BlendMade with stone-ground Japanese green tea leaves, creamy coconut milk powder, turmeric, ginger, and cardamom, this (warm or cold) beverage blend has layers of flavor and, according to Golde, will help you focus—ideal for anyone heading back to campus.\n$30 $26 at GOLDEWayfairSMEG Retro RefridgeratorWayfair is offering up to 70% off site-wide during their Labor Day sale. Meaning: It’s the perfect time to add a statement appliance to your kitchen. This retro SMEG fridge (and freezer) is equipped with a multi-flow system for even air distribution, electronic temperature control, and adjustable shelving. Plus, owning one will make you feel cooler than the food that’s in it.\n$3,300 at WayfairBreville Espresso MachineWith a built-in grinder, electronic temperature control, and micro-foam milk texturing, the Barista Express means you can pull delicious, cafe-level espresso in the comfort of your pajamas.\n$1,000 $700 at WayfairCuisinart SmartPower™ Duet 500 Watt Blender/Food ProcessorMake smoothies, chop vegetables, and slice cheese with one device. The SmartPower Duet combines a blender and a food processor into a single tool with seven different speeds, a 48-ounce blender jar, and a 3-cup bowl capacity.\n$180 $87 at WayfairLe Creuset Cast Iron Signature SkilletA cast-iron skillet makes almost everything better, and once you have one you’ll keep it forever. Le Creuset’s has an enameled surface that doesn’t require seasoning, helper handles to make lifting easier, and two spouts for mess-free pouring.\n$155 $120 at WayfairExplore Bon AppétitShoppingLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-02", "author": ["Condé Nast", "Tiffany Hopkins"]}