{"id": "5bed6de9af38c50c0795bd72a0e88cb4", "url": "https://www.bonappetit.com/story/not-just-magazine", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Bon Appétit Used to Just Be a Magazine. Not Anymore. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBon Appétit Used to Just Be a Magazine. Not Anymore.Eight years into my tenure as editor in chief, things look very different than they used to.By Adam RapoportMarch 26, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A few months back I somehow ended up on Reddit, reading a comments board composed entirely of fans of Bon Appétit’s YouTube channel. One user wondered where we shot all of our cooking videos. Another quickly chimed in: “I’ve heard them refer to the space as ‘the Bon Appétit test kitchen.’”Oh. My. God.It hit me that half the people on this thread—which, I imagine, fairly represent our 3.4 million YouTube subscribers—had no idea what Bon Appétit is. That we are a magazine. Or, at least, we used to be just a magazine. Or, still are—but that we now do all sorts of other things. Or...Okay, so maybe Bon Appétit is a bit harder to explain these days. Just looking around the office reminds me how rapidly things have evolved since I edited my first (print) issue of BA eight years ago.Minutes before this photo was taken, for instance, I was chatting with associate editor Hilary Cadigan, who’s 31. I mentioned that the average reader of our magazine is basically the same age as her salt-and-pepper-haired editor in chief. I nearly had to help her pop her eyes back in her head.Want this letter before it hits the website? Sign up for our newsletter!And I can’t blame her. The audiences for the Instagram feeds of Healthyish, Basically, and BA—how so many people, including most of us on staff, stay in touch with the brands—skew far younger. Same goes for our YouTube channel, our podcast, and all the events we host.But as I constantly like to remind our editors, they’re all connected, including, of course, the magazine. And that’s by design. If you’ve ever watched our videos—Brad making kombucha and kvass, Claire reverse-engineering Twizzlers (from scratch), Carla and Andy and Molly and Chris cooking so many of the delicious recipes you see on these pages—then you know that our editors do plenty of multitasking.Amanda Shapiro, who wrote the beautiful profile of Samin Nosrat in our latest issue, spends her “day job” editing Healthyish. Amiel Stanek, who edited our guide to a more sane, more organized kitchen in that same issue, also oversees our learning-to-cook site, Basically. And if you’re a fan of our podcast, you’ll hear him later this month, talking through that article.And that’s the essence of all things BA—the editors who develop our recipes and conceptualize our stories are the ones who star in our videos, whose iPhone photos fuel our Instagram, who guest-star on our podcast, who host our food festivals and live events.So yes, Bon Appétit is a magazine. And it isn’t. And I’m more than okay with that. As a lifelong print editor who loves the permanency of the medium and the rigor of the editing process, I’ll always cherish the privilege of being able to make something so beautiful and so lasting, month after month.But I also know that smart, engaging content resonates no matter the platform or the medium—or the age of the reader (or user, or viewer, or listener).So what’s Bon Appétit in 2019? It’s whatever you want it to be. Even a magazine.Cheers,Adam RapoportEditor in chiefExplore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-26", "author": ["Condé Nast", "Adam Rapoport"]}