{"id": "5c38680214535476b2db133e09d88fdd", "url": "https://www.bonappetit.com/story/how-to-make-guacamole", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Learn How to Make Guacamole at Home, Never Resort to Store-Bought Stuff Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Guacamole Is the Guacamole You Make YourselfLeave that store-bought stuff on the shelf.By Alex PastronJuly 26, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.My old roommate used to say that true luxury meant buying pre-cut fruit. Yes, the mark-up was more expensive than we could afford on our part-time restaurant salaries, but, he argued, the joy of eating a mango already peeled, sliced from its pit, and cubed into bite size pieces was priceless. This same logic applied to store-bought guacamole. No need to de-pit an avocado or dice an onion. To which I would say, No. More. Store. Bought. Guac!!!Here’s the thing: When chip comes to dip, there is no substitute for fresh avocado, and the neon-green mush that comes vacuum-sealed in the refrigerator aisle just does not compare. Besides, basic guacamole only requires five ingredients, a knife, a spoon, and a fork. It’s quite possibly the easiest thing you can make second only to pasta—and it doesn’t even require you to turn on the stove!Start by getting out your knife. For guac that’ll feed four people (or, more realistically when you break out that bag of chips, two), start by roughly chopping ½ red onion (you can also use white) and a ¼ cup cilantro. If you’re one of those people who just can’t stand cilantro, that’s okay—give it a pass. Next, halve a lime in two.Need an actual recipe? BA's Best Guacamole has you covered.\nSet that all aside while we tackle the jalapeño. Cut off the top of you pepper and halve it lengthwise. Then, if you prefer your guacamole on the milder side, scrape out all of the seeds and the white ribs. This is where most of the heat lives (in the form of the chemical compound capsaicin), so if that’s not your speed, go ahead and toss ‘em. If you like to live life on the wild (read: spicy) side, leave a bit of those seeds and ribs behind. (And if you want your guacamole really spicy, go with a serrano instead.) Finely chop the pepper and then—and this part is non-negotiable—wash your hands as soon as you’ve finished to avoid getting hot pepper essence anywhere other than in your guac.Finally, grab 3 large ripe avocados. Ripe avocados are soft but not squishy: They’ll yield when gently squeezed—you’ll feel like you could leave a lasting indentation in the skin if you pressed hard with your thumb (but not like you could smush the whole thing in your hand). If the avocados aren’t ripe, your guacamole is, well, doomed to be dry and bland rather than creamy and luscious. It’s worth it to wait a few days (or plan in advance!) rather than rush the process.Pit the avocados (carefully), then use a spoon to scoop out the meat from the skin. Give them a rough chop (about ¼-inch) before tossing them into a bowl. Use a fork (or a potato masher if you own that sort of thing) to lightly mash the avocado, erring on the side of less-mashed than more-mashed. We’re aiming to preserve some texture—this is a dip, not sauce or spread. Gently stir in the red onion, jalapeño, and cilantro, careful not to over-mash your avocado in the process. Squeeze in the juice of half a lime and 1 teaspoon salt, for starters.Now the fun part: Give it a taste! Needs a little more acid? Squeeze in the other half of the lime. Still not salty enough? Add more, a little bit at a time, until that guacamole is as addictive as what you’d pay $10 for at the restaurant down the street. Don't be surprised if you need more salt and lime juice than you think seems reasonable—avocados are mild and subtle without something to wake them up.Serve with tortilla chips or just go ahead and eat it by the spoonful. You can do this sort of thing now that you know how to make it better than any supermarket brand ever could.You know what would go well with some guacamole...Honey-Chipotle Shrimp TacosThese easier-than-easy shrimp tacos are packed with flavor, and ideal for busy weeknights.View RecipeExplore Bon AppétitIt's That SimpleGuacamoleAvocadoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-26", "author": ["Condé Nast", "Alex Pastron"]}