{"id": "5c432936c8741eb875d7e39ee9c7e3e6", "url": "https://www.bonappetit.com/story/what-your-restaurant-tote-says-about-you", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "What Does Your Restaurant Tote Say About You? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Does Your Restaurant Tote Say About You?The answer: A lot more than just your taste in food.By Alex DelanyMay 22, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf a picture is worth a thousand words, then a tote counts for at least ten thousand. When you carry a tote bag, you’re essentially hauling around a billboard that says, “Hey! Look! This is what I’m all about! Judge me!” Okay, maybe not judge me, but we all know these rudimentary canvas sacks are more than just a carryall: They’re signposts for the crews we belong to. These days, we’ve noticed more and more totes for restaurants, wine stores, and coffee shops showing up on shoulders, doing the work of announcing who we are and what gets us going. So what does your tote say about you? Read on to find out.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Photo by Chelsie CraigMomofuku, New York CityYou’ve seen every episode of Ugly Delicious. And The Final Table. And Salt. Fat. Acid. Heat. And Chef’s Table (and yes, we know you it makes you really emotional). If there’s a food show streaming somewhere, you’ve already binged it. You’re spending all your time with David Chang, Samin Nostrat, and Philip Rosenthal you’ve barely left the house to go see your real friends. But you swear you will...after you finish Street Food. Only three more episodes to go.What’s in it: Pocky. Zapp’s Potato Chips. BjornQorn. Haribo gummies. And a case of La Croix.Photo by Chelsie CraigMiddle Child, PhiladelphiaYou design interiors. Okay, you decorated your apartment, at the very least. You love pointing out brutalist architecture. You understand the relevance of the Memphis movement. And at this point, you’ve explained the impact of the Eames Lounge Chair more times than you can count. (Molded plywood was revolutionary, folks!) Design of just about any kind is very much your bag, which is why a restaurant like Middle Child, with its deliciously well-constructed sandwiches, checks all your boxes. Finish your corned beef, egg, and cheese sandwich and grab that geometric tote—you’ve got to go find a place to read the Sight Unseen newsletter.What’s in it: Vintage IKEA catalogues. A Hay Design water bottle. A notebook (with grid-lined paper, of course). And some fancy pencils you paid way too much money for.Photo by Chelsie CraigElena x Pumpui, MontrealYou’re a multi-tasker. You constantly juggle gigs, plans, dates, and the occasional party. That’s why you like a tote that represents two restaurants at once. It also helps that one of those spots, Elena, is a pizza joint, wine bar, and coffee shop all in one. You thrive as a member of the Slash Generation, spending your afternoons taking calls while eating your naturally leavened potato and Parm square slice, and your evenings eating dinner with close friends who are also your business partners. We admire your efficiency. Keep up the hustle.What’s in it: Your laptop. Noise-cancelling headphones. Three chargers. Business cards. A thermos full of coffee. A daily planner. And a pen...in there somewhere...Photo by Chelsie CraigRolf and Daughters, NashvilleTo you, restaurant merch is as much a part of everyday life as breathing or eating sourdough bread. You’re a restaurant swag OG, and you respect the industry’s institutions—like the South’s finest purveyors of handmade pasta and heritage pork ragout. You’ve been rocking quirky, in-the-know culinary gear forever, or at least since Rolf and Daughters started doing simple screen-printed goods in 2012. What’s that? Seven years ago? Yeah, forever. It takes years to develop merch taste like yours.What’s in it: Another restaurant tote. A baseball cap from your hometown deli. And a collab t-shirt your friend from the pizza shop (which will remain unnamed for her sake) wasn’t supposed to give to you yet.Buy It: Rolf TotePhoto by Chelsie CraigPsychic Wines, Los AngelesThis is a sulfur-free zone, thank you very much. You’re all about natural wine, and to be clear, you’ve been that way for much longer than everyone else. You call orange wine “skin contact white,” and although you recently went through a pretty intense carbonic maceration phase, you’ve decided you prefer being able to taste the unadulterated flavor of the Loire Valley  grapes—along with every drop of sweat put into that two-hectare plot.What’s in it: A bottle of $38 Grolleau. A heavily underlined copy of “Wine. All the Time.” A fiscally irresponsible number of Castelvetrano olives. And the wine key attached to your keychain.Photo by Chelsie CraigBuxton Hall BBQ, Asheville, NCYou understand commitment. Plans after a long Tuesday at work? You’ll be there. Friend moving into a new apartment on Sunday morning? You show up to help. Told your Grandma that you’d be at her birthday party? Of course you will. You’re a steadfast friend and know how to rise to the occasion. You put in the hours, and it shows. So you appreciate others who do the same, which is why smoking a whole hog overnight the way they do at Buxton is something you respect. That’s dedication. Juicy, fatty dedication.What’s in it: A hammer and nails (to help your friend hang those paintings). A box of homemade chocolate chip cookies for Katie’s birthday party. And the copy of “Normal People” you said you’d loan to Kevin.Photo by Chelsie CraigReanimator Coffee Roasters, PhiladelphiaAlarm at 5:30 a.m. Yoga at 6:30. And that’s all before you hop on your bike for the daily 16-mile ride to your high-powered job. You’re an early riser with a go-getter personality, thirsty (figuratively) for the next challenge. That’s why you’re thirsty (literally) for your pour over, brewed with some fruity, expertly roasted Kenyan beans, from Reanimator. The cafe is the perfect match for your wild-energy-meets-calculated-precision personality. Sure, you might be a little hard to keep up with, but hey, that’s their problem, not yours.What’s in it: Your yoga mat. A foldable bike helmet. And a completed crossword from the Sunday paper (which, for the record, you did by yourself).But It: Reanimator TotePhoto by Chelsie CraigRose Foods, Portland, MEYour following anyone who’s anyone in the food scene. You know where Natasha Pickowicz ate dinner last night; which wine bars Fabián von Hauske Valtierra and Jeremiah Stone visited last time they were in France; which city Matty Matheson is currently in for his book tour. You know who Jessica Koslow is collaborating with and where Camille Beccara is cooking next. And you know that everyone at Bon Appétit carries this Rose Foods tote. You hear your friend is going to Portland and ask her to grab you one. You’re already in the know, so you might as well look the part.What’s in it: A signed copy of Where Cooking Begins. A pen from Via Carota. A stolen bottle list from The Ten Bells. And a journal filled with names of restaurants you need to get to.Photo by Chelsie CraigFour Horsemen, BrooklynIs that a haul of records in your tote? Yeah it is, picked up from that vinyl store you’ve been trying not to tell anyone about. You’re a music freak that ends up at bars that double as vinyl clubs, or restaurants owned by, say...James Murphy of LCD Soundsystem. You haven’t spoken to anyone on the street since 2014; you’re too busy making your way through Spotify playlists you’ve bookmarked, like that new ‘70s-era Nigerian disco playlist you found last night.What’s in it: A first pressing of Curtis Mayfield’s Curtis and a worn but playable copy of Harvest Moon you found in the cheap bins. A McIntosh catalogue. A six pack of High Life, and a 100 percent cotton bandana.Buy It: Four Horsemen TotePhoto by Chelsie CraigLil’ Deb’s OasisWhere the hell is the party at? We’re asking you, because you certainly know. You’re in just about every scene worth being in. Yes, you saw that German DJ spin at the after-after-warehouse party last night. Yes, you know how to get into that sold out Annie Clark show and who to text about securing a couple nights at that exclusive, off-the-grid B&B upstate. And yes, you were definitely at The Lil’ Deb’s Oasis pop-up in Maine last month. Of course you were. You’re everywhere, and you know everyone. Which reminds us, can you get us into that Martine Gutierrez show tonight? Please?What’s in it: Two airplane bottles of tequila. A copy of Broccoli magazine. And a pack of Parliaments that may or may not be yours.Buy It: Lil' Deb's TotePhoto by Chelsie CraigThe Walrus and The Carpenter, SeattleYou’re a bit more refined than the rest of your friends, but you’re not a snob about anything. And as the Walrus and The Carpenter tote slung over the shoulder of that crewneck from your prestigious alma mater shows, you think a platter of oysters is a casual afternoon snack. You’re not wrong. But you know to pair it with a beer to keep things humble. There’s no need for Champagne; you’re not insufferable. But you do play squash.What’s in it: A pair of loafers. The keys to your Volvo. And of course, a few squash balls and your racquet, because Thomas said he’d be down for doubles after lunch.Buy It: The Walrus and The Carpenter TotePhoto by Chelsie CraigKismetLos Angeles isn’t just where you live. It’s how you live. The farmers’ market is your church. You spend your weekend mornings walking from vendor to vendor, admiring the watermelon radishes, inspecting the Japanese greens, and talking about types of obscure citrus that “those people on the East Coast just don’t have access to.” In one hand, you clutch a carbon-neutral, braided hemp leash, with your Labradoodle panting at the end. She was a rescue, in case anyone was wondering. In the other, you’ve got a sparkling CBD seltzer that’s numbing the effects of all that Mezcal you drank last night. You could have sworn that mezcal didn’t give you hangovers. But if anyone asks, you’re feeling absolutely brilliant.What’s in it: A green juice. Artisanal sunscreen. Heirloom tomatoes. A melon you’ve never tried before. A container filled with Ashwagandha. And a jade roller.Photo by Chelsie CraigDiner, BrooklynYou remember when Williamsburg was more than expensive condos, mass-market IPAs, and crowds of drunk twenty-somethings. You lived nearby when Diner first opened two decades ago, and instantly became a regular. Though you aged out of the area some time ago, you still make it back to this restaurant to watch the staff write the menu on the table, sip a Presidente, and enjoy one of the city’s finest burgers. That’s why you had to snag one of the limited-edition anniversary tote bags, as a reminder to everyone else in line that, while they were still eating lunchables in the cafeteria, you and the bartender were already on a first-name basis.What’s in it: A She Wolf Bakery toasted sesame loaf. A small Helen Levi planter for the side table in the living room. A very cute stuffed koala. And your kid’s sippy cup.Buy It: Diner Anniversary ToteExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-22", "author": ["Condé Nast", "Alex Delany"]}