{"id": "5c803023d2aa77302102f2e291e0ed1b", "url": "https://www.bonappetit.com/story/nyc100", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "The NYC100  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThere are restaurant lists with rankings. And there are restaurant lists with purpose. This is the latter.By The Bon Appétit StaffMarch 3, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThere’s no single best restaurant in New York. There’s only the best restaurant for your situation. Hence the NYC100, our heavily vetted recommendations for where to eat and drink in every scenario you find yourself in. What type of food? What neighborhood? How many people? Is there a vegan in the group? Beer? Wine? Liquor? Here we deliver a list of the spots we rely on to satisfy all of our very specific needs.Want these recs on a map? Right this way….New to the list 8/6/2019: New Asha, Gino’s Pastry Shop, Arepa Lady, Louie & Ernie’sNew to the list 9/5/2019: Cho Dang Gol, Silver Rice, Ganesh Temple, Bernie’sNew to the list 10/8/2019: Pakistan Tea HouseNew to the list 11/11/2019: Teranga, F&F PizzeriaNew to the list 12/10/2019: Kindred, WaylaNew to the list 1/16/2020: Nami Nori, Golden DinerNew to the list 2/7/2020: JoloffNew to the list 3/3/2020: Zooba, La Esquina Del Camarón MexicanoThere’s a reason the scrambled eggs with lox hasn’t changed.\n1. The Place for Old-School Vibes That Are Actually Old-SchoolBarney GreengrassUpper West Side, ManhattanThe average age of a Barney Greengrass patron probably hovers around 67. The restaurant still keeps monthly tabs for regulars (the New Yorker’s David Remnick being one of them). The gold, panoramic wallpaper looks like it could tell you about the turn of the century (the 20th one). And the recipe for the scrambled eggs with Nova lox hasn’t changed in decades. The timelessness of this uptown Jewish deli is about three-quarters of the charm. The other quarter is made up of whatever wisecracks your veteran waiter is sure to dole out.✵ Order: latkes, whitefish salad, bagels or toasted bialys, scrambled eggs with Nova and onions, and coffee.2. The Place for the Opposite of Brunch: Japanese BreakfastOkonomiWilliamsburg, BrooklynAt this tiny 12-seat spot, there is only one order: chef Yuji Haraguchi’s simple but spectacular Japanese breakfast set. That spread of miso-and-sake-kasu-slicked fish (like Spanish mackerel or tuna belly), jiggly tamago (omelet), pickles, miso soup, and rice is served on beautiful porcelain worthy of the morning light streaming through the windows.✵ Order: the breakfast set; and yes, you want to add the roe and soft-cooked egg to the rice.3. The Place for the Quintessential American Diner ExperienceTom’s RestaurantProspect Heights, BrooklynWake up early to avoid the weekend line and you’ll be rewarded with a sodium bomb of corned beef, bottomless cups of passable coffee, and absurdly crispy diner fries. The fluffiest pancake rumors are true, and the Christmas décor comes down for no season. After all, who can resist that kind of cheer? Bring cash!✵ Order: corned beef hash (extra-crispy, add a slice of American cheese) and eggs (scrambled, light), a side of fries, a side stack of pancakes, and a chocolate egg cream.4. The Place for Chicken, Waffles, and a Religious ExperienceSylvia’sHarlem, ManhattanMore than 50 years after it opened, this Harlem institution is hallowed ground. Sure, there are gospel singers and crowds that make getting a table for (post-church) Sunday brunch a challenge, but the most intensely religious experience is the soul food itself. Good things come to those who wait.✵ Order: chicken and waffles and Sylvia’s World Famous Talked About Bar-B-Que Ribs.5. The Place Where Soft-Scrambled Eggs Can’t Get any SofterBuvetteWest Village, ManhattanThis place is so cramped even the sidewalk outside the front door is crowded. But inside the perfectly worn room, no one cares, because the scrambled eggs coming out of Jody Williams’ kitchen are truly the softest, fluffiest, most buttery eggs in New York. Show up early (read: 7 a.m.—especially on weekends) and grab a seat at the white marble bar, right next to the towers of juice and scones, for a full view of said eggs being cooked using the steam wand on the espresso machine.✵ Order: saumon fumé (steamed eggs with smoked salmon) and an espresso.6. The Place for When Your Anchovy Craving Hits First Thing in the MorningKopitiamLower East Side, ManhattanThe Lower East Side’s coolest breakfast spot is a casual coffeehouse serving intensely flavorful Chinese-influenced Malaysian dishes known as Nyonya cuisine, loaded with anchovies, shrimp paste, and fish sauce. Tables turn quickly in the always-bustling space, so if you show up to a full house, just wait a minute for a seat to open up. Order as many plates and bowls as will fit on your table: Dishes are on the smaller side, easy to share, and guaranteed to be devoured.✵ Order: nasi lemak (coconut rice with crunchy anchovies and hard-boiled eggs), pan mee (hand-pulled noodle soup), and Malaysian-style French toast.7. The Place for When Diner Cuisine Is First on the To-Do ListNeil’s Coffee ShopUpper East Side, ManhattanThe red neon “coffee shop” sign, hanging on the corner of 70th and Lexington, is a beautiful lie. There’s no fancy espresso machine in sight here—just a diner with a massive menu of breakfast classics. The same exact waitstaff has been here for decades, serving neighborhood locals, kids fresh off Central Park’s Little League fields, construction workers, and confused French tourists. If New York were a restaurant, it would be Neil’s.✵ Order: You can’t go wrong. Just don’t miss Neil’s exceptional breakfast sausage.8. The Place to Flag Down Delicious Dim SumPacificanaSunset Park, BrooklynThis large ballroom looks like it came straight out of Beauty and the Beast (ceiling moldings, chandeliers, gold accents) and is sacred ground for dim sum lovers. But it’s also a lesson in strategy: When a cart comes by with the best stuff—shu mai, har cheung (rice noodle rolls), dan tat (egg tarts)—don’t hesitate for a moment. Eyes on the prize!✵ Order: cold jellyfish, spare ribs with squash, chicken feet, shu mai, har gow (shrimp dumplings), har cheung, and dan tat.9. The Place for When Your Friends Force You to Go to BrunchAtlaNoho, ManhattanThe best kind of brunch menu is one that reads like a lunch menu. And that's exactly why Enrique Olvera and Daniela Soto-Innes’ Mexican spot Atla is the only answer to the dreaded “Where should we do brunch?” text. The narrow, light-filled room is miraculously devoid of loud groups looking to get their bottomless mimosa fix—a rare find in the syrup-drenched, two-hour-wait brunch landscape of lower Manhattan.✵ Order: flaxseed chilaquiles, chicken enchiladas (get green and red, a.k.a. divorciadas), arctic char and farmer’s cheese tostada, and the fish Milanese.10. The Place to Witness a Classic, Storied Well-Oiled MachineBalthazarSoho, ManhattanEveryone has been to Balthazar. And everyone still goes to Balthazar. Locals. Tourists. Chefs. Downtown cool kids. Uptown grandparents. After 20-plus years, the classic French brasserie remains a New York institution thanks to its consistency and efficiency. Spend just as much time looking around the timeless room as you do admiring the precision of your omelet’s roll.✵ Order: omelet with herbs, smoked salmon tartine, and a plate of breakfast oysters.11. The Place for Mole Poblano Tamales and Immediate Hangover ReliefFactory TamalLower East Side, ManhattanIf you’re the type of person who is comfortable standing on the sidewalk, face down in a brown paper bag of steaming, saucy tamales the morning after an ambitious evening out on the town, you’ve come to the right place. If you’d prefer to be sitting—out of sight from passersby—Factory Tamal has some seats inside too. Either way, this should be your first move, after the Advil of course.✵ Order: mole poblano tamal, salsa verde tamal, chipotle tamal, and the (off menu) Ludlow breakfast sandwich.The chicken katsu club at Golden Diner\nPhoto by Laura Murray12. The Place For Breakfast at 4 p.m. and Lunch at 10 a.m.Golden DinerTwo BridgesThere’s nowhere we’d rather disobey traditional meal times than at Golden Diner. A super crispy chicken katsu club first thing in the morning? Honey butter pancakes with honey maple butter at 3:30 in the afternoon? YOU CAN DO IT. The menu has something for everyone, without being intimidatingly long, and is served seven days from 10 a.m. to 5 p.m. All that means we love it here for lunch, and for breakfast and dinner, too—no matter what time of the day you’re having it.✵ Order: the Chinatown egg & cheese sandwich on a scallion milk bun, chicken katsu club, side of super crispy home fries, turmeric-lemongrass avocado toast (for real), and the cheeseburger.13. The Place for Fresh-Baked Naan and a Cold Can of CokePakistan Tea HouseTribeca, ManhattanThis place is small. The tables are few. And the beverage list consists of canned soda and bottled water. And that’s all perfect, because Pakistan Tea House isn’t a place for glitz and glamour. It’s the spot for ripping hot naan, quick service, and consistently excellent, absurdly flavorful steam table Indo-Pakistani food. Even better? It’s open 24 hours a day, making it popular with Tribeca office workers in the afternoon and hungry cabbies in the early morning hours. Unless we have one of those kinds of nights, we’re usually there for an I’ve got a meeting in 30 minutes, but need a real lunch lunch.✵ Order: Chicken curry combo special with stewed eggplant and saag, naan, chicken seekh kebab, yogurt sauce, and a cold can of Coke.14. The Place for When You Need a Cheesy, Meaty Arepa and You Need It NowArepa LadyJackson Heights, QueensIt didn’t take long for New Yorkers to fall in love with Maria Cano, a.k.a. the “Arepa Lady,” when she first launched her food cart in Queens in the 1980s. And while the business has grown over the years, with Maria and her sons moving their operation into new brick-and-mortar spaces (including a stand at Brooklyn’s DeKalb Market), not too much has changed. You can still find the same deeply satisfying corn cakes stuffed with cheeses and meats that built their reputation in the first place. It’s just that with all this added elbow room, it’s even easier to stroll in for lunch with say, seven of your closest friends and get seated (read: start eating) right away.✵ Order: arepa de queso with chorizo, and arepa rellena with pollo asado. Make use all of the brightly colored hot and creamy sauces out on the tables.15. The Place for Seafood Tostadas in the Back of a Queens BodegaLa Esquina Del Camarón MexicanoJackson Heights, QueensThose searching for New York’s tastiest seafood tostadas know not to look for the storefront by name. That’s because La Esquina takes up just a small sliver of Roosevelt Deli, with just six seats and a menu of empanadas, tostadas, tacos, and other fish and seafood specialties. Bring cash, an appetite, and just one lucky friend—space is tight and those few seats sought after. But if you can’t get a spot while you crunch on shatteringly crisp tortillas, don’t sweat it. These tostadas taste just as good eaten on the sidewalk.✵ Order: Tostada de pulpo (octopus) drizzled with aguacate, flautas de cazón (marinated dogfish), shrimp cocktail, and a soda from the bodega fridge.16. The Place for Off-the-Wall Design and Egyptian Comfort FoodZoobaSoHo, ManhattanYou’ll fall in love with Zooba before you even taste the food, thanks to all the delightful details—graphic murals, wheatpaste-style posters, colorful LED patterns on the ceiling—inspired by the streets of Cairo. But this fast-casual spot serving Egyptian street-food classics is more than a feast for the eyes. The ta’ameya (freshly fried balls of mashed fava beans), hawashi (a tender meat-veg patty stuffed in fluffy baladi bread), and dips come in a variety of flavors and options, including easy-to-tote salads and sandwiches. Though, with this much to look at, you might choose to grab a seat and stick around.✵ Order: Ful medames (stewed fava beans), za’atar fries, cheese hawashi, and pickled lemon ta’ameya.17. The Place for a Pepperoni Slice in What Feels Like Your Uncle’s BasementLouie & Ernie’sSchuylerville, The BronxLouie & Ernie’s is a residential kind of joint. The neighborhood feels suburban; the building looks like a house. And walking down into the semi-subterranean room is a lot like dropping by your uncle’s place for lunch—if your uncle also happened to serve some of the best New York–style pizza in the city. Grab a couple of slices, some garlic knots, and head to the back patio where the cozy, relaxed vibes stay strong.✵ Order: slices of plain, pepperoni, and sausage pizzas; garlic knots; and a cold soda.18. The Place for a Very Serene, Very Life-Affirming LunchRakuEast Village, ManhattanSometimes in this eight-million-person city, you just need some peace, quiet, and udon. That’s when you head to this subdued, intimate noodle shop, where there’s jazz on the speakers and beautiful ceramic bowls of thick, chewy, satisfying udon imported from Japan.✵ Order: yaki nasu (fried eggplant with spicy miso pork and egg), the cold zaru udon (with seaweed, quail egg, and scallions) or hot kitsune udon (with sweet fried bean curd).19. The Place That Serves a Sandwich for EveryoneCourt Street GrocersCarroll Gardens, Red Hook, and Williamsburg, Brooklyn; and Greenwich Village, ManhattanThe menu might seem intimidating at first—there are a lot of sandwiches—but once you make your way through the list, you’ll realize each item has earned its place. Whether it’s eggy, vegetarian, toasty, or cold cuts-y, Court Street nails it.✵ Order: broccoli Reuben, turkey club, pork roll breakfast sandwich, and a house-made celery soda.20. The Place for Convincing Your Southern Friends that NYC Does, in Fact, Have Phenomenal BarbecueHometown Bar-B-QueRed Hook, BrooklynThe brisket is just as good as what you’d find in Texas’s top barbecue joints, the beef rib is truly a spectacle to behold, and the sides are legitimately great. Lines are long, and there’s a reason for that. Listen to the live music on weekend nights and wait it out.✵ Order: beef ribs, brisket, lamb belly, queso mac & cheese, potato salad, and cornbread.21. The Place for Steamed Dumplings in a Flushing BasementTian Jin Dumpling HouseFlushing, QueensThe only less-than-wonderful part of Tian Jin is finding it for the first time. The compact dumpling spot is buried in the basement food court of the Golden Shopping Mall. But once you descend into the space, the thick-skinned steamed dumplings are all you’ll be thinking about. The dumplings are chewy and soft, and the meats and vegetables wrapped inside are seasoned aggressively. Sit at the counter and make use of the chili oil.✵ Order: lamb and squash dumplings, pork and cabbage dumplings, and pork, shrimp, and chive dumplings.22. The Place When You’re at Chelsea Market and Need to Shovel Something in Your FaceLos Tacos No. 1Chelsea, ManhattanIf you’re in Chelsea Market and not having a crowd/stroller/lost tourists–induced panic attack, chances are you just ate at Los Tacos No. 1, where the tacos taste as good as the braised and roast meats smell. Plus, it comes on some of the best flour tortillas in the city, which can also be found at its sister restaurant Los Mariscos, just down the hall.✵ Order: adobada tacos, pollo asado quesadilla, nopal plate, and chips with guacamole.A bright a vibrant bowl from Teranga.\nPhoto by Emma Fishman23. The Place for West African Staples Right Off Central ParkTerangaHarlem, ManhattanWho serves New York’s best jollof, a pot of deep red grains cooked with caramelized tomato paste and crowned with diced onions, carrots, and peas? That’s a heated question. But chef Pierre Thiam’s airy all-day café Teranga in Harlem is a top contender. The build-your-own format of the fast-casual spot leaves the construction of a bowl of West African dishes up to you, and you’ll wish you had seconds before you’ve even finished what’s on your tray. Just make sure you don’t get too far without employing the four condiments set out on the table—they’re not to be missed.✵ Order: Jollof, garlicky grilled chicken, caramelized plantains, herby black-eyed pea salad, and mafe (a velvety, peanut-y stew).24. The Place for Lunch Pasta, Instead of Dinner PastaVia CarotaWest Village, ManhattanIt’s not that Via Carota isn’t a dream dinner place. It’s just that we prefer to head in around noon for lunch, when a long daytime meal in Jody Williams and Rita Sodi’s stylish dining room makes us feel like we’re some West Village celebrity, Italian movie star, or power-lunching media mogul. Oh, and the wait—which can stretch up to three hours in the evening—is much more reasonable this time of day. Like Williams’ and Sodi’s other restaurants in the neighborhood (I Sodi, Buvette, and the new Bar Pisellino), it’s worth holding out for.✵ Order: the towering, not-so-typical green salad, cacio e pepe, a few items from the menu’s seasonal Verdure section (e.g. fried artichokes, grilled octopus), and a Negroni.25. The Place for When Staten Island Is the Quickest Way to Sri LankaNew AshaTompkinsville, Staten IslandIf you want to eat Sri Lankan food in New York City, you go to Staten Island. And if that’s your agenda, you should head to New Asha, a small, humble restaurant serving deeply flavorful curries, hand pies, and kottu roti (a stir-fried dish made with torn, flaky flatbread). Keep in mind that each bracingly fiery, pickle-y, sour-y dish comes piled high on Styrofoam plates, making a nap on the ferry home an inevitable (and welcome) ending to the feast.✵ Order: mutton roll (a savory hand pie), chicken curry, mutton kottu, and string hoppers (steamed rice noodles).26. The Place Where the Best Dishes on the Menu Are FreeCho Dang GolKoreatown, ManhattanThey say you should be able to judge a Korean restaurant by its banchan, the welcome wave of small, highly seasoned, free dishes that arrive at the start of a meal to stoke your appetite. And at this homey, low-key spot a few blocks north of the main K-Town stretch on 32nd Street, all signs point to top marks. A small bowl of delicate house-made tofu curds. Wheels of sticky-sweet braised lotus root. Zucchini rounds battered in egg. Cucumber-seaweed salad. And more. All before you’ve even had a moment to look at the stews.✵ Order: mini bossam, dumpling jeongol (a hot pot you should split with a group), seafood stew, kimchi biji (a thick and spicy soybean stew), and extra banchan (it’s free!).27. The Place When You Have $2.50 and Want to Know How Good a Cecina Taco Can BeSanta Ana Deli & GroceryBushwick, BrooklynUp front, Mexican sodas, snacks, and beers can be grabbed from ramshackle shelves. In the back, a small griddle where meats are sizzled and seared before they’re slapped onto soft flour tortillas and topped with thinly sliced vegetables. Don’t forget to ask for red and green salsas with everything you order.✵ Order: cecina (salty beef jerky) tacos and crispy carnitas tacos with plenty of limes.28. The Place to Go With or Without Your Vegetarian FriendsSuperiority BurgerEast Village, ManhattanA vegetarian burger joint that meat-eaters love? However unlikely it may sound, it’s real. (And there’s nothing particularly healthy about it—in a good way.) Brooks Headley’s veggie burgers are all kinds of flavorful, from the dill pickles to the Muenster cheese to the kind-of-spicy patty. The tiny spot is almost always slammed, so take your haul half a block down 9th Street to a bench in Tompkins Square Park and get in some prime people watching at the same time.✵ Order: Superiority Burger, burnt broccoli salad, and whatever mind-blowing gelato/sorbet is on the menu.29. The Place for Crowd-Pleasing Vegan FoodBunna CafeBushwick, BrooklynThis bustling, 100-percent plant-based Ethiopian spot is the ultimate answer to the age-old question, “Where are we going to take our vegetarian friends to dinner?” Sixteen bucks gets you a hubcap-size platter loaded with all manner of hearty, stewy, elaborately spiced vegetables and legumes piled atop supple, tangy injera. It’s more than enough for four hungry people. Eating with your hands, throwing back a couple of St. George Lagers, you’ll suddenly have a reason to be grateful for friends with dietary restrictions.✵ Order: lentil sambusas, Lunch for 2 (enough to feed three, depending on hunger levels).30. The Place to Fall in Love with Uzbek-Uyghur FoodCafe KashkarBrighton Beach, BrooklynYou love Uzbek-Uyghur food; you might just not know it yet. Chewy-tender hand-pulled noodles piled high with chunks of coriander-and-cumin-seasoned lamb. Flaky disks of pastry stuffed with tender bits of lamb and herbs. Juicy, fist-size steamed dumplings spilling forth with...more lamb. Okay: You may not love Uzbek-Uyghur food if you dislike lamb. But if you do, get thee to Brighton!✵ Order: geiro lagman (noodles with lamb and peppers), manti (small lamb dumplings), samsas (meat pastries).31. The Place for Massive Dosas in the Basement of a Hindu TempleGanesh Temple CanteenMurray Hill, QueensYou might not have known that some of the greatest dosas in New York City are being served in the basement cafeteria of a Hindu Temple in Queens. Well, folks...now ya’ know. Enter the main doors and follow the signs pointing you toward the “Temple Canteen”—through the ornate, stone pillar-lined halls and down a flight of stairs—into a large, starkly lit cafeteria filled with folding tables and chairs. There you’ll find an expansive, all-vegetarian menu of South Indian specialties. Everything on the menu comes in under $7.50 (and with a side of spicy ground coconut chutney and sambar, a brothy lentil gravy) which means you should show up with a group and order liberally.✵ Order: The paper dosa (it’s huge!), spicy butter paneer dosa, idli (steamed lentil cakes), and vada (deep fried lentil doughnuts).32. The Place When You’re in Times Square and Just Need Some Damn LunchMargon RestaurantTimes Square, ManhattanThis narrow spot on 46th Street shines brightly in the food desert known as Times Square. Margon serves Cuban classics from a long line of steam trays to construction workers, 9-to-5ers, tourists, and costumed superheroes alike. The Cuban sandwich is perfectly crispy and nothing close to healthy (as it should be).✵ Order: Cuban sandwich combo (with rice and beans), roast chicken, rice and beans, maduros.33. The Place to BYOB Natty Wine and Eat a Rotisserie ChickenCasa AdelaAlphabet City, ManhattanAs any Philly or Chicago transplant can attest, BYOB joints are a rare commodity in NYC. Which is all the more reason why we’re grateful for Casa Adela. When you sit down on a not-so-comfortable chair and look around at the families passing rotisserie chickens, tostones, and mofongo over glass-covered vinyl tablecloths, you’ll understand the appeal: This is the place to go for real, honest, comforting Puerto Rican cooking. Discovery Wines and Alphabet City Wine Co. are both conveniently within walking distance, so don’t forget to snag a bottle or two on your way.✵ Order: half rotisserie chicken, carne guisada, chicharron de pollo, and pernil asado.At Frenchette, it’s all in the details.\nPhoto by Heidi's Bridge34. The Place for a Big Night Out on Someone Else’s DimeFrenchetteTribeca, ManhattanAssume the duck frites are happening, and then treat the rest of the menu at this new-school French bistro as a to-do list (boudin blanc, roast chicken for two on a plank of garlic-butter baguette) and get to work. Dive into a hard-to-find bottle of biodynamic wine from one of the best lists in the city. Keep an eye out for celebrities and powerful people. Then play it cool. Tonight, you’re one of them.✵ Order: duck frites (duh), roast chicken, boudin blanc, softly scrambled eggs with garlicky snails, and Paris-brest à la pistache.35. The Place for a Perfect Slice Created by LegendsF&F PizzeriaCarroll Gardens, BrooklynIn a city filled with slice shops, who needs another, right? Wrong. With dough formulated and fermented by Tartine’s Chad Roberston, pie technique and construction nailed down by pizza legend Chris Bianco, and a space owned and operated by Carroll Gardens legends Frank Falcinelli and Frank Castronovo, F&F is the spot for the crispy, chewy, cheesy, perfectly balanced Brooklyn slice you’ve been looking for. It’s also the one everyone else is looking for, so go early and expect a line.✵ Order: A plain slice, a tomato slice, and a Sicilian pepperoni slice.36. The Place for West African Classics and Family-Dinner VibesJoloffBed-Stuy, BrooklynNo, you haven’t just walked into your aunt and uncle’s living room, but at Joloff, it sure will feel like it. The patterned textile tablecloths, turquoise walls, and black-and-white portraits all make for a laid-back, homey environment run by a staff that’s warm and familiar. The food—a wide selection of deeply comforting West African dishes like tamarind-laced lamb shank, vegetarian okra stew, and jollof—only makes it feel cozier. Bring friends: The portions are generous and it’s best to order family style to appreciate the restaurant’s breadth.✵ Order: Mafe Yapp (a ridiculously tender lamb stewed in a velvety peanut-based sauce) with jollof rice and a bissap (hibiscus juice).37. The Place to Order Over-the-Top Hand Rolls With AbandonNami NoriWest VillageYou’ll be incredibly tempted to order one of every temaki (Japanese-style hand roll) upon first read-through of the dynamic menu at this spare yet stylish counter from Masa alums. And really, we don’t love having to choose: Buttery scallops in XO sauce? Creamy squash enlivened with ginger and scallion? Or huge pearls of salmon roe? The good news is, each fist-size package with warm white rice and perfectly crisp nori is so thoughtfully made that you can’t go wrong. And better yet: They’re just small enough that you can easily put down a few of them, and still have room to go back for more.✵ Order: scallop with XO sauce, vegan ginger-scallion squash, spicy sea bass with daikon, uni, spicy crab dynamite, and ikura hand rolls, plus calamari with yuzu soy and nori chips.38. The Place to Go for New York’s Timeless CheeseburgerJ.G. MelonUpper East Side, ManhattanThe watermelon-themed decorations, green-checked tablecloths, and long-time employees give this legendary burger joint a vibe that feels permanent in the most special way, just like the years of seasoning that coat the sizzling griddle. It’s impossible to not feel like a true New Yorker when eating a burger at the original Upper East Side location (there are now two others in Manhattan). It’s an institution.✵ Order: cheeseburger, cottage fries, chili (for dipping your fries), and a martini.39. The Place for an Easy Dinner in the Hardest Neighborhood, Times SquareOotoyaTimes Square, Manhattan.No matter how crowded this homestyle Japanese restaurant is, it feels like a respite from a world where you are at permanent risk of being accosted by an adult dressed like a furry animal. Whether you’re going post-work or pre-theater, Ootoya’s generous portions of extra-crispy tonkatsu (fried pork cutlet) or simple preparations of grilled fish (like mackerel) have restorative properties.✵ Order: tonkatsu, chawanmushi (egg custard), and hot tea.40. The Place for a Surprisingly Affordable, Totally Ambitious Tasting MenuAtoboyMidtown East, ManhattanThe mini tasting menu that chef-owner Junghyun Park serves inside his futuristic-looking Korean restaurant is neither precious nor pretentious, thanks to the warm service and free flow of genre-bending dishes that change with the seasons. Pick three dishes for a set price ($46!) and order strategically with your companions so you get to try as much of the menu as  possible.✵ Order: shrimp-stuffed endives, yellowtail crudo, galbi, and fried chicken with peanut sauce.41. The Place for Always-Delicious, Lightning-Fast Caribbean TakeoutThe Food SermonCrown Heights, BrooklynYou had big plans to cook a healthy, hearty Sunday dinner, but wow, it’s already six o’clock. If you’re lucky enough to live in the Food Sermon’s radius, a delicious Caribbean dinner is minutes from your door. We swear, these delivery bikes have jet packs. But if you need to get out of the apartment, there’s no such thing as a bad seat in this tiny spot: The counter running along the windows provides just as good a view for people watching outside as it does for watching cooks assembling the vibrant bowls inside.✵ Order: island bowl with braised oxtail, brown rice, chickpeas, and coconut ginger sauce.Please don’t miss the fetti from Tanoreen.\nPhoto by Alex Lau42. The Place for a Group Dinner...and Then Really Good DessertTanoreenBay Ridge, BrooklynSometimes you want it all: copious amounts of appetizers, a sizable entrée, and a worth-it dessert. Tanoreen is there for you with tahini-laced vegetables and Middle Eastern meat dishes that are big enough for sharing. But the real star is the knafeh, a cheese-based dessert with thin layers of sweetened noodles. Get the large, even if you’re very full.✵ Order: Brussels sprouts, cauliflower, fetti with lamb, baked eggplant, knafeh.43. The Place For Ramen and the Crispiest Chicken WingsTakumenLong Island City, QueensPop through Takumen’s yellow door to grab a matcha latte and a buttery croissant to-go, or grab seats in the wood-clad dining room for chewy ramen noodles in deeply flavorful sauce, hefty rice bowls, and impossibly crispy chicken wings. It’s the perfect place to fuel up before visiting MoMA PS1 or the Noguchi Museum.✵ Order: steamed broccoli, any of the ramen soups, roasted peanut and spicy miso sauce chicken wings, soy-garlic chicken wings, and fried squid.44. The Place to Soak Bread in All the Seafood-y Sauces with One Other PersonCervo’sLower East Side, ManhattanWhy is this new-school Portuguese gem from the team behind Hot 10 winner Hart’s and rotisserie hotspot The Fly the perfect hangout for two? Because A) the best seats in this sliver of a space are those at the slim counter that runs the length of the bar and curves around the small open kitchen, and B) you’re going to be protective of every last drop of the garlicky sauces left over from the perfectly cooked seafood.✵ Order: olives, prawns, piri-piri chicken, sourdough bread, a bottle of high-acid white wine, and the vermouth service.45. The Place for Korean Barbecue Without the K-Town CrowdsMapo Korean BBQFlushing, QueensYou’ll need to take the Long Island Railroad to get here and probably drag a friend who speaks Korean (or Mandarin—the staff speaks both), but this old-school spot is worth all that planning ahead. It’s one of the few charcoal-powered Korean barbecue restaurants in New York, which gives the galbi the perfect touch of smoke that Midtown’s hot spots just can’t compete with.✵ Order: short rib with all the banchan and naengmyun. In the summer, keep an eye out for cold gochujang-marinated crab.46. The Place When You Want to Eat at a Restaurant That’s Actually a Wine BarWildairLower East Side, ManhattanThis small space on Orchard Street is a scene (in a good way). It’s packed with in-the-know diners who are just as interested in Austrian pét-nat as they are in fried squid. You’ll go for the wine list and end up ordering the whole menu. Or you’ll go for dinner and become obsessed with the wine list. Either way, go.✵ Order: housemade bread with olive oil, beef tartare, potato dauphin, Little Gem lettuce, fried squid, and every dessert.47. The Place for When You Want a Tasting Menu Vibe Minus the Tasting MenuThe Bar at Momofuku KoEast Village, ManhattanYou could go to David Chang’s lauded Momofuku Ko and drop $255 a person (sans booze) on an epic tasting-menu experience… or you could take a detour and dip into the walk-in-only bar and hit a few (remarkably affordable) highlights. The nose-clearing mustardy pickle sandwich costs $5. The so-weird-it-works cold fried chicken is $6 per piece (but, uh, get more than one piece). And the deliciously rich $45 duck pie can and should be split among a few friends. It’s like a tasting menu on your terms.✵ Order: foie gras–topped hamburger, pickle sandwich, sourdough crepes, duck pie, and cold fried chicken.48. The Place for Fried Calamari on the WaterRandazzo’s Clam BarSheepshead Bay, BrooklynThe bright, carnival-esque signage tells you everything you need to know about the folks at Randazzo’s: They’ve been around for a while. Subtlety is not their specialty. And they serve seafood that tastes as classically Italian-American as their name suggests. This is the no-frills Brooklyn-Italian experience you’ve been searching for.✵ Order: fried calamari with spicy tomato sauce, linguine with clams, clams casino, penne alla vodka, fried fish sandwich, garlic bread, and some cheap white wine.49. The Place for Soup Dumplings (Even Though It’s Not Known for Soup Dumplings)Deluxe Green BoChinatown, ManhattanReal Green Bo fanatics will remember this restaurant as Nice Green Bo, but while the name has changed the high quality of the food hasn’t. Most venture to the weathered Bayard Street haunt for fried rice or noodles with pork and fermented cabbage (the house specialty), but the soup dumplings are some of the best in the city. Share everything and bring cash.✵ Order: hot and spicy wontons, crispy noodles with pork and fermented cabbage, bean sprouts and snow peas, fried pork dumplings, and pork soup dumplings.50. The Place for a Third Date With That Person You Really LikeCafé Altro ParadisoSoho, ManhattanThere might not be a more complete date-night restaurant in New York City. The large, humming room. The breezy, contemporary design. The warm, gentle glow. The well-balanced wine list. The innovative but approachable cocktails. The soulful playlists. The amaro list. The dessert wine. The sorbet. And that’s to say nothing of Ignacio Mattos’ menu of modern, shareable Italian plates, or Natasha Pickowicz’s stunning desserts. Bring someone you want to impress...without seeming like you’re trying to impress them.✵ Order: olives, octopus, fennel salad, cacio e pepe, and a side of beans. Finish with a digestivo.51. The Place for Dinner When Fun Is the Top PriorityWin SonEast Williamsburg, BrooklynThe new-school Taiwanese spot is best enjoyed with a group of at least four (or fewer, who really know how to eat). And it’s always more enjoyable if those people aren’t opposed to an impromptu round of shots (which staff may or may not encourage) between excellent fried eggplant and spicy fly’s head (minced pork, fermented beans, chives, and chiles). Win Son is always slammed, so show up early and be ready to hang out by the bar with a drink while you wait.✵ Order: roasted peanuts, marinated cucumbers, fried eggplant, fly’s head, sesame noodles, and head-on prawns with minced pork in shrimp broth.The papaya salad from Uncle Boons.\nPhoto by Evan Sung52. The Place That Is Absolutely Worth the Torturous WaitUncle BoonsNolita, ManhattanTwo hours?! Okay, fine. You’ll be glad you waited once you have that first bite of crispy lamb wrapped in lettuce. Uncle Boons is the Thai restaurant that never lets us down—the one that makes everyone happy, out-of-town relatives and fussy coworkers included. Every bite is fire—whether that means it’s spicy or straight awesome. Always over-order.✵ Order: yum mamuang (green mango salad), laab neuh gah (crispy lamb salad), kao pat puu (crab fried rice), massaman neuh (short ribs), khalum pli (ingenious rotisserie cabbage), Thai sausage duo, toasted coconut sundae (no matter how full you are).53. The Place Where an Old-School Steakhouse Night Never Gets OldKeens SteakhouseMidtown West, ManhattanNever has a piece of meat received as much attention as the mutton chop from this historic steakhouse (est. 1885!). But there’s more to love about Keens than the fabled two-pound lamb saddle chop (ehem, not actually mutton). There’s the deep list of single-malt Scotches. Waiters dressed in black bow ties and pressed red vests. The expertly stirred martinis. And it’s got one of the largest collections of churchwarden tobacco pipes in the world—which you’ll see hanging from the ceiling, as you lean back and pat your belly.✵ Order: wedge salad, shrimp cocktail, mutton chop, porterhouse for two, creamed spinach, hash browns, and a dry martini or three.54. The Place to Go to for Unflinching Indian Food, No Matter Where You Are in Relation to Long Island CityAddaLong Island City, QueensCome to Adda as a group of four. Any fewer and you won’t make a dent in the menu, any more and it might be awhile before one of the tables in the energetic room opens up. Load up on whatever you need (mango lassis? Limca sodas? Chardonnay from the Finger Lakes?) to power through the purposeful heat and powerful spices at the backbone of the menu, from the array of snacks you won’t be able to get enough of at the start of the meal to the slow-cooked goat biryani you’ll take home with you when you finally and unwillingly call it quits.✵ Order: tawa kaleji (chicken livers), dilliwala butter chicken, lucknow dum biryani (slow-cooked goat).55. The Place to Eat a Burger, Drink a Beer, and Feel Like One of the RegularsBernie’sGreenpoint, BrooklynOversized mahogany booths. Red-and-white checkered tablecloths. Dim lights. Stained-glass chandeliers. Crispy fries. Frosty mugs of lager. And a staff that knows exactly how to treat you. Bernie’s is the no-fuss, Americana-fueled neighborhood restaurant that’s as perfect for a quick, cold martini as it is for camping out all night with one of New York City’s best burgers. Our official recommendation is to start with the first option, and then stay for the latter.✵ Order: Martini, wedge salad, baked clams, mozzarella sticks, double patty burger, and a whole Vinegar Chicken for the table.56. The Place to Go to Eat Pizza and Not Worry About Anything ElseOpsBushwick, BrooklynWhen decision fatigue is the diagnosis, this buzzy Brooklyn pizza place is the cure. The menus are the size of Hallmark cards, featuring a short list of house cocktails, a handful of snacks, exactly one (always perfect) farmers’ market salad that changes daily, and the main event: a selection of perfectly blistered, thoughtfully topped, naturally leavened pizzas. There isn’t even a wine list to worry about. Tell your server what you like, and they’ll bring you tastes from the ever-changing lineup of natural wines—$14 per glass, $50 per bottle, always.✵ Order: the salad (large), the Square (tomatoes, house mozzarella, olives, basil, oregano), Juno (broccoli rabe, potatoes, provola, ricotta salata), and Pops (tomatoes, house mozzarella, guanciale, onions, pecorino) pies.57. The Place for the Ultimate Italian-American PilgrimageL&B Spumoni GardensBensonhurst, BrooklynThis spectacular spaghetti palace, open since 1939, is worth the trek to Bensonhurst, especially for big group dinners with zero plans for later—lying flat on your back is the only thing you’ll want to do after eating here. Most pilgrims come for the Sicilian-style pizza (not a bad plan), but if you’re making the trip, go for the four-course family-style Chef’s Table menu. How else will you experience Dueling Shrimp, an oversize platter of shrimp, half fried, half boiled?✵ Order: L&B Sicilian pie, mozzarella in carrozza, rice balls, broccoli rabe and sausage pasta, chicken Parmesan.58. The Place Where You Can Get Omakase-Quality Takeout Sushi for Under $20Silver RiceCrown Heights and Prospect-Lefferts Gardens, BrooklynThis raw fish-obsessed city will never be short on incredible $200 omakase tasting menus. But omakase-level takeout sushi for under $20? That only exists at Silver Rice, a bright, tiny sushi and sashimi spot with two locations in Brooklyn. The fresh rolls here are stuffed with pristine fish that’s worlds away from the mystery pink sludge some spots dub “spicy tuna.” But the real move here is the fisherman’s bowl, brimming with chunks of salty snow crab, bright-orange ribbons of salmon, sweet raw scallops, and more over a bed of perfectly seasoned sushi rice.✵ Order: fisherman's bowl, shrimp dumpling miso soup (with extra dumplings if you know what’s up), salmon kombu roll, and kimpira salad.59. The Place for a Truly Serious EnchiladaCasa EnriqueLong Island City, QueensTo say that Casa Enrique is a restaurant that serves amazing enchiladas is both telling the truth and selling it short. The saucy, stuffed tortillas are profoundly flavorful and comforting, but so is every other Mexican dish served at this LIC staple. Go for a lazy dinner and do not stop after your second margarita.✵ Order: guacamole, rajas con crema, lengua tacos, chicken and salsa verde enchiladas, chile relleno, and countless margaritas.60. The Place for Singing Karaoke After Finishing Your Korean BarbecueInsaGowanus, BrooklynUsually belting out the words to Fleetwood Mac’s “Landslide” inside a restaurant would get you kicked out. But at Insa, it’s quite the opposite. After you finish up an ambitious spread of banchan and a sizable quotient of sizzling pork belly, you and your crew can head to a separate section of the restaurant and start singing (slightly off-key) karaoke in a private room.✵ Order: haemul pajeon (seafood pancake), bulgogi, thick-cut pork belly and thinly sliced brisket (for grilling), and dubu kimchi.61. The Place for When You Want New York’s Most Masterful SliceScarr’s PizzaLower East Side, ManhattanThe only thing stronger than the “old-school slice-joint vibe” at Scarr’s is the pizza itself. Flour is milled in-house, and pies are baked to perfection in two small ovens in the front of the shop. Sit in the faux wood–paneled back room—either at the bar with a glass of pét-nat, or at one of the four molded plywood booths with a pitcher of Presidente—and dig into a Sicilian slice with pepperoni or a classic slice with mushrooms. Then try convincing  yourself that you’re as cool as the trendy Lower East Side ensembles surrounding you. Do it on a weeknight, though. Fridays and Saturdays are truly swamped.✵ Order: any slice or whole pie (especially if you’re at one of the booths in the back with a crew) and a vegan Caesar salad.62. The Place to Be Seen Eating a Large Platter of Nam PrikWaylaLower East SideWe won’t pretend like it’s not going to be crowded. Everyone on the Lower East Side is going to Wayla for big-flavor homestyle Thai food, including us. Think fresh curries with brilliant aromas; whole fried fish seasoned with ginger, dried chiles, and shallots; and fish sauce aplenty. But the one menu item that should land on every table is the nam prik platter, a beautiful spread of vegetables—like Thai eggplant, steamed squash, lettuces, long beans, and okra—served with mushroom, shrimp, and pork dips. Order it for the table. And definitely make a reservation.✵ Order: Nam prik, sai oua (fermented pork sausage), moo sarong (meatballs wrapped in crispy noodles), crab-fried rice, whatever whole fish is on the menu, and some ice cold beer.63. The Place for When You Want to Pick Your Own Fish and Tell the Chefs How to Cook ItAstoria SeafoodLong Island City, QueensThere won’t be a moment of serenity during your time at this Greek BYOB. Counter staff shout orders to cooks. Chefs shout at waiters. Guests shout to one another. It’s loud. And it’s fun. Especially because you get to walk alongside the beds of ice and choose whichever fish, bivalves, and shellfish look good, and then tell the staff how to cook them. You hold all the cards, especially since it’s a BYOB.✵ Order: Grilled octopus, fried shrimp, grilled fish with lemon and herbs, and a large Greek salad.The full spread at Lois.\nPhoto by Laura Murray, styling by Allie Wist64. The Place for a Casual Date That Still Brings the RomanceLoisAlphabet City, ManhattanThe lights are low, the natural wine is on tap, and the ample cheese plate comes with a schmear of miso-mustard dressing. The music varies, but it’s always a vibe. Ask the approachable bartenders what’s new on the tap list, taste a few wines, and then commit to a carafe and a spot by the windows.✵ Order: sausage rolls, olives, seasonal salad, the cheese plate, and a carafe of wine on tap.65. The Place for a Beer After that Broadway Show You Just SawAs IsHell’s Kitchen, ManhattanThe bar scene in Hell’s Kitchen is, well, hellish. But As Is deviates from the neighborhood norm. This beautifully designed bar—with tiled floors, dark woods, and custom light fixtures—rotates more than a dozen of the most exciting taps in the city (highlighting local faves Grimm Artisanal Ales, Other Half Brewing, and Mikkeller NYC, as well as beers from grail-worthy breweries Hill Farmstead and Cantillon), and puts just as much emphasis on fun and accessibility as it does on beer quality. This is the craft beer bar for beer nerds and novices alike.✵ Order: something hoppy on tap, a saison from the bottle list, and a plate of nachos.66. The Place to Drink the Stuff You Won't Find at Any Other Bar in NYCHoney’sBushwick, BrooklynThey make mead at the aptly named Honey’s, but that doesn’t mean you have to drink the fermented honey water if you go here. This corner bar with a neon-pink sign is run by mad-scientist bartender Arley Marks, who also curates the short list of deep-cut natural wines from all over the world and cocktails like the Hola Yola, made with Yola mezcal, wildflower mead (yup!), byrrh grand quinquina (a French aperitif), and a spritz of absinthe.✵ Order: Mead! Do it! It’s great! For real! Or just stick with a glass of white wine.67. The Place for Buying a Fresh IPA Out of a WindowGold Star Beer CounterProspect Heights, BrooklynGold Star Beer Counter is two things: a bar and a bottle shop. But whether you’re drinking a Belgian saison there or taking some hazy cans of IPA to-go, it’s absolutely one of the best places in the five boroughs to get a beer. And yes, you can walk right up to the window from the sidewalk and buy said beer.✵ Order: Ask the bartenders which beers are fresh, tasty, and interesting. And get a salami picante sandwich while you’re at it.68. The Place for When Some People Want to Drink and Other People Want to Have a Nice DinnerAchilles HeelGreenpoint, BrooklynFour friends walk into a bar. One wants a glass of easy-drinking red. Another wants a cold can of Genesee. The third could go for a bubbly spritz laced with Averna. And the fourth would rather go straight to pasta with braised pork and white beans. That bar is Achilles Heel—a 100-plus-year-old neighborhood spot on a corner in Greenpoint that has...something for everyone.✵ Order: the seasonal spritz, oysters, lentil dip, marinated short rib, and anything that involves She Wolf Bakery bread.69. The Place to Escape the Saturday-Night Chaos of the Lower East Side, While Still Going Out on the Lower East SideBar GotoLower East Side, ManhattanThe confines of this thoughtfully designed jewel box are modeled after Tokyo’s intimate cocktail bars, with a wall of Japanese whiskies and a compact list of craveable bar snacks to soak it all up. The tables are close, providing excellent eavesdropping opportunities. Take full advantage of the cocktail list.✵ Order: house pickles, okonomiyaki, miso wings, highballs.70. The Place for a Pitcher of Beer and Curtis Mayfield on the JukeboxJosie’s BarAlphabet City, ManhattanThere’s a bouncer at Josie’s. And probably some NYU students. And maybe a group of washed-up East Village punk rockers. And definitely someone running the pool table. But Josie’s is a dive bar. This is what you signed up for.✵ Order: cheap beer and well whiskey.71. The Place for Natural Wine Without the MonologuesThe Ten BellsLower East Side, ManhattanWine bars are frequently plagued by pretentiousness. The Ten Bells is not, and it boasts one of the most well-rounded and exciting lists of by-the-glass natural wine in the city. It’s filled with young, loud, joyous people there to have a good time in the space’s warm orange glow (which makes everything and everyone look more attractive). Show up early and stay late. Spots at the bar—especially on weekends—are coveted.✵ Order: Spanish tortilla, mortadella, marinated olives, oysters, and glasses or bottles of whatever you’ve never tried before.72. The Place for a Fancy Martini and the Greatest Bar Mural There Ever WasBemelmans BarUpper East Side, ManhattanA live piano player. Expertly made classic cocktails. Walls painted by Ludwig Bemelmans, the guy who illustrated Madeline. All inside an iconic Art Deco hotel that has discreetly housed the world’s most famous actors, politicians, and musicians. (Jagger! Princess Di! JFK! Anjelica Huston and Jack Nicholson! We’re talking about The Carlyle! Hello!) This is Upper East Side ambiance in its purest form—with prices to match (not to mention the cover charge after 9:30 p.m.).✵ Order: a martini, old Scotch, a glass of champagne, or whatever else makes you feel like a millionaire.73. The Place to Travel Back in Time 100 Years and Eat Fries at the BarOld Town BarFlatiron, ManhattanWhether or not you’re using them, it’s important to know that Old Town Bar has the oldest urinals in New York City. Aside from that, the long mahogany bar is well-polished from a century of forearm leans. The booths are cozy enough to keep your secrets. And the dumbwaiters are still bringing fries down from the kitchen upstairs. If it feels familiar, that’s because you’ve seen it before: The bar’s shown up in everything from The Marvelous Mrs. Maisel to House of Pain’s music video for “Jump Around.”✵ Order: a rye Manhattan, a copy of the New York Post, Buffalo wings, and fries.74. The Place for Rum Punches That’ll Knock You OutLovers RockBed-Stuy, BrooklynThis Bed-Stuy bar wasn’t around in the ’90s, but you wouldn’t know it from the exposed red light bulbs, palm tree iconography, and thumping Caribbeats. If the need to escape that vibe for a minute overwhelms you, the backyard is big and comfortable.✵ Order: Jamaican rums, rum punch, and very cold beer.75. The Place for When You Want a Great Cocktail But Not a “Scene”The Long Island BarCobble Hill, BrooklynThings that make this Cobble Hill bar an excellent place to drink: The classic-leaning cocktails are well-crafted but not precious. (There are no “mixologists” here!) The restored midcentury interior is stylish but not fancy. And the thin-patty burger is exactly what you’ll want to eat with that second cocktail. Oh, and you can usually get a seat no problem.✵ Order: a Boulevardier and the Ladies’ Burger.76. The Place for a Glass (or Three) of New School Italian WineKindredEast VillageYou can go to any red sauce joint in New York and get a glass of cheap Chianti. And while you’re Dad might be happy with that, we’re looking for Italian wine with a bit more to say, which is why we hit Kindred for our Italian by-the-glass needs. Think high-acid rosato from Umbria; floral skin contact whites from Puglia; fresh, fruit-forward reds from Abruzzo; and yeah, maybe even some Chianti too. (There’s also a solid number of Eastern European options, from Slovenia and Croatia namely.) The spot, the second from folks at Ruffian nearby, is pretty perfect for a quick, pre-dinner drink at the intimate bar. But if your open to a multi-hour affair, we’d suggest investigating the dinner menu too. You know, for stamina.✵ Order: Wines by the glass! Go for something you’re not familiar with or something the staff is especially stoked on.77. The Place for Drinking Sake, Whether You’re a Newbie or Lifelong FanaticSake Bar SatskoAlphabet City, ManhattanSatsko is one of those rare specialty bars that has somehow managed to still feel like a true neighborhood spot. This tiny Alphabet City bar is staffed by bartenders who really want to serve you sake. The list is on the smaller side but filled with everything from clean, dry junmai ginjo to weirder, fruity, unpasteurized varieties. The bartenders—who control the playlists featuring a mix of soul, disco, electronic, chill-wave, and ambient music—also have very good taste in tunes.✵ Order: a glass of unpasteurized sake recommended by the bartender and some fried shishito peppers.Just a few of our favorite things to eat at Great N.Y. Noodletown.\nPhoto by Alex Lau78. The Place for When the Bar Just Closed and You’re Craving Char Siu PorkGreat N.Y. NoodletownChinatown, ManhattanIt would take you months to work your way through the entire menu at this Chinatown mainstay. From barbecued meats to crispy noodles, dumpling soup to congee, ginger-soaked greens to bottles of Tsingtao, Great N.Y. Noodletown is a Chinatown MVP for good reason. Show up with a crew, order aggressively (and selectively), and add chile sauce or ginger scallion sauce to everything.✵ Order: Barbecued pork, shrimp dumplings, Chinese sausage fried rice, crispy noodles with roast duck, shredded chicken and pea shoots, sea bass with flowering chives, and salt-baked shrimp.79. The Place to Dance with Your Fried Chicken SandwichThe CommodoreWilliamsburg, BrooklynIf you want to eat a phenomenal hot chicken sandwich without listening to a DJ or bumping into someone doing the two-step, go to this tiki-ish Williamsburg bar on the early side. If you’re into a crowded room, occasionally toppled micheladas, and the steady bump of Bronski Beat, go on the later side. Either way you’re going to have a good time.✵ Order: A spicy fried chicken sandwich for you, a plate of nachos for the table, and a glass filled with something frozen and boozy.80. The Place for When You’ve Lost Faith in New York’s Taco SceneChilo’sBed-Stuy, BrooklynNo, NYC isn’t known for its Mexican food, and this taco truck perma-parked on a dive bar patio isn’t going to change that. But once you’re a few Tecates and carnitas tacos deep, Chilo’s might make you feel like you’re in Austin or L.A., and sometimes that’s enough.✵ Order: Carnitas, cochinita, huitlacoche, and chorizo tacos—and a frozen margarita.81. The Place for Jamaican Food at (Literally) Any TimePeppa’sCrown Heights, BrooklynBars close. Parties end. But Caribbean comfort food at Peppa’s is forever. Saunter up to the window alongside cabbies, night owls, and neighborhood regulars any time from 10 a.m. to 6 a.m (that’s 20 hours of the day), and fill all the braised oxtail–shaped holes in your heart.✵ Order: Jerk chicken dinner or the oxtail dinner.82. The Place for When Post-Bar Pierogies Are the Only OptionVeselkaEast Village, ManhattanSkip the dollar slice and head to Veselka, where partiers, elderly insomniacs, and East Village bar-goers unite over pierogies, borscht, and stuffed cabbage. Yes, this 24/7 spot is uniquely suited for soaking up late-night booze, but be respectful: You’re in a New York institution.✵ Order: As we said, pierogies, stuffed cabbage (with tomato sauce), and borscht.83. The Place Where Cabbies Go for Late-Night DalPunjabi Deli & GroceryEast Village, ManhattanThis tiny Sikh deli just off Houston Street serves generously seasoned South Asian food 24 hours a day, but after 1 a.m. is when you want to show up and survey the scene. Cab drivers run in and out, some to grab a chai and others just to use the restroom. Drunk college students huddle outside over $5 bowls of rice and curried vegetables. Post-shift service workers carry out bags of samosas to take home. The cheap, comforting cooking—which also happens to be vegan (in case you happen to be the type who cares)—appeals to literally everyone who’s still awake.✵ Order: Samosas, pakora, a two-vegetable rice combo, and a ginger-loaded Indian-style chai for the trip home.Just try and resist the pastries at Abraço.\nPhoto by Alex Lau84. The Place for When Getting a Coffee Is as Important as Feeling Like an East Village LocalAbraçoEast Village, ManhattanIn a Venn diagram of cafés that excel in house-roasted coffee and ones that excel in house-made baked goods, Abraço is the rare occupant of the space where both circles overlap. Visitors can expect an always-full pastry case, the steady drip of deeply flavorful espresso coming from the La Marzocco, jazz reverberating from the turntable, and a patio filled with proud regulars. There isn’t a cafe more well-rounded, consistent, and downright cool in the five boroughs. You’ll start looking for apartments in the neighborhood as soon as you leave.✵ Order: espresso drinks, olive oil cake, bocadillos, cured olive cookies, and the babka.85. The Place for When You’re as Nerdy About Coffee as You Say You AreSey CoffeeEast Williamsburg, BrooklynThe coffee at Sey is bright, flavorful, and always freshly roasted. (You can see where it all goes down in the back of the greenery-draped open space.) But the real advantage here is the opportunity to learn from incredibly knowledgeable and friendly baristas. Since the beans are roasted in-house, the staff can give you accurate flavor notes, brewing instructions, and origin information about every coffee on the roster.✵ Order: drip or espresso. Both might change you.86. The Place for When You’re as Nerdy About Coffee as You Say You Are, and You’re DowntownBlack Fox Coffee Co.Financial District, ManhattanOrdering espresso or cold brew or drip is not enough of a clarification at Black Fox. The downtown coffee capital wants to know how you plan to drink it (hot? With milk? Iced? With tonic?), so staffers can pick the best beans for the job. The selection of beans comes from roasters spanning Vancouver to Boston to Copenhagen and is the most diverse in the city, which means there’s always something new to explore.✵ Order: something you haven’t tried before (like a naturally processed Kenyan pour-over) and a pastry to pair.87. The Place for a Cannoli That’s Filled to Order While Golden Girls Plays on the TubeGino’s Pastry ShopBelmont, The BronxAfter strolling Arthur Avenue—New York’s real Little Italy—and working your way through all the cheeses and meats, and sandwiches with cheese and meat on them, you’re gonna need an espresso break. At Gino’s—a bakery so iconic its sign was a prop in a Broadway musical—you can get exactly that, served in a tiny mug decorated with the words “latte,” “macchiato,” “cappuccino.” But don’t you dare stop there. Order a cannoli and watch as it’s filled to order with surgical precision before your grateful eyes. The baker might even slide it across the counter and declare, “Now that’s a cannoli.” She means it. There’s nothing soggy about this pastry. It’s perfectly crispy and totally sublime. And if you time it right, you might catch Golden Girls playing on the TV in the corner.✵ Order: a cannoli and an espresso.88. The Place to Drink Tea and Pretend You Aren’t in NYCTé CompanyWest Village, ManhattanTé Company is not a place for rushing. The tea menu is overwhelming in scope, and the food comes when it comes, which is usually not that quickly. It’s all part of the charm. This is where you go when you’ve got nowhere else to be except catching up with an old friend over a pot of expertly sourced Taiwanese tea and some of the most painstakingly flawless pastries in the city.✵ Order: Tea! Pineapple linzer cookies plus any other dessert.89. The Place for an Egg TartNew Flushing BakeryFlushing, QueensThe process at this miniscule storefront takes about three minutes: Walk in, ask the woman behind the counter for as many egg tarts as you can carry, pay with cash, accept the paper bag filled with flaky, sweet, eggy pastries, and walk right out. If you can’t help yourself, stand on the sidewalk outside and rip through a couple of Flushing’s premier pastries.✵ Order: many Portuguese egg custard tarts.90. The Place to Get Coffee When You’ve Also Got a Thing for Buying PlantsHomecomingGreenpoint, BrooklynBuying a cortado, a ceramic planter, and a snake plant as part of a regular Sunday morning routine may sound like the most Brooklyn thing you’ve ever heard, but Homecoming is the kind of place where all that can happen—and without becoming a parody of itself.✵ Order: whatever you usually get.91. The Place for When You’d Rather Buy Amazing Bread Than Be Caught Dead at BrunchSaraghina BakeryBed-Stuy, BrooklynFirst there was the restaurant (reliably delicious). Then there was the tapas bar (reliably boozy). And then there was the bakery—our favorite of the bunch—reliably stocked with warm loaves, fresh pastas, and house-made pastries. It’s the only line worth waiting in on a weekend morning in Brooklyn.✵ Order: whole wheat miche, whatever croissant they’re selling that day.All the nuts and dried goods you could want, at Sahadi’s.\nPhoto by Nancy Jo Iacoi92. The Place for When a Bon Appétit Recipe Calls for HarissaSahadi’sBrooklyn Heights, BrooklynIf you’ve ever wanted to make a BA recipe but wondered, “Where can I get za’atar or harissa or labneh?” the answer is Sahadi’s, a 124-year-old family-owned business and Brooklyn hub for Middle Eastern spices, stellar hummus, an expansive array of canned goods, and well-priced bulk bin nuts, seeds, and dried fruits.✵ Buy: All the nuts, hummus, and essential spices.93. The Place to Go to When Your Wine Friend Asks You to Bring WineWine TherapyNolita, ManhattanWine Therapy is kind of like the Supreme of wine stores. It will always have the hypebeast selections—Lammidia, Ruth Lewandowski, Rabasco—and you’re sure to see some industry producers, buyers, and personalities in the shop. The curation is top-notch, so pick a bottle that looks good to you. (Name checks not ringing a bell? Don’t worry: The knowledgeable staff is friendly and there to help. Just ask what they’re into right now.)✵ Buy: Hyped-up (and totally deserving) bottles from producers like Fable Farm Fermentory, Oyster River Winegrowers, Martha Stoumen, and Alessandro Viola.94. The Place for Stocking Up on Aleppo-Style Pepper, Curry Leaves, and Next-Level Prepared FoodsKalustyan’sKips Bay, ManhattanWhatever ingredient you need, Kalustyan’s stocks it. The sprawling international grocery store is every chef’s go-to spot for dried beans, heritage rice, and high-quality spices, but don’t skip the fridge stocked with marinated butter beans, stuffed parathas, and creamy labneh. Go with a game plan.✵ Buy: Hard-to-find spices, obscure varieties of chile flakes, brown chori beans, and masoor dal.95. The Place for When You Need a Department Store Full of BoozeAstor Wine & SpiritsNoho, ManhattanThis isn’t exactly your intimate, everybody-knows-your-name wine shop, but it is the one that has the best website, hands-down, and great wine descriptions. Sales every Tuesday will test your willpower and wine budget, but take advantage of them and stock up for the season. This. Place. Has. Everything. Including an unbeatable selection of amaro, gin, and rare whiskey.✵ Buy: A case of wine (cases are always 10 percent off), a grab bag of whatever the Tuesday sale is, backup Campari and Beefeater, and a bottle of something you’ve been wanting to explore.96. The Place for Hyper-Curated, Hard-to-Find Natural WinesSimple SyrupCrown Heights, BrooklynNo, you’ve never had that carbonically macerated purple-looking wine before. Yes, you’re getting two bottles. And yes, the staff knows that that’s exactly what you want after a 30-second interrogation. When the person at the counter at Simple Syrup hands you a bottle, you don’t ask questions. You buy. You drink. And you return for more.✵ Buy: Whatever they tell you to.97. The Place to Live Out All Your Cheese FantasiesMurray’sWest Village, ManhattanThis is Disney World for dairy lovers—the best cheese counter in New York, period. The mongers know their stuff, and can help you find what you need, even if you aren’t sure what that is. Grab something you haven’t tried before; stock up on the quality pastas, olives, beans, and yogurt you’ll find in the back of the store; and pick out a sandwich to go for good measure.✵ Buy: Challerhocker, Harbison, and Murray’s house-label cheeses like Annelies and Stockinghall.98. The Place to Buy a Magnum (or Three) for That Party You're HostingDiscovery WinesAlphabet City, ManhattanThis East Side wine shop has a dedicated wall named “Mag Wall.” That should be all you need to know about the unrivaled selection of large-format wines from small natural producers. Whether you’re in the market for something serious or fun, red or white, affordable or ambitious, domestic or foreign, still or sparkling, Discovery will have the fuel you need to take your party all the way.✵ Buy: Is that a mag of Sébastien Riffault Sancerre? Yeah, grab one of those.99. The Place for Chile Crisp and Gallons of Soy SauceChinatown Supermarket of ManhattanLower East Side, ManhattanUpstairs, stock up on all your pantry needs, impulse snacks, household cleaning supplies, and rice. Downstairs, bright fresh produce at an unbeatable price, seafood, and frozen foods you can’t find anywhere else.✵ Buy: Fried tofu cubes, black bean paste, wonton skins, frozen dumplings, red bean ice pops, and chile crisp.100. The Place for Babka, Beluga Caviar, and Full-Contact Bagel LinesRuss & DaughtersLower East Side, ManhattanIf it seems like the staff painstakingly slicing fish against a backdrop of dried fruit and sturdy babka loaves know what they’re doing, that’s because they do—and this place has been at it for more than 100 years. Take a  numbered ticket, claim a corner of linoleum, and gawk at the sturgeon while rehearsing your bagel-and-lox order.✵ Buy: Gravlax or pastrami-cured salmon on a sesame or everything bagel with scallion cream cheese, the Super Heebster bagel sandwich, and all the smoked fish you need for that brunch you’re throwing this weekend.See all these restaurants, bars, and shops on a map—and then get movin’.CreditsProject Lead: Alex DelanyEditor: Sasha LevineWriters: Aliza Abarbanel, Alex Beggs, Hilary Cadigan, Elyse Inamine, Rachel Karten, Carey Polis, Meryl Rothstein, Emily Schultz, Amanda Shapiro, Jesse Sparks, Amiel Stanek, Emma WartzmanPhoto Editor: Emma FishmanArt & Design: Bryan Fountain, Chris CristianoCopy & Research: Brian Carroll, Andrew Gillings, Joyce Pendola, Greg Robertson, Susan Sedman, Tanisha Sykes, Leslie Anne WigginsThanks to: Julia Kramer, Alex Lau, Michele Outland, Adam RapoportExplore Bon AppétitRestaurantsNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "The Bon Appétit Staff"]}