{"id": "5c86622c1e0f18edfb59a3c8add6b13d", "url": "https://www.bonappetit.com/recipe/wild-rice-dressing", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Wild Rice Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueWild Rice DressingBy Andy BaraghaniOctober 16, 20184.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis savory wild rice dish is the ultimate gluten-free stuffing and doubles as a holiday-appropriate grain salad with lots of fresh herbs. Cook the grains in well-salted water for much longer than you'd think; until the rice is splitting open, it's not done.Ingredients8 servings 1cup pecans2cups wild rice, such as RiceSelect® Royal Blend® RiceKosher salt¼cup red wine vinegar2Tbsp. fresh orange juice2Tbsp. honey1garlic clove, crushed½cup extra-virgin olive oil, divided, plus more for drizzling2large leeks, white and pale green parts only, tough outer layer removed, halved lengthwise, thinly sliced crosswise12oz. mushrooms (such as maitake, chanterelle, and/or oyster), torn or cut into large piecesFreshly ground black pepper2tsp. chopped thyme⅓cup sliced chivesPreparationStep 1Preheat oven to 350°. Toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 6–8 minutes. Let cool, then coarsely chop.Step 2Cook wild rice in a large pot of boiling salted water until most of the grains have split and all are tender, 40–50 minutes; drain and rinse under cold running water. Shake off as much water as possible and let cool.Step 3Meanwhile, whisk vinegar, orange juice, and honey in a large bowl to combine. Add garlic and let sit 10 minutes to infuse. Fish out garlic; discard. Add rice and toss to coat.Step 4Heat ¼ cup oil in a large skillet over medium-high. Cook leeks, stirring occasionally, until tender and browned in spots, 8–10 minutes. Season with salt and transfer to bowl with rice; toss to coat.Step 5Wipe out skillet and heat another ¼ cup oil over medium-high until just beginning to smoke. Arrange mushrooms in skillet in a single layer and cook, undisturbed, until undersides are golden brown, about 2 minutes. Season with salt and pepper, toss, and continue to cook, tossing often and reducing heat as needed to avoid scorching, until golden brown all over, about 3 minutes longer. Mix in thyme and immediately transfer to bowl with rice. Add pecans and chives and drizzle with more oil; toss once more.Step 6Do Ahead: Rice can be cooked 1 day ahead. Let cool; cover and chill. Dressing can be made 3 hours ahead; store tightly wrapped at room temperature.How would you rate Wild Rice Dressing?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleNo Salt No Butter... What's the point...? I'm from MinnesotaAnonymousMinneapolis 11/13/2021This is a really delicious and well-balanced recipe. I made it twice, once as a test, and again for my Thanksgiving table. The only difference I made the second time was adding less of the vinaigrette; it adds some really nice depth and acidity to the rice, but I found the full amount listed in the recipe to be overpowering of the other flavors in the dish. With some slight adjustments, this was a hit at my table! isheetaSan Diego, CA11/26/2018Explore Bon AppétitStuffingAmericanPecanNutLeekVegetableMushroomChiveHerbs & SpicesRiceRice & GrainsFallSideGluten-FreeSautéSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Andy Baraghani"]}