{"id": "5c8cea07a3e30d3356d83ad386ca2d06", "url": "https://www.bonappetit.com/story/set-up-your-spice-drawer", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "6 Rules for Setting Up a Spice Drawer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking6 Rules For Setting Up Your Spice DrawerFrom asafoetida to za’atar.By Sarah JampelMay 18, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat BoytsovaFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.There isn’t one right way to organize your spice cabinet/drawer/closet. But there are some non-negotiables for making a collection that works for—not against—you. Here's our list:1. Keep it far away from your oven.Heat causes spices to degrade faster. So if you’re storing your collection above your stove or near a radiator, it’s probably best to rearrange.2. Toss anything you can’t remember using. You won’t miss it.Even if your spices are in a cool, dark place, they’re not improving with age. So if you’re not sure where you bought that mustard powder or when you last used it, chances are it’s no longer fragrant anyway.3. You don’t need a million spices.Find the ones you love (check out some of these personal lists from test kitchen editors for some inspiration) and leave the others for the rest of us. If a recipe you’re following calls for a small amount of a spice that you can’t imagine ever using again, skip it.4. Optimize the space you’ve got.If you have a pull-out drawer, label the tops so you can keep track of your inventory, or invest in an in-drawer insert so the spices can lay on their sides. If you’re using a shelf, label the sides of the jars and buy a lazy Susan or tiered shelf for easiest access.5. Any organization method is better than no organization method.Some people like to arrange alphabetically, while others categorize by type (peppers, warm baking spices, aromatics, herbs, all the rest), area of the world, or frequency of use. Think about what makes the most sense for you, then make a system and strongly encourage anyone else sharing the drawer to put the jars back in their intended places, lest they lose their privileges.6. Buy a set of standard jars.Make sure they’re small to encourage turnover (we like 2-ouncers) and that you can fit a teaspoon inside. Glass is the material of choice—it does that best job of protecting your precious goods.Buy it: 24-pack of 2-ounce glass jars, $29 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitSpiceShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-18", "author": ["Condé Nast", "Sarah Jampel"]}