{"id": "5c8e565ffcfb11ca209a9e230d767e49", "url": "https://www.bonappetit.com/recipe/cornbread-stuffing-with-sausage-and-collard-greens", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Cornbread Stuffing with Sausage and Collard Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCornbread Stuffing with Sausage and Collard GreensBy Molly BazOctober 16, 20184.7(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe key for this stuffing recipe is making your own buttermilk cornbread. This way, you can control the moisture and sugar levels, and it also makes your whole kitchen smell like a buttered corn muffin. Cubing and lightly toasting the cornbread preps it for maximum flavor absorption without compromising its sturdiness.Ingredients10–12 servingsButtermilk Cornbread9Tbsp. unsalted butter, divided, plus more for pan2Tbsp. extra-virgin olive oil1½lb. hot or sweet Italian sausage, casings removed1large onion, finely chopped2celery stalks, finely chopped6garlic cloves, thinly sliced2Tbsp. finely chopped rosemary1Tbsp. kosher salt½tsp. crushed red pepper flakes2bunches collard greens, stems and ribs removed, leaves torn or cut into 2\" pieces1½cups heavy cream2½cups low-sodium chicken broth, divided3large eggs, beaten to blendPreparationStep 1Place a rack in middle of oven; preheat oven to 300°. Cut cornbread into 1\" cubes and divide between 2 large rimmed baking sheets.ChevronChevronStep 2Toast, turning over halfway through, until outsides are dried out and some of the sides are golden brown, 45–55 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Increase oven temperature to 350°. Lightly butter a 13x9\" baking dish. Heat oil in a large Dutch oven or other heavy pot over medium-high. Arrange sausage in a single layer in pot and cook, undisturbed, until browned underneath, about 4 minutes. Break up into bite-size pieces with a heatproof rubber spatula or wooden spoon and continue to cook, tossing occasionally, until just cooked through, about 3 minutes longer. Transfer sausage to a large bowl.Step 4Reduce heat to medium-low and add 8 Tbsp. butter to same pot; swirl to melt and to coat bottom of pot. Add onion, celery, garlic, rosemary, salt, and red pepper flakes. Cook, stirring often, until vegetables are softened but not yet browned, about 5 minutes. Add collard greens and cook, tossing occasionally, until wilted, about 2 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Add cream and 1 cup broth and bring mixture to a bare simmer. Cover pot and cook until greens are softened, 7–9 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Add vegetable mixture to bowl with sausage; mix in remaining 1½ cups broth, then eggs.ChevronChevronStep 7Add cornbread and carefully toss once (don’t break up pieces). Let sit 5 minutes, then gently toss again.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 8Let sit until almost all the liquid has been absorbed, about 5 minutes more. Transfer stuffing, still being gentle with it, to prepared baking dish. Dot surface with pieces of remaining 1 Tbsp. butter and cover with foil.Step 9Bake stuffing until hot in the center when pierced with a paring knife, 20–25 minutes. Remove foil and continue to bake until surface is deep golden brown and there are some crispy bits of sausage and greens on top, 25–30 minutes more.Step 10Do Ahead: Cornbread croutons can be made 2 days ahead; store in an airtight container at room temperature. Stuffing can be assembled but not baked one day ahead; cover and chill. Bring to room temperature before baking.How would you rate Cornbread Stuffing with Sausage and Collard Greens?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI've made this recipe for the past few years and its always a hit. Its super delicious and flavorful. The little browned bits of sausage are AMAZING and honestly I was a little wary when initially making the cornbread since it isn't exactly flavorful. But it is perfect for soaking in that wonderful creamy sauce. 10/10, will make every year :) PMoneyWashington, DC11/19/2020This was fantastic!  I made it vegetarian (used vegetable stock and replaced the sausage with sauteed mushrooms), and it was a huge hit with everyone, meat-eaters included.  It will be a holiday staple from here on out.yoshi991/5/2019No a review, but a question...does this stuffing work well in the turkey?AnonymousSan Jose CA11/16/2018Explore Bon AppétitStuffingAmericanSouthernSausageMeatCollard GreensLeafy GreensVegetableCeleryRosemaryHerbs & SpicesSideKwanzaaThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}