{"id": "5c92dcc77bb58b59a8de9c0366b0108f", "url": "https://www.bonappetit.com/story/grill-more-pork-shoulder-steaks", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Why Aren't We Grilling More Pork Shoulder Steaks? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Aren't We Grilling More Pork Shoulder Steaks?A weekly dispatch from Bon Appétit's editor in chief.By Adam RapoportJune 25, 2019FacebookTwitterEmailGentl & HyersFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I like to say that Bon Appétit is only as good as its recipes. But that doesn’t mean I never veer from the script.Let me explain.I was at a farm stand butcher on Saturday and I spied some real nice looking pork shoulder—all rolled and tied up, streaked with milky white intramuscular fat.Want this letter before it hits the website? Sign up for our newsletter!I knew I had to buy some; I just wasn’t sure what to do with it. Slowly braising or smoking it wasn’t in the cards because of time constraints. But then I remembered a BA video that just went live of Carla Lalli Music grilling up Gochujang pork shoulder steaks.Carla Makes Pork Shoulder Steaks\nThe recipe is chef Rachel Yang’s, from a Korean BBQ primer we did a few years back. In Korea, meats that most Americans typically think of as braising cuts—brisket, short rib, pork shoulder—are sliced relatively thin, often marinated, and then quickly grilled over medium high heat, yielding richly flavorful and exceptionally juicy results.So that’s what I was going to make. Done deal. Except I didn’t have Gochujang, the Korean hot chile paste. Nor did I have the sake or mirin the recipe called for.But I did have four gorgeous 3/4-inch pork shoulder steaks. So instead of Gochujang, I bought a bottle of the farm’s house-made sriracha. (Not the same as Gochujang, but it also offers a spicy-sweet, fermenty hit.) Back home, I knew I had the called-for ginger and garlic. I also had a fridge full of rosé, which is neither mirin nor sake, but hey, they’re all wine.So I hodge-podged together my take on the marinade, intensely fragrant and potent. I fired up my charcoal Weber, and I grilled a version of Rachel’s Gochujang pork shoulder steaks ‘till super crispy and still juicy at the center, just as Carla had shown me.They were amazing. Not exactly what Bon App called for, but that’s okay in my book. What matters is that you take from a recipe the key technique or essential ingredient (in this case grilling a braising cut and seasoning it aggressively) and then make it your own. Because, really, the most important thing is that you make it.Get the recipe:Gochujang Pork Shoulder SteaksThe centerpiece of Korean barbecue is the meat, but it doesn't have to be steak.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-25", "author": ["Condé Nast", "Adam Rapoport"]}