{"id": "5c95be79f7d9c9bf408dcd1ef3409ef4", "url": "https://www.bonappetit.com/recipe/classic-chicken-noodle-soup", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Classic Chicken Noodle Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic Chicken Noodle SoupBy Molly BazFebruary 4, 20224.7(186)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThere are tons of weeknight shortcuts that we could have snuck into a homemade chicken noodle soup recipe, but this time we’re not cutting corners. This is the long game, and the results are worth it! The golden-hued soup is about as classic (and as comforting) as they come. The key is to treat the breasts and legs of a whole chicken differently: The breasts need to be pulled from the simmering broth early so they don’t dry out, whereas the legs require a little more time to become tender. (Want some extra guidance? Check out this step-by-step video.)But it’s not only about the bird. Vegetables require more consideration than just cooking to mush alongside the chicken, so we discard the ones that build the broth, then swap in a second round of celery and carrots that cook just until tender. Dill lends bright, herbal flavor, but you could use fresh thyme, oregano, or a few bay leaves if you prefer. For the pasta, we opt for ditalini cooked in the broth, but feel free to use any small quick-cooking pasta you have. We wouldn’t be mad about orzo, ABCs, fregola, or even tortellini.If you’re looking to add another chicken soup recipe to your repertoire, try this one with rice noodles, scallion crisp, and an herby finish. And, if you prefer a variation on chicken soup with rice and the simplicity of using boneless chicken thighs, this gingery version is nourishing and deeply comforting.Editor’s note: This recipe was originally published January 5, 2020.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Pot$55 At AmazonLarge Basting Spoon$16.37 At AmazonInstant-Read Thermometer$35 At ThermoworksTongs$13 At AmazonForkSieve$18 At AmazonIngredients6 servings13–4-lb. whole chicken4tsp. kosher salt, plus more2medium onions4medium carrots4celery stalks, divided2heads of garlic1Tbsp. black peppercorns½small bunch dill, divided6oz. ditaliniFreshly ground black pepperPreparationStep 1Season one 3–4-lb. chicken all over with 4 tsp salt.Step 2Time to do some prep work: Cut 2 medium onions into quarters. (There's no need to remove the onion skins, which lend the broth a golden hue, but you can if you'd like.) Peel 4 medium carrots. Coarsely chop 2; set remaining 2 aside. Coarsely chop 2 celery stalks. Cut 2 heads of garlic in half crosswise.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Combine chicken, cut vegetables, 1 Tbsp. black peppercorns, and 2 dill sprigs in a large pot. Cover with 14 cups cold water and bring to a simmer over medium-high heat. Cook, reducing heat as needed to maintain a simmer and using a large spoon to skim off any foam that rises to surface of pot, until an instant-read thermometer inserted into thickest part of breast registers 155°, 20–25 minutes.Step 4Using tongs, carefully lift whole chicken out of pot and transfer to a cutting board. Let rest until cool enough to handle.Step 5Arrange chicken breast side up. Grab a wing and pull it outward so you can see where it attaches to the body. Using a sharp boning or chef’s knife, cut through the joint to separate wing from breast (if you hit bone, you’re in the wrong spot; pull the wing out farther to help you get to the place where the joint meets the socket). Remove wing; repeat on the other side.Step 6Cut through skin connecting 1 leg to carcass. Pull leg back until ball joint pops out of its socket; cut through the joint to separate the leg. Repeat on the other side.Step 7Now for the breasts: Cut along left side of breastbone (which runs right down the center of the breast). Angling your knife, cut breast meat away from carcass. Repeat this process, cutting down along the right side of the breast bone for the remaining breast.Step 8Pull off and discard any skin from legs and breasts (no need to discard skin of the wings). Return legs, wings, and what remains of the carcass to pot with vegetables. (You should now have only the chicken breasts remaining on your cutting board.)Step 9Continue to simmer soup, occasionally skimming fat that rises to the top with large spoon, until reduced by an inch or two and very full-flavored, about 40 minutes.Step 10While soup simmers, shred cooled chicken breasts with 2 forks into bite-sized pieces.Step 11Thinly slice remaining 2 celery stalks crosswise. Cut remaining 2 medium carrots into ½\" diagonal pieces. Finely chop enough dill to yield ¼ cup.Step 12Transfer 2 chicken legs to cutting board to cool. Set a fine-mesh sieve over another large pot. Strain soup into second pot, discarding bones, carcass, wings, and vegetables.Step 13Bring broth to a boil over medium-high heat. Add 6 oz. ditalini and stir once. Cook 5 minutes.Step 14While ditalini cooks, shred meat off 2 chicken legs; discard bones.Step 15Add shredded chicken and sliced carrots and celery to pot and cook until pasta is cooked through and vegetables are tender but not mushy, 4–5 minutes longer.Step 16Remove pot from heat. Stir in dill. Season well with salt (it’s going to take a lot!) and pepper.Step 17Divide soup among bowls. Top with more pepper.How would you rate Classic Chicken Noodle Soup?Leave a ReviewTell us what you thinkReviews (59)Back to TopTriangleLove this one and have made it many times.  Great as written but thyme, parsley, and/or chives also work for those that don't love dill.  I usually pull the skin off in sheets, season it, crisp it up in cast iron and serve it as a sort of chicken cracker topping.JoeMinneapolis, MN3/6/2022I made the recipe for the first time tonight and followed it exactly as written and it turned out great! Based on the reviews, I thought it would need more salt or seasoning but it was actually perfect with 4 tsp coarse kosher salt. I don’t use dill often but this turned out delicious and I would make it again!CatLos Angeles, CA2/14/2022This was very good! I did add a few more herbs, and a little better than bouillon roasted chicken, but other than that I followed your recipe and took the chance with the fresh dill. I have never made chicken soup with dill in it, and it was wonderful. The breast meat got a little warmer than it was supposed to, but it was fine. I didn't realize how quickly it would cook. It was about 170 degrees with my thermometer when I took it out. After I pulled everything apart and removed the skin, I shredded it by hand, put it in a bowl and placed it in the fridge while the rest simmered. I have fallen in love with ditalini in my chicken soup. I did cook it al dente first. I had plenty of broth. I did not measure my water as I used a large pan, so I just made sure I added enough water to barely cover the chicken so that it would cook properly. Thank you! After I saw you make this soup I had to try it, it did not disappoint!JackieKentucky2/13/2022Molly, Molly, where are the noodles? Everyone knows that ditalini are not noodles. Even that horrible canned chicken noodle soup from Campbells had the right pasta, soggy as it may be.pacepuleoNYC2/9/2022How about that BA paywall. A little late to the party considering the NYT and CI have many of us under contract. Hey BA, what about consideration for magazine subscribers, no recipe box - Epicurious single column no filters doesn't count and if you wanna charge you need to curate your recipes. Most are available with a simple google search. AnonymousDenver2/9/2022This looks like perfect chicken soup made from scratch like I wish all my food was! The only thing I would change would\nbe parsley in place of dill.  BON APPETIT !mushyWest Monroe, LA1/31/2022Love this recipe was skeptical about the dill but seeing as I love dill I tried it and loved it I did add Thyme and some roasted chicken better than bouillon as we made this over the weekend at my BG’s house and we thought it needed the Thyme and I kept adding salt to my bowl so when I made this at home today I added the better than bouillon to give it more flavor!! KateBuffalo NY1/3/2022I LOVE this recipe! I adapted it by: adding 1 chicken bullion cube and putting the kosher salt in the broth and not on the chicken.Lena SearcyRomeoville, IL12/29/2021Instead of cooking a whole chicken I picked up a rotisserie chicken from Costco and put the bones in the stock in the beginning and took those out at the end. I also used egg noodles instead . I think these changes added more flavor but I also added some concentrated chicken stock for a extra boost.Kya Harland Seattle Washington 10/4/2021I really don't get why so many commenters are skeptical of dill, skipped it electively, or didn't bother to seek some out before starting the recipe. It's a fantastic, maybe even essential, ingredient in chicken noodle soup and imparts a wonderful, bright complexity to the proceedings. Yes to dill! Kid IcarusBrooklyn9/19/2021I didn’t find this very flavorful except for the hits of\ndill. Right before serving I added a few healthy squeezes of lime and thin slices of jalapeño. Next time, I’d boil all but the chicken for longer to hopefully intensify the flavor and add the chicken later in the process. AELPortland, OR 9/3/2021I'm making this soup as I type this comment.\nI just tested/tasted it. This soup is delicious! \nI used the whole chicken along with kosher salt, peppercorns, celery stalks and leaves, onion, and carrots. I was concerned about using two whole heads of garlic but it added lots of umami deliciousness. Didn't have fresh dill, so I substituted dried dill. Cooked the ditalini separately as many suggested to avoid the pasta from soaking up too much soup, Added ditalini to bowls before scooping the soup over it. Served with crusty Italian bread I made earlier in my cast-iron Dutch oven. (You can tell I have too much time on my hands on a rainy day!) Thanks, Molly!Bill DorganCharleston, SC8/5/2021I didn't know chicken soup was so complicated. However, so worth it. We don't like breast meat so I used chicken leg quarters and over a pound of chicken necks (I'm trying to get more bone broth into our diet). I also cooked pasta separately, and pour soup over pasta in each bowl. So satisfying. I will be making this more in the future. This would make a great matzo ball soup.Anonymouscoronado, ca6/26/2021Amazing, simple recipe, yet just fussy enough to achieve the perfect end product. That said, when ordering everything I needed for this recipe, I forgot that I had just ran out of onions, and ended up using 6 shallots instead. Honestly, I cannot imagine that onions would have made the soup any better. At the end though, I went rogue; while adjusting for seasoning before adding in my pasta (orzo), I added in around a teaspoon of MSG... Y'all know the rest. DanMiami, FL6/20/2021This soup is so versatile! I love skipping the noodles and, instead, make matzah balls. Great recipe!GaryAuckland, NZ5/11/2021Explore Bon AppétitSoupSoups and StewsAmericanChickenPoultryOrzoPasta & NoodlesDitaliniMainDairy-FreeNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-05", "author": ["Condé Nast", "Molly Baz"]}