{"id": "5c96a815129f5cf4fa3c580619897dc2", "url": "https://www.bonappetit.com/story/meal-planning", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Meal Planning > Meal Prepping | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMeal Planning > Meal PreppingI'm a planner, not a prepper.By Christina ChaeyMay 2, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,This week, Amanda Shapiro and I took over the Bon Appétit Foodcast to talk about solo-cooking, a subject I wrote about a few weeks back. Relistening to our conversation (live from our brand-new home podcast studios, a.k.a. our closets—or, in my case, my roommate’s closet) got me thinking about the difference between “meal prepping” and “meal planning.”I realized that my dislike of the term “meal prep” goes beyond the fact that it conjures up the staid image of five identical containers of neatly-packed chicken breasts, sweet potatoes, and kale. I don’t like the idea that once the prep is over, your meals are no longer something you have get to think about for the rest of the week. Some people find this one-and-done strategy empowering (and more power to them), but that’s  just not what leaves me feeling excited to eat every day.Meal planning, on the other hand, is defined by a sense of limitless possibility. It’s about prepping some things ahead of time (like your herbs and greens), maybe flagging a couple of recipes that sound really good, but ultimately letting the finer details of your meals come into focus day by day, rather than trying to predetermine your whims and cravings. It’s about planning just enough that you’re not concerned about wasting food, but leaving enough flexibility and room for your real life, imperfect and fickle and not always in the mood for chicken breasts.Here are a few of the (loose!) rules I follow as a planner, not a prepper.What a week of dinners looks like in the Karten household.\nDo: Write It DownI generally know what I have to use up first in the fridge, but I might start taking a literal page out of associate social media director Rachel Karten’s meal-planning notebook, pictured above. She’s a recent meal-planning convert who, at the beginning of each week, jots down a rough menu plan (with pen and paper) based on what’s in her pantry and what she bought on her weekly grocery trip, which usually includes lots of fresh vegetables and herbs. I really love the key sub-sections she uses to specify what she needs to defrost ahead of time (meats and fish), what she needs to freeze (leftover sandwich bread) and what she can make ahead to cut down on prep time (sauces and yeasted doughs).Freeze extra pierogies now, eat them whenever.\nDo: Shop At HomeGood meal planning is all about knowing what you have, or “shopping at home.” Last week, I finally tackled a project I’d been putting off for maybe close to a year (but now that it’s done I feel extreme relief): documenting every single item in my pantry, spice cabinet, freezer, and fridge in a multi-tabbed Google spreadsheet. It’s not...a short list. I’m especially mortified by how much shit I’ve amassed in the freezer since my freezer edit from a few weeks back (huge bag of oxtails, how did you get in here?!) But now that I know exactly what’s in there, I’ve resolved to cook at least one thing from the freezer every day, and have a long list of delicious ideas (in the spreadsheet, of course) for dishes I can’t wait to make. On the docket this weekend: make broth with those oxtail bones; bike baggies of extra homemade braised short rib pierogies and pork dumplings to nearby friends who could use a quick meal; and turn my family-size stockpile of Vista Hermosa corn tortillas into vegetarian enchiladas for our Sunday house dinner.Don’t: Get Hung Up If Your Plans ChangeMaking a loose meal plan for the week can be great and freeing; making one that doesn’t build in some flexibility for swaps or the occasional uncharted detour is unrealistic. Things will veer off course: the scallions will go slimy before you get to them. You’ll realize you’re out of sour cream. You’ll wake up in the morning and find you somehow have zero desire for the tacos you’d planned on having for dinner. Don’t sweat it. Reconfigure and make a new plan— just make sure it leads you to something you’re excited to eat. Even the best-laid meal plans go awry, but I’ve become a more resilient, resourceful, and straight-up better cook by embracing the unexpected chaos.Happy planning,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?Meal PrepessayRead MoreCoronavirusHow I Threw a Dinner Party in IsolationBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-02", "author": ["Condé Nast", "Christina Chaey"]}