{"id": "5ca03a4196259e499b4a15ad9155a1cb", "url": "https://www.bonappetit.com/story/mutual-aid-herb-network", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "The Herbal Mutual Aid Network Creates Free Tinctures for Black Organizers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Herbal Mutual Aid Network Creates Free Tinctures for Black OrganizersH.M.A.N. founders Yves B. Golden and Remy Maelen send free  plant medicine to Black individuals, activists, community groups, and herbalistsBy Aliza AbarbanelAugust 6, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIn late May, artist and organizer Yves B. Golden and artist and herbalist Remy Maelen launched the Herbal Mutual Aid Network (H.M.A.N), a grassroots community care organization that transforms donated plants from farmers, wellness brands, and fellow herbalists into free herbal medicine to support the physical and emotional health of Black folks across the country. H.M.A.N. has now shipped over 600 specially curated “care boxes” to individuals and served over 1,000 others through bulk distribution to Black-led community organizations, free herbal clinics, and frontline organizers—and they’re just getting started. Here, Maelen outlines how plant medicine supports frontline organizers, the importance of peer-to-peer care, and H.M.AN.’S next chapter.How did the idea for the Herbal Mutual Aid Network come about?Yves and I gravitated toward each other right after George Floyd’s murder. We were both posting similar things on social media: calls for accountability within wellness. She knew that I had been offering donated medicine through my practice on a much smaller scale for a while, and when we connected over the phone, we decided to just go for it. Yves had a list of friends she was looking to get immediate support to so we started there and then decided to open up the call for other requests. She reached out to Black-led organizations she wanted us to support as well and we started offering bulk boxes. We wanted to provide free plant-based care to Black people who are requesting support. The way we articulate it on the website is “people seeking support due to the ongoing crisis of racial violence and injustice”—anybody who is feeling like they need that care. We’re also supplying in bulk to Black-led community organizations and Black herbalists who are organizers doing mutual aid work in their communities all over the country.It was a moment that demanded action. A lot of people who work in food have done a similar thing, just taking stock and evaluating what resources they have access to, what is abundant, and how that can be put to use. We hit the ground running, starting with an abundance of milky oats tincture that I had made. We also put out a request for donated [plant] medicine from other folks, because we knew it would run out pretty quickly.Why milky oats tincture?Milky oats reveals the blurred line between food and medicine. It’s the same plant we eat, and when we process it as medicine it can offer nervous system support. It’s really great for people who are feeling depressed, frazzled, irritable...it’s got a soothing, coating, cooling feel to it.It’s considered a nutritive herb, so it’s something you take in small doses throughout the day. I take a half or full dropper three or four times a day diluted in an ounce or two of water but you can also put a few squeezes in your water bottle and sip it throughout the day.How do donations fit into H.M.A.N.’s work?We’re trying to serve as a conduit: Bulk plant donations come in to us and they’ll either be processed as medicine or redirected to other organizers and herbalists who have requested specific plants. It comes from a mix of “wellness” brands, individual herbalists, farmers, and even home gardeners hitting me up with a couple pounds of dried motherwort. We want to hear from herb farmers who are willing to get involved by supplying bulk plants, distilleries who are willing to offer neutral spirits, apple cider vinegar, and organic vegetable glycerin—these are some of the working materials that are the bases of our formulas. We’re pushing more for those donations at the same time as accepting product donations and financial donations through our site so we can keep the flow going.Product donations go toward supplying front-line organizers with first aid support. In terms of serving organizations in bulk, we are prioritizing care for Black trans and disabled people who are the most at risk populations in our communities. We’re also working on producing care boxes filled with in-house remedies created in collaboration with different Black herbalists—like Arvolyn Hill of Goldfeather, Catherine Feliz of Abuela Taught Me, and Tyi Jones of Woven Aura— as a way to highlight their work and make sure the cycle of care is happening on a peer-to-peer level. We can use the donation budget to pay Black medicine makers to make this free medicine for their own communities. That’s where we see this being sustainable in the long-term: Not just relying on brands to make their work more accessible, but uplifting Black herbalists.Why is the mutual aid aspect of this project important?Mutual aid is not new. Peer-to-peer care and plant-based care have been going on for a lot longer than the systems that many of us are more familiar with today, like capitalism, the biomedical industry, and wellness as an industrial complex.When people use the words “alternative medicine,” that’s only true from a really limited perspective. Traditional plant medicine is primary care for many people all over the world. There are many reasons why people may not feel safe around biomedical practitioners. There's a lot of violence towards Black people, especially Black women, in the history of the biomedical industry. The herbs we're providing aren't meant to replace going to the doctor when you need to go to the doctor—it’s there for people to connect and feel more empowered as they go about managing their care.For me, plant medicine is all about relationship and interdependence, the way our bodies and experiences happen in conversation with plants. That mutuality is also the reality of our relationships with one another, which are way more interrelated than the dominant capitalist structure of our society admits, and I do think healing comes from acknowledging interdependence and interrelatedness. It’s important that people feel empowered in their care and in touch with their bodies.When we're working on the level of community care and peer-to-peer care, no one is profiting off you being unwell. We want to lift each other up, all at the same time. What types of plant medicine are you distributing right now?We’re sending out a lot of first aid topical care, like topical CBD and salves for bumps and bruises, plant-based sunscreens, and formulas for immune support. Emotional first aid is major as well. A lot of energy is expended in showing up for protests and vocalizing in that way. We’re prioritizing alcohol-free nervous system relaxants with plants that can be supportive in moments of extreme anxiety: Scullcap is a nervous system relaxant that’s helpful for supporting anxiety and also addressing mild pain. Blue vervain has been a really powerful ally for friends on the frontlines, especially for organizers. It’s another nervous system relaxant, but I think it’s specifically helpful for relaxing forward drive when you’re going all the time. Also rose— a shift happens when you take a moment to taste the flavor of rose. It’s an evocative plant for a lot of people.Do you find that most recipients are familiar with plant medicine? Are they beginners?It’s been a mix so far. Herbal education is a big part of what we’re growing into. In the moment, that means supplying people with a little zine of information to go along with the kit. In the future, that's looking like finding ways to offer free virtual herbalism classes and building more of an educational platform. We are also developing an online journal on care, centering the voices of Black queer, trans and disabled people, which will be launching soon!How do you decide what to send where?When folks request care, there is a detailed virtual request form where they can specify what kind of support they’re looking for and let us know of any restrictions. When it comes to giving things out to a big group of people where you don’t know what they do or don’t use in their bodies, it’s helpful to offer what is most broadly accessible. That’s one of the reasons why milky oats is a great option—it doesn't have a lot of contraindications with medicine people might be taking. Alcohol-free medicine is great for offering support for people who are sober or don’t work with alcohol for another reason.What’s the goal for the future of H.M.A.N.?We want to get the message to people that plant medicine is for everyone. We’re building a database of mutual aid groups, so people can find more local programs and support them. We’re working on building relationships between farmers with local herbalists to create more of an ecosystem. We’re also working to support land sovereignty efforts led by Black and indigenous medicine makers who are working toward land ownership, and we’re building this free in-house line of plant medicine.Part of what we’re creating is a pathway where people, whether it’s white individual healing practitioners or white-owned wellness brands and farmers, can look for ways to build some form of reparations into their business. That word feels heavy for some people, but it’s a straightforward and urgent matter of equity and accessibility. The wellness industry is a $4.2 trillion industry and it’s definitely not designed to get care to the people who need it most. So we should put pressure on “wellness” brands and practitioners to address that in tangible ways. But ultimately, we will take care of each other. Explore Bon AppétitHealthyishSelf CareRead MoreLifestyleHow I’m Prioritizing Black Joy in Our Fight for JusticeBy Devyn BeswickRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-06", "author": ["Condé Nast", "Aliza Abarbanel"]}