{"id": "5ca3b831b11d0b9fdc2fbb8ba3fed57c", "url": "https://www.bonappetit.com/story/date-syrup", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "This Date Syrup Is the Perfect Natural Sweetener | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Single-Ingredient Syrup Is the Perfect Natural SweetenerIt's got more than twice the potassium, calcium, and magnesium levels of maple syrup or honey, with up to 10 times the antioxidants.By Cassandra Landry April 26, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI have a thing for cinnamon sugar toast. Also that thing where brown sugar melts into sweet, amber puddles in oatmeal, or the way a good pour of maple syrup cascades over a stack of warm pancakes. If no one’s looking, I will absolutely throw French Vanilla Coffee-Mate into a fancy pour-over.Every month or so, I’ll usually make a half-hearted oath to cut back on sugar. It doesn’t usually last long.The first time I tried Sylvie Charles’s Just Date Syrup, I was sitting across from her in a very cute tea shop on the outskirts of Berkeley, California. We sat near a mock Japanese garden and drank chai lattes, each of which had been crowned with a hypnotic spiral of her creation. As I lifted the mug to take a sip, there it was: Warm notes of caramel and molasses with that telltale raisin-y tang, like a lightning strike dissolving into the foam. It felt like discovering that your longtime friend, the simple date, the one you thought you knew inside and out, has a secret life as a drag racer. Dates can be DRAG RACERS, I thought.Charles and her dates (medjools sourced from Woodspur Farms, California’s largest organic date farm in the Coachella Valley) are out to change the way you think about sugar. Rather than banning it entirely, she believes, why not let it give you the nutrients you need more of anyway?Date syrup isn’t new: It’s been around for centuries and is woven deep into Middle Eastern cuisine. It even had a brief heyday on the shelves of 1970s co-ops. But its simplicity is particularly well-suited to our current wellness moment. “I've been surprised, over and over again, about how it isn't just one demographic looking to modify how they eat,” says Charles, the daughter of Indian immigrants who trained and worked as a physician before a back injury forced her to take a months-long leave of absence. During that time, she began cooking low-salt, low-sugar versions of the food she’d grown up with. She began with a line of achaar-inspired sauces, which led her to date syrup.Her process is simple: She simmers the dates in water, then presses and strains the mixture. The resulting syrup, silky and elegantly sweet, sits at a cool 47 on the glycemic index (a measure of the effect of different foods on blood sugar) compared to the 68-70 of refined sugar. A tablespoon of date syrup contains more than twice the potassium, calcium, and magnesium levels of maple syrup or honey, with up to 10 times the antioxidants. Refined sugar has none of that.“The research tells us over and over again that sugar and high-fructose corn syrup are the reason we're facing so much chronic illness,” Charles says. “America is never going to lose its sweet tooth, and everyone is looking for a way to satisfy that craving. People, me included, want the health benefits [and] also want it to be delicious.”And some of us want to stop feeling guilty about the looks we get from our dentist. These days, I swirl Just Date Syrup into oatmeal or onto Greek yogurt with a handful of fresh fruit. I paint zig zags of it over almond butter on toast. It transforms my coffee. Hand to sugar-loving heart: I don’t even miss my old ways.Buy it: Just Date Syrup, $16 for a two-pack on Amazon.Use date syrup in a salad:Warm Eggplant Salad with WalnutsDate syrup gives this savory, nutty eggplant salad the perfect amount of sweetness.View RecipeExplore Bon AppétitHealthyishDateShoppingRead MorecookingWhat Is Coconut Sugar, the Alt-Sweetener Taking Over Baking?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Cassandra Landry"]}