{"id": "5caa9274b346d479c4f8b9db7f93188d", "url": "https://www.bonappetit.com/story/recipes-help-cold-flu", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Use These Recipes to Ward Off Cold and Flu Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingUse These Recipes to Ward Off Cold and Flu SeasonWhen you get hit hard with sickness, editor in chief Adam Rapoport suggests these soups, tonics, and comforting dishes to help soothe you.By Adam RapoportOctober 30, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cold and flu season is comingI can’t tell you when the official start of “cold and flu season” is, but I do know that the Bon App offices got hit hard last week.Carla Lalli Music called in sick, Alex Delany and Alyse Whitney went home sick, and I staggered through a slate of endless meetings with a pounding head cold. In times like these, the BA staff turns to the recipes that soothe us.Want this letter before it hits the website? Sign up for our newsletter!First up is always one of Brad Leone’s tonics. Our test kitchen manager-turned-YouTube phenom keeps a battery of tinctures, juices, extracts, and herbs in the walk-in fridge. And if you butter him up good, he’ll concoct a cure-all for you on short notice.Michael Graydon + Nikole HerriottI like mine with lots of fresh lemon or lime juice, some bruised mint leaves, unsweetened cranberry juice, and then whatever else Brad drops in there, from echinacea to digestive bitters. It all goes into a big plastic quart container with some ice and then, if I’m feeling fancy, I top it all off with a can of seltzer. This carries me through the day when all I really want to do is take a nap on my couch.Same but different is Chris Morocco’s garlic broth—loads of garlic and fresh herbs simmered in water with a bit of salt and olive oil ‘til you’ve got a fragrant, fortifying broth. Fill a big mug with the stuff and you can roll up all boss-like on your colleagues, just like Lumbergh in Office Space.Of course, when you’re battling a cold, you’ve got to do more than stay hydrated—you’ve gotta eat. I gravitate toward two BA recipes, both with poached chicken, ginger and some heat, either hot sauce or fresh chiles—something to clear the sinuses.I love Carla’s chicken with crispy rice. She takes the chicken-poaching liquid (infused with Thai basil, ginger and scallions) and then uses it to make the rice. A brilliant, efficient move. The finished dish evokes Khao Man Gai, the celebrated signature dish at Nong’s in Portland, Oregon.Alex LauIf you insist on soup when you’re under the weather, then you’d be wise to go with Andy Baraghani’s chicken and rice soup with green chiles and ginger. It’s as homey and warming as it sounds and (bonus!) it’s topped with chopped roasted peanuts and scallions. I’m all in.So, there you go. You’re armed and ready. Because, not to get all Game of Thrones on you, but cold and flu season is coming.Get the get-well recipes:BA Brad’s Classic TonicGarlic BrothChicken and Rice Soup with Green Chiles and GingerChicken with Crispy RiceExplore Bon AppétitAdam NewsletterSoupRead MorecookingThese 3 Chicken Soups Are Here to Solve All Your ProblemsBy Alex DelanycookingAll the Things We Eat When We're Too Sick to CookBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Adam Rapoport"]}