{"id": "5cb3ff6bc19ed3b985a7d70dfb5e7f0c", "url": "https://www.bonappetit.com/recipe/beef-wellington-with-green-sauce", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Beef Wellington With Green Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBeef Wellington With Green SauceBy Chris MoroccoMarch 16, 20214.6(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Victoria Granof, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis sort-of-traditional approach to beef Wellington doesn’t shy away from using a wide range of umami-rich ingredients such as bacon, soy sauce, mustard, and maitake mushrooms to create tons of flavor. A lighter sauce packed with herbs and a few anchovies balances out the heavy dish and brings old-school beef Wellington into the modern era.Ingredients4 - 6 ServingsWellington4slices bacon, finely chopped2large shallots, finely chopped3garlic cloves, finely chopped2tsp. thyme leaves12oz. crimini or shiitake mushrooms, trimmed, finely chopped or pulsed in a food processor4oz. maitake or crimini mushrooms, trimmed, finely chopped or pulsed in a food processor2tsp. soy sauceKosher saltFreshly ground black pepper12-lb. piece trimmed center-cut beef tenderloin1Tbsp. extra-virgin olive oil117.3- or 14-oz. package frozen puff pastry, thawedAll-purpose flour (for dusting)1Tbsp. Dijon mustard1large egg, beaten to blendSauce and assembly1small bunch cilantro, tough stems trimmed1small bunch parsley, tough stems \ttrimmed3oil-packed anchovy fillets1small garlic clove, crushed⅔cup extra-virgin olive oil5Tbsp. fresh lemon juice2tsp. Dijon mustardKosher saltFreshly ground black pepperPreparationwellingtonStep 1Cook bacon in a large skillet over medium, stirring occasionally, until browned and crisp, 6–8 minutes. Add shallots and cook, stirring often, until very soft, about 5 minutes. Add garlic and thyme and cook, stirring constantly, until fragrant, about 1 minute.Step 2Increase heat to medium-high. Add crimini and maitake mushrooms and cook, stirring often, until mushrooms release almost all of their liquid and look dry, 10–12 minutes. Stir in soy sauce, then season with salt and pepper. Transfer mushroom mixture to a medium bowl and chill until cold, about 30 minutes.Step 3Meanwhile, season tenderloin generously with salt and pepper. Heat oil in a large skillet over medium-high until very hot and you can see wisps of smoke. Cook tenderloin, turning every 30–60 seconds, until all sides and the ends are browned, about 4 minutes. Transfer meat to a plate and let cool 10 minutes.Step 4While the tenderloin is cooling, roll out puff pastry on a lightly floured surface with a long side closest to you to a 14x13\" rectangle. Spread mushroom mixture over center of pastry to create a rectangle that is about as wide as your piece of meat, leaving a border of approximately 1\" along top and bottom of pastry.Step 5Brush meat all over with mustard and place in center of pastry on top of mushroom mixture. Starting with the edge closest to you, roll up pastry, letting top and bottom edges overlap slightly (trim any excess); pinch edges together to seal. Turn beef Wellington seam side down, then twist ends to seal. Trim off any excess pastry on sides, but make sure meat is completely encased. Transfer to a rimmed baking sheet and chill until pastry is firm, about 1 hour.Step 6Place a rack in middle of oven; preheat to 425°. Lightly brush pastry all over with egg. Make several slits in pastry across the top of the beef Wellington (do not cut down into the meat below and keep the slits shorter than 1\"; longer ones can really open up when baked).Step 7Bake beef Wellington until pastry is golden brown all over and an instant-read thermometer inserted into the center registers 115° for medium-rare (the temperature will climb as beef Wellington rests), 40–45 minutes. Transfer to a wire rack set inside a rimmed baking sheet and let rest 15 minutes.Do ahead: Beef Wellington can be formed 1 day ahead. Cover and keep chilled.sauce and assemblyStep 8While the beef Wellington is cooling, purée cilantro, parsley, anchovies, garlic, oil, lemon juice, and mustard in a blender or food processor until nearly smooth; season sauce with salt and pepper.Step 9Transfer beef Wellington to a platter and serve with sauce alongside for spooning over slices.How would you rate Beef Wellington With Green Sauce?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleStellar! Follow exactly as presented and you will have phenomenal results…it’s a HOMERUNChef WillChicago9/26/2021Delicious!  Made exactly as the recipe was written, using shitake and cremini mushrooms.  I do NOT like mushrooms, but as prepared, this was wonderful.  The meat is a pricey cut, but well worth it for being perfectly tender, even when reheated for leftovers the next day.  We used a digital thermometer probe in the meat while cooking - it took 50 minutes for our 2.4lb cut to reach 115F.  Could have probably gone a few minutes less, as we like medium rare and the ends were more medium.  The sauce is fantastic and easy - I'll likely make that to use as salad dressing and to go with other rich meats.  The only word of caution I have is to watch closely in the first 10 minutes or so.  Luckily I was within \"smelling distance\" and checked it to see that the puff pastry was already well golden.  I popped a sheet of foil loosely over the top for the rest of the cook time to make sure it didn't totally burn!LBinTXFort Worth, TX5/25/2021This was my first time making Beef Wellington, so I followed the recipe as written and as shown in the video.  I used a mix of crimini and shitake (no maitake).  I'm glad I watched the video, as that was helpful in dealing with the dough.  The recipe calls for a box of 2 sheets of dough, but doesn't specify how to arrange the two sheets before rolling.  I stacked them, slightly offset, and then rolled out to the 14x13 rectangle.  Amazingly, the Beef Wellington turned out perfectly!  I used the convection setting on my oven, and it only took 25 minutes to get to 115 degrees, which, after resting, was a perfect medium rare.  The sauce is good, but better when used sparingly with the beef, otherwise it overwhelms the flavors.  Served with roasted green beans and mashed potatoes, and the sauce was great with the green beans.  I would definitely make this again.AnonymousSan Antonio, TX4/19/2021I wish that Bon Appetit would go back to photographing their food to look more normal instead of intensifying/cartooning the colors.   None of it looks appetizing!AnonymousKentucky3/28/2021It is always best to put the mustard on the meat as soon as you take it out of the frying pan. That way the flavor has a chance to infuse itself into the meat.Big JoeMontreal, Canada3/27/2021Explore Bon AppétitBeef TenderloinBeefMeatPuff PastryOther IngredientsMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Chris Morocco"]}