{"id": "5cb4e6b0c947055fe2c83599c5843e12", "url": "https://www.bonappetit.com/recipe/buss-up-shut-paratha-roti", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Buss Up Shut Paratha Roti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueBuss Up Shut Paratha RotiBy Peter and Jeanine PrimeSeptember 22, 20204.3(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Rey LopezEmailPinterestPrintEmailPinterestPrintSilky shreds of this flaky Trinidadian flatbread are the centerpiece of Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast. Prime uses virgin coconut oil in place of ghee in his take on the flatbread, which imparts nutty flavor while keeping it vegan. Just after cooking, he beats the bread with a wooden dowel (you can use a wooden spoon, offset spatula, or other sturdy kitchen tool) so it breaks along the layers into tender shreds resembling a “busted-up shirt,” hence the name, buss up shut. If you have time, let the dough rest in the fridge for a full 12 hours after forming it into cones; this will help preserve all those flaky layers you worked so hard to create. Complete the menu by serving the buss up shut alongside Fruit Chow, Aloo and Chana, Tomato Choka, and Curry Goat.IngredientsMakes 62Tbsp. baking powder1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1tsp. sugar3cups (375 g) all-purpose flour, plus more for surface113.5-oz. can unsweetened coconut milk (do not stir)½cup virgin coconut oil, dividedPreparationStep 1Whisk baking powder, salt, sugar, and 3 cups (375 g) flour in a medium bowl to combine. Open can of unstirred coconut milk and scoop coconut cream layer off the top into a small bowl. Mix 1 cup remaining coconut milk and 1 Tbsp. coconut cream into dry ingredients by raking with your fingers, then knead, adding more coconut milk by the teaspoonful as needed, until a soft and smooth dough forms. Cover and let sit 30 minutes.Step 2Divide dough into 6 balls (about 4 oz. each) and place on a clean surface. Cover with a damp kitchen towel. Working with 1 ball at a time, flatten into a disk on a lightly floured surface. Roll out to a 6\"–8\"-diameter round, dusting with more flour as needed. Using your fingers or an offset spatula, evenly spread ½ tsp. oil over surface.Step 3Using a paring knife, cut a slit from the center of the round out to the edges.PHOTO BY REY LOPEZStep 4Lift a cut edge and roll dough inward and onto itself to create a tightly coiled cone (the skinny end formed from the center of round and the wider part from the edges).ChevronChevronStep 5Pinch together outer edges at the wide end and tuck into cone, using your thumb to push them into the center so the coil is no longer visible.ChevronChevronStep 6Gently coat cone evenly with oil and place on a large plate. Cover plate with an upside-down bowl or plastic wrap. Chill cones at least 2 hours and up to 12 hours.Step 7Working one at a time, set 1 cone, wide side down, on a lightly floured surface. Gently press down on cone to make a disk.Step 8Roll out, rotating dough often and dusting with more flour as needed, until ⅛\" thick (7\"–8\" wide).PHOTO BY REY LOPEZStep 9Heat remaining oil in a small saucepan over medium until melted; remove from heat. Heat a medium crepe pan, tawa, cast-iron griddle, or medium skillet over medium-low. Brush pan with oil and place a roti in pan. Immediately brush surface of roti with more oil.Step 10Cook, turning every minute and brushing with more oil as it starts to look dry, until golden, puffed, and layers look like they are pulling apart, 10–12 minutes.PHOTO BY REY LOPEZStep 11Immediately place a roti on one side of a clean kitchen towel and fold the other side over.Step 12Holding the two ends of the towel closed with one hand, angle on a slant, allowing bottom edge to touch the counter.PHOTO BY REY LOPEZStep 13Tap wrapped roti with a metal baking spatula or a wooden spoon to break the layers apart.PHOTO BY REY LOPEZStep 14Place in an airtight container lined with a kitchen towel, cover, and let steam at least 15 minutes to soften. Repeat with remaining roti, stacking to let steam as you go.How it all comes togetherStep 15Use the silky shreds of roti to scoop up all the various curries, chows and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Buss Up Shut Paratha Roti?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleInstead of pictures, there should be a video.AnonymousLewes, DE3/3/2021Is it possible there is a mistake in the recipe? Is there really supposed to be 2 tablespoons of baking powder? I made these and the chemical taste made them inedible. I thought maybe I got myself mixed up and used baking soda instead of baking powder... My mom thought that 2 Tbsp. of either one would be a lot and might cause a chemical taste...CarlyNew York12/28/2020Very good! It was delicious along the Tomato Choka & Aloo and Chana. There's a nice light coconut flavor to this.\nMy coconut milk was already mixed together, but it still turned out well.\nI could see making these and putting some honey on top for a nice sweet snack.Phoenix, Arizona, USA10/2/2020Explore Bon AppétitFlatbreadBreadTrinidadianCaribbeanSideVegetarianDairy-FreeVeganBakingKwanzaaJuneteenthLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Peter", "Jeanine Prime"]}