{"id": "5cbde5c588e4644de2d770afb93b2197", "url": "https://www.bonappetit.com/story/lana-condor-dream-dinner-party", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Lana Condor’s Dream Dinner Party Involves Pizza and a Giant Cauldron | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLana Condor’s Dream Dinner Party Involves Pizza and a Giant CauldronThe breakout star of the Netflix trilogy To All the Boys I’ve Loved Before would put wizards on the guest list and berry pie on the menu.By Dawn DavisMarch 19, 2021FacebookTwitterEmailIllustration by Joana AvillezFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Though we’ve only just met for this interview, I’m convinced Lana Condor would be just as happy working professionally with food as she is working in Hollywood. The acclaimed lead of the Netflix films based on Jenny Han’s novel To All The Boys I’ve Loved Before, Condor has a passion that’s infectious, whether it’s for developing her own recipes or sleuthing the best poke in Seattle. Now starring in To All the Boys: Always and Forever, Condor talks about the magical powers of soup— and more.Do you have a color scheme that you like to follow in your table settings?I really just love matte, muted blues. I love that for my dishes. And then I like to have one statement serving dish in a different color. I recently got this Dutch oven that’s so great. It’s a beautiful pot that was gifted to me by Jenny Han, who wrote To All the Boys. It’s from Great Jones and it’s just a delicious evergreen color. It’s not so heavy that you can’t just pop it on the table. I like to put it in the center. That’s where I’ll have my soup so everyone can just ladle it out of there.Great Jones's 'The Dutchess' Dutch Oven$155 at Great JonesYou can invite anyone dead or alive, fictional or real, to this Dream Dinner Party. Who do you pick?Professor Snape of Harry Potter because I wonder how he has spent a good portion of his life keeping such an intense secret? As someone who has a hard time keeping secrets myself, it’s mind-boggling to me that he could live with two faces so convincingly. Meals open people up in ways that they might not be expecting. Through my cooking, he would let his guard down and we could see a little of his heart.What would you cook him?I’ve never met a bowl of soup that doesn’t feel like a hug. So I would make him this awesome soup that I love to make whenever I’m feeling down. The soup would say: “Listen, not all kids are bad. I got you.” For him, I'd serve it in a cauldron.What’s in this soup you’ve developed?It’s a coconut-cream-based soup that also has a little chicken broth, mirepoix, and a sweet Italian sausage that I crumble up and get nice and toasty, plus some fingerling potatoes and a huge handful of kale. I crisp up bacon for garnish. It’s very easy.Just you and Snape?I’d invite my brother. Like me, he was adopted. I have always wanted to have a deeper discussion about his feelings on adoption. Maybe he’d think that if this badass Snape is opening up, then he can do it too.So it’s you, Snape, and your brother around a cauldron of soup? What else do you serve?My brother isn’t an adventurous eater. I don’t think he’s ever had coconut cream in his life. So I would make pizza. We all got into baking new things during quarantine and for me it was pizza dough. (I’m still working on sourdough—I’m a little freaked out about it.) I would love to make him a delicious thin-crust pizza with mozzarella from King’s Mozzarella at Ballard Farmers Market in Seattle. I’d also serve homemade dumplings filled with a meat and herb medley. Dessert wine and a marionberry pie from Whidbey Pies to finish. I grew up with this pie and eat it during every special occasion.Let’s say the dinner party is a hit: Snape reveals his inner heart and your brother opens up. Where do you go the next day to take a day off from cooking?There is a tiny little run-of-the-mill-looking convenience store called 45th Stop N Shop & Poke Bar. You wouldn’t even give it a second glance. They have Japanese snacks, seaweed, gyoza, sake, and the best poke I’ve ever had in my life. They don’t give you options other than: Do you want rice or salad? and Which freshly caught fish do you want? You don’t get to pick and choose the toppings. I have a lot of respect for people who know their dish is that good.Explore Bon AppétitDream Dinner PartyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-19", "author": ["Condé Nast", "Dawn Davis"]}