{"id": "5cbdc55af04edf3d0a71794c3101af9b", "url": "https://www.bonappetit.com/story/upside-down-chicken-feud", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Tomato Paste Will Get You Far in This World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTomato Paste Will Get You Far in This WorldAt least as far as the next bowl of vodka sauce is concerned.By Alex BeggsApril 18, 2020FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Signs and symbolsThis week my partner shook a cocktail so vigorously the lid of the shaker froze onto the base and we couldn’t get it off. It felt like a metaphor for the week. Nothing will be easy for you! The stuck-on shaker cackled. We smacked it against the sink ‘til it opened. The next day, our car was packed and we drove 14 hours to Michigan to self-quarantine for two weeks before we stay with family enduring an entirely different health catastrophe: relentless cancer. (The oncologist approved this plan.) It’s snowy here, and the only vegetable in the fridge is a head of cabbage. I brought pasta, tomato paste, shallots, and heavy cream so we can make our favorite comfort food, Jon & Vinny’s vodka sauce, on repeat.Get the recipe: Fusilli alla Vodka with Basil and ParmesanWant this letter before it hits the website? Sign up for our newsletter!Photo and food styling by Emma FishmanWide eyesWhat kept me awake that entire drive? Two rounds of dalgona coffee, pre-frothed. Weeeeeee!!!Read more: I Gave In And Tried the Frothy Coffee ThingThe closest we’ll get to going back to the officeThanks to the redditor who made this Test Kitchen virtual background for Zoom! Complete with Sohla El-Waylly at Station 2 in case you need culinary support.6 thingsI observed in the Test Kitchen’s pantry pasta video.Andy: casually has a Meyer lemonBrad: has a Le Creuset in petit fruits, my favorite pattern tooClaire: what are those rustic red pepper flakes? (They’re Tutto, of course.)Sohla: has the best induction burner out there, the Breville Control Freak, because her electric stove doesn’t get hot enough to sear.Chris: ’s kids have enough combined teeth to be extras on Tiger KingAmiel: has a Dutch oven salvaged from the trenches of World War INot all substitutionsGoogle doesn’t have all the answers. When it comes to food substitutions, I go to The Food Substitutions Bible, an encyclopedia of exactly what it sounds like. But in the way the dictionary leads you from one word to four, a recent journey led me to substituting mayo in place of buttermilk in banana bread. It was only ⅓ of a cup, no big deal, right? And Chris Morocco’s beloved mayo chocolate cake uses it! Well, my banana bread came out bouncy and sticky, like those rubber hands you fling against the wall until they get so covered with carpet fuzz you lose interest. Better luck next time.So much for the pouchesEarlier this year I wrote about the rise in snack foods that seemed marketed at survivalists, who turn out to be desk-glued, overworked office mice. Pouches of energy-boosting chia, dehydrated cheese cubes for grounded astronauts, and an ever-loosening definition of jerky. Looking back at the story now, my timing was...prescient. But now that we’re living it, this plotline torn from a sci-fi novel I’d pass up on the library shelf, no one is thrilled to share their meal of room temp oatmeal in a pouch. People seem to be cooking real food (frozen pizza counts). So that’s a relief.Easter happened“Happy Easter,” I said, sliding three cups of Royal instant pistachio pudding—nuclear mint green, specked with almonds doing their best impersonation of pricey pistachios—to my family. It tasted like melted spumoni ice cream and by that I mean: it was delicious. This is pudding propaganda and nothing more.For some sad reason we only have 11 pudding recipes???Unnecessary TikTok of the weekOther than this masterpiece that features Hooters hoverboard curbside pickup, I came across MANY Bon Appétit TikToks this week and it’s hard to pick my favorite. It’s a tossup between this one and this one.Unnecessary food meme of the weekUnnecessary food feud of the week“I have a question,” Emily Schultz posed to our staff Slack room. “I’ve been seeing so many people roast a chicken upside down…but like who said the breast up way is right?! What’s the difference?” It seemed like a fitting method for upside-down times. “Guys, I have done it upside down many times,” replied Julia Kramer. “And a turkey, too.” “On purpose??” asked Molly Baz. “It really depends on how the heat in your oven circulates,” said Julia, who likes this method because she doesn’t care about the breast. “Really you’re prioritizing the thighs,” she said. Molly was convinced: “The legs are the best part so why not optimize their Crispiness?” “Exactly,” said Julia. “And then the breast is maybe more steamed,” Molly continued, “which isn’t the worst, and perfect for chix salad. Wow I am shook to my core.” “I just worry about flabby skin once you turn it back over,” said Carla Lalli Music, who only roasts in one direction (so far), “but maybe we have to invent a new way to carve a chicken ‘from behind’ and really next-level this whole thing.” “It doesn’t seem like a bad idea,” was Schultz’s conclusion, “and people should stop being so RIGID about how things are done in the kitch. I wish I had a spare chicken to roast.” Same, same, same.Explore Bon AppétitBeggs NewsletterRead MorecookingHow to Make Do With Some Smart SwapsBy Carla Lalli MusicLifestyleThree Things That Are HelpingBy Amanda ShapirocookingBean Broth Is My Bone BrothBy Adam RapoportcookingDon’t Cry Because Basically Baking Is OverBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-18", "author": ["Condé Nast", "Alex Beggs"]}