{"id": "5cc3e1d48eb2878fec5da24575181cef", "url": "https://www.bonappetit.com/recipe/big-green-lentil-salad", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Green Lentil Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueBig Green Lentil SaladBy Heidi SwansonAugust 13, 20194.4(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintCool yogurt, crunchy seeds, and avocado turn lentils into a lunch salad you’ll actually be excited to eat. Serve it with warm pita for swiping up the garlicky yogurt. We have Heidi Swanson, the vegetarian cookbook author and blogger behind 101 Cookbooks, to thank for this lightning-fast weeknight dinner recipe.Ingredients4 servings1½cups green lentils, rinsed¾tsp. kosher salt, divided, plus more1⅓cups plain Greek yogurt2garlic cloves, finely chopped½tsp. ground turmericFreshly ground black pepper1cup unsalted, roasted sunflower seeds1Tbsp. plus 1½ tsp. fresh lemon juice3Tbsp. extra-virgin olive oil, plus more for drizzling1ripe avocado, cut into cubes1cup baby arugula1cup basil leaves, torn if largePreparationStep 1Cook lentils in a large saucepan of simmering salted water until they are tender but still retain their shape, 20–30 minutes. Drain, rinse under cold running water, and drain well again.Step 2Mix yogurt, garlic, turmeric, ¼ tsp. salt, and a generous grind of pepper in a small bowl to combine; set aside.Step 3Toss lentils, sunflower seeds, lemon juice, 3 Tbsp. oil, and remaining ½ tsp. salt in a large bowl. Gently fold in avocado, arugula, and basil.Step 4Spread reserved yogurt sauce across a platter and spoon lentil mixture on top; drizzle with oil.How would you rate Big Green Lentil Salad?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleMy family loved it and the bright yellow sauce edging the lentils looked so cheerful that I thought I'd like to take this to a potluck :)\nI made a couple of substations based on what I have on hand (spinach>arugula, pumpkin seeds & almonds>sunflowers seeds). It all worked out great.TerriVictoria, BC7/19/2021Excellent and healthy.  Love it as written. Vicki BennettPortland Oregon 12/23/2020This is great! I've made this salad a number of times now and its almost always for a group of people. It always wins the people over who have never had much to do with lentils before. I do have to note that i add the lemon rind  finely grated as well as the juice and a tiny amount of cumin to the yoghurt mixture, this just changes the flavour in a way i way i like. Pepitas instead of sunflower seeds are also a great substitution or a mixture of both. Perfect for a family BBQ on a hot day. JackWestern Australia11/11/2020I wasn’t blown away by the original recipe on its own but it’s easy to modify, so use whatever you’ve got on hand!\n\nI omitted the avocado, subbed pepitas for sunflower seeds, and included sliced scallion in the salad mix. Also topped it with some ground pork for heft. It needs acid, so don’t omit the lemon (could also maybe sub vinegar here). I used nondairy Greek-style yogurt (Kite Hill) it worked like a charm. Looking forward to trying it with other folks’ recommended add-ins!AnonymousTennessee6/15/2020Lazy girl adjustment: Swap the sauce the pre-bought hummus and only season with; salt, pepper, lemon juice. Still deliciousKAIPIRINHASweden4/18/2020Loved it. Perfect for a hot summer day or nightSoleCArgentina1/21/2020love a riffable recipe. I did one clove of garlic and a heap of chopped scallions for the yogurt. I just sprinkled some arugula on top of a swirl of yogurt, tossed some of the lentils on top of that, and instead of basil I topped with cilantro and more scallions. And then a fried egg on top! and a squeeze of lemon. I'm sure it would've been bomb with a bit of pita. seymourkittyPortland12/27/2019It PAINS ME to leave a negative review but alas, this was so disappointing I must. The texture of this was about the only thing I enjoyed about this salad. The flavors just weren't jiving. I made this for lunch and ended up having to doctor it significantly in order to enjoy it. Someone else recommended roasted squash which helped jazz it up, along with Brianna's French Vinaigrette & some chicken breast. Another day I threw in leftover peppers & onions and Beyond sausage. I tossed the yogurt altogether. Overall, not my favorite even though this sounds like a total winner. It needs some love to get it to a great place! Sorry BA!!Amber AndersonBoston10/30/2019I thought this was pretty good. It's not the typical fall-out-of-my-chair amazingness that I find in most other Bon Appetit recipes. I liked the crunch of the sunflower seeds and the turmeric in the yogurt. I didn't dare use raw garlic (you're welcome, co-workers). Instead I sauteed it in olive oil to  soften the bite then used the oil in the lentil dressing. If I make it again, I might alter it to dial it up the flavor a bit.AnonymousLos Angeles10/7/2019This was pretty good, not great enough to want to make it again though. I don’t know if my garlic cloves were particularly large or potent, but my garlic breath was REAL after eating the yogurt. Definitely recommend eating it all with some toasted pita or the texture might get too soft after a while.soapnanaChicago10/5/2019Pretty good, though I didn’t salt the water when I made the lentils 😑. Will be trying a little sesame oil and red chili flakes on top of the leftovers—it needs something.AnonymousLansing, Michigan10/1/2019This recipe was an almost-miss. The avocado didn't work at all, but some roasted squash might have gone well with it. I gave the thinly sliced garlic a quick browning in a pan with some olive oil and that saved it for me. AnonymousNYC 9/22/2019This was a big miss for me and I was pretty surprised because I love pretty much all of the ingredients. It just needed something more, but I couldn't figure out what. Anonymouschicago, il9/18/2019Excellent!  Liked that I could get it already in advance and then put it together later. Served it with whole grain seeded toast points. Be sure not to overlook lentils. Best when they have a little body to them. lorilHouston9/18/2019My daughter chose this for her birthday meal and we all loved it. Was it  1 1/2 cooked or dry lentils?  I used 1 1/2 cups dry lentils and it seemed in the end that it was probably 1 1/2 cooked. \nwigmoredonnaCharlottetown, PEI8/31/2019Explore Bon AppétitSaladArugulaLeafy GreensVegetableBasilHerbs & SpicesAvocadoGreen LentilLentilQuickEasyWeeknight MealsMainGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Heidi Swanson"]}