{"id": "5cc494e86602c71cd8c988cf9e2376c1", "url": "https://www.bonappetit.com/story/vegetarian-enchiladas", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Vegetarian Enchiladas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIf You Come Over for Dinner, We’re Having EnchiladasCover me in salsa verde and bury me in Monterey JackBy Sarah JampelMay 17, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailIf I invite you over for dinner and the total group is larger than four, you can safely bet that I’ll serve you enchiladas. Because whenever I’m brainstorming a vegetarian dinner party dish that won’t require a hundred sides, enchiladas is the answer. Stuffed with beans, greens, and cheese, they’re the all-in-one large format main that has it all. (Don’t worry, I will also make you guacamole.)But not all enchiladas are good enchiladas. What makes the difference? First and foremost, the sauce. All of the extremely opinionated BA food editors agree that the key to successful enchiladas is homemade sauce—and enough of it. In this recipe, the salsa verde is made in the oven: You’ll broil the vegetables (poblanos for smokiness, tomatillos for tang, jalapeños for heat) until they’re blackened, then blend them up (no chopping!) until you have a spicy, vibrant sauce. Taste it for salt! The sauce is the backbone of the whole dish—it coats every tortilla, it seasons the filling, it gets poured on top—so you’ll want to make sure it’s seasoned to your liking.Second, the filling. If vegetarian enchiladas are going to be a meal, there’s gotta be more than cheese and sauce in there. Even though this filling is super simple—sautéed onions and kale mixed with canned pinto beans (they get so creamy!) and a couple of charred poblanos that have been spared from the blender—it’s still green enough to pass for a real serving of vegetables. And because you don’t need to roast a chicken or braise short ribs, the filling comes together in fifteen minutes rather than three hours.Once you’ve got the sauce and the filling, all that’s left is the assembly. Enchiladas are an easy three-step process—dip tortilla in sauce, fill, and roll up and put in a baking dish (see this reference image for help)—unless the tortillas rip during the process, in which case it’s terribly frustrating and will feel like the end of the world*. If you’re using fresh, high-quality tortillas, warming them in a foil pouch in the oven (or individually on the stove) will reduce rippage. But if you’re working with the kinda hard, kinda dry, kinda stale tortillas that are common at grocery stores, I highly recommend a quick dip in a pan of hot olive oil (just 10 seconds per side) to make the tortillas pliable (you know, like they’ve just gone to hot yoga). They’ll also be richer, more flavorful, and more stable  when you cover them with sauce and cheese.If this feels like a lot for one day, split it up: Make the sauce and the filling two or three days in advance, then keep them in the fridge until it’s enchilada night. When your friends ask what they can bring for dinner, you can honestly tell them nothing. Enchiladas have it covered. (Though a bottle of wine would be nice.)*It is not the end of the world. You can either a) go take a walk and make your sous chef struggle through it, or b) just make a layered enchilada “casserole” situation: alternate layers of sauced-but-flat tortillas with layers of filling, then cover with sauce and bake. Not as elegant, but just as tasty!Get the recipe:Vegetarian EnchiladasThese veggie enchiladas feature a charred tomatillo salsa verde, creamy pinto beans, and plenty of cheese.View RecipeExplore Bon AppétitHealthyishMexicanEnchiladasVegetarianRead MoreLifestyleMarinated Lentils Are Saving My Vegetarian, Protein-Craving SoulBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Sarah Jampel"]}