{"id": "5cc7af40a44f455fc6fe2ba8b88223fd", "url": "https://www.bonappetit.com/recipe/seared-squash-and-halloumi-burgers", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Seared Squash and Halloumi Burgers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueSeared Squash and Halloumi BurgersBy Sarah JampelJuly 6, 20214.8(46)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis vegetarian recipe makes a strong case for replacing a veggie burger with a slab of melty, salty cheese. It’s also a great way to use up all that summer squash, making it a win for any summer weeknight.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonKitchen Towels$22 At AmazonShallow Serving Bowl$26.99 At AmazonCutting Board$10 At IKEAIngredientsMakes 42medium summer squashKosher salt16–8-oz. package Halloumi cheese2–3Tbsp. extra-virgin olive oil1garlic clove, finely grated¼cup sliced pickled jalapeños, plus 1 Tbsp. pickle juice1tsp. honeyFreshly ground black pepper4hamburger buns⅓cup basil leavesPreparationStep 1Trim ends from squash. Cut crosswise into 3”-long cylinders; cut cylinders lengthwise into ¼”-thick planks. Spread out on a kitchen towel and sprinkle lightly with salt. Let sit 10 minutes.Step 2Meanwhile, slice Halloumi into ½”-thick slabs roughly the width of the buns (about 3” squares).Step 3Whisk garlic, pickle juice, honey, and a small pinch of salt in a small bowl; season generously with pepper. Set dressing aside.Step 4Heat 2 Tbsp. oil in a large nonstick skillet over medium-high. Pat squash dry. Working in 2 batches, cook squash in a single layer, turning once or twice and adding another 1 Tbsp. oil between batches if needed, until deeply browned and charred on both sides, about 5 minutes. Transfer squash to a shallow bowl. Pour reserved dressing over and gently turn squash to coat.Step 5Wipe out pan and return to medium heat. Toast buns, cut side down, in pan until golden, about 3 minutes. Transfer to plates.Step 6Increase heat to medium-high. Pat Halloumi dry; cook, turning once and pressing down lightly, until browned and starting to soften and melt, about 2 minutes.Step 7Distribute Halloumi among bottom buns. Top with pickled jalapeños and basil, then with squash. Close with bun tops.How would you rate Seared Squash and Halloumi Burgers?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleDelicious and easy to make. Next time I will use hot pickled jalapeños. The dressing for the squash was so good I’ll use it this summer on grilled zucchini. Sharon BBakersfield, CA2/20/2022Our cooking club tried this recepi and had this to say, a little spicy would not do the jalapenos, cut down on the size of cheese; too spicy for some of our members, \"cheese on the jalapeno was perfect\", did not like the texture of the cheese, maybe a thinner cut, very good-a bit spicky, would skip the jalapeno juice.  Liz Peterson3354910/31/2021Update to my last review: Made this a second time, cooking squash, zucchini and buns on the grill. This time added mayo mixed with chopped chipotle chilies — new favorite dish!PEGGYBTustin, Ca 9/20/2021perfect week night meal! I personally wasn't a fan of the summer squah, but the halmoumi with the basil and jalapenos were divine. Will definitely make again :) Veronica Montreal9/3/2021Amazing recipe!! Loved the way it uses summer produce. Made a homemade aioli and added Jalepenos in the silos instead of pickling them and was so delicious. Highly recommend!AnonymousMontreal8/28/2021Delicious and easy! We also added a bit of mayo but otherwise made exactly as is and loved every bite!PeggyBTustin8/10/2021Great recipe! The dressing was great on the zucchini and the halloumi was a delicious choice of cheese.  Served with pickled jalapeños and a sriracha mayonnaise I made. Served with corn on the cob and a fresh from the garden tomato salad.GoldenmomAttleboro, MA8/10/2021This recipe is delicious! I followed the recipe exactly and made a spicy mayo/greek yogurt to serve on the side - also made my own pickled jalapenos, which were so good and easy. My dinner guests raved about the sandwiches, which are hearty and satisfying but not too filling. Sprout22Somerville, MA8/2/2021This burger is amazing, I was skeptical about the dressing and mix of flavors but it was perfect and, in my opinion, added that zing. We used mayo and because we ran out of plain mayo, I had mine with mayo/ketchup burger sauce. I may try with a bit more heat next time, perhaps fresh grilled jalapenos alongside the squash. Huge hit with the family. AnonymousWashington, DC7/29/2021this recipe is delicious and best of all, fast. i made a spicy mayo to go on them and honestly didn't feel like it was that necessary (i used trader joe's brioche buns that weren't dry at all). highly recommend this one for a wholesome weeknight dinner or bbq with friends.annaliseLos Angeles, CA7/23/2021This burger is a lovely way to add more vegetarian meals to your rotation.  The recipe only needed one pan and was super easy.  The burgers tasted good with the combination of flavors.  I think the taste of basil really added to the cheese and bread.  I will definitely make this often.JeanboiseBoise, Idaho7/22/2021This is the perfect easy summer weeknight meal. I was skeptical of the marinade but oh my is it tasty. I can’t eat jalapeños so I used some dill pickle juice instead and it was excellent. Add some tomato and Mayo on the buns for some extra flavor to really round it out. LaurenPortland, OR7/19/2021This was amazing! We are making it again later this week — that’s how good it was! The perfect balance of flavors.  We used brioche buns and I cannot imagine it any other way! Just a perfect supper sandwich: salt, fat, acid, (slight) heat.  The pickled jalapeños made it so don’t skip those. CCBaltimore Md 7/19/2021Absolutely delicious! I was a bit skeptical if this would all come together, but this was very very tasty. Perfect for summer when you want something fresh and easy. The only thing is that it was a tad bit dry, so I would recommend adding a little bit of mayo on one of the buns. This will definitely stay in my rotation for vegetarian recipes!KatieVancouver, Canada7/14/2021These Were Delicious!\n\nDid you renew your subscription?AnonymousToronto7/12/2021Explore Bon AppétitBurgerVeggie BurgerSummer SquashSquashVegetableHalloumiCheeseSummerQuickEasyWeeknight MealsOne-Pot MealsMainNut-FreeVegetarianSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Sarah Jampel"]}