{"id": "5ccd708ad35112b9381c634103aeb138", "url": "https://www.bonappetit.com/recipe/kolar-pitha", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Kolar Pitha Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueKolar PithaBy Sohla El-WayllyAugust 18, 20204.4(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“In isolation I’ve leaned hard on the everyday Bangladeshi food my mother cooked when I was growing up,” says Sohla El-Waylly. “It makes me feel safe in a way grilled cheese or fried chicken just can’t. She’d fry up these crispy, sweet fritters anytime there was a ripe banana around, so during quarantine I called her for the recipe. When I make kolar pitha now, it transports me back to her kitchen, which is exactly where I need to be.” Traditionally these banana fritters are sweetened with a syrup made from gur or jaggery, which gives them a musky aroma and a dark brown color. This version uses maple syrup, which hits many of the same notes as those sweeteners.IngredientsMakes 201very ripe medium banana1large egg½cup (150 g) pure maple syrup¾cup (120 g) stone-ground rice flour (preferably Bob’s Red Mill)½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt¼tsp. baking powder1–2cups ghee or vegetable oilPreparationStep 1Blend banana, egg, and maple syrup in a blender until smooth, about 15 seconds. Add rice flour, salt, and baking powder and blend again until fully incorporated, about 10 seconds. (Or mash banana with a fork and whisk with the other ingredients in a medium bowl.) Cover batter and let sit at least 20 minutes and up to 2 hours to allow rice flour to hydrate.Step 2Set a wire rack inside a rimmed baking sheet and line rack with paper towels. Pour ghee into a small high-sided skillet, preferably cast-iron, to come at least ⅓\" up the sides (more fat will result in rounder fritters). Heat over medium-high until an instant-read thermometer registers 350° or fat rapidly sizzles when a dollop of batter is added to the pan, about 5 minutes.Step 3Using a 1 Tbsp. measuring spoon, drop batter straight down into skillet in a compact circle. Fry 4–6 fritters at a time, depending on the size of your skillet, until edges are dark brown, centers puff up, and fritters are mostly cooked through, about 2 minutes. (Initially edges will curl up and centers will look sunken and wet, but don’t worry.) Using 2 spoons or chopsticks, turn fritters and fry until other sides are dark brown, about 1 minute. Using a slotted spoon, transfer to prepared rack and let drain. The fritters will feel soft right out of the oil, but they will grow crisp as they sit. Remove any loose bits of batter from the oil and check the temperature before frying the next batch. Serve hot.How would you rate Kolar Pitha?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI just made these today, followed the recipe exactly, but changed up the technique a bit, as I didn’t want to deep fry.  I used an aebelskiver pan with 1/4 teaspoon of ghee in each divot.  Poured in the tablespoon of batter into each divot and used a wooden skewer to turn each as they cooked on the bottom.  The result was a crispy exterior with a pancake-like interior.  Delicious.  Next time, however, I will reduce the amount of maple syrup - these were on the cusp of being too sweet with 1/2 cup of maple syrup in them.Lisa SPortland, OR4/28/2021I’ve made these twice now - SO GOOD!!! Molly MPortland, Maine2/16/2021Any idea if these could be cooked in an air fryer?? AnonymousOH8/28/2020Looks amazing!  Will have to give it a try!AnonymousNew York, NY8/19/2020If I have gur at home, can I use it in place of the maple syrup in this recipe?AnonymousIndia8/19/2020Looks like a better muffin top if such a thing exists?!? V into it and gonna try soon!AnonymousNew york8/19/2020Definitely gonna try this soon! They look amazing!AnonymousQatar8/18/2020Explore Bon AppétitFritterDessertSouth AsianAsianBangladeshiBananaFruitRice FlourFlourSnackGluten-FreeNut-FreeVegetarianVeganDairy-FreeFryRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Sohla El-Waylly"]}