{"id": "5cdecf8457ebe58fd36e0ead5c8e6541", "url": "https://www.bonappetit.com/story/siete-vegan-queso", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "This Vegan Queso Is Great Even for Cheese Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Love Cheese but I REALLY Love This Vegan QuesoSiete Food's vegan queso is the non-cheese cheese sauce I’m putting on everything.By Lia PicardOctober 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIn these trying times, not many things give me more comfort than dunking one tortilla chip after another into a bowl of molten queso dip. I love partaking in this gooey pastime at restaurants, but at home it’s a different story. A quick glance at the ingredient list on a jar of grocery-store queso is enough to make me jump back in terror. Just what exactly is “sodium hexametaphosphate?” Recently I found a queso brand with ingredients I can get behind that also tastes amazing, but there’s one catch: It has zero cheese. I’m talking about vegan queso, specifically Siete’s Spicy Blanco cashew queso, and I’m obsessed.Austin-based brand Siete was launched in 2014 after Veronica Garza could no longer indulge in the foods of her Mexican-American heritage due to an autoimmune condition. After going grain-free to alleviate her symptoms, her six family members (mom and dad included) joined her in forgoing grains. Eventually, Garza got tired of lettuce wraps in lieu of tortillas and delved into the world of grain-free tortillas. “She got in the kitchen and solved her own problem by making a tortilla out of almond flour,” says Miguel Garza, CEO and co-founder of Siete. “We all thought, ‘Wow. This is actually really good.’”Siete’s lineup began with grain-free tortillas and tortilla chips, but Veronica had been fiddling with a vegan queso recipe for years. “We grew up eating queso in our house. We ate it with tacos at breakfast and we would eat it with fajitas for dinner,” says Miguel. While Veronica isn’t vegan, she gave up dairy when she discovered that it’s another inflammatory culprit. Miguel says, “She created this product to solve this problem of [wanting] the nostalgia of our heritage but in a way that conformed to our current dietary restrictions.”There are two varieties of queso, mild nacho and spicy blanco. Of the two, I prefer the blanco with its zesty flavor and rich, creamy texture. What’s most impressive is how the ingredients are all whole, plant-based foods like cashews, tomatoes, bell pepper, onion, jalapeños, and coconut milk—and yet somehow it all works together to create a “cheesy” dip.Pure bliss comes when you pop the queso in the microwave for a few seconds to warm it through, then get to dunking. Miguel likes to spread the queso over a tortilla and drizzle it with hot sauce. “It’s almost like a quesadilla.” He’s also heard of customers drizzling it over mashed or roasted potatoes. And the milder nacho queso works well as a base for macaroni and cheese.So I say to vegans and non-vegans alike, embrace this spicy blanco queso. Not because it’s dairy-free but because it’s delicious and full of ingredients you actually want to eat.Buy it: Siete Foods Spicy Blanco Cashew Queso, $7.99All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCheeseShoppingTrendsVeganHealthyishSnackRead MoreLifestyleWhat IS Nut Cheese, Exactly, and Can't We Call It Something Else?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Lia Picard"]}