{"id": "5cf297fd41c2104c15129573b7ab884a", "url": "https://www.bonappetit.com/recipe/spicy-cranberry-sauce", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Spicy Cranberry Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueSpicy Cranberry SauceBy Claire SaffitzOctober 16, 20184.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintJalapeño and lime give this year's cranberry sauce the zesty-spicy kick it deserves. Removing the seeds from one of the chiles lessens the punch. If you like more heat, leave them in. If less, scrape out seeds from both chiles.IngredientsMakes about 2½ cups3Tbsp. unsalted butter1large shallot, finely chopped2jalapeños, seeds removed from 1 chile, both chiles very thinly sliced1lb. fresh (or frozen) cranberries⅔cup honey½tsp. kosher salt2tsp. finely grated lime zest2Tbsp. fresh lime juicePreparationStep 1Melt butter in a large saucepan over medium heat. Cook shallot and jalapeños, stirring often, until shallot is starting to turn golden, about 4 minutes. Add cranberries, honey, and salt and increase heat to medium-high.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Bring to a boil and cook, stirring often and reducing heat as needed to avoid scorching, until cranberries burst, juices are syrupy, and pan is visible when a wooden spoon is dragged across the bottom, 12–15 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Remove from heat and stir in lime zest and juice; let cool.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 4Do Ahead: Sauce can be made 1 week ahead. Cover and chill.How would you rate Spicy Cranberry Sauce?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis recipe is fantastic and I will definitely make it again.  I omitted the shallot, and added the full juice and zest of two limes, without measuring. Otherwise, I followed the directions entirely.   The sauce cooked up beautifully and after it had cooled a bit, I transferred it into a couple. of glass jars and placed them in the refrigerator to chill for a couple of days.  It really helped develop and intensify the lime flavor and the heat from the jalapeño, so I definitely recommend taking this step.      \n\nAs others have noted, this is not a sweet cranberry sauce -- it is tart and on the savory side.  I found this to be a good contrast with other sweet dishes.        KitchenHawkSacramento, CA11/27/2020I thought this was just the right level of sweetness, but the lime was a little overpowering. I’d start with adding half of the zest, and then adding the rest to tasteAnonymousorange, ca11/26/2020I'm not a fan of the traditional sweet cranberry sauce, so this lime-y spicy version was perfect for me! I seeded one jalapeno per the recipe but found the final sauce wasn't that spicy. Next time I'll keep the seeds in for both.AnonymousNew York 11/25/2019Wow!!! Doing a southwestern twist for Thanksgiving this year. This is fabulous! I think it would be great on pork. Of course will have traditional cranberry sauce also. magsfarm38242PHOENIX 11/22/2019This was really tasty! It took me a bit to get used to it since it tastes so different than regular cranberry sauce, the shallot really brought it together in a way I absolutely didn't expect! I don't think I prefer it to traditional sauce, but I'd make it again regardless!dsasalaBuffalo10/23/2019Explore Bon AppétitSauceAmericanCranberryBerryFruitJalapeñoChileVegetableLimeCitrusSideGluten-FreeNut-FreeVegetarianSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}