{"id": "5cf30d8a8811f6bfc58858a67244b16a", "url": "https://www.bonappetit.com/story/how-long-can-cheese-sit-out", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "How Long Can Cheese Sit Out Before You Die? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Long Can Cheese Sit Out Before You Die?A simple answer to a dramatic question.By Alyse WhitneyApril 27, 2018FacebookTwitterEmailIllustration by Elliot SnowmanFacebookTwitterEmailPutting cheese and crackers out at a party, whether sliced sharp cheddar and Triscuits or Humboldt Fog and crostini, is a simple way to welcome guests. Everyone loves cheese, and people will snack on it all night. But if hours go by and there’s still half a wedge of Brie on the cheese board, are you putting your friends in danger? In other words: How long can cheese sit out before you get sick...or die?Bringing cheese to room temperature is essential to help the fat loosen up, which gives the cheese a better texture and flavor. However, there is a ticking clock on how long it should stay out past that hour (or two) out of the fridge. To keep yourself safe from bacterial growth or spoilage, you should only keep cheese out for four hours, according to Adam Brock, director of food safety, quality, and regulatory compliance at Dairy Farmers of Wisconsin.With that said, some cheeses fare better than others with quality after those four hours elapse. Higher moisture cheeses like ricotta, queso blanco, and mascarpone will deteriorate in quality and spoil faster when left on the counter. Soft cheeses—including Brie, Camembert, or a bloomy-rind fancier cheese like Jasper Hill’s Harbison—will last a little longer, and harder cheeses from cheddar to Gouda to Parmesan will hold up the longest. “Parm, Romano, or harder cheeses will likely not have microbacterium growth, or very insignificant amounts throughout the duration of a party,” Brock adds. Those cheeses you’ll often see hanging in Italian markets or cut into pieces on display at the grocery store because they don’t require constant refrigeration.Long before you get an upset stomach from cheese (uh, unless you’re lactose intolerant), you’ll probably notice that it’s looking a little…sad. Cheese will dry out when left in open air, especially in a warmer room, and start to look crusty and crumbly. “After eight hours on a cheese board, cheddar will likely not have a lot of bacterial growth, but it won’t look appealing to eat,” Brock explains. However, there is no way to tell if there’s bacteria on a piece of cheese based on looking because it’s microscopic. One thing you can tell immediately about a cheese gone bad is if there’s mold growing on it in the fridge. If you see that,  cut off about 1–1½ inches around the mold and continue eating it. However, if a high-moisture cheese like ricotta or cream cheese has a spot of mold, throw it out—it will have contaminated the entire container.See this beautiful oozy wheel of Harbison? Don’t let it sit out for more than four hours!\nPhoto by Alex LauThere has been some extensive research done in Wisconsin that proves cheese can stay out for up to six hours at 70°F or colder. Some cheeses tested for low levels of listeria, salmonella, Escherichia, and staphylococcus but nothing life-threatening.* Marianne Smukowski—a safety and quality applications coordinator at the Wisconsin Center for Dairy Research who helped conduct this study—explains that the level of water activity in a cheese determines how long it can stay out. Hard cheeses like Parmesan could be out for 24 hours and be fine, but a young cheddar is more vulnerable. “You will see oiling off and drying out from it sitting out in open air,” Smukowski explains. If it starts to look like it’s glistening, that’s a sign to either put it back in the fridge or toss it.The TLDR version of this is: Trust yourself. If it looks unappealing, don’t eat it. You probably won’t get sick, and definitely won’t die, but the quality of cheese can plummet dramatically after more than four hours at your party. Eat something else, take out a new block of cheese from the fridge, or maybe just serve fondue at your next party. Cheese sweats are always better than sweaty cheese.*Pregnant women, the elderly, or people with weakened immune systems are at higher risk for food-borne illness and should take a higher level of caution.Want more cheese content? Yeah, you do.Explore Bon AppétitCheeseCheese WeekRead MorecultureWait, So What Cheese Can You Eat While Pregnant?By Liz ThorpecultureThe Wisconsin Cheese Curds That Heal My HomesicknessBy Erika OwencultureHow to Serve a Killer Cheese Plate with Only ONE CheeseBy Alyse WhitneycultureHow to Create a Cheese Plate for Every Possible OccasionBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Alyse Whitney"]}