{"id": "5cfe739d239250438679dac07af70318", "url": "https://www.bonappetit.com/recipe/sparkling-wine-cocktail", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Sparkling Wine Cocktails Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueSparkling Wine CocktailBy Chelsea GregoireDecember 1, 20205.0(9)Read ReviewsTriangleEmailPinterestPrintPhotographs by Yudi Ela, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Everyone loves something sparkly for the holidays,” says Chelsea Gregoire, owner and consultant at Drinkable Genius. “And by adding absinthe—which is higher proof and packed with warm flavors—even the least fancy glass of bubbly feels special. Whatever bubbly you have on hand works: Champagne, Prosecco, cava…any of these will bring the party and leave whoever you’re toasting feeling wonderful.” Pear juice, available at most grocery stores, adds a sweetness and subtle fruitiness that balances this drink nicely.IngredientsMakes 1Oleo-saccharum4lemons, scrubbed1cup sugarCocktail¼cup sugar¾tsp. ground cinnamon1lemon slice1¼oz. pear juice¾oz. absinthe4dashes orange bitters3oz. sparkling winePreparationOleo-saccharumStep 1Using a vegetable peeler, remove zest from lemons, avoiding white pith. (Any pith on the peel can be scraped off with the dull edge of a paring knife.) Place peels in an airtight container and pour sugar over; save fruit for another use. Cover and shake to coat peels. Let sit at room temperature in a dark place 24 hours. Add 1 cup room-temperature water and stir until sugar is dissolved; discard zest.CocktailStep 2Mix sugar and cinnamon in a small bowl and pour onto a small plate. Rub lemon slice over a small section along side of a 5–6 oz. Champagne flute, then dip section in cinnamon sugar.Step 3Combine pear juice, absinthe, bitters, and ¾ oz. oleo-saccharum in a cocktail shaker filled with ice and shake until outside of shaker is frosty, about 30 seconds. Double-strain into prepared glass. Top off with sparkling wine.How would you rate Sparkling Wine Cocktail?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSo fruity! I wish i was them. AnonymousA house8/9/2021Really Fruity! Love it! Moralteaa house8/9/2021Really fruity! Love it! moraltea 8/9/2021Made this for NYE. I used St. George absinthe which is made nearby. I don’t recommend drinking the absinthe by itself, it’s way too intense, although I like other liquors. The cocktail was unique and felt winters because of the anise flavor of the absinthe. I tried the original recipe and also tried using 0.5 oz absinthe and 1 oz. oleo saccharum.  I found the latter more palatable, but maybe it was just because my absinthe was really intense. I also don’t have a vegetable peeler and used a paring knife for the lemons, which was pretty tricky. Overall would make again. AnonymousSan Francisco, CA1/1/2021Explore Bon AppétitCocktailDrinks AllAbsintheAlcohol & Other DrinksEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Chelsea Gregoire"]}