{"id": "5d0181038ee16bf458a830500b5a2b09", "url": "https://www.bonappetit.com/story/what-is-radicchio", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "What is Radicchio, the Bold and Beautiful Leafy Vegetable That Makes Any Salad More Flavorful? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRadicchio Is Bitter and Gorgeous. If Only We Could All Be So LuckyA beguiling beauty.By Sarah JampelNovember 1, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailWhat is radicchio? Beautiful, for starters. While I try not to define anything solely by its physical appearance (ask me about my smart, generous, patient cats), radicchio is undeniably stunning, and the purply-red leaves make any dish more eye-catching. When I anticipate that my dinner is going to be brown-brown-brown, into my shopping cart the radicchio goes. (I’ll pay for it—both literally and figuratively—at the cash register. A budget leaf it is not!)Radicchio, moving beyond its beauty and onto its identity, is a leafy chicory (as is pale Belgian endive and spiky, beguiling Catalonian puntarelle) and, fun fact to squirrel away for a future trivia game, a member of the Asteraceae family (a.k.a. the sunflower/daisy/aster family). The heads are typically small, and the leaves, while they can be tightly or loosely wound, are soft but sturdy, bolstered by crunch from the white ribs.Revered in northern Italy, radicchio breeds are often named for the place they’re grown, and three of the most famous varieties—radicchio di Chioggia, di Treviso, and di Castelfranco—have protected IGT status. (They must adhere to certain quality standards, and production is limited, at least in part, to the namesake region.)Radicchio di Chioggia is what you’ll most likely see in U.S. grocery stores—either on its own or shredded and added to bags of mixed greens—because it’s grown en masse in California. It’s spherical and small, typically about the size of one or two fists, with a surprisingly large number of leaves packed together in a tight bundle.Oblong Treviso leaves are matchy-matchy with tiny squash.\nPeden + MunkIf you put a hand on each pole of the Chioggia radicchio and pulled, you’d get Radicchio di Treviso (in theory). It’s long—think Hey Arnold—with mini romaine-like leaves. When treviso is forced to undergo a second growth in the dark, its leaves firm up and spiral into creepy tentacles. This firmer varietal is known as tardivo and is ideal for cooking, as it holds its shape.The real showstopper of the bunch, however, is Radicchio di Castelfranco. With yellowish-green leaves speckled pink and red and nestled together like a rose, it would make a mighty fine wedding bouquet. (Free idea!) Scour farmers markets for Castelfranco, then use it in raw applications that accentuate its beauty.What does radicchio go with?While the flavor of radicchio will differ between the varieties (Chioggia tends to be the most intense, followed by Treviso, and, finally, the milder Castelfranco) and individual heads, the general taste is bitter, lingering, and assertive. That makes radicchio a welcome companion to milder greens, like the babies (spinach, kale, arugula), as well as a punchy foil to creamy ingredients, like white beans and chickpeas, eggs, avocado, tahini, fatty dairy like sour cream, mozzarella, burrata, and ricotta, and starches like potatoes and winter squash.Castelfranco, just showing off. \nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiI tend to use radicchio as an excuse to add sweet and/or floral ingredients to my salads—honey, pomegranate molasses, citrus, dates, orange blossom water, figs, juicy stone fruit—until I remember that saltiness is actually the more effective counter to bitterness. Try radicchio with lots of Parmesan, chunks of feta, or torn olives. Or simply slice it thinly, dress it with olive oil, sherry or balsamic vinegar, and salt and let it hang out for a few minutes to soften and mellow.Beyond salad, most radicchio takes well to being cooked, which tames its bitterness (but also dulls the vibrant color). Wilt it quickly, like spinach, into pasta, risotto, or a simple sauté, cook cut heads on the grill until caramelized, or broil wedges or shreds in the oven until starting to brown. Another free idea: Spoon ricotta on toast, pile that wilty radicchio over top, sprinkle with toasted hazelnuts and reduced balsamic vinegar, devour.When is radicchio in season?Lucky for us, radicchio thrives in cold weather and is often harvested in late winter and early spring—something to look forward to as we head into orange vegetable season. “Intuitively,” writes Farmer Lee Jones in The Chef’s Garden, “it makes sense to me that radicchios taste their best at this time of year, just when our bodies and taste buds are ready for cleansing bitters after a season of rich food.” At the time of harvest, Jones explains, the plants’ outer leaves look rotten and slimy. “But remove those and inside you find the lovely white and maroon heads.”So…bitter, divisive, sort of slimy on the outside but beautiful (or at least colorful) underneath? I guess you could say I feel a strong affinity toward radicchio. Maybe you’ll find it delicious too!Did someone say salad?Radicchio, Bean, and Feta SaladThe solution to legume doom: This citrusy marinated bean salad with crunchy greens and big chunks of salty feta.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-01", "author": ["Condé Nast", "Sarah Jampel"]}