{"id": "5d13d120de00ca088bbab33235de00ba", "url": "https://www.bonappetit.com/story/say-yes-to-hosting-a-food-filled-game-day-throwdown", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Say “Yes” to Hosting a Food-Filled Game Day Throwdown | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSay “Yes” to Hosting a Food-Filled Game Day ThrowdownBy Trader Joe'sJanuary 29, 2018FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailWe’re celebrating the biggest (food) day in sports with a field full of globally inspired ideas and a little fresh-prep from you at home. Whether you want to bring in a little heat with a delicious spread of Mexican flavor or change things up with a Thai-inspired dumpling feast, these tips will make you MVP with your friends. Don’t stress when you’re tapped to host this year’s big game; we’ve got simple ideas featuring awesome products from Trader Joe’s to help you make a delicious but easy-to-throw-together football party.Make It a Mediterranean-Style FeastPhoto by Ted CavanaughWe feel that hummus is still having its moment, so why not let it shine as a part of your game day feast with the perfect balance of creamy and crunchy apps. We’re fans of the aptly named Mediterranean Hummus, which comes topped with crunchy pine nuts, oil, and spices. It’s the perfect match for Pita Bite Crackers and the addition of bright, fresh produce for dipping, like Les Petites Carrots of Many Colors. We’re believers that you can never really have enough dips on game day, so scoop up some of the Spinach & Kale Greek Yogurt Dip (with 50% less fat and calories than regular spinach dip). As the perfect handheld bite to round out—or shall we say, angle out—your prize-winning platter, crisp up the deliciously creamy Greek Spanakopita triangles filled with spinach, ricotta, and feta cheese. In the time it takes you to open up and arrange your other goodies, these will have baked to a golden-brown crisp in the oven.Say “Aloha” to Hawaiian-Inspired SlidersPhoto by Ted CavanaughMost of us celebrating football season’s biggest event are probably dreaming about being on a beach far away from the winter blues, so why not platter the spirit of aloha? We love the idea of riffing on a Hawaiian BBQ and plating up mouthwatering sliders for your guests to nosh on during the game. Start with the seriously delicious smoky BBQ flavor from Trader Joe’s Smoke House Pulled Chicken Breast and add to toasted Sweet Pull-Apart Aloha Rolls. Give your crew a choice of additional toppings, like triangles of grilled pineapple and tangy cabbage slaw, and you’re pretty much winning the slider game right there.Yes Way, José! We’re Ready to DipPhoto by Ted CavanaughGuacamole is always a good idea—especially at a football feast. Make game-time prep super-easy and serve creamy (and still slightly chunky) Avocado’s Number Guacamole with a big bowl of Restaurant Style Tortilla Chips and some Organic Tomatillo and Roasted Yellow Chili Salsa. This salsa has a medium heat and is perfect on its own with chips but also makes a killer dip for crispy Taquitos from Trader Joe’s. Whether you are a fan of the chicken or Black Bean versions (we recommend some of both), they’re easy to crisp up in the oven or on the stovetop and serve on a platter sprinkled with thinly sliced radishes and torn cilantro for some added crunch and color.It’s True, a Platter of Dumplings Always WinsPhoto by Ted CavanaughDumplings are pretty much a food group in and of themselves, are we right?! Give your game day spread a kick start with Thai Lime and Chili Cashews, rocking the aromatic and spicy-sour addition of Thai lime, lemongrass, and chili peppers. While gyoza traditionally hails from Japan (by way of China), Trader Joe’s has an awesome variety of Thai-inspired flavors including Thai Vegetable and Thai Shrimp Gyoza. Every dumpling (no matter the filling) deserves a strong sauce game, so plate up your delicious assortment with Trader Joe’s Gyoza Sauce—made with soy sauce, rice vinegar, toasted sesame oil, cilantro, and crushed red pepper—and Sweet Chili Sauce for a hint of sweet, garlicky heat.Explore Bon AppétitSuper BowlPartyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "Trader Joe'S"]}