{"id": "5d14cae2da9de3cf2dec50fbf09e2ced", "url": "https://www.bonappetit.com/story/recipe-audit", "year": 2020.0, "month": 6.0, "day": 4.0, "content": "Making Our Recipes Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMaking Our Recipes BetterWe vet them for deliciousness, but that’s not enough.By Joseph HernandezJune 22, 2020FacebookTwitterEmailFacebookTwitterEmailThis newsletter has historically been Bon Appétit’s Letter from the Editor. Until we have a new editor in chief, the BA and Epicurious staff will use this platform to update you on the work we’re doing to address racism and biases at the brands, both internally and in our editorial coverage. This week, BA’s research director Joey Hernandez talks about how we’re auditing our existing recipes to add cultural context and address appropriation and tokenization.I remember the day I saw Bon Appétit’s ode to halo-halo.I grew up eating the Technicolor Filipino shaved ice dessert, a confection studded with sweetened beans, jellied fruits, flan, lychee, tapioca. It defined so much of my childhood of hazy California summers spent with my brothers sitting on our curb, scarfing down the haphazard assemblage with abandon. And here was one of my favorite treats in Bon Appétit, except with gummy bears, berries, and popcorn.It was jarring, to say the least. Was a Filipino person consulted on this? Did the writer do the first bit of research? Like many people who had seen a beloved recipe “riffed on” in a major publication, I had so many questions.Halo-halo was hardly the only offender: BA’s recipes for Vietnamese pho, mumbo sauce, flaky bread, and white-guy kimchi all erased these recipes’ origins or, worse, lampooned them. Every time, promises to “do better” came quick and easy, but these mistakes are not one-offs. As San Francisco Chronicle restaurant critic Soleil Ho recently wrote, “The power of mainstream media is in what it normalizes. And in the case of today’s food media, what it normalizes is a white culture that sees everything foreign to it as a spectacle, something to be tamed and translated for an audience that can’t understand it.”In all these cases and more, BA has been called out for appropriation, for decontextualizing recipes from non-white cultures, and for knighting ”experts” without considering if that person should, in fact, claim mastery of a cuisine that isn’t theirs.In my role as research director, I’m working with the Test Kitchen editors of BA and Epicurious to address many of these problems of authorship, appropriation, the white gaze, and erasure. The events of recent weeks are indicative of larger problems, but correcting the record is a big part of our work of making BA a more inclusive publication.To that end, our team will be auditing previously published recipes and articles that may not have been thoroughly fact-checked or read for cultural sensitivity when originally authored. As we scour the thousands of recipes in the BA/Epicurious archives, we will update recipes with editors’ notes addressing changes to include cultural context and address past appropriation and tokenization. Our first step is addressing the most popular recipes while creating a system to do this work thoughtfully and efficiently. Do we give credit where it’s due? Did we properly credit our inspirations, or did we shoehorn in a trendy ingredient with no explanation?This all accounts for the past. Moving forward, our team is also in the midst of devising stricter research protocols to vet subjects, both before coverage and/or in the event that claims of racism, sexism, harassment, or other injustices surface. We want your input on this work, so while we devise a system for auditing, please email me at joseph_hernandez@condenast.com with any notes or concerns.Thanks for holding us accountable. Let’s get to work.Joey HernandezResearch DirectorExplore Bon AppétitLetters From the EditorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-22", "author": ["Condé Nast", "Joseph Hernandez"]}