{"id": "5d1f42fddf29792313d7512bd1219a9a", "url": "https://www.bonappetit.com/recipe/actually-good-tofu-with-coconut-quinoa-and-broccolini", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Crispy Tofu with Coconut Quinoa and Broccolini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Tofu with Coconut Quinoa and BroccoliniBy Lauren SchaeferMarch 3, 20194.4(68)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Rhoda BooneEmailPinterestPrintEmailPinterestPrintYou know all those times you've made tofu at home and it was kind of...whatever? This is what you actually wanted to make. Crispy, craggy, and thoroughly coated in an addictive, peanut-y sauce, this tofu is so delicious that even the most stubborn carnivores won’t complain. The key to good pan-fried tofu is to make sure it’s as dry as possible before it goes into the hot oil, and to be patient—it can take time to develop the browning you’re after, but the payoff is huge.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonSieve$18 At AmazonSmall Saucepan$155 At AmazonWooden Spoon$6 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMicroplane$16 At AmazonLarge Nonstick Skillet$50 At AmazonLarge Bowl$18 At AmazonPlate$55 At Bon Appétit MarketLarge Skillet$84 At AmazonTongs$13 At AmazonIngredients4 servings114-oz. package firm tofu2¼tsp. kosher salt, divided1cup raw quinoa4Tbsp. virgin coconut or other neutral oil, divided3Tbsp. rice vinegar2Tbsp. smooth peanut butter2Tbsp. soy sauce2tsp. honey¾cup roasted, salted peanuts1bunch broccolini (about 12 oz.)1lime¾cup large unsweetened coconut flakesPreparationStep 1Tear 14 oz. tofu into 2\" pieces (you should have about 20 total). Season with ½ tsp. salt. Let tofu dry on a triple layer of paper towels at least 10 minutes, or longer if possible (overnight works too). The drier the tofu, the crispier it will get!Step 2Rinse 1 cup raw quinoa in a fine-mesh sieve. (This step is super-important. Although most quinoa is pre-rinsed, all quinoa has a natural coating called saponin, which makes it taste bitter if it’s not rinsed well.) Heat 1 Tbsp. coconut oil in a small saucepan over medium (make sure it has a tight-fitting lid). Cook quinoa, stirring, until rinsing water evaporates, about 1 minute. Stir in 1 tsp. salt and 1¾ cups water. Bring to a boil, then reduce heat to as low as possible. Cover and cook 15 minutes, then remove from heat and let sit an additional 5 minutes.Step 3While quinoa is cooking, make the sauce and do some prep. Whisk 3 Tbsp. rice vinegar, 2 Tbsp. smooth peanut butter, 2 Tbsp. soy sauce, and 2 tsp. honey in a small bowl until incorporated (depending on your brand of peanut butter, the sauce may not be completely smooth). Coarsely chop ¾ cup roasted, salted peanuts. Cut tough stems off 1 bunch broccolini; discard. Cut tender stems and florets in half crosswise.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Uncover pot and fluff quinoa with wooden spoon, allowing steam to escape and letting quinoa cool slightly, then add peanuts. Zest 1 lime with a Microplane right into pot of quinoa. Cut lime in half and squeeze in juice from one half over quinoa. Slice remaining half into wedges to serve alongside later.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Heat a medium nonstick skillet over medium. Toast ¾ cup large unsweetened coconut flakes, tossing occasionally, until golden brown and fragrant, 4–5 minutes. Add coconut, 1 Tbsp. coconut oil, and ½ tsp. salt to pot with quinoa and toss to combine. Transfer quinoa mixture to a large bowl.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Line a plate with a triple layer of paper towels. Heat remaining 2 Tbsp. coconut oil in a large nonstick skillet over medium until shimmering. Cook tofu, turning occasionally with tongs, until deeply golden and crispy, about 2 minutes per side, 6–8 minutes total (some spots won’t get brown given the uneven nature of the pieces). Transfer tofu to prepared plate to drain.Step 7Increase heat to medium-high. Cook broccolini and remaining ¼ tsp. salt, tossing occasionally, until bright green and still crisp, 1–2 minutes. (If you ended up with a bunch of thick-stemmed broccolini this may take another few minutes.) Arrange over quinoa in bowl. Let pan cool 2 minutes (you’re going to reduce your sauce in this pan but don’t want it ripping hot or the sauce might seize up!).Step 8Pour sauce into skillet and cook over medium heat, stirring occasionally, until reduced by half and sticky-looking when you swirl the pan, 30–60 seconds.Step 9Remove from heat and return tofu to pan, tossing in sauce to evenly coat.Step 10Arrange broccolini and tofu over quinoa. Drizzle remaining sauce over. Serve with reserved lime wedges alongside.How would you rate Crispy Tofu with Coconut Quinoa and Broccolini?Leave a ReviewTell us what you thinkReviews (50)Back to TopTriangleThis recipe was very mediocre. I made it exactly as written and I ate the end product (with some lime and sriracha) but wasn’t wowed enough to make this again. The concept is good but the peanut sauce could have been better. Jane doe Los Angeles 1/25/2022Delicious!\nPS for those concerned about the quantity of salt: it’s Kosher salt, not regular. So is half as salty by volume as regular salt!LizzyToronto1/22/2022Very good--double the sauce and only use salt when \"curing\" the tofu.  The lime juice has enough bite to act like salt.  This was a hit with the whole family.  JulieRichmond, VA1/11/2022This was a pretty good dish. We doubled the recipe for the sauce based on others reviews. A few modifications we made- My husband had it with basmati rice instead of quinoa. At the very end I sprinkled a little dried crushed red pepper flakes on the top of each plate. It was delicious!CalifarmgalCalifornia- Central valley8/3/2021I come back to this recipe again and again. Its all about that sauce! Yes, double it and add some harissa paste, or whatever spicy addition you like. You can even roast the broccoli and tofu on a sheet pan and avoid the spatter. LauraVNW Tenn8/2/2021I love love love salt but this was inedible. like, so salty I could not eat it. I feel bad for the people I fed it too. do not salt the tofu and cut the soy sauce in half unless you want to literally guzzle water later. I have no idea how this got published lol it's inedibleolivia toronto5/31/2021Delicious recipe.  I love the coconut quinoa, lovely flavours.  And the tofu turned our really well.  I am always looking for ways that are a little different to cook tofu, this will be high on the list of favorites.Nellottawa, Canada4/30/2021SO GOOD. The textures? Incredible. The flavors? Impeccable. We left the salt off the broccolini due to so many comments saying the dish was too salty and thought it was perfect. And there was only enough sauce to coat the tofu but I wasn't bothered by that at all. BrittneyDallas, TX3/22/2021This is 1 star... ‘0’ if I could. The amount of salt in this is just TOO MUCH. I should have known better. Ended up trashing it and ordering pizza. If you MUST, add 1/4 tsp kosher salt to quinoa. And lightly salt the tofu... nothing else. The Sou sauce is also salty and I used reduces sodium. 😒AnonymousColorado 3/20/2021The whole family loved it!\n\nRedid w almond butter which works out well too. The quinoa seasoning was a nice change and the squeeze of lime on top made the dish. Easy to make. Cécile12/10/2020coming back to the comments to say I make this tofu at least 2x/week because it is THAT GOOD. the original sauce is too salty for my girlfriend and I, so I perfected a less salty, more spicy one- rice vinegar, peanut butter and chili garlic sauce. Molly-Margaret JohnsonNYC11/12/2020warm, salty, veggie-y, saucy and crispy- come on! Highly recommend doubling the sauce it you're a dunk queen like myself. The tofu recipe is now a weekly staple in this household- it's BEYOND good. my girlfriend and I crave it all the time. now I skip the quinoa and throw the broccolini and tofu over noodles. \nNew York10/30/2020That was excellent! Next time I will dry my tofu overnight so it doesn't crackle so much in the pan, but I was impatient this time and didn't want to wait. I will definitely add this into my rotation! The flavors meld very well. I thought it was a great combination of sweet and salty, umami and sour. Brilliant! AnonymousMinnesota5/26/2020This recipe is a staple in our house. I've made it maybe 10+ times and it's always delicious. The BEST way to prepare tofu, in my opinion. It does require some time and dirtying more dishes than I'd like, but it's worth it!AnonymousBrooklyn, NY5/21/2020The sauce was so salty and tangy, it was impossible to eat thisAnonymous5/6/2020Explore Bon AppétitTofuOther IngredientsQuinoaRice & GrainsBroccoliVegetableMainVegetarianDairy-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-03", "author": ["Condé Nast", "Lauren Schaefer"]}