{"id": "5d2e48da83bf972599afb20c6cdd7588", "url": "https://www.bonappetit.com/story/vacation-microplane", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "I’m Not Going on “Vacation” Without My Microplane | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI’m Not Going on “Vacation” Without My MicroplaneA hyper-specific cook packs for time away from her kitchen.By Christina ChaeyAugust 15, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,“Vacation” these days doesn’t look the way I thought it would when I was making summer plans. Instead of daydreaming about traveling by plane, I find myself eagerly anticipating the next time a friend tells me they’re leaving town so I can ask to (a) borrow their car or (b) house-sit for a change of scenery. Besides a long-weekend trip to Hudson that my roommates and I took a couple of months ago, I haven’t left New York City in four months.Whether I’m staying in an Airbnb or just someone else’s house for a few days, if I know I’m going to be cooking away from my own home, I get a little...particular about the things I bring with me. In addition to a toothbrush, underwear, and socks, I’ll also pack a small tin of flaky sea salt, my favorite heatproof spatula, and a bottle of good olive oil.Part of it is that I like to be prepared for the worst, particularly when faced with a less-than-stocked vacation rental (or a friend’s vacant home two miles away in Brooklyn) that comes with those weird glass cutting boards and nothing sharper than a butter knife. But part of it is just that I like having my creature comforts and tools available to me when I cook. The tools I use to cook at home are now so familiar to me that they’ve become extensions of my hands; trying to use someone else’s is like trying to fill in the fine details in a landscape portrait with a paint roller. (Dramatic, yes, but you know what I mean!)Still, I can’t bring everything. So, over the years, I’ve fine-tuned my packing list of kitchen equipment, tools, and dry goods to contain only my ride-or-dies, the things I’ll take no matter where I’m going or how long I’m staying. All I’m saying is: Once you start traveling with your Microplane, you may never go on another trip without it.Flaky salt  Jacobsen makes very adorable tins of their crunchy sea salt that you can stash in any bag. I sprinkle a pinch over tomato toast, fried eggs, and sliced avocados with lemon juice.Freshly ground coffee and filters  I’m too caffeine-reliant to leave my coffee choices up to the caprices of a vacation-homeowner. I’ll grind up enough coffee beans in advance at home, then store the grounds in a reusable plastic pint container or a glass jar.Kosher salt, freshly ground black pepper, and chile flakes  As long as I have a pint container of Diamond kosher salt, a small pepper mill loaded with black peppercorns, and a jar of Burlap & Barrel’s Silk Chili flakes, I’ll always be able to make food that tastes good, even if that’s a bowl of buttered pasta.A good all-purpose olive oil  A high-quality everyday oil, like California Olive Ranch, comes in handy for frying eggs, finishing vegetables off the grill, and making salad dressings. I pack mine in a small lightweight squeeze bottle with a cap so I don’t have to lug around a heavy glass bottle.A favorite condiment or three  For me, that’s a small bottle of mayo for sandwiches and potato salads, a jar of Dijon mustard for spreading on aforementioned sandwiches and emulsifying salad dressings, and a jar of kicky chili oil (I love the one from Xi’an Famous Foods in New York).MVP utensils  I don’t want to bring along my entire utensil crock, so I pick just the tools that I know will vastly improve my life no matter where I’m cooking: a mini whisk (for scrambling eggs and making vinaigrettes), a wooden spoon, my GIR heatproof spatula (also: can you be in love with a spatula?!), my large Kunz spoon, a Microplane, and a petty knife, which is smaller than a chef’s knife and thus packs up nicely.Extra plastic quart and pint containers  Not only do I use them as storage vessels for the kosher salt, ground coffee, etc., but I also pack extras for leftovers as well as snacks for hikes or picnics.A wine key  Self-explanatory. It’s vacation.Happy (and safe) travels,Christina ChaeyAssociate editorAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreLifestyleHow I Get My Smoothies So GoodBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-15", "author": ["Condé Nast", "Christina Chaey"]}