{"id": "5d2f045377a3af4c38da9abbf4797fbd", "url": "https://www.bonappetit.com/recipe/cornbread-stuffing-fried-rice", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Cornbread Stuffing Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueCornbread Stuffing Fried RiceBy Rick Martinez and Chris MoroccoOctober 15, 20194.5(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura MurrayEmailPinterestPrintEmailPinterestPrintWhether you’re looking for a way to use up leftover stuffing or you just want to see the look on your family’s faces when you disrupt the typical Thanksgiving menu, this riff on the holiday staple has all the flavors you are expecting, plus much, much more.Ingredients8 servingsChile Crisp3large shallots, thinly sliced into rings1head of garlic, cloves separated, thinly sliced12\" piece ginger, crushed10allspice berries2cups vegetable oil8guajillo chiles, seeds removed3ancho chiles, seeds removed3chiles de árbol, stems removed1Tbsp. sesame seeds1tsp. agave nectar or honeyKosher saltRice and Assembly4Tbsp. ghee or extra-virgin olive oil, divided½lb. Brussels sprouts, leaves separated (about 4 cups)3cups Cornbread Stuffing With Sausage and Corn Nuts11\" piece ginger, peeled, thinly sliced into matchsticks4garlic cloves4scallions, thinly sliced, plus more for serving2large eggs, lightly beaten to blend6cups cooled cooked jasmine or short-grain rice1Tbsp. soy sauce or kosher salt to tasteToasted sesame seeds and/or corn nut powder (for serving)PreparationChile CrispStep 1Bring shallots, garlic, ginger, allspice, and oil to a boil in a large saucepan over medium-high heat. Reduce heat to maintain an active simmer. Cook, stirring occasionally, until shallots and garlic are golden brown, 14–17 minutes. Remove solids from oil with a slotted spoon and transfer them to a plate. Discard allspice and ginger. Add chiles to oil and return saucepan to medium heat. Toast, stirring constantly, until chiles just begin to darken, about 1 minute. Transfer chiles to the same plate; add sesame seeds to oil and set oil aside. Step 2Pulse chiles in a food processor until finely chopped, adding some of the cooking oil as needed to loosen it. Combine chopped chiles in a large jar with shallots and garlic, and remaining oil. Add agave and season with salt. Step 3Do Ahead: Chile crisp can be made 1 month ahead. Cover and chill.Rice and AssemblyStep 4Heat 1 Tbsp. ghee in a large nonstick skillet over medium-high. Add brussels sprout leaves and cook, tossing occasionally, until lightly charred and crisp-tender, about 3 minutes. Transfer to a plate. Step 5Add 1 Tbsp. ghee to same skillet followed by stuffing. Press stuffing across bottom of skillet in an even layer and cook, undisturbed, until browned, about 4 minutes. Toss a few times and continue to cook, tossing often, until stuffing is broken down into lightly browned bits, about 3 minutes longer. Transfer to plate with brussels sprouts. Step 6Heat 1 Tbsp. ghee in skillet. Cook ginger, garlic, and 4 scallions, stirring, until softened, about 1 minute. Add eggs and cook, stirring often, until mostly set, about 30 seconds. Add rice and toss to combine. Add remaining ghee along edge of skillet so it runs down between rice and skillet. Cook, without disturbing, until rice is crackling and has formed a crisp layer against bottom of skillet, about 2 minutes. Toss, breaking up any clumps with a spoon, and continue to cook until rice is hot and crispy-chewy, about 3 minutes longer. Add stuffing and brussels sprouts back to pan and toss to combine; season with soy sauce or salt. Step 7Transfer rice mixture to a platter. Top with sesame seeds and/or corn nuts and more sliced scallions. Serve chile crisp alongside.How would you rate Cornbread Stuffing Fried Rice?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleAmazing! I used leftover cornbread dressing from last year’s Thanksgiving & it was incredible. My husband can’t stop eating it lol. I’m definitely making this a regular for Thanksgiving. I love cornbread dressing and this recipe adds another dimension to it without sacrificing any of the traditional flavors. The only thing I’d change is the amount of oil. I think when I make it for Thanksgiving, I’ll fry up the crispees that go on top in less oil. I think I’ll probably add more brussel sprouts too. Other than those two minor changes, I wouldn’t change a thing. It’s a fantastic recipe. Megan MontagueCalifornia 8/28/2021This is so good, it's ridiculous. I've made it twice, and I'm gonna make it again. So deeply flavorful (especially with the chili crisp) and satisfying for any meal. I can't recommend it enough.marsmilusGeorgia12/12/2019Soul Satisfying! It really itched my ethnic food craving after an all-american T-Day dinner. I didn't want to go through the process of making the Chili Crisps (yet) so I subbed \"Lao Ganma\" Chili Oil I had sitting in the fridge, and swapped the brussels sprouts for peas. Not really true to the recipe, but the recipe itself is a riff on another recipe so I don't feel too bad, heh. AnonymousNew York12/3/2019Delicious! So refreshing and different. Stuffing is my favorite thanksgiving side, my boyfriend doesn't care for it. This made both of us happy. I ended up crisping more Brussels sprouts leaves as a garnish because I had more sprouts and I wanted something bright in color to add to the top. We had a lot of leftovers, so we froze some. I think it should reheat well and be a fun and easy weeknight reheat in a few weeks.AnonymousMassachusetts11/29/2019Explore Bon AppétitFried RiceBrussels SproutVegetableRiceRice & GrainsMainSideFryThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Rick Martinez", "Chris Morocco"]}