{"id": "5d318a9b5935170c6e3dadfd2297f7d1", "url": "https://www.bonappetit.com/recipe/trini-beef-pelau", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Trini Beef Pelau Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTrinidadian Beef PelauBy Brigid WashingtonMarch 17, 20224.7(34)Read ReviewsTriangleEmailPinterestPrintPhotogprah by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellEmailPinterestPrintEmailPinterestPrintWhile Trini pelau has much in common with other protein-rich rice dishes found across the world, this one-pot workhorse gets its distinct rich, dark hue and smoky sweetness from a burnt sugar caramel, known as “browning,” which serves as the dish’s flavor base. This dish is a vessel for some of the Caribbean’s finest flavors, like bright and punchy herbs, spicy-sweet aromatics, and grassy coconut milk—but it’s also a reflection of the multicultural society of the twin-island republic and a mirror of the rich diversity of island life. Read more about the history of pelau—and why it’s the unofficial national dish of Trinidad and Tobago—here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonLarge Bowl$18 At AmazonSilicone Spatula$13 At BA MarketCan Opener$14 At AmazonIngredients6–8 servings3lb. beef stew meat (such as chuck), cut into 1\"–2\" pieces2Tbsp. plus 1 tsp. Diamond Crystal or 3½ tsp. plus ½ tsp. Morton kosher salt, plus more2Tbsp. Worcestershire sauce1Tbsp. coarsely ground black pepper14scallions, 12 coarsely chopped (about 3 cups), 2 thinly sliced1large Scotch bonnet or habanero chile, finely chopped12\" piece ginger, peeled, finely chopped⅓cup ketchup3Tbsp. finely chopped garlic1Tbsp. coarsely chopped thyme¼cup vegetable oil½cup (packed) dark brown sugar7large carrots (about 2 lb.), scrubbed, cut into ½\" pieces115-oz. can green pigeon peas, rinsed113.5-oz. can full-fat unsweetened coconut milk2cups parboiled long-grain rice (such as Carolina Gold Parboiled Rice), well rinsedChopped cilantro and sliced avocado (for serving)PreparationStep 1Toss 3 lb. beef stew meat (such as chuck), cut into 1\"–2\" pieces, in a large nonreactive bowl with 2 Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt, 2 Tbsp. Worcestershire sauce, and 1 Tbsp. coarsely ground black pepper. Add 12 scallions, coarsely chopped, 1 large Scotch bonnet or habanero chile, finely chopped, one 2” piece ginger, peeled, finely chopped, ⅓ cup ketchup, 3 Tbsp. finely chopped garlic, and 1 Tbsp. coarsely chopped thyme. Using gloved hands, massage marinade into meat until well coated, about 2 minutes. Cover and chill at least 1 hour and up to 12 hours.Step 2Heat ¼ cup vegetable oil in a large heavy-bottomed pot over medium-high. Sprinkle in ½ cup (packed) dark brown sugar and cook, undisturbed, until starting to sizzle and darken, 1–2 minutes. Continue to cook, stirring occasionally with a heatproof spatula, until sugar is bubbling and caramel is a dark brown (but not black) color, 3–4 minutes more. (Note: The oil will not incorporate with the melted sugar.) Immediately add beef and its marinade and stir to coat. Reduce heat to low, cover pot, and cook, without stirring, until beef is brown and has released its juices, 15–20 minutes.Step 3Add 7 large carrots (about 2 lb.), scrubbed, cut into ½” pieces, one 15-oz. can green pigeon peas, rinsed, one 13.5-oz. can full-fat unsweetened coconut milk, 2 cups parboiled long-grain rice, well rinsed, and remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; stir to combine. Bring liquid to a simmer, then cover pot and cook over medium-low heat until rice is tender, 40–50 minutes.Step 4Uncover pot and cook, stirring occasionally, until some excess liquid evaporates, 6–8 minutes. Taste and season with more salt if needed.Step 5Divide pelau among bowls. Scatter 2 scallions, thinly sliced, over, dividing evenly. Serve with chopped cilantro and sliced avocado; season avocado with salt.How would you rate Trinidadian Beef Pelau?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMy wife is a beautiful Trini woman and this article as well as this recipe has helped open our eyes to beauty of the multicultural Trinbagonian heritage reflected in the rich history behind this sumptuous dish. What's more, having made this dish, the recipe is legit and it is hands down the most delicious, rice based stir fry we've ever tasted.AnonymousUnited States via Kingston, Jamaica3/22/2022I wish I'd read all the reviews before spending 16$ on beef to cook in a bowl of hard carrots and mushy peas\nnot too happyUnited States3/20/2022Really love this piece of writing, cast me straight back to the Caribbean. I love pelau and cook it with chicken. \n\nEvery Caribbean household has its own nuances, rice and peas for example can be red kidney beans in one household, and pigeon peas in another. The Caribbean is a real melting pot of techniques and flavours, I love this rendition, well done Brigid.DeeLondon3/20/2022Winner!!! I have made pelau before but it never tasted as good as when my mom makes it. I followed this recipe and it was perfect. My son loved it. Like many kids he is a picky eater but he ate 2 bowl fulls. Definitely replacing my old recipe. \nI appreciate the chef sharing the history of the dish, I never really thought about it before but I have a renewed appreciation for the dish to go along with the great new recipe. I really loved the part about her mom and thinking about her mom, it was heartwarming. Thank you for sharing a little history and some delicious food.AnonymousToronto, Canada3/20/2022Just an amazing piece of writing and history on such a Trinidadian and Caribbean staple. So vivid and full of nostalgia, I love this recipe.  When I saw the article I knew I had to make this coming Sunday and so I did.  Came out just right, perfect in fact.  Wife and little one absolutely loved it.  Thanks for sharing such a wonderful dish Brigid...can't wait for more of your recipes to try. Keep them coming!!!!\"ReynoldBasel, Switzerland3/20/2022What Ian said....Also, we season with pimentos, not scotch bonnets, what you described would make a dish that's painful to eat.AnonymousTrinidad3/20/2022looks really tasty, I’m going to try it but with Ian’s additional notes. I like the fact he would use much less sugar AprilUK 3/20/2022This recipe seems gussied up for a Bon appetit photo and article. No problem there. However, note: Pelau is of East African origin. Rice existed in Trinidad before the arrival of East Indians. Fact: African slaves - Amerikins - that arrived in Trinidad (1776-77) from the US  following the US War of Independence, long before the arrival of East Indians in Trinidad, brought with them Red rice, which is grown in Trinidad. Red rice is well known to be the sole rice that can be grown on dry land. Further, use of canned pigeon peas cooked for over an hour in that much liquid will result in a very soft almost mush-like meal. 1/2 cup of brown sugar is way too much. For 3Lbs of beef; two table spoons of sugar - brown or white granulated sugar - and two table spoons of vegetable oil is sufficient for browning. Otherwise you end up with a sweet meal. A great Pelau is almost dry with each grain of rice easily separated from the other much like uncooked rice. As such, if using canned peas, one must add late in the cooking process along with the rice using just enough liquid to cover the combined dry ingredients. Bring all combined ingredients to the boil, cook at the boil for now-two minutes, then cover and leave to simmer over very low or, preferably, no heat for twenty minutes. Note; the relatively  large-cut carrots shown here will also need to be cooked initially along with the beef minus rice and peas as it will take longer to cook that the latter two ingredients.IanTrinidad3/19/2022Explore Bon AppétitDinnerMainNut-FreeDairy-FreeOne-Pot MealsSimmerSautéTrinidadianCaribbeanRiceRice & GrainsPigeon PeaBeanVegetableCarrotBeefMeatCoconut MilkOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-17", "author": ["Condé Nast", "Brigid Washington"]}