{"id": "5d3b63d3fcfac6f4b834d37149626e8d", "url": "https://www.bonappetit.com/story/breakfast-blondies-1", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Breakfast Blondies Get Me Out of Bed When Nothing Else Can | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBreakfast Blondies Get Me Out of Bed When Nothing Else CanChia pudding makes me hit the snooze button. By Aliza AbarbanelJanuary 17, 2020FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.No disrespect to overnight oats and chia pudding, but I don’t wake up craving cold porridge. When I’ve stayed up until 2 a.m. watching people melon-ball produce on TikTok, I need the persuasive powers of a pastry to get out of bed. Unfortunately my budget and schedule don’t have room for daily trips to the café—and my baking skills are far from refined. Then I discovered the transformative powers of breakfast blondies.This grab-and-go breakfast is like a healthyish muffin in bar form. Made with almond butter, flaxseed meal, and eggs, they’re grain-free and packed with protein and fiber. Best of all, they’re delicious enough to pass as dessert, thanks to a bit of maple syrup and brown butter-toasted nuts.It took Anna Stockwell ten rounds to get these blondies just right, and the result is an all-in-one recipe that’s as close to foolproof as baking gets. The hardest part is browning the butter while toasting the nuts, which happens slowly...then all at once. I’ll admit to burning said butter on more than one occasion, but really, who hasn’t? Now I’m careful to swirl the pan often while the butter foams and browns, taking the pan off the heat right when the color starts to darken because I know it’ll continue to cook once it’s in the bowl.Photo by Chelsea Kyle, Food Styling by Michelle GattonOnce the nutty brown butter is ready, I pour it into a bowl through a fine mesh strainer to save the nuts, and then add the rest of the batter ingredients: maple syrup, flaxseed, vanilla, salt, baking powder, and nut butter. Usually I opt for almond butter, but cashew or peanut butter work great too. Next, I add the eggs one at a time, whisking after each to create a glossy, smooth batter, before stirring in most of the reserved nuts. I pour the batter into a greased 8x8 pan, top with the rest of the nuts, and bake. The finished blondies last in an airtight container on the countertop for three days—which I’ve found is plenty of time for my household of two to polish them off.With a jar of almond butter in the fridge, I can throw together a batch of breakfast blondies at a moment’s notice, then pride myself in knowing I’ve taken care of several days of breakfasts. It’s not meal prep—it’s insurance against coming in late to work again because the line at the café was too long and my craving for a pastry far too strong.Get the recipe:Breakfast BlondiesForget breakfast bars or muffins: Our new favorite grab-and-go breakfast is a blondie.View RecipeExplore Bon AppétitBreakfastNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-17", "author": ["Condé Nast", "Aliza Abarbanel"]}