{"id": "5d3da77daed5935c7e8e4128eb6b2a44", "url": "https://www.bonappetit.com/story/best-oil-for-frying", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "The Best Oil for Frying Is Also the Cheapest | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Best Oil for FryingYou better not be wasting a fortune deep-frying in olive oil.By Alex DelanyNovember 30, 2021FacebookTwitterEmailMitchell FeinbergFacebookTwitterEmailThere’s a lot to consider when deep-frying at home. French fries or samosas? Does the exhaust actually work? Where did you put that instant-read thermometer? And just how long will the apartment smell? But one question home cooks don’t need to obsess over: the best oil for frying. Once you’ve got that down, you can go to town thinking about all the other stuff.So what is the best oil for frying?The answer is simple: If you’re frying at home, you’ll probably want to use vegetable oil. While vegetable oil is a term that can be applied to any plant-based oil, what we’re talking about are the bottles that spell out “vegetable oil” on the label. Vegetable oil is usually a mix of different plant-derived oils—like corn oil, soybean oil, and sunflower oil—blended together for maximum cost-effectiveness. (If you have an allergen or sensitivity, you’ll want to carefully examine the label so that you know exactly what’s in that bottle.)While vegetable oil is not what we would reach for to make salad dressing, mayonnaise, or toum, we love it for frying. Why? There are four main reasons:It has a high smoke pointBefore we get started, what even is a smoke point and why should you care? The smoke point is the temperature at which a fat will stop shimmering—a sign that it is hot and ready to be used—and start burning, creating smoke and leading to a situation that’s not so tasty and potentially dangerous.You don’t need to memorize smoke points (that’s what Google is for), but when choosing what type of oil is ideal for what purpose, it can be helpful to divide up the large world of cooking oils and fats into three big buckets:Low- to no-heat oils are often flavorful and unrefined. These oils have low smoke points and should be reserved for sauces, dressings, and drizzles where their flavor and aroma can shine. In general, the less refined the oil, the lower its smoke point and the shorter its lifespan—they’ll eventually go rancid at room temperature.Examples: toasted sesame oil, perilla oil, nut oils like hazelnut and walnut, flaxseed oilMedium-heat oils and fats can handle brief periods of heat, like when you’re sautéing or doing a quick sear, and will impart their aroma to whatever you’re cooking. Examples: pork fat, vegetable shortening, unrefined avocado oil, extra-virgin olive oil, unrefined coconut oilHigh-heat oils are often neutral-tasting and highly refined. Because they have such high smoke points, they can sustain high temperatures in applications like deep-frying, pan-frying, and stir-frying.Examples: sunflower oil, safflower oil, corn oil, soybean oil, canola oil, peanut oil, rice bran oil, light or refined olive oilVegetable oil, you’ve probably guessed, is a high heat oil, with a smoke point between 400° and 450°. In many recipes, from fried chicken to doughnuts, you’ll aim to deep-fry in oil that’s about 350°, which means that vegetable oil is not likely to get anywhere near smoking.Two words: fried chicken.\nPhotograph by Emma Fishman, food styling by D'Mytrek BrownIt has a neutral flavorWhile unrefined, low-heat oils offer a distinct aroma—think virgin coconut oil in a tender cake or a drizzle of walnut oil on top of roast salmon—when you’re frying, you’re most likely not looking to impart a fruity, grassy, or nutty flavor. Instead, you’re frying to cook the food through and, in the process, change its texture and color (crispy golden brown!). A neutral oil, one without any strong flavor of its own, allows the characteristics of whatever you’re frying to remain unadulterated with no distractions from the flavor of the food itself.It’s cost-effectiveThere are definitely other neutral, high-heat oils that work well for frying—canola oil, sunflower oil, peanut oil, avocado oil, and rice bran oil, to name a few—but they tend to cost a whole lot more than generic vegetable oil. And because you need a large volume of oil to deep-fry—multiple cups rather than judicious glugs—this probably isn’t the time to spring for the fanciest stuff.It can be reusedBecause it has such a high smoke point, vegetable oil can be reused: After you fry, let it cool completely, then strain it through a sieve to get any bits out (those bits can impart an off flavor and lower the future smoke point), and decant it into a bottle (the same bottle it came in, perhaps!) for later use. (All that said, oil degrades with each use. Once it has an off aroma and/or a dark, murky color, don’t reuse it—it’s time to toss it in the trash for good.)Mmmmmmm...fried foods.\nWhat is the worst oil to cook with at high temperatures?If the best oil to cook with is resilient in nature, neutral in flavor, and cost-effective, the worst oil to cook with is highly aromatic, sensitive, and expensive. Any oil you’d use as a finishing flourish rather than a cooking medium—toasted sesame oil, flaxseed oil, toasted hazelnut oil—should be reserved for low- or no-heat applications. (We typically save extra-virgin olive oil, which we call for in lots of recipes, for medium-heat applications or briefer stints at high temps.) All of these expensive oils are most appreciated when their distinct qualities are on display—they’re simply not at their best when subjected to long periods of heat (and because they have low smoke points, cooking with them at high temperatures can also be dangerous). Save those for a good loaf of bread, a beautiful salad, a bowl of hot rice, or a steaming mug of soup, and leave the deep-frying to the vegetable oil.Now, let’s fry some chicken:The Basically Fried Chicken SandwichEverything you want in a crispy chicken sandwich, with none of the fuss.View RecipeThis article was originally published in 2018 and was updated by Sarah Jampel in 2021.Explore Bon AppétitBasicallyFried ChickenDeep-fryOilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Alex Delany"]}