{"id": "5d440cfdfc5e480f145333008e9aa9e7", "url": "https://www.bonappetit.com/recipe/chewy-date-and-dark-chocolate-cookies", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Chewy Date and Dark Chocolate Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueChewy Date and Dark Chocolate CookiesBy Zaynab IssaMarch 15, 20225.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintThese crispy-edged, chewy-centered wonders deliver the ultimate cookie texture and have an extraordinary sweet-savory balance thanks to olive oil and tahini. To get the cookies just right, measure the ingredients by weight, use good-quality bittersweet chocolate to offset the sweet dates, and mix the tahini very well before measuring. Oh, and flaky salt before baking is a must.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonLarge #10 Scoop$9 At AmazonScale$25 At AmazonWire Cooling Rack$17 At Bon Appétit MarketFlexible Metal Spatula$9.99 At AmazonIngredientsMakes 162¼cups (281 g) all-purpose flour1tsp. baking soda1tsp. cornstarch1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2large eggs½cup extra-virgin olive oil¼cup well-mixed tahini2tsp. vanilla extract¾cup (150 g) granulated sugar¾cup (150 g) light brown sugar9Medjool dates, pitted, 5 chopped, 4 quartered lengthwise8oz. bittersweet chocolate (70% cacao), chopped, dividedFlaky sea saltPreparationStep 1Whisk flour, baking soda, cornstarch, and salt in a medium bowl.Step 2Using an electric mixer, beat eggs, oil, tahini, and vanilla in a large bowl on medium speed until creamy and emulsified, about 2 minutes. Beat in granulated sugar and brown sugar until combined, about 45 seconds. Reduce speed to low and beat in dry ingredients, chopped dates, and three quarters of chocolate, scraping down sides of bowl as needed, just until combined, about 30 seconds. Cover dough and chill at least 3 hours and up to 12 hours.Step 3Place a rack in middle of oven; preheat to 375°. Using a #10 cookie scoop (about 6 Tbsp.), portion out dough onto 2 parchment-lined baking sheets, spacing 3\" apart. Top with remaining chocolate and press gently to adhere. Gently press 1 date quarter into top of each cookie. Sprinkle with sea salt.Step 4Working with one baking sheet at a time, bake cookies until golden brown around the edges, 13–15 minutes. Let cookies cool 5 minutes on baking sheets, then transfer to wire racks and let cool completely.How would you rate Chewy Date and Dark Chocolate Cookies?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI love a good chewy cookie and this rich and simple recipe is perfection! My new favorite!Christian EllisMartindale, TX3/21/2022Explore Bon AppétitDessertCookieBakingEasyDateDried FruitFruitChocolateOther IngredientsTahiniCondiments, Sauces & PastesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Zaynab Issa"]}