{"id": "5d48e5d1da2376e5ca382cc0b30ae80d", "url": "https://www.bonappetit.com/recipe/mole-spiced-ribs-with-orange-and-pickled-onion", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Ribs With Orange and Pickled Onion Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueMole-Spiced Ribs With Orange and Pickled OnionBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20204.5(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintAt Lil’ Deb’s Oasis in Hudson, New York, chef-owners Hannah Black and Carla Perez-Gallardo love the idea of braising meat in soda to tenderize and caramelize, but swapped in tangy kombucha to avoid the sugar rush. “We want people to have that ‘what the f*#%?!’ reaction when they take a bite,” Perez-Gallardo says.Ingredients8 servingsMole Powder5whole star anise1Tbsp. coriander seeds1Tbsp. cumin seeds1Tbsp. mustard seeds1½tsp. whole cloves4dried chiles de árbol or 2 tsp. crushed red pepper flakes2guajillo chiles, seeds removed3Tbsp. toasted sesame seeds, divided¼cup ground sumac4tsp. unsweetened cocoa powder1¼tsp. ground cinnamon1tsp. ground allspice1tsp. ground coffeeRibs and Assembly22½-lb. racks St. Louis–style pork spareribsKosher salt½medium red onion, thinly sliced⅓cup red wine vinegar2tsp. sugar12oz. kombucha (about 1½ cups)4garlic cloves, thinly sliced1medium white onion, cut into 2\" pieces2medium oranges, cut into 2\" pieces (peel and all), dividedCilantro sprigs (for serving)Special EquipmentA spice mill or mortar and pestleIngredient InfoSumac can be found at Middle Eastern markets, specialty foods stores, and online.PreparationMole PowderStep 1Toast star anise, coriander seeds, cumin seeds, mustard seeds, and cloves in a dry small skillet over medium heat, tossing occasionally, until very fragrant and just beginning to darken, about 5 minutes. Transfer to a plate; let cool. Finely grind in spice mill or with mortar and pestle; transfer to a bowl. Finely grind chiles de árbol, guajillo chiles, and half of sesame seeds. Add to ground spices along with sumac, cocoa powder, cinnamon, allspice, coffee, and remaining sesame seeds; mix well.Step 2Do Ahead: Mole powder can be made 2 weeks ahead. Store airtight at room temperature.Ribs and AssemblyStep 3Season ribs all over with salt (we recommend 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt per lb.) and sprinkle with ½ cup mole powder, pressing to adhere. Arrange on a rimmed baking sheet and let chill, uncovered, overnight.Step 4Place racks in upper and lower thirds of oven; preheat to 300°. Mix red onion, vinegar, sugar, and a few pinches of salt in a medium bowl; set aside.Step 5Transfer ribs to a deep roasting pan and pour in kombucha. Scatter garlic over and arrange white onion and half of orange pieces around ribs. Cover pan tightly with foil; bake on lower rack until tender but not falling apart, 2½–3 hours.Step 6Remove ribs from oven. Heat broiler. Uncover ribs and broil on upper rack, turning once, until crisp, about 5 minutes.Step 7Transfer ribs to a platter. Skim fat from liquid in pan and discard; drizzle liquid over ribs. Top with drained pickled red onion, cilantro, and remaining orange.How would you rate Mole-Spiced Ribs With Orange and Pickled Onion?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI’ve probably tried 25+ recipes and this is the best of them all from Bon Appetit. Genius! I always get that “wtf” moment they describe. I particularly love it in the cold dark winter time to warm me up and think to brighter days. Hannah LSeattle12/25/2021We definitely had that “what the f*@k” moment when we tasted this. These were AMAZING!!! We swapped the pork for beef ribs. Served them on top\nof an adobo cashew purée with the charred and raw corn salad which is also a bon appetite recipe I highly recommend. We will definitely be making these again soon!! tkkellerChicago 5/6/2020I'm not going to over complicate this review: they were delicious.  Can't find Sumac where I live, so I just coated with lemon juice before adding the spice rub.  I used Baby Back Ribs because they were on sale so I reduced the cook time.  Everyone I made them for were very pleased with the final result.  Served with cole slaw which frankly went with the ribs beautifully.RogueRevPA4/23/2020Made these for dinner yesterday and they were a winner. Didn't have cocoa or sumac on-hand for the mole rub so I added lemon pepper, extra coffee and cinnamon to compensate. After reading the comment below about the pan drying out, I used an entire 16-oz bottle of homemade carrot-orange kombucha. Serve with something tangy and green, e.g. a apple brussels sprout slaw. No leftovers. broazayBushwick4/23/2020YUMMY!!  The ribs fell off the bone and the flavors were amazing.   The combination of the spices reminded me of my favorite Mole recipe from Cafe Pasqual.    I loved how the oranges added a sweet surprise.  It would be perfect to strip the bones after cooking and soak in the juices, onions and orange pulp and serve with tortillas, cilantro, avocado and crema.  I used the entire 16 oz bottle of Kombucha so maybe that helped with the sauce; knowing the last person had dry ribs.   Our ribs were really meaty/fatty so I could see the rub becoming overwhelming if you don't have good ribs.  I also covered them when they sat overnight.  I might try this with a pork shoulder next time.  San Luis Obispo1/22/2020We did NOT love this. The ribs were tender, but despite following the instructions to let the rub sit on the ribs overnight uncovered, the flavors didn’t permeate the meat AT ALL.  I think also it needed more liquid as they were extremely dry after 2 1/2 hours at 300. The taste of the spices was overwhelming and not in a good way. I’ll try again, but with far less spice rub, much more liquid, and a fattier piece of pork. I think I will also not let them\nsit so long. \nIn the meantime I’m going to strip the meat from the ribs after removing the rub and try making a mole style sauce to try and salvage all this workTinaHunt4781/15/2020Explore Bon AppétitRibsPork RibPorkMeatMainDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}