{"id": "5d4cabf7eeb4b24a66e1def43c8aa700", "url": "https://www.bonappetit.com/story/bottle-scraper-flessenlikker", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "No Sauce, Jam, or Nutella Is Safe from My Bottle Scraper | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingNo Sauce, Jam, or Nutella Is Safe From My Bottle ScraperThere’s a whole five cents worth of peanut butter left in that jar.By Michelle TcheaNovember 2, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Before I discovered the flessenlikker, I spent hours with my hand in a jar. Compelled by my inner thriftiness, I would maneuver knives and long-handled spoons in a futile attempt to scrape out every last bit of mayo, confiture, or sauce. I would go as far as to throw a piece of fresh sourdough bread into a nearly empty Nutella jar, swishing it around with a chopstick to try and mop up every last bit. But much to my dismay, there would always be a corner of the jar beyond my reach. I’d be forced to admit defeat and rinse out the last swipes of jam before repurposing the container as a pickling jar.But then a foot-long stick topped by a small half-circle-shaped spatula head came into my life. It’s called a flessenlikker, which—I am not making this up—means “bottle licker” in Dutch. Invented in Norway in the 1900s, the flessenlikker took off in the Netherlands because of the popularity of custard, which was sold in tall bottles with tapered necks. The bottle licker allowed frugal Dutch housewives to wring every last drop from their custard bottles, and until this day it remains a quintessential tool in the Dutch kitchen. It’s flexible enough to fit through narrow-necked bottles of oyster sauce and into the angled corners of hexagonal jam jars. The company that originally introduced the flessenlikker to the Netherlands has since expanded its business to designer bathrooms, and this bottle scraper reminds me of a tiny squeegee you would use to flick water off the glass walls of your shower or to defog your bathroom mirror after a home sauna session.Now not a smear of peanut butter, sesame oil paste, or doubanjiang goes to waste in my kitchen—and I even use my bottle scraper to clean the sediment from the bottom of my wine glasses instead of trying to wedge my hand into the bowl. (It’s a game changer for champagne flutes.) And I dare you to look through my recycling: Thanks to the flessenlikker, each and every bottle and jar is licked entirely clean.Bottle Scraper$11 at Amazon$18 at Walmart (Pack of 2)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-02", "author": ["Condé Nast", "Michelle Tchea"]}