{"id": "5d4d2cb451a0d4c01dd44fcaf498022c", "url": "https://www.bonappetit.com/story/cashew-nam-prik", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Go Ahead and Fill Up on This Fiery Cashew Dip | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGo Ahead and Fill Up on This Fiery Cashew DipThe supremely satisfying, supercharged crudité platter packs in protein, flavor, and heat.By Aliza AbarbanelJuly 26, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailScooping up a good dip is like eating ice cream straight from the pint: delicious, addicting, and sometimes regrettable. You know what we mean: You go all in on the guacamole only to stare at your dinner plate ruefully when the main course hits the table. Luckily there's a dip that works just as well as an hors d'oeuvre, an appetizer, or a main course, and it's this fiery cashew nam prik. This deeply-flavored, unabashedly chile-forward dip is packed with protein-rich nuts and juicy tomatoes and pairs with everything from soft-boiled eggs to fruit. It's a celebration of flavor and texture, with slow-burning chiles and funky fish sauce to keep us coming back for more.For the uninitiated, nam prik is a staple Thai condiment somewhere between a dip and a relish, featuring dried, fried, or fresh chiles. After that, all bets are off: It’s one of Thailand’s most regionally diverse dishes, changing in taste and texture across seasons of regions through the addition of ingredients like ground pork, eggplant, waterbugs, and tamarind. In other words, there is a nam prik out there for everyone.“The best way to think of nam prik is as a building block around which to assemble a meal,” writes chef Kris Yenbamroong in Night + Market. “Sticky rice, grilled meats, fried stuff, and seasonal vegetables served either raw or boiled are fair game.”Senior food editor Andy Baraghani’s recipe is inspired by nam prik ong, a beloved Northern Thailand staple made with dried chiles, tomatoes, and ground pork. He subs cashews for the meat, and uses both tomato paste and cherry tomatoes to double down on the tangy-sweet tomato flavor. “I wanted to do a summer nam prik with tomatoes, and I turned to nuts for rich flavor and creaminess without using meat,” he says.Nam prik is traditionally made with a mortar and pestle, but this recipe’s chile paste is first created in a food processor then finished on the stovetop for maximum flavor and minimum fuss. Start by pulsing cashews in a food processor into ¼ inch pieces. Don’t worry if some nuts get ground into a powder—they’ll help thicken the dip. Set the cashews aside and make the chile paste by processing shallots, lemongrass, garlic, lime zest, and six Thai chiles or four Fresno chiles.Next, stir-fry the cashews and curry paste to mellow the aromatics and add nutty, toasty flavor. Add the tomato paste and cherry tomatoes, then cook until the tomatoes have completely broken down, adding sweetness and acidity to balance out all that heat. When the mixture is aromatic and thickened, remove from heat and stir in fish sauce and lime juice for a hit of brightness and funk.With the cashew nam prik assembled, it’s time to assemble a bountiful platter of things to dip. Andy recommends serving with sweet mango wedges, soft-boiled eggs, sliced cucumber, and Bibb or gem lettuce leaves to cut through the lingering heat. And, while not exactly Healthyish, pork rinds are a classically delicious addition too. Go for it! You'll want plenty of things to scoop up every last bite. This stuff goes so fast, you may even want to go ahead and make a double batch. With a jar of nam prik stashed in the fridge, you're never far from a great snack...or a meal you won't later regret.Get the recipe:Cashew Nam PrikNam prik is a delicious chile-based dip found all over Thailand. Here's our healthyish take on it.View RecipeExplore Bon AppétitHealthyishThaiCashewCrudite DipDipRead MoreLifestyleThis Turmeric Yogurt Dip Is a Great Excuse to Load Up on Spring ProduceBy Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-26", "author": ["Condé Nast", "Aliza Abarbanel"]}