{"id": "5d55a639f41aa2695837655bcfe100a8", "url": "https://www.bonappetit.com/story/holiday-issue-2020", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "The Holiday Issue 2020 Edited by Marcus Samuelsson | Bon Appétit\n\n\n\n\n            A Celebratory Meal Gift Guides Christmas Hallacas Cookies! Singer Janelle Monáe Cocktail Hour Saving Restaurants Chef Sophia Roe Crispy Leek Latkes Two Icons Reflect Artist Julie Mehretu              A Celebratory Meal Gift Guides Christmas Hallacas Cookies! Singer Janelle Monáe Cocktail Hour Saving Restaurants Chef Sophia Roe Crispy Leek Latkes Two Icons Reflect Artist Julie Mehretu       Edited by MARCUS SAMUELSSON       There’s no question: The holidays will look different this year. But there is power in embracing this change, in seeing this holiday season as an opportunity to try out something different and to create new memories. Which is why as guest editor I wanted to highlight the joy of the season with festive meals I hope you’ll recreate at home. For many of us, 2020 has been the most trying year of our lives. We all deserve to let our hair down. Let’s make sure to spend this season celebrating, reflecting, and looking forward. —Marcus Samuelsson, guest editor       IN THIS ISSUE  A Celebratory Meal Gift Guides Christmas Hallacas Cookies! Singer Janelle Monáe Cocktail Hour Saving Restaurants Chef Sophia Roe Crispy Leek Latkes Two Icons Reflect Artist Julie Mehretu          Something to Celebrate Marcus Samuelsson reflects on the year with joy, gratitude, and an epic menu from his new cookbook, The Rise    reporting by KAYLA STEWART   photographs by JOSHUA KISSI     What does celebration look like this year? In a sign of the times, I invited a few neighborhood friends to Harlem for a socially distanced holiday party and asked others to join us on Zoom. I wanted us, as a community, to acknowledge making it to 2021. I served food from my new book, which showcases the diversity of Black excellence in cooking, something we should always celebrate. It was a moment for us to reflect on the struggles of the year—there were so many—but also its bright spots. It was a joyous occasion, and it’s exactly how I want to move into a new year.—Marcus Samuelsson  Note: We filmed this story over the summer, with COVID safety measures implemented and a COVID health & safety advisor on set taking temperatures, ensuring distancing, and mask wearing. The crew was masked the entire time, and the guests were photographed in individual photo sessions and only took their mask down when photographed. The people that were shot together are ones that are couples/families and live together. All portraits and food were photographed outside and from a safe distance. The story was edited together to appear as if everyone was around the same dinner table, but in reality it was a series of individual photo shoots (with the exception of members of the same household, who were photographed together). We advise following the CDC’s guidelines for safely gathering, and encourage people to gather virtually with the ones they love.    The Guest List          Lana Turner An icon of Harlem fashion—and wearer of incredible hats—who has worked in New York City real estate and art.       Bevy Smith Television personality, host of SiriusXM’s Bevelations, and author of the forthcoming book, Bevelations: Lessons from a Mutha, Auntie, Bestie.        Dapper Dan Fashion designer and Harlem native who introduced high fashion to hip-hop.       Rakiem Walker Composer, saxophonist, pianist, and leader of the Rakiem Walker Project.       Marcus Samuelsson Chef, cookbook author, and the host for the evening.       Melba Wilson Cookbook author, president of the New York Hospitality Alliance, and founder of quintessential Harlem restaurant Melba’s.       Maya Haile Model, philanthropist, and founder of Three Goats, which supports the health and well-being of vulnerable communities in Ethiopia. She and Samuelsson have been married since 2009.       Thelma Golden Director and chief curator of the Studio Museum in Harlem, where she has encouraged the exploration of race, culture, and community through art.        Gloria Ryann Lead vocalist of the Rakiem Walker Project and an artist-in-residence at the Red Rooster.        The Menu     Corn and Crab Beignets With Yaji Aioli Get the Recipe    Scallops With Red Aguachile and Pickled Onions Get the Recipe    On Unity “My husband, Floyd Cardoz, was one of the kindest people. My hope for everybody is that we just continue to love, and just realize that we’re all the same. We’re one big universe with the same people.” —Barkha Cardoz     Short Ribs With Piri‑Piri Marinade Get the Recipe    Pumpkin Soup With Spiced Nuts Get the Recipe    On Kwanzaa “Kwanzaa has always been about celebrating African-American culture, but this year it invites us to go inward, to realize that you’re alive in ways that you would not have realized before this year. Those seven days give us a chance to show our love, and to have hope.”  —LANA TURNER     Banana Leaf Snapper With Chickpeas and Coconut Rice Get the Recipe    Roasted Beets With Dukkah and Sage Get the Recipe      The Wine Other People’s Pinot Noir from Maison Noir ($24) is structured enough to hold its weight with dinner but bright and easy enough to drink on its own before the big meal.      Collard Greens Salad With Pickled Fennel and Coconut Get the Recipe     Roasted Carrots With Ayib and Awaze Vinaigrette Get the Recipe      The Playlist      On Food “We cook because it gives us joy to put a smile on someone’s face. Food is the common denominator. It doesn’t care about your ethnicity or pocketbook. The only thing it cares about is that you sit down, relax, and enjoy.”  —MELBA WILSON       Bake This Cake  This over-the-top cake from Amirah Kassem of Flour Shop looks intense, but is actually pretty doable (no one else needs to know that). Here’s how to pull it off at home Get the Recipe        Holiday Gifts Because we have more people to show appreciation for than ever before    by MacKenzie Chung Fegan   photographs by Jessica Pettway     All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.          These three new entries in the apéritif scene deliver on both style—those labels!—and substance. Swap Faccia Brutto for Campari to make citrusy Americanos with just a hint of cherry cola. $35; leonandsonswine.com. Ghia’s satisfyingly bitter, nonalcoholic apéritif is delicious with tonic. $33; drinkghia.com. And Mommenpop pairs California wine with California citrus for a sunny, juicy apéritif begging to be spritzed. $34; mommenpop.com       Why, designer Rafael Prieto wondered, do Belgium and Switzerland steal the chocolate spotlight when Mexico has such ancient traditions with cacao? He launched Casa Bosques Chocolates in response, working with chefs like Elena Reygadas to pair Latin American chocolate with blue maize, hoja santa, and cardamom. $12–$22; casabosques.co       Piera Bochner learned mold making while training as a sculptor in Berlin, and after casting a candle mold from a romanesco, she knew she had found her muse. She scours the greenmarket for textural fruits and vegetables like bitter melon, sugar apple, and bumpy decorative gourds to make candles that are one part produce and one part NSFW. $35-$79; pierabochner.com       Ceramist Lalese Stamps was in a rut, so every day for 100 days, she challenged herself to make a different mug out of sleek black clay, fashioning unique handles for each. One resembles the rings of Saturn, another a tiny steering wheel, and a third sports spikes worthy of Bowser Koopa. These two suggest rainbows in monochrome. $52; lolly-lolly.com       In 2020 we stockpiled beans and babied our sourdough starters, but nothing changed us quite like this Blue Oyster Mushroom Grow Kit. We watched with fascination as tiny capped heads sprouted, sometimes doubling in size throughout the day, until the largest ones neared the diameter of Eggo waffles. Nature is weird! But also delicious sauteed in butter. $34; smallhold.com       Whether you’re prepping your mise en place or mixing up holiday cookies, this nesting set of stainless-steel bowls from Japanese mid-century industrial designer Sori Yanagi has you covered. They’re the perfect combo of form and function, and it’s no wonder pastry chef Ayako Kurokawa of Brooklyn bakery Burrow swears by them. $217; jinenstore.com       This year you may be sitting out the big, glitzy New Year’s Eve party, but there’s no reason you can’t have oysters and Champagne at home. Order a sack from Hog Island Oyster Co. and practice shucking from the comfort of your own couch. $75 for 36; hogislandoysters.com       The problem with flowers is that, like youth and Girl Scout cookie season, they don’t last forever. This is why we love artist and floral designer Tosha Stimage’s arrangements—they’re already dead! The Everlasting Mini showcases exuberant dyed pink blooms, magenta leaves, and fuchsia grasses, all dried and ready for long-term display. $28; saintflora.com       Handcrafted by master artisans in northern Ghana, these Baba Tree Pakurigo Wave baskets are woven from durable vetiver grass. Their undulating, organic forms remind us of mollusk shells or pattypan squash run amok. Store picnic blankets and linens in the larger one, which measures 17 inches across, and use the smaller, 12-inch basket for your winter clementine stash. $85-$200; babatree.com      More Gift Ideas Right This Way         It’s Not Christmas Without Hallacas Proof that good things come in small packages: the meaty Venezuelan tamales that Atlanta pastry chef Claudia Martinez’s family has been making for generations Read More    photographs by YUDI ELA        Comfort Cookies However you choose to celebrate (or endure) the holidays this year, one thing is clear: You deserve a cookie. So we dug into our personal archives, drawing on our most nostalgic, security-blanket-esque cookie memories and updating the recipes for right now—when we need them most    photographs by Laura Murray          Pretzel and Potato Chip Moon Pies Little Debbie’s chocolate marshmallow pies were my favorite treat as a kid. These moon pies, made of chocolate-dipped shortbread cookies loaded with toasty pretzels and salty potato chips, satisfy that same toasty-bittersweet craving, but for a (slightly) more grown-up palette. —SOHLA EL-WAYLLY Get the Recipe       Coffee-Hazelnut Biscotti The biscotti is the primo anti-gooey-chewy cookie, and the perfect vehicle for all my preferred dessert flavors: coffee, chocolate, and nuts. These are crisp-tender and far from rock-hard, but still sturdy enough to dunk in amaro, bourbon, or cold milk. —CARLA LALLI MUSIC Get the Recipe       Brown Butter and Pistachio Sables Crumbly, sugar-dusted Greek kourabiedes are my household’s usual Christmas staple, but not this year. Subbing pistachios for walnuts, bay leaves for cloves, and a sugar glaze for powdered sugar, the results look nothing like the original. Something tells me the fam won’t mind. —MOLLY BAZ Get the Recipe       Marranitos Enfiestados The popular Mexican cookies get a Beyoncé-inspired cow print of two ginger-spiced doughs: one with traditional piloncillo (a dark cane sugar with a smoky molasses-caramel flavor) and one with agave syrup. Don’t forget sanding sugar, because these piggies came to party. —RICK MARTINEZ Get the Recipe       Tahini Linzer Torte Bars This recipe combines the utility of a Fig Newton with the elegance of another jam-filled dessert, the linzer torte. Tahini makes for a rich, buttery crust that’s layered with jam, topped with a “fake” lattice, and then cut into big, unbreakable (USPS-friendly) bars. —SARAH JAMPEL Get the Recipe       Nan-E Berenji My preference for savory means I usually pass on the Persian confections my family loves. Not so with this nan-e berenji, a delicate rice flour cookie that incorporates black sesame, pistachio, and freeze-dried raspberries to tame the traditional cardamom and rose water notes. —ANDY BARAGHANI Get the Recipe       Ginger-Citrus Cookies My grandmother Helga and I used to make a version of this recipe together every holiday season. The fragrant spices in the gingersnap dough against the bitterness of the chopped candied orange peels are exactly what I want this time of the year. —MARCUS SAMUELSSON  Get the Recipe       Pizzettes With their fudgy texture, piercing bittersweet chocolate, almonds, citrus zest, and heady undertone of cinnamon and clove, there’s nothing better than this upgrade of my grandmother’s famous pizzettes. Buttery and rich, yet balanced…who wouldn’t want a bite of that? —CHRIS MOROCCO Get the Recipe          Special Delivery for... Janelle Monáe As part of a new series, Table 13, Marcus Samuelsson talks to the Turntables singer about the four stages of quarantine, eating on tour, and a cross-country gift box Read More      What's in the Box          We may not be flying much this year, but our favorite presents are. With that in mind, Marcus sent Janelle a rose gold Calpak Baye hat box filled with curated gifts he knew she’d love. $125; calpaktravel.com       Everything sounds better in vinyl—especially Songs in the Key of Life, the 1976 album from the great Stevie Wonder, one of Janelle’s all-time-favorite musicians. $43; amazon.com       One good-looking way to protect yourself these days is this denim ruffle face mask from 69 in Los Angeles. Even better: 100 percent of profits go to support the racial justice organization Color of Change. $25; sixty-nine.us       A vintage baseball hat repping Janelle’s hometown of Kansas City, Kansas—home of the National Negro League’s wildly successful team, the Monarchs. Before Jackie Robinson signed with the Dodgers, he made his home with KC.       This limited-edition design renders illustrator E. Simms Campbell’s Jazz Age map of Harlem's nightclubs in 22k gold. As Marcus says, “It’s a proud candle. It speaks to the neighborhood it’s made in.” $60; harlemcandlecompany.com       Something sweet to cap it all off: An ooey-gooey miso chocolate chip cookie straight from Ginny’s Supper Club, Marcus’s slinky cocktail lounge and restaurant under Red Rooster. Make them at home with this recipe.             Time for a Toast A holiday cocktail can go in just about any direction, which is why we asked some of our favorite booze professionals to make us, well, whatever they wanted to make us for the holidays Get the Recipes    as told to ALEX DELANY   photographs by YUDI ELA           Restaurants Restore Us. Can We Restore Them? Restaurant workers look back to the year that turned the industry upside down—and what it could take to turn it around Read More    by Ashlea Halpern   photograph by PEDEN + MUNK          A Healthyish Break With Sophia Roe  A celebratory season doesn’t mean sacrificing good-for-you food—take a cue from this chef and wellness advocate (and one of the busiest people we know) Read More    Not Our Mother’s Latkes  With crisp outsides, creamy insides, and a subtle sweetness from tons of blanched leeks, these latkes from Zak the Baker might not be what you’re used to—and that’s a good thing Read More    Revolution and Repose  Artist Derrick Adams and poet Nikki Giovanni reflect on the connection between civil rights and relaxation Read More    A Closing Note  Artwork by Julie Mehretu inspires Marcus to look back on the year Read More        Guest Editor: Marcus Samuelsson   Creative Director: Michele Outland   Project Leads: Sonia Chopra, Elyse Inamine, Sasha Levine, Meryl Rothstein   Photo Editors: Michelle Heimerman, Allie Wist   Art & Design: Chris Cristiano, Bryan Fountain   Development: Alexander Ratner   Social: Emily Schultz   Copy & Research: Brian Carroll, Joseph Hernandez, Greg Robertson   Special Thanks: Bryant Berry, Hilary Cadigan, Christina Chaey, Dawn Davis, Alex Delany, Emma Fishman, Ali Francis, Tiana Gee, Christa Guerra, Elisabeth Jaime, Sarah Jampel, Rebecca Jurkevich, Sue Li, Laura Murray, Adriana Paschen, Alex Pastron, Leticia Sarmento, Amanda Shapiro, Annalee Soskin, Sophie Strangio   Something to Celebrate Story Credits: Food styling by Roscoe Betsill. Prop styling by Amy Wilson. Video shot by Kevin 'GK' Frederick. Edited by Hannah Pak. For Maya Haile: Makeup by Kevin McQueen. Hair by Steven Rice. Styling by Stacey Jordan. Manicure by Trenna Seney. Cake by Flour Shop, NYC. Select ceramics courtesy of Dorchester Industries, a Chicago-based manufacturing platform by artist Theaster Gates. Gucci fabric courtesy of the Dapper Dan atelier in Harlem. Playlist by Rakiem Walker. Shot on location at Brad Lindard’s home in Harlem.", "date": "2020-12-01", "author": ["Condé Nast"]}