{"id": "5d5a054c7ec25240d21b216949abc0d1", "url": "https://www.bonappetit.com/recipe/vietnamese-tomato-salad", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Vietnamese Tomato Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueVietnamese Tomato SaladBy Anthony Ha and Sadie Mae BurnsJuly 1, 20214.7(48)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintOur roving Vietnamese pop-up, Ha’s Dac Biet, always serves a version of this bright, wonderfully herbaceous salad. During the summer months, tomatoes are the perfect match for that acidic, sweet, and slightly-funky dressing, which is inspired by Anthony’s mom’s nuoc cham. She blew our minds when she revealed that her recipe is as simple as equal parts lime juice, sugar, and fish sauce. It hits all the notes, and can truly make just about anything taste better. —Anthony Ha and Sadie Mae Burns, Ha’s Dac Biet, NYCIngredients4 - 6 Servings¼cup sugar¼cup fish sauce (preferably Red Boat or Three Crabs)¼cup fresh lime juice1small fennel bulb, thinly sliced1Persian or kirby cucumber, halved lengthwise, sliced into half-moons1Hungarian wax, Jimmy Nardello, or  green bell pepper, seeds and ribs removed, sliced1small shallot, thinly sliced1½lb. mixed heirloom tomatoes, halved if small, cut into wedges if large2cups coarsely chopped mixed tender herbs (such as dill, cilantro, and/or Thai basil)Freshly ground black pepper⅓cup crushed salted dry-roasted peanuts⅓cup store-bought fried shallotsPreparationStep 1Place sugar, fish sauce, lime juice, and 1 Tbsp. water in a jar. Cover and shake dressing vigorously until combined and sugar is dissolved.Step 2Combine fennel, cucumber, sweet pepper, raw shallot, tomatoes, and herbs in a large bowl; season generously with black pepper. Drizzle ½ cup dressing over and toss salad to combine. Taste and add more dressing if desired.Step 3Transfer salad to a platter and top with peanuts and fried shallots.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Vietnamese Tomato Salad?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI have made this twice (2 days in a row!) with tomatoes from the farmers market and it is so delicious. I highly recommend it!Barb BSan Francisco9/10/2021Wonderful mix of flavors and colors. The fish sauce was not overwhelming. SKH9/9/2021This has great Vietnamese flavors, except I’ve never seen dill in a Vietnamese dish,  I added spearmint leaves, chopped, which made it perfect.Noëlle 505Corrales, NM9/5/2021I know fish sauce is one of the most difficult things to subsitute for, and I’m sure this won’t be different, but… any ideas for how to make this vegetarian? I’m so intrigued!!!CatBoston9/5/2021Delicious! But in the video: why leave those tomatoes in the bowl? Disturbing.Lisa KOyster Bay, NY9/5/2021The essence of fresh, umami, delicate and robust aLL at the same time. Splendid!KPKLA9/4/2021Explore Bon AppétitSaladVietnameseSoutheast AsianAsianHeirloom TomatoTomatoVegetableDillHerbs & SpicesCilantroThai BasilBasilSummerQuickEasySideDairy-FreeGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-01", "author": ["Condé Nast", "Anthony Ha", "Sadie Mae Burns"]}