{"id": "5d61a7f0b8bf01a75a98e22e4fe8654a", "url": "https://www.bonappetit.com/story/caramel-popcorn", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Making Caramel Corn Is Easier Than It Has Any Right To Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaking Caramel Corn Is Easier Than It Has Any Right to BeIt’s caramel corn’s world and I’m just living in it.By Jessie SheehanFebruary 9, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, caramel corn.Popcorn is my everything. Besides the obvious (I snack on it at the movies, while binge-watching Succession, while road tripping, on airplanes), I also consider it a fantastic cocktail snack and an occasional meal. Kids and husband aren’t home? Popcorn for dinner! And while I might not replace an entire meal with caramel corn, I am still a huge fan. In fact, yes, I am that person who considers one of those large metal tubs—the kind gifted around the holidays—a really good time (and an excellent present to boot, if you’re ever wondering what to get me).But you don’t need the metal tub to satisfy a salty-sweet-crispy caramel corn craving. Just whip up a batch of the homemade stuff—which is a billion times easier than you’d think—and you’ve got the ultimate snack. It calls for only a handful of ingredients (which are all likely in your pantry right now), is a cinch to assemble (particularly when using my streamlined, thermometer-less method), and makes a whole bunch. Give it to neighbors or teachers of friends or hoard it all for yourself. I won’t tell anyone. It keeps for days, so you can make some, eat some, save some, and then eat some more. And yes, it is also nothing short of an excellent snack at wine o’clock.Here’s how to make my caramel corn:Heat your oven to 250° F and prepare a baking sheet by lining it with parchment paper and securing that paper at each corner with a little cooking spray. Next, make 10 cups of unsalted popped popcorn. You can do this (my favorite way) by microwaving ½ cup unpopped kernels in a large microwave-safe bowl covered with a microwave-safe plate on high for 6–8 minutes depending on the strength of your microwave. Or, if you’re not as fond of your microwave as I am, you can place ½ cup unpopped kernels and 1 Tbsp. vegetable oil in a large, covered pot on the stovetop over medium heat and pop away, shaking the pot over the flame periodically. (More details here, if you need them.) Transfer the popped corn to a large bowl.Now it’s caramel time. In a medium pot over medium-high heat, bring 1 cup light brown sugar, ¼ cup Lyle’s Golden Syrup or light corn syrup, 2 Tbsp. molasses (which will give the corn a little bit of a Cracker Jack feel), and 10 Tbsp. unsalted butter to a boil, stirring occasionally with a rubber spatula. Let the caramel boil without stirring until thick and fragrant, about 3 minutes. Now take the pot off the heat and whisk in 1 tsp. Diamond Crystal kosher salt, ½ tsp. baking soda, and 2 tsp. vanilla extract. Pour the caramel over the popcorn and stir to coat.Scrape the coated corn onto the prepared baking sheet—you’ll need to pile it on—and bake, stirring every 20 minutes, until the caramel has darkened slightly and the popcorn is dry to the touch, about 1 hour. Let the caramel corn cool to room temp before giving it away in cute little bags, serving it in a large bowl, or indulging straight from the baking sheet. But regardless of whether you share it with your pals or eat every last kernel solo, consider yourself warned: Caramel corn this good and this easy will be made again (and again, and again).Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-09", "author": ["Condé Nast", "Jessie Sheehan"]}