{"id": "5d66f6c14c3a5b6d903dfa39a3d250f0", "url": "https://www.bonappetit.com/story/toppings-on-soup", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "If You Aren't Putting Toppings on Your Soup, Are You Really Living? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Aren't Putting Toppings on Your Soup, Are You Really Living?Watch a bowl of lackluster soup magically transform into a thing of beauty.By Alyse WhitneyOctober 19, 2018FacebookTwitterEmailFacebookTwitterEmailSoup is delicious and comforting, but it’s not known for being exciting. So often, soup recipes end up feeling like a thrown-together meal of meat, vegetables, beans, noodles, all hanging out in a hot tub of broth. (That sounds like a weird episode of The Bachelor.) But with a few toppings and swirl-ins, it can be zhuzhed up into a beautiful, extra flavorful bowl that is ready for the spotlight, transforming in front of your eyes like Mia Thermopolis in The Princess Diaries.But where do you start? There are a handful of categories that you can pull from: crunchy, creamy, rich, or fresh and herby—or all four. Take our new black bean soup recipe, for example. We topped that with a handful of Fritos corn chips, a dollop of chile-lime crema, diced avocado, red onion, and cilantro. Maybe that was overachieving, but just look at it. It is a whole lot more appetizing than a bowl of murky black beans, and now all those flavors can dance on your tastebuds as if you’re having a full-on Taco Tuesday in one bowl of soup.With that beautiful watercolor portrait of fully-loaded black bean soup in mind, here are our pillars of soup toppings, with some ideas to soup up your soup night.CrunchyWe’ve already discussed Fritos, but any tortilla chip will do, especially for bean soups or, well, tortilla soup. Crushed up potato chips on top of potato soup would be a potato inception, corn nuts could complement a corn chowder, or good ol’ crackers (oyster, buttery Ritz, saltines) are a good standby. Some spiced nuts (like these sambal cashews!) or toasted breacrumbs would be nice on a creamy soup, or even some crispy grains like buckwheat on top of cauliflower soup. To take things to the next level, you could make bacon croutons for your split pea soup, cheesy toast on French onion soup, or grilled cheese croutons for tomato soup.Chives, Greek yogurt, and olive oil top this easy squash soup.\nPhoto by Alex LauCreamyA good swirl of yogurt, sour cream, or creme fraiche will make any soup look more mesmerizing and appetizing, and add a contrasting tangy flavor. We like yogurt on top of coconut lentil soup and simple squash soup to keep them from being just a big spoonful of pureed veg.RichYou may argue that something creamy is rich, but this is more about a nice finishing note like a drizzle of good olive oil, chunks of avocado, or a hefty sprinkle of Parmesan cheese on low-commitment wedding soup (that gets panko on top for extra crunch). Sometimes you need a little extra decadence. And though this is a very herby idea—more on that below—a dollop of pesto has a few categories in one, with nuts, herbs, garlic, and cheese packed in one flavor bomb.Ooooh, look at those breadcrumbs and Parmesan cheese hanging out on low-commitment wedding soup.\nPhoto by Chelsie CraigFresh and HerbyThis can be a squeeze of lemon or lime to brighten up a bowl, or making it rain herbs like chives, scallions, cilantro, parsley, or dill. We’ve also used fennel fronds (which look like dill but are more vegetal in flavor) for a subtle flavor and pop of green, or finely chopped shallot or red onion when you want a little more of a contrasting bite. For a little spice, try infusing chiles into oil and drizzling on top. There is no limit to the amount of toppings you can put on your soup—you just might need a bigger bowl if you go too hard.About that bean soup:Basically Black Bean SoupFew ingredients have such a stellar deliciousness-to-affordability ratio, and the best part about starting a soup with dried beans is that they create their own incredibly savory broth as they cook.View RecipeExplore Bon AppétitBasicallySoupToppingRead MorecookingThis Genius No-Soak Black Bean Soup Makes Its Own Delicious BrothBy Christina ChaeycookingLazy Squash Soup Is Made for Rent WeekBy Alex DelanycookingA Good Ladle Is Worth Its Weight in Gold (or at Least Stainless Steel)By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-19", "author": ["Condé Nast", "Alyse Whitney"]}