{"id": "5d6bd873fda149cd5a54600fc5fcd6d9", "url": "https://www.bonappetit.com/recipe/cheesecake-cake", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Cheesecake-Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCheesecake-CakeBy Sohla El-WayllyOctober 23, 20204.2(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl Jones, Prop Styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintThis cheesecake has a vanilla pound cake base, because why the hell not? You bake the cheesecake first, then the pound cake on top, and flip the whole thing over before decorating and serving. Room temperature eggs, cream cheese, and butter are vital to an evenly mixed cheesecake and fluffy pound cake. If you’re in a hurry, place the eggs in a bowl of hot tap water and zap the butter and cream cheese in the microwave in 10-second increments to quickly warm them up.IngredientsCheesecake1Tbsp. unsalted butter, room temperature4large eggs, room temperature38-oz. packages cream cheese, room temperature1cup (200 g) sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1cup sour cream2tsp. vanilla extractPound cake and assembly1cup (200 g) sugar7Tbsp. unsalted butter, room temperature¼tsp. baking powder¼tsp. kosher salt1large egg, room temperature¼cup sour cream1tsp. vanilla extract¾cup (94 g) all-purpose flour, siftedMatcha, unsweetened cocoa powder, finely ground freeze-dried fruit, finely ground instant coffee, ground turmeric, ground cinnamon, and/or powdered sugar (for serving; optional)Fresh fruit (for serving; optional)PreparationCheesecakeStep 1Place a rack in lower third of oven; preheat to 350°. Brush an 8\"- or 9\"-diameter cake pan evenly with butter. Line bottom with a parchment paper round, then line sides with a 4\" parchment collar (this cake will rise up the sides, so yeah, it needs to be 4\" high), making sure the ends overlap by at least 3\". (Take your time to smooth out the parchment because every wrinkle will show up in the final cheesecake. Or crumple the parchment fully before lining the pan and go for an intentionally wrinkled cheesecake.) Place a wire rack in a roasting pan or scrunch up foil to make a ring for the cheesecake to rest on since you want a layer of water between the roasting pan and cake pan. Bring a large pot of water to a boil.Step 2Separate yolk from 1 egg over a small bowl to catch egg whites. Place egg yolk in another small bowl; set egg white aside for making pound cake. Beat cream cheese, sugar, and salt in the bowl of a stand mixer fitted with the paddle attachment on medium-high speed, scraping down sides of bowl halfway through, about 3 minutes. Mix in sour cream until combined. Add remaining 3 eggs one at a time, scraping down bowl after each addition, then add egg yolk and vanilla and mix just to incorporate. Scrape batter into prepared pan; reserve bowl for making pound cake. Tap cake pan firmly against counter to eliminate any air bubbles in batter. Place into prepared roasting pan and slide onto oven rack. Pour boiling water into roasting pan to come halfway up sides of cake pan. Bake until cheesecake is mostly set and only wobbles slightly in the center, 30–40 minutes.Pound cake and assemblyStep 3While the cheesecake is baking, beat sugar, butter, baking powder, and salt in reserved bowl (no need to wash it out) with mixer on medium-high speed until pale and very fluffy, 6–8 minutes. (You might think it’s done before that time, but keep going all the way). Scrape down sides of bowl, and beat in egg, then reserved egg white, scraping down bowl after each addition, until incorporated.Step 4Five minutes before cheesecake is done baking, add sour cream and vanilla to pound cake batter and beat just to combine. Add flour and mix with a rubber spatula just to combine.Step 5Remove cheesecake from oven and gently dollop pound cake batter all over top of cheesecake with a spoon. Use spoon to delicately smooth surface, taking care not to push into cheesecake. Bake until cake is deep golden brown (it should be very dark) and bounces back when gently pressed in the center, 35–40 minutes. (This cake is very moist, so it’s better to overbake rather than underbake it.) Remove cake pan from water bath and let cheesecake cool 30 minutes (just so it’s not piping hot). Transfer to the fridge and chill at least 3 hours.Step 6For the best texture, let cheesecake sit at room temperature 30 minutes before serving. Run an offset spatula or butter knife along inside of pan to loosen cake. Place a large plate upside down over cake and flip pan and plate over to turn cake out onto plate. Peel away parchment and dust top of cheesecake with powder of choice if desired. For clean slices, cut with a knife dipped in hot water, wiping blade clean between each cut. Serve with fruit if desired.Step 7Do ahead: Cheesecake can be made 5 days ahead. Tightly wrap and chill, or freeze up to 1 month.How would you rate Cheesecake-Cake?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI love the flavor of this cheesecake / poundcake combination, but I do think making in a springform would make it way easier. MLBrooklyn, NY12/25/2020Could this be made using a Spring Form pan?  ThxLizPhila, PA12/3/2020This Cheesecake cake may be the best thing I have ever made! It was perfect between the weight and denseness of the cheesecake to the pound cake and how beautiful it came out of the pan, I immediately began thinking when and for what event could I make this again.  I think I will add a little pumpkin and do it for Thanksgiving.\nAlisaDallas, TX11/21/2020Explore Bon AppétitCheesecakeCakeDessertCream CheeseCheeseSnackNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-23", "author": ["Condé Nast", "Sohla El-Waylly"]}