{"id": "5d7410c4915147662822f869b7a5df34", "url": "https://www.bonappetit.com/story/dana-perino-queso-recipe", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "BTW Dana Perino, That’s Not How You Make Queso | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBTW, That’s Not How You Make QuesoWe’re not gonna not talk about this Super Bowl mishap right?By Emily SchultzFebruary 4, 2019FacebookTwitterEmailLaura MurrayFacebookTwitterEmailI watch the Super Bowl every year not because I enjoy sports, not because I even understand sports, but because I have extreme FOMO as an incredibly online person. Oh, and I love buffalo chicken dip.I spent my Sunday in three parts. One part complaining about Adam Levine and Michael Buble (@ me I dare you), one part dipping celery and tortilla chips into buff chick dip, and one part on Twitter. The last part is when I came across this deeply horrifying photo of queso.Twitter contentThis content can also be viewed on the site it originates from.The abomination in question was made by Dana Perino, a Fox News anchor AND former press secretary to George W. Bush. Yes, that George W. Bush—the one from Texas! The land of large things! And queso! It took approximately 10 seconds for Twitter to collectively freak out (queso was one of the platform’s top trends last night) and gain Dana Perino national queso fame (infamy?).Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.Twitter contentThis content can also be viewed on the site it originates from.After all of this, Dana posted an ingredients list of what went into this witch’s cauldron of cheesy dip. Are you ready for this?VelveetaRotelCream of mushroom soupCream cheeseSausageBaconHeavy creamDiced jalapeñosFresh tomatoCilantroSo yeah, all of these ingredients check out… EXCEPT the third one. Cream of mushroom soup? In queso? What? But I digress.More importantly is WHY the queso looked like the contents of a singed porta-potty after Burning Man, and not a golden bath of the queso we know and love. So I consulted food director Carla Lalli Music. I warned her of what she was about to see, but the terror in her eyes was visible. And she had a few things to say.First: Including bacon AND sausage meant all this extra fat was sitting around in the crock, slowly exuding from the meat products with nowhere to go but up. My favorite queso recipe, the Bob Armstrong version developed by Rick Martinez, solves for this by cooking the ground meat separately, and using a slotted spoon to bring it into the cheese, leaving the rendered meat fat behind.Second: We can see that there’s some residue left on the sides of the pot. That suggests Dana kept the heat on, leaving the queso to reduce (since there’s no way anyone was eating it). In order to have a deliciously smooth, uniform queso from top to bottom—and not a filmy, oxidized crust—you need to keep up the emulsification. When you leave the heat on, the water evaporates, the fats separate, and you get a texture that looks more like unloved sheet pan than a creamy dreamy queso.Carla’s tips for a perfect queso? Be mindful of how much meat you’re putting in, always be stirring, turn off the heat, and simply cover with a lid when you’re done cooking.Dana, just DM us next time you need some cooking tips.In case you’re inspired to make queso—and tweet about it:Bob Armstrong Chile con QuesoA legendary layered dip from Matt’s El Rancho in Austin, Texas, of taco meat, queso, guacamole, sour cream, and pico de gallo.View RecipeExplore Bon AppétitSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Emily Schultz"]}