{"id": "5da5832abd21ae0795e960dabb98072a", "url": "https://www.bonappetit.com/story/all-about-plantains", "year": 2019.0, "month": 12.0, "day": 5.0, "content": "How to Cook Plantains, the Banana's Much Starchier, More Versatile Cousin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingName a Fruit More Versatile Than a Plantain And I'll Give You a CookieWhether they're green or black, plantains can do it all. By Emma WartzmanDecember 31, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailMany fresh ingredients go from unripe (inedible) to perfectly ripe (fantastic) to overripe (again, inedible)—and sometimes this all happens in the blink of an eye. (Looking at you, avocados.) But plantains, which are related to bananas but much more versatile, are an exception: They’re tasty from when they’re picked (rock-hard and green as grass) until they reach peak ripeness—you’ve just got to know how to use them at each stage.Let’s start with unripe plantains, which have rigid green skins. (The skin of a green plantain is so tough that it’s not easy to peel. You’ll need to score the plantain along its ribs, then pull of the skin strip by strip.) The interior is firm, starchy, and not at all sweet—more similar to that of a raw potato than a banana.Fry thin slices of green plantains to make plantain chips, or cut thicker circles or ovals for tostones, the crispy, twice-fried snack eaten across Latin America and the Caribbean. Smash fried green plantains with garlic, olive oil, and fried pork skin for mofongo, a beloved dish in Puerto Rico, the Dominican Republic, and Cuba. Green plantains can also be grated and turned into fritters, braised in broth, or cut into pieces and added to soup, which they’ll thicken with their natural starches.Green plantains are destined for tostones. \nPhoto by Alex Lau, Food Styling by Yekaterina Boytsova As plantains ripen, they turn yellow, then develop some brown spots, and eventually (really, this can take weeks) reach peak ripeness, at which point they’re very dark brown, nearly black. The change in color indicates that the starches on the inside are converting into sugars and the flavor is getting progressively sweeter, though still earthy and vegetal. Their insides soften, veering into sticky and even syrupy territory, and the skin thins, making the peeling process slightly easier.Caramelize ripe plantains to make maduros. \nPhoto by Laura Murray, food styling by Judy Mancini.When a plantain is anywhere from decidedly yellow to deeply black, you can still deep-fry or pan-fry them, but what you’ll get is something entirely different: maduros (which translates to “mature” or “ripe” in Spanish). Because their sugar content has increased, the plantains will have caramelized edges and pudding-soft insides. Ripe plantains can be simmered or roasted, then mashed, or sliced and grilled, or roasted whole, then split open and topped with butter and herbs or brown sugar.Now that’s one fruit with so much to give!Start with tostones:Tostones With Creamy Green SauceThe double-fried, extra-crispy plantains will never be as good as they are immediately after coming out of the hot oil, but you can hold them in a warm oven if absolutely necessary.View RecipeExplore Bon AppétitPlantainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-29", "author": ["Condé Nast", "Emma Wartzman"]}