{"id": "5da87f31fcf43a4a52291ae68d8a00cf", "url": "https://www.bonappetit.com/recipe/matcha-dipped-strawberries", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Matcha-Dipped Strawberries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueMatcha-Dipped StrawberriesBy Claire SaffitzMay 22, 20184.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintMatcha and sesame seeds take these strawberries to a place chocolate-dipped berries only dream of. You won't stop at just one.IngredientsMakes 15–202oz. white chocolate, chopped¼cup virgin coconut oil, melted1tsp. matchaPinch of kosher salt20chilled large stem-on strawberries, patted dryBlack and white sesame seeds (for serving)PreparationStep 1Stir white chocolate, oil, matcha, and salt in a medium heatproof bowl set over a saucepan of simmering water (don’t let bowl touch water) until nearly smooth. Remove from heat; stir until chocolate is melted. Set into a larger bowl of ice water and chill, stirring constantly, until thickened and just starting to lose its sheen, about 2 minutes.Step 2Working one at a time, hold berries by stems and dip into matcha mixture to coat; let excess drip back into bowl. Place on a parchment-lined baking sheet and sprinkle with sesame seeds. (Depending on their size, you will be able to coat 15–20 berries.) Reheat matcha mixture if it starts to set before you have dipped all the berries. Chill dipped berries until shell is set, 20–25 minutes.How would you rate Matcha-Dipped Strawberries?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThe person from Austin, TX didn't know that chocolate chips have less cocoa butter than regular chocolate bars before they gave a crap review. This recipe works great if you choose to use a bar or even wafers.AnonymousAtlanta, Ga5/29/2019Obsessed. Such a fun idea for valentine’s day or spring! l.hg7Louisville, KY2/8/2019This recipe simply didn't work. The white chocolate did not dissolve in the coconut oil, no matter how hard i stirred. As a result it was impossible to get an even coating on the strawberries, so I had to resort to dripping and smearing it on with a spoon. Tasted great but didn't look pretty. Perhaps the chocolate I used (Tollhouse chips) was different from what the author used.AnonymousAustin, TX7/23/2018Explore Bon AppétitFruit DessertDessertMatchaOther IngredientsChocolateSpringSummerEasyGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}