{"id": "5db8ace2a4cc081bc6243c901d81cc90", "url": "https://www.bonappetit.com/story/jersey-shore-food-moments", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "You Can Keep Your IG Cooking Demos, I’m Watching Jersey Shore for All My Food Content | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Can Keep Your IG Cooking Demos, I’m Watching Jersey Shore for All My Food ContentIt’s wacky AF.By Emily SchultzMay 1, 2020FacebookTwitterEmailFacebookTwitterEmailWe here at Bon Appétit have been talking a lot about where we’re finding comfort in these “strange and uncertain times.” There are the recipes we’re cooking (and that our readers are cooking), the new habits we’re forming, the workouts keeping us sane, Zoom happy hours with friends, and the baking projects we’re planning out for the days (weeks? months!?) to come. Chief among these soothing remedies for me? Endless reruns of Jersey Shore.That’s because everything about this perfect specimen of a reality TV show is comforting and familiar to me—and it’s not just because I’ve watched every one of the 71 episodes (six seasons, folks!) at least once already. It’s true that right now, the last thing I’m looking for is a mid-film plot twist or surprise clowns jumping out in the final scene. What I do want are the boisterous families that remind me of my own, the beautiful beaches I can’t visit any time soon, and, of course, the pounds and pounds of chicken cutlets and salads doused with bottled dressings that I can watch them enjoy. Yes, I want to RELATE. And as an Italian-American from New Jersey, it should come as no surprise that I do.So, in no particular order, here are some of my favorite food moments from Jersey Shore, which is making me happier than nothing else can right now.If possible, thaw your burgers in the fridge overnight. \nMTVWhen Ron Grills Turkey Burgers, Parchment Paper and AllLet me set the scene: The Roommates just came back from a night of drinking and wanted a snack. A mood. (I had a phase where I made cacio e pepe after a night out. Not trying to flex, just being real.) So Ron forgets to defrost the turkey burgers, rips open the box, and puts the entire block of meat on the grill as one burger mass. That includes the parchment paper that separates each patty. He somehow manages to remove it before it all goes up in flames, which is a true feat of drunk magic.Nothing is more sobering.\nMTVWhen Snooki Buys a Jeroboam and Immediately Breaks ItIn Season 4, Snooki spots an extremely old Jeroboam of wine that she must have. If you’re unfamiliar, a jeroboam holds 4.5 liters, which is equivalent to six bottles of wine. As soon as she steps onto the street, it breaks. I feel you Snooki! One time, I had a bottle of wine in a paper bag. But it was raining and the bag broke and the bottle shattered all over Broadway Avenue in Williamsburg, BK. I still think about what could have been, so I feel for her.Again, please tip 20%. \nMTVWhen Mike Tips the Bagel Delivery Guy With a Protein ShakeThere are actually a couple of things I’d like to bring up about this scene. Mike orders bagels for the hungover roommates and cannot find his, nor anyone’s, cash to tip the delivery person. So what’s a guy to do? He tips him with...a protein shake. Don’t order food if you can’t tip, and always give them at least $5! The other thing I need to bring up about this scene is the fact that Pauly D orders a chocolate chip bagel. I take bagels very seriously, in that the only acceptable bagels are everything, sesame, and pumpernickel. Absolutely, under no circumstances will I eat sweet bagels. Cinnamon raisin toast is acceptable in very specific circumstances, but sweet bagels are never okay. And I will not be listening to any further arguments on the subject!We have a few great recipes too. \nMTVWhen Snooki Asks Her Ex-Boyfriend How to Make Penne Alla VodkaIn any culture where Grandmas hold serious power in the kitchen, there are hardly ever “recipes.” A pinch of this, a splash of that—you get it. In Snooki’s case, it isn’t her grandmother who has the keys to her favorite penne alla vodka. No! It’s her ex-boyfriend’s grandmother. Well, seeing as she has zero shame whatsoever, she rings up her ex, and the girls decide to make dinner for the roommates. (Spoiler alert: the Miami Fire Department is called.) Maybe instead of “you up?” people should try, “Hey, can you give me your grandmother’s vodka sauce recipe?” Would love to know if that works!An iconic moment in history. \nMTVWhen Snooki Single Handedly Turned Fried Pickles Into a Food TrendMaybe it’s just coincidence, but I distinctly remember a correlation between Season 2 of Jersey Shore and the number of fried pickles showing up on the menus at all the greasy bars I frequented in college. (The background: Snooki and Jenny road trip from New York to Miami, stopping along the way at all of the kitschy rest stops in between. They discover fried pickles at one of them.) Did anyone take time to think of her cultural influence? To give credit to a major American restaurant trend where credit was due? Well if not, you heard it here first.Bonus RoundIt would be unfair to write this article and not include the POV of my two sisters, people who know the ins and outs of Jersey Shore better than I do. So below are their favorite scenes.Is this considered a salad?\nMTVHaley: When Snooki and Deena Eat a Single Pepper For DinnerThis scene really embodies the friendship between Snooki and Deena. So in their own world, they lose total regard for everything around them. They show up to dinner three hours late with a cocktail in hand. You’re led to believe the “meal” they consume after a day of drinking is the garnish left on the empty plates: a single pepper. Really? But you know what? They’re having a ball. They’re playfully screaming and dancing like they’re at their favorite nightclub, Karma, rather than in a fancy restaurant in Italy. Good for them.Rub it with oil and salt and bake it first! \nMTVMolly: When Snooki Eats a Raw Russet PotatoSomething I love about Snooki is her confidence, especially when it comes to food. Drinking pickle juice at all times. Thinking it’s totally normal and fine to funnel a beer at work. But it really comes through in this scene where she eats a raw potato. She appears to pull a russet out of the fridge (no need to store these there btw, they’re fine in your pantry!) and bites right into it. I’ve definitely cooked my fair share of potatoes well and poorly, and I’m just wondering how she even did this. Did she know it wasn’t cooked? Whatever, she just totally went along with it like it’s something she’s been doing her entire life. Genius.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast", "Emily Schultz"]}