{"id": "5dc760eb7391d717303311cc2a50d0b9", "url": "https://www.bonappetit.com/recipe/sugar-snap-pea-salad", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Sugar Snap Pea Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueSugar Snap Pea SaladBy Claire SaffitzApril 17, 20185.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintCome springtime, sugar snap peas are so tender and fresh it’s almost a shame to cook them. We prefer slicing them thinly and eating them raw with a simple dressing, like this creamy, tangy buttermilk one. If you can find them, use tender, first-of-the-year peas in this raw salad; they can get starchy and tough later in the season.Ingredients4 servings¾cup buttermilk3Tbsp. plain whole-milk Greek yogurt2Tbsp. fresh lemon juice1small garlic clove, finely gratedA large pinch of kosher salt8oz. sugar snap peas, strings removed, thinly sliced2Tbsp. extra-virgin olive oil, plus more1tsp. finely grated lemon zest, plus moreFlaky sea saltFreshly ground black pepperPreparationStep 1Whisk buttermilk, yogurt, lemon juice, garlic, and a large pinch of kosher salt in a medium bowl. Toss sugar snap peas, 2 Tbsp. oil, and 1 tsp. lemon zest in another medium bowl; season with sea salt and pepper.Step 2Pour dressing into a shallow bowl and pile sugar snap peas in the center. Drizzle with more oil, season with more pepper, and top with more lemon zest.How would you rate Sugar Snap Pea Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleSo easy and just a bright and cheery, springy way to enjoy snap peas.  So crisp and fresh...amazing!  slattrezWoodbury, MN5/15/2019So delicious! And surprisingly filling.\nWill definitely make this again and again!\nCan you prepare the snap peas ahead of time?AnonymousNew York5/9/2019I had this at a restaurant and loved it—now I can make it.  Thank you!  And I just bought 2 copies of Carla’s new book. One for me and one for my niece.  It’s a great book!!!chefgailSouth Carolina 5/2/2019So unassuming, but delicious!  I'll be making this again and again.Lu_Ahrensnewport beach9/3/2018Wow!  The sweet peas with this tangy, creamy, fresh dressing were a delightful surprise!  I didn't have buttermilk, so I used milk with a teaspoon of cider vinegar - worked perfectly.  I would have never thought to slice these peas raw for a salad.  Merci, bon appétit !MafrankPhoenix,AZ5/14/2018Explore Bon AppétitSaladAmericanSugar Snap PeaPeaVegetableButtermilkOther IngredientsSpringQuickEasySideGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Claire Saffitz"]}