{"id": "5ddde53d66293e4337443cf31c89c5cd", "url": "https://www.bonappetit.com/story/how-to-use-bruised-fruit", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "How to Make the Most of All Your Bruised Fruit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Give Your Bruised Fruit the Second Chance It DeservesIt’s destined for greater things than the garbage. By Priya KrishnaSeptember 2, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailYou’re at the farmers market. Look at all the peaches! And blueberries! And tomatoes! You buy it all! And then, a few days later, you’ve eaten only a quarter of your stash and the rest is starting to brown. I’ve been there.So have many members of the BA staff. But there’s plenty you can do to salvage those bright flavors. Here are some of our favorite ways to get the most out of fruit that’s juuust passing its prime.Healthyish assistant editor Aliza Abarbanel takes inspiration from this Instagram post from cookbook author Amy Chaplin and blitzes her bruised peaches into a peach-chia breakfast shake. It’s as easy as tossing almond milk, peaches, and vanilla into a blender, topping with chia seeds, and chilling overnight. The ideal breakfast.For editorial assistant Jesse Sparks, a lightly macerated fruit salad tossed with salt, sugar, black Urfa chile pepper, and cinnamon makes lackluster fruit taste “delightfully bright and complex.” “To go one step further,” he adds, “you can even split your cut fruit measurements in half and only macerate one half of the bunch. This way some chunks are riper and softer, while the other half feels a bit more crisp and fresh against the macerated portion. It’s a bit of a psychology trick to make even bad fruit taste great.” Brilliant.“This is boring,” writes Basically editor Sarah Jampel, “but I most often make shrub!” Frankly there’s nothing boring about a shrub, a tangy and refreshing concentrate of fruit, vinegar, and sugar that can be drunk by itself or in cocktails. Jampel loves Al Culliton’s easy method, which simply requires letting all the ingredients hang out for a few hours in a tightly sealed jar.The solution to bruised fruit is always compote for associate editor Christina Chaey. Here’s her method: “Simmer chunks of bruised fruit with water or fruit juice (like fresh orange juice), sweetener like sugar/honey/maple syrup, a spice or two if you want (cinnamon, cardamom, star anise) until it completely breaks down and becomes jammy.” Use it to top yogurt, spread on toast, or blend with a smoothie.“I usually just bake it, since it would get broken down and squishy anyways,” says digital restaurant editor Elyse Inamine. One of her favorite bakes is these blueberry hand pies by food stylist Sue Li. “The crust-to-fruit ratio is perfect,” she says, and they are also the perfect portable treat for a picnic.Bruised tomatoes are no big deal for senior staff writer Alex Beggs—she just turns them into this grated tomato sauce, courtesy of the chef Ashley Christensen. The grating method is ingenious—it eliminates the mess that often comes with slicing tomatoes and skins them too, leaving you with uniformly shredded bits. No one will ever know you started with a bruised tomato.BA.com editor Sasha Levine macerates her bruised berries and eats them with whipped cream for dessert (or breakfast). The salt and sugar amplify the flavor of even the most bruised fruit, and when you’re macerating, “everything gets a little soft and mushy,” she says, “so who’s to know they started out a little less than perfect?”And finally, associate editor Hilary Cadigan keeps it super simple. “I just make smoothies. So many smoothies.” Cadigan pro tip: Add kale powder and tell yourself you are very healthy!Explore Bon AppétitFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-13", "author": ["Condé Nast", "Priya Krishna"]}