{"id": "5de3c7d8d9b136111e529f7ea55de9cf", "url": "https://www.bonappetit.com/story/jon-hamm-diet", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Jon Hamm Eats Super Healthy But He Can't Resist This Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJon Hamm Eats Super Healthy But He Can't Resist This DessertHe's a St. Louis guy, after all.By David WaltersJanuary 25, 2018FacebookTwitterEmailFacebookTwitterEmailUnlike a certain iconic character whose idea of dietary mindfulness was no brown liquor before noon, Jon Hamm has a slightly more restrained approach. “You know, I try not to eat garbage,” says the star of this month’s indie drama Nostalgia. Here, he talks with David Walters about aging, craft services, and the St. Louis staple food that makes him nostalgic.Are you a healthyish eater?Jon Hamm: I think I am. You know, it sounds sort of crappy to say it, but most of the food that we are presented with has been processed to within an inch of its life, so it's not exactly the most healthy thing you can eat. So I try to eat as fresh as I can, and try to stay away from as much of the cheap stuff as I can, too. I'm not above eating a packet of potato chips or something every now and again, but I do try to make those occasions more of a stand-alone rather than habitual.Is there any secret to eating well when you’re on location?JH: I try to eat as healthfully as I can. There are always options that are snacky, but mostly it’s about self-control. Most of shooting is really just waiting around, unless you’re working on an action film where you’ve got to train. So you don’t really need that much energy; the crew is the one that needs the energy. Don’t eat like an idiot—I think that’s a good rule of thumb.Is there anything like juicing that worked for you? Or is it really just healthy moderation across the board?JH: You know, for me, it’s really just about moderation. I like a nice juice. I like fresh fruit and vegetables. Those are the things that I kind of gravitate toward, just from a lifestyle standpoint, so the fact that they also happen to be healthy is great.Do you have a go-to breakfast?JH: That Icelandic yogurt Siggi’s is really good and not too sour. I usually mix in some raspberries or blueberries and a little granola. And, if I have a little more time, I'll make bacon and eggs. I like to have something in my stomach in the morning because just coffee can be a little bit daunting.Let’s briefly hit on the “ish” part of healthyish. Do you have any food vices?JH: Well I do like a doughnut.  I used to be able to house half a dozen doughnuts and not think about it because I was a three-sport varsity athlete and a kid. But I think part of becoming over 40 is realizing that you can’t eat the way you used to eat if you want to be healthy at all. Your metabolism slows significantly and your body just changes. You know, you get out what you put in. And if you don’t watch it, you’re gonna be on the wrong side of that equation. But I do like a donut every now and then—I’m treating myself.I want to make a final, very labored connection to Nostalgia. Is there any food that makes you nostalgic?JH: This is gonna kind of go counter to everything that I've just said, but St. Louis has a very specific culinary tradition—we have this great stuff called frozen custard. There's a place called Ted Drewes in St. Louis, and it’s basically an ice cream store that’s been around for the better part of a hundred years. But it’s frozen custard, so there are even more calories in it. Danny Meyer included frozen custard in his Shake Shack menu, and Danny’s a St. Louis guy. We went to high school together. That’s probably the food that gets me going the most.This mousse is a little healthier than frozen custard:Coconut-Chocolate MousseChoose a chocolate that does not exceed 64% cacao for a mousse with the smoothest texture. If you want the mousse to be fully non-dairy, look for a vegan chocolate bar, though the flavor may differ slightly.View RecipeExplore Bon AppétitHealthyishCelebritiesBreakfastYogurtInterviewsRead MorecultureHow Samira Wiley Practices Self-Care After a Long Day on the 'Handmaid's Tale'By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "David Walters"]}