{"id": "5df11e7ef6d92c003708247a5facaf8d", "url": "https://www.bonappetit.com/story/best-charred-sweet-potatoes-garlic", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "I’m Never Not Making This Sweet Potato Dish Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Never Not Making This Sweet Potato Dish AgainBrown-butter-and-honey-glazed sweet potatoes paired with an insanely garlicky puree make a perfect sweet-hot-spicy bite.By Carla Lalli MusicNovember 29, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I have sweet potato regretThere’s a saying in my family that my mom definitely invented called “not-shopper’s regret.” It’s when when you see something in a store that you like and want—say, the perfect shoe in your size—but then, for whatever reason, don’t buy. And then you regret it, and it becomes a torture and a torment. The lesson is that it is better to have shopped and returned than never to have shopped at all. Remember that.Want this letter before it hits the website? Sign up for our newsletter!Right now I am in the throes of “not-cooker’s regret” and it’s because we didn’t make these twice-cooked sweet potatoes for Thanksgiving. I know! I should just be grateful the bloating has gone down and happy that my socks aren’t leaving deep elastic crease marks in my calves anymore. But no—I’m in deep sweet potato turmoil, and it’s all my fault.Last year, my dear colleague Andy Baraghani was working on the recipe for these alt-sweet potatoes right around the time that my Thanksgiving planning was underway. Because I loved them and because I wanted to do something different, I put them on our menu.There are a million reasons why this dish could have scandalized several family members and had me banished from hosting for life. First of all, we already have a sweet potato dish we all love, a chipotle-spiked puree that my aunt makes, and no one in my family likes change. Secondly, the sweet spuds Andy was working on were baked, charred, and glazed with brown butter and honey before being served on top of an insanely garlicky puree called toum, which can cause fire-breathing in otherwise healthy adults. The whole situation is topped with nigella seeds, which look at first glance like black sesame seeds but taste a little bit like onion-pepper sprinkles. Let’s just say it’s wasn’t a very predictable addition to our Thanksgiving menu, which is harder to exert influence over than a hysterical toddler during a tantrum. But: my house, my rules. They made their debut.Look at all the colors of sweet potatoes available to you.\nPhoto by Kristin TeigThe surprise was that everyone loved them. Like, love loved. My father, the stubbornest of us all, couldn’t stop with these sweet potatoes. He said things like, “Oh we always have to have those,” and “Everything was great, but that sweet potato dish!” I told Andy all about it.And then, what happens: A year goes by and everything that was good became meaningless and forgettable?? I guess so, because I didn’t care enough to lobby for last year’s breakout star, and now I can’t stop thinking about the way the honey sticks to the charred surfaces, so that they’re kind of chewy and creamy at the same time. I miss the way you can drag a forkful of fluffy potatoes through the toum to get a perfect sweet-hot-spicy bite. I have special regrets about the way the narrow end of the sweet potato gets extra roasty and brown and candy-ish in the oven. And basically I’m just mad about everything. This is what it’s like to have not-cooker’s regret.And that is why, now that the holidays are over and I am in charge of my everyday eating menu, I’m going to do what’s right. I’m going to cook these sweet potatoes tonight, and again this weekend, and another night next week, and for when people come over, and whenever the sweet potatoes are looking good at the market, and also for meal prep on Sunday, and any other time I please. I made a mistake this one time. All I can do is try to make it up to myself.Get the recipe:Twice-Cooked Sweet Potatoes with ToumExplore Bon AppétitCarla NewsletterSweet PotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-29", "author": ["Condé Nast", "Carla Lalli Music"]}