{"id": "5e05c7ab9da1318779e9672b5857cf95", "url": "https://www.bonappetit.com/story/probiotics", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "What Are Probiotic Supplements and Which Ones Should I Take? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat’s the Deal with Probiotics and Which Ones Should I Take?Are the refrigerated ones really worth it? We asked some experts.By Aliza AbarbanelMay 7, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailSince \"gut health\" became the buzzphrase of the wellness world, it feels like everyone is taking probiotic supplements. There are a lot of pills on the shelves, teeming with live bacteria, each designed to fill a specific need or lifestyle. So yeah, we have questions. Are refrigerated probiotic supplements better? Do specific strains matter? And can’t we just drink more kombucha and be done with it? We turned to Probiogen research microbiologist Kiran Krishnan,  Dr. Whitney Bowe, author of The Beauty of Dirty Skin, and Dr. Vincent Pedre, author of Happy Gut, to get some answers.How can probiotics help my gut?“Both probiotic-rich foods and probiotic supplements serve an important role in rebalancing the gut flora and creating equilibrium in terms of how the gut barrier and immune system function, with the ultimate goal of creating a well-functioning gut, or what I call a “happy gut,” Dr. Pedre says. By boosting the bacteria already living in your gut, probiotics can increase digestive regularity, reduce diarrhea, alleviate symptoms of IBS like gas and bloating, and promote digestive health after taking antibiotics. A huge amount of our immune system is based in the gut, and while clinical studies are still emerging, probiotics are thought to help regulate functions of some of these immune cells too. According to Dr. Pedre, the HN019 strain of Bifidobacterium lactis is especially good at supporting healthy gastrointestinal and immune functions.How can probiotics help my skin?In addition to the good work they do in your gut, probiotics fight bad bacteria on our skin and work to support the skin barrier. “If your skin’s microbiome is off balance, you will experience any number of skin issues including eczema, acne, dry skin, dull skin, and premature aging,” Dr. Bowe says. “On the other hand, if you nourish and strengthen your body’s good bugs and keep them healthy and happy, they will keep your skin healthy in return.” According to Dr. Bowe, two strains that are especially good for skin are Lactobacillus, which has anti-inflammatory properties that reduce the risk of skin disorders and strengthen the skin barrier, and Bifidobacerium, which can help prevent sun damage.A few of the probiotics Dr. Bowe recommends\nPhoto by Alex LauWith so many probiotic foods available, why take supplements?It’s true that fermented foods like yogurt and kimchi contain lots of probiotics, but it’s hard to know exactly how much you’re consuming. “In cases where the person needs a specific strength of probiotic in order to achieve their desired outcome, taking a supplement allows for a more standardized and reliable way to get the right amount of probiotic,” Dr. Pedre says. While eating probiotic-rich foods is a beneficial (and delicious) way to get an extra boost of good gut bacteria, picking the right supplement ensures you're getting the maximum benefits.Are probiotics different from prebiotics? And do I need both?Prebiotics are a dietary fiber that promote the growth of microorganisms and are often taken to maximize a probiotic's benefits. \"Prebiotics are like fertilizer or food that encourages healthy bacteria to grow,\" Dr. Bowe says. They can be found in foods like raw asparagus and garlic, in addition to supplements.\"A diet rich in plant-based foods, resistant starches and soluble and insoluble fibers will provide most of the prebiotics a person would need,\" Krishnan says. \"However, taking prebiotics (foods or supplements) without the right probiotics will negate the benefits of the prebiotics and can even cause some gas and discomfort.\" In general, it's best to only take prebiotics if they are bundled with a probiotic or recommended by a medical professional.Are refrigerated supplements more effective?Not necessarily. Live cultures die over time, and supplements use a variety of packaging techniques like blister packs, foil containers, and cooling technology to slow down this process. Dr. Pedre notes that probiotic supplements are tested to ensure they maintain potency through their expiration date, regardless if they're shelf-stable or meant to be refrigerated. In other words, a probiotic billed as containing 50 billion CFU (colony-forming units) might leave the factory with 200 billion CFUs, some of which are expected to die off over time. So, while refrigeration slows down the loss of live cultures, shelf-stable probiotics should have enough cultures to stay fresh until the expiration date.In fact, research microbiologist Kiran Krishnan argues that supplements requiring refrigeration are actually less effective. \"If they can’t survive the very pleasant 70 deg F on the store shelf, how can they survive 98.6 deg F in the body and a pH of 1.3 in the stomach?\" Krishnan says. \"If a probiotic has to be refrigerated to be stored, it cannot function in the body and thus will not be effective.\"Which supplements are best?\"I recommend starting with supplements with between 10 and 15 billion CFUs (colony-forming units),\" Dr. Bowe says. \"Three brands I often recommend are Culturelle, Align and Genuine Health.\" In addition to keeping an eye on expiration dates, it’s important to look for probiotic supplements with extended-release capsules, which help protect the live cultures from corrosive stomach acid until they reach the gut.What should you keep in mind before taking them?While probiotics are generally safe to consume, be aware that you might have some uncomfortable side effects as your body adjusts. “Depending on the state of your gut (especially if you haven’t been eating lots of pre or probiotics), you may experience gas and bloating during the period of acclimation while the probiotics are recolonizing your gut,” Dr. Bowe says. As always, speak with your doctor to make sure probiotics are right for you.Explore Bon AppétitHealthyishFermentationProbioticsTrendsRead MoreLifestyleA Nutritionist’s Guide to Safer, Smarter SupplementingBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-07", "author": ["Condé Nast", "Aliza Abarbanel"]}