{"id": "5e23a1dcecaa4d8ab38691bd482da8fa", "url": "https://www.bonappetit.com/recipe/ham-and-cheese-hand-pies-with-honey-mustard", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Ham and Cheese Hand Pies With Honey Mustard Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueHam and Cheese Hand Pies With Honey MustardBy Kendra VaculinNovember 23, 20214.4(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Josephine Schiele. Food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintAdd bright honey mustard and flaky puff pastry to the classic ham-and-Swiss combo and you’ve got a home-run party snack (or even easy weeknight dinner). Use cheese slices, rather than grated cheese, for the filling—this makes the pies easier to fold over and close.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRolling Pin$13 At AmazonPastry Brush$9 At AmazonAutumn Carpenter Pastry Rulers, Set of 6$20 At Kitchen JukeboxRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonIngredientsMakes 12⅓cup whole grain mustard3Tbsp. honey1large eggKosher salt1package frozen puff pastry (preferably Dufour), thawedAll-purpose flour (for surface)8oz. package sliced Swiss cheese, torn into bite-size pieces6slices deli ham, torn into bite-size piecesFreshly ground black pepperSesame seeds (for sprinkling)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 375°. Stir mustard and honey in a medium bowl to combine. Beat egg, a pinch of salt, and 1 Tbsp. water in another small bowl to combine; set egg wash aside.Step 2Unfold puff pastry on a lightly floured surface. If using a 17.3-oz. package with 2 sheets, arrange them next to each other so they overlap slightly on a long side and gently press together to make 1 large sheet. Roll pastry to a 20x15\" rectangle, then slice into 5\" squares with a sharp knife (4 squares on long sides and 3 squares on short sides for 12 total).Step 3Spread about 1 tsp. honey mustard on the bottom half of each square to make a right triangle, leaving about ½\" border along edges. Divide cheese and ham among squares, arranging on top of honey mustard. Using a pastry brush or your finger, brush or swipe reserved egg wash around edges of each square. Working with 1 square at a time, fold corner without any honey mustard up and over filling to meet opposite bottom corner, making a triangle. Press edges together to seal. Using a fork, crimp edges. Divide hand pies among 2 parchment-lined baking sheets, spacing evenly. Brush tops with egg wash; sprinkle with pepper and sesame seeds. Chill in freezer 30 minutes.Step 4Cut a few slits in the top of each hand pie to let steam escape while baking. Bake hand pies, rotating baking sheets top to bottom and front to back halfway through, until golden brown and puffed, 30–35 minutes. Let cool slightly.Step 5Serve hand pies with remaining honey mustard on the side for dipping.How would you rate Ham and Cheese Hand Pies With Honey Mustard?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThere is so little filling and so much dough. this recipe needs some adjustments to the ingredients.beamaryland12/10/2021Explore Bon AppétitDinnerStarterSnackWeeknightEasyBakingSavory Pie & TartHamMeatCheesePuff PastryOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kendra Vaculin"]}