{"id": "5e257fc94f3f6bd7349665ee9eb886c2", "url": "https://www.bonappetit.com/story/veganizing-baking-recipe-tips", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Vegan Baking Tips for Substituting Ingredients and Veganizing Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Turn Nearly Any Baking Recipe Into a Vegan Baking RecipeTips for vegan baking, from egg substitutes to butter swaps to pantry essentials.By Kyle BeecheyApril 1, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailIn 2021, plant-based food is hip, smart, and socially responsible, and it’s possible to find not only a really good vegan croissant, but also a copycat Levain Bakery cookie. I’m thrilled. But back in 2009, when I first went from vegetarian to vegan, there was little to look forward to in the way of baked goods. I didn’t miss the meat or the mozz, I missed birthday cake, my grandmother’s butter tarts, and banana cream pie.Out of necessity, I rolled up my sleeves, put on an apron, and started to bake, nearly once a week for the past 12 years. My guides were Veganomicon, Vegan Cupcakes Take Over the World, and pretty much everything else Isa Chandra Moskowitz published too. I followed recipes obsessively, never swapping and never substituting. And I learned—a lot.Fast-forward to today, when I can’t even remember the last time I baked from a vegan recipe. I’m always riffing to make baked goods that suit my tastes, what I have in the pantry, and the season. I feel empowered to take snacking cakes, scones, cookies, loaves, bars, and muffins that weren’t intended to be vegan and customize them to what I’m craving.While tweaking a recipe takes more understanding and knowledge of the baking process than following it exactly, it also gives you the confidence to dig in and experiment—and it opens up a whole range of non-vegan recipes that you vegan-ize. Maybe after a year of being at home, baking your way through the pages of Bon App, you’re looking for a new challenge?With the seven steps below, which take you through how to vegan-ize a non-vegan baking recipe, every cookbook and internet archive is your baking oyster and you won’t be relegated to the vegan section any longer.1. Choose a recipe carefully.This is the most important part. If a recipe calls for 8 eggs or 12 egg whites, things like flourless chocolate cake or angel food, it’s an uphill and likely unsuccessful battle. Angel food is my white whale. If anyone has figured it out, let me know. The same goes for baked goods that rely heavily on butter for their flavor and/or structure: Think flaky pie crust or those glistening laminated croissants. They’re not impossible to vegan-ize—but they’re probably not where you should start. Begin here instead with these baked goods that all take well to substitutions:Cakes (the cupcake was my gateway, but snacking cakes, like this or this, are great places to start)MuffinsBrowniesLoaves and quick breads (pumpkin, lemon, banana)Cinnamon rolls or morning bunsMany cookies (shortbread, anything with oats or a lot of textured add-ins, like nuts, seeds, etc.)Scones2. Embrace the different!After choosing a recipe carefully, this is the second most important thing. Almost all of the ingredients I mention in the following points have flavors that aren’t the same as butter, milk, eggs, or refined white sugar. And that’s okay! Lean into it. I’ve never been able to make the quintessential Toll House chocolate chip cookies to my satisfaction—and believe me, I have tried. There is something about the taste and melting point of dairy butter in combination with the pliability of an egg that I don’t think can be replicated—but who cares?! I can make a killer shortbread, chocolate crinkle, and many sorts of nutty, oaty, chocolaty combinations.Vegan chocolate tart!\nChristopher TestaniLean into the tastes of coconut, cashews, tahini, coconut sugar, maple, and banana. Plants are delicious! You might have a hard time pulling off an exact dupe of an old favorite, but chocolate buckwheat sablés aren’t a bad update.3. Replace your eggs.To best understand how to replace an egg, isolate what it’s doing in the recipe—or at least its main function. In a cookie, it’s binding; in most cakes, it’s leavening; in challah and other egg breads, it’s adding flavor and texture.There are lots of vegan egg replacers out there, some that you can buy in the store and many that you can make at home. Although I love my magical vegan egg, I like to lean into the power of nature. It costs less and you can find many of the below just about everywhere.Here are some of my favorite vegan egg substitutes:Plant-based yogurt: I use yogurt in cakes, loaves, quick breads, muffins, custards, cream pies, cheesecakes—anything that’s cake-like or that relies on a creamy foundation. While I like coconut-based yogurt best, use your favorite. Just make sure it’s unsweetened and unflavored. ¼ cup plant-based yogurt = 1 eggVinegar and baking soda: This is a miracle of science and leavens cake like a charm.1 tsp. baking soda + 1 Tbsp. vinegar = 1 eggApple sauce and other fruit/veg purées (pumpkin, squash, banana, etc.): Great for adding moisture to those snacking cakes, quick breads, and brownies. ¼ cup = 1 eggGround flaxseed: When you want a chewy cookie, this will help with that!1 Tbsp. ground flaxseed + 3 Tbsp. water = 1 egg. Whisk together in a bowl (it should coagulate in a couple of minutes) before adding to the general mixtureStarches (tapioca, corn, arrowroot): These add fluff to a cake and are essential when making anything like custards, curds, or puddings that rely on eggs for thickening. Cornstarch behaves well heated, the others not so much.2 Tbsp. + 3 Tbsp. of water = 1 eggAquafaba: Also called chickpea brine. Yeah, weird, I know, but that liquid in the can of chickpeas. Save it. You can make vegan meringue with it. I’ve found that its powers can lessen under the weight of other ingredients, which means it’s not my favorite for leavening cakes, muffins, or the like. But it’s pretty impressive where it’s the main ingredient, like for topping lemon meringue pie, making macarons, or acting in place of egg whites in macaroons.1 Tbsp. aquafaba = 1 egg yolk2 Tbsp. aquafaba = 1 egg white3 Tbsp. aquafaba = 1 whole eggSilken tofu: It’s heavier than yogurt and results in a denser bake, but it’s great for things like cheesecake or if you want a fudgier brownie.  ¼ cup = 1 eggA note on egg wash: I’ve never been 100% successful in achieving that eggy, glistening shine, but I found that a few tablespoons of plant milk mixed with maple or agave syrup brushed on top can be effective, as can a light coating of coconut oil.4. Choose your fat.This may be a controversial opinion, but I think the two most important ingredients in baking are good flour and fat, not sugar. I never skimp on fat and there are many plant-based alternatives.My favorite vegan butter is Miyoko’s.\nPhoto by Alex LauThe most used ones in my pantry are canola, coconut, and olive oil. Vegan butter has come a long, long way and there are some great ones on the market, but I only use it for special occasions where the flavor of butter is key, like shortbreads, caramel sauces, or buttercream. I actually prefer oil-based cakes, which I find lighter and fluffier. It’s worth noting that because plant-based fats have different melting points than animal-based ones, baked goods like cookies might spread out less.Here are some of my favorite vegan butter substitutes:Neutral oils (canola, avocado, grapeseed): These are the workhorses of my kitchen. They work well in just about everything. I substitute 1:1, but if you find your bakes seem too liquidy or a little too moist, reduce the amount by 2–3 tablespoons. Olive oil is delicious, but has a flavor. I love it where I want grassiness, like in a citrus cake or brownies.Refined coconut oil: A great tool for pastry, it makes a killer pie crust or scone and works well in cookies too. I’d recommend buying a refined version—otherwise, you’ll be getting a coconut flavor. Make sure to use it at room temp so it’s solid and that your other ingredients are also at room temperature—otherwise, they can cause it to melt or seize. I also find that cookies made with coconut oil tend to spread out less than their butter-based counterparts, so I make sure to shape them exactly the way I want them before I put them in the oven.“Butter”: This is for special occasions because it tends to cost more than the others. I love oil, but if you’re a butter fan, by all means substitute it 1:1. My go-to is Miyoko’s, but recently there has been a vegan butter explosion and I’m also loving Monty’s. I look for something with as few ingredients as possible, and I use it in buttery cookies, denser sponge cakes, caramels, toffees, buttercream, and recipes that call for creaming butter and sugar together.Coconut milk and cream: If a recipe calls for whole milk or heavy cream, this is what I look to. People say you can make whipped cream from it, but I’ve tried and failed too many times to count with every brand on the market and I’ve given up.Nut butter: This has a big impact in terms of flavor and texture, but it can be a favorable one! I’d keep it to brownies, cookies, and quick breads because it results in a denser bake. Don’t sub all the fat in the recipe—start with half. My preference, in adapting something like cookies that are made with 1 cup of butter, is to start with ½ cup nut butter, ½ cup canola oil.5. Consider your source of sweetness.Regular run-of-the-mill sugar is unfortunately not vegan. Much of that very white processed stuff is filtered through bone char. This goes for powdered, light, and dark brown sugars too. For vegan sugar, look for organic cane sugar, like Wholesome Organic or Florida Crystals. Other good words to watch for are unrefined, organic, or beet sugar. The good news is that vegan sugar can be substituted 1:1 and many brands make powdered, light, and dark brown.But why stop there when there so many delicious sweeteners? In most of my baking, I use coconut sugar or maple. I love the taste and texture. There are lots of sweeteners out there, from date syrup to molasses to agave, to experiment with. They all taste and behave differently. Do a little research and play around. Look for unrefined organic sugar.\nPhoto by Laura Murray, Food Styling by Susan SpungenFor every cup of sugar, a general rule of thumb is to replace it with ¾ cup liquid sweeteners. Coconut sugar works great for 1:1 for light brown sugar, but because it’s a bit drying, I’ll add two tablespoons of liquid for every cup.6. Don’t be scared to experiment.Just go, try, and don’t be afraid if it doesn’t work out. That’s how you’ll learn and develop personal preferences. A cake recipe calls for milk, try almond one time and oat the next. If it calls for butter, try coconut oil on your first bake and switch to one of the plant-based butters on the second. For eggs, test coconut yogurt for your first brownie attempt and then pumpkin purée for the follow-up. You’ll quickly find what you like, texture- and flavor-wise.You can always reference a similar vegan recipe on the web in order to see how that baker approaches substitutions, keeping in mind that there aren’t any hard-and-fast rules and different combinations can have similar outcomes.Sometimes things might not work out as planned, but in 12 years of experimenting, most of my failures have come from general baking mistakes (if the recipe calls for lining a pan with parchment, do it!) rather than tweaks gone wrong. Even if it isn’t as you envisioned, a lot can be salvaged. Dry cake? Soak it or frost it! Stuck to the pan? Make it a pudding or spoon cake! Too moist? Griddle it! Crumbly? Use it as a sundae topper! With a little creativity, I’ve managed to salvage almost everything. As you learn, you’ll probably be able to tell early on—when you mix a batter or dough, for example—whether something is amiss, which will give you more time to salvage it. I also keep a rough archive of everything I’ve baked along with notes on the recipe, which helps me remember what might need to be tweaked the next time.And besides, now is a perfect time to practice. Bake for you, bake for your small household! Test things out so when we’re all ready to make our big debut, you’ll have a killer Brooklyn Blackout Cake for your recently turned vegan dad’s fall birthday.7. Keep your pantry stocked.A vegan pantry looks a little different from an omnivore’s. Yes, we need the same flour, baking soda/powder, and salt, but I’m always stocked with some extra ingredients—sweeteners, egg and dairy replacers—that make the vegan-ization process less daunting. With this stuff on hand, you won’t have to run to the store every time you’re looking to replace that heavy cream.Vinegar (white or apple cider)Coconut sugarMaple syrupOrganic cane sugarStarch (tapioca or corn)Apple and other fruit/vegetable purées (canned pumpkin, sweet potato, butternut squash)Neutral oils (refined coconut, avocado, canola)A can of chickpeas, for the aquafabaAlternative floursNondairy yogurt (unsweetened, unflavored)—I like Kite HillFull-fat coconut milkNondairy milk (I like almond, but any unsweetened alt will work)Vegan butter (these are my favorites)Ground flaxseed/chia seedsNut butterGo forth and dive into the archive—any archive!—or finally make your famous carrot cake for the friend with the dairy allergy. Or maybe follow that seasonal craving to something-rhubarb in your future? Ah, the possibilities!Kyle Beechey is a New York–based writer and baker with an enthusiasm for snacking cakes and crumble toppings.Explore Bon AppétitVegantechniqueSubstitutionsBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-01", "author": ["Condé Nast", "Kyle Beechey"]}