{"id": "5e2a4084a18e37d1c1ef3444ee82a6bd", "url": "https://www.bonappetit.com/recipe/stupid-simple-grilled-ribs", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Simple Grilled Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStupid-Simple Grilled RibsBy Lauren SchaeferAugust 28, 20192.9(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintCall us crazy, but we think these three-ingredient charred ribs are just as delicious (if not more so!) than the low-and-slow, fall-off-the-bone-tender kind. They develop a crispy crust as they cook for just 15 minutes on each side, and despite the ridiculously short ingredient list, they’re still plenty flavorful and juicy due to the high fat content in the ribs.Ingredients4 servings3lb. baby back pork ribs (1–2 racks)Kosher salt, freshly ground pepperPreparationStep 1Let ribs sit at room temperature 30 minutes. Cut pork between rib bones into 2- or 3-rib sections. Pat dry with paper towels. Season both sides generously with salt and pepper (about 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt per 1 lb. ribs; check the butcher’s label on your package for the weight).Step 2Prepare a gas or charcoal grill for medium heat. (To check that your grill is at medium heat, hold your hand about 5\" above the grate; you should be able to stay there 7–8 seconds before it’s too hot and you have to move your hand away.)Step 3Grill ribs bone side down until deep golden brown, about 15 minutes. Turn ribs and continue to grill until golden brown and crisp, about 15 minutes more.Step 4Cut between bones into single ribs and transfer to a platter.Photo by Chelsie Craig, Food Styling by Pearl JonesHow would you rate Stupid-Simple Grilled Ribs?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleLow and slow is the way to go?Anonymous7/21/2021Please update the recipe to reflect when the grill cover should be up and or down.  I assumed it was supposed to be down.  Everything went well until the last 10 mins of cooking, when the temp shot up and burnt everything to a crisp.  I had been checking every 5 mins to ensure med temp.  But for the final 10 I stepped away.  David GSan Diego CA6/28/2021Super easy and tasty ribs. I followed the recipe to the letter. On my grill, I had to watch for hot spots that flared up when the fat dripped and shuffled the ribs around as necessary. Jason CA6/12/2021Also known as \"Tuscan Style Ribs\"...   Salt and let sit for an hour before cutting into 2 rib pieces.    Season with pepper.   Best with baby backs, but St Louis ribs work too.     I suggest 4 - 6 min bone down, grill cover down, flip to meat side down, 4 - 6 min, covered, flip, 4-6 mon covered and flip and 4 - 6 minutes covered - this totals 16 - 24 minutes...  NEVER dry!!!   pure porky goodness....   depending on your rack, 15 min per side may be too long!EACLivingston, Tennessee1/6/2021They look drier than a burnt boot. At least wrap them in foil,then put them on the grill. That will keep them moist. After they're done then you can put them on the fire for a little char.marshall mclaneFlorida3/19/2020These are stupid-simple AMAZING!\nFollow the recipe as it’s written - they know what they’re doing here! So simple, so delicious. \nAnonymousVancouver BC9/1/2019Hey guys, did you even read the title?  \"Stupid-Simple\" should have been a clue here.\n\nMe personally, if something looks as good as the pic shows, I'm digging in!AnonymousSacramento, California9/1/2019Do you even consider this as a receipt?AnonymousHK9/1/2019This was absolutely disgusting! Low and slow is so much better.  No flavor.Anonymous8/31/2019Explore Bon AppétitRibsPork RibPorkMeatSummerQuickEasyWeeknight Meals5 Ingredients or FewerMainDairy-FreeGluten-FreeNut-FreeKetoGrillingSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-28", "author": ["Condé Nast", "Lauren Schaefer"]}