{"id": "5e2f539239ce3731b6b7255aea7f480e", "url": "https://www.bonappetit.com/story/pei-oysters", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Beauty and Brine: Prince Edward Island Is an Oyster-Lover’s Paradise | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBeauty and Brine: Prince Edward Island Is an Oyster-Lover’s ParadiseThe tiny province delivers big on bivalves.By Chantal MartineauNovember 7, 2019FacebookTwitterEmailDominique LafondFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.Down a dirt road lined with potato fields and farmhouses hung with brightly painted buoys, you’ll find the most charming seafood restaurant on Prince Edward Island. And that’s saying a lot because the island traffics almost exclusively in charming seafood restaurants.This one sits on the rocky shore of a sand beach, some 40 minutes from Charlottetown, the capital. Its closest neighbor is the oldest lighthouse on PEI: a red-roofed tower of blinding white perched on an emerald hill at the tip of a skinny peninsula jutting out from the island’s backside like a tail. For the full effect, my family and I sat at one of the picnic tables at the edge of the water, the blues of sea and sky somehow boosted by a beach the color of persimmon.Descriptions of PEI are always colorful. Red dirt, green pastures, the red hair of its most famous character, Anne of Green Gables (who, like all good Canadian girls, I grew up idolizing). Set against such a dazzling background, the food at Point Prim Chowder house didn’t have to be as good as it was. I’d have been charmed anyway. But it was good—in a way that was uncomplicated, almost anti-trendy. Just wholesome down-home Maritime good.“Lots of places with a location like this, they don’t focus on the food,” owner Paul Lavender, who helms the kitchen 110 days a year, likes to say. (He closes in the off-season, as most establishments do.) “But we want to match that view.”Oysters served on seaweed at Point Prim Chowder house.\nDominique LafondThe sun took its sweet time sinking toward the horizon, and we did too. We lingered over  plump mussels in a lemon-cream broth, jumbo quahog clams swimming in a generously packed chowder, and the sort of seafood linguine you might find in a red sauce joint, only made with fish so fresh and springy it was almost a shame to smother it in buttery pink sauce—almost. Finnan haddie, a cold-smoked haddock, gave the dish surprising depth. Like so many charming seafood restaurants on PEI, Point Prim serves its own oysters. Plucked from nearby Pinette River, they’re full of briny liquor, as the liquid is called, with a hint of sweetness in the fattiest part of the meat. You can only get them here and from the fisher who tongs them.I’d come to PEI with the intention of eating fresh seafood everyday (mission accomplished) and slurping oysters until I really got to know them. Like cru wines, oysters are said to taste of their place. Malpeques, PEI’s most famous local variety, are found on menus from New York to Beijing. But here, where every oyster is a Malpeque, bivalves are known by their waters: Colville Bay, East Point, Savage Harbour. Freshwater influence might impart sweetness; certain algae can lend a little tang. Some companies brand their oysters based on appearance: black-and-white Tuxedos, green-tinted Lucky Limes.Valley Pearl Oysters aplenty.\nDominique Lafond“Chefs are always asking me to describe the flavor profile of our oysters,” said Jeff Noye, co-owner of Valley Pearl Oysters in Tyne Valley, a 300-strong community on the west side of the island. “You mean, what they taste like this week?” A heavy rain can cut their salinity. When they gorge themselves before winter’s hibernation, their meat is plentiful and creamy. They emerge in May famished, their flesh thin. It’s the only month Noye likely won’t ship them.Noye and his partner, Damien Enman, source wild-caught oysters from local fishers and farm their own, shipping directly to restaurants like Joe Beef in Montreal. They started the business in 2017, along with a no-frills oyster bar above the processing plant.When I visited, bearded and round-bellied Noye was holding court, dropping pearls of wisdom about the bivalves’ delicate biology. He’s a member of the team that holds the Guinness World Record for most oysters shucked in an hour (8,840). He also happens to be mayor of Tyne Valley. Running the annual Oyster Festival, which attracts some 20,000 visitors each August, basically got him elected.“Ten years ago people weren’t eating raw oysters on the island,” he said, working his knife into a shell’s hinge and twisting until it popped. Enman, a second-generation oyster fisher, clarified: “Everyone fished them. But it wasn’t big business like now.”The view from Point Prim.\nDominique LafondPeople don’t just want to eat PEI oysters, they want to slurp them at the source. Wade into the brackish, bracing waters that feed them. (Immaculate bays and estuaries with just the right amount of salinity breed beautiful oysters, which, in turn, keep the waters pristine. Is there a more perfect circle?) Noye started offering an oyster-tonging experience, but the demand quickly overwhelmed him. He let me tag along to his farm, where we stood knee-high in water, pants rolled up. Noye plunged his hands into what felt like bathwater. It was shallow, but his hands went deep into soft red sand. They emerged filled with oysters.My quest to really get to know oysters was only slightly marred by my five-year-old, who discovered she had a taste for them. Now I had to share. She ate them as a child would, loudly slurping the liquor, chewing the meat, and licking the pearlescent shell, exclaiming, “Tastes like the sea!” No mignonette or seafood sauce. Turns out, hers is the experts’ way (minus the licking). It’s a myth that you should swallow without biting; the flesh is where the sweetness is. And, as Noye put it, sauce is for tourists. Real oyster folk slurp naked.PEI is tiny, accounting for just 0.1 percent of Canada. But it punches above its weight, providing a quarter of the country’s potatoes and oysters, 80 percent of mussels. Fisheries and farms dot the island, but each region has its own identity. The west is wild, remote. The east has a New England feel—quaint beach towns and elegant properties, like The Inn at Bay Fortune. Once an artists’ colony favored by Broadway and silent film actors, it’s now owned by a celebrity chef and his wife Chastity. Michael Smith, who headed the kitchen in the ’90s, bought and renovated the inn in 2015, replacing fussy tasting menus with the FireWorks Feast, a dinner cooked over open flame.The Inn at Bay Fortune hosts the FireWorks Feast, a dinner cooked over open flame.\nDominique LafondDespite the gimmicky name, the feast offers a rare modern take on the local cuisine. It begins with a tour of the inn’s farm followed by an all-you-can-eat oyster happy hour featuring sweet-salty Fortune Bays and saltier Colville Bays from literally the bay next door. At communal tables, greens and grains from the farm and surroundings make startling appearances, like a delightful chowder sprinkled with beach wort, a sort of Maritime purslane. Before the sit-down portion of the meal starts, the sous-chef makes a toast that feels more like grace, offering thanks for the oyster fisher and solemnly saluting the flags of Canada, PEI, Acadia, and the Mi’kmaq, once the island’s sole inhabitants.The most scenic route from east to west is the coastal drive through PEI National Park. Flanked by pines interrupted only by campsites and cottages for rent, the road overlooks white sand beaches and brick-red eroded cliffs, sand dunes and salt marshes. At one point I spotted kids sitting on the guardrail next to the causeway. One jumped right off [Ed note: This is illegal!] and landed in the cool blue waters below, his friends cheering.A pretty perfect lobster roll from Richard's Fresh Seafood.\nDOMINIQUE LAFONDThis was the turnoff for Richard’s Fresh Seafood, a fish shack with a queue that snakes on for at least an hour. “It’s basically an entire lobster on a bun,” the woman in front of me said of the lobster roll, as if to appease me. She wasn’t lying. The lightly toasted buttered roll could barely contain all the pink meat slicked in lemony mayo. Fish and chips were also generous, with enough breaded fresh haddock to feed a small family.The next day we were on the east side of Malpeque Bay, where Randy and Terry Oatway opened a fish market and pottery studio 20 years ago. Customers came to the Malpeque Oyster Barn for the mollusks more than the crafts, so the couple decided to replace the pottery with a restaurant. Their son, Daniel, a champion shucker, was behind the bar, prying open oysters he’d likely tonged himself. When we bit into them, they ruptured with crisp saltiness.“You can only get our oysters here,” he said, pointing out the window: “From right over there.”It seems as though most of the work in oystering is Mother Nature’s. But PEI’s boutique oyster sellers pride themselves on personally handling each shell. Depending on how rough the water is, the oysters are brought in once or twice a year to be tumbled, like clothes in the dryer, to encourage a round, deep shape. Wild-caught oysters go through rigorous selection, first in the water and again in the processing plant. It’s work that goes unseen, not that anyone makes a fuss about it.“You can’t offend oyster people,” Noye was saying above the din of the crowd at his bar. He was talking about the fearlessness associated with fishing, shucking, even eating these strange seabed dwellers. But it got me thinking of the raw oyster as great equalizer: The most skilled chef in the world can’t improve upon it. There’s something humbling—and totally romantic—about that.So pretty it almost doesn't look real.\nDominique LafondWhen You Go: Where to Eat, What to Do, and Where to Stay on PEIThe tiny island province has so much to offer, and manages to pack just about all of it into an extended summer season. PEI comes to life in May and starts to quiet down again in October, when many restaurants and guesthouses shut down for the season. It’s a good idea to start planning your 2020 trip now—accommodations book up quickly and the island’s many return visitors are already wise to that fact.Point Prim Chowder houseThis isolated seaside restaurant overlooks a red sand beach and PEI’s oldest lighthouse. Order the house oysters, any of the signature chowders, and mussels in broth for a bivalve bonanza.2150 Point Prim Rd., Belfast, PEI; open mid-June through September 30Valley Pearl OystersSpecializing in local wild-caught and cultivated oysters, this boutique wholesaler has a friendly oyster bar upstairs with live music. It also offers tonging tours, depending on availability.1323 Port Hill Station Rd., Tyne Valley, PEI; 902-439-1716Oysters on the grill at The Inn at Bay Fortune.\nDominique LafondThe Inn at Bay FortuneBuilt as a summer home for a Broadway playwright in 1913, this 17-room inn was most recently renovated in 2015 but retains its weathered shingles and salt-box style main house overlooking the water.758 Route 310, Fortune Bridge, PEI; 902-687-3745; open mid-May through mid-OctoberRichard’s Fresh SeafoodThis unassuming seaside fish shack has a perpetual hour-long queue and a reputation for the most lobster-stuffed lobster rolls around. It also does a mean fish and chips.9 Wharf Rd., Covehead, PEI; open June 1–mid-SeptemberMalpeque Oyster BarnLocated on the bay that gives PEI oysters their name, this spot opened up as a fish market and a cozy restaurant soon followed. Raw house oysters are the way to go, but all the mollusks—mussels, quahogs, littlenecks—shine.10 Malpeque Wharf Rd., Kensington, PEI; 902-836-3999; open mid-June through September 10Want more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Chantal Martineau"]}