{"id": "5e467fbdbd682aba9676f3c48a7adf9a", "url": "https://www.bonappetit.com/recipe/matzo-ball-soup", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Matzo Ball Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2014 IssueMatzo Ball SoupBy Alison RomanPhotography by Matt DuckorMarch 8, 20224.0(287)Read ReviewsTriangleEmailPinterestPrintMatt DuckorEmailPinterestPrintEmailPinterestPrintMost people who grew up eating matzo ball soup fall into one of two categories: those who love “floaters,” or light, fluffy matzo balls, and those who pledge their allegiance to “sinkers,” or denser dumplings. This recipe meets the two camps in the middle, winning over both with matzo balls that are rich and flavorful (thanks to the addition of schmaltz, i.e., rendered chicken fat) and tender and light (thanks to a splash of seltzer or club soda).It’s essential that you refrigerate the matzo ball dough—doing so gives the matzo time to become fully hydrated and prevents the balls from falling apart when simmered gently in well-salted, gently boiling water. That’s right, we said water, not broth: Cooking the matzo balls before introducing them to the soup ensures the chicken broth stays nice and clear. For more tips, check out this helpful guide.And about that broth: There’s a whole chicken in there! It’s cut into parts so that you can easily pull out the breast meat—which cooks faster than the rest of the bird—early on and save it to garnish the finished soup. Everything else remains (bones and all) and simmers for hours, enriching the homemade chicken stock with concentrated flavor and body.If you’re serving this matzo ball soup recipe for the Jewish holiday of Passover, follow it up with our favorite brisket, slow-roasted harissa lamb, herb-and-citrus-laced salmon, or any of our best Passover recipes.Editor’s note: This recipe was originally published in our April 2014 issue.Ingredients6  ServingsChicken stock14–5-lb. chicken, cut into 8 pieces1pound chicken wings, necks, and/or backs2large yellow onions, unpeeled, quartered6celery stalks, cut into 1\" pieces4large carrots, peeled, cut into 1” pieces1large parsnip, peeled, cut into 1” pieces1large shallot, quartered1head of garlic, halved crosswise6sprigs flat-leaf parsley1tablespoon black peppercornsMatzo ball mixture3large eggs, beaten to blend¾cup matzo meal¼cup schmaltz (chicken fat), melted3tablespoons club soda1¼teaspoon kosher saltAssembly2small carrots, peeled, sliced ¼” thick on a diagonalKosher salt2tablespoons coarsely chopped fresh dillCoarsely ground fresh black pepperPreparationChicken stockStep 1Bring all ingredients and 12 cups cold water to a boil in a very large (at least 12-qt.) stockpot. Reduce heat to medium-low and simmer until chicken breasts are cooked through, about 20 minutes.Step 2Transfer breasts to a plate (remaining chicken parts are strictly for stock). Let breasts cool slightly, then remove meat and return bones to stock. Shred meat. Let cool, tightly wrap, and chill.Step 3Continue to simmer stock, skimming surface occasionally, until reduced by one-third, about 2 hours. Strain chicken stock through a fine-mesh sieve into a large saucepan (or airtight container, if not using right away); discard solids. You should have about 8 cups.DO AHEAD: Stock can be made 2 days ahead. Let cool; cover and chill. Keep reserved chicken meat chilled.Matzo ball mixtureStep 4Mix eggs, matzo meal, schmaltz, club soda, and salt in a medium bowl (mixture will resemble wet sand; it will firm up as it rests). Cover and chill at least 2 hours.DO AHEAD: Mixture can be made 1 day ahead. Keep chilled.AssemblyStep 5Bring chicken stock to a boil in a large saucepan. Add carrots; season with salt. Reduce heat and simmer until carrots are tender, 5–7 minutes. Remove from heat, add reserved breast meat, and cover. Set soup aside.Step 6Meanwhile, bring a large pot of well-salted water to a boil. Scoop out 2-tablespoonful portions matzo ball mixture and, using wet hands, gently roll into balls.Step 7Add matzo balls to water and reduce heat so water is at a gentle simmer (too much bouncing around will break them up). Cover pot and cook matzo balls until cooked through and starting to sink, 20–25 minutes.DO AHEAD: Using a slotted spoon, transfer matzo balls to bowls. Ladle soup over, top with dill, and season with pepper.Nutrition Per ServingCalories (kcal) 310 Fat (g) 12 Saturated Fat (g) 3.5 Cholesterol (mg) 140 Carbohydrates (g) 38 Dietary Fiber (g) 6 Total Sugars (g) 10 Protein (g) 16How would you rate Matzo Ball Soup?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleGreat taste, we love that matzo balls soup. Cooked a few times and always gone to the last drop. This soup is quite similar in taste and preparation to traditional polish chicken boulion called rosol or so. Difference is rosol boulion has a addition of beef, flat parsley leaves not dill, no garlic and it`s served with kind of vermicelli. Nice as well, maybe even more packed with flavours Janette Goosebumps South Shields UK2/2/2022Wonderful Matzo ball soup. Thanks for your recipe. 5 Stars. By Gregg L. Friedman MDGregg L. Friedman MDMiami, FL9/6/2021Read the recipe folks! its not hard to follow!\n\"All ingredients\" for the broth, includes 4 large carrots. \"Assembly\" includes 2 small carrots. AnonymousSydney Australia5/5/2021This recipe was a home run! It tasted very authentic and the matzo balls were the best I've ever had. Yes, hold some sliced carrots back to cook at the end and add to your finished soup. I happened to have some homemade chicken bone broth in the freezer so I added it to my stock for an extra level of richness. I cook a lot of bon appetit recipes and they never fail. comfort_eatz on instagram to see finished dishes. \ncomfort_eatzDallas, TX11/6/2020Don't salt the water for the matzoh balls or they will end up too salty!Alexandra RangelSouth Bronx5/5/2020I made this on Easter Sunday and it was gone almost immediately! Everyone loved it, including all of the kids. Multiple bowls were consumed! Definitely looking forward to making it many times in the future!!AnonymousSkippack, PA5/21/2019When it says \"all ingredients\" it is referring to all the ingredients for the broth including the chunks of carrots. The sliced carrots are added when the recipe says to \"add carrots\". These stay in the final soup, where the chunks are thrown away after flavoring the broth.deb212Sarasota, FL4/18/2019Mistergee \nUnder “assembly” it tells you to put the carrots into the stock.\n\n\n“assembly\nBring chicken stock to a boil in a large saucepan. Add carrots; season with salt.”Anonymous4/6/2019Question: The first line of instructions says to add \"all ingredients\" to the pot. Later on, under \"Assembly\" it says to add the carrots. When do the carrots go in? Thanks!mistergeeSeattle, WA via NYC11/26/2018Delicious! Anonymous10/10/2018Explore Bon AppétitSoupSoups and StewsJewishMatzoOther IngredientsChickenPoultryCarrotVegetableDillHerbs & SpicesMainStarterNut-FreeDairy-FreeSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-03-14", "author": ["Condé Nast", "Alison Roman", "Matt Duckor"]}