{"id": "5e509e0d2ec408cf9606c2c96c91ae90", "url": "https://www.bonappetit.com/city-guides/new-york/venue/atoboy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Atoboy Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkAtoboyEvery chef’s favorite Flatiron haunt, with a constantly changing, Korean-ish menuFacebookPinterestTwitterEmailDiane KangGO HERE: a ridiculously affordable ($42!), Korean-inspired tasting menu from Jungsik alum Junghyun Park.ORDER THE: tasting menu. Duh. The roster of dishes changes based on seasons, sometimes on a whim, but order these if you see them surface on the menu: crispy lotus root with chili oil; creamy corn with taleggio and doenjang; the kimchi and chorizo combo, sometimes stuffed into squid or served with octopus; fried chicken with a surprisingly delicious peanut butter dipping sauce; and the walnut-topped burrata for dessert. The wine list is tight, with a few by-the-glass options, but our favorite non-alcoholic nightcap is the refreshing corn silk tea.THE VIBE IS: kind of cafeteria-like. Spare two-top and four-top tables line the long space, which can come off as cold and industrial, but manager (and Park’s wife) Ellia Park brings in the warmth with friendly, attentive service. Despite looking like it might have terrible acoustics, Atoboy never reaches shout-over-everyone loud, so it’s perfect for dinner with more adventurous parents. Plus, you might see chefs on their days off here—it’s an industry favorite.PRACTICAL STUFF: Open for dinner everyday: Monday to Saturday, from 5:30 to 10 p.m., and Sunday, from 5:30 to 9:30 p.m. Snag reservations via Resy, but it’s easy enough to slip in as a two-top.—Elyse InamineDiane KangWE ALSO LOVEKeens SteakhouseNYC’s classic midtown steakhouse—still perfect after all these yearsEleven Madison ParkFour-star dining redefined from hit makers Daniel Humm and Will GuidaraUncle BoonsBrave the spice at NoLiTa's best dinner-with-friends jointExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Elyse Inamine"]}