{"id": "5e6af90a1ab22ae77a1fbddcb0c86a2b", "url": "https://www.bonappetit.com/story/tuk-trey-ping-poh-khmer-condiment", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "This Spicy Khmer Condiment Is Our New Favorite Way to Use Tomatoes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Khmer Condiment Is Our New Favorite Way to Use TomatoesFragrant with fish sauce and zippy with lime, tuk trey ping poh is as versatile as it is delicious.By Chala Tyson TshitunduJune 24, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailSoutheast Asian cuisine is a beautiful tapestry of rich flavors influenced by even richer histories. One country whose cuisine is often ignored by the Western mainstream is Cambodia, a sliver of land nestled between Thailand and Vietnam with its own deep vibrant cuisine that was almost lost to genocide in the 1970s.“I think Cambodian food is underrepresented because of Cambodia’s history,” says chef Chinchakriya Un, founder of Brooklyn pop-up restaurant Kreung Cambodia. “I stepped away from the Cambodian diet for a long time living in New York until I finally learned how to cook it myself with the help of my family.” Through her work, Un is dedicated to preserving and expanding her Cambodian culinary heritage and passing the knowledge down to future generations. One of Un’s most beloved staples of Cambodian cuisine is tuk trey ping poh, a sour-salty-spicy sauce with so many uses that you’ll want to make a big batch to keep on hand.Photo by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeWhat is tuk trey ping poh?Tuk trey is Khmer for “fish sauce,” while ping poh translates to “tomato,” so there are really no secrets to the sauce. Sweet, juicy tomatoes are roasted with shallots, garlic, and green Thai chiles until they’re blistered and ready to burst. The charred vegetables are food-processed into a coarse paste, then splashed with lime juice, seasoned with sugar and fish sauce, and sprinkled with fresh cilantro. The result is a tangy, umami-rich, spicy tomato sauce that is delicious on just about anything. “It's like our marinara or our salsa,” Un says. “It’s so good that I kind of just want it on everything.”How can you use tuk trey ping poh?Tuk trey ping poh can be used in a variety of ways: as a marinade for grilled fish, a flavor booster for a pot of beans, a dipping sauce for crudités, a sauce for meat, and can even be reduced into a starter for soups and stews. Un herself recommends using tuk trey ping poh to coat roasted potatoes, as a spread on fried chicken sandwiches, and even as a relish for a hot dog. “You can apply it anywhere you would use some type of tomatoey jam,” she says. “There are a lot of applications.”Are there any variations on tuk trey ping poh?If you find yourself with watery, out of season tomatoes, Un suggests making a twist on classic tuk trey ping poh by swapping out fish sauce for shrimp paste, which adds its own salty sweetness to the sauce. And since tuk trey ping poh is fundamentally simple, Un also loves to experiment with it by swapping out traditional ingredients for seasonal produce and things she can find easily at local markets. “I’ve made it with tomatillos because I’ve lived in pretty predominantly Latinx neighborhoods and they’re just around,” she says. “I also did it with blueberries one season! It was so good. As long as there’s some type of fruit or nightshade vegetable that you feel good about smashing and roasting, you can actually adapt this dish in so many ways.”Get the recipe:Tuk Trey Ping Poh With Pork ChopsTangy, spicy, and herbaceous, tuk trey ping poh is a versatile Khmer condiment that’s great served with any protein and as a dipping sauce and a base for soups and curries. Make extra!View RecipeExplore Bon AppétitBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-24", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}