{"id": "5e6fa4618b6eea1aaaa1938e9c5032e7", "url": "https://www.bonappetit.com/story/storchi-pozzoferrato-lambrusco", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Storchi Pozzoferrato Lambrusco Is The Perfect Pizza Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Bad at Math But Can Tell You That This Lambrusco + Pizza = HappinessIt’s the only formula I need.By Emily SchultzApril 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There’s something nostalgic and cravable about how bubbly beverages slash right through pizza’s bready-cheesy greasiness in such a satisfying way. But beer is too filling and soda is for kids! That’s where sparkling wine comes in. Sparkling wine and pizza go together like Bradley Cooper and Lady Gaga, which is to say, they go together perfectly. And there’s one in particular that’s become the non plus ultra for pairing in my book: a not-too-sweet lambrusco made by Gianna Storchi in Emilia Romagna, Italy, called Pozzoferrato. The first time I tried it was at Scarr’s, the old-school pizza spot that mills its own flour to the tune of throwback hip-hop in New York’s Lower East Side. As I made my way down the list of Hennessy Coladas and cheap beer, I stumbled upon something listed as a “Red Pet Nat.” So I ordered it—and have every visit since. Nothing beats its clean finish, which will please Two Buck Chuck folks and natty wine freaks alike. And of course, there’s that gratifying effervescence that also feels celebratory, even if it’s just a Tuesday night in the back of a slice shop. It’s so good, I won’t eat pizza without it—or at least something just like it. Can’t find the bottle? Just ask your favorite wine shop for help finding other lambrusco that fit the bill: not-overly-sweet, unfiltered, and absolutely perfect with a slice.Learn more: Storchi, ”Pozzoferrato,” Reggiano Rosso DOCExplore Bon AppétitHighly RecommendWineShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Emily Schultz"]}