{"id": "5e77aa53bb6837e3c563b90cbee16b20", "url": "https://www.bonappetit.com/recipe/pork-cutlets-with-fennel-cherries-and-basil-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Crispy Pork Cutlets with Fennel Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCrispy Pork Cutlets with Fennel SaladBy Molly BazMay 22, 20183.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintIf you have access to a butcher, ask them to cut the pork shoulder into steaks for you. If not, slice the shoulder crosswise into 4 equal pieces. Pounding the meat both tenderizes it and allows for a very quick cook time: a win-win for a weeknight meal.Ingredients4 servings 1cup fresh cherries4tsp. unseasoned rice vinegar, dividedKosher salt, freshly ground pepper1¼lb. pork shoulder (Boston butt), cut into 4 steaks¾cup all-purpose flour3large eggs2Tbsp. Dijon mustard, plus more for serving3cups panko (Japanese breadcrumbs)1Tbsp. plus 1½ tsp. fennel seeds1cup vegetable oil1large fennel bulb, cut in half lengthwise, thinly sliced, fronds reserved1lemon, halved lengthwise½cup torn basil leavesPreparationStep 1Place cherries in a large resealable plastic bag and lightly crush with the palm of your hand to extract pits. Tear cherries into large pieces and transfer to a small bowl; discard pits. Add 2 tsp. vinegar and season with salt and pepper. Set aside for serving.Step 2Working one at a time, place steaks in another large resealable plastic bag and pound to ¼\" thick. Place flour in a shallow bowl; season with salt and pepper. Lightly beat eggs and 2 Tbsp. mustard in another shallow bowl. Toss together panko and fennel seeds in a third shallow bowl.Step 3Season each cutlet with salt and pepper, then dredge in flour, shaking off excess. Transfer to bowl with egg mixture and turn to coat. Lift from bowl, allowing excess to drip off. Coat with panko mixture, pressing to adhere.Step 4Heat oil in a large skillet over medium-high. Working in batches, cook cutlets, shaking pan occasionally, until golden brown and cooked through, about 2 minutes per side. Transfer to a wire rack set inside a rimmed baking sheet; season with salt.Step 5Place fennel in a large bowl; squeeze ½ lemon over. Cut remaining lemon half into 4 wedges and set aside for serving. Drizzle fennel with remaining 2 tsp. vinegar and season with salt and lots of black pepper. Toss, squeezing once or twice with your hands to help soften fennel. Add basil and gently toss again.Step 6Divide cutlets among plates and top with fennel salad, fennel fronds, and reserved cherries. Serve with more mustard and reserved lemon wedges.How would you rate Crispy Pork Cutlets with Fennel Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleShould've used a chop instead of shoulder. Turned out tough as shoe leather. The fennel and cherries are delicious. AnonymousNashville 6/21/2020Pork chop was very crisp yet tender!Anonymousvienna, Austria4/14/2020Not sure why the author chose the pork shoulder, the cutlet came out very fatty.  Almost inedible!! AnonymousPhiladelphia, PA 6/18/2018Explore Bon AppétitCutletPork ShoulderPorkMeatCherryStone FruitFruitFennelVegetableSpringWinterFallEasyWeeknight MealsQuickMainDairy-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}