{"id": "5e79ca96140eec8ebf03b70db0eca7a2", "url": "https://www.bonappetit.com/story/sleep-supplements-sleep-peacefulli", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "These Sleep Supplements Got Me Through a 20-Hour Flight—and Jet Lag | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Sleep Supplements Got Me Through a 20-Hour Flight—and Jet LagI’ll never travel to a new place without these emerald green pills in my bag.By Alyse WhitneySeptember 26, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe first time I took a sleep aid on a plane, I was on a red eye from New York to San Francisco. It was my first cross-country flight, the sleep aid was ZzzQuil, and I slept for exactly zero hours. Over the course of many years and many flights since then, I’ve tried other, more natural, sleep-inducing methods: a few grams of melatonin, Sleepytime Tea, and the good ol’ fashioned wear-yourself-out-before-a-flight method—but nothing worked until last summer when, faced with a 20-hour trip to Singapore, I tried Liveli’s Sleep Peacefulli supplements, and I slept soundly for nearly the entire trip.Sleep Peacefulli came to me from Healthyish editor Amanda Shapiro, who, upon hearing that this was my first long-haul flight and I was panicking about sleep, handed me this supplement and told me it worked for her on the first try. I gave it a test run a few nights before leaving for Asia, taking one packet (two pills) an hour before I wanted to go to bed. I remember looking at the clock and closing my eyes, and the next thing I knew, I was awake again, an hour before my alarm was set to go off. I wasn't groggy; I felt rested and refreshed. On my flight, I took two pills again after the first meal was served and drifted in and out of sleep throughout the 16-hour first leg of my flight. After a four-hour layover and another four-hour flight from Hong Kong to Singapore, I was still exhausted, but I felt far more well-rested than I would have otherwise.This box is a month’s supply of Sleep Peacefulli, all in individual packets of two pills to bring on the go.\nPhoto by Chelsie CraigHow did this stuff work so much better for me than melatonin ever did? The answer lies in Sleep Peacefulli's blend of ingredients. At the supplement’s core are nootropics aka substances that enhance mental function. Melatonin is one of them, which basically tells your brain that the sun has set and it’s time to sleep. The Stanford-educated doctors who created Liveli supplements also added things that naturally occur in your body like 5-HTP (which increases serotonin levels) and GABA (a key neurotransmitter that has a calming influence on the brain) to help people fall asleep and wake up naturally. The combination of those precursors plus vitamins, minerals, herb extracts like chamomile, and even the popular stress-relieving adaptogen ashwagandha won’t knock you out cold, though. Instead of forcing your body to sleep when it shouldn’t, it just eases you into rest and gently helps you get up when your body naturally wants to. I liken it to when my dog is snuggled next to me and wriggles against my arm when it’s mid-morning on a Sunday. A nice way to fall asleep, and an equally pleasant way to wake up.The pills were at their most effective on the plane, but they also helped me adjust to the extreme new time zone. Singapore was 12 hours ahead of New York, so the jet lag hit me hard when I landed there and when I returned home a week later. Sleep Peacefulli helped me get back into a schedule. These days, when I have the Sunday Scaries or am on deadline for a big story, it helps me from running circles around my brain. Sleep Peacefulli isn’t a cure-all—if I am particularly anxious, I find it doesn’t always get me right to sleep, or I wake up in the middle of the night. But, overall, I find myself more well-rested and less frantic about sleep when I take it, and it will be in every bag that I travel with from here on out. Toothbrush? Check. Sleep Peacefulli? Check check. Now where's that curling iron that won’t fry overseas?Buy a 30-day supply of Sleep Peacefulli for $40 on AmazonAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishShoppingRead MoreshoppingThe CBD Oil That's Giving Me a Better Night's SleepBy Christine MuhlkecookingThis Recipe for Moon Milk is Better Than Counting SheepBy Alaina SullivanLifestyleThe Healthyish Guide to Finally Getting a Good Night's SleepGallery17 SlidesBy The Healthyish TeamLifestyle9 Foods That May Help You Get to SleepGallery9 SlidesBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Alyse Whitney"]}