{"id": "5e84bd81dbd30e858dd37c8d51792f02", "url": "https://www.bonappetit.com/story/grilled-swordfish-recipe", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Make Grilled Swordfish This Way to Celebrate the Steakiest Fish in the Sea | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Only Way I’ll Make Swordfish, the Steakiest Fish in the SeaThis swordfish recipe brought me to dinner nirvana in six ingredients and an hour flat.By Amanda ShapiroMay 24, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI’m not into steak. It’s a point of much contention in both my home life and at work (lay off me, everyone!), but I stand my ground. I don’t care how rare, dry-aged, or expensive your steak is. It’s just too much chewing. Grilled swordfish, though: Now that’s my kind of steak. Thick as a filet and slices like butter. And it doesn’t make me feel like a farm animal when I eat it.Luckily my usual dinner partner will forgo red meat in favor of swordfish if gently nudged, which is what I did last week while we stood between the fish and the meat counters at Eataly, aka my personal heaven. “Look!” I said, pointing to a page in the June/July grilling issue of Bon Appétit. It was this recipe—swordfish flanked by oranges and charred fennel—and it looked impossibly simple. We already had everything we needed in our basket except the beef of the sea.We didn’t get home until 8 p.m. because it’s really hard to leave heaven. Thankfully this recipe came together in under an hour, so I didn't have to fall asleep with my face in a plate of fish. While the grill heated up, we trimmed and washed the leeks and sliced the oranges. Then we threw the leeks whole onto the hot grill, where the outsides charred and the insides steamed, for about 10 minutes. (Notice how I’m saying “we”? My cooking companion would like you to know that he was doing all of this prep work while I was... supervising from the couch with the latest issue of O. I’d like to thank him, and Oprah, here.)While the leeks were charring, we smashed and pitted some green olives and cut a blood orange into rounds. The thing about slicing citrus into rounds is that it’s harder than it looks. You need a sharp knife and a sturdy piece of fruit. This recipe page has an illustrated guide, but if your citrus rounds look more like a citrus pile, don’t sweat it and also same.Once the leeks came off the grill, the swordfish went on for five or six minutes a side. We sliced the charred leeks, again very imperfectly, and tossed them with the olives along with some dill (the best herb!), white wine vinegar, olive oil, and a big pinch of salt. By the time that all came together, the swordfish was ready for us.Reader, this is the only swordfish recipe I want to eat this summer. The richness of the fish, the briny olives, the soft, smoky leeks made for a meal that tasted way more decadent than it actually was. The blood orange was a sweetly acidic palate cleanser between bites. But I was most impressed by how the whole recipe required only six ingredients—plus salt, pepper, and oil—and that it came together in under an hour. Just like that, I was back in heaven.Swordfish: It’s What’s For Dinner:Grilled Swordfish with Charred Leeks and CitrusFirm, thick swordfish steaks can handle being cooked over medium-high heat like a steak.View RecipeExplore Bon AppétitHealthyishSwordfishSeafoodGrillRead MoreshoppingSea to Table Is the Best Way to Get Guilt-Free Seafood OnlineBy Julia ShermanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Amanda Shapiro"]}