{"id": "5e842e8559a6fc2d82ed36641c267214", "url": "https://www.bonappetit.com/story/three-dishes-im-glad-i-ruined", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "The 3 Dishes I’m Glad I Ruined | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 3 Dishes I’m Glad I RuinedYou can learn a lot from a recipe I call Mangled Shrimp in Red Sauce.By Lillian Li April 5, 2018FacebookTwitterEmailIllustration by Hisashi OkawaFacebookTwitterEmailThere are two kinds of cooks in the world—or maybe just in my family. There’s my mom, who believes the recipe is law, to be read, memorized, and always within reach in the kitchen. If the recipe calls for crimini mushrooms, no other mushroom will do; if all the vegetables must be julienned, she will dutifully spend an hour cutting the carrots into precise matchsticks. Then there’s my dad, who will walk through the kitchen when my mom is trying a new dish and shake his head. “You’re working too hard,” he’ll say, trying to massage her shoulders loose. “I can see the sweat on your forehead.”I’m willing to bet that my dad has never looked at a recipe in his life. He also never makes the same dish twice. Growing up, we called his meals “experiments.” Even if he made a perfect batch of sweet-and-sticky spare ribs one week, we knew that next time he would throw in a different kind of vinegar or more salt, leaving us bereft at the too-sour, too-salty results.Until recently, I thought my mom was the better cook. But the more time I spend cooking on my own, the more I realize that my dad’s constant freestyling has given him a depth of knowledge and confidence that my diligent recipe-following has not. For Thanksgiving, he made a Peking duck–style turkey for 20 people, and he’d never made either Peking duck or Thanksgiving turkey before. I would have sweat my way through three outfits and consulted every cookbook and blog I could get my hands on. He watched videos of Ping-Pong tournaments the entire time and then took a nap. The Peking turkey was delicious, but more than that, it actually tasted like Peking duck! When I asked him how he pulled this off, he shrugged and said, “I knew I would figure it out.” I guess I shouldn’t have been surprised—he’d had five decades of ruined dishes to guide the way.If failure was the key to my dad’s success, is cooking badly the path to becoming a better cook? I realized I needed to rethink all the dishes I thought I’d ruined. What had I inadvertently learned from these mistakes? Turns out: a lot. Read on about the three dishes I completely fucked up and why I no longer regret them in the least.Illustration by Hisashi Okawa1. Tomato Frittata with an Herb ExplosionI love the idea of frittata—take some eggs, throw in leftovers, and voilà, you have breakfast, lunch, or dinner complete. Except that I rarely take frittata (or anything) so lightly. I still don’t know what got into me the day I made that tomato-and-herb frittata. I’d done my usual prep work of cross-checking recipes, but as I reached into the fridge to grab my thyme, I spied a package of leftover dill. I grabbed it too. What could go wrong?The first bite told me. And the second. And the third. Every bite tasted like dill. It overpowered the egg, the thyme, and the tomato. It felt like a dill bomb had been dropped in the middle of my meal. I forced myself to finish my plate, furious with myself. “Dill is such a BOSSY herb!” I texted my boyfriend, vowing never to make such a dumb mistake again.And I haven’t. As much as I’ve wanted to forget my frittata turned dill pickle, I haven’t managed to scrub those words from my memory: Dill is bossy. That’s good for flavors that could use some bossing around like potato, salmon, and cucumber. Not so much for an already flavor-filled frittata. I’d come to that conclusion all by myself. I hadn’t read it in a food magazine or online. And the few bites of frittata where I could taste the thyme felt so right, in comparison, that I will never forget how special thyme and tomatoes are together.Ruining this dinner taught me more about each ingredient in the dish than all my past research combined. You’ll never taste an ingredient more clearly than when it has no business being there.Illustration by Hisashi Okawa2. Mangled Shrimp in Red SauceCooking Chinese food feels especially nerve-racking for me. When I said before that my mom is a rule-following cook, the exception is the Chinese dishes she made for my family during the week. As a result, both my parents are uniquely bad at telling me how to make the food I grew up eating. When I ask them how to make a family classic, they skip steps and forget crucial ingredients because they’ve made the dish so many times that certain parts of the process are as unconscious as breathing. This was the case when I was trying to make one of my mom’s signature dinners: shrimp stewed with tomatoes. My mom can whip this up in ten minutes or less, minus prep. And it was the prep that was my downfall.The reason the sauce is red is because the shrimp is prepared with its head and shell still on. All the parts of the shrimp enrich and color the surrounding sauce, making it absolutely delicious over rice or sucked right off your fingers. My mom knew I would be nervous, so when she texted me the recipe, she added not only precise measurements, but also accompanying pictures. All except one step: How to clean the shrimp.I consulted the internet, which told me to use a sharp knife. Something in the back of my head said that wouldn’t work, but the experts had spoken. My sharpest knife couldn’t cut through the hard, wet shell, not without slipping and nearly nicking my fingers first. I had a pound of shrimp to devein, and every one that passed through my hands was mangled. My mom wasn’t near her phone, the internet had lied to me, and I was near tears. Finally, the image that had been floating in the back of my head asserted itself. I remembered as a little girl watching my mom with a pair of silver sewing scissors in the kitchen. Staring at the last piece of shrimp, I no longer cared what the experts on the internet said. I dug my sewing scissors out of a drawer, slipped the blade in the space between the head and the body, and snipped. The shell immediately fell away, exposing the vein. I triumphantly tugged it out. The shrimp looked beautiful, and with its shell split in two it made for easy peeling after cooking. It was the only one. The rest of dinner was a red-stained massacre.Ruining this dish taught me to trust my instincts, even if they seem untraditional, even if nothing on the internet corroborates my gut. What really is at risk, after all, of cooking off the beaten path?Illustration by Hisashi Okawa3. Homemade dumplingsThough I am an anxious cook, I have also been cooking for myself for five years now. My boyfriend, on the other hand, is just starting to branch out from microwave dinners and cold sandwiches. I thought we might have a fun time cooking together, and for some reason, I picked vegetarian dumplings…with homemade dumpling skins.While I made the filling, my boyfriend made the dough, which called for only two ingredients: flour and warm water. By the time I set the filling aside to cool, my boyfriend was still working on the dough. It was too dry, but he refused to add more water because the recipe didn’t call for it.Suddenly, I was parroting my dad, “Who cares what the recipe says!” I pushed a cup of water into his hands. Even with my bullying, he was too nervous to add much more. After letting it rest, we tried to roll the dough out, but it kept cracking from dryness. We would have to throw it out and start again.I didn’t think this was a big deal—the process was simple; we would lose at most 20 minutes. But my boyfriend felt like he’d ruined everything. As we started the new batch, he was sullen and silent. I thought about throwing him out of the kitchen and making the dumplings on my own, but that would defeat the whole purpose of showing him how great—how fun—cooking can be.“Don’t be a party pooper,” I said, without thinking. He smiled and apologized. The next batch of dough was much better. Our dumplings, filled with a heady mix of shiitake mushrooms, glass noodles, spinach, and scrambled eggs, were barely delayed.Thinking about all the meals I’ve ruined (way more than only those three), I wonder why we’re so quick to flagellate ourselves over our kitchen screw-ups. What’s so awful about a too-salty steak, or stringy cauliflower mash? Certainly no one enjoys eating gross food. But also, on an elemental level, we’re all afraid of failure. So we over-prepare, refuse to improvise, and sometimes turn into total grouches. Worse, we declare that we’re “bad cooks” and banish ourselves from the kitchen. We forget that our mistakes can and should be folded into the batter of our cooking experience; that the joy of cooking is simple and forgiving. Of course, I still shudder at the idea of taking on a whole turkey blind. But now I can imagine a day when I demolish an entire Thanksgiving dinner and burst into laughter instead of tears. I’m almost looking forward to it.Lillian Li is the author of Number One Chinese Restaurant, a novel about the intertwining lives of the waitstaff and owners of a Maryland Peking duck house, out this June from Henry Holt and available for pre-order now.Explore Bon AppétitCooking TipsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-05", "author": ["Condé Nast", "Lillian Li"]}