{"id": "5e881bf06835ab7625afea25343b3f8e", "url": "https://www.bonappetit.com/recipe/skillet-salmon-with-pickle-y-salad", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Skillet Salmon With Pickle-y Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueSkillet Salmon With Pickle-y SaladBy Devonn FrancisJanuary 1, 20213.9(51)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintThe award for best supporting actor goes to this bright, tart root vegetable salad. Slice the daikon and carrots as thinly as possible so there’s tons of surface area to absorb the coconut garlic glaze. The subtle sweetness in that glaze comes from coconut aminos, made from the fermented sap of coconut palm trees. Coconut aminos offer some of the same flavor notes as soy sauce but with less sodium and no soy or gluten. Look for coconut aminos (Bragg is a common brand) in health food stores, Whole Foods, or online. This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servingsGlaze2garlic cloves, finely grated⅓cup sherry vinegar or red wine  vinegar¼cup coconut aminos1Tbsp. fish sauce1½tsp. sugarSalmon and assembly½cup almonds3Tbsp. extra-virgin olive oil, divided45–6-oz. skin-on salmon filletsKosher salt, freshly ground pepper½medium daikon radish (about 1 lb.), peeled, halved lengthwise, thinly sliced on a diagonal3medium carrots (about 8 oz.), peeled, thinly sliced on a diagonalPreparationGlazeStep 1Cook garlic, vinegar, coconut aminos, fish sauce, and sugar in a small saucepan over medium-high, stirring occasionally, until reduced enough to coat a spoon, 7–9 minutes. Let cool.Salmon and assemblyStep 2Toast almonds in a dry small skillet over medium heat, tossing occasionally, until slightly darkened and fragrant, 5–8 minutes. Let cool, then coarsely chop.Step 3Meanwhile, pour 2 Tbsp. oil into a cold large nonstick skillet. Season salmon with salt and pepper and place, skin side down, in oil. Set over medium heat and cook, pressing fillets gently with a spatula so skin makes good contact with the pan, until skin is browned and crisp, 5–7 minutes. Press down in the center of fillets if they begin to lift from pan. Turn fillets over and cook on flesh side until just cooked through, about 1 minute.Step 4Combine daikon, carrots, almonds, half of the glaze, and remaining 1 Tbsp. oil in a medium bowl and toss to coat. Add a pinch of salt and toss again.Step 5Serve salmon and pickled daikon and carrots with remaining glaze alongside.How would you rate Skillet Salmon With Pickle-y Salad?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI love salmon, I love root vegetables, so I was really looking forward to this recipe.   The glaze was quite lackluster, not at all pickley and overly fishy.  I am not sure how this would be a pickled salad without the vinegar... It seems like there should have been an acid instead of the sauce.   Cooked according the directions the first was also quite dry.   This is definitely the worst executed recipe I had yet to try in BA history (although not the worst to come in this FGFP).  The dinner concluded with the ordering of pizza.Anonymous2/15/2021I spent time finding coconut aminos. I spent  time slicing carrots and daikon thinly on the diagonal. I regret every minute and every penny I spent making this recipe. It sounded some promising yet the sauce was so awfulAnonymousPleasant Hill CA2/4/2021This was a deeply disappointing recipe and I would not make it again. I don't understand what the glaze was supposed to be, but it was just bad—terribly, almost inedibly salty, with no acidity from the vinegar coming through at all. While the glaze was cooking, it was nose-searingly pungent as well. I also don't understand how adding the glaze to carrots and daikon could make them \"pickle-y\"; if you want quick-pickled daikon and carrots, just toss them in rice vinegar, a sprinkle of sugar, and a pinch of salt for 10+ minutes. Searing the salmon skin starting from a cold pan worked reasonably well, but then I had to cook the fillet for 10 minutes or so on the other side, not the 1 minute the recipe proposes, in order to not eat raw fish for dinner, which made the skin a little soggy. (Minor additional gripe: Why show the carrots and daikon julienned in the picture if the recipe says to \"slice thinly on the diagonal\"? Readers > Instagram.) Bad recipe, steer clear.SonaliNew Haven, CT1/14/2021Enjoyed this dish very much. Fish sauce smell was strong while making the glaze, but it did not overpower the sauce and the end product was well balanced. Fish was cooked perfectly and this was the first time I enjoyed eating salmon skin. Not sure why the salad was described as pickle-y, but it sure was tasty.CookFitFoodDallas, TX1/10/2021This recipe was AMAZING!!! Super easy, light, and delicious.claudiaeleniDenver, CO1/8/2021The salad was nice. I was unable to get daikon so subbed regular radishes. I also added a few handfuls of spinach leaves. Worked great. Terri Victoria, BC Canada 1/8/2021WOW! This is so freaking good man, definitely my favorite recipe so far. I didn't make any changes and it came out perfect. Loved the crispy salmon skin, it was probably my favorite part, that and the glaze, it was heavenly :-)Laura EChula Vista, CA1/7/2021Super easy, super yummy. Made it on night 1 of the feel good food plan (which my husband was dreading due to healthful mandate) and he loved it! Said he would definitely have it again. Really looking forward to the next 7 nights!!JamieOrange County, CA1/5/2021Made last night - would definitely make again with a couple of changes. I would not salt the salad as directed, the soy sauce adds enough salt. Feel like it could use some citrus to cut the salt and fish sauce a bit - maybe a squeeze of lime will do the trick. Overall a great, light weeknight recipe!feenProvidence, RI1/4/2021Made this tonight for my partner and we loved it! Fresh flavours and quick and fun to cook. We served with rice cooked with coconut milk which probably cancelled out a little of the healthy but it was worth it. Great recipe.Anonymous1/4/2021I have made TONS of BA recipes and many have become go to’s, but I would not recommend this to anyone. Maybe it’s my general dislike for fish sauce forward dishes, but this recipe is just strange. The glaze was very fish sauce forward, but put that aside and the dish still needs some editing. Fish Sauce FoeLos Angeles, CA1/4/2021Explore Bon AppétitSalmonFishSeafoodEasyMainDairy-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}