{"id": "5e961882ddf005166e3f45d6f467e235", "url": "https://www.bonappetit.com/story/acid-league-vinegars", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Acid League Vinegars Come to My Rescue When I'm Bored by My Own Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhen I’m Bored by My Own Cooking, I Turn to Acid League’s Faaancy VinegarsAcid League vinegars bring big league flavor.By Kendra VaculinMarch 23, 2022FacebookTwitterEmailPhotograph by Isa Zapata, Food Styling by Judy Kim, Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In the weeks before I graduated college, I exhibited a very specific form of senioritis: To put off writing final papers, I instead made list after list of all the ingredients I wanted to stock in my first adult pantry. Building a grown-up kitchen was the most exciting thing I could imagine, and I dreamed big. Sure, I wanted a real bottle of soy sauce rather than a heap of mini takeout packets. But I also envisioned shelves teeming with baking supplies and a quantity of spices rivaled only by the aisles of an actual grocery store. My inventories—which were written like a smitten 7th grader doodling her crush’s name over and over—were extensive and impractical. Where would I even store all those flours?! In reality, the only section of my list that made it to the shelf in full was the one titled VINEGARS.I love vinegar, and all the heavy hitters that featured in my 22-year-old vision still sit prominently on my shelf today: sherry and champagne vinegar for salad dressings; apple cider vinegar for braised greens and beans; rice and black vinegar for sauces and marinades; balsamic because you never know. I think of them like a little acidic family, sisters not twins, alike in brightness but each bringing something unique and special to the table. I love that they always have my back when whatever I’m cooking needs a little *something*—I can open the cabinet and reach for one of the crew. But even with that variety built into my pantry, I am liable to fall into a vinegar rut. I know there are no rules, but I turn to the same vinegars for the same applications over and over, reinforcing a pattern that yields the same (good, but expected) flavors every time. At least, that was the case before I tried Acid League.Skip to 15:20 for Kendra's Acid League vinegar Tom Collins recipe.\nAcid League launched in 2019 and quickly became a Hot Girl Vinegar, thanks to exciting flavors, pretty bottles, and savvy marketing. The company offers a diverse array of products that are, by their own definition, “science-driven experiments in acid, with a chef's focus on flavor”—vinegar being their central effort. I was wary of buying into the hype at first, as I’d been burned by a few slick Instagram ads before and felt very protective of my limited pantry space. On a trip through Whole Foods, however, I came across the company’s Garden Heat variety and brought the bottle home to add to my long-standing collection; now I’m a disciple of the church of Fun Vinegars, a category of pantry staple I think is just as important as the basic bottles you know you have to own.Big League Vinegar Kit$49 at Acid LeagueFun vinegars bump your go-to dressings and sauces to 11, adding another element of flavor and a bit of complexity that you and your mouth are not expecting. They’re not meant to supplant your regular vinegars entirely but instead shine when your dishes require a shake-up. I like Acid League because their flavors are exciting but not overpowering, versatile and full of character, the kind of thing that makes people ask, “What’s in this?” They’re punchy but not kitschy, if that makes sense—unlike other “flavored” pantry items, they’re liable to become real staples, rather than get used just once as a gag. Despite their creative names, these earn their keep as regular parts of the rotation.If you have identified some holes in your own vinegar collection, there’s an Acid League flavor that’s right for you. The company has an extensive line-up, with core flavors as well as seasonal and limited-edition drops (all are winners, IMO). As a lover of vinegar-based hot sauces, Garden Heat spoke to me immediately; it’s not spicy but definitely warm, fresh, and vegetal thanks to carrot, celery, and jalapeño juices. I love it as a pickling liquid, in a fried chicken brine, or as part of a cocktail—especially with gin. Because I’m often craving a squeeze of lemon or lime over a finished dish, I gravitated to the citrus flavors as well, like Meyer Lemon Honey or Rare Citrus, which is deep orange and includes bergamot, yuzu, and grapefruit. And though I never would have guessed it, Roasted Vegetable Balsamic rose to the top of the pack for me as well. Unlike sticky-sweet grocery store versions of balsamic vinegar, this one has a savory, caramelized onion-like depth that I’ve been shaking into stews and stir fries with abandon.Garden Heat Vinegar$15 at Acid LeagueIf you don’t know where to start on your Fun Vinegar journey, Acid League sells a Big League set with four rotating flavors—the ideal way to get a feel for what you like and break yourself out of a basic vinegar rut. You’ll be surprised at how all of your tried-and-true marinades and sauces feel new with just one substitution, and you might find yourself daydreaming about all the ways your new vinegars could light up your pantry. If you start doodling flavor names in the margins of your notebook, don’t say I didn’t warn you.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-23", "author": ["Condé Nast", "Kendra Vaculin"]}