{"id": "5eb351299b25172f4f0daf3448a28a67", "url": "https://www.bonappetit.com/story/miso-eggs-from-salt-fat-acid-heat", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "The Miso Eggs from ‘Salt, Fat, Acid, Heat’ Are a Cool Party Trick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Miso Eggs from ‘Salt, Fat, Acid, Heat’ Are a Pretty Cool Party TrickThe method inspired me and a bunch of other viewers. Here’s how it works.By Alex BeggsNovember 28, 2018FacebookTwitterEmailCourtesy of NetflixFacebookTwitterEmailI molded a handful of soft miso paste around a slippery hard-boiled egg until it looked like something found at the bottom of the ocean. Then I waited.These miso-cured eggs are one of the breakout recipes, so to speak, from the new four-part show Salt, Fat, Acid, Heat on Netflix, based on Samin Nosrat’s bestselling cookbook of the same title. (Sidenote: Not just any cookbook. This book is a modern classic; it rethinks the ways we learn how to cook. Read it and your cooking will be forever improved. Moving on!)In the “Salt” episode, Nosrat travels to Japan to dive into salt-making, as well as soy sauce and miso production. When she meets with author Nancy Singleton Hachisu, they make miso-cured eggs, that look both incredibly easy and salty-funky-delicious. They shape the miso into a patty in their palms, then wrap 8-minute hard-boiled eggs in them, wait four hours, remove the miso with their thumbs, and serve the miso-permeated eggs sliced in half with a sprinkle of shichimi togarashi (a powdered spice mix; try it on popcorn too). There’s something about it that immediately inspired this viewer (and many others!) to try it. It’s eggs. Miso. Patience. If anything—a cool party trick.In Hachisu’s 2015 book, Preserving the Japanese Way, her recipe for miso-cured eggs, tamago no misozuke, was a logical next step after making soy sauce pickled eggs. I followed along to make mine, and put them in the office mini-fridge to hang out for the afternoon.Step 1: Make a patty of miso\nPhoto by Kenji MiuraStep 2: Wrap your hard-boiled egg in it.\nPhoto by Kenji MiuraStep 3: Really tuck it in.\nPhoto by Kenji MiuraStep 4: Pull them from the fridge after 4 hours.\nPhoto by Kenji MiuraStep 5: Serve!\nPhoto Courtesy of Nancy Singleton HachisuThough my miso was softer and didn’t form as Play-Doh putty like hers, I did my best. The result of my sloppy version: Salty! After wiping away the miso (which Hachisu recommends saving and reusing for more eggs or in soup), I cut the eggs in half and shared them with colleagues. The egg whites had gotten firmer and were outlined with a light brown layer from the sunken-in miso; inside the yolk was still gooey. On its own it was sal-ty, but I’d love it in a salad or soup, or with avocado for breakfast like this person did to balance with other flavors. I used a LOT of miso for only two eggs, so I won’t be pulling a tray of more than four miso-cured eggs out at any big parties. I’m no millionaire. But it was still a fun novelty.In her latest cookbook, Japan there’s a recipe for three-day miso-pickled egg yolks that can be your next experiment. “Pickling in miso ‘cooks’ raw egg yolks and transforms them into creamy, salty, earthy bites,” she writes, and suggests snacking on these with a glass of cold beer or sake. The yolks are dropped into divots in a container lined with miso, then topped with a blanket of more miso. Next level.Get the recipe: Miso-Cured EggsExplore Bon AppétitSaltMisoPop CultureNetflixHard-Boiled EggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-28", "author": ["Condé Nast", "Alex Beggs"]}