{"id": "5ebaac3633354f9efbce82106a6b0ecf", "url": "https://www.bonappetit.com/story/steak-and-potatoes-night", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Steak and Potatoes Night in America | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSteak and Potatoes Night in AmericaIt's a classic for a reason.By Adam RapoportOctober 1, 2019FacebookTwitterEmailPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“Steak and baked potatoes tonight.”That’s all the text said and that’s all it needed to say.As much as I appreciate learning about new ingredients, techniques, and cuisines here at Bon Appétit, sometimes I just want to run it back old school.So when Simone texted me with her plans for dinner, I was all in. And I immediately thought of Alison Roman’s feature in our September Issue.Roman, who has logged more than a few dinners at Keens Chophouse on West 36th Street in Manhattan, aptly points out that if you nail the details, you can approximate a steak dinner that will even exceed that of most temples of dry-aged beef.Want this letter before it hits the website? Sign up for our newsletter!Photograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiIt starts, of course, with a martini. Roman endorses pre-batching a pitcher of 50-50s—half dry vermouth, half gin, served on the rocks with an olive. My wife likes a vodka martini, shaken, two lemon twists, up. The point is, you get to mix the iconic cocktail exactly the way you want it, and you don’t have to pay $18 for it.Speaking of how you want it, let’s talk about baked potatoes. You know how you don’t want it? Wrapped in foil, the skin all steamed like a soggy newspaper. Roman and contributing editor Andrew Knowlton know better—rub up your russets with olive oil, hit them with a generous sprinkling of kosher or sea salt, and some cracked black pepper. Then place them directly on the rack of ripping hot oven. The skin emerges all crackling crisp, the interior all fluffed up, awaiting an absurd amount of butter, sour cream, chives (more subtle than scallions), and if you’re fancy like best-selling author Roman, a dollop of caviar.Photograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiAnd the steak itself? (A) Buy the best you can afford. (B) Preferably dry aged. (C) If you want to be like Roman, and not smoke out your apartment, you can go the slow-roasted prime rib route. Oven > stove top; less hands-on hassle.But a three-bone prime rib wasn’t an option at my butcher, so I got a two-inch-thick porterhouse, and did like Roman’s boy Bobby Flay, who utilizes a cast-iron skillet and a broiler to bring Brooklyn’s famed Peter Luger’s buttery, sizzling steak to your kitchen. It’s kind of a genius technique. I highly recommend it.I could go on about needing something green on the table, and a classic dessert. But you already get the picture—it’s Steakhouse Night in America.Get the recipes:1 / 5ChevronChevronLow-and-Slow Rib RoastView RecipeExplore Bon AppétitAdam NewsletterSteakPotatoMartiniRead MorecultureHow to Host a Dinner Party Without Losing Your Mind, According to Alison RomanBy Alison RomanrecipesAlison Roman’s Steakhouse Night at HomeGallery5 SlidesBy Alison RomanrestaurantsSteak and Martinis Are Forever. Dear John’s Is Ephemeral.By Alex BeggscookingHow To Speak Fluent MartiniBy Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-01", "author": ["Condé Nast", "Adam Rapoport"]}