{"id": "5ec601456630b73561ad30382642ea42", "url": "https://www.bonappetit.com/story/tandoori-chicken-wings", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "A Tandoori Chicken Recipe for Tangy, Spicy Wings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCharred, Spicy, and Tangy Tandoori Chicken WingsA new recipe that will show you the wonders of chicken marinated in yogurt.By Molly BazJuly 31, 2018FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Judy ManciniFacebookTwitterEmailThis Tandoori Chicken Wings recipe, using your blazing hot charcoal grill in lieu of a traditional tandoor clay oven, is the latest creation to come out of the BA Test Kitchen, because nothing screams summer like a charred piece of grilled chicken. (Okay, maybe lobsters scream it louder.) Smoky and supremely juicy, grilled chicken is one of life’s greatest pleasures. So what happens when you take the chicken and the smoke, and add a marinade of yogurt, garlic, ginger, cilantro, and garam masala to this whole scenario? Things get even TASTIER.For those of you who have never before marinated your chicken in yogurt, may I encourage you to do so immediately? If not sooner. Time is of the essence, people. Yogurt serves two very important purposes when combined with meat. One: it tenderizes the chicken and fends off dry overcooked meat, guaranteeing juicy wangs. Two: the naturally occurring sugars in the yogurt gently caramelize as these babies cook, creating a crust of flavor that’s tangy and slightly sweet.Ginger-mint lemonade would pair excellently with these wings.\nBut there’s more than just yogurt at play here. The marinade gets heat from Fresno chiles and fresh ginger, and brightness from lemon juice. There’s a generous helping of garam masala, giving it that iconic tandoori-spiced flavor. Don’t expect to find day-glow orange tandoori chicken here (Red Dye #40 is often used to suggest a fiery heat). The rust-red color of these wings comes from lots of paprika and fresh red chiles.The best part of the marinade is that it all gets blended in a food processor and then dumped into a resealable Ziplock bag along with the chicken wings—easiest clean up ever. Let the wings sit as long as you can (overnight is ideal, but you can do 2 hours) in the marinade so the flavor and texture will only get better and better. If you throw these ingredients together on a Tuesday night, let ‘em marinate til Wednesday and have yourself a satisfying and necessary hump-day wing party.Get the recipe:Tandoori Chicken WingsThe yogurt tenderizes the chicken as it sits, so the further in advance you make it, the better!View RecipeAnother Molly recipe to bookmark:Explore Bon AppétitChickenChicken WingGaram MasalaGrillRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-31", "author": ["Condé Nast", "Molly Baz"]}