{"id": "5ecd02326e805dc10dccdacba065f117", "url": "https://www.bonappetit.com/story/trinas-starlite-fridge", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "At Trina's Starlite Lounge, the Fridge, Not the Bartender, Hands Out Advice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhere the Fridge, Not the Bartender, Hands Out AdviceThe small fridge covered in those clunky, colorful magnetic letters wisely spits out life’s bittersweet truths for patrons to enjoy alongside their $4 ’Gansetts.By Oset BaburJune 6, 2018FacebookTwitterEmailPhoto by Pat PiaseckiFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.The first time I walked into Trina’s Starlite Lounge in Somerville, Massachusetts, I immediately noticed two things. One, that whoever owned this place shared my favorite style of decor: anti-minimalism. The other was a small fridge behind the bar covered in those clunky, colorful magnetic letters I used to get hooked on phonics back in grade school. Every day the fridge wisely spits out platitudes and life’s bittersweet truths for patrons to enjoy alongside their $4 ’Gansetts—things like “A job is more than a paycheck—it’s also a place where you cry in the bathroom”; “I have to plug my phone into the charger so much I basically have a landline again”;  and, serving up some stone-cold nostalgia, “The year is 2015. Trap Queen is playing on the aux cord. Obama is President. Life is good.”This chicken. So good.\nPHOTO BY PAT PIASECKITrina’s isn’t the most harmonious space—the walls are jammed full of old-school beer signs and a plaque proclaiming this to be “the friendliest place in town.” The greeter stand is illuminated by the same kind of library desk lamp that now permanently occupies suburban basements across America. There’s a disco ball above the bar where plaid flannel shirts and local yuppies in rumpled Patagonia Better Sweaters drink off their weeks. College kids who can’t spring for the $14 cocktails down the block huddle up in the booths to devour plates of magical fried chicken and Ritz cracker–topped mac and cheese. But Trina’s is so earnest in its quest to serve as home base for devoted locals who rarely ever drink outside of Cambridge or Somerville that it’s impossible to envision it ever being any other way.At some point in the night, you’ll realize that it’s actually the fridge that ties this all together. It blesses awkward first dates with a conversation starter, and its daily mantra sets the tone for the pregamers and the postgamers who wear different levels of optimism or exhaustion depending on how late it is.Vibes. It's all about the vibes.\nPHOTO BY PAT PIASECKIThe more jaded (read: too sober) will write the fridge off as a gimmick and complain about the less-original messages that have already made the rounds on Pinterest or Twitter (“January was a tough year, but we made it”), but those folks are missing the point. Trina’s isn’t trying to reinvent the wheel. It’s a neighborhood watering hole that makes you wonder: Does everyone here somehow know each other? And then return to your plate of tater tots, which taste exactly as good as they did at the end of your most ruinous nights out in college. “It’s officially ‘once I’m here I ain’t going back out season’” the fridge declared one night in January. And why would you want to?Oset Babur is a writer, editor, and digital strategist.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsFried ChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Oset Babur"]}