{"id": "5ed446486df1ccb8ef7c1104b9c2aa7b", "url": "https://www.bonappetit.com/story/never-fail-green-tahini-sauce", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "The Spicy Green Tahini Sauce That's a Hit at Every Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingForget the House Cocktail, I Have a House DipI'm making this spicy green tahini sauce for every party from now 'til September.By Christina ChaeyJuly 5, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I used to think that having people over for dinner had to be elaborate affair that must involve some fancy braised short ribs that took days to make, shrimp cocktail, and like, a soup course. The reality is that no one ever wants a soup course, and also most people don’t really care what you cook for them—they just want to hang out and drink wine.These days, my dinner party strategy is to delegate as much as possible. I’ll ask my wine-obsessed friend to bring a bottle or two of whatever she’s digging at the moment. The friend who works around the corner from the farmers’ market is responsible for procuring good bread. And me? I make a simple main (like this jammy summer squash pasta) and house dip, then dump a bag of pita chips into a pretty bowl (no offense, Stacy) and call it a night.What is \"house dip,\" you ask? It’s the dip that you can whip up using only ingredients you already have in your fridge and pantry. (If you have to take a trip to the store to make it, it’s not house dip.) House dip tells your guests, “I really like you, but I’m not trying to spend an entire day cooking for you.” Lemony garlic yogurt—which is exactly as easy as it sounds—is my standard, and you will not believe how many people ask, “WhaAAaaT is THIIIIS?” every time I make it. But when it’s summer and the herbs are the freshest they’ll be all year, I am HERE for this Fiery Green Tahini Dip.This creamy, spicy, fresh-as-hell, vibrantly green dip is just a bunch of fresh herbs blended with lemon juice, chiles, fresh herbs, garlic, extra-virgin olive oil, then whisked together with some creamy-dreamy tahini. Das it! (Oh, and salt. Most people criminally under-salt dips. Don’t.) It’s one of those recipes that combines familiar flavors in a way that feels fresh and new and different. It also goes with everything: Ruffly potato chips. Wildly expensive Little Gem lettuces. Crunchy radishes. Falafel. Crunchy vegetables of all stripes. Cold chicken. Hot chicken. Fried chicken!The real beauty of this dip is that almost every single fresh ingredient can be swapped for whatever you have in the house. Use limes instead of lemons, jalapeños or even a seeded habanero (if you’re feeling ~*sPiCy*~) instead of serranos. Any mix of soft herbs can replace some of the parsley; at my house that means a big handful of basil from my jaunty new plant. Whatever you choose to swap in, don’t overthink it—I promise it will still be delicious as long as you don’t skip the base of garlic, olive oil, tahini, and salt.So the next time you have friends over and set out a bowl of this and someone inevitably asks, “WhaAAaaT is THIIIIS?” you’ll know what to say: “Oh, this? It’s house dip.”Get the Recipe:Fiery Green Tahini SauceThis is the condiment version of those summer sandals you want to wear with everything.View RecipeExplore Bon AppétitNever FailDipCrudite DipEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-05", "author": ["Condé Nast", "Christina Chaey"]}