{"id": "5ee25cfbfc82854ed1697f98fa329632", "url": "https://www.bonappetit.com/story/mussels-escabeche", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "A Mussels Escabeche to Make at Home and Eat With Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Only Holiday Plan Is Making My Own Mussels in EscabecheGoing the DIY route allows for maximum freshness, customization, and affordability…and what else do you have planned anyways?By Benjamin KemperDecember 21, 2020FacebookTwitterEmailFacebookTwitterEmailEven after six years living in Madrid, scoring a free tapa with every drink still feels like hitting pay dirt to me. Whether my beer arrives with a froufrou canapé or a mess of hacked-up jamón, I graciously accept whatever morsel is thrust my way. But I can’t hide my glee when the tapa du jour is my standout favorite, mussels in escabeche spooned over potato chips, their crimson vinegary juices trickling down through the salty crevices.Escabeche is the catchall term for cooked meat or seafood soaked in spiced vinegar. It’s one of the oldest methods of food conservation—and perhaps one of the healthiest, since escabeches rely on acid and spice as opposed to salt or fat. While we have the Romans to thank for Spain’s salt-cured delicacies like jamón and anchovies, the Moors likely brought acid-based escabeches to the Iberian Peninsula several centuries later. Escabeches have much in common with ceviches, which rely on citrus juice instead of vinegar: The two share the same Persian root word sikbāg, according to the Washington Post and other sources, so this connection makes sense considering that the Spanish may have brought this particular use of vinegar to Peru during colonization.I missed this humble dish so much during Spain’s tapas-less quarantine that I set about re-creating it from scratch. And along the way I realized just how versatile the garlic-and-paprika-marinated mollusks could be, whether piled into a baguette, spooned over stewed legumes, or tossed with chilled bowties and fresh herbs for a bright, oceany pasta salad. You can find mussels in escabeche in tins, but making them at home allows for maximum freshness, customization, and affordability. (Canned mussels can set you back more than $23 a pop, while fresh ones rarely exceed $3 a pound.) Luckily, my friend Pablo's abuela had an old recipe tucked away. I tinkered with her formula until it transported me back to the barstool of my still-closed neighborhood bar. Here’s where I netted out.Start with 4 pounds fresh mussels, which will make roughly 8 appetizer-size portions (or a few hearty solo dinners) . Any variety will do, but the cultivated ones have less grit and are sustainable to boot. Scrub the shells with the rough side of a sponge to remove any sand and seaweed (don’t worry if some barnacles remain), and put them in a large pot with a lid. Pour in 1 cup dry white wine, such as Spanish albariño, cover the pot, and steam over high heat until the mussels open, 5–10 minutes. Use tongs to place them in a bowl, reserving the liquid. When cool enough to handle, take the mussels out of the shells with your fingers, discarding the shells and any mussels that haven’t opened. Snip out the seaweed “beards” from each mollusk with scissors and discard. Strain the juices in the pot through a fine-mesh sieve into a bowl or 4-cup measuring cup.For the marinade, set a skillet over medium heat and add ½ cup extra virgin olive oil, 1 large onion, finely chopped, 4 dried bay leaves, 2 cloves, 8 peppercorns, and 8 garlic cloves, unpeeled and lightly smashed with the back of a knife. Fry until the onion is soft and the cloves are golden at the edges, about 10 minutes. Remove from the heat for five minutes, then add 2 tsp. smoked Spanish paprika (a.k.a. pimentón), ½ cup white wine vinegar, 1 Tbsp. table salt (or 2 Tbsp. plus 1 tsp. Diamond Crystal kosher salt), and 1½ cups of the reserved juices, and stir it all together (the mixture will remain somewhat separated).Place the mussels in a jar or bowl and pour the liquid on top. Seal the container tightly and refrigerate the mussels for at least 24 hours before serving. They will absorb more flavor over time and keep for up to 10 days, although mussels in escabèche never last that long in my house—especially when there are potato chips in the cupboard and beers in the fridge. I’m doubling my next batch for holiday charcuterie boards and impromptu hangouts with my pod. There’s something undeniably festive about toothpick food—and devilishly satisfying about spooning leftovers, marinade and all, onto crusty European bread to eat alone.Explore Bon AppétitHealthyishRead Morecooking73 Healthy Soup Recipes That Make Any Day CozierGallery73 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-21", "author": ["Condé Nast", "Benjamin Kemper"]}