{"id": "5ee22ec236c7f4651f8f4a6dc87a1eea", "url": "https://www.bonappetit.com/story/best-worst-take-out-counter-employee", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Best Worst Bertucci's Take-Out Counter Employee Suburban Boston Has Ever Seen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Worst Take-Out Counter Employee Suburban Boston Has Ever SeenMy summers doing who even knows what at Bertucci’s.By Hilary CadiganApril 16, 2019FacebookTwitterEmailPhoto by Joe St. PierreFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.It started with the rolls. That’s what they tasked all the newbs with on day one at Bertucci’s: Pull the giant white plastic containers full of perforated dough slabs from the walk-in, carry them to a flour-splotched counter at the back of the open kitchen, pull them apart, and plop them one by one onto a baking sheet.When you first learned to plop rolls, you were careful, until eventually you realized it didn’t really matter if you left fingerprints or plopped them too close or even if you made them into star shapes instead of balls. They’d puff up the same anyway—interiors warm and soft, exteriors round and crusty. And if they did end up fusing into one big giant mega roll, well, that meant you got to eat a free snack furtively behind the dumpster with a plate of stolen pizza sauce for dipping, and you could invite Chase the private-school coworker you were in love with to eat with you and earn his respect by mercilessly making fun of your manager Brent and his too-tight pants.I began working the take-out counter at Bertucci’s the summer after my junior year of high school. I’d spent the previous summer as a lifeguard at the local country club, testing urine-to-chlorine ratios, pretending to keep my eyes open behind my sunglasses, eating free chicken fingers from the snack bar, and occasionally getting an entire paid day off because somebody pooped in the kiddie pool and all the pools were connected by one central underground pump. Being a lifeguard was pretty sweet, but I “didn’t get asked back” (which is the country club way of saying you’re fired) so there I was, with the rolls.This is not actually the Bertucci's I worked at, because that Bertucci's no longer exists. But it is a Bertucci's.\nPhoto by Joe St. PierreLocated just down the street from my suburban Boston public high school, my Bertucci’s was one of several dozen iterations of the family-friendly red sauce chain. It beat the Olive Garden in seniority by one year (1981, baby) but never expanded past Virginia, thus retaining a decidedly New England deficit in mass-market sheen. The ceilings were high and the walls were fake stucco, painted the color of old salmon and dotted with black-and-white posters of Sicilian men riding bicycles. The soundtrack was one scratched CD over and over, featuring strummy guitar versions of every quintessential Italian song plus for some reason “The Teddy Bears’ Picnic.”Days at the take-out counter went like this: Come in wearing the same black shirt-pants combo as yesterday, make the rolls, wait for the phone to ring, ignore Chase in an effort to mask your desperation, plug orders into the POS system, try not to get accidentally-on-purpose branded by a hot paddle when the cooks pulled pizzas from the brick oven, cut said pizzas into reasonably similar-size slices, put an olive in the middle as a symbol of hospitality and perfection (our gift to you!), then wait for people to come pick them up and give you somewhere between zero and two dollars as a tip.One of the best things about working take-out at the ’Tooch was that we got to bring home any orders that didn’t get picked up by the end of the night. Not one to miss out on a perfectly good opportunity, I’d have my friend Olivia call in fake orders and usually leave each night with at least two ~ mysteriously ~ unclaimed pizzas. Also not one to be discreet about anything, I told the entire take-out team about my scam, and for several weeks we were all pizza-flush. Then one night Brent noticed the dozen unclaimed pizzas left on the to-go rack, took them out back, and as we all watched in horror, individually stomped on each one and threw them in the dumpster.That was the end of free pizza.The pizza scheme was not the reason I got fired from my job at Bertucci’s. The reason I got fired from my job at Bertucci’s was that one weekend I happened to be in Martha’s Vineyard with my best girlfriend Harms, when suddenly my Nokia flip phone began to ring. I flipped, and who should it be but Chase, oh boy! “Where are you?” he said, and I got very excited until I realized he was asking because I was supposed to be at Bertucci’s. Brent came on the phone next and screamed: “I DON’T GIVE A SHIT WHERE YOU ARE, BUT IF YOU DON’T WALK IN THIS DOOR IN TEN MINUTES YOU ARE FIRED.”“Well, Brent,” I said, “I’m in Martha’s Vineyard so that time window is not looking doable.”“YOU’RE FIRED,” said Brent, and hung up.But you know what? Three days later I showed up for my next shift like nothing happened, and that is how I got myself un-fired from Bertucci’s.This Bertucci's looks a lot fancier than my Bertucci's, TBH.\nPhoto by Joe St. PierreAt Bertucci’s meatballs are listed on the menu as “polpette (meatballs).” I always pronounced them like the thing from which a preacher preaches, and nobody ever corrected me. We also served many types of pasta, none of which I ever learned to properly identify, except tortellini.Despite all that and the pizza scheme and the firing, by the summer after my sophomore year of college, I finally graduated from take-out counter-worker to waitress. Where the real money was! Suddenly I was somebody! People would ask me what they should order! Which struck me as a very hilarious thing to do because of how tips work. I would always suggest a bistecca (which is Italian for steak) and some sautéed mussels and a glass—hell, why not a bottle! Let’s live!—of Kendall-Jackson Vintner’s Reserve. I’d done the math. Then one day when a lady took my advice, my hand slipped, and suddenly time froze as I slow-motion dumped an entire pan of sautéed mussel juice down the back of her shirt.That was the end of recommending the mussels.I still have a scar on my left forearm from the time I got seared by one of these hot pizza paddles.\nPhoto by Joe St. PierreAs the summers wore on, I eventually won over Chase the private-school swashbuckler, at least enough to ride around in his Jeep and make out to Dispatch songs while he told me all the reasons he couldn’t commit to a relationship. It didn’t work out in the end, but a few years later my mom saved his mom at the gym after she fell off a treadmill, so there’s that. I think he works for Google now.And the ’Tooch itself? Well, almost exactly a year ago, the branch I worked at shut down. Something about rent was the official statement, but my mom has other ideas. “Kids just don’t work!” she says. “It’s the new thing!” Apparently they all spend their summers doing fancy internships or building structurally questionable schools in Southeast Asia or becoming Instagram influencers or whatever. Working at Bertucci’s? No longer cool.But you know what? Joke’s on them, because who now gets paid to write about food? Me. And I owe it all to Bertucci’s.Hilary Cadigan is an associate editor at Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceBostonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Hilary Cadigan"]}