{"id": "5ee9f59f6a917c097fdaff21d107b2fa", "url": "https://www.bonappetit.com/story/how-to-cook-skirt-steak-no-thermometer", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "How to Cook Skirt Steak Perfectly, No Thermometer Required | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Skirt Steak Perfectly, No Thermometer RequiredIt's flat. It's quick. And it's perfect for a weeknight celebration. Once you learn how to cook skirt steak, you might throw out your thermometer. (Okay, don't do that.)By Alex DelanyApril 16, 2019FacebookTwitterEmailFacebookTwitterEmailAn instant-read meat thermometer is an essential kitchen tool for 99 percent of people who cook steaks at home. If you’re looking for a true medium-rare, you’ll want that thermometer to tell you when you're there. But what about the other one percent of people who don’t need a meat thermometer? Well, we don’t exactly know what’s up with them, but if we had to guess, we’d say that they only cook skirt steak. Because once you learn how to cook skirt steak, you'll also learn that you don’t need a thermometer to hit a perfect medium-rare every time when you're working with this magical cut of meat. You can eyeball it and have a juicy, nicely-browned, perfectly pink steak every time.If you’re not familiar with skirt steak, it’s a flat steak that runs along the ribs of the cow, relatively lean and full of flavor. You’ve probably seen it sliced and served with eggs for breakfast or stuffed into tortillas for fajitas. And it’s the thinness that makes a skirt steak the easiest, most foolproof steak to cook at home. Here’s how to nail it every time:Start by patting the skirt steak dry with a paper towel. Removing excess moisture from the steak allows the exterior to brown more quickly. Season your steak on both sides with kosher salt and freshly cracked black pepper. Usually, you’d let a thick steak sit out at room temperature for about an hour before cooking to take the chill off, but since the skirt steak is so thin, it only needs to sit for about 15 minutes before it's good to go.While heating a cast iron pan over high heat, pat the steak dry one more time with a paper towel to remove the last of the exterior moisture. Rub enough olive oil over the steak to lightly coat it. (We like oiling the steak rather than the pan, which cuts down on smoke.) Now, your steak is primed and ready to be cooked.Once the pan is hot, lay your steak in and leave it undisturbed. The high heat will brown the steak quickly, and once you see a deeply brown, crispy texture on the outside of the steak, flip it. This should only take 2-3 minutes on the first side and 2 minutes on the other side. It’s a very quick cook time, and as a general rule, once both sides are browned, you can assume that the interior is cooked to medium-rare.Now you let the steak rest for 10 minutes. Again, we’d have to let a larger steak rest for about 30 minutes, but since the skirt steak is so thin, there’s less work to be done. Once it has rested, slice the steak into strips, against the grain. Skirt steak isn’t known for being the most tender steak in the land, so smaller strips make for a more pleasurable eating experience.That whole steak-cooking situation is going to take you about 30 minutes, which, by our calculations, gives you more time to watch your shows, complain about your boss, hit the gym, or do whatever else it is that you do on a weeknight. More steak! More time! Good things all around.Now, put that technique to work!Steak and Eggs with Salsa VerdeSo much to love on one plate!View RecipeExplore Bon AppétitBasicallySteakRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Delany"]}