{"id": "5efd927a7e34d9402ccf3c8e8ce1b8b7", "url": "https://www.bonappetit.com/story/cooking-at-a-social-distance", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Cooking at a (Social) Distance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCooking at a (Social) DistanceOnigiri, freezer bread, and yes, beans.By Christina ChaeyMarch 22, 2020FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish friends,As of this writing, I haven’t left the house for six days except to go on solo walks or bike rides. Since last week’s newsletter (which I have to keep reminding myself was ONLY SEVEN DAYS AGO) it’s felt like my world and the world at large have both been upended several times over. At the pace we’re all going, I expect both will have changed a few more times before you read this.While on the phone last night (I’ve been doing a lot of that lately), a friend brought to my attention that I’ve been zooming around (zooming and “Zooming”) at breakneck speed recently. She’s not wrong: My instinct during these fast-paced times has been to match the speed of my surroundings. So I’ve been cooking more, working more, biking more, cleaning more, FaceTiming more. I’ve been flying—in a bad way. After dropping my laptop and almost tripping down half a flight of stairs yesterday, I’ve realized it’s time for me to slow down and be gentle to myself, first. That goes for cooking, too: I want to cook only if I think it will make me feel better, not because I need it to serve as temporary relief from my all-encompassing anxiety. And yet, I still get hungry three or more times a day. And so, I keep cooking. Here’s what I’ve been up to in the kitchen this week.Photo by Christina ChaeyYep, I’m Still Eating BeansI normally have a relatively low bean tolerance, which is to say: I get sick of them after day two. But recently they’ve brought me more comfort than fatigue, and one of the most delightful things I’ve cooked this week was a riff on this Lentil and Egg Stew made with cooked cranberry beans instead of lentils. If you’ve never taken the time to make a soffrito before, there’s no better time to try. The mix of finely chopped vegetables, slowly cooked in olive oil until they’ve almost melted away, anchors this stew with incredible flavor. I’ve saved the method in the #gentlefoods Highlights on my Instagram if you want to follow along.+1 for Freezer BreadI’ve been making my freezer work overtime these last couple of weeks, using it to store 1-2 servings of things I’ve been cooking like chicken soup, dashi, and cooked grains. My biggest small pleasure these days is the stash of She Wolf Bakery bread I’ve sliced and stored in freezer bags, ready to toast on a whim. It’s something I do almost every time I buy a loaf of good bread I know I won’t be able to finish myself. I’ve been eating slices toasted under the aforementioned bean stew (a prime example of crispy gone soggy), with thick layers of almond butter and jam, and with good butter as a snack.Photo by Christina ChaeyCycling FuelI’ve needed my bikes more than ever these days. My commuter bike is a practical alternative to public transit (not that I have many places to go these days), while my road bike is for longer weekend rides and post-work laps around the park. Last weekend, I rode 40 miles to the Rockaways and back with a few homemade onigiri stuffed in my jersey pockets to share with friends (from 6-10 feet away). It seems I’ll be doing most of my rides alone for a while because social distancing is REAL here in NYC, but I still want a snack to look forward to, like these Nut Butter Granola Bars or Cocoa-Nut Energy Bites.On-Demand FishAs disorienting as everything feels right now, I’ve been inspired by the ingenuity that can come out of chaos. My favorite neighborhood restaurants are not only selling their stock of wines at retail prices, many of them are also selling pre-batched cocktails (not gonna lie, a dirty martini from the Four Horsemen sounds pre-ttay good right about now). Basically editor Sarah Jampel forwarded me an email chain from Pierless Fish, a seafood supplier that typically services restaurants, but is now offering fresh and frozen fish delivery to customers’ doors at a discount. I have shrimp, halibut, cod, and Arctic char on the way and am already dreaming of what I’ll cook with them, starting with this Sesame Arctic Char Donabe. (If you live in New York and also want in, email Sam at SGorton@pierlessfish.com.)Keep cooking,Christina ChaeyAssociate editorExplore Bon AppétitWhat's Chaey Cooking?HealthyishRead MoreLifestyleWhen I’m Feeling Chaotic, Gentle Food is There for MeBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-22", "author": ["Condé Nast", "Christina Chaey"]}