{"id": "5f04705f4ea9abded65199fc1371b3e5", "url": "https://www.bonappetit.com/story/what-is-sambal", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "What Is Sambal? And How to Make a Simple One at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make the Simplest Sambal at HomeThis complex condiment is an Indonesian staple and takes many forms.By Pat TanumihardjaOctober 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailSambal comes from the Javanese word sambel, and is defined as a “chile paste” or “relish.” In fact, any condiment that counts chiles as an ingredient can be deemed a sambal. While ubiquitous all over Southeast Asia, sambal is thought to have originated in Indonesia. In Indonesia, a sambal can be a paste of red or green chiles ground together with any number of other ingredients: garlic, shallots, lemongrass, galangal, tomatoes, and/or shrimp paste. Other sambal varieties include sambal kacang, a chili-flecked peanut sauce served with satay, and sambal kecap, a more liquid version featuring chopped bird’s eye chiles floating in Indonesian sweet soy sauce that’s drizzled over fried or grilled fish.Like American ketchup or Mexican salsa, sambal is served alongside a meal for a punch of flavor and sometimes heat. Over the course of an Indonesian meal, a bowl of sambal is passed around the table for diners to dip fresh vegetables into or to slather over rice or noodles. But certain types can also be combined with aromatics as the starting point of a stir-fry or marinade.According to Kompas.com, the online portal of a leading national newspaper in Indonesia, there are over two hundred different types of sambals, each unique to regions and families. That said, sambals can be broadly divided into two categories, raw and cooked. Here we’re going to focus on the simplest type of the former: sambal ulek.Sambal ulek (spelled the Dutch way, “oelek,” on green-capped Huy Fong jars sold at U.S. supermarkets everywhere) is an example of a raw sambal. Technically speaking, any type of sambal made with the cobek (mortar) and ulekan (pestle) could be a sambal ulek. However, it usually refers to a simple sambal that requires only three ingredients: fresh red chiles, lime juice or vinegar, and salt. I like to make small amounts on demand with my mortar and pestle, but if you’re making large batches, there is no shame in making sambal ulek—or any sambal for that matter—in the food processor.In the States it’s almost impossible to find the exact chiles used in Indonesia. However, there are easy substitutes. Cabe keriting (red curly chiles) and cabe Lombok (red Lombok chiles) can be replaced with Korean red chiles, red Fresnos, or cayennes. Jalapeños and serranos are great stand-ins for cabe hijau (green chiles), while Thai Jinda chiles are similar to cabe rawit (bird’s eye chiles), if a little less spicy.Making sambal ulek doesn’t require a recipe. To make a small amount with your mortar and pestle, add a couple of fresh red chiles (and a Thai Jinda chile or two if you want more heat) to your mortar with a good pinch of salt, which helps to create the friction you need to break the chiles down. (If you have a low capsaicin threshold like me, feel free to remove as much of the seeds and membrane from the chiles as desired before they go into the mortar.) Grind until a rough paste forms. Stir in some fresh lime juice and salt and adjust to taste. A raw sambal like this is best eaten within a day or two.Sambal ulek pairs with just about anything. Scoop some into soupy soto ayam Madura and mix it up. Or add a dollop to a bowl of rice, meat, or vegetables. I also stir sambal ulek into my stir-fries and use it as a spicy shortcut when fresh red chiles aren’t available. I wouldn’t stop there, though. Use it to flavor your marinades, soups, stews, and salad dressings. Sambal ulek mixed with mayo makes a tasty dip for french fries too! I encourage you to give this simple chile paste a try and let it be your introduction to the wide world of Indonesian sambal.Explore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-01", "author": ["Condé Nast", "Pat Tanumihardja"]}