{"id": "5f04b9a1bfca83888914bd67ae63a9a1", "url": "https://www.bonappetit.com/recipe/musakhan", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Musakhan (Sumac Chicken With Onions and Flatbread) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMusakhan (Sumac Chicken With Onions and Flatbread)By Rawia BisharaJanuary 29, 20204.8(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintAt Tanoreen in Bay Ridge, Brooklyn, chef Rawia Bishara prepares her version of musakhan, a staple Palestinian slow-cooked chicken dish smothered in silky onions and bright, lemony sumac, set on top of flatbread. Traditionally it’s made by roasting a whole chicken, but here it’s broken down into parts for easier browning and faster cooking. When serving, don’t forget about tearing off pieces of the bread: It will have soaked up some of the juices from the chicken and the sweet onions.Ingredients4 servings1tsp. ground allspice½tsp. ground cardamom½tsp. ground cumin2Tbsp. sumac, plus more for sprinkling4whole chicken legs (thigh and drumstick; about 2½ lb. total)Kosher salt¼cup plus 1 Tbsp. extra-virgin olive oil3medium white onions, coarsely chopped¼cup pine nuts or slivered almondsTaboon bread or Turkish or Indian flatbreads, warmed (for serving)1lemon, halvedPreparationStep 1Preheat oven to 350°. Mix allspice, cardamom, cumin, and 2 Tbsp. sumac in a small bowl to combine.Step 2Season chicken all over with salt in a large bowl. Rub with half of spice mix, pressing and working it into the meat.Step 3Heat ¼ cup oil in a large ovenproof skillet over medium-high. Cook chicken, turning occasionally, until golden brown on both sides and some fat is released, 3–5 minutes per side. Transfer chicken to a large plate, leaving fat in skillet.Step 4Return skillet to medium-high heat. Cook onions, scraping any browned bits on bottom of skillet and adding a splash of water if pan gets dry, until softened and golden brown, 18–25 minutes. Sprinkle with remaining spice mix and continue to cook, stirring frequently, until fragrant, about 30 seconds. Add ¼ cup water, season with salt, and bring to a simmer. Nestle chicken back into skillet, skin side up, and transfer to oven. Bake, uncovered, until liquid is mostly evaporated and chicken is cooked through, 30–35 minutes. Let cool 10 minutes in skillet.Step 5While chicken is cooking, toast pine nuts in remaining 1 Tbsp. oil in a small skillet over medium heat, stirring frequently, until golden brown and fragrant, about 3 minutes. Remove from heat and season with salt.Step 6Arrange warmed bread on a platter and top with chicken and onions. Scatter pine nuts over and sprinkle with more sumac. Squeeze juice from one lemon half over chicken. Cut remaining lemon half into wedges to serve alongside.How would you rate Musakhan (Sumac Chicken With Onions and Flatbread)?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleDELICIOUS! making it again this weekend James Derek DwyerBoston4/29/2021Amazing recipe!! Thanks\nI need to make 13 portions and wanted to ask if I can prepare ahead and if so how would you suggest I reheat? I was thinking adding a tbsp of water per thigh into the pot and putting it a cold oven and reheating to 190°celsius. Then it should be warm enough without starting to cook over. WOuld love to get your feedback :) Thanks! AlanToulouse, France4/1/2021This is FABULOUS!   Going to make for the second time tonight, but don't have any bread so will serve with mashed potatoes.   YUMMY!JuJuConway, NH3/31/2021Delicious. Just like my Israeli mother in-law makes. Would make again, but I served with vermicelli rice pilaf instead. Used a bit of baharat in the rice. TzipiNYC1/19/2021Absolutely delicious. Bright and deep. Viva viva Palestina!Rose EOttawa11/22/2020Amazing. Wouldn't change a thing. Free PalestineAnonymousBrooklyn, NY10/27/2020I love this dish! Really takes me back to my roots & tastes just like grandma's :) dhmohammPalestine5/13/2020This was delicious! Really unique flavors that remind me of my travels to Morocco. AnonymousSan Jose, ca 4/26/2020This might be one of the most delicious dishes I've ever made and I cook on a daily basis! Just mouthwatering, an absolute must. Thank you for sharing Rawia!Caroline C.2/28/2020Explore Bon AppétitPalestinianMiddle EasternSumacHerbs & SpicesChickenPoultryMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-29", "author": ["Condé Nast", "Rawia Bishara"]}