{"id": "5f0c2682cdc9b20e4e22ab642ec1c29e", "url": "https://www.bonappetit.com/story/bachelorette-becca-kufrin-untouched-food", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "All of the Untouched Food on ‘The Bachelorette’ This Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll of the Untouched Food on ‘The Bachelorette’ This SeasonObsessively chronicled because it’s the most interesting part of the show at this point.By Molly FitzpatrickAugust 7, 2018FacebookTwitterEmailPaul Hebert/ABCFacebookTwitterEmailWe can’t predict everything that happens on The Bachelorette, but one thing’s certain: Becca Kufrin and the contestants chasing after her heart will hardly ever eat on camera, no matter how elaborate the romantic meals they’re served may be. The way to Bachelor Nation’s heart is through our collective stomach, but apparently there’s no reason to take a detour through the mouth. We’ve scientifically tracked the tragically uneaten food (and a few actually consumed bites) all season long. In descending order:We arrive in the Maldives, where this magical journey will soon grind to a magical, screeching end, or if you were at all paying attention to the Bachelor-universe news cycle, where it probably got spoiled for you about a month and a half ago. Becca’s family sits down for a meal of limp-looking fish with Garrett, which seems appropriate, given that “likes to fish” is his sole personality trait other than “allow me to impregnate you enough times so that we may populate our very own football team” and “bad.”After a romantic day spent snuggling on a boat and (on Becca’s part) professing that she would like to die right there on the water, within sight of dolphins, is no one as concerned about this comment as I am, Becca and Garrett share (or rather, emphatically do not share) a heart-shaped mini red velvet cake. If Garrett’s finale food sounds anticlimactic, consider that Blake is served zero finale food: And lo and behold, it is Garrett who claims the last rose and Becca’s beating red-velvet heart. I’m fully on board for Blake as the next Bachelor, but if Jason promises to arrange for the mansion to be exclusively catered with buffalo wings, then all bets are off.PreviouslyWelcome to Thailand! Becca and Blake are the first couple to spend the night in a fantasy suite. The next morning, thanks to some interesting editing, a tray laden with a fruit-heavy breakfast appears as if by magic in the middle of their still-in-bed conversation. Maybe they were hiding it under the comforter for the first few minutes, for some reason?ACTUALLY EATING FOOD ALERT: Jason and Becca drink smoothies and sample crickets while browsing a market. “There is no one else I’d rather eat crickets with in Thailand,” she tells him, which, I’m sorry to say, is the closest he will get to an “I love you” from Becca.That night, as Becca walks Jason to his car, having bended official Bachelor[ette] protocol to break up with him pre-fantasy suite, we catch a distant glimpse of some very sad rice. This dinner, like their relationship, was not meant to be.Garrett and Becca did their sex in a treehouse, where the next morning they are served an even fruitier breakfast. Is the magnitude of Becca’s love directly correlated to the number of servings of pineapple provided to each suitor? I will consult the food pyramid and get back to you.It’s hometowns week! Garrett, whose family owns an agriculture company, tricks Becca into planting tomatoes (for the purposes of this list, let’s call them pre-food!) like he’s Tom Sawyer with a fence that needs whitewashing.Meeting Becca, the first woman he’s brought home since his bitter divorce, Garrett’s family serves what looks like homemade focaccia, baked with rosemary and the secret ingredient that is skepticism.ACTUALLY EATING FOOD ALERT: Jason welcomes Becca to his hometown of Buffalo with a wing-eating contest. Is this the best hometown date ever on The Bachelor(ette)? Like, probably? Jason, I love you?Jason’s family feeds (well, “feeds” would imply she ate it) Becca a steak. For future reference, I like mine medium rare, thanks in advance.At first, I thought Blake’s family dropped a slab of raw meat on Becca’s plate—not the warmest of welcomes—but other angles reveal it’s a chicken cutlet with red sauce (a cheeseless parm?).I thought Colton was my second-least favorite remaining contestant (after Memelord Garrett), but this glorious Bundt cake may have changed the whole damn game. Too bad it went completely, entirely, tragically unconsumed.ACTUALLY EATING FOOD ALERT: Colton and Becca dive for Caribbean conch off a boat and are encouraged by their guide to eat the conch’s “pistol” raw, on the grounds that it is the “Bahamian Viagra.” Based on their reactions, natural male enhancement does not necessarily equate with flavor.Over dinner, Colton informs Becca that he’s a virgin, and she takes a dramatic little stroll before returning to profess her continued interest in him and reunite with her true love, this grilled fish.At first, I didn’t realize that was a strawberry on frontrunner Garrett’s plate, assuming instead that he was such a lock for this rose that the producers had gone ahead and composed a dish around it.Becca and Blake attend an outdoor Baha Men concert (They have a new song! This one is not about letting the dogs out!), leaving Blake with a sunburn as red as his lone cherry tomato.As if being relegated to a three-on-one date wasn’t insulting enough, Wills, Jason, and Leo are offered these picked-over consolation snacks as a visual representation of what Becca must think of them.For dinner, Jason is served at least 80% more salad than Wills, foreshadowing that the latter man will not get a rose. (Sorry, Wills. I would not only date you, but feed you as much salad as you like.)Jason and Becca’s one-on-one is an extended tourism commercial for the city of Richmond, Virginia. At Sugar Shack Donuts, they decorate oversized heart-shaped donuts and she squishes one onto his face, a substitute for the wedding cake they will never have, because I’m sorry, but Jason will not win this competition.Next, the couple heads to an Edgar Allan Poe-themed “unhappy hour.” Moody people dressed in black do what looks to me like goth Kate Bush interpretive dance yoga. Mysterious red drinks are served with red velvet whoopie pies minus the icing. Spooky!I’m not sure if the terrine on Becca’s plate is chocolate or some kind of organ meat, but either way, I’m interested.Leo’s one-on-one date sees the couple eat dinner in Old City Hall. The setting is beautiful, but the catering leaves much to be desired, given that he and Becca appear to have been served brown napkins.Outside Las Vegas, Colton and Becca ride camels and then soak in a hot tub that has appeared without explanation in the middle of a field, as is Bachelor franchise tradition. That night, their dinner is obscured by giant frosted candles. Perhaps, amid all the camel excitement, someone forgot to pick up a stand-in duck leg or Caprese salad.After an afternoon of songwriting at Wayne Newton’s estate—which is exactly what you picture when you close your eyes and think of the words “Wayne Newton’s estate”—and an evening of singing in front of a live audience, exactly four burgers and two fries are made available to the nine men on this group date. With these odds, a burger ceremony would be far more stressful than a rose ceremony. Talk about the Hunger Games, am I right? (I’m right. I’m pretty sure I’m right.)Becca sends Jordan home once it becomes clear that, even in her absence, he would gladly continue monologuing about his modeling career to his veggie lasagna.ACTUALLY EATING FOOD ALERT: Becca and Garrett take ginger, lemon, and black pepper shots in Park City. Their shared shiver of disgust upon tasting these healthy concoctions is not unlike my reaction to reading about Garrett’s taste in memes.That night, Garrett reveals he’s been married before. He and Becca stare uncomfortably at a platter of, among other things, bedazzled cucumber slices (this is their dinner?), like it’s his ex-wife barging in on the date.On Becca’s one-on-one with Wills, the couple is served… Is that steak on the left? A Cornish game hen on the right? Like Wills himself, this food sure looks good, but the camera spent tragically little time on it.ACTUALLY EATING FOOD ALERT: The micro-civilization developing within the walls of the Bachelor mansion has progressed to the point that the men—at least David, whose scrambled egg prowess arguably makes him Becca’s most attractive suitor—have figured out how to make breakfast. Soon they will be producing rudimentary weapons and fighting wars over salt.Our bachelorette lays out an appetizing continental breakfast to lure ex-Bachelor hopefuls Seinne, Kendall, Bekah, Tia, and Caroline (Okay, Caroline I had to Google) to a spa where the strange men vying for Becca’s heart will proceed to touch their feet, at length. The flowers seen here are not, presumably, edible, but I’ve been wrong before. Usually the other way around, though.The guys on this group date are served a relatively hearty spread of cold cuts, cheese, and crudités, which is good, because they desperately need to line their stomachs with something that isn’t alcohol as they take sip after sip of their drinks to pretend they aren’t laughing at Jordan the male model and his 4,000 Tinder matches.It is genuinely impossible to tell what’s on Becca’s plate—octopus? driftwood?—during her one-on-one date with Chris, in part because so much camera time is devoted to, first, a songwriting session with Richard Marx, and later, a makeout session between the couple during which they are serenaded by Richard Marx. This episode is brought to you by Richard Marx.After David is rushed to intensive care because he fell out of bed and broke his nose in the middle of the night (yes, this is a thing that really happened on The Bachelorette), Lincoln takes over breakfast duty, and does so shirtlessly. Thank you for your service.Following a football group date where a wrist injury takes actual NFL player Clay off the show permanently, the boys fight for time with Becca at an antique shop where someone has seen to fit to provide them with, among other things, a single personal pizza.On the season’s first group date, Becca dresses her dudes up in brand-new tuxes, then—with the help of the previous Bachelorette Rachel Lindsay and her fiancé Bryan Abasalo, who are presumably living in a Warner Bros.-owned airplane hangar convenient to the mansion, waiting to be deployed in the service of Chris Harrison—sends them through a messy, marriage-themed obstacle course. The final stage requires the men to find one of two rings baked inside four wedding cakes, with no hands. “What that mouth do?” asks Rachel, both making a solid cunnilingus joke and posing a valid existential question about the role of food on this franchise.That night, these berries, grapes, olives, and slices of pita fuel Connor to throw Lincoln’s framed winning “wedding” photo with Becca into the pool, and in turn fuel Lincoln to tattle to Becca.Blake compares his getting dumped by some woman after two months to Becca’s national romantic humiliation over a dinner of steak and broccoli for him, and for her—is it chicken? Fish? Whatever that protein is, it looks about as bland as your average Bachelorette contestant.These no-doubt hungry boys politely refrain from snacking on the many cheeses made available to them after a dodgeball group date.ACTUALLY EATING FOOD ALERT: Pro football player Clay hosts his family for a feast of fried chicken, mashed potatoes, and a tomato salad that he supposedly prepared himself. If we could shut this whole season down 15 minutes into episode one and have Becca marry this guy, I, for one, am fine with that.Joe from Chicago owns a grocery store (and is one of the most genuinely appealing men to appear on The Bachelorette in recent memory, which explains why he gets sent home on the first night), where his primary job responsibility is shouting “No good!” at potatoes and grapes that displease him. If the way he lovingly caresses a tomato is any indication of what Becca’s missing out on, hoo boy.ACTUALLY EATING FOOD ALERT: Lincoln emerges from the limo with a slice of chocolate cake, a nod to when they first met on the “After the Final Rose” special, which was also his birthday. He gazes longingly at the dessert even as he hugs Becca, and no offense, Becca, but can you blame him? They both take a bite, and perhaps it is no coincidence that Lincoln’s is the first name called at the rose ceremony.Tune in next week, and the week after, because we’re dedicated to this cause.Explore Bon AppétitPop CultureTvRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Molly Fitzpatrick"]}