{"id": "5f0f47c06537e198c694645af9fb1d02", "url": "https://www.bonappetit.com/story/nordic-ware-harvest-bounty-loaf-pan", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "Nordic Ware's Autumnal Loaf Pan Will Make Any Cake Look Like a Million Bucks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingNo Time to Decorate That Cake? You Need This Autumnal Loaf PanYour cake deserves to look as good as it tastes.By Mehreen KarimNovember 16, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’m sorry to admit that I shamelessly judge books, Netflix shows, dentist offices, and—you guessed it, CAKES—by their cover. I can’t be bothered to eat a dessert that isn’t visually begging for my attention. I’m looking at you, humble loaf cakes. Unless you’re a sweet potato brick piled high with swoops of meringue or banana bread topped with caramelized banana slices, I’m not giving you the time of day.But then my best friend’s parents gifted me this Nordic Ware Harvest Bounty Loaf Pan and all too adorably requested that I bake something beautiful in it. I couldn’t deny that the pan itself was a stunner—its figure embossed with a whimsical array of plump pumpkins and little acorns so dainty that I began to empathize with squirrels. But would the pan’s festive features be enough to elevate a loaf cake into something wow worthy?Harvest Bounty Loaf Pan$38 $25 at Amazon$36 at TargetI made a basic chocolate cake batter and poured it into my barely oiled loaf pan. And like a Disney movie makeover montage, the Harvest Bounty baking pan transformed my bare-bones chocolate cake into a breathtaking autumnal vision. The edible flowers I had on standby? Not necessary. Huge shout out to Nordic Ware’s PFOA-free (no nasties) nonstick coating—not a corner nor crumb of the cake stuck to the pan’s many nooks and crannies. We’d have a much homelier, less cute cake without it.Instagram contentThis content can also be viewed on the site it originates from.One lovely loaf cake later, I wish I could say that I’ve learned my lesson about judging a cake by its cover. But really all I’ve learned is that banana breads deserve a second chance in my shiny new Harvest Bounty Loaf Pan.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-16", "author": ["Condé Nast", "Mehreen Karim"]}