{"id": "5f12946a995f70115357d88f3f3fe811", "url": "https://www.bonappetit.com/recipe/charred-peppers-with-lemon-ricotta-and-cucumbers", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Charred Peppers With Lemon Ricotta and Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueCharred Peppers With Lemon Ricotta and CucumbersBy Andy BaraghaniApril 14, 20204.2(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintThe smoky charred peppers play well with the cool cucumbers and lemony ricotta. If you can’t find Italian frying peppers or just aren’t feeling them, grilled eggplant or zucchini would also work well here.Ingredients8 servings½cup walnuts6Tbsp. extra-virgin olive oil, divided, plus more for drizzling4sweet Italian frying peppers or Anaheim chiles1½cups whole-milk ricotta1lemon6medium Persian cucumbers (about 1 lb.), sliced on a deep diagonal1cup mint leaves, torn if largePreparationStep 1Place a rack in upper third of oven; preheat to 350°. Spread out walnuts on a rimmed baking sheet and toast, tossing halfway through, until golden brown, 8–10 minutes. Let cool, then crush into large pieces with a flat-bottomed measuring cup or glass.Step 2Meanwhile, heat 2 Tbsp. oil in a large skillet, preferably cast iron, over medium-high. Cook peppers, shaking pan and turning peppers occasionally, until skins are lightly charred and flesh is tender, 6–8 minutes. Transfer peppers to a cutting board and let cool slightly. If peppers are large, cut in half lengthwise.Step 3Combine ricotta and 2 Tbsp. oil in a small bowl; finely grate zest from lemon over and mix well. Season lemon ricotta with salt. Set lemon aside.Step 4Combine peppers, cucumbers, mint, and half of walnuts in a large bowl. Cut reserved lemon in half and squeeze juice into bowl. Drizzle in 2 Tbsp. oil, season with salt, and toss to coat.Step 5Transfer pepper mixture to a platter along with any juices in the bottom of bowl. Dollop lemon ricotta over and top with remaining walnuts. Drizzle with more oil and season with black pepper.How would you rate Charred Peppers With Lemon Ricotta and Cucumbers?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI love this recipe, I've made it a few times in the last month or so to use up the long sweet Italian peppers and the cucumbers I've been getting at our farmer's market. I've made it with and without mint, which seems to always be a love it or leave it thing, and so far without mint has won. In lieu of the mint, I use basil olive oil as part of the dressing instead of regular olive oil.AnonymousSC8/16/2021I made this salad exactly as directed. I found the peppers a delightful addition however as a whole salad I found it disappointing and lacking of flavour. I will now doctor this recipe. Thanks for a starting point.\n MEZMaryEllenWindsor,ont. Ca.1/24/2021Omg. How could these go together so well?! We used anaheims and I went with smaller slices of regular cucumber when I couldn't find Persian. These ingredients seemed like an odd combo to me (mint and peppers? walnuts and cucumbers?) but man, it was so fun to eat. Got my wheels turning for similar pairings. Great recipe, Andy.yagurlcarlyTucson, Arizona6/20/2020This recipe was a big hit. I couldn't find Italian frying peppers or Anaheim chiles, so I ended up using roasted red and yellow peppers. I cheated since I had a jar of them on hand. It made it a bit quicker to make, and I feel like it didn't compromise the dish. So refreshing. So easy. So delish.AnonymousLos Angeles6/17/2020This recipe is a great way to feature peppers and cucumbers. I used basil instead of mint and hazelnuts instead of walnuts since those were ingredients I had on hand. Recommend 400 degree oven for about 15 minutes (flipping once midway through) if you don’t have a gas cooktop you can char them over—Anaheim peppers have too many ridges to char well in the pan. I also added the acid of a squeezed half of lemon and a vinegary pique hot sauce. Even with the lemon zest flavor, it still benefitted from the acid to balance the bitterness of the charred peppers. CherylbadgerTacoma, WA6/6/2020I ADORE this dish AND it got me to eat peppers and walnuts, two things I normally dislike! I had trouble getting the giant Anaheim chiles I picked to char evenly in the pan on the stovetop so I ended up throwing them in the oven at 400 till soft. I served mine with leftover roasted chicken breast and soft lebanese pita bread for extra heft. It's such a perfect representation of summer flavours!AnonymousIraq/Armenia5/9/2020Explore Bon AppétitRicottaCheeseWalnutNutCucumberVegetableAnaheim ChileChileSummerEasyQuickSideGluten-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}