{"id": "5f1975f57e01dbd4bd22e400ebea5e10", "url": "https://www.bonappetit.com/recipe/fried-bologna-sandwich", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Fried Bologna Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueFried Bologna SandwichBy Brad LeoneFebruary 13, 20184.5(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintFor this bologna sandwich recipe, cutting slits into the bologna before cooking helps it brown evenly across the surface and prevents it from curling and warping as they fry.IngredientsMakes 22Tbsp. spicy brown mustard1Tbsp. mayonnaise1Tbsp. finely chopped dill pickles, plus 2 Tbsp. brineFreshly ground black pepper7oz. thinly sliced bologna4slices seeded rye breadA few iceberg lettuce leaves, torn to size of breadPreparationStep 1Mix mustard, mayonnaise, and chopped pickles in a small bowl to combine; season with pepper.Step 2Arrange half of bologna slices in a neat stack. Starting near the center and working toward the edges of the stack, cut four 1\"-long slits, spacing evenly. Repeat with remaining bologna.Chelsie CraigStep 3Heat a dry large skillet, preferably cast iron, over medium-high. Working in batches, arrange bologna slices in a single layer in skillet and cook until browned all over and crisp, about 2 minutes per side. Transfer to a plate as they are done. Save skillet with any fat.Step 4Arrange bread in a single layer in reserved skillet and cook over medium high until golden brown, about 2 minutes per side. Transfer to a cutting board.Step 5To build sandwiches, spread mustard mixture evenly over each slice of bread. Divide bologna between 2 slices and top with lettuce; drizzle with pickle brine. Close up sandwiches and cut in half.How would you rate Fried Bologna Sandwich?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMy NC boyfriend introduced me to fried bologna sandwiches back in the early 70s. (It was the only thing he knew how to cook.) He mixed brown sugar and mustard to spread on the bread and presented it to me with a candle on top for our anniversary. Going back home to NYC, I introduced my fellow penurious artists to this delicacy. Now I live in Virginia and I see 'bologna burgers' on lots of menus. Very nostalgic! LifesartRichmond VA8/24/2021I love dry rye toast for sandwiches. MommarobynRockford3/12/2019My West Virginia born grandmother called this \"hillbilly round steak.\" She would have loved this version of her sandwich.Melanie D.Macedonia, Ohio3/7/2019At first I thought, \"Who needs a recipe for a bologna sandwich?'  But this is good.  Make fried salami, too.betteireneSumner, WA10/22/2018I was going to try this recipe but I surrendered to the true nature of a bologna sandwhich, which is to be as lazy as possible. Mayo, mustard, 2 slices of cheddar, 3 slices uncooked bologna in that order. Assemble on white bread. AnonymousAlaska9/28/2018My mother cut slits in bologna, when we were kids, over 60 years ago. Good ideas survive the test of time. Ohio2/23/2018Explore Bon AppétitSandwichAmericanQuickEasyFryLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Brad Leone"]}