{"id": "5f3f884c1f5aaec3d11775f3b86080ab", "url": "https://www.bonappetit.com/story/self-care-app", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "The #Selfcare App Is the Calmest Thing in My Life Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis App Is the Calmest Thing in My Life Right NowIt’s a safe, meditative space that provides me with a brief break from reality.By Joanna FoxMarch 25, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!When I wake up these days, I’m scared to look at my phone. But then I do because I can’t help it. Now that I’m working from home, social distancing, and self-isolating, my phone is both a tether to the outside world and a device filled with unwelcome distress. That’s why a little (free!) app called #SelfCare has become my virtual sanctuary: a private, digital place to hang out in and tend to a small world that I can control.#SelfCare is set in a bedroom, where your customized avatar can spend the day lounging around and exploring their virtual space along with all the objects in it. Beyond the incredibly soothing, spa-like soundtrack, there are very simple tasks you can do—or not do—it’s up to you. Picking up dirty clothes and tossing them in the hamper or folding laundry in a virtual bedroom is incredibly satisfying. There are also tarot cards (ironically, I chose The Hermit this morning), breathing exercises, crystals, basic but meaningful word games, and even a cat to pet. It’s a safe, meditative space that provides me with a brief break from reality.The app was created by TRU LUV, a small gaming studio based in Toronto, Canada. Founder Brie Code left her job as a head designer to create games for people who don’t relate to traditional video games (me) and who are in search of healthier digital outlets (also me). She teamed up with Eve Thomas, an artist and writer, who modeled #SelfCare’s bedroom on her own. Code and Thomas put together a diverse team (including an official Witch-in-Residence), to create the visually engaging, techno-pagan app, which is constantly updated and tweaked as it learns what you like to do, so it can help you reach calm as effectively as possible.These days, a lot of us could use as much companionship as we can get. Even if we have to stay in our IRL bedrooms all day, #SelfCare offers a different sort of sanctuary, even if it’s just a five-minute break from the news.Check it out:#SelfCareExplore Bon AppétitHealthyishSelf CareHealthyish Loves ItShoppingRead MoreCoronavirus17 Ways to Feel Good at Home Right NowBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-25", "author": ["Condé Nast", "Joanna Fox"]}