{"id": "5f4eab26c2e2014b35169d8f8afe6d5e", "url": "https://www.bonappetit.com/story/13-orders-at-tonys", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "My 13 Summers of Red Sauce at Tony's in Atlantic City | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy 13 Summers of Red Sauce at Tony’s in Atlantic CitySince I was 10, I’ve spent my summers eating pizza, spaghetti & meatballs, and antipasto. I’m glad it’s still the same.By Emily SchultzJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Eating at Tony’s Baltimore Grill in Atlantic City, New Jersey, is like that one scene in every cheesy Italian-American movie where all of the characters sit down to have a family dinner. It’s full of big groups of loud people, and the matriarch is always reaching over everyone, plopping a meatball onto her son’s plate. When I think of Tony’s, I think of red. Red-rimmed plates, red plastic baskets filled with crunchy-on-the-outside, pillowy-soft-on-the-inside Italian bread, and most importantly, the red sauce. Scattered between all the red baskets are white ramekins of grated Parmesan.Nothing has changed about Tony’s since my South Philly Italian-American grandparents stepped through that door in the 1950s. The antipasto platters are something you only see in mom-and-pop restaurants in the tristate area: full rounds of sliced deli salami, two pieces of the whitest provolone cheese, pepperoncini the color of a highlighter, and canned black olives that we’d promptly place on our fingertips. Below, my life as chronicled in 13 orders at Tony’s Baltimore Grill.For as long as I can remember, the Tony's sign had been missing an \"I\".\nPhoto by Alex LauThe image of this antipasto is burned into my brain for eternity and I'm not even mad about it.\nPhoto by Alex Lau2003: Until 2003, my family spent the summer at my grandparents’ house on the Jersey Shore. Every member of my family, from sister to third cousin, could be found on this one very small island. (To the uninitiated: Yes, Atlantic City is on an island, along with three other towns.) My parents bought their own shore house this year and to celebrate we went to Tony’s.2004: This was the summer before I started middle school, and I went to Tony’s with my sisters and parents. I got ravioli because I was becoming an adult, and adults get to eat full meals by themselves without sharing with their sisters.2005 (and 2006): These were those terrible middle school years where you would rather be grounded than caught dead out to dinner with your parents. Even though Atlantic City was an hour away from the town where I grew up, everyone spent their summers down there. I got pepperoni pizza both times and did a quick sweep of the place before we sat down to make sure no one I went to school with was there.The pizza—my grandmother liked it with \"hardly any crust.\"\nPhoto by Alex Lau2007: My mom-mom, which is what we called my paternal grandmother, passed away in September 2007—this was the last time I went to Tony’s with her. We sat in a booth under an oil painting of a short, stout man with a moustache. My sister figured this must be the Tony. We ordered plain pizza with “hardly any crust”—my mom-mom always asked them to sauce the pie as close to the edge as possible—spaghetti with clams, antipasto, and several refills of Atlantic City bread.2008: I had braces, so my salad kept getting stuck in my teeth.2009: I don’t remember what we ate because I was too busy texting all of my new friends I met at my first summer of sleepaway camp.2010: I missed the Tony’s pilgrimage because I was at camp for even longer this summer. Instead I ate at a kosher Chinese restaurant that has since closed.2011: My nanny (my other grandmother), parents, sisters, and I shared a bunch of different pizzas and talked about my future college roommates, class schedule, and whether there would be anything like Tony’s in Western New York. (There wasn’t.)2012: I met my family at Tony’s straight from my hostessing job at a local chain restaurant. I complained about the job (I was a terrible hostess) over pasta with red sauce. I definitely thought I was a full-fledged adult.2013: I stayed in Rochester, New York, for an internship. My sisters texted me a photo of their twirls of long pasta doused in red sauce. I ate popcorn for dinner that night.2014: I just returned from a summer in Italy and rolled my eyes at everything on the menu. This wasn’t what Italian food was. I ordered plain pizza and a glass of red wine—the first time I ordered wine with my family.A week after college I moved to New York City, my sisters went off to their respective colleges, schedules didn’t match up, and our annual Tony’s trek was no longer. That is, until...The decorations are sparse but the bread bowls sure aren't.\nPhoto by Alex LauMay 2018: We went to Tony’s the night before my sister’s college graduation. The shiny lacquered cherrywood tables with red plastic bowls of half-torn bread were patiently waiting for us. We ordered the antipasto, each of us taking two black olives and sticking them on our ring finger; spaghetti and meatballs; and a plain pizza. We talked about her future and noticed the painting of “Tony” was taken down. That was the only thing we could tell had changed.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsItalian AmericanPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Emily Schultz"]}