{"id": "5f6ec91a7365a5719c9c3010c9335ed4", "url": "https://www.bonappetit.com/story/never-fail-broccoli-salad-peanut-dressing", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Would You Believe Me if I Told You I'm Addicted to Raw Broccoli Salad? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWould You Believe Me if I Told You I'm Addicted to Raw Broccoli Salad?Raw broccoli and peanut sauce are the power couple you didn't see coming.By Emily SchultzOctober 12, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenFacebookTwitterEmailThe thought of reading an article about a raw broccoli salad probably sounds as fun as making a dentist appointment. (I’ve put the latter off for eight months now, BTW). But this broccoli salad recipe has loads of creamy peanut sauce, crunchy daikon radish, and a sprinkling of dried tart cherries, so now you’re probably like, OH HELL YEAH I’M IN.It all started on a cool morning at the end of winter, in one of our ideas meetings. Senior food editor Chris Morocco went on and on about this one specific dish that blew his mind at Brooklyn pizza joint Emily. It was the raw broccoli salad. I get that Chris develops for Healthyish. And that he understands balance. But when I go to a pizza place, any part of the menu that isn’t the pizza section is completely irrelevant to my life. I was skeptical of this entire thing.So one day, I found myself moseying around the test kitchen looking for snacks. And there I saw a plate of creamy dreamy peanut dressing, chopped up broccoli, radish, and cherries. I dragged a bite of broccoli through the peanut sauce. Then a piece of crunchy radish. Then another hunk of broccoli. And sooner or later I devoured the whole plate.A few weeks went by. I was home and hungry, and realized I had all of the ingredients for this recipe in my kitchen. So I quickly whisked together creamy peanut butter, tangy rice vinegar, umami packed soy sauce, a bit of sugar, sesame oil, grated ginger, and kosher salt. I chopped up the end of a daikon radish and the crown of broccoli I impulse bought from the market. I tossed in the last of the golden raisins I had from this raisin pesto and voila!And then I made more of the peanut sauce to toss with some rice noodles for lunch. And then for a park picnic a few weeks after that. And then my roommate stuck her finger in the sauce and she got hooked too.So there are a few morals to the story, but the two I would like to focus on are 1) don’t procrastinate on scheduling your dentist appointments, and 2) ALWAYS trust Chris Morocco.Get the recipe:Broccoli Salad with Peanut DressingThe raw broccoli salad at Emmy Squared in Brooklyn showed us that broccoli can be delicious even when squeaky raw.View RecipeRead MoreBroccoli Salad with Peanut DressingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-12", "author": ["Condé Nast", "Emily Schultz"]}