{"id": "5f74746da9751e49edbbdd05ae8bd405", "url": "https://www.bonappetit.com/recipe/kale-caesar-salad-with-lemony-breadcrumbs", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Kale Caesar Salad With Lemony Breadcrumbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKale Caesar Salad With Lemony BreadcrumbsBy Jessie YuChenJanuary 18, 20224.7(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThis is my ideal kale Caesar, yielding the most flavor with the least amount of effort. Curly kale catches the creamy dressing in its grooves and curves, which means each bite is perfectly dressed. Using mayo saves you the trouble of making your own. Finally, buttery croutons are my favorite part of a good Caesar, but there are never enough of them. So instead of the odd crouton here and there, this salad gets a generous shower of toasted panko breadcrumbs to ensure you get lots of buttery crunch. —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonMedium Skillet$60 At AmazonIngredients4 servings2Tbsp. unsalted butter½cup panko½tsp. kosher salt, divided, plus moreFreshly ground black pepper1Tbsp. finely grated lemon zest, divided1large bunch curly kale (about 1 lb.), ribs and stems removed, leaves torn into 1\" pieces2Tbsp. plus ¼ cup extra-virgin olive oil2oil-packed anchovy fillets¼cup fresh lemon juice3Tbsp. mayonnaise1tsp. Dijon mustard1tsp. Worcestershire sauce2garlic cloves, finely grated½oz. Parmesan, finely grated (about ½ cup), plus more for servingPreparationStep 1Melt butter in a medium skillet over medium heat. Add panko, ¼ tsp. salt, and a few grinds of pepper. Cook panko, stirring often but being careful not to crush, until golden brown, 5–8 minutes. Carefully stir in half of the lemon zest and set aside.Step 2Place kale in a large bowl and drizzle 2 Tbsp. oil over. Massage kale with your hands until dark green and very soft, about 3 minutes.Step 3Using the flat side of a chef’s knife, smash anchovy fillets on a cutting board to a coarse paste; transfer paste to a medium bowl. Whisk in lemon juice, mayonnaise, mustard, Worcestershire sauce, garlic, ½ oz. Parmesan, and remaining ¼ tsp. salt. Gradually stream in remaining ¼ cup oil, whisking constantly until dressing is smooth and creamy.Step 4Add half of dressing to bowl with kale and toss to evenly coat. Taste and add more dressing by the tablespoonful until salad is well-dressed. Taste salad and season with more salt and pepper if needed.Step 5Mound salad onto a platter or divide among plates. Drizzle any remaining dressing over and top with more Parmesan, reserved panko, and remaining lemon zest.Do ahead: Panko topping can be made 3 days ahead. Store airtight at room temperature.How would you rate Kale Caesar Salad With Lemony Breadcrumbs?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleActually this is a delicious salad and it’s made with kale!!!! The panko croutons are brilliant… a definite do again… thanks Anonymous1/25/2022Explore Bon AppétitDinnerLunchEasySaladKaleLeafy GreensVegetableSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-18", "author": ["Condé Nast", "Jessie Yuchen"]}