{"id": "5f85c59f926ba39c22879c4f9787cfe2", "url": "https://www.bonappetit.com/story/tuna-sandwich-green-goddess-dressing", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Your Tuna Sandwich Has Been Waiting Its Whole Life For Green Goddess Dressing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Tuna Sandwich Has Been Waiting Its Whole Life For Green Goddess DressingYou're a goddess, so eat like one.By Andy BaraghaniFebruary 28, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailI've never loved tuna sandwiches because all tuna, even really expensive tuna, is dry AF. But it’s a good source of protein that can be truly delicious as long as you use it right. For this tuna sandwich recipe, I decided to add a Green Goddess dressing that you make in a blender, and it turned out to be exactly what the tuna needed. This version is juicy and creamy, but not too fatty and rich. It’s a tuna sandwich you don’t get sick of eating.We in the test kitchen fought over the bread choice for this sandwich—sourdough vs. English muffin—and you can see above that the English muffin won. So, I’m going to use this as my chance to argue for a whole wheat sourdough, miche-like bread. I wanted something lightly toasted with a little bit of cushion to it and a good amount of tender crumb throughout—not just crust and more crust like you get with an English muffin. Still, English muffins are a cute size, they toast easily, and the little crevices can soak up the juices. Whatever bread you decide to use, it’s really all about the dressing.Green Goddess is a dressing that was very fashionable in the ‘70s and ‘80s, and I make it a million different ways. This is a streamlined version, using basil, parsley, tarragon, a little mayonnaise, a little sour cream, lemon zest, lemon juice, and extra-virgin olive oil. Yes, the herbs provide a wonderful green color, but they also add so much flavor. Basil provides sweetness, tarragon has a really essential anise flavor, and parsley gives a little grassiness and makes the dressing super green.This sandwich is nothing like the version with too much mayonnaise that you get from a lot of diners. Here, tuna salad gets its fat primarily from the oil and sour cream, and the mayonnaise is just there to add a little texture. The citrus juice and zest brings it to life, and some extra herbs on top add even more fresh flavor. You can obviously omit them, but the herbage really puts this vibrant, Green Goddess tuna salad sandwich over the top.This tuna salad will keep for a few days, making it easy to whip up a batch for a couple next-level work lunches. If you have tuna-averse colleagues, consider switching up your lunch al desko for a lunch al fresco. Really, these beauties are begging to be taken out on a picnic. With all the freshness going on in this sandwich, it's always springtime.Channel your inner Green Goddess:Green Goddess Tuna Salad SandwichThis recipe is a revelation, bringing bright herbaceous green goddess flavors to an otherwise one-note meal.View RecipeExplore Bon AppétitHealthyishSandwichTunaherbRead MorecookingThis Isn't Your Mom's Green Goddess SandwichBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-28", "author": ["Condé Nast", "Andy Baraghani"]}