{"id": "5f87d421fb4d93e5a01341643637cc9b", "url": "https://www.bonappetit.com/story/flash-food-photos", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Flash Photos Are the Best Food Photos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBring Back the Flash Photos of 2012 Food InstagramThe brighter the flash, the closer to heaven.By Elazar SontagMarch 11, 2022FacebookTwitterEmailCollage By Julia Duarte, Photos By Elazar SontagFacebookTwitterEmailThe way a burst of light bounces off of mayonnaise is particularly dramatic. Under a stark spotlight, walnut shrimp glistens against blanched green broccoli and slices of orange. And if anything is more glorious than the camera flare on a gaggle of rice cakes floating in a reflective pool of chili oil, I have yet to make its acquaintance. Let me set the scene: The year is 2012, we’re all figuring out how to use Instagram, and I am taking flash photos of everything I eat.Flash photography has a documentary quality. The photos that best capture how I really live, and what I really eat, are the ones I take by aiming my camera at a dish and letting flash illuminate the entire scene. In the crowd of carefully arranged and softly lit food photos on my Instagram feed, I love the way a high-contrast picture of a Scotch egg or a plate of ribs makes all the dish’s grooves and pools of sauce stand out.Instagram contentThis content can also be viewed on the site it originates from.Until recently, I would have told you the best food pictures were taken in natural light. Inspired, at least in part, by the dreamy shots captured in this very magazine’s test kitchen, I tried my best to take all of my food photos at the height of daylight, against warm, moody shadows. Beyond Bon Appétit, the Instagram food world is full of these bucolic shots. The problem is, most of my meals aren’t eaten in a grassy field on a perfectly lit afternoon. I’ve enjoyed hundreds—thousands, probably—of meals over the years that I wish I’d documented but the light just wasn’t quite right. I don’t know exactly when it happened, but as Instagram developed as a platform, the way we used it to document our meals did too. We turned everything into an editorialized scene. A high-fashion photoshoot. My feed, and lots of other people’s too, became less food journal, more aspirational look book. We lost something great in that transition.Instagram contentThis content can also be viewed on the site it originates from.I get it: It’s really satisfying to catch a particularly impressive home-cooked meal or restaurant dish in a perfect glow. The right exposure, the right props, the right framing can all evoke feelings we associate with a cozy midwinter lunch or a glamorous dinner. I’m not saying we should let it all go—early Instagram was a mess, with its weird borders, vignettes, and filters—but our shared timeline would be so much more interesting if we didn’t always wait to take a photo until the light and the setting were just right.Of course, sometimes it’s best not to whip out your phone and start flashing away. Being respectful of a restaurant’s policies and general vibe around photography is more important than getting the shot. But if it won’t ruin a neighboring table’s 50th birthday party, turn on your phone’s flash and see how great the photos can be. I’ve been using flash to document pretty much all my meals lately and I’m loving the results. My camera roll has never been brighter, and I can’t remember the last time I had this much fun sharing pictures of food online. It was probably around 2012.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-11", "author": ["Condé Nast", "Elazar Sontag"]}