{"id": "5f89612b21479c00dc86ea58fd367de1", "url": "https://www.bonappetit.com/story/rose-vinegar", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "This Rosé Vinegar Is a Serious Upgrade at a Miraculous Price | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Rosé Vinegar Is a Serious Upgrade at a Miraculous PriceIt's perfect for lifting a bowl of salad greens or waking up grains, beans, and vegetables.By Chris MoroccoJuly 20, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Let’s just get this out of the way: Most grocery store vinegars taste terrible. They’re made from low-quality wine (or other alcohol), which gives them a flavor that’s barely more nuanced than the chewing-on-metal taste of distilled vinegar.O-Med doesn’t make vinegars that you would ever consider cleaning with. They're lush, like burying your nose in a platter of lavender and peaches, with the concentrated, fruity essence of a good glass of wine. The rosé vinegar, made from the Spanish red grape Trepat, has a touch of sweetness softening its acidic bite and accentuating its florality. It's my favorite for year-round use. It’s bright without being harsh, perfect for lifting a bowl of salad greens or waking up grains, beans, and vegetables. I use it whenever I might otherwise turn to lemon or lime but don’t want obvious citrus flavor.For how good it is, this vinegar should be a lot more expensive. Miraculously it usually sells for around $12–14, a bit more than twice the price of those vinegars that are better suited to stripping paint. Think of it as investing in a bottle of wine that will last longer than any other rosé you can buy.—Chris Morocco, senior food editorBuy it: O-Med Rosé Vinegar, $12.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItVinegarShoppingRead MoreLifestyleThis Jarred Sauce Changed Our Grain Bowls For GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-20", "author": ["Condé Nast", "Chris Morocco"]}