{"id": "5f9770d03b16ece735dad55319d1a7da", "url": "https://www.bonappetit.com/recipe/power-butter", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Power Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssuePower ButterBy Anna StockwellJanuary 7, 20204.4(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintIf you thought it was impossible to make nut butter more delicious, try this added-value version, which combines store-bought almond butter with a bulk-aisle’s worth of seeds sizzled in coconut oil to make a crunchy spread we’d eat from breakfast 'til bedtime.Ingredients6 servings 7Tbsp. virgin coconut oil½cup raw pumpkin seeds (pepitas)⅓cup raw sesame seeds3Tbsp. chia seeds1½cups unsweetened natural almond butter1Tbsp. pure maple syrup1tsp. kosher salt1tsp. Aleppo-style pepperPreparationStep 1Heat oil and pumpkin seeds in a large skillet over medium, stirring occasionally, until oil is melted and pumpkin seeds are just starting to turn golden, about 3 minutes. Add sesame seeds and chia seeds  and cook, stirring constantly, until sesame seeds are golden, about 2 minutes. Transfer seeds and oil to a large bowl and add almond butter, maple syrup, salt, and Aleppo-style pepper. Stir vigorously until smooth; let cool.Step 2Do Ahead: Power Butter can be made 2 weeks ahead. Store airtight at room temperature.How would you rate Power Butter?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleIt's a sad day when my Power butter supply runs low.  This stuff is eat by the spoonful delicious!  It is a staple in my diet.  Calorie counting?  Just exercise!  Yummy!Dolly's MomTiny town Mi5/5/2021Doreen, shut up with your diet culture crap, if you care about calorie count why are you even here?! You clearly don't enjoy food, go back to calorie counting and leave the rest of us to actually cookeat_what_you_wantUK2/17/2021Looks interesting but what is the calorie count.  Must be thru the roof??DoreenWinnipeg Mb1/5/2021Just made this, it came out fantastic. I used cashew butter instead of almond butter, and used half the amount of coconut oil (adding in the oil from the top of the cashew butter.) Added extra pepper because I liked the spice. It came out fantastic and only took about 20 minutes to pull together. Really fantastic and layered flavor, and a recipe that I can see would be easy to mess around and experiment with. AnonymousOakland, CA1/2/2021Another BA hit!  I did not have Aleppo pepper and have substituted hot smoked paprika & red pepper flakes. I also add a few sunflowers seed to further up the crunch factor. Perfect!lismToronto, Ontario 4/26/2020I loved this the first time I made - in fact everyone else did too and ate it all!  Cut the oil to 5 Tbs this time and it seems runnier.....hum.  Still good but hard to keep on the breadcbickstAustin4/19/2020I agree with other reviewers that the amount of coconut oil can be a bit much. It ultimately comes down to how thick your almond butter is and how runny/spreadable you want the final product to be. I'd start with 2-3 Tlb and add more if necessary. Used crushed red pepper flakes because I don't have access to Aleppo peppers and it's a perfect mix of flavors and totally elevates my mid-afternoon snack of rice cakes and nut butter. El Salvador4/6/2020This is amazing and addictive. Eat it on bread, chocolate ice cream, or straight off your S/O’s toes.\n\nHighly recommend. Toe-tally delicious!AnonymousToeronto, CA1/28/2020This seeded butter is ALMOST perfect. Flavor combinations are delish and the Aleppo is a great touch...7 tbsp of coconut oil is total overkill in my opinion- just doesn’t need it. I cut it down to 3 tbsp and still felt like it was too much. Would 100% make again with 2 tbsp coconut oil. shayluhroseSyracuse, NY1/27/2020I made this power butter yesterday and WOW! I love nut butters, but this is amazing. I find myself eating it by the spoonful. The texture is amazing and the flavor delicious. I couldn’t find Aleppo pepper at my local co op, so I replaced it with toasted coconut flakes. I know it’s not exactly a substitute but that addition of coconut flavor and crunch elevated it! Such a good recipe!!! BonappetitfanaticMinneapolis, MN1/21/2020I replaced Aleppo with paprika and cayenne. This recipe is amazing with some bread, in yogurt for overnight oats or chia pudding. I used TJ's raw almond butter, which tends a little on the thicker side, and the seeds hold up really well in it.AnonymousLos Angeles1/19/2020I made this tonight - I love all nut butters so I was super excited for this recipe. While the flavor is amazing , I find the consistency too thin. Did anyone else have this problem? Wondering if I used too much oil or not enough almond butter. Does it thicken in the fridge? Anonymous1/19/2020Just made this for a midnight snack. Had it pre-cool down and it was amazing. Toasty, sweet, salty, and crunchy. Nom nom nom forever.AnonymousMinneapolis 1/18/2020Pretty delicious, though I can't stand the name! I only had chocolate almond butter and I used that along with some cashew butter. Brought it into work and people are going crazy for it! AnonymousDenver, CO1/14/2020I made this today and it's fantastic. I've never been a huge fan of natural almond butter (gasp!) because it's so dense but the coconut oil in this recipe lightens it up. Love everything about this except there's too much salt, I'd cut to 1/4 or 1/2 tsp. AnonymousDenver, CO1/12/2020Explore Bon AppétitSpreadsPumpkin SeedSeedChiaSnackDairy-FreeGluten-FreeVeganVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Anna Stockwell"]}