{"id": "5fa17a05b6a1d6a04ec50bc27fbd8b61", "url": "https://www.bonappetit.com/story/difference-between-haricot-verts-and-green-beans", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "What's the Difference Between Haricot Verts and Green Beans? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's the Difference Between Haricot Verts and Green Beans?And when do you use them?By Antara SinhaAugust 25, 2021FacebookTwitterEmailFacebookTwitterEmail“Green beans” probably evokes a fried-onion-topped casserole at Thanksgiving dinner or, maybe less fondly, the mushy things from a can that you pushed around your plate as a kid. Haricot verts, however? Fancy. Classy. French. But is there even a real difference between the two?The short answer: Haricot verts are a French variety of green beans, literally translating to “green beans” from French—sometimes you’ll even see them sold as “French green beans”. They’re long, thin, tender, cook up in a flash, have a bright, robust flavor, and are also typically harvested earlier in the season when the beans are younger. Keep an eye out for them in the summer at your farmers market, when they’re in peak season.To let their light, fresh crispness shine, they’re especially delicious when prepared simply. A quick blanch and a light butter-and-herb dressing is a foolproof method, as is tossing them into a tomato salad, or a summery zucchini and bulgur side dish.The bag of beans you’ve got in the back of your freezer for stir-fries, the canned beans from Kindergarten lunch time, the steam-in-a-bag green beans in the produce aisle—probably not haricot verts. They’re most likely a variety of green beans called Blue Lake beans that are a little fatter, shorter, hardier, and stand up to longer cooking times than haricot verts.Blister them in a cast-iron pan, char them and serve with slabs of paneer, slow-cook them to supple perfection with a bit of harissa. They’ll take a bit longer to cook than their svelte French cousins, but ultimately work in the same preparations. Or give green beans palya a try: This South Asian-style dish made by chopping fresh green beans up into small, quarter inch-sized pieces requires a bit of time to prep, but they cook up fast (like, 3 minutes fast), stay crisp and tender, and allow for maximum surface area to take on sauces and spices. Apply the “palya” method and throw in fried tofu, dried coconut, and a zippy sambal sauce for a weeknight dinner that’s the perfect combo of sweet, savory, and spicy.So, can you use them in place of each other? You technically can, but remember that haricot verts will have a much shorter cook time, and are a little more delicate. They also may be pricier, and have a shorter season in the summer than the usual Blue Lake variety.To be clear, in addition to the French-style beans and Blue Lake green beans, there are many other veggies out there that are similar. You’ll likely find lots of heirloom varieties at the farmers market, and sometimes familiar types will go by different names depending on how they’re grown (are they pole or bush beans?), and how they’re harvested. Some aren’t even green—you’ll find vibrant purple and yellow varieties out there, too. But, as you’re perusing the aisles of your grocery store, you’re likely picking between these two. And now that you know the difference between haricot verts and good old fashioned green beans, you’re set up for summer success.Coconut Tofu Stir-FryCrispy, bite-sized green beans and coconutty tofu are a match made in heaven in this quick weeknight meal. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-25", "author": ["Condé Nast", "Antara Sinha"]}