{"id": "5fa6e589b2d41f04801077d5ba6587ad", "url": "https://www.bonappetit.com/story/picky-eaters-hummus-bowls", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "When in Doubt, These Hummus Bowls Are the Answer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen in Doubt, These Hummus Bowls Are the AnswerSmitten Kitchen’s Deb Perelman has a hummus recipe that’ll please everyone from picky kids to guests who are gluten-free.By Deb PerelmanJuly 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Frances BoswellFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.My apartment is small—and my kitchen is smaller—but this has never stopped me from throwing dinner parties as often as the people I live with can tolerate. Having friends over gives me a chance to experiment with cooking ambitious dishes for a more-receptive- than-usual audience (i.e., humans other than my kids). But feeding a group of people is never as simple as putting out food and expecting everyone to happily demolish it. Between picky kids and picky adults, food allergies and special diets, there’s always going to be someone who can’t eat spicy foods and someone else who’s avoiding meat/gluten/dairy/all of the above.So how to feed a crowd so everyone leaves happy? I start with mounds of pillowy homemade hummus, which makes a fantastic foundation for an epic late-summer feast. I sauté colorful summer squash with warm spices (which mask this unpopular vegetable’s true identity from my kids) and crisp up some garlicky ground lamb for protein and texture but not heaviness. Lots of toasted pita for scooping up everything is nonnegotiable.I can guarantee that if I were to pile the squash and lamb on top of the hummus and finish the whole thing off with fistfuls of herbs, my kids would leave the table and never come back—and at least a few adults I know would be stuck eating things they’d prefer not to. Instead, I put out the hummus and all the toppings in separate bowls and let everyone serve themselves exactly how they like. And if garlicky lamb crumbles aren’t for you, well, pass the bowl to me, please.Get the recipe:Hummus with Spiced Summer Squash and LambLots of toasted pita for scooping up everything is nonnegotiable.View RecipeExplore Bon AppétitPicky Eaters’ ClubHummusLambSummer SquashRead MorecookingFor a Kid-Friendly Cacio e Pepe, Just Add CornBy Deb PerelmancookingThese Spinach Artichoke Melts Are Where Dip Meets Grilled CheeseBy Deb PerelmancookingNo Picky Eater Wants to Eat Broccoli—Until You Add KetchupBy Deb PerelmancookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Deb Perelman"]}