{"id": "5fb6f7a60dd7d58d535dfa70195d4088", "url": "https://www.bonappetit.com/story/carla-lalli-music-where-cooking-begins-cookbook-club", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Carla Lalli Music’s Where Cooking Begins Is Our March Cookbook Club Pick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur March Cookbook Club Pick Is Our Very Own Carla Lalli Music’s Where Cooking BeginsBon Appetit’s food director’s cookbook debut is more than a collection of recipes; it’s a way of being.By Julia KramerMarch 1, 2019FacebookTwitterEmailFacebookTwitterEmailI still remember the day, early on in my time at BA, when Carla Lalli Music invited me over to her house for a summer dinner hang. “I would love to come,” I said. Then I realized I’d made a huge mistake. Really, I was going to cook a dish and bring it over to the house of Carla Lalli Music—a woman so terrifyingly smart, so brutally funny, with a palate so sharp it might actually cut you? Where it would inevitably fall far below the standards of everything else being served and all the guests would silently mock me? I did what any rational person would do and showed up with the largest bottle of rosé that I could find.When I arrived, Carla was in the backyard wearing a flowy caftan, effortlessly tending to squid on the grill, chatting, assembling lettuce wraps, and pouring wine seemingly simultaneously. Like probably everyone who watches Carla on YouTube, listens to her on the BA Foodcast, or follows her on Instagram, I decided—in a totally-not-creepy-Single-White-Female way—that my life goal was to cook like Carla. Yes, to cook the exact recipes she makes, but also to cook with the ease, unpretentious sophistication, and confidence that she emanates across all platforms (and in real life, too).Thanks to the fact that we, uh, work together, I’ve had the daily opportunity to capitalize on my proximity to Carla to strive toward this goal. Carla, can I make this duck confit ahead of time? Carla, what brand are your clogs? Carla, what is the name of the restaurant in Italy where you had the pasta, you know the one I’m talking about? So while I’m sure that the release of her first book, Where Cooking Begins, later this month is probably exciting for her, this post is not about that: It’s about why the publication of this cookbook, the creation of which I had literally nothing to do with, is such a big deal for me personally. Now, no matter whether Carla’s off shooting a video in Italy or doing a guest-chef gig on her book tour, I’ll have the solace of knowing she’s right there—on my bookshelf!—to offer guidance and solutions at a moment’s notice. And it means that every person who’s not quite as lucky as I’ve been to work alongside Carla for six years now has access to this brilliant mind and her inspired approach to cooking via these extraordinarily beautiful pages.So yeah, no shock it’s our Cookbook Club pick for March! It’s our Cookbook Club pick for eternity! (Jk jk, we will continue to select different cookbooks every month.)Pre-order your copy. Ask your local bookstore to stock it. Schedule your own cookbook club night. But whatever you do, don’t wait to cook from this book. We’ve excerpted some of the recipes from the book in our March issue, and I’ve already got the Sweet Potatoes with Tahini Butter and the Seared Lamb with Marinated Halloumi on repeat. Not that that should come as a surprise.If you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon Appétitcookbook clubCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Julia Kramer"]}