{"id": "5fbd762b609fafe65566c4635ec278cd", "url": "https://www.bonappetit.com/story/dcs-food-scene-is-hot-heres-all-the-spots-you-should-explore-this-summer", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "D.C.’s Food Scene Is Hot! Here’s All the Spots You Should Explore This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredD.C.’s Food Scene Is Hot! Here’s All the Spots You Should Explore This SummerBy Washington, DCJune 18, 2018FacebookTwitterEmailFacebookTwitterEmailYou know we have a place in our hearts for the food scene in D.C.—we did, after all, name it our Restaurant City of the Year in 2016. But it continues to surprise us with an ever-changing list of new spots to try. Whether you want to enjoy the warm weather with cocktails and light bites at one of the many restaurants with rooftops or patios, splurge on one of the city’s numerous Michelin-starred fine dining venues, or take a seat at the newest hot spot in town—the nation’s capital has it all. Check out these noteworthy ideas for your next trip to Washington, D.C.Elevated Fine Dining Where Seafood Gets an Unexpected PreparationPhoto Credit The JeffersonD.C. has a plethora of award-winning restaurants, but when it comes to fine dining, the Michelin-starred Plume at The Jefferson hotel will offer an extraordinary culinary experience you won’t soon forget. The artistry of its chef team shines through in inventive dishes that focus on seasonality and are inspired by the harvest from Thomas Jefferson’s kitchen gardens at Monticello. Beyond the highlights on the menu—like the king salmon yew wood “bento” poached in Amish beeswax served with a brown butter emulsion and filet of Martin’s Angus prime beef with peperonata-stuffed baby bell peppers—Plume offers a stellar wine list of more than 1,300 labels, including the country’s largest Madeira collection.Globally Inspired Dishes That Are Almost Too Pretty to EatPhoto Credit Scott SuchmanWhat do you get when you combine the culinary influence of a chef from Lebanon with the inspiration  from arising from his travels through Southeast Asia and Western Europe? Chef Haidar Karoum’s hot spot Chloe in The Yards neighborhood and its stunning seasonal dishes that fly off the spectrum with flavor, color, and texture. A perfect example of his deft touch infusing cultures into food is the cobia crudo with avocado, Thai chiles, lime, fish sauce, crispy shallots, and puffed black rice. If you’re planning a visit, be sure to reserve a spot on the patio to enjoy your meal in the sunshine.The Perfect Rooftop Vibes for Craft Cocktails and Happy HourPhoto Credit TakodaHands up if you’re always seeking out the perfect happy hour spot! The two-story Takoda features a 120-person beer garden with removable windows for year-round fun. You can try one of the many craft cocktails featured along with elevated bar food to nosh on, like rosemary and Parmesan tots. In the stunning rooftop bar—filled with hanging and potted plants—you’ll overlook the Shaw neighborhood’s burgeoning restaurant and bar scene, considered one of the hottest in D.C. Though the classic industrial feel of this American bar and restaurant is a great choice for brunch and dinner, too, we definitely recommend swinging by during happy hour Tuesday through Friday from 5 to 7 p.m.Sip Delicious Cocktails with Stunning Sunset Views at This Rooftop Bar and LoungePhoto Credit Ron BluntHigh above the hustle and bustle of the nation’s capital lies Top of the Gate at The Watergate Hotel—a sophisticated bar with 360-degree views of the Kennedy Center, the Potomac River, the Washington Monument, and the rest of the D.C. skyline. Is it one of the city’s best places to sip on a specialty cocktail or imbibe a glass of wine or one of its many international beers? We’re going with a solid yes! Whether you’re posting up for an after-work cocktail to watch a spectacular sunset or wanting to kick back for the night with a group of friends and a couple of artisanal pizzas—you can’t go wrong with a visit.Indulge in a Meal Where Vibrant Coastal Fare Meets Spanish TraditionPhoto Credit Del MarIf you haven’t already, we can’t wait for you to feast your eyes on the latest restaurant from Fabio and Maria Trabocchi amid D.C.’s über-new waterfront destination, The Wharf. Del Mar celebrates Maria’s Spanish heritage and the traditions from their island home in Mallorca. Bring on the authentic flavors of Spain with a focus on incredibly fresh seafood including tapas, raw bar, charcoal grilled fish, seafood stews, and a variety of rice dishes. If you go and don’t order the paella de pescado y marisco with Maine lobster, wild calamari, PEI mussels, and tiger prawns, you are seriously missing out. It’s a dish that, with every bite, will transport you to the vibrant flavors of coastal Spain.Now, THAT Is a French Toast Dish We Didn’t ExpectPhoto credit A Rake’s ProgressWe’re big fans of The Line hotel and its D.C. location, and even bigger fans of its lineup of in-house restaurants. High on our favorites list is the hyper-local A Rake’s Progress featuring James Beard Award–winning Baltimore chef Spike Gjerde’s farm-focused cuisine. With prestige ingredients sourced from Mid-Atlantic farms and waters, Chef Spike takes diners on a journey of culinary terroir. Yes, you could certainly stop by for a delightful dinner here, but we think brunch—and dishes like the grilled French toast with maple grilled pork belly, pecans, and champagne sabayon—is where it’s at.For more food lovers’ content, lists of the best eats in the city, and things to do in Washington, D.C., go to washington.org.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-18", "author": ["Condé Nast", "Washington"]}