{"id": "5fc37f86ace13ed097a640a8ca747a14", "url": "https://www.bonappetit.com/story/maricela-vega", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Chef Maricela Vega Shows Us How to Love Eating Plants in the Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChef Maricela Vega Shows Us How to Love Eating Plants in the WinterThe secret to creating delicious, filling vegan meals in the middle of February? Do like the ancestors did—work with what you gotBy Hilary CadiganJanuary 18, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAsk Maricela Vega what drives her cooking and she’ll talk about relationships. Relationships with farmers, with community, with family and ancestors and the earth itself. “Food doesn’t just magically appear,” she says. “I rely on so many to do what I do.”For the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering Indigenous foodways, using mostly vegetables—and only when they’re local and in season—is a form of empathy. Vega’s strong farmer ties yield lush peach pound cakes in summer and crispy-cushiony squash empanadas come fall. “If you’re eating a tomato in the middle of February, someone is feeling the consequence,” she says. “To me, cooking well is about making the most of what’s here now, and not asking for more.”Of course, this philosophy is nothing new. It’s the way people ate for millennia, before mechanization and monoculture became the norm, and its Indigenous roots run parallel to Vega’s own. Her parents both come from farming families in Guanajuato, Mexico; they met washing clothes in the river that divided their villages. And though they didn’t talk much about their Indigenous heritage during Vega’s childhood (“I think there used to be some shame there,” she says), reclaiming it has become her personal mission as a chef. In the years since, she’s traced corn’s cultivation back to Mesoamerica and studied how modern agriculture both devastates the planet and relies heavily on exploitative immigrant labor, including that of her own uncles and cousins. “It’s all connected,” she says. “You need to learn from the past to create a better future.”And that’s what Vega does, both in 8ARM’s tiny kitchen and the pages that follow, with healthy, seasonal, plant-based staples electrified by a colorful array of swappable condiments. From tender tamales drizzled in fiery pumpkin hot sauce to grilled mushrooms studded with crunchy spiced pecans, she shows that eating ethically can be seriously tasty—even in the dead of winter.Start with some flavor makers:With this versatile artillery of mix-and-matchable, make-in-bulkable sauces and toppings, Vega turns February produce into meals that wow.Photograph By Jessica Pettway, Food Styling By Sue Li, Prop Styling By Sophie Strangio1. Pumpkin Hot Sauce: This spicy, velvety elixir works on everything from tamales to scrambled eggs. Mix in olive oil, vinegar, and honey to make vinaigrette, or simmer a cup with a can of coconut milk to start a curry-like sauce.2. Allium Confit: Garlic, leeks, and chives are all you need to make this savory infused oil, great on its own or as a base for just about any sauce or dressing—including that pumpkin hot sauce to the above right!3. Guajillo Oil: Mild heat and smoky, fruity flavor. Dip tortillas in this bright red oil before pan- frying them for enchiladas, or add crushed peanuts, fried garlic, and extra chiles for salsa macha4. Pickled Beets: Quick-pickling is an excellent way to punch up and preserve mild root vegetables like beets. Add them to grain bowls for flavor and texture and use the leftover pickling liquid to dress sautéed vegetables for a colorful side dish.5. Sesame Crème: You can adapt this dairy-free recipe for just about any seed or nut you have. Use it on its own as a savory dressing or blend it with Dijon mustard for a vegan aioli that’s good on fried potatoes, sandwiches, burgers, fish, you name it.6. Spiced Pecans: Pecans get an upgrade with garlic, honey, and fresh ground spices. Eat them by the fistful or sprinkle them liberally on salads or grilled veggies for deep flavor and crunch.Then build a meal:Carrot and Habanero TamalesA tamal filled with carrots, habaneros, and garlic is chef Maricela Vega’s celebration of how the harvest from summer and fall floats into wintertime.View RecipeGrilled Mushrooms and Root VegetablesThis dish is perfect for long winter days when you want to flood the house with toasty, irresistible aromas.View RecipeWarm Sorghum Salad With Pickled BeetsThis salad uses ancient grains to create a dish that reflects Mexico and the American South. For chef Maricela Vega it meshes both of their histories while making the most of the foods she is surrounded by.View RecipeExplore Bon AppétitHealthyishVeganMexicanVegetableRead MoreLifestyle4 Healthyish Weeknight Dinners Because We Can't Survive on Cookies AloneBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-18", "author": ["Condé Nast", "Hilary Cadigan"]}