{"id": "5fca2544f083bcd2fd53ef759a83c3ac", "url": "https://www.bonappetit.com/recipe/caramelized-zucchini-flatbread", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Caramelized Zucchini Flatbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramelized Zucchini FlatbreadBy Kat BoytsovaSeptember 4, 20184.0(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThe secret to a flatbread with a super-crunchy crust? Pre-roasting all of the veggies. This step concentrates their flavor, and also helps to cook out some of their moisture, which would otherwise soak into the crust. When shaping the dough, don't be afraid to stretch it as thinly as possible—if the dough is springing back on you, just be patient and let it rest for a few minutes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketSpatula$12.99 At AmazonMedium Bowl$17 At AmazonWooden Spoon$6 At AmazonMicroplane$16 At AmazonIngredients6–8 servings1lb. pizza dough1½lb. zucchini (about 3 medium)1large red onion6Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt1lemon2cups fresh ricotta¼cup finely grated Parmesan (about 1¼ oz.)1small garlic clove½cup mint leaves½tsp. crushed red pepper flakesPreparationStep 1Place racks on upper and lower third of oven; preheat to 450°. Let 1 lb. pizza dough sit in its bag or container until it reaches room temperature, at least 30 minutes—room temp dough is much easier to stretch. Prepare your vegetables while you wait.Step 2Start by trimming stem end from 1½ lb. zucchini, then slice crosswise into ¼\"-thick coins.Step 3Peel 1 onion and thinly slice crosswise into rings to match thickness of zucchini.Step 4Toss zucchini, onion, and 2 Tbsp. oil on a rimmed baking sheet; season generously with salt. Spread out in an even layer into corners of pan, taking care not to pile into the middle. Roast on top rack, tossing with a spatula once halfway through, until vegetables are well browned all over and tender, 25–30 minutes. Let cool.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Place dough in the center of another large baking sheet and drizzle with 1 Tbsp. oil, then turn to coat. Using your fingers, stretch dough outward from the center all the way to edges of pan. If dough stubbornly springs back, cover with plastic wrap and let rest a few minutes. You may need to do this a few times until your dough cooperates.Step 6Drizzle dough with 1 Tbsp. oil and use clean hands to spread oil all across surface. Season dough lightly with salt.Step 7Bake dough on bottom rack until beginning to brown and crisp on the bottom, 7–9 minutes.Step 8Mix 2 cups ricotta, ¼ cup Parmesan, 2 Tbsp. oil, and ½ tsp. salt in a medium bowl. Using a Microplane, finely grate zest from half of the lemon into bowl with ricotta mixture. Peel 1 garlic clove and use Microplane to grate into bowl. Mix to combine.Step 9Dollop ricotta mixture generously over dough. Top with roasted veggies, distributing evenly.Step 10Return flatbread to top third of oven and bake until ricotta starts to ooze into vegetables, 6–8 minutes.Step 11Immediately grate zest from remaining half of lemon across pizza. Sprinkle ½ cup mint leaves and ½ tsp. red pepper flakes over, then squeeze one half of the zested lemon across surface. Drizzle with oil before slicing.How would you rate Caramelized Zucchini Flatbread?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis recipe is good with some tweaking. I have done ricotta flatbreads before and have just learned it’s not good as a standalone cheese, since it has next to no flavor and is a little sweet. So, I used 2/3 ricotta and 1/3 fresh goat cheese, and added half of a lemon’s juice and doubled the garlic, and added black pepper and more red pepper in the cheese. For the veg, I find zucchini and onions just get a little mush, especially when cooked for this long, so I roasted broccoli on the bottom rack while the rest was cooking on the top, and took it out after 10 minutes. I thought this really helped give the dish some more oomph. Lastly, I used basil instead of a mint just because of personal preference. If you do these minor changes, this is a really nice flatbread that saves pretty well! Side note: when I reheated this (in the oven at 275 for 10 mins) I found the ricotta was almost totally dried out. Luckily, I had saved some of the extra cheese mixture, and just stuck that on top with a drizzle of olive oil. If you can, save some of it when you make it because it’s great for reheating (or just on some sourdough with olive oil!)skycooksMissouri3/23/2020This tasted great! The zucchini and the onions caramelized great in the oven, and everything came together very quickly.AnonymousColumbia, SC1/11/2020It was bland! I followed the recipe to a T, two times (once with naan instead of flatbread because that was all I had. Don't judge me. It tasted fine.) I gotta agree with the people in the comments that the ricotta approach ain't the right one. The lemon/garlicky-ness of it is good, but too mild to compliment the zucc as it deserves.  It just needs a lil pizzaz~NatWatAustin, TX9/24/2019Loved this! The tangy/sweet combo was delicious, and you can never go too much when it comes to loading on extra roasted veggies. I swapped out mint for basil because I had too much of it on my hands, and I would be interested to see which version I like better. I thought the basil worked well!AnonymousBoston, MA8/21/2019I absolutely loved this recipe!  The real star was the lemon zest; it brightened up the entire dish.  I roasted some additional vegetables, eggplant,  mushrooms, and cherry tomatoes because I love a lot of toppings on my pizza.   To get that perfect crunch I think it is important to be generous with the olive oil, and ensure the crust has baked enough before adding the toppings.  Overall great recipe, thank you!bgaudetteNorth Carolina7/4/2019There has to be a better topping than ricotta. I made this last night, following instructions and the ricotta made a gloppy mess. andrea.serna1@gmail.comLos Angeles6/27/2019To Anita459 and Lesvap: The recipe clearly states \"Preheat oven to 450 degrees.\" \n\nI know I'm late to the game, but I wanted to make sure anyone else reading this knows the temp! AnonymousNew York, NY 6/20/2019I roasted zucchini and red onion at 425F, and then pretty much went off the rails from there. I tore up some tuscan kale and threw it in the dregs of the zucchini/onion dressing and the first of the season's sweet corn. I took a cue from all you cheese mixers in the comments and whipped a 50/50 combo of ricotta and feta (no salt or lemon needed). Then I cut up some chorizo, cuz why the heck not. \n\nI still topped it with mint, though!\n\nFor anyone using a pre-formed dough with a longer bake time than suggested (for instance, mine says 17-22 minutes) I baked the dough blank for 10 minutes and then topped for 11. riff with abandonsan luis obispo, ca6/19/2019I took the advice of another reviewer and switched HALF of the ricotta for goat cheese to make it less sweet. I sliced the zucchs and red onion very thinly. It all carmelized beautifully! I also happened to mistakenly add the lemon zest to the pizza before I cooked it and it worked out fine. We traded out mint for basil leaves. Absolutely delicious flatbread pizza! We’ll definitely do this again! Maybe with som added porcini mushrooms next time.AnonymousOregon5/26/2019Loved it. Switched out the ricotta for goat cheese to lessen sweetness. Will make again!AnonymousColorado 9/23/2018This is INCREDIBLY delicious. I don’t understand how the other reviewers didnt like it. It tasted amazing!!!!! The mint is such a strange choice but pairs soooo well with the sweetness of the caramelized zucchini and onion. Making it again tomorrow!!AnonymousKuwait 9/13/2018After reading the review, I can see why Anita459 had problem caramelizing the zucchini.  The instructions need to list a temperature to roast the vegetables.  I'm thinking maybe 425-450 F, but I'm not sure.\nIt does look good, but I definitely would want my zucchinni to be carmalized if I tried this.LESVAPOklahoma9/10/2018I actually weighed the zucchini to make sure I had the correct amount.  After an hour, double the roasting time the zucchini was still not caramelized.  By that time I was done working on it.  The pizza was very sweet, not a good choice for dinner.  I won't be making this again.Anita459Oregon9/10/2018Explore Bon AppétitFlatbreadBreadAmericanZucchiniSquashVegetableRed OnionOnionMintHerbs & SpicesRicottaCheeseSummerMainNut-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast", "Kat Boytsova"]}