{"id": "5fd041970b9c7e744b55fe91bdb2bbd6", "url": "https://www.bonappetit.com/recipe/saucy-chicken-puttanesca", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Chicken Puttanesca Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSaucy Chicken PuttanescaBy Andy BaraghaniDecember 13, 20194.7(84)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThe famous Neapolitan tomato sauce—packed with olives, garlic, capers, and anchovies—is traditionally paired with long pasta. In our version, chicken legs are gently oven-braised in the puttanesca until it's nearly falling off the bone. It’s a low-maintenance, one-skillet dish that is easy to pull off on a weeknight.Ingredients4 servings3lb. skin-on, bone-in chicken thighs and drumsticks or whole legsKosher salt2Tbsp. extra-virgin olive oil, plus more for drizzling6garlic cloves, thinly sliced4oil-packed anchovy fillets½tsp. crushed red pepper flakes2Tbsp. double-concentrated tomato paste1cup Castelvetrano olives, crushed, pits removed¾cup dry white wine2Tbsp. drained capers2fresh bay leaves (optional)32\" strips lemon peel, plus lemon wedges for servingPreparationStep 1Preheat oven to 350°. Pat chicken dry with paper towels, then season all over with salt.Step 2Heat 2 Tbsp. oil in a large skillet over medium-high until shimmering. Cook chicken, turning occasionally, until it has rendered some of its fat and skin is golden brown all over, 7–10 minutes. Transfer chicken to a plate. You’ll have a pool of fat left in the pan. Spoon out all but 3 Tbsp. fat from pan. (Use it for roasted potatoes, in cooked bitter greens, or add to stewy beans.)Step 3Reduce heat to medium and add garlic and anchovies to skillet. Cook, stirring often, until garlic is softened and anchovies have disintegrated, 2–3 minutes. Sprinkle in red pepper flakes, then stir in tomato paste. Cook, stirring occasionally, until tomato paste begins to split and stick to pan, about 3 minutes. Add olives, wine, capers, bay leaves (if using), and lemon peel and bring to a simmer (still over medium heat). Cook, stirring occasionally, until most of the wine has evaporated, 5–7 minutes.Step 4Snuggle chicken (skin side up) into sauce in a single layer. Pour in 1 cup water and bring to a simmer. Transfer skillet to oven and bake, uncovered, until sauce is thickened and chicken is cooked through, 20–25 minutes (if using whole legs, it’ll take closer to 30–35 minutes). Taste a spoonful of the sauce—it should be plenty salty between the anchovies and capers, so you most likely won’t need to season with more salt.Step 5Transfer chicken to a platter and spoon sauce over. Drizzle with oil and serve with lemon wedges alongside.How would you rate Saucy Chicken Puttanesca?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleGreat recipe! I would reduce the sauce after removing from the oven if I make again. Ben Seattle 2/28/2022yummy!\nI lov eto make it again!Surbhiindia1/3/2022tasty!Surbhibangalore1/3/2022I've made this 3x now and it is always fabulous. ChristinaOlathe, KS11/14/2021This is a great recipe. We've made a few minor alterations that we think really adds:\n-Use Marcella Hazan's butter tomato sauce for incredible depth (works especially well if you already have leftovers!)\n-Don't add water\n-Use Lillet instead of wineE&AToronto11/2/2021this has become my bf and i's favorite dish. I seriously make it twice a week lol, sometimes I have to add some salt near the end but that's just my preference. delicious and super easy to make! aly cdallas,tx10/1/2021I've made this twice now and each time it was DELICIOUS! It feels fancy too lol, its becomes my bf and I's favorite dinner. I double the ingredients for the sauce though as the first time I felt I needed/wanted moreAnonymous6/7/2021Really Fantastic!!!\n\nI followed the instructions almost to a T, but for 2 things:\n1. I subbed 2 tbsp Nduja for the capers. \n2. I reduced the sauce after I removed the pan from the oven,\nHoly moly!  Absolutely delicious!RB++Pittsburgh, PA5/8/2021This is very similar to the recipe that I use, and you really can't go wrong with this. I always use kalamata olives instead of castelvetrano (and I love any excuse to use those). I believe they are more traditional with this recipe and will certainly provide you with more flavor. I love that you don't need to add salt to a good puttanesca, it just takes care of itself. I haven't used lemon, but will try that this weekend. Thanks, Bon Appetit.Kevin RAtlanta4/29/2021Great recipe! I decided to make it since I had an opened bottle of wine in the refrigerator, half used-up jar of Castelvetrano olives and a tin of anchovies in the pantry. Right in the middle of putting it together I could find my capers (found later behind a lot of jars!) or the anchovies! No worries- it was still delicious - but without those two ingredients, it did need to be salted. I will make it again - the sauce is so good!AnonymousFishers, IN4/27/2021If you tell me there’s castelvetrano olives I’m in all the time! This dish is so good! Packed with flavor and easy to make! I serve it over jasmine rice. Next time I make it I’ll be doing more of the sauce portion. So good!IlanaVermont4/26/2021FLAVOR BOMB ALERT!!!! This dish is accessible for just about any cook. Castelvetrano olives are not always the easiest olive to find, but kalamata will do - as well as any briny green olive in a pinch. Used a mixture of thighs and breasts to keep the family happy and I did! Emily MLoon Lake (Chestertown), New York2/25/2021My wife and I love this recipe.  In fact she requested it for her St. Valentine's Day dinner recently.  I've followed the recipe to the letter every time except this last time.  I couldn't find any Castelvetrano olives so I substituted Greek Kalamata olives instead and we both felt it was a little tastier this time.  Todd S.Alabama2/16/2021This was absolutely delicious, and I would have no qualms serving this to my wine group of 35 years.  It was even better the second day! \n\nI served it over spaghetti, coating the pasta with the juices.  Next time I make this I will be making more \"sauce\".\n\nCathi Giacopuzzi BeerySalinas, Monterey County, California1/24/2021Awesome recipe, if I have olives that need to be used up I will certainly make this again! This recipe is plenty salty; after reading reviews, I didn't salt my chicken before browning and didn't add additional salt and I'm happy I did. This pairs perfectly with blander side dishes like baked potatoes because of the delicious sauce! AnonymousPhiladelphia, PA1/21/2021Explore Bon AppétitOliveOther IngredientsChicken LegChickenPoultryChicken DrumstickChicken ThighEasyOne-Pot MealsWeeknight MealsMainGluten-FreeDairy-FreeNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast", "Andy Baraghani"]}