{"id": "5fdf72d68939e88fdb54d5ded7012340", "url": "https://www.bonappetit.com/recipe/cauliflower-rice-pilaf", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Cauliflower Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCauliflower Rice PilafBy Lauren SchaeferFebruary 4, 20194.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe seasonings and accompaniments for this cauliflower rice recipe are adaptable based on what you find in your cabinets. Try currants instead of raisins, finely crushed walnuts instead of sliced almonds, and ground ginger or garlic instead of the cinnamon.Ingredients4 servings1head of cauliflower (about 2¼ lb.), leaves removed, coarsely chopped into 1\"–2\" pieces4scallions3Tbsp. ghee or unsalted butter, divided½cup peeled, sliced almonds½tsp. ground cinnamon½tsp. crushed red pepper flakesKosher salt3Tbsp. golden raisins, choppedPreparationStep 1Working in batches if needed, pulse cauliflower in a food processor until rice-size pieces form, being careful not to overprocess. Transfer to a medium bowl.Step 2Trim scallions, then finely chop white parts. Thinly slice green parts on an angle; set these aside for serving.Step 3Melt 2 Tbsp. ghee in a medium skillet over medium-high heat. Toast almonds, tossing occasionally, until they start to turn golden, about 3 minutes. Remove from heat and add cinnamon and red pepper flakes; season with salt and toss to coat. Transfer to a large bowl.Step 4Melt remaining 1 Tbsp. ghee in same skillet over medium-high heat. Cook white scallion parts, stirring constantly, until golden brown, about 3 minutes. Add raisins and reduce heat to medium-low. Add cauliflower and cook, tossing occasionally, until some steam is released and cauliflower is just tender, about 3 minutes.Step 5Transfer cauliflower mixture to bowl with almond mixture; season with salt and toss to combine. Add reserved green scallion parts and toss once more before serving.How would you rate Cauliflower Rice Pilaf?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleabsolutely delicious!AnonymousPoland4/18/2020This was so much better than I expected! A great way to spice up cauliflower, and use up random pantry ingredients lying around like sliced almonds and golden raisins. Will definitely make again. AnonymousGrand Rapids, MI9/23/2019This was everything I wanted it to be and MORE. The spiced buttery almonds are so crunchy wonderful, the scallions keep the cauliflower from tasting like nothing, and the raisins add just the tiniest amount of needed sweetness. I ruined my kitchen with cauliflower particles, so I won't feel bad if I use \"riced cauliflower\" from Trader Joe's next time. alexbeggsBon Appétit 9/4/2019Absolutely delicious! We used dried apricots instead of raisins and seasoned everything with line. Loved it!AnonymousPortugal5/28/2019Holy smokes, it was so good. To the extent that my \"four servings\" rapidly became two servings as I was shoveling it out of the pan before I could plate it up. My housemates haven't forgiven me but honestly with food like this, who needs friends? AnonymousLondon, UK2/7/2019This dish is wonderfully flavorful. Had no golden raisins, so choppef a couple of medjool dates. We both loved it. Will definitely make it again and again. So good you didn't pay attention to the fact that you are eating cauliflower and not rice. IAnonymousGananoque, Ontario2/6/2019This was surprisingly flavorful! I've always felt meh about cauliflower rice but the pilaf treatment is very smart. AnonymousNew York 2/4/2019Explore Bon AppétitPilafCauliflowerVegetableSideGluten-FreeVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Lauren Schaefer"]}