{"id": "5fe922a3129e9569e0119d382d53ff09", "url": "https://www.bonappetit.com/story/should-you-keep-flour-in-the-fridge", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "Should You Keep Flour in the Fridge? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShould You Keep Flour in the Fridge?How to protect your precious flour.By Alex BeggsFebruary 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by D'mytrek BrownFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Flour mites are the grossest thing I’ve ever found in my kitchen, which is an impressive, wormy list. Once they got a taste of my apparently delicious all-purpose flour, the little bugs got into the farro, some breadcrumbs, and who knows what else. I had to toss the entire pantry’s contents, sanitize, and complain for weeks in order to get over it.Since then I’ve been storing flour in a container in my fridge, not the bag it came in, which has too many possible mite entries (I blamed a previous tenant, but they might have come in the flour itself, who knows). The mites love warmth and humidity, and the cold, dry fridge is their enemy. Plus, a good airtight container defends against intruders. But as my baking hobby has grown, and I’ve started collecting freshly milled whole wheat flours, local cornmeal, and rye flour, I have a whole designated area of my fridge for flours (which, wow). Now it has less to do with bugs and more to do with freshness.White flour (like all-purpose, bread flour, cake flour) has a long shelf-life, both at the grocery store and at home. It can last a year before it starts to go rancid because the volatile germ and bran have been removed. Recently milled, whole grain flours, on the other hand, won’t last nearly as long. That’s because, for starters, they’re fresher. Think of them like fresh fruit compared to dried or freeze-dried fruit. If you buy white cornmeal from Anson Mills, they grind it to order just for you. That gives these products an incredibly fragrant, flavorful punch that you can taste. And unlike refined flour, whole grain flours contain the literal whole grain. Including the grain’s hull gives the flours a nutty, wholesome flavor and retains all of their fiber and vitamins and good-for-you-qualities.By the way, Roxana Jullapat, the co-owner and baker of LA’s Friends and Family, wrote an entire cookbook dedicated to these wonderful ingredients; check out a few of her recipes here and let me beg you to buy some barley and buckwheat flour to make her brown butter blondies and soufflé chocolate cake.If you’ve got your barley and buckwheat in the pantry, you might have just two-three months, depending on the product, before these whole grains flours and meals go rancid. You’ll be able to tell with your nose—a rancid flour smells sour and “off.”But in the fridge, they’ll stay fresh, in Roxana’s approximation, up to a year, depending on the product. If these are flours you really don’t think you’ll use that much but are excited to have for special occasions, you can store them in the freezer, too.I store my fridge flours in quart- and pint-sized deli containers, but their cylindrical shape isn’t very efficient when you start to accumulate many, many flours. I’d recommend the 2-qt. Cambro containers, which are rectangular and stack nicely. Roxana herself uses resealable freezer bags, which take up the least space. (I’d make a mess of those, so I prefer something sturdier.) Just make sure to date and label them, she told me, “because when that stuff goes in the fridge, they all look the same. One is brighter than the other, but they all look the same.” You don’t want to risk any kind of cookie confusion.Funny enough, now I go through so much all-purpose flour I buy it in 10-pound bags and keep it right on my counter in an airtight container that so far, hasn’t been susceptible to any mites. As I bake, I swap in a few tablespoons or ¼ cup of one of the whole grain flours in recipes that otherwise use entirely all-purpose (you don’t want to do 100 percent swaps because you might end up with a dense, sad cake). This is how I get my thrills!The flours are starting to take over my fridge, though, and I can only see one solution. Time for a bigger fridge.Flour power:Mother Grains$40 at Amazon$37 at BookshopExplore Bon AppétitFlourBasically BakingCooking TipsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-19", "author": ["Condé Nast", "Alex Beggs"]}