{"id": "5ff9651b7859f94a6b938a6c4a1e9b64", "url": "https://www.bonappetit.com/recipe/porcini-gnocchi-with-butter-sauce", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Porcini Gnocchi With Butter Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssuePorcini Gnocchi With Butter SauceBy Stefano SecchiMarch 15, 20224.5(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Rebecca Jurkevich, prop styling by Marina Bevilacqua EmailPinterestPrintEmailPinterestPrintThis gnocchi is inspired by a porcini mushroom pasta that chef Stefano Secchi ate at Il Centro, a restaurant in Piedmont, Italy, where the misty forests are perfect for foraging. Don’t worry if you don’t have access to freshly foraged porcinis, though: This recipe relies on easier-to-find dried mushrooms, which are ground into powder and mixed into the dough. For the best and lightest gnocchi, Secchi suggests using slightly older potatoes: “They have less moisture content, so you can add less flour and keep your gnocchi from getting gummy.” Roasting the potatoes on a wire rack allows steam to escape from every side. To form the gnocchi, look no further than your flatware drawer. “You can use a gnocchi board,” Secchi says, “but my nonna always used a fork.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidVegetable Peeler$10 At AmazonJumbo Silpat Roul'pat$65 At Food52Scale$25 At AmazonBench Scraper$8 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonWire Rack$23 At BA MarketIngredients4 servings6medium Yukon Gold potatoes (about 2 lb.)½oz. dried porcini mushrooms (about ⅓ cup)1⅔cups (208 g) Italian 00 flour or all-purpose flour¼tsp. kosher salt, plus more1large egg, beaten to blend½cup (1 stick) unsalted butter, cut into small pieces12sage leavesFinely grated Parmesan (for serving)PreparationStep 1Place rack in middle of oven; preheat to 350°. Poke holes all over potatoes with a fork and place on a wire rack set inside a large rimmed baking sheet. Roast potatoes until flesh is easily pierced with a fork, 45–60 minutes. Let sit until just cool enough to handle, about 15 minutes.Step 2Peel potatoes and pass through a potato ricer (or use the bottom of a glass to push through a fine-mesh sieve). Place in a large bowl and let cool completely.Step 3Meanwhile, pulse dried mushrooms in a spice mill or a high-speed blender to a fine powder. Transfer to a medium bowl and add flour and ¼ tsp. salt; whisk to combine.Step 4Add dry ingredients and egg to bowl with potatoes and fold together. Then, using your hands, form into a single mass. Turn out onto a work surface and knead until smooth.Step 5Cut dough into 6 portions. Working with 1 portion at a time and covering remaining portions with plastic wrap while you work, roll each portion into a rope about ½\" wide. Cut into ½\"-long pieces and roll each piece along fork to form ridges. Arrange gnocchi in a single layer on a rimmed baking sheet (line with parchment paper if making ahead).Step 6Cook gnocchi in a large pot of boiling salted water until they float to the surface, about 3 minutes (4 minutes if cooking from frozen). Drain, reserving ½ cup cooking liquid.Step 7While the gnocchi is cooking, heat butter in a medium high-sided skillet over medium, stirring often, until it foams, then browns, 5–8 minutes. Add sage leaves and ¼ cup reserved pasta cooking liquid, tilting the pan away from you to protect yourself from spattering. Once spattering has settled down, swirl liquid in pan, then add gnocchi and cook, tossing and adding remaining pasta cooking liquid a little at a time (you might not need all of it) until sauce is combined and creamy and pasta is well coated, about 1 minute.Step 8Divide pasta among shallow bowls and top with Parmesan.Do ahead: Gnocchi can be formed 3 days ahead. Tightly wrap baking sheet and freeze.How would you rate Porcini Gnocchi With Butter Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious dish! I thought the gnocchi could have used more salt, and because the dough was so soft it took some effort to roll them into that classic gnocchi shape. Maybe I needed to bake the potatoes longer so they had less moisture? The brown butter and sage sauce was tasty though I had to add a squeeze of lemon juice and and umami (small splash of soy sauce) to round out the flavor. Without that it was a little flat. All in all a lovely upgrade from plain gnocchi, and a recipe I will make again!  SpatulaCity123Los Angeles3/24/2022Explore Bon AppétitMainDinnerNut-FreeVegetarianItalianEuropeanPastaGnocchiPotatoVegetableYukon Gold PotatoSageHerbs & SpicesSimmerPorcini MushroomMushroomRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Stefano Secchi"]}