{"id": "5ffc4d100af0fb73d855d202fa8ad233", "url": "https://www.bonappetit.com/story/mover-and-shaker-co-cocktail-pins", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Love Cocktails? Wear One of These Pins to Prove It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLove Cocktails? Wear One of These Pins to Prove ItMover & Shaker Co.’s cool cocktail pins let me show my love for all the martinis, Manhattans, and Mai Tais that sustain me.By Christina ChaeyOctober 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI first spotted one of Mover & Shaker Co.’s enamel pins on cocktail man and Bitters author Brad Thomas Parsons’ Instagram a few months ago. I didn’t know before that moment that I needed a glossy little pin of Fernando, the green-and-citron mascot of the Italian amaro Fernet Branca. But the instant I saw that little gator guy proudly hoisting up a Branca-branded orange, I had to have him... and I don't even like Fernet.Then I discovered all of Mover & Shaker Co.’s other nostalgic and cheeky pins. There’s the Kool-Aid Man–inspired “Negroni Man” who is ready to bust through walls upon command (OHHHH YEAHHHHHH). Bender from Futurama and Archer wear matching red caps that say “Still Making Great Cocktails.” Salt Bae, a.k.a. the Morton Salt Girl-gone-bad, wields a scythe and a canister of salt emblazoned with a skull and crossbones. These were clearly made by people who not only get my love of cocktails, but also share my appreciation for old-school cartoons and well-placed pop-culture references. So, naturally, I called them up to find out who they were.I reached Nick Hogan, a bartender and cofounder. Hogan and his longtime friend Matt Shail founded the brand in 2017 as a little side hustle. It meant Shail could flex his graphic design skills, and Hogan, who was trying to drum up more of a name for himself in the craft bartending scene, could seed a bit of buzz by bringing the pins around to his gigs at bars and events.They settled on two initial pin designs: One was a take on Angostura bitters, an iconic bar staple and one of the key ingredients in a classic Manhattan; the other paid homage to Fernet Branca, the robustly minty and bitter amaro that’s often shared between bartenders and impassioned drinkers as a “secret handshake” drink of sorts.But it wasn‘t until a few months later that things really took off. When the second season of Stranger Things hit Netflix last fall, Hogan was inspired to create a pin that said “Stronger Drinks,” in the style of the show’s logo. Hogan and Shail got in touch with Pinlord, a popular Instagram account dedicated to enamel pins, who featured the design on its account. The pin went viral, and Mover & Shaker Co. sold their entire stock overnight.For now, the pair is still approaching Mover & Shaker from the perspective of two hobbyists who just want to make cool stuff for people who appreciate booze. Both have other full-time jobs, and their primary focus (for the time being) is to keep creating designs that excite them. They've expanded to 40-some different pin designs, and have begun selling patches and t-shirts too. They do special collaborations and custom pins here and there, but mostly they stick to what they know, like the recent Two-Can Sam, a whimsical spin on vintage Guinness beer posters that instead features a certain fruit-flavored breakfast cereal mascot. Or one of my personal favorites: the Flair Bears, a Care Bears-inspired pin that takes a subtle jab at the ridiculous theatrics of “flair bartending”—the kind of performative cocktail-making that involves throwing liquor bottles high in the air, lighting things on fire, doing crazy-acrobatic pours, and so on.“Bartenders are always coming up with puns for flair bartending,” Hogan says. “It's like the opposite of craft bartending.” Other contenders? “Flairy Potter,” he says. “Or maybe Flairy Bird.” Consider this my vote in advance to Flairy Potter.Explore Bon AppétitCocktailRead MorecookingBad Wine Is Just a Great Cocktail Waiting to HappenBy Alison RomancookingThis Frozen Margarita Pie Is Full of Tequila and Just As Incredible As It SoundsBy Jesse Sparksculture6 Essential Cocktails Everyone Should Know How to MakeBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Christina Chaey"]}