{"id": "5ffeb48a38441c24ea61ae135cafb61f", "url": "https://www.bonappetit.com/story/how-to-make-vinaigrette", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "How to Make a Vinaigrette Yourself (and Ditch the Bottled Stuff for Good) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make a Vinaigrette Yourself (and Ditch the Bottled Stuff for Good)Homemade salad dressing is the easiest way to improve your salads and impress your guests. Here's how.By Alex DelanySeptember 21, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailWe are firm believers that homemade salad dressing is the only salad dressing worth using. Well, if you make it right, that is. If you’re a rookie in the vinaigrette construction department, we’re here to help. We want you to know how to make vinaigrette. We want you to go pro.The ingredient list is simple, filled with things that you have in your pantry or fridge, and making a top-notch vinaigrette only takes about five minutes. And once you make this basic version, you'll have all the intel you need to riff on it and keep things interesting. It’s a win-win scenario that your salad—and grain bowls, and poached fish, and crudites platters—is going to love, so let’s get to it. Get a medium-sized bowl and a whisk ready. We’re about to be dressing.Alex LauStart with AcidAll vinaigrettes contain acid. Whether it be citrus juice or vinegar (vinaig-rette, vinegar, get it??), acid is an element that is absolutely essential. For a simple vinaigrette, we like red wine vinegar, white wine vinegar, or sherry vinegar, which offer plenty of tang and flavor without being too overwhelming. It’s good to keep the ratio of vinegar to oil (which we’ll get to later) in mind. Most of the time, vinaigrettes will use a ratio of either 1:2 or 1:3 acid to oil, depending on how tangy you like your dressing. If you've ever made a kind of \"meh\" vinaigrette, there's a good chance that you had too much oil and not enough acid in there, so don't be shy.Add an EmulsifierWhat is an emulsifier, and why do we need one? In a vinaigrette and elsewhere, an emulsifier is something for the oil to cling to. It brings the vinegar, oil, and flavor enhancers together to form one harmonious substance. Our favorite emulsifier for vinaigrettes is Dijon mustard, although finely grated garlic or ginger works too. A good emulsifier will be fine and have a bit of flavor to add to the vinaigrette.Add an Allium or a Fresh Herb...If You WantChopped shallots, scallions, onions, or any variety of fresh herbs are easy to add into a dressing for an extra hit of variety. This is an optional step, but if you’re looking for more meaning in life, or at least more flavor in your dressing, adding a finely chopped aromatic is the move.Season The Damn ThingYou should think of your vinaigrette as a sauce...because it is. It’s the seasoning agent for everything in your salad, which means it needs to provide enough salt and sweetness to make everything on the plate delicious. The ultimate flaw with most homemade vinaigrettes is that they aren’t sweet or salty enough, so when adding kosher salt and sugar (actual sugar or honey), don’t be shy. Again: If it tastes kinda \"meh,\" you probably need to add another pinch of salt and/or sugar.Whisk It!Before we add our oil, we need to make sure all of our other elements are combined. This doesn’t involve vigorous whisking, just enough to make sure everyone gets to know each other.Add Your Oil and Whisk AgainOnce your other ingredients have been mixed, it’s time to add the final component. It’s time for oil. Before we get into whisking technique, we’d just like to say that extra virgin olive oil is what you should be reaching for. You don’t want to use a low-quality cooking oil, since this is going directly on your salad. You’ll be tasting the olive oil in full. The higher the quality, the better your dressing will be.And now you whisk the vinaigrette one more time, but instead of adding the olive oil all at once, drizzle it in slowly, while you whisk. You want to pour the oil from about a foot above the bowl, in a very thin stream. By adding just a bit at a time, the oil can be broken up into small bubbles and fully incorporated into the mixture. This is what we call emulsification, and it’s what gives your vinaigrette a creamy consistency.If you whisk and pour correctly, you dressing won’t look like unmixed oil and vinegar; it will look like a creamy, luscious sauce. And that’s when you yell, “Someone pass me the greens! Stat! We got dressing to do!”Once you know how to make vinaigrette like a pro, you're only a steak and some veggies away from...Steak Salad with Shallot VinaigretteCrusty, juicy sliced steak + a fully-loaded salad = what we want to eat most nights of the week, TBH.View RecipeExplore Bon AppétitBasicallySalad DressingVinaigretteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Alex Delany"]}