{"id": "60073b2efe61815c67d07e6cd49552e4", "url": "https://www.bonappetit.com/story/what-is-bergamot", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "What Is Bergamot, the Citrus Fruit That Gives Earl Grey Tea Its Distinct Aroma? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Find Fresh Bergamot, Don’t Go Home Without ItEarl Grey lovers, this is for you.By Ozoz SokohFebruary 16, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailI first heard about the bergamot orange, a citrus fruit thought to be a cross between sour orange and lemon, in the late 1990s through my friend M when I was at university in Nigeria. One evening, he brewed us a pot of Earl Grey tea and explained that it owed its distinct flavor to bergamot, thereby introducing me to the joys of the fruit’s heady aroma.For many years after, I drank Earl Grey and Lady Grey, both of which are flavored with bergamot’s essential oils without extending my curiosity beyond the cup, even though there was a touch of wonder. So when I spotted a basketful of green fruit with sunny patches and smooth skin, for the first time last November at Eataly in Toronto, I couldn’t go home without buying some. Finally, it was time for me to learn more about it.What is bergamot?The fruit itself is the size of a small orange and somewhat pear-shaped with a barely conical top and rounded base. On the outside, bergamot comes in various shades of green, yellow, and orange, and on the inside, they are color of limes, lemons, and, occasionally, oranges. Like most citrus, bergamots are in season from October to March. While the plant originated in Southeast Asia, most of the world’s supply—a whopping 80%—comes from Calabria, the southern region that is Italy’s “shoe,” but it’s also grown in the Ivory Coast, the south of Turkey, Brazil, and China.While the etymology of the word itself is up for some debate, many trace it back to the Turkish word beg-armudi, meaning “prince’s pear”; others think it relates to the Italian city of Bergamo.How is bergamot used?Bergamot is most prized for the super fragrant essential oil extracted from its skin. The aroma is citrusy, musky, and floral with an intensity that’s hard to believe. That oil is used to scent perfumes and soaps, and, of course, is commonly combined with black tea for Earl and Lady Grey.Like sour oranges, bergamots are extremely, well, sour. The fruit isn’t eaten out of hand and is instead incorporated in cooking and baking where it can be tamed with heat and sugar.How can you use it at home?Because of its super high acidity and bitterness, bergamot lends itself to multiple uses in the kitchen and makes for a good substitute for a variety of citrus, from oranges to lemons and limes. And because of the intensity of flavor from skin to pith to flesh, you can use the whole fruit.Employ the zest as you would any other citrus zest, for flavor and fragrance: Rub into sugar, grate into some cake batter, or peel off wide strips and infuse them in vodka. It’s a fantastic substitute for grapefruit, lemons, and limes in cocktails and a nice addition to citrus cures and curds. Don’t discard the shells when you’re done juicing—save them to candy or to transform into marmalade. Both make a delightful, intensely fragrant condiment that offers the flavor and sensation of eating perfume (but in a good way!).What flavors does bergamot pair best with?The fine people at Foodpairing—a platform that explores the science behind flavor pairings—connect bergamot with warm spices like nutmeg, cardamom, cinnamon, and ginger; hardy herbs like rosemary and soft ones like basil; and with a range of citrusy ingredients like lemon, yuzu, and lemongrass. I also love to pair it with flowers, like lavender, rose, orange blossom, and elderflower. Black tea is, of course, a natural companion—it shares bergamot’s herbal, woodsy aroma, which might be part of the reason they work so well together. Some brands of Earl Grey produce highly floral blends, thus maximizing all of these complementary flavors.I still begin my day by brewing a pot of Earl or Lady Grey tea, but bergamot is no longer a mystery to me. I’ve seen, smelled, and tasted it—and eagerly anticipate the next opportunity to get my hands on the fresh fruit again.Cake, anyone?Earl Grey Yogurt CakeA tea cake that's true to its name, this loaf harnesses the power of citrusy Earl Grey tea for its distinct flavor. Lemon poppyseed can't hold a candle. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-16", "author": ["Condé Nast", "Ozoz Sokoh"]}