{"id": "600ca36ff21f4aa5ec58b6b784cd5ad0", "url": "https://www.bonappetit.com/story/whats-the-difference-between-all-the-types-of-tomatoes", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "What's the Difference Between All the Types of Tomatoes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's the Difference Between All the Types of Tomatoes?Beefsteak vs. cherry vs. grape vs. heirloom vs. plum.By Brette WarshawJune 15, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Before we answer our guiding question—what’s the difference between beefsteak, cherry, grape, heirloom, and plum tomatoes—we have to address another one: Why are grocery-store tomatoes so bad?There are two major categories of tomatoes: heirlooms, which we’ll cover below, and hybrids. HybridsThe tomatoes you’ll find year-round in the grocery store are hybrids, which means that humans have cultivated and bred them for specific characteristics. Not all hybrids are bad, but the grocery-store ones usually are; they’re bred for resistance to diseases, firm flesh, thick skin, and storage potential, rather than, say, flavor. They’re also yanked from their plants while they’re still hard as rocks so that they don’t get crushed on the way to their final destination. Off the vine, they can’t develop the sugars, acids, and other flavor/aroma chemicals that make them actually taste good—so they’re sprayed with ethylene gas instead, which induces reddening and softening. The result: watery, cottony pucks.Heirloom tomatoesHeirloom tomatoes, on the other hand, are typically “open-pollinated,” which means the varietal comes from natural pollination (birds, insects, wind, etc.) rather than scientists. These types of tomatoes “breed true,” which means that if you plant one of its seeds, it will grow into a plant that bears tomatoes that look just like the parent. (Hybrids, on the other hand, will give birth to plants that exhibit different characteristics from each of the parents; it takes around seven generations for cultivars to stabilize.) Heirlooms come from plants that have been grown without crossbreeding for at least fifty years. They're found in all different colors, shapes, and sizes: perfectly oval; craggy and bulbous; heart-shaped; yellow, green, black, pink, striped, tie-dye. Their names are just as varied: Black Krim, Mr. Stripey, Brandywine, Cherokee Purple. These are the guys you’ll find at the farmers’ market at the peak of the season, the ones that just beg to be sliced and salted and eaten pretty much as is.Beefsteak tomatoesBeefsteak tomatoes, which can be either heirloom or hybrid, are notable for their size—they can weigh in at over a pound each, with a diameter of six or more inches—and their texture: They have smaller seed cavities than other types of tomatoes, giving them a greater ratio of flesh to juice and seeds. There are around 350 types of beefsteaks out there and although you’ll mainly see the red ones labeled as “beefsteaks,” they can come in all colors: pink, yellow, green, white, technicolor. The Brandywine, Cherokee Purple, and Black Krim heirlooms, for example, are all beefsteak tomatoes, too.Plum tomatoesAlso known as Roma or paste tomatoes, plum tomatoes are oval-shaped and smaller than beefsteaks. They also have a lower water content compared to other types, with an almost chewy flesh—making them particularly suited to sauce-making. These are the tomatoes you’ll see everywhere in Italy, the most famous type being the San Marzano.Baby tomatoes: cherry, grape, cocktailAnd let's not forget the baby tomatoes: the cherries, grapes, and cocktails. Cherry tomatoes are the small, round guys with thin skins that squirt juice everywhere when you bite into them. They’re super sweet and have a high water content, and they come in many colors. Grape tomatoes are the oblong, grape-shaped ones that you’ll often find in the grocery store; they have a lower water content and thicker skins than cherry tomatoes, which help them last longer. Cocktail tomatoes are larger than grape and cherry tomatoes but still of the small, sweet ilk. They’re grown hydroponically and can be found in many grocery stores. If you’re looking for a decent specimen outside of true tomato season, these are usually your best bet.From the book 'What's the Difference?' by Brette Warshaw. Copyright © 2021 by Brette Warshaw. Published by Harper Wave, an imprint of HarperCollins Publishers. Reprinted by permission.Get the book!What's the Difference?: Recreational Culinary Reference for the Curious and Confused$28 $10 at AmazonBrette Warshaw is the author of 'What's the Difference?' and the newsletter by the same name. She’s an editor at Apple News and has worked at publications such as Lucky Peach and Food52.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-15", "author": ["Condé Nast", "Brette Warshaw"]}