{"id": "600e0201d724a91f53a7b4f527713010", "url": "https://www.bonappetit.com/story/grand-central-oyster-bar-caviar-sandwich", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "The Grand Central Oyster Bar Caviar Sandwich Makes Me Feel Like a Million Bucks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis $14 Caviar Sandwich Makes Me Feel Like a Million BucksI’m filled with giddy delight every time I order it at Grand Central Oyster Bar in New York City.By Amiel StanekMarch 12, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Call me bougie and basic, but caviar is, beyond a shadow of a doubt, my favorite food. Perhaps even more so because, unlike any number of dishes that I love and can rustle up whenever I want, it’s such a rarified treat—a symbol of special times, flush times, we-could-all-die-tomorrow-so-why-the-f*#%-not times. I adore it dolloped atop still-warm blini as much as I adore it scooped up with salty potato chips as much as I adore it spooned over lacy latkes. But no preparation fills me with quite the same giddy delight as the caviar sandwich at Grand Central Oyster Bar inside New York City’s Grand Central Station.It’s easy to miss, an unassuming entry on the restaurant’s sprawling menu of seafood dishes. And it smacks of sacrilege—caviar, that most refined and luxury-signaling ingredient; the sandwich, that most pedestrian of formats. That was what piqued my curiosity the first time I ordered it. Caviar for the people! But it is perfect in its simplicity: two slices of toasted white bread layered with chopped hard boiled egg and a fat schmear of black bowfin caviar—an affordable-yet-still-delicious roe harvested from a relative of the famed sturgeon—served alongside a plastic sidecar of crème fraîche for dipping and a sprig of curly parsley. It’s crunchy, and salty, and just the right amount of fishy, a tidy little package of deliciousness. And at $14, it exists in a cheeky sort of limbo: Is it a kind-of-expensive sandwich or a kind-of-cheap caviar dish?On the best of days, it’s both: a not-unreasonable splurge that makes me feel like I’m getting away with something—a Big New York Mood if there ever was one. Sitting at one of Grand Central Oyster’s too-low U-shaped bars, that iconic Deco tiled ceiling glowing overhead, with an icy gin martini in one hand and a triangle of caviar sandwich in the other, I feel like a little prince for all of the five minutes it takes me to eat it. And that’s a hell of a way to feel, even for a moment.Go there: Grand Central Oyster BarExplore Bon AppétitHighly RecommendRestaurantsNew York CityRead MorerestaurantsThis French Bistro Is the Reason You Should Visit Los Alamos, CaliforniaBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-12", "author": ["Condé Nast", "Amiel Stanek"]}