{"id": "6010c35b8a89cd4d5f76ae7d41e095e9", "url": "https://www.bonappetit.com/story/happy-hour-with-parents", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Happy Hour Is Better With…Your Parents? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusHappy Hour Is Better With…Your Parents?At a time when anxiety felt inescapable, the cocktails and cheese boards they made were my constant.By Priya KrishnaAugust 26, 2020FacebookTwitterEmailIllustration by Sabrena KhadijaFacebookTwitterEmailIt’s five o’clock on a Monday at my parents’ house in Dallas and I come downstairs to a lemon drop martini sitting on the kitchen island with a note from my mom: “Be careful, Chhotu,” it reads (Chhotu = my childhood nickname). “This has three ounces of vodka in it. Very boozy. Love, Ma.”In mid-March I went to Texas to attend a wedding and ended up staying for three months. I was an adult woman living at home for the first time since high school. This time around I was less angsty and of legal drinking age. So my parents started doing regular happy hours. This meant that my mom would make a cocktail and my dad would put out a cheese board. I don’t know how they landed on this series of events. I guess my mom loves experimenting with drinks and my dad spends a lot of time browsing the cheese selection at Costco.We settled into a rhythm: On weekday afternoons, as soon as my mom started playing Rodrigo y Gabriela downstairs, I knew it was time to shut my laptop. At a time when anxiety felt inescapable, the happy hours were my constant—an activity I could look forward to. A distraction from being stuck in one place, seeing only the same people.Photo by Mackenzie KelleySometimes my mom would make a cocktail—a margarita, a Negroni, a cosmopolitan—loosely following a recipe, and definitely not measuring anything. Other times we’d have triple IPAs from our local Odd Muse Brewing Company. Very often our drinks had no booze at all—Topo Chico with lemon, or shikanji, a salt-and-pepper limeade. Some days the “cheese plate” would be a single hunk of feta, paired with a lengthy story from my dad about how he acquired the knife he used to cut it.It’s unsettling, moving home after living on your own for years. I don’t have a perfect relationship with my parents. But in those happy hours, I understood the distinct privilege of this found time with my family—and of even having a family, a home, and a job during quarantine.When I got back to New York, I had planned to restart the tradition in my own apartment with my partner. But I couldn’t do it. That ritual belongs to my parents and me.Explore Bon AppétitCocktailCheeseCharcuterieCoronavirusRead MorecultureIf I’m Cutting Fresh Fruit for Dessert, I Probably Love YouBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-26", "author": ["Condé Nast", "Priya Krishna"]}