{"id": "6038aa6ce53789c4d223101063396a0e", "url": "https://www.bonappetit.com/story/candice-kumai-kintsugi", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Candice Kumai on the Age-Old Japanese Concepts That Help Her Thrive in a Modern World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Age-Old Japanese Concepts Taught Me to Thrive in a Modern WorldCandice Kumai on a life spent learning to embrace imperfection.By Candice KumaiApril 18, 2018FacebookTwitterEmailPhoto courtesy of Candice KumaiFacebookTwitterEmailThis excerpt is adapted from Kintsugi Wellness: The Japanese Art of Nourishing Mind, Body, and Spirit by wellness writer and chef Candice Kumai. In her book, Kumai highlights the Japanese traditions and practices that inform her perspective on wellness, combining recipes and memories to show a path towards cultivating \"radiant health.\"Accepting imperfection has been a lifelong challenge for me. Growing up in a predominantly white neighborhood in San Diego with a Japanese immigrant mother and a Polish immigrant father, I stood out. I was brought up differently than the other kids—my parents were strict and wouldn’t tolerate anything less than my best—and, obviously, I looked different too. As I got older, I was teased.  Kids asked mean questions and sometimes called me racist names. Like any young girl, I wanted to be beautiful, loved, and accepted. I wanted people to like me for who I was.When I was 15, a modeling agent approached me and asked if I would consider working with her. She called me “tall, lanky, and exotic.”  I never thought of myself this way, but I decided to give it a go. Modeling soon became a side hustle, then it grew into a full-time job. Through college, I worked as a print and fit model (meaning a live mannequin for fashion designers, not to be confused with a “fitness” model). I put in work with dozens of big-name clients and agents and took on projects around the world.While the lifestyle seemed glam, constantly chasing perfection was not. I had designers measuring my thighs, butt, waist, and hips every day. Before my career in modeling started, a deep-rooted love for cooking had already been instilled in me. Growing up, I was always inspired by the strong, skilled Japanese women in my family and their appreciation for Japanese cooking. But, just as my passion for cooking bloomed, my modeling career peaked.I decided to go to culinary school, and at first I kept the modeling hustle to pay for it. It was a grind, and I struggled constantly to stay afloat. I knew deep down that I had to transition from fashion to food permanently, despite the ironic timing of my success. Fit modeling was lucrative, but it was not challenging me in the ways I wanted to grow. There was no passion fueling my work, and I knew it wasn’t going to fulfill me long-term.Kumai's go-to ingredients for recipe development.\nPhotos by Candice Kumai from “Kintsugi Wellness” (Harper Wave April 2018)Going from the lucrative fashion world to a ten-dollar-an-hour line cook gig at 23 was a challenge. I didn’t used to worry about money; now I could barely pay for gas and parking. Despite the shift in lifestyle, working on the line taught me not only how to cook but also characteristics I deeply value today: discipline and humility. Moving from one line cook position to the next, I learned adaptability and drive. And it reintroduced the age-old Japanese concept of kaizen—the pursuit of continuous improvement—into my daily mantra. Each morning, I told myself that the change I was going through was for the better. I wasn’t broke; I was following my passion. It wasn’t what my parents had planned for me, but, in the long-run, I was bricklaying for long-term success.At 26, after honing my skills in restaurant kitchens, and saving every dollar, I packed a single suitcase and bought a one-way ticket from sunny and comfortable Southern California to bustling NYC. After living next to a East Village squat house and four different apartments and bouts of couch-surfing across the city, I finally made a home for myself in East Williamsburg. I wrote my heart out about food, worked tirelessly to develop recipes, and pinched every penny I had to (barely) make rent.Gradually, I started to get the urge to know more about my Japanese culture. I found myself inspired by the people of Japan, the foods I grew up with, my family’s history.I saved up for a trip back to the land of my ancestors with mom. I was so inspired by the family I met there and their traditions that I began an annual tradition of returning. I’ve been going back now for eight years straight. I’ve grieved there and healed there, and I’ve learned to practice patience. These trips showed me the beauty in humility: Japanese culture centers itself on the pillars of politeness, respect, hard work, but most of all humility. I also learned that kaizen cannot exist without an another Japanese concept: wabi sabi, or the practice of accepting things as they are. In those early stages of struggle, I never could have understood this practice. But now I saw that, while chasing a passion was admirable, I could also accept and respect the person I already was.More and more, I began writing and speaking about kaizen, wabi sabi, and other tenets of Japanese culture, and my little food and wellness business grew. The Obama administration called on me to represent the White House Initiative for Asian American Pacific Islanders in Hawaii, so I spent time with local kids in lower-income communities there, cultivating health and wellness through education and cooking our traditional Japanese and Hawaiian foods. Even after writing six books and signing deals with brands like Chanel and Adidas, this work was the most rewarding thing I’ve ever done.Cultivating kaizen and wabi sabi has kept my business intact, my heart grounded, and my head above water. These practices remind me to work humbly and gratefully everyday. I never would’ve learned them had I not followed my passions in the first place: toward cooking, toward my family in Japan, and back to the city I now call home.Explore Bon AppétitHealthyishJapaneseJapanprofileRead MoreLifestyleWabi-Sabi Is the Cure For Your Dinner Party AnxietyGallery6 SlidesBy Julie Pointer AdamsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-18", "author": ["Condé Nast", "Candice Kumai"]}