{"id": "60442f5fa0cf09eaa52e92d0b109eeec", "url": "https://www.bonappetit.com/story/carlas-condiments", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "The Only Time I Panic Is When These 5 Condiments Run Low | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Time I Panic Is When These 5 Condiments Run LowThey’re the razzle dazzle all my meals need.By Carla Lalli MusicMay 7, 2020FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The truth about my refrigerator is that even when it’s empty, it’s full … of condiments. There's a reason for that besides the fact that most of them will never go bad, and because I believe a girl can’t have too many hot sauces. Condiments are the razzle dazzle that make all of my meals—even the super quick and not very inventive ones—feel properly accessorized and worthy of the yum-yum noises I expect my family to make when they eat my food. Yes, I include basics like mayo and mustard, Crystal hot sauce, Sriracha, and miso paste. But there are a few others that have graduated into the almost-daily rotation. Here’s my condiment clique and how I like to show them off.Want this letter before it hits the website? Sign up for our newsletter!Prepared HorseradishWhat delivers wasabi-level nose tingles along with the pucker of a full-sour pickle? Horseradish, that’s what. I just look at the bottle and the phrase “a little dab’ll do ya” pops into my head. Mix it into sour cream or Greek yogurt with a lot of black pepper and big pinch of kosher salt and it’s the dollop you want next to steak, roasted sweet potatoes, chicken thighs, or a bag of potato chips. Stir it into pan drippings from cooking a pork chop or chicken cutlet along with a splash of water, some lemon juice and butter and you’ve got a horseradish jus. It can be served as is next to braises (think: brisket) or long-roasted pork shoulder. I also love it on a sandwich with bread, softened butter, and ham.Buy it:Atomic Extra Hot Horseradish, $13 on AmazonKelchner’s Horseradish, from $18 for a 3-pack at kelchnershorseradish.comThere's always kimchi on toast!\nPhoto by Chelsea Kyle, Food Styling by Susie TheodorouKimchiI’ve eaten a lot of cabbage on quarantine. But you know what’s better than cabbage? Spicy fermented Korean cabbage, that’s what. Kimchi is on every grocery list I ever write—along with good bread and cold brew, it is an item that I would not, and shall not live without. It’s technically a banchan, or side dish, but I treat it like an all-purpose go-with for just about any meal. It lands on the table more meals than not, draped over whichever protein we’re having, from roast turkey to fried eggs. It ends up in all of the grain bowls, from the healthyish ones with farro and lentils, to the quasi-Mexican ones with black beans, rice, and shredded cheese. Speaking of cheese, it is amazing chopped up and layered into a grilled cheese, and kimchi juice makes a pretty great tequila chaser. I made an emergency taco with leftover sweet potatoes and kimchi the other day for a very late lunch and let’s just say—would eat again.Buy it: Sunja’s Kimchi, from $4 at sunjaskimchi.comGreen hot sauceIt’s hard to describe the sensation of green hot sauce compared to red, and I love them both, but it’s sort of like I feel red hot sauce on the tip of my tongue, and green hot sauce shows up in the meaty part of my cheek. The one I’m obsessed with right now is a habanero sauce from El Yucateco. It is bright, it is very picante but very fruity, and my bottle is dangerously low. I’m going to have to hide it behind some half-squeezed tubes of tomato paste in the fridge while I work on finding a replacement. I will mix this with buttermilk to make a marinade for chicken or pork, and I’ll add it to a salsa verde if I don’t have fresh chiles on hand, and it can also be combined with mayo to make a spicy creamy sauce. If you’re looking for something similar, I also love the green Tabasco, and green hot sauce from Melinda’s (both are milder and made with jalapeños).Buy them:El Yucateco Chile Habanero, from $12 on AmazonTabasco Green Pepper Sauce, $5 at foodsofnations.comMelinda’s Classic Jalapeno Pepper Sauce, $6 at foodofnations.comPhoto by Chelsie Craig, Food Styling by Pearl JonesPepperonciniNothing makes me salivate like looking at a jar of pepperoncini. So sour! So spicy! So squidgy, but in a good way! Pepperoncini (or banana peppers, if that’s what your store has) complete any antipasto board and are MVPs in Italian-style chopped salad, but they also end up in my tuna salad, my grain salads, and my salad salads. I put them on salami sandwiches and quesadillas. I prefer the whole ones to the pre-sliced ones, but will not make a big deal about it if sliced is all I can get.Buy it: Mezzetta Pepperoncini, $13 at mezzetta.comMarina SauceFull disclosure: Tutto Calabria’s Marina Sauce is not easy to find. I had the good fortune of picking up a jar a couple of weeks before stay-at-home orders went into effect. I cannot get enough of this stuff, but I also cannot get more till this is over, so I have to be careful how I use it! It’s got all the red chile heat and delicious oily texture of the original calabrian chile paste, but with tiny little fishes mixed in! It’s the perfect blend of fiery and funky, more oily than vinegary, and hot like a Sicilian summer. I love it on crackers with butter and jarred anchovies, it’s awesome flicked all over a mozzarella and tomato salad, it’s indispensable on pan pizza night, and you can cool it down with some yogurt and use that as a bed for roasted or boiled potatoes. Mamma mia!Buy it (at some point): Tutto Calabria Rose Marina, $8 at supermarketitaly.comRemember, condiments are great because they round up many ingredients into one efficient delivery system (jar, bottle, or tub). You can keep everything simple with your technique and the rest of your meal, and let the condiment be the disco ball that turns dinner into a party. A party in your mouth, of course.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCarla NewsletterCondiment/SpreadRead MoreCoronavirusSnack Plates Are the Low-Key Dinner Strategy We Need Right NowBy Aliza AbarbanelcookingThe Fastest, Freshest Way to Transform a Can of BeansBy Aliza AbarbanelcultureWhere to Order Your Favorite Pantry Staples OnlineBy MacKenzie Chung FegancookingThere's No Better Time to… Use the Oldest Thing In Your PantryBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Carla Lalli Music"]}