{"id": "6045396878cd1685c57c4e39144e79ad", "url": "https://www.bonappetit.com/recipe/strawberry-granola-crisp", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Strawberry-Granola Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueStrawberry-Granola CrispBy Deb PerelmanApril 16, 20194.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis crisp is a delicious dessert, but also a perfectly acceptable brunch (or breakfast): The oat topping channels granola with olive oil, almonds, and maple syrup, and the filling is barely sweetened, instead taking advantage of in-season berries.Ingredients4–6 servings2lb. strawberries, hulled, halved, quartered if large3Tbsp. raw sugar2Tbsp. fresh lemon juice1Tbsp. plus 1½ tsp. cornstarchKosher salt¼cup extra-virgin olive oil2Tbsp. pure maple syrup1cup old-fashioned oats⅓cup sliced almonds⅓cup unsweetened shredded\ncoconut¼cup all-purpose flourPlain yogurt, whipped cream, or vanilla ice cream (for serving; optional)PreparationStep 1Place a rack in lower third of oven; preheat to 350°. Toss strawberries, sugar, lemon juice, cornstarch, and a pinch of salt in a large bowl to combine; transfer to a 9\"-diameter pie dish or 1-qt. baking dish.Step 2Stir oil and maple syrup in a medium bowl to combine. Add oats, almonds, coconut, flour, and 2 pinches of salt and work until mixture comes together in loose clumps; scatter over filling. Place crisp on a foil-lined rimmed baking sheet and bake until topping is golden brown and filling is bubbling, 35–45 minutes. Let cool at least 30 minutes before serving.Step 3Serve crisp with yogurt, whipped cream, or ice cream, if desired.Step 4Do Ahead: Crisp can be baked 1 day ahead. Let cool completely; cover and chill.How would you rate Strawberry-Granola Crisp?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleOUTSTANDING!Anonymous7/19/2021If made ahead, is this best served warm? If so, what’s the best temp/time for reheating?AnonymousCalifornia 10/5/2020I loved the idea of this, but it was underwhelming. For fresh summer strawberries, the flavor of this was just “okay.” I would definitely cut the lemon juice in half or omit - it was super sour for us. The ratio of cornstarch was off too as we had a mostly thin liquid/juice. Also, the texture of the crumble was fine but not ideal - the coconut made it a bit grainy. We’ll stick to our favorite strawberry crisp recipe (from erinliveswhole) which has similar ingredients but much better flavor and texture.  Anonymous8/2/2020literally my favorite thing ever.. i've made it twice already. the granola comes to such a perfect consistency.. the first time i made it i halved the recipe and used a smaller glass dish and ate the whole thing hot. i see people asking about making with frozen strawberries-- if you have no other choice, i would thaw them before using. baking frozen strawberries will probably make a lot of water and mess up the whole texture.  would not recommend.livgrassonew jersey, usa6/20/2020During quarantine, I cannot get fresh strawberries. Any thoughts on using frozen berries? I assume to roast them frozen. Thanks for any suggestions! AnonymousSolana Beach4/22/2020Another hit from Ms. Perelman. The juices are a perfect syrupy consistency due to the cornstarch. Had it with ice cream last night and yogurt this morning! I will try 1 tablespoon of lemon juice next time. The olive oil really adds a savory dimension to the flavor that is delicious. AnonymousCamino, CA5/20/2019I made this for Mother's Day Brunch -  couldn't stop eating it.  I actually cheated and used Bare Naked Maple Granola  --  I ate it with yogurt and again for dessert with ice cream.  A surprise success.  Every one really liked it - including grand kidsdhill7984Norman Oklahoma5/14/2019It's ridiculous how delicious this is. Made this as a hostess gift and then seriously rethought giving it once I'd tasted it, aka: sneaked a taste to be sure it was gift worthy. IT IS AND NOW I HAVE TO GIVE IT AWAY or the universe will come crashing down on me. My only hope is that she decides to serve it while I'm there, rather than waiting to have it for her breakfast in the morning. However it plays out, I have more strawbs in the fridge and I will be making this again immediately. AnonymousTexas5/10/2019I was able to mix the strawberry mixture in the pie dish I baked it in, so this came together with just one bowl! I subbed raw honey in for maple syrup, because that's what I had on hand. I had some down time before going in to work and made this as an afternoon snack! Super quick, easy, and delicious. Anonymous5/10/2019Explore Bon AppétitFruit DessertDessertStrawberryBerryFruitOatRice & GrainsDairy-FreeVeganVegetarianHealthyishBakingFourth Of JulyMemorial DayLabor DayBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Deb Perelman"]}