{"id": "6048ee565d175d4a30c259813d12126d", "url": "https://www.bonappetit.com/story/red-rooster-always", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Red Rooster in Brewster, NY Is Where I Always Want to Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Red Rooster Is Where I Always Want to BeThis low-key legendary burger shack is the perfect pit stop.By Carla Lalli MusicJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I grew up in New York City, where it seems like more than half the restaurants that open are out of business within a year or two, and even the successful ones serve at the whim of a fickle mistress—her royal highness, the 10-Year Lease. If you get a bunch of New Yorkers together to talk about their favorite places to go eat, you’ll hear a lot of “it’s not there anymore.”This is summer.\nPhoto by Alex LauBut I’ve been going to Red Rooster Drive-In in Brewster, New York, for 32 years, and the older I get the more it stays the same. It is almost exactly halfway between my hometown and Lakeville, Connecticut, where my parents have had a “weekend place” since I was a young teen. The Rooster, as we like to call it, is a drive-up burger shack notable for its red-and-white-striped facade and a giant replica of a soft-serve cone perched on its pointy roof. It’s one of those low-key legendary places that’s also the perfect pit stop. There are exactly zero times that I’ve driven by without someone else in the car saying, “Who wants to stop at The Rooster?”Simply an excellent fried chicken cutlet sandwich.\nPhoto by Alex LauThe answer to that question is always: I do! When I was in junior high, Friday nights meant sitting in the back seat of the family car with my parents and my little sister, listening to Graceland for the 900th time while my friends were definitely drinking beer and smoking cigarettes on somebody else’s stoop. My standard order in those days was curly fries and a root beer float made with the Rooster’s soft-serve ice cream—so make sure to ask for hard-packed if that’s what you want (that’s what you want). It was around that time I discovered my mom loves chili dogs, which I still find shocking, and we all realized the fried chicken cutlet sandwich is excellent, but you have to get it with extra mayo, extra pickles, hot sauce, lettuce and hold the tomatoes (no matter the season, they’re never great).The sea dog.\nPhoto by Alex LauAbout 15 years ago, my sister turned me on to the existence of the Sea Dog, which is a deep-fried fish fillet on a hot dog bun. Brilliant. Get extra tartar sauce—it is stupendous! (The burger, however, is a sad little frozen patty, cooked up gray, no char, ordinary bun.)Where else would you want to be?\nPhoto by Alex LauOne of The Rooster’s claims to fame is the outdoor grass-and-gravel picnic area, complete with bright red tables and kiddie rides, where the full mash-up of the clientele can be observed. There’s the city folk like us, the locals, and the gangs of sweaty preteens in matching soccer uniforms getting team dinner after a game. There are lots of families with little kids too. I was never young enough to take advantage of the coin-operated mini-carousel or the horsey ride, but both my children have fed handfuls of my quarters into those things over the years.One of my offspring is now the same age I was when we started driving up to Lakeville, and boy, you should see the look on his face in the back seat on Friday nights when we’re driving up. Sullen AF! And he doesn’t even have to listen to Graceland! I get it—his friends are home, plotting bad behavior of their own, probably. But when my husband asks if anyone wants to stop at The Rooster, he lifts his forehead off the car window: “I’ll go.”ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Carla Lalli Music"]}