{"id": "60550a7793fcc0c5ef634d83726952c9", "url": "https://www.bonappetit.com/story/giant-no-flip-blueberry-pancake", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "This No-Flip Blueberry Cornmeal Pancake Recipe is Weird and Wonderful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Invented a Big Ol’ No-Flip Blueberry Pancake, You’re WelcomeThis untraditional pancake breaks all of the rules (and wins anyway).By Carla Lalli MusicJuly 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI do most of my best creative work in a hot shower at night, so it was no great surprise when the concept for a Giant No-Flip Blueberry Pancake revealed itself to me one evening as I lathered up. Why I was thinking about pancake recipes at that moment is an ongoing mystery, but when the combination of cornmeal and blueberries appeared in the steam as though from a pancake genie’s bottle, I took notice.The next morning, I marched my sparkling-clean self into the test kitchen and shared my jumbo-sized vision with Molly Baz and Sarah Jampel, Basically’s keepers, and they told me to get to work.I had a lot of confidence going into it. People love pancakes, and a large section of that population also loves blueberry pancakes, and I felt like making one gigantic pancake would solve quite a few of humanity’s problems (plus, the most recent recipe on our site is so old, the image is blurry).See, I make a lot of pancakes in my spare time, and I am a very firm believer in serving and eating them the minute they come out of the skillet. Yes, technically, you can keep the first batch warm in the oven while you make the rest, but everyone knows those inaugural pancakes suffer. If there was just one pancake big enough to share, we all win! It’s easier for the cook, and everyone eats at the same time.Now we could get into a whole thing here about fluffy pancakes and flapjack-style pancakes, lacy-edged pancakes and lofty soufflé pancakes, whole wheat pancakes and yogurt pancakes, but everyone knows the best pancakes are made with buttermilk and stand up tall on the plate, so that’s where I wanted to end up.I questioned the necessity of the cornmeal, but it just felt right. Cornmeal and blueberries are a classic combo—one of those “if it grows together it goes together” pairings. Put it this way: If I offered you a blueberry-corn muffin, you’d eat it. This is the pancake version of that.I added varying quantities of cornmeal and experimented with leaveners in increasingly maddening ratios until I got my roster of dry ingredients—all-purpose flour, sugar, salt, baking soda and baking powder—just right.For the wet ingredients, I stuck to the classics: buttermilk, eggs, and melted butter. Rather than adding them all at once to the dry ingredients, I came across a method that called for combining the wet and dry ingredients in two additions—so I tried it, and I got a very tender, very fluffy pancake. Because combining in smaller amounts means you’re less likely to overmix the ingredients (which would deflate and toughen the batter), the pancakes stay light and tender.And regarding the blueberries, I use conventional—they’re the easiest to find, that’s it. Nonetheless, for two days every self-proclaimed genius who walked into the test kitchen told me how much better pancakes made with wild Maine blueberries are. As if I don’t already know that! If you have access to wild blueberries, obviously use them! If you don’t, please join me in Second Bestville. We are getting away from my perfect pancake fantasy when we indulge in this kind of negative talk.Once I landed on a batter I liked, and I fried up several conventionally-sized pancakes to test it out. The issue I kept having, though, was that it is truly impossible to flip a skillet-sized pancake without folding it in half onto itself or flinging half of it outside the edge of the pan. I tried inverting it like a Tortilla Española. I tried using two massive spatulas. I tried flipping it into a second skillet. I failed and I failed. I was about to give up when Jampel asked me if I had tried baking it yet.“Bake it? What—like a frittata or something???” I scream-asked.“Yeah, like… an oven pancake,” she replied.“Sarah, you realize no one has ever said ‘oven pancake’ to me in my life,” I said. “And if it works, obviously I’m stealing that idea.”Sarah, who is very nice, still encouraged me. And you know what, it did work. I cooked the entire pancake batter on one side in a nonstick skillet until the bottom was set and starting to brown, and bubbles appeared across the surface. All the things you’d look for in a regular-sized pancake. But then I slid the pan into a preheated oven and cooked it for 10 minutes more—which is the perfect amount of time to set the table and find the maple syrup and put out orange juice. When the pancake is fully cooked, it easily flips onto a platter without folding and flopping, and though the top side never really takes on color, the underside gets very burnished and crisp, which more than makes up for it.I felt like a giant in a fairy tale the first time I put multiple pats of butter on my humongous “personal” pan pancake. Then I cut it into wedges and shared it with my work friends.“It’s called an oven pancake,” I bragged. Even the Maine blueberry people were pleased.We're flipping out:Giant No-Flip Blueberry PancakeMaking one giant pancake instead of a bunch of smaller ones means that everyone can sit down to pancake breakfast at the same time.View RecipeExplore Bon AppétitPancakeBreakfastWeekend BrunchBrunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-14", "author": ["Condé Nast", "Carla Lalli Music"]}