{"id": "6060f9d9761d2ebb7d21a6afeb4d47f8", "url": "https://www.bonappetit.com/story/toum-recipe", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "This Toum Recipe Is The Extra Garlicky Yogurt Sauce I've Loved All My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Toum Recipe For the Extra Garlicky Yogurt Sauce I've Loved All My LifeFor Andy Baraghani, a hometown schwarma shop sparked a lifelong obsession.By Andy BaraghaniFebruary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis post is part of Andy Baraghani's Guide to Modern Middle Eastern Cooking. Get all his recipes, tips, and stories here.When I was in my teens, old enough to drive myself around, I would rarely would go straight home after school. I needed a snack and a few smokes, and my go-to was a chicken schwarma and a pack of Camels. I’d go to a place whose name I’ll never remember. It was always kind of a mess in there but it smelled like heaven: slowly cooking meat and all the spices from a souk. The meat was always a touch dry, and the bread could be on the stale side, but what kept me coming back to this little storefront was the intensely garlicky, bright, white sauce on the schwarma that tied the whole thing together. When I requested some extra yogurt sauce to smother my chicken in, I was quickly informed that the sauce I craved was not made from yogurt, nor was it even dairy-based, but, rather, an emulsion made from garlic, oil, lemon, and salt. So began my love for toum.Years later, after eating many shawarmas with toum, I finally made a trip to Lebanon where I saw a big batch of the sauce being made. Garlic was pulsed to a fine paste before oil and lemon juice were slowly streamed in and the sauce emulsified. A bit of water thinned it out, and a palmful of salt finished it. What happened before my eyes was magic: the texture became fluffier and lighter than mayonnaise and it turned bleach white. One taste of its pungent garlic flavor was so intense, you’d have the aftertaste for days.When I came back to New York, I tried to make the sauce in a mortar and pestle and failed miserably. But when I was creating my guide to Middle Eastern food, I knew I couldn’t leave toum out. I had to learn exactly how it was done.I quickly learned that it’s much easier to make a big batch of toum than a cup. I also learned that a blender is the best way to make sure the garlic and the oil thicken into that perfect, white sauce. Third, I learned to keep all the liquids—the oil, the water, and the lemon juice—as cold as possible to help with the emulsifying.Toum’s aggressive flavor is best paired with ingredients that can compete—grilled meats are the obvious choice, but the sauce can be mashed into charred eggplant to make a dip or drizzled over roasted vegetables. Anything that needs a hit of garlic and acid will be better with toum.And I’m thankful for that mediocre schwarma shop for showing me the (white, super-pungent) light.Toum goes great with sweet potatoes:Charred Sweet Potatoes With ToumThis recipe is nice twice. The roasting and honey-glazing method is a great way to make sweet potatoes, and you also get an eggless garlic sauce that you’ll use again and again.View RecipeExplore Bon AppétitHealthyishGarlicYogurtMiddle EasternLebaneseRead MorecookingMy Guide to Modern Middle Eastern CookingGallery10 SlidesBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Andy Baraghani"]}