{"id": "6084cd5024b2e0f0a760d8b142184504", "url": "https://www.bonappetit.com/story/meherwan-irani", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Meherwan Irani Wants to Change Stereotypes About the South, Starting With Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMeherwan Irani Wants to Change Stereotypes About the South, Starting With DinnerThrough his Brown in the South dinner series, he’s bridging the American South with South Asia.By Elyse InamineMarch 12, 2020FacebookTwitterEmailPhoto by Tim RobisonFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Meherwan Irani, a chef and the founder of Brown in the South, a dinner series that aims to bridge the American South with South Asia.I had heard of Meherwan Irani as the chef-owner behind a bunch of beloved restaurants in the South: Chai Pani in Asheville and Decatur, Botiwalla in Atlanta, and Buxton Hall Barbecue, a BA 10 alum run by pitmaster Elliott Moss that’s also in Asheville. Also as the founder of Spicewalla, the small-batch spice company we can’t get enough of. But I honestly didn’t know much about him until last summer, when I attended a dinner he was hosting called Brown in the South in Asheville. You can tell a lot about a person by the kind of party they throw.Irani’s party involves playing plate Tetris with platters of craggy fried chicken inspired by goat karee, turmeric-tinged tomato hand pies, and pickled watermelon rinds. A Q&A with Irani and other participating chefs gently forces you to get to know your dining companions (in my case, a few middle-aged white couples and José Andrés!) beyond passing plates, as the conversation eased from small talk to group discussions about what it means to be a Southerner, to be brown in the South.Irani’s party is warm and engaging, genuinely curious and experimental—just like the chef himself. For just a few hours on one summer night, he got a lot of different people on the same page, reimagining the South not just as a hospitable place but an inclusive one. Who was this guy? I called up Irani to talk to him about the idea behind his dinner series (as well as the story behind the name), his family’s history of cooking for pilgrims, and the universality of okra.Back in the 70s… everyone from The Beatles to foreigners from the U.S. and Europe came to India for the gurus. We had a very famous one in our small town of Ahmednagar, Meher Baba. So my grandma, being a good businesswoman, opened up a bed and breakfast for these pilgrims, and my mom became the manager of the household and the head cook.I grew up eating… pastas, casseroles, and Indian-style cutlets, which are meat patties held together with breadcrumbs and potato then pan-fried and served with a tomato gravy. My mom wanted to make our Western guests feel comfortable. Breakfast was very English: toast, eggs, porridge, which in India is barley and oats. We never knew what would be on the table for lunch and dinner each day. She could make potatoes taste like masala, with mustard seeds and fresh limes, or roast them with rosemary and olive oil. That was eye-opening for me as a kid. She applied Indian spices to dishes without changing the DNA of it.The first place I lived in the U.S… was the American South. Specifically Myrtle Beach, South Carolina. I didn’t know anything about it before I came there for school, but I met Americans in India and saw them adapt pretty easily since my mom worked so hard to make our culture approachable to them. Our guru was all about service and that was built into our hospitality. I realized the South has this culture too: In chance encounters, people would invite me to their homes to feed me and take care of me.Soon I realized I just wanted to eat… homestyle food. I went to the local health food store and bought cumin and other Indian spices and tried to cook from memory. It was terrible. I knew what something was supposed to taste like but had no idea how to make it. I blundered along until my mom came to visit. She is a master of making do with whatever is on hand. If you don’t have Indian spinach, you can use collards. Or if you don’t have coriander, try thyme or marjoram. She had done this her whole life.When I decided to open Chai Pani… we didn’t spend a lot of time thinking about using very Southern ingredients to make Indian street food. The idea came naturally. I started thinking more about this when I went to the Southern Foodways Alliance symposium a couple years ago and started talking to Vish Bhatt [the chef of Snackbar]. Vish is in Mississippi, where Emmett Till was murdered so many years back and at the core of the civil rights movement. I was like, “What’s it like, Vish?” He said, “I have to constantly remind people I’m Southern.” He’s been here all his life. He cooks Southern food. But when he gets asked to write a recipe, it’s always Indian even though he can probably make better shrimp and grits than anyone else.How long do you have to be somewhere… before you dispense with the disclaimers that you’re from somewhere else? Especially in the South, where there is a complicated history? I realized I was a Southerner the moment I said it. I had to own [the term] in order to approach the rest of the chefs I wanted to reach out to for this dinner. I told my wife, “I’m going to call myself a Southerner who happens to be of Indian origin, instead of saying, I’m an Indian who happens to be living in the South.” I may not look like a Southerner, but by living and embracing it, I’m hoping to change people’s perception of it.Food is a great way… to show that “other” isn’t so other.There’s okra in India! In the Deccan Plateau, it barely rains and we, too, have to deal with leafy, fibrous greens. Ham hock is added to collards for flavor [in the South]—we’ve got cumin over there. Chow chow adds some zing to a meal with rice and beans. Well, that mango pickle is doing the same thing, giving flavor to fairly bland meals of rice and dal. Those commonalities are so much more approachable than anything else I could talk about.We came up with the name Brown in the South... when my team was joking around, saying, “We’re brown and we’re Southern, dammit!!” And we were like, “Okay, Brown in the South. What does that mean?” Fried chicken but fried in coconut oil and a hint of garam masala, like how Asha [Gomez] makes it. It’s shrimp and grits upma style. Tomato pie. Butternut squash soup with ginger and cinnamon.We invited everyone we could… and 130 people showed up. Chefs flew in. Magazine writers came. We had a remarkable conversation. John T. Edge did the opening talk and in it he said that he’s a passive Southerner. He was born here and that’s all he knows what to be and do. But he defined us new Southerners as active Southerners. Instead of inheriting this identity, we’re forced to take on this identity and, by doing that, we’re mending the South. We’ve been running with that ever since.We decided to take the dinner on the road…. after we all spoke about what it means for us to be living in the American South and how we wanted to raise our hands and be counted as Southerners, too. All around the dining room, people of every color were talking about how the South can be one of the most diverse, progressive thinking parts of the country and what role we play in getting there.I’m hoping the next one will be in… Oxford, Mississippi. We’re trying to reach out to immigrant chefs in the deep South who have never thought of themselves as Southerners because of what it means to sound like a Southerner or look like one. I’m asking myself: Can the community and region we’re in be better because Brown in the South happened? There is no easy answer, but that’s what I’m working on for the next year.Explore Bon AppétitHealthyishPerson of InterestNorth CarolinaInterviewsRead MoreLifestyleWe'd Get on a Plane to PDX for Dana Frank's New Natural Wine FairBy Lizzie NoonanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-12", "author": ["Condé Nast", "Elyse Inamine"]}