{"id": "60850fd5e171870dc6d974fb4256d4b4", "url": "https://www.bonappetit.com/recipe/fall-spritz", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Fall Spritz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueFall SpritzBy Molly BazOctober 16, 20185.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintNo punch bowls, big-batching, or complicated mixology for your holiday cocktail. Our spritz recipe is so simple—one part amaro to four parts hard cider—that guests can make it themselves (you've got plenty to do elsewhere). Simply set out both bottles with glasses and a bucket of ice; they can handle the rest.Ingredients1½oz. Averna amaro6oz. Basque-style dry hard cider (such as Isastegi Sagardo)Orange twist (for serving)PreparationPour amaro and cider into a glass filled with ice and stir to combine; garnish with orange twist.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHow would you rate Fall Spritz?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSo incredibly easy to eye ball if you're also busy with hosting duties. Extremely delicious and luckily it's easy for me to find Isastegi Sagardo but I'm sure any Basque cider will do. Helps to digest all the holiday feasting!skBrooklyn, NY11/20/2020Molly- this rules! bradford2Oakland, CA11/10/2019Explore Bon AppétitSpritzCocktailDrinks AllItalianEuropeanAmaroAlcohol & Other DrinksHard CiderFallDrinksThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}