{"id": "6087e12f0c818b0325cc7ad75f0411b5", "url": "https://www.bonappetit.com/story/not-my-amus-chicken-thigh-biryani", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Not My Amu’s Chicken Thigh Biryani | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNot My Amu’s Chicken Thigh BiryaniI tried and failed to develop a recipe for my mother’s famous rice dish. And so I made a version of my own.By Sohla El-WayllyOctober 23, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoytsovaFacebookTwitterEmailMy mother is cursed with making the best biryani in town. I know everyone says that about their mother’s cooking, but this is different. When there’s anything going down in California’s San Fernando Valley, she gets a call. If you live in the area and have ever attended a Desi wedding, baby shower, engagement, iftar, car show, dance recital, house warming, or funeral, you may have had a taste of her biryani.Her recipe starts with lamb leg, broken down into meaty hunks and marinated in warm and tingly spices such as cubeb pepper, long pepper, and shah jeera. It’s layered with nuts and fruits, par-cooked russets and basmati, spiked with saffron and kewra, and smothered in ghee. If she’s feeling especially extra, she’ll toss a lump of lit coal into the pot not only to impart a smoky, cooked-over-open-fire taste, but also to vacuum seal the pot shut. Then, before baking, she’ll wrap the pot with dough to super-seal it so not a whiff of that heady steam seeps out.I did not develop a recipe for my mother’s biryani. I tried, and I failed, and so I made my own.Biryani is a layered rice dish spotted throughout the Middle East and South Asia in countless variations depending on the region. Spicy green-chile-and-tomato-laced biryani is common in South India, tart achaar cuts the richness of the goat-and-ghee-loaded pots of Delhi, and warmer spices complement the sweet dried fruit found in Pakistani versions. Unlike a pilaf, biryani is the main event, with maybe a cooling raita or crunchy kachumber served alongside.Although the flavors and components may vary, the technique remains more or less the same. Parboiled basmati rice sits on top of marinated or cooked meat (often) and vegetables or potatoes (sometimes), which all get steamed together following a technique called dum. Dum translates (from Farsi) to “breathe,” a poetic way of describing how slowly heating the biryani in a sealed pot steams the rice while also allowing it to breathe in all the aromatics that cook with it.I set out to develop a simplified biryani, swapping out lamb leg for quick and forgiving chicken thighs, paring down the spices to just a few pantry essentials (warm cinnamon and cardamom, spicy black pepper; chopped nuts, sweet dried fruit), and using a heavy-lidded dutch oven to hold in all the steam, without the traditional dough seal. Think of this as an introductory biryani that allows you to focus on what really matters: the rice.This is no time for funny hybrids like Jasmati or your everyday unaged basmati. Save those for pilaf. For this recipe, take the time to source basmati with all the superlatives: high quality, extra-long, premium aged. Great basmati is golden in color, smells floral and nutty, and can withstand the long cook time of this process. As an extra bonus, aged basmati is much more merciful, steaming up just fine even if you over- or undercook it a touch during the parboiling stage. (We like this one from Daawat!)After you get your hands on the good stuff, make sure you treat it right. I start by rinsing the rice with cool water in a bowl, gently swishing and swooshing the grains around to loosen up any surface starches. I rinse and repeat until the water runs nearly clear. Great basmati will be ready after just a couple rounds, while good basmati takes a few more tries. If I have time, I will soak the rice in cool water for two hours prior to parboiling, but this is an optional step.Next, I get a pot of heavily salted water to a raging boil before adding all the drained rice at once. After adding the rice, the boiling pot will quiet down, but that doesn’t mean it’s time to relax. Now is time to stare into the pot. Seriously. Do not walk away. Do not multitask. The next few minutes will determine the fate of your biryani. I hover over the pot and taste a grain every few seconds. Properly parboiled rice will nearly double in size, while still maintaining a bite at the core. When the rice is close, the pot will start bubbling once more and all the rice will burst to the surface. How long it takes to get to this point varies, so all you can do is stand, stare, and keep tasting. The rice is then drained and rinsed under cool water until no trace of warmth remains.My biryani may not have all the bells and whistles of my mother’s, but because it takes a fraction of the effort, it doesn’t require the pressure (or incentive) of a big life event to make it. In fact, it’s something you can make whenever you’ve got some time, and some friends or family to share it with. Cook it well, and cook it often. Who knows, it might even become the hottest biryani in your town.Get the recipe:Chicken BiryaniThis satisfying rice dish can often be an elaborate, ambitious affair, but our version simplifies the process without sacrificing any complexity of flavor.View RecipeExplore Bon AppétitFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-23", "author": ["Condé Nast", "Sohla El-Waylly"]}