{"id": "608a5c979fb8d31863b3a4d08c18bae2", "url": "https://www.bonappetit.com/story/the-korean-vegan-dinner-party", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "The Korean Vegan: How My Dinner Parties Became Three Million Strong | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow My Korean Vegan Dinner Parties Became 3 Million StrongJoanne Lee Molinaro, a.k.a. the Korean Vegan, loves hosting dinner parties. Now she’s throwing them on TikTok.By Joanne Lee MolinaroOctober 14, 2021FacebookTwitterEmailPhoto courtesy Joanne Lee Molinaro/Illustration by Brittany Holloway-BrownFacebookTwitterEmailThis story by Joanne Lee Molinaro (the Korean Vegan) is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.A neon green silicone glove—the kind Omma would don to wash the dishes or make kimchi (though hers would be mauve or some other appropriately modest shade)—hung limply from the oven handle. Inside the oven, the pearly, dimpled flesh of a garlic focaccia was rising. On the stove, the doenjang chigae bubbled in a steel pot that could have been stolen from my elementary school cafeteria. The dining table—a forlorn slab of wood surrounded by a quartet of wicker chairs—hid underneath a pile of ingredients: a carton of soy milk, two bags of almond flour, a tub of gochujang, leftover packets of yeast, thick fingers of white garraettoek, a half-opened bag of wooden skewers, an unlidded jar of kimchi. The stiff green tails of scallions peeked out between two cans of unused coconut milk. An antique silver spoon idled in a measuring cup, its dull face catching an errant ray of sunlight that cut through the loft.Photo by Geoff MartinAnd the kitchen’s portable AC unit wheezed and coughed incessantly, feeble against the sweltering Brooklyn heat. We’d tried opening the windows earlier, but this left us vulnerable to a hungry menage of mosquitos. So within an hour into my dinner preparations, I was drenched. I was using an oven mitt to wipe the sweat collecting right beneath my nose when I heard the buzzer go off.The first guests to the Brooklyn edition of the Vegan House Party had arrived.My partner, Anthony, let our friends in as I tossed the oven mitt toward the faucet. It smells amazing, Rebecca exclaimed. Yes, it’s the doenjang chigae, I answered absentmindedly, forgetting the hours Omma used to spend scrubbing her kitchen with lemon-scented Lysol to hide the smell of fermented soybeans.As guests continued to filter in, the table became laden with speared and charred tteokbokki, a plate of small, round kimchi pancakes (made out of almond flour and rice flour for our gluten-free friends), bowls of cubed tofu swimming in a thick soybean stew, wedges of focaccia still glistening with olive oil. We barely noticed the heat as Rebecca—an amateur clairvoyant and food blogger—read each of our auras while we ate. Later, we shifted the discussion to Haile—a prodigy who started her first business at the age of eight—and her forthcoming cookbook.My father once told me about the time he had dinner with an old woman in a Vietnamese village during his time in the war. He’d loved the food in Vietnam, but, as an American soldier, he was anxious that the woman might try to poison him. I remember thinking at the time about how I’d never in my entire life worried that someone might try to hurt me through their food but how absolutely defenseless we do render ourselves when we eat something someone else has prepared. There is a disarmament that happens at a dinner party, timed to each sip and chew, one that fosters communion and fellowship, and, the very hallmark of a dinner party, good stories.I’d get to host one more Vegan House Party in New York before COVID-19 threw an ugly wrench into gatherings. By this time I’d moved into a beautiful condo in Chicago outfitted with a stunning rustic oak dining table, but the pandemic ensured its surface remained largely empty. So I did what any lawyer who food-blogged on the side would do: I started a TikTok. I called it the Korean Vegan.My videos were essentially 60-second renditions of the dinner parties that had been stolen from me: a preparation of my favorite vegan dishes with a damn good story. Because I was no longer able to cook for people in person, I created videos where I cooked and told them stories about my mom, my dad, or myself. In one, I took the camera around my dining table while preparing a plate of food for my viewers, just like my mother might do at one of her dinners. While piling their plate with egg rolls and jeon, I told them a story about how my little brother used to call me “noona,” the Korean honorific for older sister, and how that shaped our relationship.TikTok contentThis content can also be viewed on the site it originates from.The video gained over 3 million views and thousands of comments. “The food is beautiful too just like your thoughts,” one said. “Amazing story and that vegan food looks like a 5-star meal,” another said. I saw hundreds of comments about how honorifics or titles play a role in other cultures and languages. And I knew that my videos could leave my followers—i.e., my dinner party guests—feeling satisfied and moved, fed in body and soul.As my platform grew, I continued to explore the concept of virtual dinner parties. Sometimes, I hosted online cooking classes attended by hundreds of people across the globe, many of them ending with us eating and telling stories. By the time in-person social events were timidly resuming, I decided that the dinner party—at least, my dinner party—was ripe for reinvention.My publisher had invited me to host a dinner party on her rooftop in Harlem for the sales team. I devised a doable menu from my cookbook: cucumber kimchi, japchae, pecan paht pie, and, if time permitted, spicy tteokbokki. Then, I fired off the following email:What about if before we ate, I showed you all how to make japchae, too, while telling you some stories?This recipe was, after all, the secret sauce to my TikTok success that has led me to focusing on the Korean Vegan full-time. Why not see how it landed in real life?It was a gray day in Harlem, the sky threatening to crack open like a book with a broken spine. But my portable stove flickered a warm, familiar ring of blue flame (yes, I travel with a portable stove now, and yes, you can get through security with it). I sautéed first the red bell pepper, then the yellow, then the green—each vegetable getting its own solitary time in my pan, just like Omma taught me. And as I did, I talked to the guests surrounding me about Omma—about the time she came to America, failed her nursing boards, and thought she’d have to return to Korea as a failure.As I cooked the onions, mushrooms, and garlic, I told the shining faces on that rooftop about how Omma encountered a homeless woman one wintery day on Lake Shore Drive in Chicago as she pondered her next move, worrying about how she’d find the money to fund another round of exams, and even if she did, how she’d pass them when she could barely understand English. And as I used my hands to mix the dangmyun with the rainbow vegetables, I told them of Omma’s hands, how cold they were when she gave the woman a dollar to buy a cup of coffee, how she tried to pull them back when the woman grabbed them and held them up. And as I plated my japchae for all my guests, I stared into their eyes as I repeated what the woman said to her:You’re going to pass that test.And then, we ate.Explore Bon AppétitLifestyleCultureDinner PartiesPartiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Joanne Lee Molinaro"]}