{"id": "608d1d128e6e2e039898a2c0f5511488", "url": "https://www.bonappetit.com/city-guides/montreal/venue/olive-gourmando", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Olive + Gourmando Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealOlive + GourmandoCarb up at this charming Old Montreal brunch standbyFacebookPinterestTwitterEmailMickaël BandassakGO HERE: for Olive + Gourmando’s bustling breakfast and lunch scene, then take one of the giant cookies or pastries to go.ORDER THE: housemade ricotta (using milk from a small local dairy), served either sweet or savory on toasted bread; \"poached-egg-on-your-face\" panini with herbs, mayo, speck, and roasted tomatoes; French toast; grilled cheese stacked with raclette, Gouda, and caramelized onions; and any of the specials scrawled on the chalkboard menu (a popular feature in many Montreal restaurants). Some of the healthier items, like chia pudding and the “big healthy salad,” feel like a welcome reprieve from poutine.THE VIBE IS: sunny and cheerful. The service is perfunctory but polite; the staff is accustomed to getting both locals and tourists efficiently in and out.PRACTICAL STUFF: Open every day 8 a.m. to 6 p.m. Brunch is served only on weekends, so expect a wait, but don’t fear: The line moves quickly.—Claire SaffitzMickaël BandassakMickaël BandassakWE ALSO LOVEFoxyA perennially packed wood-fired hangout in GriffintownLarrysA natural wine bar that also serves the best breakfast in Mile EndPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}