{"id": "60a2729f6fd578ab392b447cd653b9f6", "url": "https://www.bonappetit.com/story/grilled-salmon", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "This Grilled Salmon Recipe Is What Summer Weeknight Dreams Are Made Of | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Grilled Salmon Recipe Is What Summer Weeknight Dreams Are Made OfAnd it comes with a whole-lemon sauce we can't stop thinking about.By Aliza AbarbanelJuly 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt may seem scary, but trust us: You should really be cooking your fish on the grill.Yes, the fear of salmon sticking to the grates is real. Luckily, senior food editor Andy Baraghani is here to hold our hands and show us the light with this fast, foolproof grilled salmon recipe. Using skin-on fillets creates a wonderfully crunchy skin, plus the skin acts as a barrier to protect the flesh of the salmon from overcooking. Bonus: There’s no need to flip. Paired with a fiercely bright lemon-sesame sauce that uses, yes, the whole lemon—peel, pith, and all—this recipe is a new inductee into the Healthyish weeknight grilling hall of fame.Salmon cooks fast, so start by getting everything ready to go. Prepare a grill for medium heat, and rub the salmon with olive oil before seasoning both sides with kosher salt. The secret to creating a nonstick surface on the grill is ensuring it’s really hot and clean, so let the grill preheat for 15-30 minutes at least.The whole lemon-sesame sauce, in all its glory.\nPhoto by Alex LauWhile the grill is preheating, make that sauce. Start by cutting the ends off a small lemon to stand it upright like an apple, then slice off each of the sides (including peel, pith, and flesh) in four sections so you're left with a square-shaped core. Don't throw it away! (You can toss the seeds). Finely chop the sections—and we do mean \"finely,\" otherwise you'll be biting down on chunks of lemon peel. Transfer the chopped lemon to a small bowl and squeeze the juice from the core over it all before adding honey, sesame oil, sesame seeds, olive oil, and a finely chopped shallot. “This makes a bright, bitter sauce because you’re eating the pith, but the honey counteracts the bitterness,” says Baraghani. “It’s kind of an amazing sauce.” Real modest, Andy. But, uh, we totally agree.When the sauce is done and that grill is good and hot, give the grates a good scrub with a grill brush to ensure the fish won’t stick to anything. (Grills are easier to cook when clean!) Slick the grates with oil immediately before placing the salmon on the grill, then quickly cover the salmon for 6 to 8 minutes while it cooks. Keeping the fish covered guarantees a shatteringly crisp, chicharron-like skin that releases from the grates easily, and the flesh can gently cook through at the same rate. If the fish doesn’t release easily from the grates, let it go for another 30 seconds.Transfer the salmon to a plate and let cool slightly, then top with a torn herb like chives, parsley, or basil, and spoon the lemon-sesame sauce on top. We love grilled salmon because it’s rich and versatile, but this recipe works great with any skin-on fish. Try black bass, striped bass, or snapper, and let this foolproof technique lead the way. (Just increase the grilling time for thicker pieces of fish and decrease grilling time for thinner ones.)  With a recipe this quick and surprising, you'll want to do dinner on the grill all summer long, which is a very good habit to have.Get the recipe:Grilled Crispy-Skinned Salmon with Whole Lemon-Sesame SauceFor this lemony grilled salmon recipe, the key is cooking fish that still has its skin on.View RecipeExplore Bon AppétitHealthyishGrillSalmonRead MoreLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-20", "author": ["Condé Nast", "Aliza Abarbanel"]}