{"id": "60a99f9f1a6454b2d000c797af254f1f", "url": "https://www.bonappetit.com/story/food-shame", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "I'm a Body Positive Fat Person But I Still Can't Enjoy Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Love My Plus-Size Body But I Still Deal With Food ShameI'm the plus-size woman you know who would love nothing more than to join in on the party, but the stigmas that surround having a fat body hold me back.By Laura Delarato March 6, 2019FacebookTwitterEmailIllustration by Daiana RuizFacebookTwitterEmailPerson at party: “Do you want the last bit of cupcake?”Me: “Oh, no thanks!” [Walk away from this party now.]Person at party: “Are you sure? It’s so good!”Me: “I totally had some, thanks!” [I’d rather starve than be seen taking another bite.]Hello, hi. I'm the plus-size woman you know who would love nothing more than to join in on the party—the birthdays, the pizza Fridays, the team breakfast—but the cultural and social stigmas that surround  having a fat body and enjoying food prevent me from ever fully taking part in the occasion.I’ve been hyper-aware of my consumption of and proximity to food ever since I turned 12, hit puberty, grew hips, and was suddenly struck with just how gross my XL body was to the people around me. Because of this, I often choose salads in public. I only take halves of anything. I never talk about how hungry I feel. I will never admit I’m too full. I don’t comment on anyone’s food, and I never go for a whole piece of cake, ever ever ever. I recently ate a cookie from the inside pocket of my coat while leaving Grand Central and thought to myself, “I’m going to Fat Hell for this public display of consumption.”All this is crazy because I’ve spent years living as a body-positive activist: I’ve modeled, I’ve challenged the wellness community to include my size 18 body in their advertisements, I’ve talked about the privilege of enjoying food when you’re thin, and I’ve spoken openly and frequently about having been a teen-to-early twenties bulimic. My Instagram is basically an ode to how good I look in lingerie, and I genuinely love my body. I love how it slopes into an S shape when stand, I love laying on my side with an exterior arm crossing the curve of my hip, and I love how simultaneously muscular and soft it is. Where is all this love when birthday doughnuts show up at the office and I can’t bear to be seen taking one?In 2016, Ira Glass interviewed author Lindy West on This American Life about the way people talk about fat. The episode explained something I’d always felt but never thought about explicitly: that there are good fat people and bad fat people. Glass summarizes West’s point: “As long as you're a fat person trying not to be fat, that's acceptable. That's a good fat person.” Yeah. That’s it. The controlled eating, the worry about others seeing me—it’s all about trying to be the good kind of fat.I’m floored by body-positive Instagram posts that would have me believe that one day I’ll wake up and my food shame will be washed away, that I’ll be a confident person without being plagued by negative food thoughts. That’s just not going to happen for me or for a lot of other people. So I’ve been trying to remind myself that loving my body and working through these food issues are not mutually exclusive. I try to remind myself that, as a body-image activist, I should be open about these contradictions. My brand of body-positivity and activism is about recognizing internalized shame and fear and letting others in on the experience. Because if others know what I’m dealing with, maybe they will feel less alone in their experience.So here are a few ways I try to combat food stigmas and my own internalized guilt:I don’t assume that everyone around me is okay talking about food. Saying things like, “I’m going to get a healthy salad today” feels innocuous but places value on certain food choices when everyone’s choices are different.I don’t use the phrase “I feel fat” because I don’t like my physical body being used to describe a temporary negative state. Do I feel full? Do I feel sad? Cool. Fat isn’t a feeling.I embrace intuitive eating, which involves eating when hungry but also eating foods that make me feel nourished without judging those choices.I am an ally for all bodies, not just the ones in my community. Telling a person they are too thin, look sickly, or should eat something because of their small size contributes to internalized food and body shame.I take a ton of photos of my body and try to be naked as much as possible. I spent so many years at war with my body that I had to re-expose my brain to what I look like, how I move, and how I feel. Nakedness has become so routine that I don’t fear my body anymore.I make myself solo meals and enjoy them: panko chicken wings, carbonara and pancetta, brown butter and sage ravioli. I have found that showing myself that I deserve good food has made it easier for me to enjoy it when I’m in public.It took me a long time to let go of my eating disorder and an even longer time to be at peace with my body. I’m still working toward being the role model I needed back then: a plus-size woman who’s focused on her own happiness, a woman who will take the last cupcake, or leave it, because she wants to and not because anyone else thinks she should.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureNicole Byer Is #VeryFatVeryBrave, Thank You Very MuchBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-06", "author": ["Condé Nast", "Laura Delarato"]}