{"id": "60aa29d6f40bd4c60b6ca077ae5a4d82", "url": "https://www.bonappetit.com/story/charred-cabbage-with-goat-cheese-recipe", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "This Charred Cabbage with Goat Cheese Recipe Is Vegetarian Grilling at Its Best | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Charred Cabbage with Goat Cheese Recipe Is Vegetarian Grilling at Its BestWe never knew it was possible to love cabbage like this.By Aliza AbarbanelJune 4, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Amy WilsonFacebookTwitterEmailMost of the time, burned food is a sign of disaster. But, in the summer, as cooking moves outside and orbits around the grill, the rules change. Seriously. Sit us outside with a charred bean and pea salad or a plate of charred buttered plums, and we're bound to \"oooh\" and \"aaah\" over the smoky flavor in every bite.In Bon Appétit's latest grilling issue, senior food editor Andy Baraghani gave us a slew of new reasons to love a bit of char. This vegetarian grilling recipe pairs deeply charred purple cabbage with juicy cucumbers and a refreshing raita sauce—then finishes the whole thing off with a generous sprinkle of crunchy Corn Nuts. Yup, Corn Nuts.   “Vegetarian recipes don’t have flavorful meat fat, so you want a lot of flavor and texture to fool the senses,” he says.Start by preparing a grill for medium heat and grab your favorite grilling beverage. If you haven’t sworn a summer drink allegiance yet, may I suggest this strawberry-rose agua fresca?Cut the cabbage in half through the core, and cut each half into three wedges, making sure to keep the core intact to hold the wedge together on the grill.  Drizzle the wedges with olive oil, season with salt and pepper, then char the hell out of them until each side is blackened, lacy, and crisp. This should take about 8–10 minutes, which will feel like forever, but don’t lose your nerve. Cabbages are dense and resilient, and need a long time on the grill to soften.While the cabbage is on the grill getting all crispy and delicious, it’s time to make the sauce. Raita is traditionally made with yogurt, vegetables, and spices, but Baraghani chose to add goat cheese for a tangy sauce with extra acidity and cheesiness. Blitz the cheese and yogurt in a food processor with mint, garlic, parsley, and lemon juice until speckled and green, then transfer to a bowl and season with salt. The sauce is done!When the grilled cabbage is blackened all over, remove it from the grill and let it sit for at least 5 minutes. This gives the interior enough time to steam and become soft and tender. While it rests, make a bright and herby cucumber salad to counter the charred cabbage's assertive flavor. Just mix together thinly sliced Persian cucumbers, mint, parsley, and lemon juice.Once the salad is assembled, it's time to starting building those layers of flavor. Start by spreading a thick dollop of raita across the plate, then add a few pieces of grilled cabbage and top with the cucumber salad. Now grab a generous handful of crushed Corn Nuts and make it rain. Finish with Aleppo-style pepper, or whatever chile flakes are around, and a final drizzle of olive oil for good measure.This summer side dish is destined for barbecues, and it's guaranteed to outshine any hotdog with ease. Just be warned: This is the kind of good food that brings conversation to a halt. Small talk fades as forks spear layers of lacy cabbage, scooping up raita, and searching for errant corn nuts. This is cabbage we’re talking about. Cabbage! It’s funny what a little char can do.Find a grill and a cabbage:Charred Cabbage with Goat Cheese Raita and CucumbersGarnish with crushed Corn Nuts, win summer.View RecipeExplore Bon AppétitHealthyishGrillCabbageGoat CheeseSummer SidesVegetarianGrilled VegetablesRead MorecookingThis Is the Only Way I’ll Make Swordfish, the Steakiest Fish in the SeaBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-04", "author": ["Condé Nast", "Aliza Abarbanel"]}