{"id": "60acb8666e0f7e561a9e77b6d61ae1ef", "url": "https://www.bonappetit.com/recipe/slow-roast-lamb-with-harissa-and-apricots", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Slow-Roast Lamb With Harissa and Apricots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueSlow-Roast Lamb With Harissa and ApricotsBy Ron and Leetal AraziMarch 16, 20214.3(19)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis recipe comes from the Passover traditions of Ron and Leetal Arazi, owners of New York Shuk (and makers of our favorite harissa paste). “Leetal’s Turkish grandmother loved to make lamb before she immigrated to Israel,” Ron tells us, “but when she got there, it was so hard to find that she reserved it for holidays.” “We use ras el hanout, harissa, and preserved lemons on the meat as a nod to Ron’s Moroccan heritage, and because fennel is a springtime vegetable and Passover is a spring holiday, it’s also a must on our table,” Leetal adds. “We love to put the lamb in the oven before bed and wake up to its aroma. It’s the most delicious thing in the world.”Since harissas can vary widely in terms of heat level, Ron and Leetal suggest tasting it before you start cooking: If yours tastes very spicy, try reducing the 1 cup in the recipe to ¾ cup (or less) and make up the difference with puréed jarred roasted red peppers. If you can’t find store-bought preserved lemon paste, you can make your own. To make enough paste for this recipe, remove the seeds from ½ cup quartered preserved lemons, then chop very finely. Turn your knife on its side and press into a paste.Ingredients6 - 8 ServingsLamb1lb. dried apricots (about 3 cups)3Tbsp. plus 1½ tsp. Diamond Crystal or 2 Tbsp. Morton kosher salt3Tbsp. plus 1½ tsp. ras-el-hanout10garlic cloves, finely chopped1cup harissa paste5Tbsp. preserved lemon paste2Tbsp. extra-virgin olive oil4medium Yukon Gold potatoes (about 1¾ lb.), peeled, quartered4medium onions (about 1½ lb.), peeled, roots trimmed, quartered4medium fennel bulbs, stalks and fronds trimmed, bulbs quartered15½–6-lb. bone-in leg of lambSalad and assembly1large fennel bulb, stalks removed2cups tender herb leaves (such as parsley, mint, and cilantro)2Tbsp. extra-virgin olive oil1Tbsp. plus 1½ tsp. preserved lemon pastePreparationLambStep 1Bring a small saucepan of water to a boil. Place apricots in a medium bowl and pour in boiling water just to cover; reserve saucepan. Let apricots soak 10 minutes, then drain. Set aside.Step 2Meanwhile, mix salt and ras-el-hanout in a small bowl to combine. Mix garlic, harissa, and preserved lemon paste in a medium bowl to combine. Mix oil, 1½ tsp. salt mixture, and ¼ cup harissa mixture in another small bowl; set oil mixture aside for roasting vegetables.Step 3Rub 2 Tbsp. harissa mixture all over lamb, then coat lamb with remaining salt mixture, pressing to adhere. Coat lamb with remaining harissa mixture. Place in a large roasting pan and cover with a sheet of parchment paper, pressing firmly to adhere to meat and tucking in ends. Let lamb sit on the counter at room temperature at least 2 hours, or chill overnight. If chilling, let meat sit at room temperature 2 hours before roasting.Step 4When you’re ready to roast lamb, place a rack in middle of oven; preheat to 300°. Toss potatoes, onions, and fennel in a large bowl with reserved oil mixture to coat, then toss in reserved apricots just to distribute.Step 5Bring 1½ cups water to a boil in reserved saucepan. Remove parchment paper from lamb and arrange vegetables around; pour boiling water into roasting pan. Place a fresh sheet of parchment loosely over lamb and cover with a sheet of heavy-duty foil, crimping tightly around edges to seal. Slide pan into oven and place a large rimmed baking sheet on rack below roasting pan to catch any drips. Bake until lamb is fork-tender, 5½–6 hours. Remove pan from oven and let lamb rest 30 minutes before uncovering.salad and assemblyStep 6While the meat is resting, halve fennel bulb and thinly slice on a mandoline or with a knife. Toss fennel and herbs in a medium bowl to combine, then add oil and preserved lemon paste and toss to coat.Step 7To serve, place lamb on a large platter and arrange vegetables around. Pour some of the roasting juices over. Top with some of the fennel salad; serve remaining salad and a bowl of any remaining roasting juices alongside. As you pull the meat from the bone, you can moisten it with juices if desired.How would you rate Slow-Roast Lamb With Harissa and Apricots?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleHarrison and Ras el hanout are not the same.  BennaniMorocco11/30/2021I had to make my own non-spicy harissa due to capsaicin food allergy, but followed rest of recipe precisely. Waited 48 hours before eating it and it was great. all the flavors mellowed during that time.  Served with both the \"gravy\" and a side of the fresh harissa.  Did not do the pulling of the meat until reheating the day of serving.  It is now one of my preferred lamb recipes.  No problem finding a real lamb leg that was just 4.5 lbs.  \nMetal ManChicago7/6/2021Why use Ras el Hanout and Harissa together?\nEssentially they are the same except for the amount of hot chilli. The spice ingredients are very similar. \nUse one or another but not both, for simplicityjohnny6/18/2021I normally read the reviews prior to preparing but weirdly did not this time.  What I did do was question a few things.  First, the weights vs quantity is off.  My 2 onions weighed what they said 4 onions would.  Conversely I used a bunch more potatoes and could have used more I think.  I would use half the fennel.  I think it added flavor but you don't need as much end product in the roasted vegs.  Now to the lamb.  My meat market said that 7+ pounds is the smallest lamb leg they have.  I went with that - a vacuum packed leg that I cleaned up.  Key is to trim the silver skin really well and the fat.  Really not that hard but my butcher would have done it for me if the recipe had indicated what was needed.  So not knowing I trimmed.  If you have a good butcher and don't want to do this tell them you want to slow cook it to fork tender.  I rubbed it and refrigerated it a good 24 hours ahead.  I cooked it per the recipe the next day after letting is sit at room temp for 2 hours.  It was done in about 4 1/2 hours.  The lamb temp was right around 200 degrees which is what we do a pulled pork at.  I would have liked a final temp in the recipe.  I took it out and let it sit still covered for about 2 hours but I imagine i1 hour would have been fine.  It was perfect!  Shredded nicely with forks and the apricots melted into the sauce beautifully.  The fennel, as mentioned before was OK but the balance of the vegs were outstanding.  I expect tomorrow it will be even better and I'll be able to remove more of the fat.  Now the salad - spectacular and a bright and crisp side/topping for the rich spicy lamb.  Lamb is spicy so be prepared.  It is not overly spicy for us but it has some heat.  I imagine this would vary based on your harissa choice.  I would definitely make this again and it is a beautiful dish for company.  Additionally not something you would need to work over while you have guests.  Beth from CARedondo Beach, CA4/6/2021Truly delicious & special celebration meal. I was nervous from the other reviews about dryness but I had no such problems... Actually the opposite there was tons of moisture in the pan. Only thing I can think of to explain the difference is make sure to add the water to the pan before cooking and then really seal it up with tin foil. My meat & veggies cooked 5 & 1/2 hours and came out falling off the bone. Just delicious, would definitely make again for holidaysLuc4/5/2021So disappointed with the results of this recipe. I made it exactly as described, even preparing the lamb  the day prior, and the result was not at all good. The lamb was overcooked and definitely not \"falling off the bone\".  After 5 hours, the internal temp was over 170 degrees -- so quick dry and tough to chew.  The vegetables were, surprisingly, still edible The apricots, however, disintegrated, and so added nothing to the dish. I ruined a perfectly good leg of lamb and wasted more than a few hours of the nice Easter weekend on this. ChrystenCalgary4/4/2021The preparation was easy enough.  I simply combined the ingredients including my own preserved lemons in the food processor.  But the end result was surprisingly dry with minimal penetration of the flavor. I’m sorry we cooked this recipe, a waste of a perfectly good leg of lamb.    Next time I’ll make it in the grill.LarryBoston3/29/2021Made this for Passover night #2 and it was delicious.  My suggestions would be testing the internal temp a little earlier - my oven was at 300 but when I checked at 5 hours, the meat above target temp.  Also, the preserved lemon paste seems to be a product created by the recipe authors. I realized this only after going to 3 middle eastern groceries.  To make it, I bought a jar of preserved lemons, quartered and deseeded, then blended with 1 tbsp each pickling brine and water.AnonymousVancouver BC3/29/2021This is a wonderful lamb recipe for Passover or any special meal.  My family loved it and I will definitely make it again.   I prepared it the day before so it marinated overnight. I reduced the harissa paste to 1/4 cup and added 3/4 cup pureed jarred roasted red pepper.  I made my own preserved lemon paste from jarred preserved lemons.  For the fennel salad I added the tender herbs mint, flat leaf parsley and dill.  My only complaint is that cooking the vegetables for 5 hours rendered them mushy.IreneWestlake Village, CA3/29/2021Made this for passover and it was the best lamb I've ever had. The meat pulls apart easily off the bone. I'll be making this again in the future. The vegetables did cook for 6 hours and they were delicious. The only thing was not all the veggies fit in our baking dish so we had to cook some in a separate dish along side the lamb.JedPortland, OR3/28/2021Am making this on weekend. Does it seem right that the vegetables are also cooked for 6 hours? ChrystenCalgary 3/28/2021Explore Bon AppétitJewishMoroccanNorth AfricanAfricanLeg Of LambLambMeatHarissaCondiments, Sauces & PastesDried ApricotDried FruitFruitMainGluten-FreeDairy-FreeNut-FreeRoastPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Ron", "Leetal Arazi"]}