{"id": "60b5c0490e982a17d6193212b9b9b5ab", "url": "https://www.bonappetit.com/story/brown-butter-basted-steak", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "The Best Way to Cook Steak Involves Brown Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesThe Best Way to Cook Steak Involves Brown ButterWe’re flipping the traditional sear on its head.By Alyse WhitneyMarch 27, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailWhen you think about flipping, you probably think of pancakes, burgers, and the bird. But flipping is also the key to the best way to cook steak. You should flip it good. Every two minutes. And then baste with brown butter, garlic, and rosemary.The lesson we’ve all been taught is to leave your steak alone, letting it sear undisturbed on one side, flipping, and then letting it cook through to the perfect medium-rare. But lately, our favorite technique is to give steak constant attention, treating it with as much affection as you would a rescue puppy. This method was used in one of our 29 new essential recipes, Brown Butter-Basted Steak, and there are a few key reasons why it works:1. It Cooks More EvenlyA classic grilled rib eye steak gets constant direct heat for at least 4–6 minutes per side. Even if you watch it carefully, you often get a medium-rare center with a gray-brown ring of overcooked meat around the exterior. By flipping it often—about every two minutes—you can allow one side to cool while the other forms a deep brown crust. This also allows the juices to distribute evenly throughout the meat as it cooks.2. There’s Time for Brown Butter BastingOnce the steak is a few degrees below the temperature you’re aiming for (120°–125° for medium-rare, which should take about 8 minutes), add 3 Tbsp. unsalted butter, 2 sprigs of rosemary, and 2 crushed garlic cloves to the pan. As you baste the steak with this aromatic mixture, the butter will brown and turn nutty, imparting this flavor into the steak and making it even juicier. It’s also a little trick: If you don’t have a even crust all around, you can pour extra butter in places that need more browning to concentrate the heat in that area. It’s kind of like shallow frying in butter, so use tongs and be careful so it doesn’t splatter. This is not a steak you can walk away from—it needs to be constantly tended to so it doesn’t overcook and gets perfectly brown from edge to edge. Like so:3. You Get a Built-In SauceAfter the steak is cooked and rested for at least 10 minutes, the remaining butter emulsifies with the drippings to make a pan sauce without any extra work. Slice the steak against the grain, sprinkle with flaky salt, and drizzle with lots of sauce. You can get a little creative by adding other hardy aromatics to your butter, like thyme or bay leaf, but the baseline best combination is butter and garlic. Classic steakhouse sides are great, but we also love serving with bitter greens and a citrusy vinaigrette to cut through the fat. But if you went with buttery mashed potatoes for a butter-on-butter situation, no one would complain. They might even flip out.Get the recipe:Brown Butter–Basted SteakHow to make steakhouse-quality steak at home.View RecipeExplore Bon AppétitSteakRead Morecooking4 Steaks You Can Actually AffordBy Alex DelanycookingHow to Season a Steak Like a ProBy Alex Delanyrecipes76 of Our Best Steak Recipes, from Rib Eye to Skirt Steak, Fajitas to SkewersGallery76 SlidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Alyse Whitney"]}