{"id": "60b67a365baac9b30b589a668b5ae0a8", "url": "https://www.bonappetit.com/story/remembering-philando-castile", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "My Son, Philando Castile, Was a Role Model. Here’s How I’m Keeping His Legacy Alive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Son, Philando Castile, Was a Role Model. Here’s How I’m Keeping His Legacy Alive“He wanted to ensure every child got a chance to eat.”By Valerie Castile, as told to Dawn DavisFebruary 12, 2021FacebookTwitterEmailPhotograph by Stephen Maturen/Getty ImagesFacebookTwitterEmailIn this week’s Person of Interest, editor in chief Dawn Davis talks to Valerie Castile, the mother of Philando Castile—a school nutrition supervisor who was killed by Minnesota police in 2016. Almost five years after his death, Valerie reflects on her son’s life and talks about the Philando Castile Relief Foundation, which aims to reduce school lunch debt and help families affected by gun violence.My son Philando always loved food and community. Collard greens, macaroni, dressing, and steak. Steak! When he was little we had family potlucks and we’d all bring something. I always made sure Philando had a steak. My brother’s kids used to get mad, like, “Hold up, why ain’t we getting steak? We got ribs and chicken.” I was like, “He’s a king, baby! He’s a king.”A year out of high school...Philando started working with St. Paul Public Schools as a nutrition assistant. The ladies there liked him because he was a hard worker; they offered him the supervisor’s position many times before he actually took it—he wanted to know how things were managed first. He was a nutrition supervisor at J.J. Hill Montessori School for two years before he was killed by police in 2016.Before his death...I had no idea about school lunch debt. [Editor’s note: This occurs when students are unable to pay for school meals; in a 2019 study, 75 percent of U.S. school districts reported outstanding debt.] I didn’t know the extent of it, families who owe hundreds of thousands of dollars. And I never knew my son was paying off these debts until after he was gone. It was considered a no-no, but he did it anyway. He didn’t know if the kids were having nutritious meals at home, and what if those school meals are the only ones they got? He wanted to ensure they got a chance to eat.My family and I...started the Philando Castile Relief Foundation in my son’s honor to reduce school lunch debt and help families that have lost loved ones to gun violence. We offer resources for grief counseling and housing. We donate to organizations like the Hallie Q. Brown Community Center in St. Paul’s Rondo neighborhood. Because of COVID, they’re meeting the needs of more families than they normally do and with even fewer donations. Recently, I was talking with one of the directors about a food drive they did with Philando’s school when he was still alive. She told me about how he’d pump the kids up to collect donations, clapping and singing songs with them. I’d never heard that story before.My son was...a role model. He was a mentor. Somehow he remembered all the kids’ names and all their allergies. Once, when he was still new at J.J. Hill, he noticed a new student sitting by himself in the school cafeteria. So Philando went over to him, asked him what his name was, and explained that he was new there as well. “Why don’t you come over here and sit with these guys?” he said. He picked up the student’s tray and took him over to a table where some other boys were sitting. And that’s how this young man made his first friend.Explore Bon AppétitPerson of InterestRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-12", "author": ["Condé Nast", "Valerie Castile", "As Told To Dawn Davis"]}