{"id": "60c8ba5851006c9306efc856ccd0a6bf", "url": "https://www.bonappetit.com/story/mini-food-processor", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Bon Appétit Test Kitchen Swears By This Mini Food Processor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By This Mini Food ProcessorSmall but mighty—and really, really clutch.By Zoë SessumsMay 7, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailOne of the easiest ways to turn a sad, miscellaneous ingredient into a meal you can actually brag about is to serve it with something quick and dippable, spreadable, or schmearable. One more piece of bread? Toast it, and whip up your own butter. Got a few hardboiled eggs? Make your own mayo and mix it into egg salad. Trying to finish the last of your greens? Put it to good use by pairing it with a creamy miso dressing. Got veggies but nothing to eat ’em with? How about some homemade hummus? The thing that makes all of this actually fast and easy? A Mini-Prep food processor.“I love my tiny food processor,” senior food editor Molly Baz says as she pulls out her Cuisinart Mini-Prep Plus and cradles it in her arms. “I keep my three-cup on the counter because it barely takes up space, and I end up using it all the time,” adds food editor Anna Stockwell.That’s because any task that requires chopping, slicing, or shredding can be tackled with a food processor, whose ridged and razor-sharp blades cut through ingredients as a chef’s knife would—but a lot faster. Pesto is ready in moments, with the mini prep taking on the hard pine nuts, sticky garlic, and tender basil all in one go. Dressings too, like this walnut-anchovy one. In fact, its ability to handle those different textures all at once is the machine’s biggest advantage over something like a blender, which, with its super fast motor, strives to bring uniformity to each ingredient.With a mini food processor, things still get done quick—but you won’t have to sacrifice consistency for speed.Buy it: Cuisinart Mini-Prep Plus Food Processor, $32 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsequipmentRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-07", "author": ["Condé Nast", "Zoë Sessums"]}