{"id": "60d29de75775e4577383d7f28f65462a", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/suzuran", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Suzuran Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoSuzuranRamen as a work of art.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for ramen that has ascended to the level of haute cuisine. Most ramen is nowhere near this expensive, but most ramen is not both a gastronomic and aesthetic achievement. The menu is also unusually large and varied: Whereas almost every other shop in the country will focus on executing only one or two bowls to the best of its ability, Suzuran offers a coterie of expertly crafted bowls inspired by everything from sukiyaki to Sichuan hot pot.ORDER THE: standards to see what a simple bowl can be when taken to its most artistic conclusion: chashu men (topped with sliced pork), wontonmen (studded with dumplings), buta kakuni men (accompanied by big medallions of sweet braised pork belly), and tantanmen (the Japanese take on Chinese dan dan mian). Or order one of the deluxe bowls from the menu of house specials, though know that these items will demand a premium price.THE VIBE IS: sumptuous. Lights are dim and chairs are cushy. The counter is hewn wood and the kitchen never rises above a quiet hum. There is no ticket machine at a place this posh and food is ordered from a menu not a counter. This is a professional operation that has more in common with high-end sushi than a busy ramen shop.PRACTICAL STUFF: Open Monday to Saturday from 11:30 a.m. to 3:30 p.m. for lunch and 6 p.m. to 11 p.m. for dinner. Closed on Sundays. There is no English menu and the staff does not speak English, but a picture menu is available for you to select from. The nearest subway station is Ebisu.Photo by Xavier Girard LachaîneNo bok choy left behind.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}