{"id": "60d73a69bd6f205b4ad94d467b44fc7c", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/zuni-cafe", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Zuni Café Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoZuni CaféThe iconic Hayes Valley bistro that's world-famous for a reasonFacebookPinterestTwitterEmailEric WolfingerGO HERE: for one of the most quintessential San Francisco dining experiences.  Zuni Café's whole roasted chicken is world-famous for good reason: It really is that good.ORDER THE: chicken with bread salad, mustard greens, currants, and pine nuts. The bread has that coveted dual texture: It's crunchy from hanging out in the wood-fired brick oven but also a little mushy after soaking up all the chicken juices. It's heaven. While you wait for your chicken, which can take up to an hour, share the Zuni Caesar salad (a fine example of the genre) and a plate of the shoestring potatoes.THE VIBE IS: a little bit old-school but never stuffy. The waitstaff is relaxed and friendly, but it does feel like you're dining in a place with some history—and that's a good thing. There are several different rooms to sit in within the triangular building, but we're partial to the small upstairs room where you can peek in on the open kitchen downstairs.PRACTICAL STUFF:  Open for lunch and dinner: Tuesday to Thursday, from 11:30 a.m. to 11 p.m.; Friday and Saturday; from 11:30 a.m. to midnight; and Sunday, from 11 a.m. to 11 p.m. Closed on Mondays.—Carey PolisEric WolfingerWE ALSO LOVEState Bird ProvisionsDim sum with a Michelin twist—don't miss the signature quail Swan Oyster DepotSuper-fresh seafood in Nob Hill, hold the attitudeLa TaqueriaLine up for the ultimate Mission burritoExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Carey Polis"]}