{"id": "60e4edb66574d7459a3f0bb8462e0acd", "url": "https://www.bonappetit.com/story/mushroom-carbonara-recipe-convert-haters", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Mushroom Carbonara Recipe Converted My Mushroom-Hating Husband | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Mushroom Carbonara Recipe Converted My Mushroom-Hating HusbandThe secret is plenty of nutty, deeply-caramelized mushrooms. And the secret to those is patience.By Molly BazApril 2, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Jennifer OphirFacebookTwitterEmailNothing in this world brings me more joy than converting haters. Successfully convincing someone that an ingredient they think they don't like is actually delicious is the ultimate challenge, and puts all of my skill and mettle to the test. Case and point: My husband Ben informed me several years ago that he didn't like mushrooms. And you know I wasn't going to let that slide.See, I knew he didn't actually dislike mushrooms. I could see it in his eyes that he just hadn't had them properly prepared, and I couldn't blame him for not the loving steamy, pale, lifeless mushrooms you get in mediocre stir-fries. So when I set out to develop the recipe for Basically's Mushroom Carbonara, I had him in mind. I wanted to create a dish chock full of deeply browned, super caramelized, umami-packed mushies, something that would convince even the staunchest hater of this incredible ingredient's potential. And guess what? I successfully did just that.So how did I do it? If you think I bought a bunch of fancy, expensive wild mushrooms and cooked them three at a time, lovingly attending to each one so that the pan was never crowded and maximum browning was achieved...well, folks, that's not what I did. Conventional mushroom-cooking wisdom would take me down that path. And I took a different path altogether, pretty much the opposite one in fact, and they turned out amazing.First, I bought a couple pounds of Basic B mushrooms—just a bunch of cheap-o creminis and buttons—and after stemming and tearing them into pieces I threw them all at once into a ripping hot pan with a fair amount of olive oil. And you know what I did then? I poured myself a glass of wine and walked away. I puttered around my apartment, returning every five minutes or so to give my 'shrooms a little stir, but generally left them undisturbed. And after 15 minutes or so they were dark brown, crispy around the edges, and smelled irresistibly rich and nutty. It’s a hot take, I know, but I’m here today to tell you that an over-crowded pan of piled high mushrooms is a lifestyle, and it’s a lifestyle I wholeheartedly embrace. Here’s why it works.Just some plain ol' cremini mushrooms, nothing fancy here.\nPhoto by Chelsea Kyle, Food Styling by Jennifer OphirMushrooms contain A LOT of water, and in the presence of high heat, water creates steam. Steam is the enemy of browning. So, naturally, many of us were taught long ago that the fewer 'shrooms you cook at a time, the less water there is to turn to steam, and therefore the browner they will become. But the fact of the matter is that no matter how many mushrooms you have in the pan, that water will inevitably need to cook off—it’s just how the world works. This is all to say that you could cook a few mushrooms at a time in successive batches, but that will take about as much time as it will to crowd the pan with mushrooms, let them release a ton of water at once, and patiently let that liquid cook off so they can get to browning. At the end of the day you get the effect—a pot of deeply caramelized mushrooms—but with a whole lot less fuss.Time is on your side here. Let it be be your friend, and it’ll do all the dirty work for you. A glass of wine, 15 minutes, and a couple good stirs of the pot later you’ll have mushrooms just as golden brown and delish as ever, ready to be turned into the kind of meaty, savory, vegetarian pasta dish that dreams are made of. Makes sense right? Hopefully you’ve seen the light. My husband Ben certainly has. After one bite of that pasta, he changed his stance on mushrooms for good.Get the recipe:Mushroom CarbonaraMushrooms take the place of the traditional cured pork in this super-satisfying vegetarian carbonara recipe.View RecipeExplore Bon AppétitBasicallyMushroomCarbonaraPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Molly Baz"]}