{"id": "60e463aa42f7d04a872805c91cdcaf18", "url": "https://www.bonappetit.com/story/ajo-blanco-sauce", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Ajo Blanco Is the Sauce You Didn’t Know You Were Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAjo Blanco Is the Sauce You Didn’t Know You Were MissingMeet the creamy, ultra-garlicky white sauce that you’ll want to put on just about everything.By Emma WartzmanOctober 17, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailRaw garlic is a tough sell. It’s got a way spicier bite than its cooked-through counterparts—whether roasted until jammy and sweet, fried into chips, or infused into oil—and a stronger, sharper scent. But that’s why were here. To show you the magic of raw garlic. Are you ready to be sold?I’ll leave the task to Andy Baraghani, who created a riff on a traditional Spanish ajo blanco—a cold soup made of puréed blanched almonds, grapes, olive oil, sherry vinegar, and raw garlic. In his version, the soup is instead a sauce that can be drizzled over lettuce, spooned atop flaky white fish, scooped up by torn warm pita, or poured over crunchy, refreshing cucumbers. Make Cucumbers with Ajo Blanco Sauce and you’ll be addicted to the stuff.Andy’s version also nixed the grapes, a specifically sweet and slightly acidic flavor that would have made it less versatile. But the rest, is pretty much the same: All those ingredients, plus ice water, get pulverized in a blender until completely smooth. The ice water is key to a nice consistency, to mellow the grassiness of the olive oil and the garlickiness of the garlic—and to keep the motor and base of the blender from overheating and making warm sauce (no thank you).Just one clove has so much flavor.\nPhoto by Alex LauThe recipe call for only one clove of garlic, which doesn’t sound like a lot. But it is. For one, it’s raw, which means extremely pungent. There’s also a lot of fat in there, coming from both the almonds and the olive oil. As you may know, fat is the great carrier of scent and flavor, which means the garlic has a lot to cling to. “It also becomes more assertive the longer it sits,” says Andy. “It will not be nearly as strong right after you blend it as it is even a few hours later.”But the best thing I learned about this sauce, is that it really a template you can play with. You can sub hazelnuts or cashews for the almonds, you can add some tender herbs, like mint or cilantro. You can throw in a chile for extra heat, or a spice like turmeric, cumin, or coriander. “Anything that goes well with garlic is a good bet,” Andy says.Which is just about anything we can think of.Get the recipeCucumbers with Ajo Blanco SauceThis ajo blanco sauce is rich from almonds, tart with sherry vinegar, and plenty garlic-pungent, it’s what we’re putting on everything we’re making this season.View RecipeExplore Bon AppétitGarlicSauceDipRead MorecookingFrom Now On, I Will Always Have a Jar of Garlic Confit in my FridgeBy Emma WartzmancookingSlow-Roasted Halibut in Garlic Cream, Because It Was a Hard WeekBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Emma Wartzman"]}