{"id": "60e6253c0f226afb41052ffc360e9718", "url": "https://www.bonappetit.com/recipe/honey-dunked-sfenj", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Honey-Dunked Sfenj Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueHoney-Dunked SfenjBy Zoe KananSeptember 22, 20203.9(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThese hand-pulled, no-knead doughnuts were brought to Israel by Moroccan Jews in the early 20th century. A breakfast staple of the Maghreb year-round, they’re often eaten by Sephardic Jews during Hanukkah. To use whole-milk Greek yogurt in place of regular yogurt, add an additional 1 Tbsp. plus 2 tsp. water. This recipe is from pastry chef Zoë Kanan.Ingredients2½cups plus 2 Tbsp. (329 grams) all-purpose flour1Tbsp. sugar1tsp. cornstarch3½tsp. Diamond Crystal or 2¼ tsp. Morton kosher salt, divided1tsp. instant yeast½cup plain whole-milk yogurtNonstick vegetable oil sprayVegetable oil (for frying; 6–8 cups)1cup honey1½tsp. ground cinnamonPreparationStep 1Sift flour, sugar, cornstarch, and 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt into a large bowl; mix in yeast.Step 2Heat yogurt and ¾ cup water in a small saucepan over low until just above body temperature (or you can heat in a microwave in 20-second bursts). Pour into dry ingredients and stir with a wooden spoon until absorbed. Work together with your hands until a wet and sticky dough forms. It will be soft to the touch and look shaggy.Step 3Lightly coat another large bowl with nonstick spray and, using a bowl scraper or rubber spatula, transfer dough to oiled bowl, keeping intact as much as possible. Cover with a silicone lid or plastic wrap and let sit in a warm spot until doubled in size, about 1 hour.Step 4Slip your fingers under one side of dough and pull it up and over to cover three fourths of surface. Turn bowl 90° and repeat folding process. Turn bowl and fold dough 2 more times. Cover and let sit until puffy and nearly doubled in volume again, about 30 minutes.Step 5Pour oil into a large skillet to come 1½\" up sides; heat over medium until an instant-read thermometer registers 350°.Step 6Meanwhile, warm honey, cinnamon, and remaining 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a small saucepan until just bubbling. Remove from heat.Step 7Pinch off a piece of dough slightly larger than a golf ball and hold between your index finger and thumb on your dominant hand, punching your thumb through the center of the dough to create a hole, then gently rotate and stretch with your fingers until you’ve created a ring as wide as your palm. (The ring will puff up significantly when fried.) Repeat process to make 2 more doughnuts, dipping your hands in cool water before making each one to help prevent dough from sticking.Step 8Adjusting heat as needed to maintain oil temperature, carefully slide doughnuts into pan and fry until golden on bottom and puffed on top, about 2 minutes. Turn and fry until golden on the other side, about 2 minutes. Remove from oil with a spider or slotted spoon and immediately dunk in cinnamon honey, turning several times to coat thoroughly. Transfer to a wire rack. Working in batches of 3 or fewer, repeat forming, frying, and coating doughnuts until you’ve used up all of the remaining dough.Step 9To serve, pile doughnuts on a platter and drizzle any remaining cinnamon honey over. (Eat immediately!)Step 10Do ahead: Dough can be made 12 hours ahead. Chill after final rise. Let sit at room temperature 1 hour before frying. (If dough is fried cold, the doughnuts will be dense.)How would you rate Honey-Dunked Sfenj?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis recipe is a disaster, I grew up eating these in Morocco and never thought there would be yogurt in the batter so I wanted to try it out, I did and had so many regrets. \nThis is what I get trying out a whitewashed recipe of my cultural heritage: wasted food.  \nBA get a Moroccan to make these for you, stop getting white people to butcher our food. Lamia Lazrak Portland, ME2/6/2021made these for a secular holiday dinner as dessert and we all flipped at how good these were. not too sweet and so airy and delicious. I've never made donuts so this was a very fun first project! would make again in a heartbeat. remyyyPortland, OR12/26/2020Incredible doughnuts! Some of the best I've ever had, and they weren't hard to make at all. The light and airy dough with the crunchy exterior is heavenly. My whole family was hooked and I'm making them again tomorrow! Thanks for the recipe!!AnonymousMadison, Wisconsin 12/4/2020Explore Bon AppétitDoughnutDessertJewishYeastOther IngredientsYogurtSnackNut-FreeFryBakingHanukkahBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Zoe Kanan"]}