{"id": "610033ab9c676c3626a2b115342fe335", "url": "https://www.bonappetit.com/story/a-critics-last-week-eating-in-restaurants", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "I Spent One Week Eating Like There Was No Tomorrow. Then Tomorrow Never Came. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Spent One Week Eating Like There Was No Tomorrow. Then Tomorrow Never Came.Editor at large Amiel Stanek was ready to embark on a cross-country search for the Hot 10—until the pandemic hit.By Amiel StanekSeptember 30, 2020FacebookTwitterEmailPhoto by Emma Louise SwansonFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.I eat fast. Observing the pace with which I attacked the food in front of me, a dining companion once joked that I put a meal down like I was worried someone would take it away from me. And standing outside a buzzy, new all-day restaurant in Santa Monica, that was exactly what it felt like: Something (or, rather, many things) was about to be yanked off the table in front of me before I had a chance to reach for my fork. And I had a choice to make.Something called COVID-19 was in the news—no, it was the news—and I was a little more than a week into what was to be an exhaustive cross-country survey of new restaurants for the Hot 10, our annual list of America’s best new restaurants. I had just gotten off a conference call with my editors in New York who were all “practicing” working remotely, and they had told me to pull the plug. They couldn’t in good conscience let me keep traveling. But I had just gotten to Los Angeles a few hours earlier, with a hotel booked and a carefully planned itinerary of over 20 restaurants that I was hoping to hit in the next 48 hours. Should I drive back to the airport? Hightail it home and hunker down? Or stick around and paint the town red, once more, for old times’ sake?I decided to eat.Inside Pearl River Deli in L.A. \nPhoto by Sachiko StudioI couldn’t not. Sure, there was a part of me that thought that this whole pandemic thing would blow over in a month or two, that I would be heading back out on the road to continue my search. I thought this was maybe going to be a comma, not a long, lingering ellipsis. With that in mind, it seemed silly to have to go back to Los Angeles; I might as well do the work that I had come to do. But at the same time, I had an inchoate, niggling sense that something was about to be taken off the table. I could have never imagined that restaurants across the country would shutter, some for months and some forever, and that I wouldn’t sit down for a proper meal in a dining room for (*checks calendar*) six months as of this writing. I didn’t mean to spend a weekend dining out like there was no tomorrow—I thought I was just doing my job—but there kind of...wasn’t a tomorrow. And that’s exactly what I did.I had spent the previous four days eating my way across the Bay Area, and things were definitely not normal. My flight from New York to San Francisco had been less than a third full. SFO felt like a ghost town. Even the coolest new spots were mostly empty; no reservations required. But at the same time, for lack of any real guidance on the matter, things were actually, well, pretty normal. Everything was still open. Nobody was wearing a mask. I scarfed ruddy quesabirria tacos at Tacos El Patron, silky Japanese curry at Family Cafe, the most comforting roasted cauliflower lounging in spiced labneh at Mama Lamees. I inhaled superlatively crunchy, herb-scented onion rings at The Lede and followed that up with 16 brilliant, meditative bite-size courses at Hina Yakitori. I had my mind blown at Popoca, a wood-fired pop-up in the backyard of a classic car dealership, that introduced me to the complex pleasures of Salvadoran food: tender chicken braised with fermented pineapple, Dungeness crab swaddled in a rich pumpkin-seed sauce, thick tortillas handmade from freshly ground corn. I felt stuffed and shredded and hungover by the time I got to L.A., but the idea that the next couple of days would be my last opportunity to engage in this kind of insane full-contact dining filled my sails. I was hungry again.The dish Amiel has been fantasizing about: the mussels (topped with fries!) at Bar Restaurant\nPhoto by Jakob N. LaymanI get kind of misty-eyed thinking about that weekend in March. It was full of “lasts” but also delightful firsts. The cheekily named Bar Restaurant was the last place I enjoyed an icy, perfectly balanced martini made by someone other than myself; it was also the first time I’d been served mussels swimming in cream and crowned with a tuft of hot, crispy curly fries, a combination I’ve fantasized about for months. Pearl River Deli was the last place where I enjoyed a meal crammed shoulder-to-shoulder with friends at a tiny counter, passing bowls and sharing chopsticks without a care in the world; it was also the first time I beheld the majesty of a crisp-fried bone-in pork chop sandwiched in the middle of a buttery pineapple bun (genius!) or was served char siu so juicy and gorgeously lacquered that I was left speechless. It’s odd to have spent the past six months reminiscing so wistfully not about the restaurants where I’ve made myself a regular over the years but rather places I’ve visited only once, a madcap series of one-night stands. The astonishingly lacy-edged, onion-perfumed burgers from Goldburger loomed large in my quarantine dreams, as did the herby chicken salad served atop a crisp scallion pancake at Yang’s Kitchen in Alhambra. These meals are locked in my memory, a time capsule of tastes and textures and spaces from The Before Times, delicious and bittersweet.And then, of course, there was The Last Meal. Broad Street Oyster Co., a hipper-than-thou seafood shack in a strip mall in Malibu. It was the last stop before the airport and eerily empty; the news about the rapidly spreading coronavirus had gotten worse, not better. Our table was a parody of a final meal. A seafood tower replete with whole cracked Santa Barbara sea urchins and sparkling-fresh oysters; buttery lobster rolls; a sheet pan of grilled razor clams; a cheeseburger for good measure. Sparkling wine to wash it all down. That was what I was eating when I saw the news alert flash on my phone: California restaurants were ordered to close by 8 p.m. the next day. It was really over.It was time to go home.Explore Bon AppétitRestaurantsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Amiel Stanek"]}