{"id": "61032d4f98cd578f09b74c889608d6cb", "url": "https://www.bonappetit.com/recipe/cooler-corn", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Cooler Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueCooler CornBy Brad LeoneJune 2, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Grilled corn tends to get dried out; I want the kernels to burst when I bite into it,” says Brad Leone. Grill your corn over the high heat of just-lit coals, then let it hang out in a cooler while you grill proteins and more delicate vegetables. The corn will finish cooking by steaming in the cooler and stay warm for hours. “It steams, gets nice and fragrant and juicy. Open up that cooler and pow, it’s like a Yankee Candle.”Ingredients4–6 servings 6Tbsp. Diamond Crystal or 3 Tbsp. plus 1¼ tsp. Morton kosher salt6ears of corn, in huskPreparationStep 1Combine salt and 3 quarts water in a large pot; stir until salt is dissolved. Add corn; let sit at room temperature at least 2 hours, or cover and chill up to 12 hours.Step 2Prepare a grill for high heat. Drain corn and grill until husks are lightly charred all over, about 15 minutes. Wrap in a clean towel and place in a cooler. Let steam at least 15 minutes and up to 3 hours.Kinda like this… but with the top closed!\nPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioHow would you rate Cooler Corn?Leave a ReviewTell us what you thinkExplore Bon AppétitCornVegetableSummerEasySideGluten-FreeDairy-FreeNut-FreeVeganVegetarianHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}