{"id": "610600ef1265a53f6022911698bfb5ef", "url": "https://www.bonappetit.com/recipe/miso-y-grilled-potatoes", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Miso-y Grilled Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueMiso-y Grilled PotatoesBy Brad LeoneJune 2, 20204.7(29)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBoil the potatoes before you head out camping (or to your backyard!). They’ll get a quick char on the grill to crisp the skins and warm back up. The final step, per Brad Leone, is to “give ’em a little cut, a little smash, then add melted miso-garlic butter and toss ’em. The charred skin comes off in the butter—it’s nice.”Ingredients4 servings1½lb. baby Yukon Gold potatoes½cup Diamond Crystal or ¼ cup Morton kosher salt4Tbsp. unsalted butter2Tbsp. red miso1garlic clove, finely chopped1Tbsp. seasoned rice vinegar2Tbsp. chopped parsleyFreshly ground black pepperPreparationStep 1Prepare a grill for medium-high heat. Bring potatoes, salt, and 1 quart water to a boil in a medium saucepan over medium-high heat. Reduce heat and simmer until tender, 12–14 minutes; drain. Grill potatoes, turning often with tongs, until lightly charred, 6–8 minutes.Step 2Meanwhile, set a medium skillet, preferably cast iron, on grill. Place butter and miso in skillet and cook, stirring, until butter is melted and mixture is smooth, about 2 minutes. Remove from heat; stir in garlic and vinegar. Season with pepper.Step 3Transfer potatoes to skillet, breaking some in half with tongs. Toss to coat in miso butter. Add parsley; toss again.How would you rate Miso-y Grilled Potatoes?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleMaybe the problem is mine but the miso never incorporated into the butter. It became a goo alien better suited to applying wallpaper. Is it the miso I used? AnonymousEarth11/21/2021I have made these at least half a dozen times. I actually do it in a cast iron pan, and broil for a few mins . Then do miso and butter, I doubled vinagar with great success, added extra garlic as well! Superb recipe. Susan Ottawa, Ontario, Canada8/25/2021These potatoes have become one of my favorite BA recipes ever.  Very little work yet toms of flavor.  Paired with the soy basted pork chops as suggested it was the perfect meal.  SkibubWashington 8/1/2021My son made these for a barbeque and I could have eaten the whole dish. Absolutely delicious and simple.AnnMadison,wi6/6/2021The flavor of these potatoes is fabulous.  I couldn't get the consistency like I wanted it with the parboil/grill method so I might just roast them next time and add the miso butter towards the end.  My 13 year old (who normally does not like potatoes at all) says he's a convert so thats saying alot.ErinLos Angeles, CA3/8/2021these are outrageously delicious! sarahBrooklyn NY1/26/2021We LOVE this recipe.  We decided to do them in a skillet on the stove and they were wonderful.  We also used white miso paste and have used red potatoes cut small.  The whole recipe is just delicious.Anonymous10/3/2020Wow. Brad knocked this one out of the park, absolutely. The miso butter is soooo good and adds so much to the potatoes! I also added his garlic-ginger fermented paste when I was making the miso butter (alongside the fresh garlic and vinegar) and it was fantastic! Next time, I'm going to add dill in with the parsley at the end. Definitely going to make this one again!AnonymousToronto, Canada9/19/2020These are incredible and so easy. My whole family loved them and we've made them twice already! Made with white miso (what we had) and still delicious. Also worked with little purple potatoes!Portland, OR7/28/2020These are delicious - I've already made them 3 or 4 times this past month. The flavours are so good! Last time I made them, I parboiled the potatoes, then lightly crushed them using the bottom of a glass and  roasted them till crisp. I poured over the miso butter mixture for the last few min of roasting so it could coat all the delicious little crispy cracks in the potatoes.AnonymousHaverford, PA7/27/2020Delicious! I live in NYC and I don't have a grill so I skipped the boiling step and simply put them on a baking dish and baked them as I normally would and I prepared the miso and butter combo in my dutch oven then threw the potatoes in the mixture and coated them! It was heavenly! Just a nice alternative for those of us who don't have grills that this recipe works just as well baked as it does grilled! :)Andrew EckertNew York City6/27/2020Who would've thought the potatoe dish would be the star of the barbeque. Absolutely amazing!Hannah_RosalieThe Netherlands6/23/2020Absolutely the only way I want to eat potatoes from now on!  I debated on grilling the parboiled potatoes and crisping them up in the cast iron skillet.  I'm glad I didn't because the light char on the skins of these beauties is not to be missed!  I couldn't find red miso in my grocery shop so I used white miso, they were still fantastic.GrcisgoneGreenville, WI6/19/2020Amazing!!! So addicting-the flavor profile will make you crave them. This recipe is a keeper for sure!gpinczowKirkland, WA6/19/2020These will definitely be a frequent side dish for summer grilling. We have already made them 3 times in two weeks. Highly recommend. Super easy and packed with flavor AnonymousChicago 6/17/2020Explore Bon AppétitPotatoVegetableMisoCondiments, Sauces & PastesYukon Gold PotatoSummerEasyQuickSideNut-FreeVegetarianGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}