{"id": "6106609ea9c82fee58e595a6f95ef4dd", "url": "https://www.bonappetit.com/story/leftover-mashed-potato-biscuits", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Turn Leftover Mashed Potatoes Into Big Fluffy Biscuits | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTurn Leftover Mashed Potatoes Into Big Fluffy BiscuitsThe Thanksgiving equivalent of hair of the dog.By Grant MeltonNovember 27, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My favorite thing about Thanksgiving is when it’s over. Not because I want festivities to end, but because I know that the next day will bring a fridge full of leftovers, which for me, is a holiday in itself.There are plenty of different ways to polish off a platter of turkey—a French Toast Turkey Sandwich dripping in cranberry sauce, a cozy Turkey Pot Pie or a simplified Turkey Shawarma. The one leftover that’s often overlooked is one that, without fail, I always have a mountain of: mashed potatoes.Even with all the butter and cream, mashed potatoes never seem to be quite as good reheated. They’re mysteriously dry, even when drowned in gravy. But with a little repurposing, mashed potatoes can become fluffy, endlessly layered biscuits—a roll-over dish that’s just as good as (or maybe better than?) the OG.In addition to putting a dent in the pile of leftover potatoes, this recipe is also a great use-up of that cheese lingering behind on the cheeseboard and any odds and ends of herbs chillin’ in the crisper (like the giant bunch of rosemary or bundle of thyme you only used a few sprigs of).Start by preheating the oven to 400°. Using a cheese grater, grate ½ stick of butter. The long, thin strands of butter guarantee a biscuit that’s flaky AF. To keep the butter cold, which also promises a well-layered biscuit, pop it into the freezer once it’s grated. While you’ve got the grater out, shred some cheese—you can use any kind of hard cheese you like, but I’m partial to a super sharp cheddar—until you’ve got ¾ cup cheese, plus a little extra for topping the biscuits.In a large bowl, whisk together 2⅓ cups all-purpose flour, 2 tsp. salt, and 1 Tbsp. baking powder. Gather up whatever herbs you’ve got and finely chopped enough so that you’ve got 2 Tbsp. I like a combo of rosemary, sage, and thyme. Chives, parsley, or dill all work well too.Add the chilled, grated butter to the dry ingredients and toss lightly just until the butter is coated in flour. Then, add 1 cup leftover mashed potatoes and continue tossing lightly until the potatoes have broken down into pea-sized pieces. There’s no need to worry so much about whether your mashed potatoes are super fatty or plain Jane—I’ve made this recipe with both, and both work great. Lastly, add that reserved grated cheese, tossing it with your hands so that it's evenly distributed.Using your hands, make a well in the middle of the ingredients. Fill the well with ¾ cup buttermilk. Slowly mix the ingredients together until a dough forms. Turn the dough out onto a floured surface and pat down into a 10-inch circle.To cut the biscuits, grab an empty soup and remove the lid from the bottom so you have a hollow cylinder. Using the empty can, cut 10–12 biscuits. (If you’d rather use a 3-inch biscuit cutter, that works too.) Once cut, place them into a 10-inch cast-iron pan.Brush the tops with buttermilk and top with more cheese, a sprinkle of herbs and a pinch of freshly cracked black pepper. Bake the biscuits for 20–25 minutes or until they’ve doubled in size and are golden brown on top.Enjoy the biscuits warm, with a slather of butter, served alongside some eggs or, for the ultimate leftover treat, break open a biscuit to build a slider-sized, but also superior, turkey sandwich. Once you’ve tried ‘em, I can all but guarantee that next Thanksgiving you’ll peel an extra potato or two with the next day’s biscuits in mind.Grant Melton is an Emmy Award–winning culinary producer, food stylist, and recipe developer who’s favorite food is chocolate chip cookies (salted, obviously).Explore Bon AppétitIt's That SimpleThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-27", "author": ["Condé Nast", "Grant Melton"]}