{"id": "6114063c8f8e0f94657773d51e138b14", "url": "https://www.bonappetit.com/story/ellen-van-dusen-home", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "How Designer Ellen Van Dusen Lives In Technicolor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Designer Ellen Van Dusen Lives in TechnicolorThe professional maximalist shares how to play with color, patterns, and tchotchkes.By Aliza AbarbanelJanuary 25, 2021FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailThis article is part of Healthyish at Home, a collection of tips, recipes, and stories about making our living spaces (still) feel great. If months of staring at my living room walls didn’t weaken minimalism’s appeal, one look at designer Ellen Van Dusen’s gloriously over-the-top Brooklyn brownstone did. The founder of beloved ultra-saturated brand Dusen Dusen is practically a professional maximalist, and her design sensibility is guaranteed to spark joy. “Bringing in color makes me feel happy and at home,” Van Dusen says. “Not everyone has the same relationship with color, but fun little objects can really shift the whole mood of a room. It’s an easy and noncommittal way to change things up.” She sticks to white walls and neutral appliances to keep the little, colorful objects from being overshadowed, then decorates with aplomb. Here she outlines how she uses patterns, colors, and playful objects to lighten up her living space.Photograph by Laura MurrayUse every surfaceThat's not a print or painting above the mantle: Van Dusen used a dowel rod to hang this silk scarf from Massif Central, designed by painter Jonas Wood. “Massif Central does limited, artist-edition scarves, so I have a couple that I’ve bought from them over the years,” she says. “It's a great way to ‘buy the painting’ if you can't afford a painting.”“I have gotten into having flowers during quarantine—they make the room feel fresh and they’re just pretty,” says Van Dusen. The black and white striped vase from ceramicist Isabel Halley features a rotation of fresh and funky blooms from local shop Bohaus.Photograph by Laura MurrayPut it all on the table One easy way to skip the monochrome look? Bring in color with trippy mismatched napkins. Van Dusen designed the full set of patterned textiles to mix and match without clashing. The stackable Heller plates were an eBay score! Photograph by Laura MurrayGet a little silly“I love this shark by my friend Lorien Stern,” Van Dusen says. “She also painted my bathroom downstairs! We connected on the internet because we both love sharks and watermelons, and we’ve become good friends since then.”Photograph by Laura MurrayMix and match (then mix some more)Van Dusen used broken tiles—which are often salvaged when pieces break in the kiln and don’t require additional cutting—to cover the Victorian-era fireplace’s original damaged tiling with a freeform mosaic inspired by artist Niki de Saint Phalle. Steal this trick to upgrade dowdy bathrooms or alcoves (but get permission if you’re a renter).Stick to simple white walls to make a perfect canvas for hanging colorful objects. Sure, that Dali-esque resin clock by Italian architect and designer Gaetano Pesce is functional, but it’s also fun.Shop Ellen Van Dusen's apartment: Buy it: Tall Vase with Black and White Stripes, $165 at isabelhalley.comBuy it: Dusen Dusen Set of Four Napkins, $42Buy it: Watch Me Clock, $300Explore Bon AppétitHealthyishHealthyish HomeTrendsRead MoreLifestyleHealthyish at Home: 7 Ways to Make Your Space Feel GreatBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Aliza Abarbanel"]}