{"id": "611a5a675512df6188c27f9b03a57aa8", "url": "https://www.bonappetit.com/recipe/instant-pot-red-bean-and-quinoa-soup-with-taco-fixins", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Instant Pot Bean and Quinoa Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueInstant Pot Red Bean and Quinoa Soup With Taco FixinsBy Deb PerelmanSeptember 17, 20193.7(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintWhen 5:15 p.m. hits and there’s still no dinner plan, Deb Perelman makes this delicious Instant Pot recipe inspired by hearty Mexican bean soups. While the beans cook you can prepare the taco fixins, manage life’s last-minute chaos, and take a load off.Ingredients4–6 servingsSoup2Tbsp. extra-virgin olive oil1large red onion, finely chopped4garlic cloves, finely grated1Tbsp. ground cumin116-oz. package dried Central American red beans, such as Goya or Rancho Gordo Domingo Rojo½cup red quinoa, rinsed1Tbsp. sauce from a can of chipotles in adobo2tsp. kosher salt, plus more½limeAssembly½small red onion, thinly sliced2Tbsp. red wine vinegar½tsp. kosher salt¼tsp. sugarLime wedges, sliced avocado, sour cream, chopped cilantro, crumbled queso fresco or shredded cheddar or Monterey Jack, hot sauce, and/or tortilla strips (for serving)PreparationSoupStep 1Heat oil in an Instant Pot or other electric pressure cooker on the Sauté setting. Add onion and cook, stirring occasionally, until beginning to turn golden brown around the edges, 6–8 minutes. Add garlic and cumin and cook, stirring constantly, 2 minutes. Add beans, quinoa, adobo sauce, 2 tsp. salt, and 7 cups water. Lock lid and cook soup on high pressure 45 minutes, then release pressure manually. Squeeze in juice from lime half; mix well. Taste and season soup with more salt if needed.Step 2Do Ahead: Soup can be made 2 days ahead. Let cool, then cover and chill. Soup will thicken; add up to 1 cup water before reheating over medium-low.AssemblyStep 3While the soup is cooking, toss onion, vinegar, salt, sugar, and 4 tsp. water in a small bowl to combine. Chill until ready to use.Step 4To serve, ladle soup into bowls and top with pickled onions and other toppings of your choice.Step 5Do Ahead: Onion can be pickled 5 days ahead. Cover and keep chilled.How would you rate Instant Pot Red Bean and Quinoa Soup With Taco Fixins?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleMy family LOVES this meal for an easy weeknight dinner.  It is hearty, filling and makes great leftovers.  Nice to find a high-protein, meatless dish!  The toppings are key to jazz it up a bit.  I make it exactly as written- don't worry about brand of red beans- seems to be fine with store brand.  I haven't had any trouble with hard beans and never soak them first.  CarrieBellevue, WA12/30/2020This recipe is lackluster ... It is okay, and certainly edible, but I'm not sure the flavor is interesting enough to merit the inclusion of this recipe in your magazine.  Karen C. 12/28/2020This is a Caldo de Frijol soup, it is a traditional Mexican dish that is eaten in several regions of Mexico. Give credit to the culture where it is from, it is not the Chef's creation. Stop cultural appropriation.\nKrizzia MarilesMexico City12/3/2020The soup was good. But the beans need to be soaked before cooking.  Otherwise the 45 minute cook time is about half too short.  AnonymousKansas1/27/2020I liked the flavor and texture, but definitely soak the beans or add cooking time! 45 minutes wasn’t enough to fully cook the beans. ameliabadelCalifornia 1/22/2020First let me state that 45 min is not enough in the pressure cooker. It definitely needed another 15-20 min at high pressure. Wish I would have trusted my gut feeling on that one. Beans came out waaay undercooked and my pressure cooker wouldn't seal again. Oh well... Into the microwave to finish.\nMade some changes to the recipe. Sauteed in lard, not oil. Added a Jalapeno. Used chicken bouillon instead of salt. Wish the \"soup\" was a little looser. Very thick. Soup was rich but relied heavily on toppings to bring the flavor. Overall I would make it again, but I would definitely adjust the time and would add some tomatoes and perhaps some corn and some other herbs or spices to help round out the flavor.Anonymous1/14/2020I wanted to love it - but MEH!  \nPerhaps it was that it didn't print fully from my Mac and  I didn't realize a few of the words were cut off until it was too late - I'd already gotten started.  Also, as a newbie getting to know my IP, I wasn't sure how long it would take to get to pressure and I didn't fully understand the direction to \"release pressure manually.\" I googled the term and got the hang of it.  I set it to high and pressure cook for 45 minutes per the directions.  The beans were not fully soft which was disappointing and the bottom of the pot was starting to burn!  The flavor lacked punch and the quinoa just seemed to soak up the liquid - it didn't add anything.  So, I am in the process of doctoring up what I made and I am sure when we eat it with queso, avocado, etc it will be tasty enough, but I doubt I would repeat this recipe.  AnonymousNew York!!!!!!!!!10/28/2019Made this and it came out amazing, cannot wait to make it again!!!!AnonymousNew York, NY10/9/2019I made this recipe according to the instructions and it came out fabulously! Will definitely make again and add some hot sauce and other exciting things to spice it up!AnonymousNew York, NY10/9/2019Did anyone use canned red beans to make this soup?jnkcooperNew Mexico10/9/2019This was a good base recipe for the instant pot. Like others, I made what seemed like logical changes. I used chicken stock instead of water, added some peeled chopped tomatoes and little salsa that I had leftover, and added a couple of tablespoons of tomato paste. I also cooked it for one hour at the recommendation of another reviewer. Overall it was very good! My husband said he likes it better than chili! (and yes it does come out more like a chili than a brothy soup, but that's not a bad thing). AnonymousHudson, oh10/8/2019I made this exactly as the recipe stated, but increased the cooking time by 30 minutes to soften the beans a bit more. The consistency was more like red bean gravy (Caribbean style) than soup. The flavor was ok, but could definitely be spiced up. We are having it for dinner tomorrow, and even with the toppings I can’t imagine it without rice. I will probably add some broth to thin it out.AnonymousAZ10/7/2019Based on the reviews, I definitely tweaked this recipe.  I added a can of tomato paste (definitely helped thicken it), a whole can of chipotle sauce, used veggie broth in place of just water and added some more seasonings (bay leaves and oregano).  I would have also increased the pressure time to 1 hour, as the beans had a bit more bite than I like.  All that being said, it turned out great!  Denver, CO10/1/2019Super delicious and easy!AnonymousSebastopol, CA9/30/2019Really wanted to love this recipe, but as the other readers said, it's definitely missing something--more heat, more spices. We added some poblano peppers in the sauteeing stage but even that didn't make enough of a difference.AnonymousChicago9/30/2019Explore Bon AppétitSoupSoups and StewsMexicanLatin AmericanBeanVegetableQuinoaRice & GrainsMainVegetarianNut-FreeHealthyishInstant PotDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Deb Perelman"]}