{"id": "611c2d3db59e30caafaf947a9b1c6777", "url": "https://www.bonappetit.com/story/summer-hand-rolls", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "DIY Hand Rolls Are My Last-Minute Dinner Party Savior | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDIY Hand Rolls Are My Last-Minute Dinner Party SaviorThey’re ready in a half hour, and there are never any leftovers.By Christina ChaeyJuly 7, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My favorite summer dinners are the ones that come together without a plan, the meals you can spontaneously throw together for friends after a long day at the beach or a few rooftop beers. And if it doesn’t require that much actual cooking, like this DIY hand roll spread, all the better. I’ve thrown together these temaki-style rolls so many times over the years that I’ve got it down to a science. Here’s how to make it all happen.First, get your rice going:As soon as this dinner plan starts to coalesce, I start my sushi rice. To make a perfect pot, rinse 1½ cups short grain sushi rice in several changes of cold water until the water runs clear. Drain well in a colander, then transfer to a small saucepan. Add a scant 2 cups cold water and bring to a boil over medium-high heat. Stir rice once, cover, and reduce heat to low. Cook until water is evaporated and rice is tender, 18–20 minutes. Remove the pot from the heat and let sit, covered, for around 10 minutes. Then, whisk 2 Tbsp. unseasoned rice vinegar, 2 tsp. sugar, and 1 tsp. Diamond kosher salt together in a small bowl until the sugar dissolves. Stir that seasoned vinegar into the rice and let sit (covered so it stays warm) until everything else is assembled and it’s time to eat.While the rice cooks, prepare your protein:I like to make one simple protein filling for my hand rolls, something that can easily be accomplished in the 20-ish minutes it takes for the rice to cook. While that can be slices of high-quality raw fish, that’s not usually something I have on hand, so I gravitate towards gussied up fridge and pantry staples. Pan-fried strips of Spam. Ribbons of egg omelet. Or, my all-time favorite, homemade spicy tuna made with the good oil-packed stuff. To make it, stir together 2 Tbsp. mayonnaise, 1 Tbsp. Sriracha, and 1 tsp. toasted sesame oil in a medium bowl until smooth. Add white and pale green parts of 1 thinly sliced scallion and two 4-oz. cans oil-packed tuna, drained, to bowl and use a fork to gently break up bigger tuna pieces and combine with sauce. Transfer spicy tuna to a small serving bowl and garnish with toasted sesame seeds and thinly sliced dark green scallion tops. Doesn’t get much easier than that!Get your garnishes together and serve:In addition to my star protein, I like to set out a bunch of other simple fillings to round out the spread while keeping things as breezy as possible. I’ll slice an avocado, julienne some cucumber, chop up some store bought kimchi. If I’m feeling fancy, I’ll set out some extra goodies like tender fresh pea shoots or a small jar of salty trout roe. All the toppings go on one big platter along with glossy cut nori sheets, while everyone gets their own bowl of warm rice so they can fill and wrap their own hand rolls until every last slice of cucumber is gone—there are never any leftovers.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-07", "author": ["Condé Nast", "Christina Chaey"]}