{"id": "6127e91c9f91c5d4934372bbee9c8131", "url": "https://www.bonappetit.com/story/atlanta-diverse-food-scene", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Discovering the Diversity of Atlanta’s Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEating My Way Through Atlanta, I Learned It’s Much More Than Black and WhiteHow getting lost in my hometown let me see a side of it I had long chosen to ignore.By Rembert BrowneNovember 30, 2018FacebookTwitterEmailPhotos by Emma FishmanFacebookTwitterEmailAt 8:30 in the morning on January 3, 2018, I was standing in a high school classroom—a room I once took Spanish in—staring at four freshman, four sophomores, four juniors, and four seniors. It was my first day of a monthlong trip to Atlanta, the longest stint I’d spent back home since the summer of 2006. Launching into a monologue about what this creative writing class was all about, I was thrilled by the sheer amount of knowledge I had to give to these 16 lucky children. This rules…for them, I thought. Twelve minutes later I was through all my material. It was 8:42. The class ended at 10:15. By 10:30 I was back in my car, questioning many of my decisions: asking to teach a year earlier, re-asking via email on a day I especially hated New York, getting my bluff called, saying yes, and then actually showing up. By no stretch of the imagination had that morning gone well. And then there was that whole “Atlanta expert” farce I sensed was starting to unravel as I talked to the students—the reality that with every passing year living in Brooklyn, I was becoming less comfortable talking about the city that raised me.I’d returned to the car to briefly hide, but then I realized I was actually done for the day. I could leave, without getting in trouble. And, to be honest, I was exhausted. So, on day one of the new job, I was going to go take a nap at 11:15 a.m. A role model, yes. Yes, I was.Driving on I-285 through downtown Atlanta\nPhoto by Emma FishmanMy mother’s house, the site of my January bed, is in south Atlanta. It’s in a part of the metropolitan area, Jonesboro, that I’ve spent over a decade going out of my way to learn nothing about. Because it’s not my Atlanta. My first home, in the majority black southwest Atlanta, was always the constant: the place that never stopped raising me, feeding me, teaching me.Heading home there was a car accident on the highway, creating a traffic jam. Realizing I’d never taken side streets from my current location and in no hurry whatsoever, I put my phone’s maps on the “avoid highways” setting. It felt silly to use GPS in my hometown, but now that I was taking the street, I needed it.Driving down Jonesboro Road, only a few miles from my mother’s house, I passed restaurants with signs in a variety of languages. It wasn’t just a handful of places between two stoplights; this was a legitimate corridor.Witnessing this, I was reminded of the reality of the highway. Such is the case with most of life’s efficiencies, the trade-off for speed was ignorance. And on this drive I realized the need to get from point A to B as quickly and mindlessly as possible was partially responsible for my increasingly disingenuous relationship with my hometown. Taking only the highway keeps you in the dark, by passing over neighborhoods, homes, people, and other cultures. You miss things: the stuff you didn’t know, or the stuff you simply don’t want to see.Almost home, I drove under a sign for Nam Dae Mun Farmers Market that I’d seen off the highway for years. I knew it to be a farmers’ market of sorts, but because it was one exit before my mother’s house—an exit already equipped with a grocery store—it was nothing more than a place out of the way.Sampling at Nam Dae Mun Farmers Market\nPhoto by Emma FishmanI pulled over and walked in, and five minutes later I was Mary Tyler Moore, smiling and throwing my hat in the air. Because I was surrounded by everything and everyone. The market has South Korean ties, but this was not simply a massive Korean grocery store. This was as international as I’d seen (or heard) a single establishment in some time, Atlanta or otherwise. There was a Nigerian couple arguing over whether they should get the $1.49 white yam or the $2.49 Ghana yam. And actually knowing the difference. There was a man staring at a box of rambutan, a Koosh-ball-looking thing I did not know existed. And there was aisle 10, which advertised itself as the home of “Jamaican Seasoning, Colombian Seasoning, Indian Seasoning, Jamaican Food, Colombian Food, Canned Fish, Indian Food.”I was in paradise, and I wasn’t even hungry. Catching myself in all this excitement, I paused to realize that something about me had just changed.The longer I’ve lived in New York City, the more I—like many others—have prided myself on finding gems within the boroughs. You know, Uzbek food in Rego Park, Senegalese food in Harlem, Russian food in Brighton Beach. Why was I so curious and adventurous up North but once back at home the polar opposite?After Shazaming two K-pop music videos that were playing in the market’s restaurant, Eat More Korean, I walked out, pondering that question. It didn’t take long to get to the answer, and I couldn’t tell if it was a source of embarrassment or pride. Or a little of both.My Atlanta, which aligns with much of the history of Atlanta, is black and white. I grew up in southwest Atlanta, a historically black part of town, and eventually went to school from fifth through 12th grades at the Paideia School near Emory University in a more white part of town. It’s also the South, so there’s, you know, hundreds of years of fraught history between black people and white people. The two groups were all I saw and all I knew, so that became all that was. And while that could create tension, it did not feel complicated. There was nothing more than us and them.Atlanta has long been thought of as a black city, so much so that it’s been dubbed Black Mecca on numerous occasions. And I’m one of many people who never want Atlanta to stop being (or thought of) as a black city. I love our black mayors, I love our black people, I love our black style and sound.Ever since the Olympics came to town in 1996, the city has marketed itself as an international city. And not just because of the airport but because of the “melting pot” that Atlanta was becoming. I knew that, and the data supported it, with the Asian and Latino populations growing at a rapid pace between the 2000 and 2010 censuses.Yet I still thought of Atlanta as a two-horse town: black and white. Because when you only acknowledge a place as this or that, both sides get a sizable slice of the pie. But when you add other groups to the mix, just by way of basic math, your share—and your perceived importance—decreases. For the first time I was conflicted about what I wanted from my once and hopefully future home, the place that emboldened my grandparents, raised my mother’s entire generation, and gave me a proud black foundation to stand on.So on this day, I finally stopped pretending no one else lived in Atlanta. And with that, I had places to see. Streets to take instead of highways. And the best way I knew how to learn more: Eat.My first stop was the Burmese restaurant Royal Myanmar Cuisine, which closed a few months after my visit. I let out a laugh as I pulled up: This place was so Atlanta, not least because it’s in the same strip mall as the famed strip club Strokers. There was something oddly calming about eating mote hin gar—the national dish of Myanmar, a delicious fish soup that intimidated me at first with its reddish-orange hue—as people were beginning to daytime file into Strokers for any number of reasons (most likely the many televisions).A few days later, right after finishing my first week of classes (which felt like a month), my friend John recommended Mamak, a Malaysian restaurant, and Woo Nam Jeong Stone Bowl House, a Korean restaurant, both located on Buford Highway, the well-known international corridor. Growing up, what I knew about Buford Highway was that it was where everyone else lived. I understood that to mean Asian and Latino, nothing more. Because it didn’t fit my convenient binary, I treated it like it wasn’t Atlanta.Curried chicken in puff pastry at Mamak\nPhoto by Emma FishmanWhen I walked into Mamak, there were only two people dining, an Asian man and woman. I didn’t know what to order, so I eavesdropped, perhaps overly assuming that they did. I was partially correct: The woman’s parents were from Malaysia, and she was explaining the dishes to the man, who was Japanese-American and knew nothing of the cuisine. Listening to that unfold, it reminded me of how long I’d exercised a catchall to diversity among people of Asian descent and Latin descent in Atlanta. Did I do it in New York? Again, no. But at home, still, yes.I sat in the back of the restaurant, closest to the kitchen, which proved to be an accidental stroke of genius. Every time an order was ready, the server would walk right by me, and more often than not, a whiff of curry found a way to hover, a welcome surprise each time.By the time I made it to Stone Bowl, I was already full by way of half an order of laksa, a delicious coconut-milk curry. But the energy in the restaurant gave me another wind, with groups chatting enthusiastically over banchan, a change from the quieter Mamak. I ordered the bibimbap, rice crisping on the edges of the hot bowl, and finished the entire thing.During my third week of teaching, I’d finally become a teacher. And as it is with small schools, everyone has six jobs, so my days of leaving right after class were no more. On one of those long days, I hung around until after basketball practice to talk to two students, as well as to do my biannual check to see if they’ve hung my jersey in the rafters. Then I drove to a restaurant I’d seen written up, Miller Union, to take a friend out as a thank-you for speaking to my class. All I knew about this restaurant was that the chef, Steven Satterfield, had recently won a James Beard Award. I felt like I was eating at the best Southern restaurant in Manhattan, which I mean as a compliment.Mussels and chorizo in squash seed broth at Miller Union\nPhoto by Emma FishmanToward the end of that week, my same friend John demanded that I go with him to We Suki Suki in east Atlanta, which is part of a food hall called the Global Grub Collective (also home to a place that makes sushi burritos—a thing that I now know exists).Hours after utterly destroying a banh mi at We Suki Suki, I turned my “avoid highways” mode back on. I pulled up a map of the city’s best restaurants on my phone to see if I was going to pass by one en route. Looking at the map, I realized something I’d overlooked in my newfound glee: There wasn’t a single place below Interstate 20—meaning on the south side of town. Yes, expert recommendations had expanded my horizons about pockets of the city that I’d never explored, but the part of Atlanta I knew the best was widely ignored. Instead of dipping back into my old arsenal of soul food and more soul food, I just started driving. It’s a freeing feeling to take right turns simply because you want to know what’s to the right.We Suki Suki’s vegan pho with tofu and mushrooms\nPhoto by Emma FishmanAfter half an hour I ended up at Jamrock South.When I left Atlanta at 18, I thought I knew all the different types of black people. And then I went to college and was surrounded by black folk who were not the black people I grew up around, who were descendants of American slavery. I met first-and second-generation people from Ethiopia and Haiti and Jamaica and Nigeria, which exposed me to the different ways we were all raised, as well as the similarities of our life experiences that come from being black. One of those differences was the food that was put on a pedestal.I didn’t know anything about beef patties until I made it to New York. Goat? Not really high on the food chain. At Jamrock I had both. Did the restaurant stop me in my tracks with flavors I’d never experienced? No. But I was happy to see a diversity of tastes on the southside just as there was on the northside, coupled with the added flair of Instagram flyers advertising parties like “#BDE: A Monthly Soiree.” West Indian cuisine and culture weren’t something I could enjoy only when I left Atlanta. It was at Jamrock. And the more I looked, it was all around me.Billy Ellis at Jamrock South\nPhoto by Emma FishmanNine months after my teaching gig, I was back in Atlanta for a music festival. I missed my students, some of whom were in college now, some of whom I owed an email to, all of whom I thought about often. I also missed having a car and driving around exploring.Over the past year I’d grown to love Peruvian food, thanks to my girlfriend, whose family is Peruvian. Until this day, driving around town, I’d never considered Peruvian food in Atlanta. On Yelp, I typed in “Peruvian,” and there was a restaurant, Las Brasas, less than a mile away in Decatur, where, as they say, it’s greater.I was excited to eat but also to report back to my girlfriend. Sure, it was just one restaurant. But running through my heart was this: Yes, Atlanta is my city, the black capital of America, but it could also be her city too. And wouldn’t you know it, one day our children could see themselves represented throughout this city.I didn’t say all that in the text. I just sent a photo of a bowl of arroz chaufa, a fried rice dish, with the text “It’s lit.” I boxed most of it up and took it home. That evening I made a plate of the chaufa for my mom, who had had Peruvian food once with my girlfriend’s family. I was running out the door as she took her first bite.“Ooh, yes.”I always felt like I was waiting on my city to catch up to me. But in reality, I just needed to catch up to Atlanta. All of Atlanta.Explore Bon AppétitAtlantaTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Rembert Browne"]}