{"id": "612b5aa6f9e32dff8b5f6efb24b94f4a", "url": "https://www.bonappetit.com/story/paul-rudd-z-man-sandwich-joes-kansas-city", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Paul Rudd Loves This Kansas City Barbecue Sandwich So Much, He Flies It to NYC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePaul Rudd Loves This Kansas City Barbecue Sandwich So Much, He Flies It to NYCThere’s nothing the actor won’t do for a taste of the Z-Man Sandwich from Joe’s Kansas City Bar-B-Que.By Paul Rudd, as told to Alyse WhitneyApril 29, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailTo transform into mini-but-mighty Ant-Man in Avengers: Endgame, Paul Rudd keeps a strict high-protein, low-carb diet. Except when he’s eating the Z-Man from Joe’s Kansas City Bar-B-Que in his hometown of Kansas City, Kansas. Stacked with brisket, smoked provolone, and onion rings, “it’s a killer sandwich—maybe my favorite in the world,” Rudd raves. He flies them to NYC annually for his fantasy football draft, which this year lined up fortuitously with a new role Rudd needed to gain weight for. “I ate with a clear conscience because I was supposed to be mushy for work.” Here, he talks about just how much he loves that sandwich.I moved to Kansas when I was 10, but I was never a big barbecue fan when I was a kid. My parents are British, so it just wasn’t anything we grew up with. Those great barbecue spots were kind of wasted on me then. But now they’re a much bigger part of my life. Whenever I go back to Kansas City with my kids, which is often, we are always getting barbecue. I was just back there and I think we had barbecue for about four days in a row. It was debilitating. You can’t do it that often.There’s a great sandwich called the Z-Man Sandwich at a spot called Joe’s KC. I think it’s maybe my favorite sandwich in the world. There are different places that do different things—people like LC’s for burnt ends, Jack Stack, Gates, Arthur Bryant’s—but I really crave that Z-Man Sandwich. It’s brisket, and it’s got provolone cheese, onion rings, and barbecue sauce. There are pickles, and you get it with coleslaw. They do seasoned french fries that are pretty outstanding too.I’ve even ordered the sandwiches and had them flown to New York where I live, with the Z-Man Sandwich kits. They send the brisket, and the buns, and the onion rings already kind of already pre-made. And then you heat it up and assemble it when you get it. I host a fantasy football draft with all my buddies, and so I started ordering the sandwiches every year for our draft at the end of summer. There are a couple other guys in the league that are from Kansas City. They’re especially excited because they know about the place already.I just got this Big Green Egg and a book of Big Green Egg recipes. I’m really looking forward to trying to figure out how to use it, because I want to be one of “those guys.” I’d like to be really good at mixing drinks, at making things in a smoker, in a Big Green Egg, and all that stuff. My kids make fun of me because I just sit in front of the computer and watch Big Green Egg YouTube videos. Maybe once I really get it down, I’ll be able to make my own version of the Z-Man Sandwich.Explore Bon AppétitBarbecueKansas CityCelebritiesRead MoreLifestyleWe Cooked Cacio e Pepe With Kiernan Shipka and Had a Very Fun TimeBy Ali FranciscultureI Don’t Care What You Say, Bread Is The Most Important Part of a MealBy Paul W. DownsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Paul Rudd", "As Told To Alyse Whitney"]}