{"id": "612f3dda77e94af45f7111fdfedd4dfc", "url": "https://www.bonappetit.com/story/instant-dashi", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Instant Dashi Is My Secret Weapon to Turn Up the Flavor in Any Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Storebought Seasoning Is My Secret Flavor WeaponInstant dashi adds max flavor to any dish, fast. By Sohla El-WayllyDecember 2, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailDashi is the building block for some of the most delicious foods. The deeply flavored broth is made by steeping kombu, a type of dried kelp, and katsuobushi, a dried and aged tuna. When combined in water, the two transform into a savory, lip-smacking base for anything from miso soup to a barely set steamed custard. Although dashi comes together relatively quickly compared to other long-simmered broths and stocks, there’s an even faster shortcut to flavorful broth, and that’s instant dashi.Instant dashi is to dashi what a bouillon cube is to chicken broth. While dashi is subtle and subdued, instant dashi is a cartoon drawing with all the features enhanced and hyper-expressive. But sometimes all that noise is just what you need to liven up a dull dish. It’s made from powdered bonito, which is amped up with MSG and other flavor enhancers. There is no steeping or straining required—one teaspoon easily dissolves into a cup of water—but to appreciate the true power of instant dashi, you should go beyond soup. I like to think of it as another spice in my arsenal, useful any time I need to add meaty depth to a recipe or just turn up the volume on flavor in any dish.The instant dashi I always reach for is produced by the Japanese company Ajinomoto, whose founder, Kikunae Ikeda, developed it to recreate the savory flavor in his wife’s dashi. The company’s instant dashi powder, Hon Dashi, is available at Asian markets or online.Because of its convenient powdered form, instant dashi can be sprinkled right into any number of things from scrambled eggs to popcorn. My all-time favorite way to use for instant dashi is to simply boil potatoes in it, simmering the water all the way down until I’m left with a finger-licking salty dashi crust all around them.Instant dashi is also the key ingredient to these savory dinner oats, which I developed specifically to showcase this powerful powder. Someone a long time ago decided that oatmeal belonged in the breakfast category, but I think that chewy, hearty, steel-cut oats need more airtime in our lives.For my dinner oats I start by sweating scallions, garlic, and ginger in butter until tender and aromatic, before stirring in steel cut oats, water, and instant dashi. It all simmers together until the oats grow creamy and tender, creating a cozy base for any number of toppings. Here I’ve kept it simple with some crispy vinegar-dressed veggies, but just like congee or polenta, savory oats are the perfect canvas for poached eggs, meaty sautéed mushrooms, or a full fridge clean-out. And if there was still doubt about oatmeal’s place at the dinner table, the instant dashi makes it clear that these oats belong there.Oats: It's what's for dinnerDashi Oats With Crunchy VegInstant dashi powder gives so much savory umami flavor to the oats that this porridge can easily be served for dinner. View RecipeExplore Bon AppétitHealthyishDinnerRead MoreLifestyleSpicy Tomato Chicken Stew Is Here to Dominate Soup SeasonBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-02", "author": ["Condé Nast", "Sohla El-Waylly"]}