{"id": "613370823d0c7f7e1d2996bbca6c6747", "url": "https://www.bonappetit.com/recipe/spicy-baked-pasta-with-cheddar-and-broccoli-rabe", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Spicy Baked Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueSpicy Baked Pasta With Cheddar and Broccoli RabeBy Alison RomanFebruary 11, 20204.3(57)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintThis baked pasta from Alison Roman reminds her of broccoli-cheddar soup, “a taste I enjoyed as a child and have been chasing for the better part of my adult life, but better and with lots of texture,” she says. Her recipe offers the familiar comfort of baked macaroni and cheese but with pops of pleasantly bitter bright green broccoli rabe throughout. Breadcrumbs are extremely not optional here—they provide much-needed crunchy bits. Serve alongside a crisp salad with a simple vinaigrette to balance out the richness of the pasta.Ingredients6–8 servingsKosher salt1lb. rigatoni, ziti, or fusilli8Tbsp. extra-virgin olive oil, divided3large leeks, white and pale green parts only, halved lengthwise, thinly sliced into half-moonsFreshly ground black pepper1tsp. (or more) crushed red pepper \tflakes2bunches broccoli rabe or 3 bunches baby broccolini, trimmed, coarsely chopped1cup heavy cream12oz. sharp white cheddar, coarsely grated (about 3 cups), divided1cup chopped chives, divided1cup coarse fresh breadcrumbs or panko (Japanese breadcrumbs)PreparationStep 1Preheat oven to 425°. Bring a large pot of water to a boil, then add a generous amount of salt. Cook pasta, stirring occasionally to keep it from sticking together, until just barely al dente, about 2 minutes less than package directions. Drain pasta, reserving 1 cup pasta cooking liquid.Step 2While you are cooking the pasta, get the broccoli rabe going. Heat 5 Tbsp. oil in a large Dutch oven or other heavy pot over medium–high. Add leeks and season with salt and black pepper. Cook, stirring occasionally, until leeks are softened (but not so much that they don’t have any texture left) and starting to brown, 8–10 minutes.Step 3Add red pepper flakes to leeks and stir to incorporate. Add broccoli rabe by the handful, stirring to combine and allowing each addition to wilt before adding more. Season with salt and black pepper. Once all of the broccoli rabe has been added, cook, stirring occasionally, until bright green and wilted, about 2 minutes. Remove pot from heat and set aside.Step 4Add pasta to reserved broccoli rabe mixture along with cream, three-quarters of the cheese, ½ cup chives, and reserved pasta cooking liquid; mix well. Season with salt and black pepper and add more red pepper flakes if you prefer more heat (keep in mind that the saltiness and spiciness will increase as the pasta bakes).Step 5Transfer pasta to a 3-qt. baking dish (or, if your Dutch oven is ovenproof, just leave it in there). Toss breadcrumbs and remaining 3 Tbsp. oil in a medium bowl until coated; season with salt and black pepper. Scatter over pasta, then sprinkle evenly with remaining cheese. Bake until pasta is bubbling across the entire surface and breadcrumbs are deep golden brown, 30–35 minutes. Let cool slightly.Step 6Scatter remaining chives over pasta just before serving.How would you rate Spicy Baked Pasta With Cheddar and Broccoli Rabe?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangleFantastic!  I pretty much made it as written, except used heavy cashew cream, vegan shredded cheese, and used scallions, white and green, for the chives.  Since it’s just my partner and I, so I cut the recipe in half, used about 1/4 c scallions, and used smooth penne.  I tested the prepared mixture before baking for seasoning.  Adjust to taste.  The  1/2 t pepper flakes were perfect.  Not too spicy, just a nice heat.  I would serve this for a dinner party.  Relatively quick to assemble and bake.  My panko topping was very VERY golden at 25 minutes, so check around that time.  I wouldn’t change a thing!  EmmieChappaqua NY10/20/2021HI! Would you guys say 6-8 servings is an adequate description? Going to make this for friends on Sunday - will be 6 or so. Thanks!MBLos Angeles, CA9/23/2021This was good (and very quick to make!) but w/ modifications as other reviewers suggested: add garlic to the leek mixture; TASTE the milk/pasta water  and salt to taste (our end dish was under salted); add lemon zest and juice from half lemon;  add 1/2 c to 1 cup additional liquid (it was a bit dry for my taste).K GravyCA3/1/2021I’ve made this a bunch of times!! Love this recipe! My favorite so far is fussili + broccoli rabe combo. I recently made it with less pasta and I liked it even more, might go lighter on the cheese next time too for a lighter version. HIGHLY RECOMMEND!QuestSophiaNJ2/15/2021I even screwed up the proportions on this recipe and it still turned out great. While eating the leftovers yesterday, my partner said, \"this is like restaurant food.\" My breadcrumbs started browning too quickly so I just covered it with foil for most of the bake time. I had to use a more shallow casserole dish and I think the foil kept it both from burning and drying out. I'm making it again this week!Ashley AILinköping, Sweden1/24/2021Wow this was great! I used collard greens instead of broccoli rabe and it was the perfect level of bitter. I also used gluten free pasta and gluten free panko and everything tasted beautifully.AnonymousKansas City12/31/2020I thought this dish was delicious! I made it with a sharp white cheddar and gruyère cheese. I added a bit of lemon juice to the leek&broccolini mixture. I found it needed a bit more heavy cream than called for. I added a bunch of chives, but didn’t really measure. I do know it wasn’t a full cup. I also added more chili flakes because I like a bit of spice. The only thing I’d do differently in the steps is add my breadcrumbs/panko after if comes out of the oven. It lost its crunch when mixed with the cheese. This is a definite keeper. LisaChicago 12/28/2020The only changes I made were using broccolini instead of broccoli rabe, and adding lemon zest to the breadcrumbs. Both alterations were delicious! Would make this again. FernLos Ángeles, CA12/26/2020I made the recipe as directed and would say it’s alright. It tastes pretty good but there’s some missing in the flavors. Someone suggested adding lemon zest and I think acid would help balance it so I may try that, otherwise would probably not make again. SamanthaDavis, CA12/21/2020This is another hit recipe by Alison Roman that I now make almost weekly in my house.  I can get broccoli rabe and leeks at my supermarket year round, and I don't care if they come from Mexico.  I love this dish too much.  It's got a good creamy but textured vibe and a strong, spicy allium taste that I like.  I am sure it would work with any substantial green, but I really love it as is.\nThe only time I altered it was once when I couldn't find chives, so i used scallions and another time when my heavy cream seemed suspect, so I used a can of Evaporated Milk from my pantry, and both times were absolutely fine.  \nAgain, I always go with the Broccoli Rabe, but the first time I made it I cut the bushy tops off to add in and then put the stems in whole.  While all wilted perfectly in the dish, the fibrous stems were a bit silly to chew on (like a cow with cud in it's mouth), so I do suggest cutting the stems in half rather than leaving them whole.  Broccolini with probably also be perfect, but if going with just broccoli, I would suggest a good steaming before adding to dish.  They will probably not wilt as much during the cooking time so the steaming should help soften, unless you like them crunchy.  I like the broccoli and cheese vibe she suggests, so that's why i stick with the recipe as written, however, it would probably be delicious with any hearty green of your choice.EricJMAstoria, NY12/9/2020I’ve made this twice, once as stated in the recipe, and the 2nd time I altered it slightly! Both were delicious! I couldn’t find broccoli rabe the second time making it, so we went with broccoli I and kale- I would highly recommend this combo, as well as adding a pinch or two more of the red pepper flakes! We love this recipe in my house!AnonymousNew York, NY11/30/2020I’ve made this recipe about 4 times since it came out and my family LOVES it. It’s creamy with a hint of spice and the vegetables give it great texture. I think I probably only use about 1/2 cup of chives total? I can never find broccoli rabe, so have used broccoli and broccolini and been happy with both. Salt should be to taste - dip one of your cooked pastas in the cheese sauce to make sure you are happy with it. I find it bakes better in a 9x13 than a Dutch oven, and if it’s browning or drying out too quickly, cover it with foil.\n\nIt freezes beautifully for a make-ahead meal. Take it all the way through tossing it with breadcrumbs and sprinkling it with cheese, then cool it down and freeze it. To bake from frozen, I’d recommend letting it bake for about an hour around 425ish, covered with foil until the last 15 minutes.AnonymousHouston, Texas9/27/2020This recipe was EXTREMELY delicious!! I cannot wait to make this again! The spice was perfect! AnonymousDallas, TX6/9/2020We love this recipe and I have made it as written many times but the hubs doesn't love broccoli raab so more often I make it with brocolini or regular broccoli (or kale!). This is a pretty easy recipe to vary with good results. Green garlic is in season right now so using half that and half leeks...and fresh out of red pepper flakes but the farm box had a couple of serranos :)\nFor those who found it too salty, note that no amount of salt is specified in the recipe! So the salt is really to your own taste...cheese has a fair bit of salt in it. \nlouise62San Francisco5/17/2020This was amazing!! Didn't make any changes to the recipe & it was great. AnonymousLondon, UK5/2/2020Explore Bon AppétitMac and CheesePastaAmericanRigatoniPasta & NoodlesBroccoli RabeVegetableCheddarCheesePenneFusilliMainNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Alison Roman"]}