{"id": "61345e93ca77f5f679e42eb00b030dec", "url": "https://www.bonappetit.com/story/leftovers-day", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Leftover Turkey Pot Pie is the Best Dish to Make With Thanksgiving Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTuck Your Thanksgiving Leftovers into a Cozy Turkey Pot PieThe greatest hits of your leftovers, all under one pie dough roof. By Alison RomanNovember 26, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Even if you love Thanksgiving, you’ve gotta admit, it’s a real to-do. But you know what’s not a to-do? Leftovers Day, the second best food holiday of the year.Held one to three days after Thanksgiving, Leftovers Day is…the day you eat all your leftovers. It’s a great way to ensure you aren’t stuck with a spoonful of stuffing or weird turkey parts in a ziplock bag that someone (me) can’t bring themselves to part with. My favorite way to celebrate is with other people, everyone gathered under one roof to clean out fridges and compare stuffings. Think of it as a Friendsgiving but without having to roast another turkey.This holiday can be as low-maintenance as opening a few plastic containers and drinking the rest of the wine you overbought, but occasionally I like to pull out all the stops, which is to say pile everything into a baking dish, cover it with dough, and bake it at 425° until golden brown and bubbling. Sound like a pot pie? That’s because it is, made from the greatest hits of your holiday table.Here’s how leftover turkey pot pie works: Combine leftover turkey (picked into bite-size pieces), roasted or sautéed veg (fennel, carrots, squash, mushrooms, etc.), and any herbs you didn’t use up (coarsely chopped) in a baking vessel of your choice (13x9\" baking dish, 2-qt. oval, anything goes). Mix in any extra gravy or thin leftover mashed potatoes with turkey or chicken stock until the consistency is looser than gravy (it’ll thicken as it bakes). If you still have pie dough, use that to top it off, or try store-bought puff pastry.Either way, do not forget the egg wash on top—even leftovers deserve to get dressed up.You know what leftovers go well with?How to Keep All That Party Booze Cold—Without Using Your FridgeWhen Alison Roman hosts, the wine goes in the bathroom, not the kitchen.View StoryExplore Bon AppétitParty TricksLeftoversThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-26", "author": ["Condé Nast", "Alison Roman"]}