{"id": "613aa03ee246323cd6ffcc4ea03e68cc", "url": "https://www.bonappetit.com/recipe/clean-out-the-fridge-kimchi", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Clean-Out-the-Fridge Kimchi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClean-Out-the-Fridge KimchiBy Diana YenSeptember 12, 20214.9(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis is an easy Napa cabbage–based kimchi recipe that also makes use of any end-of-the-week crunchy veggie scraps you might have in the fridge—think bruised fennel bulbs, leftover cauliflower florets, and radishes that may have seen better days. Everything gets coated in a spicy gochugaru paste before the kimchi is packed into jars and fermented at room temperature until it’s perfectly tangy. (To make this recipe vegan, substitute fish sauce with 1 Tbsp. soy sauce, 2 tsp. white miso, and 1 tsp. water whisked together in a small bowl.) Burp your kimchi baby daily to let any built-up gases release, and give it a taste to see how the flavor gets tangier by the day. Once you’re happy with the results, store the jars in the fridge and you’ll have a spicy sidekick for grain bowls, eggs, and stews for weeks to come. Use it in any recipe that calls for kimchi, such as Inside–Out Kimchi Grilled Cheese, Kimchi Lentil Stew With Poached Eggs, and Kimchi–Sweet Potato Fritters. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron1 Quart Glass Jar$13 At 32-Ounce Mason JarStainless Steel Mixing Bowls$26 At AmazonMeasuring Spoons$10 At Bon Appétit MarketIngredientsMakes about 1½ quarts1head of Napa cabbage (about 2 lb.), outer leaves removed, cut into 2\" pieces¼cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt12\" piece ginger, peeled, finely grated5garlic cloves, finely grated2Tbsp. fish sauce1Tbsp. soy sauce1½tsp. sugar2–5Tbsp. gochugaru (coarse Korean red pepper powder) or other mild red pepper flakes2scallions, cut into 2\" pieces1lb. mixed firm vegetables (such as radishes, carrots, cauliflower, fennel, green beans, and/or turnips), cut into bite-size piecesSpecial EquipmentThree 1-pint glass jars or two 1-qt. glass jarsPreparationStep 1Place cabbage in a large bowl and sprinkle salt over. Massage into leaves with your hands until cabbage starts to release its liquid. Pour in cold water to cover and let cabbage soak 1 hour.Step 2Drain cabbage, reserving 2 cups brining liquid. Rinse cabbage in 3 changes of water, then drain well and transfer back to bowl.Step 3Mix ginger, garlic, fish sauce, soy sauce, and sugar in a small bowl to form a smooth paste. Stir in gochugaru (use 2 Tbsp. for a mild kimchi and up to 5 Tbsp. for an extra-spicy one).Step 4Add paste, scallions, and mixed vegetables to bowl with cabbage. Toss everything together with your hands (foodsafe gloves are welcome here) until cabbage and vegetables are evenly coated with paste.Step 5Tightly pack kimchi into jars, pressing down firmly to eliminate air bubbles and release more liquid from vegetables, leaving 1\" headspace at the top. If there isn’t enough liquid to completely submerge vegetables, top off with reserved cabbage brine. Cover jars tightly with lids and let sit at room temperature away from direct sunlight, opening jars to let gases release once a day, for at least 1 day and up to 5 days to ferment (the longer the kimchi sits, the more sour it will be). Give kimchi a taste as you go and add a splash of fish sauce or soy sauce as needed. Once you’re satisfied with the flavor, transfer jars to the refrigerator, where the kimchi will continue to slowly age.Do ahead: Kimchi can be made 1 month ahead. Keep chilled.How would you rate Clean-Out-the-Fridge Kimchi?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHow long does this keep in the refrigerator?AnonymousMinnesota 11/27/2021Fish sauce, don't like it, anchovies and red shrimp goes better with my stomach. Just a preference.AnonymousHilo, hi9/18/2021Explore Bon AppétitNapa CabbageCabbageLeafy GreensVegetableKosher SaltGingerHerbs & SpicesGarlicFish SauceSoy SauceSugargochugaruGreen Onion ScallionSnackCondiment/SpreadVeganVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-12", "author": ["Condé Nast", "Diana Yen"]}