{"id": "613b3fbd46139d14bd46a3693e5b926a", "url": "https://www.bonappetit.com/recipe/ruffled-milk-pie-with-raspberries", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Ruffled Milk Pie With Raspberries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueRuffled Milk Pie With RaspberriesBy Samantha SeneviratneJuly 6, 20214.8(49)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintGalatopita, or ruffled milk pie, is a Greek dessert in which phyllo is baked directly into a simple custard. It’s prepared in stages so the top stays buttery and crisp while the bottom turns into a sort of phyllo bread pudding. This version from baker Samantha Seneviratne is studded with raspberries for bursts of tartness throughout. “This dessert has so many textural contrasts,” Seneviratne says, “with crunchy phyllo tops, juicy berries, and creamy custard. Fresh raspberries add a welcome tartness to all the sweetness in the mix.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8x8\" Baking Dish$15.99 At AmazonSilpat Roul' Pat$88 At AmazonPastry Brush$9 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonIngredients8 Servings½cup (1 stick) unsalted butter, melted, plus more for pan1¼cups fresh raspberries10–12sheets frozen phyllo pastry, thawed1Tbsp. plus ½ cup (113 g) granulated sugar2large eggs2large egg yolks1cup whole milk½cup heavy cream1tsp. vanilla extract1tsp. ground cinnamonPowdered sugar (for serving)PreparationStep 1Heat oven to 400°. Butter an 8\"-diameter or 8x8\" baking dish. Scatter one third of raspberries over bottom of dish.Step 2Place phyllo on a surface; cover with a barely damp kitchen towel. Working with 1 sheet, brush butter over 1 side. Carefully scrunch up to bring long sides together to make a rope, then wrap into a coil. Try not to smash pastry down; you want to keep it tall and somewhat loose. Place in center of prepared pan. Repeat with remaining phyllo and butter, placing coils around the one in the center. Scatter remaining berries over and sprinkle with 1 Tbsp. (13 g) granulated sugar.Step 3Bake until pastry is golden brown and crisp, about 20 minutes. Remove from oven; reduce oven temperature to 350°.Step 4Whisk eggs, egg yolks, milk, cream, vanilla, cinnamon, and remaining ½ cup (100 g) granulated sugar in a large bowl to combine. Pour custard over pastry and bake until custard is set, 20–30 minutes. Serve pie warm or at room temperature, dusted with powdered sugar.How would you rate Ruffled Milk Pie With Raspberries?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleIs there a video?AnonymousHighland, MI2/24/2022I didn't see a video for this recipeAnonymousFlorida1/29/2022Great recipe made twice, second time with cherries, came out delicious! \nOnly tip, stay loose with the phyllo. AnonymousCape May, NJ9/25/2021where is the video????\nAnonymousMinneapolis, MN9/11/2021I followed the instructions and my dessert looked just like the picture, but the center was like glue instead of custard! I baked it for 25 minutes and it tested done- just like the video….after one piece I threw it out- even my dessert loving hubby wouldn’t eat it. So disappointing.RGDC9/7/2021Wonderful wonderful.  A totally satisfying sweet and sour cake.  It was great for breakfast, lunch and dinner.  The raspberries gave it a sweet and tangy taste which combined with the custard like filling of a Dutch Baby, the satisfaction of a soufflé, sweet and sour but not too sweet and not too sour.  Thank-you for sharing this recipe with us.  It is a real keeper.Carol FiulNapa9/6/2021It sounds very easy...but not sure about custard part... doesn't  seem like it's cooked enough.But l will try it.\nThank you LizAnonymousnew york9/6/2021now that it's almost fall do you think it will work with apple pieces or ripe pear pieces?elaineNYC9/5/2021Super easy and good - I had a hard time determining how much phyllo to use because the sheets of phyllo in the video looked much larger than the ones I bought 🤷‍♀️ if I make it again I need to use may more phyllo PollyMurrieta CA9/2/2021I made this but with fresh blueberries and peaches. It was SO good, light, and pretty quick to pull together especially on a warm summer night! My raw phyllo broke and cracked everywhere because I was impatient with the thawing process (also definitely didn't bother to cover them with anything, just tried to work quickly). I cobbled together \"sheets\" with broken off pieces and just loosely wrapped them together and you honestly couldn't tell the difference in the finished product. So if you are worried about cracked dough, don't be. I also didn't have powdered sugar so added more granulated sugar on the top at the end and it was great, especially with some vanilla ice cream on the side. I'll be making this again with raspberries and adding some basil and lemon to the custard mix. This is definitely a keeper! Alexandra RabeLafayette, CA8/20/2021To Joyce of San Diego and Tina of Darnestown - check out the instructional video by Samantha for this recipe.  A different technique than the written recipe is shown.Anonymous8/15/2021Next time I'd add more sheets of phyllo (I thought I'd be overdoing it) to make sure there are enough crispy bits on top. It didn't take any special techniquie to 'ruffle' the phyllo - get it damp, scrunch it up, softly squeeze it into the pan.\nWorked great in a square 8x8. Didn't have raspberries, strawberries worked very well. Kate CbaPittsburgh, PA8/3/2021This is delicious, I made the mistake of making it in a springform pan though, so a lot of the custard leaked out.  Even still, my family gobbled it up.  I'll definitely make this again (in a proper baking dish!)  next time I will add a bit of lemon zest to the custard to brighten it up just a smidge.  Even if you don't make perfect rosettes with the phyllo it still looks beautiful.  AnonymousNew York8/2/2021Just made this, It's fantastic. wouldn't change a thing. except maybe add more berries to the bottom layer. \noh and my Filo was REALLY thin and delicate, so i doubled up some of my rounds, still came out perfect. TJ7/27/2021Looks great but picture shows ruffled filo on top.  Instructions indicate otherwise.  Am I misreading?\n\nAlso, please cover your unused filo with plastic wrap instead of a damp towel.  No matter how little water there is on the towel it will still muck up the filo.  I’ve been working with filo for over 60 years.  Tina Darnestown, Maryland 7/26/2021Explore Bon AppétitPieDessertFruit DessertGreekEuropeanPhylloOther IngredientsRaspberryBerryFruitEggSummerNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Samantha Seneviratne"]}