{"id": "614045dd6000f38c5d627e9c144bba31", "url": "https://www.bonappetit.com/recipe/classic-bananas-foster", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Classic Bananas Foster Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic Bananas FosterBy Kendra VaculinFebruary 23, 20224.8(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintBananas Foster is an old-school dessert that looks and tastes significantly more complicated than it is, making it an ideal meal-ender when you’re strapped for time but still want to show off. The original bananas Foster recipe was invented for Owen Brennan's restaurant, Vieux Carré, in the 1950s. This New Orleans classic consists of caramelized bananas and a pyrotechnic rum sauce that delivers all the tableside drama.If you’re hesitant about tackling a flambéed dish at home, that’s understandable! But with a few tablespoons of rum contained in a skillet (off the heat) and a long-reach lighter or long match to keep you away from the flames, you’ll get all of the wow factor and flavor with none of the danger. Slightly underripe bananas work well here, as they soften nicely in the caramel sauce but maintain their shape while cooking. While the toasted pecans aren’t traditional, they add delightful crunch.Vanilla ice cream is the classic accompaniment, but you could also spoon the saucy mix over waffles, crepes, French toast, or even toasted slices of banana bread.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Skillet$60 At AmazonTongs$13 At AmazonSmall Rimmed Baking Sheet$28 At AmazonIngredients2–4 servings3Tbsp. pecans4Tbsp. unsalted butter, cut into pieces¼cup (packed; 50 g) dark brown sugar½tsp. ground cinnamon¼tsp. ground cardamom½tsp. vanilla extract2bananas, halved lengthwise, then crosswiseKosher salt3Tbsp. dark rum (80–100 proof)Vanilla ice cream (for serving)PreparationStep 1Preheat oven to 325°. Toast 3 Tbsp. pecans on a small rimmed baking sheet, tossing halfway through, until slightly darkened in color and fragrant, 10–12 minutes. Let cool, then coarsely chop.Step 2Heat 4 Tbsp. unsalted butter, cut into pieces, ¼ cup (packed; 50 g) dark brown sugar, ½ tsp. ground cinnamon, and ¼ tsp. ground cardamom in a medium skillet over medium-high, whisking constantly as the mixture bubbles, until butter is melted and incorporated, about 1 minute. Add ½ tsp. vanilla extract and cook sauce, continuing to whisk, until slightly thickened, about 30 seconds.Step 3Arrange 2 bananas, halved lengthwise, then crosswise, cut side down, in pan and cook, shaking pan occasionally, until lightly browned, 30–60 seconds. Using tongs or a small spatula, turn bananas over and sprinkle cut sides with kosher salt. Cook, shaking pan occasionally, until bananas are browned and coated in sauce, 30–60 seconds. Remove from heat.Step 4Drizzle 3 Tbsp. dark rum (80–100 proof) over bananas and sauce. Using lighter, carefully ignite sauce and flambé, shaking pan occasionally, until flame goes out.Step 5Top with scoops of vanilla ice cream and scatter pecans over.How would you rate Classic Bananas Foster?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertFruit DessertBananaFruitPecanNutRumAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-23", "author": ["Condé Nast", "Kendra Vaculin"]}