{"id": "6145079bc985ca7ddb2db5bb6bdce559", "url": "https://www.bonappetit.com/story/impossible-burger-recipe", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Impossible Burger Recipe Attempt Because Now Is the Time for Absurdist Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Tried to Recreate the Impossible Burger Because Now Is the Time for Absurdist CookingSoy leghemoglobin, what art thou?By Rachel Sugar May 13, 2020FacebookTwitterEmailCourtesy of Impossible BurgerFacebookTwitterEmailIn I Did The Thing, Rachel Sugar sacrifices her time and her sanity in the name of wellness \"research.\" This time, she tries to replicate the highly manufactured, lab-derived Impossible Burger.There is no need to make an Impossible Burger. Even in the olden days, when there were restaurants, menus were saturated with the plant-based burger so persuasively meat-like its very existence ought to be impossible. They were available at Burger King, White Castle, and The Cheesecake Factory. Impossible’s primary meatless rival—the also-implausible Beyond Burger—were at Denny’s, Dunkin’, and the Marriott. Wherever you went, there was an unlikely burger to greet you.Now, they are available via delivery from these same fine and mediocre restaurants. The FDA has even relaxed restrictions to allow restaurants to sell five-pound Impossible Bricks and vacuum packs of patties directly to consumers. This month, the burgers rolled out at 1,700 Kroger Co. grocery stores. So even amidst this current crisis—even as the supply chain crumbles around us—there is still no need to reproduce Impossible meat at home.This is great. The liberating promise of processed food is that you can’t possibly do it better than the pros, with their patents and their isolates and unspecified natural flavors. So why try? Trying is exhausting. Instead, sit back. Relax. Enjoy modernity.But who can relax? I am uncomfortable in a state of relaxation, generally. This used to be a semi-distinguishing characteristic, like being tall, or disliking the city of Boston, but now it is simply the human condition. Now that we are all anxious, and many of us are, for the first time, housebound—some of us privileged enough to be quarantined with an excess of time and an absence of care-taking responsibilities—baking sourdough has become very popular. That’s fine. Is it strictly necessary? Not really! Bakeries still exist, and are great at bread-baking. But that’s irrelevant. The appeal of a good do-it-yourself project is not that it is practical, but that it is evidence of your own mastery over the physical world.I’d seen that people on the internet were making their own plant-based burgers that they claimed were reasonably Impossible/Beyond. I felt the way mountain climbers are said to feel about Everest: called. I chose Impossible, because the challenge is right there in the name. I’ll show you what’s possible! I thought.My first task was to choose an Impossible-alike recipe that would guide me on my mission. I narrowed it down to three contenders. And after reading that my first choice had made one commenter and her entire family “violently ill,” I narrowed it further, to two.Both recipes used TVP—textured vegetable protein, a classic vegetarian ground-beef substitute that looks like a cross between couscous and the rocks you put at the bottom of a fish tank. What’s great about TVP is that it is readily available. I bought two bags. The next ingredients on the recipe lists were similarly available: beet juice, tomato juice, dried shiitake mushrooms, and Xanthan gum.From there it went downhill fast.The thing that is immediately apparent when considering the ingredients of the Impossible Burger is that it is not meant to be made at home. The Impossible Burger is not a hamburger recipe, but a technology. It is VC-funded and lab-derived. It is made, primarily, out of soy protein concentrate, coconut oil, sunflower oil, and natural flavors. Also, potato protein. Also, heme, which, in the Impossible case, is soy leghemoglobin, a plant-based version of the molecule that gives meat that deep umami tinge of blood.You can’t get soy leghemoglobin because Impossible Foods produces it themselves “via fermentation of genetically modified yeast.” The bloggers understand these potential hurdles—they can’t ferment their own heme, either—and promise to capture the essence of the burger with appropriate substitutions. So I bought the suggested blackstrap molasses whose “sharp bloody quality” was supposed to stand in for the heme. I bought seaweed flakes, which were supposed to help infuse my “umami broth” with adequate umami.Then came a whole lot of products I did not know existed, in nature or elsewhere. For example, potato protein, which is protein from potatoes, and, I now know, is sometimes used in horse feed.I also learned about konjac flour, a powerful binding ingredient that is big in weight-loss circles, mostly because it is entirely indigestible and therefore has no calories. Amazon sells it, but it is not cheap (if we get one thing out of this period it will be familiarity with the fringes of questionably scammy online-only wellness-oriented grocers). Soy protein, not the same as soy protein concentrate, is easy to find, but mostly comes in enormous quantities, and takes three weeks to ship even under normal circumstances.It went on like this. I began looking for substitutions for the substitutions. It is, I think, important to know your limits. I used pea protein instead of potato protein. Instead of konjac flour, I used potato starch.Everything finally on hand, I was ready to mix my gums. I mixed my proteins. I blended and strained my umami broth and added it to the TVP, which had already been “revitalized” with a whole cup of molasses-infused beet juice. I froze a whole cup of coconut oil and then grated it into oily flakes that would mimic the unctuous fat-pockets of beef. (Coconut oil: Impossible ingredient number two!) The resulting patties looked unsettlingly purple, probably on account of all the beets. I was prepared for them to crumble as they cooked, the recipe warned they might. I was not prepared for them to taste so much like molasses-infused beets. The flavor wasn’t meaty, exactly, but perhaps it did capture the taste of decay? I wondered if I should have sprung for konjac flour.My next attempt was much more successful, mostly because it was much less ambitious. This time, I rehydrated the TVP with vegetable broth and blended it with cooked short-grain rice, liquid smoke, various spices, more bouillon, potato starch (for binding), grated beets (for color), and A1 sauce (for meatiness), and more coconut oil. There was no heme-like element, except for when I stuck my hand in the food processor before I’d taken the blade out (I’m fine).And it worked! Sort of. The patties looked reasonably burger-adjacent, and while they didn’t develop that caramelized burger-y crust, they did hold together, pinkly. They were too mushy and too salty—I may have misunderstood the bouillon instruction. I certainly over-blended. I probably used the wrong kind of pan. But I ate one and enjoyed it, and the next day I ate another. And then, on the third day, my boyfriend gently suggested we eat something else.I’d done it; technically, I had summited. I had tasted the victory of accomplishment, even if “accomplishment” did not taste exactly how I’d hoped. The Impossible Burger, as I should have understood, is not a facsimile of the fatty, dry-aged beef monument you get at fancy “taverns.” It is, rather, part of that all-American canon of gloriously processed junk. And just as you can make a transcendent real-meat burger but can’t capture that soupçon of the industrial in a McDonald’s patty, an Impossible Burger, with its faint industrial tang, is only and ever the product of a beaker.Does that mean my creations were mere homespun veggie patties? Not at all! In many ways, they were much worse! (The fat pockets were fun, though.) Under ordinary circumstances, I would suggest you make an actual veggie burger out of plant-based vegetables instead.But these are not ordinary circumstances, and while I cannot in good conscience recommend the burgers, I highly recommend the quest. It was nice to have a pointless project that took a lot of pointless time. In this way, the homemade Impossible-adjacent Burger, with its endless list of obscure ingredients, is a jigsaw puzzle, only more educational. (You’ll learn about equine nutrition and ketogenic diets, for example.) I appreciate the Impossible Burger on a deeper level now that I understand exactly what it is, which is Impossible. And I look forward to someday having one that is prepared by someone else.Explore Bon AppétitHealthyishI Did the ThingessayRead MoreLifestyleI Tried the Wim Hof Method to Find Happiness Through Suffering By Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-13", "author": ["Condé Nast", "Rachel Sugar"]}