{"id": "614c306b744b192c0438928922c8da18", "url": "https://www.bonappetit.com/recipe/paneer-with-burst-cherry-tomato-sauce", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Paneer With Burst Cherry Tomato Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPaneer With Burst Cherry Tomato SauceBy Sohla El-WayllyMay 17, 20204.7(39)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sohla El-Waylly EmailPinterestPrintEmailPinterestPrintThis dish of saucy, seared paneer channels the flavors traditionally found in matar paneer—coriander, cumin, chile, and ginger—into a quick-cooking cherry tomato sauce that's packed with bright spring-y sugar snap peas. If you can’t find paneer, give this a try with another sturdy non-melty cheese like Halloumi or queso fresco. Or think of it as a simple sauce you can serve over any protein, like a crispy-skinned salmon fillet, seared shell-on shrimp, sliced feta, or even just a bed of salted yogurt. We strongly recommend buying whole coriander, cumin, and mustard seeds. Not only is their flavor fresher, but they also offer pops of texture throughout the sauce. If you need to substitute ground spices, use ¾ tsp. each (and skip the black mustard, which is hard to find pre-ground).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketWooden Spoon$6 At AmazonParing Knife$10 At AmazonLarge Skillet$84 At AmazonFish Spatula$14 At AmazonIngredients2 main-course servings or 4 side-dish servings8oz. paneer6scallions11\" piece ginger2garlic cloves1tsp. coriander seeds1tsp. cumin seeds½tsp. black mustard seeds½tsp. Kashmiri chile powder or ¼ tsp. cayenne powder¼tsp. ground turmeric4oz. sugar snap peas (about 1 cup)3Tbsp. extra-virgin olive oil, dividedKosher salt12oz. cherry tomatoes (about 2 cups)Pinch of sugar (optional)½cup (lightly packed) mint leavesCooked rice (for serving)PreparationStep 1First, prep your ingredients. Slice 8 oz. paneer into generous ¼\"-thick planks and pat dry; set aside.Step 2Trim roots from 6 scallions and discard. Thinly slice on a deep diagonal and place in a medium bowl. Scrub and thinly slice a 1\" piece ginger. Stack ginger slices and slice crosswise to make strips the size of matchsticks; add to bowl with scallions. Peel and thinly slice 2 garlic cloves; add to bowl.Step 3Using a mortar and pestle or the side of your chef’s knife, coarsely crush 1 tsp. coriander seeds and add to vegetables. Mix in 1 tsp. cumin seeds, ½ tsp. black mustard seeds, ½ tsp. Kashmiri chile powder or ¼ tsp. cayenne powder, and ¼ tsp. ground turmeric; set aside.Step 4Using a paring knife or your fingers and working one at a time, snap off tips from stem ends of 4 oz. sugar snap peas (about 1 cup) and pull to remove strings. Repeat process on the other end. Cut any larger sugar snap peas in half on a diagonal; set aside.Photo and Food Styling by Sohla El-Waylly Step 5Now, bring it all together. Heat 2 Tbsp. extra-virgin olive oil in a large skillet over medium-high until shimmering. Arrange reserved paneer in a single layer (just a heads-up that you are only browning one side) and cook until golden brown underneath, about 1 minute. (If paneer is sticking, just give cheese a little more time to brown. It will release from pan once it is sufficiently crisped.) Using a slotted fish spatula or spoon, transfer paneer to a plate, leaving as much oil behind in pan as possible. Arrange browned side up and season generously with kosher salt.Photo and Food Styling by Sohla El-Waylly Step 6Set pan over medium heat and add remaining 1 Tbsp. extra-virgin olive oil along with reserved scallions, ginger, garlic, and spices. Cook, stirring often, until scallions are wilted and mustard seeds begin to pop, about 2 minutes.Step 7Add 12 oz. cherry tomatoes (about 2 cups), reserved snap peas, and 1 cup water. Increase heat to medium-high, season with salt, and bring to a simmer. Gently smash each tomato open with fish spatula or spoon (gentle is key; you just want to break them open a little) and simmer until tomato juices thicken slightly, about 3 minutes (it should still be pretty brothy and light).Photo and Food Styling by Sohla El-Waylly Step 8Taste sauce and add more salt if needed. If your tomatoes aren’t super sweet, you may need to add a pinch of sugar at this point to balance their acidity. Add paneer back to pan and simmer until warmed through.Photo and Food Styling by Sohla El-Waylly Step 9Remove from heat and mix in ½ cup (lightly packed) mint leaves. Serve with cooked rice.Photo and Food Styling by Sohla El-Waylly How would you rate Paneer With Burst Cherry Tomato Sauce?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleThis is really good, but I always use halloumi. The one time I used paneer as written, it was quite bland, despite salting the slices liberally after frying. I recently made a saag paneer in which the cheese cubes were marinated with 3T oil, 1t salt, 0.5t cayenne, and 0.5 turmeric, and the cheese turned out quite nice by itself--so I would try marinating if you only have paneer!GCBoston, MA2/9/2022forgot to add to last review - double the peas or add more greens (beans?) - SO GOOD ! sara.bbVancouver, BC2/2/2022SO GOOD SO SEXY SO FRESH! I do halloumi instead of paneer cause I’m a salty girl. I’ve made this so many times over and think about it all the time. Don’t skip the mint! THANKYOU SOHLA!sara.bbVancouver, BC2/2/2022From the U.K. and which is on the 3rd generation of spice trading- still a pleasure to receive correspondence from others and paneer whilst I have made with lemon juice as a test, the recipe says have a go and Asda’s Paneer is going to be tried. The Mexican alternative is not available. Cheese 🧀 eating is not something associated with spices and so the journey begins as opposed to cheese and tomato 🍅 sandwiches invented by an English person! AnonymousU.K. 11/4/2021I hate to be one of those annoying people that reviews a recipe after adapting it heavily... but I want to applaud Sohla for creating a recipe that's forgiving and simple, but also exciting and fun to eat. I dumped in a mix of old tomatoes and even some crushed tomatoes from the fridge, added a bell pepper, used regular curry spice instead of her blend and subbed edamame for snap peas (it's grocery week, LOL) BUT I *did* have the paneer which was just so delightful. It really worked. I'm sure doing the recipe with no mods is even more scrumptious! Anonymous3/8/2021We liked this but maybe slightly less than expected given the rave reviews. I've never cooked with paneer before and I didn't appreciate that it's pretty bland, not salty like halloumi so you really need to season the dish well to avoid it all being a bit underwhelming. Topping with salted yoghurt and quick-pickled onions gave it a boost!pottsy.1990London, England7/29/2020Insanely delicious and versatile. Couldn't get paneer so I subbed tofu, but I bet feta would be good too. This has made its way into our regular rotation. AnonymousMinneapolis7/19/2020I feel bad about being one of those people who rate a recipe after substituting half the ingredients, but here I go: I currently live in rural scandinavia and couldn't access (or afford) a lot of the ingredients. I substituted halloumi for paneer, frozen green peas for fresh snap peas, canned cherry tomatoes for fresh and mixed grains for rice. I have no doubts it would have been better had I used the real stuff, but it was still a really tasty take on matar paneer.\n\nMainly posting this to encourage other people who might not have the cash to spend on snap peas or whatever. It's still gonna be good!yucateco4everLidköping, Sweden7/15/2020This recipe was beautiful on a hot summer day (a rare case for Indian/Indian-inspired food!). If you grew up eating matar paneer like me, don't expect an equivalent. The basis is similar, but with a brighter, lighter and fresh approach. It was hard for me to get my mom's matar paneer out of my head when I made this, so I did find myself adjusting slightly: increased spices (but same ones listed) by almost double, cooked down the broth longer to be thicker and richer, and added a small pat of butter to finish. Added both cilantro and mint to finish. Eat with fresh pita or any flat bread for a perfect Indian indulgence on a summer night. alishakhannaNew York, NY7/6/2020This recipe was a fun excuse to go to my local Indian market and get the whole spices and paneer, which I'd never used before. I didn't have green onion or snap peas, so I subbed with shallot and zucchini. Super good! I feel like I could add eggs and it could be shakshuka. AnonymousLA6/24/2020Made it with Halloumi! Loved it! Thanks Sohla. Anonymous6/20/2020One of the best recipes i have ever tried.Anonymous6/20/2020This recipe is so good! It strikes me as extremely riffable. I did not have whole coriander or cumin and substituted the ground version of both with great success. The only thing I might change the next time I make it is the amount of water I add. I felt like the end product was more brothy and less saucy, which, as someone trying to cut down on rice intake, is not ideal. Super tasty and perfect for a light lunch!AnonymousBay Area, California6/17/2020Easy, fast, very riffable! Super delicious. I didn't have sugar snap peas and was too hungry to search long in my fridge for a replacement, so I just skipped. I didn't have mint but I had cilantro and basil, which paired beautifully. I used halloumi rather than paneer. All of my spices were pre-ground. Truly, very flavorful and forgiving. Next time, I'd probably add a chili. The sauce would be great over any number of protein options. This is a winner! Easy/fast enough for a weeknight dinner, but special enough for company too. Nytasha TarverOakland6/15/2020This might be the most creative and genius recipe I've ever seen! I’ve made it 3-4 times already, and it is perfection. Relatively simple to put together quickly, but, at the same time, the final product is so impressive. \n\nI live in a rural place where I can’t get paneer, so I make my own, and this recipe is a perfect way to showcase the fresh paneer and really show-off. Will be making it again and again. \nAnonymousIdaho6/14/2020Explore Bon AppétitIndianSouth AsianAsianCherry TomatoTomatoVegetableSugar Snap PeaPeaPaneerCheeseEasyQuickWeeknight MealsMainGluten-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-17", "author": ["Condé Nast", "Sohla El-Waylly"]}