{"id": "61507012fe0add744454b491856899b7", "url": "https://www.bonappetit.com/story/tamagoyaki", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Tamagoyaki is a Japanese Omelette Made of Sweet or Salty Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Layer Upon Layer of Seasoned Egg, Make TamagoyakiJapanese omelets are primarily responsible for my outlandish egg consumption.By Chihiro TomiokaNovember 2, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Japanese kitchens go through a lot of eggs, and mine is no exception. If it’s 8 p.m. and the pizza shop is closed, I’m probably making tamagoyaki, a squat pillow formed by layers of rolled egg that can be savory or salty-sweet. To put it in the savory camp, add a splash of dashi. That addition turns basic tamagoyaki into dashimaki, an izakaya classic that’s just-set and served in thick steaming slices alongside a white pile of grated daikon. Large doses of sugar and mirin, on the other hand, skew it toward the firmer and cake-like tamago you’ve seen at your favorite sushi spot.Making a Japanese omelet barely takes five minutes, so next time you have some eggs and an appetite, follow my lead.Prep Your GearBecause tamagoyaki is just layers of eggs, you can theoretically make it in a small frying pan (preferably nonstick), but a tamagoyaki pan will make this endeavor much easier. The small and rectangular pan makes the eggs easier to roll and will also create the signature rectangular shape.Old-school Japanese cookbooks will tell you that the fundamental seasonings are sugar, salt, vinegar, soy sauce, and miso. I imagine you may have these on hand already. Supplement this group with sake, mirin, and dashi or dashi powder and you’ll be able to easily riff on your tamagoyaki (and you’ll have the makings of many other Japanese recipes to boot). Quick note: Mirin is rice-derived alcohol that is sweeter than sake and used to impart a subtle sweetness and koku (“depth”) to foods. If you don’t have it, supplement your sake with some sugar as a substitute.Assess Your MoodMy go-to tamagoyaki is the salty-sweet variation I grew up with. I add a pinch of salt, a larger pinch of sugar, and a splash of sake into the eggs (you need at least two, and I have gone as high as six) that I’ve cracked into my Pyrex measuring cup. (I omit soy sauce because I want the eggs to keep their sunny hue.) You can also…Lean savory: Use salt and soy sauce, no sugar.Dashimaki: Add about one tablespoon of dashi (reconstituted if you’re using powder) per egg. The eggs become harder to roll with the addition of liquid, so I would recommend trying them first without dashi.Sushi-style tamago: Add the smallest amount of salt and soy sauce, a big splash of mirin, and a scant tablespoon of sugar per egg.Confetti: To any of the above, stir in some sliced scallions.Roll With ItOnce you’ve seasoned your eggs and loosely mixed them (no need for frenetic beating here), set the pan over medium-high heat for a minute. Then generously oil the pan and pour in a portion of your egg, just enough so that you have a thin layer on the bottom of the pan, as if you were making a crepe. This thin layer will form bubbles and quickly set. Take a peek as the edges start to set and begin rolling the eggs away from you towards the other end of the pan. The sweeter your eggs, the more likely they are to brown on the bottom. If this bothers you, make sure you start rolling as soon as the eggs set.Once your rolled-up eggs are at the other end of the pan, pour in another thin layer of the raw egg mixture. Use chopsticks to gently lift up the cooked eggs so that the liquid-y eggs can run beneath them and cook. Then roll the cooked eggs back toward the opposite end of the pan (toward you!), wrapping that just-cooked layer around the original log as you go—the roll will get fatter and fatter as more layers of egg are wrapped around the outside. You’re moving the fat egg log back and forth over the thin just-cooked layer, sort of like a windshield wiper. If the going gets rough, you can always use a soft spatula to nudge it into its characteristic rectangular shape.Continue moving your roll back and forth across the pan across layers of eggs until you have run out of egg mixture. If the shape is not quite perfect when you have finished, wrap it in a clean cloth or sheet of plastic wrap and press it into a more convincing rectangle. Writing this out makes it seem quite complicated, so I recommend watching one of the many YouTube tutorials before you start.ContentThis content can also be viewed on the site it originates from.Remember, practice makes perfect, and if you don’t photograph your imperfect ones, no one will ever know.Time to EatNow that you have your steaming tamagoyaki, how will you eat it? If it’s dinner time, there’s no shame in eating it thickly sliced with whatever vegetables you have on hand. If you have your act together, however... Have it for breakfast with a bowl of natto-topped rice and miso soup (or eat this as breakfast for dinner)Pack thick slices of tamagoyaki into your bento along with some onigiri (onigiri is as simple as shaping freshly shaped rice into balls or triangles with salted, slightly damp hands)Slice thinly and arrange on top of hiyashi chuukaCut your sushi-style tamago into rods and feature them at your temaki sushi partyMake a café-style sandwich (and have it for breakfast)!!! Butter some slices of Pullman bread, add mayonnaise, ketchup, and/or mustard, and some thin slices of cucumber. Top with as many slices of tamagoyaki as you’d like. Wrapping this in parchment paper or plastic wrap and letting it sit for five minutes will allow the sandwich to meld and to slice more cleanly (into triangles, because aesthetics)Chihiro Tomioka buys chocolate chip ice cream for the chocolate chips and has written about all things Japanese at Food52.Ready to commit?Photo by Laura Murray, Food Styling by Pearl JonesIwachu Iron Tamagoyaki Omelette Pan$63 at AmazonExplore Bon AppétitEggOmeletRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-02", "author": ["Condé Nast", "Chihiro Tomioka"]}