{"id": "6157c83c433fee7e0cf83d1383060225", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/bloody-angle", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Bloody Angle Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoBloody AngleClassic cocktails in a romantic rose-tinged setting.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: to slip into another dimension. All of Tokyo’s best bars are little worlds unto themselves, and Bloody Angle is one ruled by dreams of Hong Kong filmmaker Wong Kar-wai. The entire space is hard surfaces and straight lines, softened by red light and vintage American records. You’re in the throbbing heart of the Japanese capital and immersed in a vintage work of Hong Kong romanticism all at once. So light your cigarette, sip your drink, and drift in slow-motion through your own nocturnal fantasy.ORDER THE: drink you love the most, be it an old-fashioned or a gin and tonic. This isn’t a bar that tries to reinvent the wheel with wild new iterations of cocktails. Like the music it plays, the drinks are the classics that you already know and love. But they’re made with the characteristic precision and craft that is the hallmark of the Japanese bar.THE VIBE IS: the low-key, slowed-down after-party. This isn’t the place where your night starts, and it might not be where it ends. But it is somewhere where you find yourself among the hip and the beautiful, taking a breather between dinner and extracurricular carousing.PRACTICAL STUFF: Open Monday to Saturday from 9 p.m. to 3 a.m. Closed on Sundays. The menu is English and Japanese. Some English is spoken by the staff. The nearest subway stop is Shibuya.By Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}