{"id": "6162c61860b596c34670b53d2b45259c", "url": "https://www.bonappetit.com/story/bodies-budgets-and-snacks", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Bodies, Budgets, and Snacks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBodies, Budgets, and SnacksReading and recipe recommendations from Healthyish editor Amanda Shapiro.By Amanda ShapiroSeptember 12, 2019FacebookTwitterEmailIllustration by Daiana RuizFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,We have to talk about snacks.But first, update from last week’s newsletter: Thanks to all your feedback, I got myself a budget on YNAB. I’m four days in, have attended three live webinars, and am thoroughly invested (yes, that’s a pun).Given my newfound obsession with budgeting, this story about how our bodies have budgets really spoke to me. Just like my shiny, new spreadsheet of dollars and cents, our brains manage all our bodily accounts—hormone levels, metabolic resources, other things I don’t understand. And they do a really good job of budgeting in advance of the challenge:“If a demanding situation is predicted, then the brain marshals the body’s resources—changing blood pressure, secreting hormones, metabolizing glucose, and so on—to begin to meet those needs before they arise.”But, as the article explains, if we’re always psyching ourselves up for future demands, we’re setting ourselves up for all kinds of physical and mental health problems. The prospects are even worse for people who experience chronic stress “due to social issues like financial hardship, divorce, or racism.”The point is: If we don’t allow our brains to replenish our bodies' stores, we'll stop spending on all non-essential line items—learning, exercising, having fun, being creative, falling in love. Yikes!One of the ways I’m trying to replenish is by checking in with my body more often throughout the day. Does it need to drink water? Stand up? Pee? (Yes, this is a thing I forget to do all the time.) This week, I’ve been hungrier than usual thanks to an uptick in exercise, so I’ve found myself reaching for more snacks.My default “snack” has always been nut butter straight from the jar. (Current roster in my desk drawer: Ground Up, Rx, Big Spoon Roasters.) It’s a quick and delicious way to curb midday hunger, though, in the last year, I’ve extended my snacking to nut butter bars: ProBars, Perfect bars, more Big Spoon Roasters, and the like. This is all a big wind-up to my point, which is that, this week, Basically editor and Healthyish columnist Sarah Jampel made my dreams come true with a homemade nut butter bar recipe. It’s everything I want in a bar: soft, dense, and just-sweet-enough, with plenty of nut butter plus fun stuff like pumpkin seeds and dried fruit.They’re a great snack, sure. But I’ll definitely eat them for breakfast, and, on those full-throttle, no-end-in-sight days like today, it’s a safe bet they’ll work as lunch.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterSnackessayRead MoreLifestyleIt's Good to Be BackBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-12", "author": ["Condé Nast", "Amanda Shapiro"]}