{"id": "6169ad785bd9ea5b4bc898272fecb1f6", "url": "https://www.bonappetit.com/story/marinated-canned-beans", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "Transform Canned Beans with a Fast, Flexible Marinade  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Fastest, Freshest Way to Transform Canned BeansA simple, flexible marinade provides the rom-com-worthy makeover those cannelinis were waiting for.By Aliza AbarbanelNovember 5, 2021FacebookTwitterEmailPhotograph by Julian Cousins, Food styling by Adriana PaschenFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’m not a psychic, but I know that there are probably canned beans in your pantry right now. Canned beans are rightfully celebrated as a shelf-stable, inexpensive, versatile source of protein. Throw them into chili! Fold ’em into a luxuriously creamy vegan pasta sauce! Blend ’em into hummus! Smash ’em into sandwiches. The possibilities are just about endless. But sometimes, we do away with the theatrics and just marinate them.  Marinating—a.k.a. popping the can, rinsing the beans, and drowning them in olive oil (plus any aromatics, herbs, and spices you have on hand)—is a quick and adaptable upgrade that requires very little from you and your pantry. It also doubles as a great way to stretch any herbs and vegetables that might be on their way out: A slick of oil prevents oxidation, meaning you can keep those beans in the fridge for days, where they’ll make for a hearty and healthful work lunch, a tasty-at-room-temp picnic food, or a speedy party appetizer. They are versatile enough to be enjoyed warmed up over toast or cold from the fridge and tossed in a sturdy salad.While you don’t need more than a few glugs of good olive oil and vinegar to start marinating, white beans like cannellini, navy, or Great Northern can take on a wide range of assertive flavors that will only get better with time. Go ahead and improvise with what you have on hand, but keep these tenets in mind:Bloom your spicesStart by heating your olive oil in a medium skillet. This isn’t the place to skimp on the fat, which will carry the flavor of your spices and alliums and give the beans a more luxurious mouthfeel: Aim for about ⅓ cup oil per two 15-oz. cans of beans. Next up, add a few types of spices—try whole spices like mustard seeds, fennel seeds, cumin seeds, chile flakes, or nigella seeds and/or ground spices or blends like coriander, smoked paprika, five-spice, or za’atar—and cook, stirring frequently, until they begin to pop or, in the case of ground spices, become darker and more fragrant. Whole spices will add bursts of crunchy flavor, whereas ground spices will coat each and every bean. In both instances, blooming the spices in fat not only unlocks their deepest, most aromatic flavors but also infuses the oil itself.This is also a good time to add any woody herbs—like rosemary or thyme—as well as bay leaves, curry leaves, or large peels of citrus zest.Brightland Olive Oil Duo$74 at BrightlandThen add aromaticsOnce your spices are bloomed in oil, pull them off the heat and grate in garlic and citrus zest (as opposed to sizzled peel, fresh zest will provide a more direct citrus punch—the small particles disperse throughout the beans itself). Add your favorite allium, like finely chopped shallots, red onions, leeks, chives, or scallions.Break out the beansWhile you could make beans from dry for this, canned work just as well (and are a whole lot faster). Drain and rinse those canned beans (this is a scenario in which you don’t want that gloppy goop). We particularly like white beans in this application—their mild, buttery flavor means that they can accommodate a wide array of accessories—but other varieties of beans (black, pinto, cranberry, etc.) will also work well. Whichever beans you choose, add them to a heatproof bowl—or, if you’re planning to save them in the fridge for later, a heatproof storage container. To the beans, you can also add other ingredients that like to be marinated—olives, cubes of feta, hunks of goat cheese, roasted peppers, roasted garlic cloves. Pour the oil and spices on top of the beans while the fat is still hot in order to imbue them with the most flavor while simultaneously softening them up. Don’t forget fresh herbsA shower of bright herbs will add a layer of freshness. If possible, aim to use at least ¼ cup of finely chopped tender herbs (like mint, parsley, cilantro, chives, and/or dill) per can of beans.Up the crunch factorTextural variation keeps beans from entering mush territory. Any sturdy, crisp produce you’ve got in the back of your fridge can lend a satisfying bite: chopped celery, shredded brussels sprouts or Napa cabbage, sliced radishes, finely chopped fennel (use those fronds as your herb component!), sugar snap peas. Or turn to your pantry: Add toasted breadcrumbs, panko, or, for a fatty-toasty hit of flavor, roasted and roughly chopped nuts like pistachios, walnuts, or almonds. Add something (anything!) acidicJust as if you were making a vinaigrette, you need acid to balance all of that oil with something sharp and tangy. A few splashes of fruity vinegar—white wine, sherry, or apple cider—will do the trick, as will lemon juice or any number of briny condiments. Think capers, yuzu kosho, peperoncini, chopped pickled green beans. Seize this opportunity to excavate the contents of your fridge, and all of those jars of leftover pickle brine, olive brine, and preserves.Deploy in different waysThe next time you’re debating what to eat for lunch or dinner, let that jar of marinated beans do the heavy lifting for you. Bulk up a leafy salad or grain bowl—in this Radicchio, Bean, and Feta salad, the marinade becomes the dressing. Or add some beans to a taco or pile them atop toast smeared with ricotta. Take them into dip territory—scoop up with chips or crackers—or toss through pasta or pasta salad. Or, just transfer those beans to a big bowl, add a fork, and dig in—no extra cooking required. Since the flavors meld as they sit, these beans will be even better the next day—a true gift to your future self, if you can manage to leave any uneaten.Marination nation:Radicchio, Bean, and Feta SaladThe solution to legume doom: This citrusy marinated bean salad with crunchy greens and big chunks of salty feta.View RecipeExplore Bon AppétitBeancookingRead MoreCoronavirus5 Ways to Zhoosh Up the Sweet Potatoes in Your PantryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-06", "author": ["Condé Nast", "Aliza Abarbanel"]}