{"id": "616ebfdbf73b26db37731c4a1e924a1c", "url": "https://www.bonappetit.com/story/rice-and-greens", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "Rice and Greens Is the Dish I Make When I'm All Out of Dinner Ideas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I’m All Out of Dinner Ideas, I Make One-Pot Rice and GreensStarch plus vegetable equals endless opportunity.By Ali Slagle November 18, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailThere are some parts of life—brushing teeth, taking a shower, drinking water—that are not showy but wholly essential, often performed without much thought or gratitude. I consider making a weekly pot of rice and greens one of these life skills.This habit caught on at the start of the pandemic, when I needed both starchy comfort and an antidote to starchy comfort. Even better that it was a dish I could make with staples I’d purchased the last time I went to the market, however long ago that was.Rice and greens goes like this: Make rice. However you make rice—in a rice cooker, on the stove, or in the oven—do that. It could be white or brown, short-grain or long-grain. You could even use another grain, like farro, couscous, quinoa, that can be cooked via the absorption method, where the grains fully absorb the liquid.While your rice is cooking, prep one bunch of dark leafy greens, like kale, escarole, mature spinach, or Swiss chard (avoid baby, delicate greens). Remove and compost the stems, then rip the leaves into big pieces.When your rice is done cooking, it needs to rest. Leaving rice to sit after cooking, off the heat and covered, ensures that the moisture redistributes so that all the little grains have a uniform texture. Otherwise, the rice might be mushy on the bottom and dry on top.But while the rice is resting, it can also be multitasking. The steam captured in the pot or rice cooker is hot enough to cook greens (or anything else that steams in 5–10 minutes). After taking the rice off the heat, quickly pile the greens on top of the rice and put the lid back on. Rice apparently requires 15 minutes of resting time for perfection, but I usually wait five minutes for good enough. Uncover the pot, season the greens with salt, and then fluff them into the rice. In one pot, ready at once, you’ve got two of cooking’s greatest building blocks, ready to be dressed up and retooled however you see fit.Some weeks I’ll make a pot of rice and greens, add some soy sauce, furikake, maybe (big maybe) an egg, and we have dinner. The next night I might simmer some of the rice and greens with beans and their starchy liquid for soup. And for the last of the batch, I’ll crisp it in a hot skillet, throwing in whatever else needs to go. Other times I’ll make the rice pilaf-style with ground spices and a fat slab of butter, or I’ll add a can of drained chickpeas.Rice and greens has shimmied slyly into my routine, buoying me through the day, shifting based on what I’m craving and what ingredients I have on hand. Its benevolence is quiet and fierce. Even at my least creative, white rice and kale steaming together in a pot felt—feels!—comforting, dependable, essential. This is a life skill for which I am truly grateful.Ali Slagle is a recipe developer, stylist, and writer. Her first cookbook, ‘I Dream of Dinner (So You Don’t Have To),’ will be out in the spring of 2022.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-18", "author": ["Condé Nast", "Ali Slagle"]}