{"id": "6177f6f5b2d8a238b3aa92e674b739ac", "url": "https://www.bonappetit.com/story/how-to-clean-shrimp", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "How to Clean Shrimp | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Clean ShrimpThat poo (sorry!) has got to go.By Sarah JampelNovember 16, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailYou went to the store to procure ingredients for Shrimp and Salami Pasta and you came home with a bag of frozen shrimp only to realize that they’ve got shells, veins, legs, and everything—it’s all there. So this is it: the moment you learn how to clean shrimp.But first, congratulations. While you can buy shrimp that’s already been peeled and deveined by a machine, they’re a little rough and ready—neither as plump nor as pristine as shrimp you clean yourself. Plus, handling the shrimp at home allows you to stockpile those shrimp shells, which are a source of great flavor in seafood stocks for bisque, stew, risotto, and the like. (If you’re wondering about the frozen thing, yes, we do recommend frozen shrimp. Since shrimp is often processed and frozen on the boat or the farm, even the “fresh” shrimp at the store has been previously frozen.)While cleaning shrimp—i.e., removing the shell and the dark vein—isn’t as simple as, say, cleaning herbs, it’s easy to master and there are lots of ways to do it. This is what works well for me (and makes me feel like a masterful surgeon), but with a bit of practice you’ll figure out the method that’s fastest and neatest for you,\\ too.Here’s how to clean shrimp:First, remove the shell. One option is to use brute force to rip off the legs (along the inner curve of the shrimp), then pry apart the shell by getting your thumbs underneath and cracking it away from the crustacean as if you’re taking off its coat (and you are, kind of).Photography by Isa Zapata.  Food Styling by Cyd McDowellI prefer, however, to use a small pair of kitchen shears (this petite pair from Joyce Chen is perfect for tasks like this). To do so, insert the tip of one blade underneath the shell at the top along the outer curve, then snip toward the tail. If you want shell-on, deveined shrimp (for BA’s Best Shrimp Cocktail, for example), pause here and skip to the next step.Otherwise, peel back the shell from either side—you can take the legs off with it—and either discard or save for stock. At this point you can leave the tail on (a convenient handle for shrimp served as finger food) or remove it (perhaps a nice touch if the shrimp is getting incorporated into a soup or pasta).Photograph by Isa Zapata.  Food Styling by Cyd McDowellThen remove the vein. The dark vein that runs along the back of the shrimp is actually the end of its digestive tube. So no, it’s not a vein in the sense of a human vein and yes, it’s filled with shrimp digestive material (okay fine, it’s poo). Anyway, the vein, while not harmful for humans to consume, can be gritty and taste a bit grimy (also, it’s not cute). While you don’t have to remove it from small shrimp, a good rule of thumb is: If you can see it, remove it.To do so, make a shallow cut with the shears or a paring knife along the shrimp’s back. If you’ve already used your shears to remove the shell, you might not need to cut any deeper. Use the tip of the paring knife or scissor blade to get under the dark vein and gently tug it out from the top. Since the vein is fairly elastic, it often comes out in one piece. If it breaks apart, simply pick it up and finish the job.Only one question remains: Now that your shrimp are all squeaky clean—ready to be seared, pilaf’d, poached in ghee, or doused in a dilly cream sauce—when’s the last time you took a shower?Ready for your shrimp:Shrimp and Salami PastaIf plopping an entire stick of butter into a pot of noodles is your idea of a good time (it’s definitely ours), this saucy shrimp and salami pasta is for you.View RecipeShrimp ScampiThis shrimp scampi recipe gets an extra punch of garlicky flavor from a short marinade before cooking. Serve it with bread to sop up the rich pan sauce.View RecipeShrimp and Grits With Fennel PotlikkerA bowl of velvety grits and saucy shrimp with Carla Hall’s herbaceous potlikker at the base of it all.View RecipeExplore Bon AppétitSeafoodcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-16", "author": ["Condé Nast", "Sarah Jampel"]}