{"id": "6178e2596fa3a83b8291176b27d56ba8", "url": "https://www.bonappetit.com/story/egg-sandwich-onion-bacon", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "This Breakfast Sandwich Will Save You From Your Sunday Morning Hangover | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Egg Sandwich Will Save You From Your Sunday Morning HangoverIt’s easy to throw together on a weekday too.By Chris MoroccoApril 9, 2019FacebookTwitterEmailPhoto by Alex Lau, Food styling by Sue LiFacebookTwitterEmailAt first thought, the bacon, egg, and cheese seemed in no need of a Healthyish makeover. Beautiful and satisfying, the combination of wrinkled kaiser roll, bouncy eggs, and congealed cheese seemed best left alone. Why mess with something that had never wronged me, never let me (or my hangover) down?But when my editor Amanda Shapiro wondered what a healthier breakfast sandwich would even look like, I couldn’t stop trying to figure it out. And then came the breakfast sandwich from the L.A.-inspired all-day café west~bourne in Soho. In place of mayo or cheese, it had shallot-infused labneh. In place of meat, it had a layer of deep-fried pickled onions that gave the sandwich its much-needed dose of umami. Which made me think, what if the onion was the meat?So I cut fat rings of red onion, coated them with soy sauce and garlic powder, and roasted them until they were jammy-crispy-leathery (in a good way). Using a red onion is key because it’s sweeter than other varieties and therefore better suited to caramelizing into thick bacon-ish rings that are charred on the outside and buttery on the inside. This onion “bacon” is good enough to eat on its own and special enough to make the rest of the sandwich—creamy scrambled eggs with big folds and sharp cheddar cheese—more than just stuff on toast.The bread question still bugged me though. West~bourne’s sandwich comes on an oversized English muffin, breaking free of the squishy deli bun paradigm, but I was intent on having something with whole grains. I found a gem in the freezer section of my local food co-op: Food for Life’s 7-sprouted grain English muffins. Dense, nutty, chewy, immensely satisfying, and unmistakably healthy, it’s the kind of English muffin I used to watch my parents eat with the scandalized expression of a child who prefers bread simple and white.That left just a few remaining details. As Andy Baraghani pointed out early on in the development process, if I was going to make a healthy breakfast sandwich, I better include something green. So I took some green Cholula and, mixed in chopped basil. Et voilà: a hot sauce that’s cleansing and vegetal rather than just hot and salty.And since breakfast sandwiches are most critical on sleepy-eyed Sundays and frantic weekdays, I knew I needed to make it simple too. The onion bacon clocks in at about 40 minutes (about 35 minutes too long for any morning, no matter how leisurely), but—here’s the kicker—you can make it a week in advance. Since you don’t even have to reheat the onions before you assemble the sandwich, all that’s left to do is scramble eggs, slice cheese, and toast the English muffin—totally doable for a Wednesday and less time-consuming than walking to the bodega and fishing a five-dollar bill out of your bag. If that’s not a healthy (or healthier) start to the morning, I don’t know what is.It's the most important meal of the day:Healthyish Breakfast SandwichesYou may not mistake these jammy-crisp, slow-cooked onions for bacon, but they are truly exceptional as a stand-in.View RecipeExplore Bon AppétitHealthyishBreakfastScrambled EggsSandwichRead MoreLifestyleRejoice! Breakfast Blondies Are Here to Make Your Mornings BetterBy Anna StockwellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Chris Morocco"]}