{"id": "618356830b2a6ddb1be6a2c5c3edb961", "url": "https://www.bonappetit.com/recipe/yogurt-marinated-chicken-with-borani", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Yogurt-Marinated Chicken With Borani Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueYogurt-Marinated Chicken With BoraniBy Andy BaraghaniFebruary 9, 20214.7(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Yudi Ela, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCombining spices in a fat and heating them up until they sizzle results in a super versatile oil. This cooking method, known as blooming, is found in several dishes across many cultures, from cacio e pepe to salsa macha to dal. In this chicken, Andy Baraghani blooms paprika, coriander, and cumin in oil, which seasons a garlicky yogurt marinade and tops off borani, an Iranian cucumber-and-raisin-studded yogurt, served alongside. Any coriander will work, but we love the Nile coriander from Burlap & Barrel, which “is insanely fresh for a dried spice,” says Andy.Ingredients4 ServingsChicken13½–4-lb. whole chicken, backbone removedKosher salt½cup vegetable oil or extra-virgin olive oil1Tbsp. paprika1Tbsp. coriander seeds, crushed2tsp. cumin seeds, crushed½cup plain whole-milk Greek yogurt4garlic cloves, finely grated11\" piece ginger, peeled, finely grated1tsp. crushed red pepper flakesBorani1medium Persian cucumber, scrubbed, finely grated1cup plain whole-milk Greek yogurt1Tbsp. chopped raisins1Tbsp. fresh lemon juiceKosher saltLemon wedges (for serving)PreparationChickenStep 1Place chicken, breast side up, on a work surface and spread open as much as possible; pat dry with paper towels. Using your palms, press firmly on breastbone to flatten. (You may hear a crack and this means you’re doing it right.) Season chicken all over with salt and set aside.Step 2Pour oil into a small skillet; stir in paprika, coriander, and cumin. Set over medium heat and cook, stirring occasionally, until tiny bubbles form and oil around spices starts to sizzle and is very fragrant, about 2 minutes. (This step extracts oils from the spices, bringing out their flavors.) Immediately pour half of spiced oil into a large bowl; set remaining spiced oil aside for borani. Let oil in bowl cool 5 minutes, then add yogurt, garlic, ginger, and red pepper flakes and whisk until smooth.Step 3Place chicken in bowl and work yogurt mixture all over, getting into every nook and cranny. Cover and chill up to 24 hours, or if you’re pressed for time, proceed directly to the next step.Step 4If chilling chicken, let sit out on the counter at room temperature 1 hour before roasting.Step 5Preheat oven to 425°. Place chicken, breast side up, on a foil-lined rimmed baking sheet and roast, rotating baking sheet halfway through, until chicken is cooked through and deeply golden brown, 40–50 minutes. Let rest 15 minutes before carving.BoraniStep 6While the chicken is resting, toss cucumber, yogurt, raisins, and lemon juice in a medium bowl to combine; season with salt. Pour reserved spiced oil over borani.Step 7Serve chicken with borani and lemon wedges for squeezing over.How would you rate Yogurt-Marinated Chicken With Borani?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleHands down one of the best chicken dishes I’ve ever made. AnonymousWashington DC3/28/2021I loved this!  I added more garlic, because we love garlic, and I used smoked paprika rather than just plain.  And because my oven is broken, we grilled it on the Weber.   Marinated it for 4 hours - but next time I think I will marinate it overnight.  Definitely a keeper and will be made again.CaseySilver  Spring MD3/16/2021Love this recipe and will be making again. I ended up marinating the chicken overnight and roasting in between Monday Zoom meetings. Easy breezy and super tasty. Went back and forth about what to serve it with but ended up shredding the chicken and serving with the borani on flatbread (ok, it was flour tortillas). Topped with some quick-pickled red cabbage and a whisper of fresh dill. Restaurant quality, people!AnonymousChicago3/16/2021This was YUM! I didn't even marinate the chicken for long, just rubbed on the marinade and popped it in the oven. Served with naan to catch all borani juice. DawnzeeOakland, CA3/3/2021Explore Bon AppétitIranianMiddle EasternChickenPoultryEasyWeeknight MealsMainNut-FreeGluten-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Andy Baraghani"]}