{"id": "618cbfcd00f28d93d91edee02ff94f4f", "url": "https://www.bonappetit.com/story/halibut-in-garlic-cream", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Make This Halibut Recipe That’s Slow-Roasted in Garlic Cream, Because It Was a Hard Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSlow-Roasted Halibut in Garlic Cream, Because It Was a Hard WeekA guaranteed method for never overcooking your fish—plus, this recipe kiiiind of tastes like chowder.By Alyse WhitneyOctober 5, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailThe hands-off method for slow-roasting fish in the oven is tried and true for me. Instead of babysitting a piece of salmon on the stove, I can slide it in the oven for about half an hour and it will poach in olive oil and aromatics until tender, flaky, and never dry. But when fall temps hit and I start to crave comfort food, I’m gonna make our new recipe for halibut and fennel cooked in garlic cream my go-to.Cooking in two pints of cream sounds insane and decadent, because it is. The result is effectively a carbless chowder (fennel subs in for potatoes) that’s filling without weighing you down. The slow-cooking cream helps melt away the sharp edges of eight cloves of thinly sliced garlic and bulb of anise-y fennel that go with it, all while keeping the fish tender at the same time. And it only takes about 20 minutes. The best part is that you can choose your own adventure when it comes to the garlic-infused goodness: Go for a little drizzle over the top of the filet, or ladle on a lot to make yourself more of a soup (highly recommended if you’ve had a day). A condiment of an entire lemon (zest + juice), fennel fronds, olive oil, and black pepper goes on top, adding a punch of fresh, bright flavor that cuts through the fat. Just make sure to use a neutral-tasting olive oil (I made mine with super peppery version and it threw things off balance).I served my halibut over polenta to make it taste kind corn-and-fish chowder.\nIdeally you should make this for a group and not have any leftovers (I ate mine over some leftover polenta—also slow-cooked in the oven!—to emulate a fish-and-corn chowder vibe), but should you find yourself with remains, you’ve got options. Senior food editor Andy Baraghani, who developed this recipe, suggests straining the cream, heating it up over low in a large skillet, and letting it thicken slightly (simmer, not boil—it will break!) before dropping in some cooked pasta. Wham: you’ve got a garlicky, cheeseless alfredo sauce (save a little pasta water in case you need to thin it out). Eat it as is, or top with some reheated fennel and flaked halibut. For an even bigger upgraded, you can make a quasi-brandade (a.k.a. salt cod spread) by combining whipped boiled potatoes with the fish, cream, and a bit of olive oil, broiling it, and then spreading it all on toast. That’s dinner one night, and a party appetizer the next.It’s rare to make fish that you want to eat for multiple meals, and maybe my doctor wouldn’t recommend eating this much garlic cream. But after a long day, knowing that I can make a comforting dish in half an hour and have repurposeful leftovers is a win-win. Let’s just say I can’t wait ‘til it’s cold.Get the recipe:Slow-Cooked Halibut with Garlic Cream and FennelWhen garlic is cooked gently in plenty of fat (in this case, cream), it becomes something else entirely.View RecipeExplore Bon AppétitHalibutFishWeeknightCreamGarlicRead MorecookingA Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad BreathBy Amanda ShapirocookingThe Garlic Broth Recipe That Brought Me Back to HealthBy Chris MoroccocookingThe Slow-Roasted Fish That Packs a Lot In One Baking DishBy Rachel KartencookingHow to Cook Fish in the Oven Perfectly Every TimeBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-05", "author": ["Condé Nast", "Alyse Whitney"]}