{"id": "618de9b76f511c7e78d0105f3384c3b7", "url": "https://www.bonappetit.com/story/chef-elena-reygadas", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "A Day With Chef Elena Reygadas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopmexico-cityA Day With Chef Elena Reygadas“She has become one of the main pillars of modern Mexican cuisine.”By Claudio CastroDecember 10, 2018FacebookTwitterEmailPhoto by Cody JamesFacebookTwitterEmailIt’s 8 a.m. on Friday morning, and there’s a 20-person-deep queue of artists, writers, and office workers waiting outside of La Panadería, a tiny bakery tucked into Colima Street in Mexico City. They’re here for the buttery croissants, traditional white-and-black conchas, flaky pain au chocolat, and the famed guava rolls filled with creamy ricotta. All beautiful pastries, which need restocking at the bakery, by chef Elena Reygadas.Down the street, a stream of bakers run out of Rosetta, Reygadas’ Italian-inspired restaurant, carrying trays of the baked goods into La Panadería. Reygadas, 42, joins the parade of pastries. She stands just a little over five feet tall and wears a wool sweater and bell-bottom jeans—no chef coat or clogs in sight. She’s just dropped off her two daughters at the elementary school a few blocks away, and now she’s in work mode. Carefully moving through the busy and tiny kitchen of La Panadería, Reygadas checks on an extra tangy sourdough made with pulque and talks to a cook about a candied pumpkin pastry idea.A cross-section of a croissant.\nPhoto by Cody JamesReygadas seamlessly weaves together Mexican ingredients with French and Italian techniques—this is what makes her growing restaurant empire in Mexico City so groundbreaking. “She has become one of the main pillars of modern Mexican cuisine,” says Enrique Olvera, the chef behind Pujol in Mexico City and Cosme in New York. “She’s expressing a different kind of Mexican cuisine. Fusion, nuanced, whatever you call it. At the end of the day, it shows you don’t need to follow a formula to be successful.”Reygadas grew up in La Herradura, a quiet neighborhood in the western part of the city, and she learned how to cook from her grandmother during big family gatherings. “The kitchen was my grandma’s domain and I always helped her,” she tells me. After studying English literature in college, she started catering on-set for her filmmaker-brother Carlos Reygadas’s first movie. The team was half European and half Mexican, and she had to find a way to make everyone happy. In the end, Reygadas cooked two differents menus—but her pulque bread, then a home experiment before it became a restaurant staple, was a success all around.“That was the moment I knew I wanted to become a cook,” she says.Reygadas in the kitchen at Rosetta.\nPhoto by Cody JamesSo, she moved to New York City to study at the International Culinary Center, where she fell in love with baking bread and making pasta by hand. She went on to work at Locanda Locatelli, a Michelin-starred Italian restaurant in London. Here she cemented her love of Italian cooking—mostly because of the country’s respect for the best-quality produce—before returning to Mexico City.Initially, she started cooking private dinners for friends and then hosted pop-up events, where her clients were mostly friends and family since what she was doing was technically illegal. As her secret dinners started to fill up and, as she dug deeper into Mexican ingredients like epazote and hoja santa and transformed them into gnocchi or salads, she realized she needed a more permanent home. So, in 2010, she opened Rosetta. It was a hit, especially among the local gallery crowd. “At that time, the restaurant scene was not very active in the neighborhood, so customers were curious and more accepting,” she told me.Inside Rosetta.\nPhoto by Cody JamesAt 10 a.m., Reygadas hits Lardo, her casual café, and tries the oven-baked oatmeal. “This was one of our first dishes we put on the menu,” she tells me. “It’s quite heavy due to the variety of grains, but with the wild berries and almond milk, it actually makes a perfect breakfast.” After, she stops by Café Nin, her newest restaurant with a more fast casual focus (salads, sandwiches, of course some pastries). Chef de cuisine Heriberto Gutierrez gives her a new dish to try: beetroot salad with slivers of mandarin, a dollop of ricotta cheese, and torn basil. “We can actually change the ricotta with some coconut yogurt we just made at Rosetta. I think it will have a better balance,” she tells him.Dishes at Rosetta ready to go out to diners.\nPhoto by Cody JamesIt’s that intense attention to detail, fearless experimentation, and constant curiosity that makes Reygadas a formidable force in Mexico City. It wasn’t until she won the Best Female Chef for the Latin American edition of World’s 50 Best in 2014—before the public outcry over the very existence of the award—that she started getting more recognition. Her name started coming up in conversation alongside Olvera and Gabriela Cámara, and young cooks began asking to stage and work in her kitchens.“Her food is so sophisticated and delicate,” says Gabriela Renteria, a Mexican food journalist, best known for her work in Food & Wine ES and Letras Libres, the literature and culture periodical. “That’s what has made her one of the biggest figures in contemporary Mexican cuisine.”By late afternoon, we’re back at Rosetta, just as the staff starts to prepare for dinner service. Everyone sits down to debrief about service the day before, then Reygadas and the front-of-house team fold napkins and wipe down wine glasses. As the first guests arrive, Reygadas heads back into the kitchen. She stands at the pass, checking on the cucumber salad topped with creamy jocoque (Mexican sour milk), and beef tongue drizzled with a sauce made of chicatana ants. She follows the food out into the dining room, watching as customers dig in, later on wandering over to ask how it was.Forming ravioli.\nPhoto by Cody JamesShe doesn’t return to the kitchen until an hour and a half later, when she’s alerted of a customer request: a cheeseless ravioli. Focused and methodical, she experiments with a filling of  lemon zest, lemon thyme, and butter. “I actually appreciate special requests,” she says. “It makes me realize there is so much more you can do with ingredients.”After testing more new dishes, at 4 p.m. Reygadas runs back to her daughters’ elementary school to pick them up and quickly drop them off at home before returning to Rosetta once more. She does a walk-through of pastry production for tomorrow and calls it a day at 5:30 p.m. It’s been a whirlwind, checking in on all her restaurants and constantly tweaking ideas and dishes along the way. But Reygadas wouldn’t have it any other way.“After living in New York and London, I realize how fortunate I am to live here and to have access to all these wonderful ingredients,” Reygadas tells me. “That’s the new wave of modern Mexican restaurants, a mix of traditional and contemporary techniques without forgetting the most important thing: our roots.”Explore Bon AppétitMexico CityCity GuidesChefsRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Claudio Castro"]}