{"id": "61affb4ff3d660fc401bcc5c2df05ab5", "url": "https://www.bonappetit.com/recipe/salted-watermelon-juice", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Salted Watermelon Juice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Watermelon JuiceBy Molly BazAugust 1, 20184.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThis recipe is a genius way to use up the second half of that enormous summer watermelon you’ve been snacking on. There is truly nothing more refreshing than a cold glass of salted watermelon juice. Oh wait, but what about a salted watermelon margarita? Here’s a recipe for that too. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.IngredientsMakes about 4 cups6cups cubed watermelon (from ¾ of a 6-lb. baby seedless watermelon)¾tsp. kosher saltLime wedges (for serving; optional)PreparationStep 1Purée watermelon in a blender until smooth. Strain through a fine-mesh sieve into a large pitcher or measuring glass, pressing on solids to extract as much juice as possible; discard solids. Mix in salt.Step 2Pour juice into ice-filled glasses. Garnish with lime wedges if desired.How would you rate Salted Watermelon Juice?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangle*Garnish with a shot of tequila and splash of simple syrup*SBGAthens, GA7/1/2021How did I make it this far through the summer without this! Either as a juice or a margarita, this refreshing drink is moving to the top of my summer beverage list!Pittsburgh8/19/2018Explore Bon AppétitAgua FrescaCold DrinkDrinks AllMexicanLatin AmericanWatermelonMelonFruitLimeCitrusSummer5 Ingredients or FewerDrinksNonalcoholicHealthyishFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Molly Baz"]}