{"id": "61b3296376de1c570d7631410ebb6531", "url": "https://www.bonappetit.com/story/christina-chaeys-kitchen", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "A Giant Pancake, Vietnamese Soup, and More From Christina Chaey's Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Giant Pancake, Vietnamese Soup, and More From Christina Chaey's KitchenPeek inside Chaey's week of home cooked meals, including her very official Bean Strategy™By Christina ChaeyMarch 1, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailDear Healthyish friends,I guess I should introduce myself. I'm Christina Chaey, and I’m an associate editor at Bon Appétit where my days could involve anything from editing magazine features to developing recipes to filming videos in the BA test kitchen. No matter what the week throws at me, I'm committed to cooking at home—as often as I can possibly pull it off. And that’s what this newsletter will be about: Every other Sunday, I’ll share the recipes and meals I made the week before, in the hopes that you’ll feel inspired to cook at least a little something, almost every day.This past weekend, for the first time in weeks, I had the very real luxury of a couple of days with zero plans, and so I got up early on Saturday and cooked like I’d never cook again. I baked off a few of Sarah Jampel’s crispy-chewy Salty Buckwheat Chocolate Chunk Cookies and rolled the rest of the dough into little balls to freeze for another day. While making room in my shoebox-size freezer, I found three almost-empty bags of blueberries (note to self: stop doing this) that immediately went into Carla Lalli Music’s giant no-flip blueberry pancake, which is cooked in butter and oil and meant to be cut into thick slices and devoured like a birthday cake, which is exactly what we did.Photo by Christina Chaey A lazy pancake brunch turned into a marathon 36-hour hang with a couple of friends doing, well, not a whole lot: We had an impromptu sleepover, Seamless-ed spicy drunken noodles, watched Miss Americana, Cheer, AND Homecoming, then woke up on Sunday morning with diva fatigue. Craving soup, we riffed on Andrea Nguyen’s recipe for canh, a satisfying and restorative Vietnamese staple that gets its complex flavor from gently sizzled onions and a few good shakes of potent fish sauce, two ingredients I always have in my kitchen. I love the way Nguyen instructs you to “let it casually fit into your lifestyle,” which for us that day meant adding rice noodles and sautéed shiitake mushrooms to the greens and plump shrimp swimming in the savory broth.If you read Amanda’s newsletter last week, you already know we’ve had beans on the mind here at BA. But cooking beans for one is a tricky proposition. I never know how much to make so that I’ll have enough for a week without getting sick of them. My overzealous optimism on Day One quickly turns to resentment by Day Three of eating nothing but beans, at which point I shove them deep in the back of the fridge, where I don’t have to look at them. Still, stowing a quart of velvety Royal Coronas or chickpeas or pintos in the fridge on a Sunday night feels like a kind of emotional security blanket for the week ahead, ready for an emergency lunch plan or 2 a.m. snack.Photo by Christina Chaey This week, my Bean Strategy™ was to invite my friend Sue over for an extremely low-key Monday night bean-based dinner party. My roommate Emma has been sidelined at home with a broken foot since she tripped over her Dansko a few weeks ago (a cautionary tale to me and all my fellow clog-lovers), and the one good thing to come of it is that we now have an excuse to make people come to us—very nice when it’s 30 degrees outside. Since it was only the three of us, I balled out and got a large, gorgeous halibut fillet on my way home to turn into Pan-Roasted Halibut with Herbed Corona Beans. I tossed a pile of thinly shaved kohlrabi with a creamy dressing of crème frâiche, honey, lemon juice, and poppy seeds. Emma made a “casual batch” of hojicha sablés (using Dorie Greenspan’s recipe, but with hojicha instead of matcha). Sue brought a perfect little glazed loaf cake she was testing for a cookbook. And we were all in bed before midnight—the dream.Some of the leftover beans came with me to work for lunch the rest of the week, tossed with the anchovy-and-caper-laced salsa verde that I made on Monday and a side of Seemore sausages, a new line of links that are made with a mix of meat and fresh veggies (think garlicky pork + broccolini). But, like clockwork, by the time Thursday came around I couldn’t bear to eat another bean, and I sent them to purgatory, a.k.a. the aforementioned shoebox freezer. If you’ve read up to here, please don’t let me forget about them for too long.Until next time,Christina ChaeyAssociate Editor, Troubled Bean LoverP.S. As much as I love to cook, there is no world (or week) in which I’m making every meal at home. I’m not superhuman! There was the housemade tofu and perfect crispy broiled fish collars at Hibino in Brooklyn. And the hot pot with a mountain of leafy greens and paper-thin slices of pork at Koryeo Shabu Shabu in Fort Lee, NJ, on a trip to visit my parents. And an extremely good Allagash spelt ale at Gold Star Beer Counter in Brooklyn, because sometimes beer for dinner is the only appropriate choice.Explore Bon AppétitHealthyishWhat's Chaey Cooking?essayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-01", "author": ["Condé Nast", "Christina Chaey"]}