{"id": "61b41d6980be6a1d6cd7e4120e8d5084", "url": "https://www.bonappetit.com/story/hannah-bronfman-body-goals", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Hannah Bronfman on Ditching #BodyGoals and Doing What Feels Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHannah Bronfman on Ditching #BodyGoals and Doing What Feels GoodHow the HBFIT founder and DJ changed her mindset.By Hannah BronfmanJanuary 8, 2019FacebookTwitterEmailPhoto by Kelsey CherryFacebookTwitterEmailIf you could change anything about yourself, what would it be?As I considered how our ideals of beauty and body image are formed, how we are all affected by other people’s standards and beliefs, I began initiating open and honest conversations with the women in my life (beautiful, smart, talented women, I might add) and asking them that one simple question.Most of us went straight to the physical stuff—to what we imagine other people see when they look at us. Nobody wished for a stronger singing voice, the ability to run a marathon, or a higher salary—at first. In order to get there, to what we really wanted and what we were passionate about, we had to muddle through all of our insecurities about our physical forms.It starts out small. It’s so easy to say, ‘I wish I was thinner’ or ‘I wish I was taller.’ ‘I hate my double chin, I hate my arms, I hate my curly hair or straight hair.’ All those minor imperfections, those ugly feet and stubby nails, are crazy-making, and it is crazy to me that we give away so much of our power as women in an attempt to conform to some ideal of physical perfection that is subjective and largely unobtainable. This is something we have to unlearn so that we can take that question deeper. What would you really change?The thing is, unlearning is not so easy. It isn’t just personal. It’s cultural. It’s political. It’s bigger than we are, and we need to see it to rise above it.One of the most-viewed articles on my website HBFIT was called “F*ck the Thigh Gap.” It was about how all these “beauty” standards swirling around us affect the way we see ourselves—and why we should give those misplaced, outdated attitudes the finger. Because that’s not the only gap that impacts how we feel in our lives and about ourselves every day. There are gaps in education and equality. There is a wage gap, where women earn less than men, and black women earn less than  white women.The thigh gap should be the least of our concerns. And yet these social and political issues are not entirely separate from the body issues. If you look at ads from the ’50s, you can see the standard so clearly—it’s all housewives with small waists and A-line skirts and men bossing them around in a way that screams “misogyny” today. Go back further to where women had to wear corsets. For so long, women have been asked to make themselves smaller.I reject the idea that we are all supposed to look the same and that we are supposed to be uncomfortable or unhealthy in order to fit into someone else’s idea of what is beautiful.In this era in this country, we are conditioned to think that a thin appearance is more beautiful than a curvy body. We are constantly fed images that show us that being thin will take us further in society. How many hours have you spent looking in the mirror trying to suck in and imagine what you would look like with a different body?Then there’s the pressure of looking different. Because historically white people had the privilege and power, we have spent centuries watching women with lighter skin get ahead. Women whose skin is darker, who were not born looking like Barbie, have continuously tried to emulate those types of images. This is psychologically stressful, all of the time. How can you feel good on the inside when the world is always telling you that there is something damaged about your outside?I’ll tell you this: It isn’t you who needs to change. It’s the ideas around you that need reshaping so that they can fit you, instead of the other way around. I reject the idea that we are all supposed to look the same and that we are supposed to be uncomfortable or unhealthy in order to fit into someone else’s idea of what is beautiful. I think we are supposed to look exactly like ourselves, and that we can adorn our bodies with whatever clothes, makeup, or style we like if it makes us feel good. It’s your right to stand out, to take up space.We start to drown when we get swept up by emotional waves about other people’s perceptions of our bodies. We devote so much energy to what we look like on the outside that we barely have the energy or space to look inward, which is where we need to focus in order to thrive and achieve our actual goals, not just our #bodygoals.From the book Do What Feels Good: Recipes, Remedies and Routines to Treat Your Body Right. Copyright © by Hannah Bronfman. Published on January 8, 2019 by Harper Wave, an imprint of HarperCollins Publishers. Reprinted by permission.Explore Bon AppétitHealthyishSelf CareessayCelebritiesRead MorecultureHow Hannah Bronfman Stays Healthy While Eating Out a TonBy Julia BlackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Hannah Bronfman"]}