{"id": "61bb219b20597a7830ef0b9d6b4d8843", "url": "https://www.bonappetit.com/story/basic-carrot-cake-loaf", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I Can’t Wait to Make This Basic Carrot Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Can’t Wait to Make This Basic Carrot CakeBecause sometimes basic is best.By Adam RapoportApril 9, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Pearl JonesFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When we launched our site Basically a couple of years ago, our mission was clear: tap into a swelling audience of young people who love food but might not know how to cook.It didn’t quite work out as planned.Turns out you don’t have to be a twenty-something to want to learn to cook. And even if you already do know how to cook, you can still value a simple, well thought-out recipe.Want this letter before it hits the website? Sign up for our newsletter!Take this week’s addition to the site—Molly Baz’s Carrot Loaf Cake. We’re an office that’s passionate about our carrot cake. We have Claire Saffitz’s showstopper version—an elegant layer cake, swooshed with cream cheese frosting and dappled with candied carrots. (But optional raisins! Thanks, but no thanks, says Claire). It’s the kind of cake you serve and then immediately take a bow.Alex LauAnd we have a gluten-free carrot cake which went up on Healthyish last year that people went bananas for (sorry to mix my cake metaphors). It subs almond flour for white flour and introduces a new flavor profile by adding coconut oil and coconut flakes. Our decidedly not-GF staff continues to rave about it.But if I’m going to make carrot cake, I’m not baking either of those. A. I just don’t have the patience or precision to stack and level and frost a layer cake. (Though, I am 100 percent with Claire on the no-raisin thing; I can’t stand ‘em when they get all soft and squishy.) B. I’m not gluten-free, so as alluring as Chris’ riff for Healthyish is, that’s just not my bag—unless I have GF friends coming over for a dinner party.So, Molly’s it is. I stare at the photo and I want to set sail in that sea of cream cheese frosting. I love the fact that she opted for ground ginger and cinnamon, but not cloves or star anise, because Basically recipes have a hard cap at ten ingredients. I watch the step-by-step video presentation of the cake, which Basically offers on all of its weekly featured recipes, and I can totally see myself making it. And c’mon, who doesn’t love a loaf pan?! I still dream about Molly’s crazy-moist pumpkin bread with whipped maple butter, which was hands-down my favorite dessert we published last year (don’t let the “bread” moniker fool you).Photo by Chelsea Kyle, Food Styling by Pearl JonesOn this week’s upcoming Bon Appétit Foodcast (which drops Wednesday), I sat down with Molly, Claire, and Chris to debate the differences between their three cakes. We talked raisins (and walnuts), spices, round cake pan vs. loaf pan, and so on. The only bummer was that none of them brought their cakes to the studio. Apparently they all were busy doing, you know, their day jobs.Which means I’m going straight to eatbasically.com this weekend and I’m going to bake myself that (raisin-less) carrot loaf cake, even if I’m no longer in my twenties and already know how to cook. It’s that good.Get the recipes:Basically Carrot Loaf CakeThe most casual-cool carrot cake of all time.View RecipeExplore Bon AppétitAdam NewsletterCakeRead MoreLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Adam Rapoport"]}