{"id": "61d638a783115029a2d4b0ecbc7a3f75", "url": "https://www.bonappetit.com/story/grated-tomato-sauce", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Stop What You’re Doing and Go Grate a Tomato | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStop What You’re Doing and Go Grate a TomatoIt’s the best way to the best sauce.By Carla Lalli MusicSeptember 12, 2019FacebookTwitterEmailTed CavanaughFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.We ran this genius method for grated tomato sauce in 2016, and I have been grating tomatoes ever since. No dicing, no slicing, no pulsing in a food processor. You can debate the best tomato to use in your marinara—plum, beefsteak, Campari, heirloom, canned?!?—but thanks to chef Ashley Christensen, who shared this trick with us, we know definitively that the easiest way to turn the flesh into sauce-ready pulp is with your 4-sided box grater. You know, the thing that you normally use to shred cheese.Want this letter before it hits the website? Sign up for our newsletter!Why is grating so great? (Sorry, not sorry.) First of all, it eliminates the need to find a knife sharp enough to cut through the tomato skin without smashing it to smithereens, which—let’s be honest—most of us don’t have. The curved cutters on the grater mimic the shredding action of an old-fashioned food mill, but with a lot less equipment clean-up involved. Plus, you can set the grater right into a big bowl to catch all the tomato flesh and juices and keep your cutting board free of all tomato liquid that inevitably runs onto your counter, and then down the front of your cabinet doors. (That’s not just a me thing, right?) Even better, as you scrape the tomato back and forth against the grater’s little blades, the skin will just split apart and peel back in your hand. When the skin is flattened and you’ve arrived at the stem end, you’re done.Michael Graydon & Nikole HerriottBut truly the most wonderful thing about grated tomatoes is how quickly they can be transformed into sauce, which preserves their bright, summery, fresh flavors. For a couple-beefsteak’s worth of tomato flesh, I like to start in a wide shallow pan with about ⅓ cup of extra virgin olive oil and 5 or 6 smashed garlic cloves. Put that over medium heat and cook until the garlic is sizzling, then smash the cloves into the oil and keep cooking until they’re light golden brown. At that point, I usually add a bunch of cranks of black pepper and a big pinch of Aleppo or crushed red pepper flakes, then the tomatoes and a healthy dose of kosher salt. If I have basil on hand, I’ll add a sprig or two (whole, so I can pluck the basil out at the end). Once the liquid reaches a rapid simmer, you can drop your pasta into boiling, salted water. By the time the noodles are done (8 minutes?), the sauce will be slightly reduced and extremely delicious. Put the pasta into the sauce, add a pat of butter if you want, and toss to coat. Serve topped with lots of grated Parmesan, of course.If you find tomato “seconds” at the market—the ones that might be slightly bruised—do this with them. If you want to preserve tomatoes for winter, buy a couple of cut-rate 5-pound bags and grate them, then freeze in jars. If you wanted to add a can of drained chickpeas or white beans to this sauce, that would be amazing, too. Or you could use this sauce to make eggs in purgatory. I gilded a version of this sauce with cooked lobster on my show Back to Back Chef, which was pretty legendary—try with shrimp! Honestly, you could spoon this sauce over a slice of toasted stale bread and call it panzanella soup. Wait. That’s a good idea. I’m doing that.Explore Bon AppétitCarla NewsletterTomato SauceRead MorecookingThis Butter-Roasted Tomato Sauce Makes Me Feel Like Strega NonaBy Aliza AbarbanelcookingI'm Making a Lot of Tomato Toast Right NowBy Adam RapoportcookingAll of Your Canned Tomato Questions, AnsweredBy Sarah JampelcookingAll Other Meat Sauces Look Sadder Since This Spicy Pork Ragù Came Into My LifeBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-12", "author": ["Condé Nast", "Carla Lalli Music"]}