{"id": "61e6087a8c9b344424551d034005b3fd", "url": "https://www.bonappetit.com/city-guides/chicago/venue/old-town-ale-house", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Old Town Ale House Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginchicagoOld Town Ale HouseEvery local’s favorite dive bar in Old TownFacebookPinterestTwitterEmailMatt HaasGO HERE: because you appreciate art, cheap beer, and atmosphere. Or before/after a comedy show at Second City across the street. This is one of the best bars in America—if not, the best. Roger Ebert said it. You might run into Bill Murray when he’s in town. Michael Shannon watched his own movie win an Oscar at the bar. Is that random assortment of dudes not enough to convince you yet?ORDER: a cold bottle of Miller High Life. A pint of Bells Two-Hearted. Daisy Cutter. A vodka soda, if you must.THE VIBE IS: historic. This local haunt isn’t just a dive bar; it’s a museum. Impressive, prolific oil portraiture of (often) naked, scandalized politicians, as well as bar regulars, cover every inch of wall space. Of note, as if you’d miss it: Sarah Palin, in her birthday suit, above the 60-year-old mahogany bar. Old Town Ale House has a friendly neighborhood crowd, with more life experience. Those looking for a bar with huge flat screens and shot specials can hit the Disneyland of sports bars around the block on Wells.WORD TO THE WISE: There’s a quiet moment in the early evening, 5 p.m. or so, when the booths in the window seats have a warm glowing light that can’t be beat. Then wander down to Orso’s on Wells when you need crispy, tavern-style pizza to bring you back to life.PRACTICAL STUFF: Open every day: Monday to Friday, from 3 p.m. to 4 a.m.; Saturday, from noon to 5 a.m.; and Sunday, from noon to 4 a.m. It’s cash only. Bring extra for the jukebox. Don’t let it go silent.—Alex BeggsMatt HaasWE ALSO LOVESportsman's ClubThe best indoor/outdoor bar for simple/spot-on cocktailsRichard's BarStrike dive-bar gold at this cash-only Chicago classicScofflawChicago’s cocktail obsession (with some PBR, too)Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-07-13", "author": ["Alex Beggs"]}