{"id": "61e8e1cd9d152cfbbfa52fc8d508f574", "url": "https://www.bonappetit.com/story/how-to-boil-corn", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "How to Boil Corn So It’s Juicy and Sweet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Boil Corn So It’s Juicy and SweetWhen corn is in season, you want to preserve its natural sugars and pleasing pop. Here’s how.By Alex DelanySeptember 18, 2018FacebookTwitterEmailFacebookTwitterEmailCorn on the cob is one of summer’s simple pleasures, the one vegetable side that we can’t get enough of when it's in season—when it’s cooked properly that is. That’s right: Like many simple things, people do a pretty good job of screwing it up. Learning how to boil corn the right way, so that each kernel is bright and juicy and ready to burst with flavor, is one of the keys to having a good summer. You want to have a good summer? So do we.Let’s get to it. How long do you have to boil corn? Well, it depends entirely on the quality of corn that you’re working with. Are you looking at ears of freshly-picked local corn from the farmers’ market or a roadside stand, or corn from the grocery store that was picked a bit ago and traveled in the back of a truck? Get a big ol’ pot of water on to boil and allow us to explain.See, when fresh corn is at its best, we want to keep it that way, preserving every bit of natural sweetness. When we get extremely fresh local corn, we do this by not cooking it aggressively. All we want to do is heat up the kernels, softening them slightly and making them even more flavorful, but retaining that healthy, juicy pop. So when it comes to boiling fresh corn, the stuff you’d pick up at the farmers’ market, you should only boil it for 2-3 minutes. It doesn’t need any more than that. Promise.In September, corn salad is always the side, no matter the main.\nGrocery store corn, on the other hand, needs a bit longer in the pot. When corn is picked and sits at room temperature (especially if the husks are removed), the natural sugars in the kernels turn to starches. The starches make each kernel tougher and less sweet, which is why they need to be subjected to heat for a longer time to reach a pleasant softness. Out-of-season grocery store corn should boil for 5-8 minutes, depending on how long it’s been sitting. It can obviously be hard to tell exactly how long corn has been sitting around, so tasting it as it cooks isn’t a bad idea.The real moral of the story here, as it is for almost all produce, is that you should buy the freshest, most local corn you can whenever humanly possible. When you start with good corn, the need to fuss and turn it into something else that isn’t there. A couple minutes in boiling water. Some butter. Some salt. That’s it. That’s the real way to soak up the last rays of summer.Corn salsa time is now, when the kernels are juicy and sweet.This Corn Salsa Recipe Is Way More Chill Than Your August VacationNothing fancy here. Just a really damn good corn salsa recipe.View StoryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Alex Delany"]}