{"id": "61e997400d34e5d6c37feae8861ac17d", "url": "https://www.bonappetit.com/recipe/tacos-al-pastor-2", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Tacos al Pastor Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTacos al PastorBy Rick MartinezPhotography by Alex LauMarch 24, 20225.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrint“Tacos al pastor are an institution in Mexico,” writes recipe developer and former BA editor Rick Martinez. “Every grillmaster, taqueria owner, and food cart cook has their version of this classic that fills the streets with the smell of spicy grilled pork with charred pineapple and onion.”The dish may be a signature of Mexican cuisine, but its roots started in the Middle East. In the early 20th century, a large wave of Lebanese immigrants arrived in Mexico, bringing with them a technique for spit-roasting meat and recipes for shawarma. Initially, the dish was made with lamb and called tacos árabes or Arabic tacos. Over time tacos al pastor, which are made with pork and served on corn tortillas, grew from this tradition.For this recipe no vertical spit is required—a grill will do fine. But first, marinate thin slices of pork shoulder (about ¾\" thick) in a bath of fresh pineapple, onion, dried chiles, and more for up to 12 hours. Grill the pork over low heat to help it develop a deep char and caramelization (a.k.a. those crispy bits we’re all after) while keeping the meat tender and juicy.Al pastor means “in the style of the shepherd” and isn’t confined to pork tacos. Inspired by a dish at one of Mexico City’s most beloved restaurants Contramar, Martinez also developed a fish tacos al pastor recipe that’s perfect for an alfresco summer meal.Editor’s note: This recipe was originally published October 8, 2015.Ingredients6 to 8 Servings10guajillo chiles, seeds removed2chiles de árbol3pounds boneless pork shoulder (Boston butt), sliced ¾\" thick8garlic cloves, peeled1cup distilled white vinegar¼cup sugar3tablespoons prepared or fresh achiote paste3ounces kosher salt (7 tablespoons Diamond Crystal or 4 tablespoons plus 2 teaspoons Morton), plus more1pineapple, peeled, cored, cut into ½\" rings, divided1medium onion, finely chopped, divided2red habanero chiles, seeds removed, finely chopped¼cup fresh mint, chopped3tablespoons fresh lime juice16corn tortillasLime wedges (for serving)PreparationStep 1Bring guajillo chiles, chiles de árbol, and 2 cups water to a boil in a medium saucepan over medium-high heat. Cover, remove from heat, and let sit 30 minutes to let chiles soften.Step 2Place pork in a large bowl. Purée chiles and soaking liquid, garlic, vinegar, sugar, achiote paste, 3 oz. salt, half of the pineapple, and half of the onion in a blender until smooth, about 2 minutes. Pour over pork, stirring to coat thoroughly. Cover and chill 3–12 hours.Step 3If using a gas grill or grill pan, prepare for medium-high heat; if using a charcoal grill, prepare for two zones of heat, medium-high and low. Grill remaining pineapple over medium-high heat, turning once, until charred, 6–8 minutes. Finely chop pineapple and combine with habanero chiles, mint, lime juice, and remaining onion in a small bowl. Season with salt, cover, and chill until ready to use.Step 4If using gas grill or grill pan, reduce heat to low; if using charcoal grill, use low-zone heat. Remove pork from marinade and grill until marinade on pork has dried and begins to caramelize and char, about 12 minutes per side. Transfer to a cutting board and let pork rest 10 minutes.Step 5Grill tortillas until soft and beginning to char, about 30 seconds per side. Slice pork against the grain into ¼\" strips. Top each tortilla with a few pieces of pork and some pineapple salsa. Serve with lime wedges for squeezing over.Do Ahead: Pineapple salsa can be made 4 hours ahead; keep chilled.How would you rate Tacos al Pastor?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI veganize this recipe simply by soaking shitake mushrooms for 30 minutes in the marinade instead of using meat. They can either be threaded on a skewer and charred over a grill, or sauted in a pan on the stovetop. Shred them up to mimic the texture of pork!\nExcellent recipe that I go to again and again.AnonymousBuffalo, NY3/25/2022Wonderful recipe. The marinade was full of flavor and helped keep the pork nice and tender. Loved grilling it up and getting those crispy bits. The pineapple salsa paired perfectly. We had leftover marinade so we used it for some chicken. Will definitely make again: Kristina Newport Beach, CA 3/21/2022Absolutely worth the time and effort. I had to turn the heat up to medium on my stove top for the pork but after some fine-tuning I was able to get great results.nickwheatAustin, TX6/28/2020Explore Bon AppétitTacoMexicanLatin AmericanPork ShoulderPorkMeatMainDairy-FreeNut-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-10-08", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}