{"id": "6208ba17ea5f20a4c8ee8d6ba4b8eec7", "url": "https://www.bonappetit.com/story/seared-cheese-slab-burger", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "This Halloumi Burger Is My Platonic Ideal of a Vegetarian Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBean Burger? Pass. Big Slab of Seared Cheese? That’s More Like ItThis summer I’m skipping the homemade veggie burgers. Instead, I’m putting a slab of seared cheese between two buns and calling it a sandwich.By Sarah JampelJuly 26, 2021FacebookTwitterEmailFacebookTwitterEmailIt’s not that I don’t love veggie burgers—I have a soft spot for Dr. Praeger’s and am in a long-distance relationship with NYC’s Superiority Burger. It’s just that, as 2020’s summer-that-wasn’t hammered home, these hot, glorious months are precious and short. In that context it’s hard to feel like measuring out 100 ingredients (one of which is cooked quinoa; one of which is baked sweet potato; one of which is cooked black beans boiled from dry with kombu and bay leaves) into a food processor, shaping patties, and *praying* that they hold together in the pan is worth all the trouble. I’ll leave that to the Good Doctor!You know what won’t fall apart? You know what’s one ingredient? You know what’s going to be satisfying and well-seasoned even if I leave out that random half teaspoon of ground flaxseed? Cheese! Specifically Halloumi. Halloumi is a Cypriot cheese, also enjoyed in Turkey, Greece, and around the Middle East (and the world!), that has a very high melting point. That means you can grill, roast, broil, pan-fry, or sear it without compromising its structure. Instead, the outside turns crisp and richly golden while the interior gets creamy and soft. Like a breaded and pan-fried slab of tofu or a crispy, cheese-filled mushroom, Halloumi can absolutely hold its own between two buns.It’s not only firm but also appealingly salty and tangy, entirely distinct from milky, buttery paneer and mild mozzarella—a happy companion to juicy, sweet ingredients, like watermelon and figs. In this recipe, it’s paired with seared zucchini because, if we’re being real, summer squash has a tendency to be bland, boring, and watery. But when you brown it, marinate it, and layer it with basil, pickled jalapeños, and that beautiful slab of warm, squeaky, salty Halloumi, the whole thing adds up to a wholly satisfying, low-maintenance vegetarian sandwich. To my mind, it’s also the equivalent of eating, like, three or four mozzarella sticks—which is to say, you’ll have plenty of room left for sundaes afterwards.So hold your bean burger. I’ll take a cheese burger, please.Get the Recipe:Seared Squash and Halloumi BurgersThis vegetarian recipe makes a strong case for replacing a veggie burger with a slab of melty, salty cheese.View RecipeExplore Bon AppétitcookingFarmers Market ChallengeHalloumiCheeseVeggie BurgerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-26", "author": ["Condé Nast", "Sarah Jampel"]}