{"id": "6209a6e276330dca136f7f11547f2f81", "url": "https://www.bonappetit.com/recipe/mustardy-sausage-and-halloumi-stir-fry", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Mustardy Sausage and Halloumi Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueMustardy Sausage and Halloumi Stir-FryBy Kendra VaculinFebruary 8, 20224.3(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Kendra VaculinEmailPinterestPrintEmailPinterestPrintCrisped sausage and cheese, lightly charred cabbage, and a savory mustard glaze come together to deliver major beer hall vibes. Because so many of the ingredients are salty, you don’t need to season the vegetables while cooking. Some brown bread on the side for serving is extra credit, but the big showering of dill at the end is nonnegotiable.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonSlotted Spoon$13 $10 At AmazonWhisk$10 At AmazonTongs$13 At AmazonIngredients4 servings2Tbsp. Dijon mustard2Tbsp. whole grain mustard2Tbsp. soy sauce1Tbsp. Champagne vinegar or white wine vinegar2Tbsp. extra-virgin olive oil, plus more8oz. Halloumi cheese, torn into 1\" pieces1lb. green cabbage (about ½ medium head), cut into 2\"-thick wedges12oz. kielbasa sausage or cooked bratwurst, sliced ¼\" thick1medium red onion, cut into 1\" piecesChopped dill (for serving)PreparationStep 1Whisk Dijon mustard, whole grain mustard, soy sauce, and vinegar in a small bowl; set mustard sauce asideStep 2Heat oil in a large skillet over medium-high. Arrange Halloumi in skillet in a single layer; cook, turning occasionally, until golden brown and crisp, about 4 minutes. Transfer to a medium bowl.Step 3Arrange cabbage, cut side down, in same pan and cook, undisturbed, until starting to char in spots underneath, about 3 minutes. Transfer to a cutting board and cut into 1\"–2\" pieces.Step 4Cook sausage in same pan, turning occasionally, until browned and crisp, about 3 minutes. Using a slotted spoon, transfer to bowl with Halloumi, leaving as much fat in pan as possible.Step 5Add more oil to fat remaining in pan to make 1 Tbsp. fat total. Cook onion, undisturbed, until well browned around edges, about 2 minutes. Continue to cook, stirring occasionally, until softened, about 3 minutes more. Return cabbage to pan and add reserved mustard sauce. Cook, tossing often, until combined and cabbage is coated, about 1 minute. Remove pan from heat; stir in Halloumi and sausage. Top with dill just before serving.How would you rate Mustardy Sausage and Halloumi Stir-Fry?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis was quite good and came together quickly. Used andouille sausage which gave a nice heat.KateMaine, United States3/16/2022Definitely going on the repeat/favorite list!!\n\nI followed the recipe using a low salt soy sauce but needed to add a little EVO when cooking the onion because the sausage did not produce very much fat.   Although I had prepped everything ahead of time, we cooked it in between periods of a hockey game and were able to eat dinner during the third period.\n\n We both were so pleased with the results.  Served it with a side salad.ShoretalkNew Jersey3/15/2022Satisfying winter fare, but as another reviewer noted, too salty, even though I added more cabbage than called for and used only 2/3 of the sauce. I would modify the sauce next time to reduce the saltiness. Perhaps drop the soy sauce completely.  It helped to serve it with a good quality baguette, the bread acted like a palate cleanser. BarbaraSeattle, WA3/9/2022Great dish. Very easy. Mustard taste subtle but thumbs up. Lowered soy to two teaspoons, rather than two tablespoons.\n\nOnly problem is the difficult to find, and if found expensive halloumi. I used queso de frier, and sprinkled about 4 extra oz of feta at the end. The queso melted much quicker than the halloumi would have. Next time very high heat, for less time for the cheese. Guessing Indian paneer cheese would work really really. I'm Greek by descent, so the sprinkling of feta made it very homey for me.\n\nCharring the cabbage is the key component IMHO.\n \nI used Aidell's chicken sausage with apples which worked very well, and in the future I would sear the sausages whole, to almost a burned skin, then let rest and slice.\n \nFinally maybe better with 16 oz. of sausage.  \n\nOverall, excellent! Wm Sakas115203/6/2022Made this last night, but my husband and I both agreed that it was too salty for our liking. The flavours were good, but we just couldn't get past the high tolerance of salt. Not sure where the salt was coming from, as I use low sodium soy sauce. Should I make this next time, I may use turkey sausage and coconut aminos in place of soy sauce. Overall, like I said, the flavours weren't bad, it was the salt content.TinaHuntington Beach3/5/2022Delicious and easy to make. Teenage son devoured it and husband was scraping every last little bit out of the serving bowl in the end. Cabbage melted in your mouth and the pops of mustard seeds rounded out each bite.  I used a lite version of Hillshire Farms kielbasa, it tasted good, but had to add a little more olive oil because it was leaner. Next time I will make fresh soft pretzels to serves with it.Dietz MomBay Area CA3/3/2022Pretty quick and easy prep and very easy to cook.  Just make sure you have your vent fan on!  I went ahead and used a whole head of cabbage (smallest I could find) because I dislike trying to find another use for something we don't use a whole lot of, especially something that won't last long after being cut.  Just meant for careful tossing once added to the large cast-iron, as it was very full!  My family didn't mind at all, as the cabbage was delicious.  I did cook it a little longer to ensure the rawness was gone (likely due to overly full pan).  The dill was definitely the perfect pop on top.  Next time, I may finely dice some of the extra raw onion to put on top as well.  Big hit - I will make again!LBinTXTexas2/22/2022I could eat this once a week.  Great German style meal. Used a Johnsonville Polish Kielbasa and Ingelhoffer stone ground mustard (with the dijon).  Could not find the Halloumi in my small town so I used a block of feta and didn't fry it as long as the recipe stated.  I will plan in advance next time.  Salted rye bread with soft butter is a must. A malty beer goes well with this, Octoberfest or Bock would be perfect.RandyAlexandria KY2/17/2022Explore Bon AppétitDinnerEasyOne-Pot MealsNut-FreeStir-FrySausageMeatHalloumiCheeseKielbasaGreen CabbageCabbageLeafy GreensVegetableMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}