{"id": "620ad8dab1975a790d5058c5b1fca74e", "url": "https://www.bonappetit.com/story/barry-jenkins-dinner-party", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Barry Jenkins Would Pair Vintage Wine and Soul Food at His Dream Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDirector Barry Jenkins Would Pair Vintage Wine and Soul Food at His Dream Dinner PartyThe Academy Award-winner's guest list includes Toni Morrison and characters from his new Amazon series.By Dawn DavisApril 23, 2021FacebookTwitterEmailIllustration by Joana AvillezFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.Films by director Barry Jenkins, including Moonlight and If Beale Street Could Talk, have been nominated for dozens of awards and have won quite a few, most notably an Oscar for best picture. His latest project, The Underground Railroad, a series for Amazon Studios, is based on the novel by Colson Whitehead, himself a Pulitzer Prize winner. But we’re not here to talk about accolades; we’re here to talk about dinner.Who would you invite to your ideal dinner party and why?Ms. Toni Morrison, Eileen Ahearn, and [the actor] André Holland. Eileen was a lifelong friend of Ms. Morrison’s. She works with the James Baldwin estate, which was how I got the rights to adapt If Beale Street Could Talk. One of the earliest screenings of Moonlight was a DVD that Eileen personally took to Ms. Morrison. I hear that Ms. Morrison loved the movie. So I would use this opportunity to talk to her about it. The only thing I remember her saying was that she thought André Holland was dreamy.Do any of your characters from film or TV get an invite?Yes, two characters from The Underground Railroad: John Valentine, who in our depiction owns a vineyard, so he’d bring some bangin’ wine, and Mingo, his nemesis in the show. They have this beautiful Booker T. Washington—W.E.B. Du Bois dynamic, and at a dinner party you want a bit of friction.You’ve got this mix of literary giants, fictional characters, and actors. What do you serve?Soul food. It’s a way for me to bring some other people to the party. I used to have this roommate, Jesse Dubus. He made this fried chicken 12, 14 years ago where he brined it overnight and then deep-fried it. It was so good. I’d get Jesse to come make the fried chicken. Joi McMillon, my editor on The Underground Railroad, Beale Street, and Moonlight, is from the South and makes the best mac ’n’ cheese. And my partner Lulu’s brother, Anthony Wang, is a great chef here in L.A.. Lulu and Anthony make really awesome vegan collard greens.You said a guest would bring outstanding wine. What wine do you have in mind?I’ve become a wine enthusiast during the pandemic. We’d have an excellent 1971 Barolo, Fontanafredda Barolo. And because I was born in 1979, we’d also serve a Heitz Cellar Napa Valley cab.What kind of table setting do you have?We mostly use ceramics. We like the idea that someone handmade this thing that we’re eating off of, and I’m into decanters for the wine. We’d pick a really nice crystal decanter. The color palette is warm, golden. Exposed filaments and candles.Tour Wine Decanter$100 at Crate and BarrelAnd what’s the conversation starter?Lulu and I do these exercises where you sit across from the other person and just stare into their eyes for three minutes. We might start off with a staring silence to break the ice. We’ve all been apart for so long that there’s almost this instinct to blab everything out at the top. I want to ease into the night.Besides Moonlight, would you talk about any of your films?Only if Ms. Morrison would want to. Otherwise, I’d be curious to hear what she thinks about the last year. We would all cede the floor to Ms. Morrison.Explore Bon AppétitDream Dinner PartyRead MorecultureLana Condor’s Dream Dinner Party Involves Pizza and a Giant CauldronBy Dawn DaviscultureCicely Tyson on the Star-Studded, Very Purple Dinner Party of Her DreamsBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-23", "author": ["Condé Nast", "Dawn Davis"]}