{"id": "62147d0fd97805c47915a81e3ceceb20", "url": "https://www.bonappetit.com/city-guides/montreal/venue/lexpress", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "L’Express Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealL’ExpressWhen you want the French bistro classics, you go to this Plateau institutionFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for a pitch-perfect meal, served with a gratis giant jar of cornichons. That’s right—unlimited cornichons! L’Express has been open since 1980; this place knows what it’s doing and it does it well.ORDER THE: steak tartare, a no-frills version that’s minced finely and served with (not quite enough) toast. Then get whatever the slightly gruff waiter recommends.THE VIBE IS: sparse but not without character—black-and-white tile floors, the occasional palm tree, and somewhat dim lighting except for the courtyard area in the back. The waiters are most definitely wearing vests. This is the kind of place where you mean to get one cocktail but end up staying for a bottle of wine.PRACTICAL STUFF: Open every day: Monday to Friday 8 a.m. to 3 a.m., Saturday 10 a.m. to 3 a.m., and Sunday 10 a.m. to 2 a.m. So yeah, about that bottle of wine...—Carey PolisPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEAu Pied de CochonGet your fill of foie gras and other Quebecois luxuries at this Plateau legendPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauSchwartz’sA must-visit sandwich institution still slinging smoked meat in the PlateauExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Carey Polis"]}