{"id": "6227c8eb3b5014bbf8213e546a65ac10", "url": "https://www.bonappetit.com/recipe/shawarma-roast-chicken-with-shallots-and-lemons", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Shawarma Roast Chicken With Shallots and Lemons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueShawarma Roast Chicken With Shallots and LemonsBy Andy BaraghaniMarch 15, 20224.5(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Graydon Herriott, food styling by Sue Li, prop styling by Aneta Florczyk.EmailPinterestPrintEmailPinterestPrintYogurt is a common marinade throughout the Levant region. Not only does it act as a tenderizer, but it also creates a crust on the meat and carries the flavor of the spices (here those are the shawarma heavy-hitters like cumin, coriander, and turmeric). The chicken marinates for just 30 minutes (or up to 12 hours in the fridge if you’re not in a rush), which makes it exceedingly doable without tons of planning. Roasting the bird alongside halved shallots and sliced lemons means you get jammy and crispy accompanying bites built right in, cooked in the rich chicken juices.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpice Grinder$45 At Kitchen AidLarge Skillet$84 At AmazonInstant-Read Thermometer$35 At ThermoworksRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 servings1Tbsp. coriander seeds1½tsp. cumin seeds1½tsp. black peppercorns1½tsp. smoked paprika¾tsp. ground turmeric4garlic cloves, finely grated¼cup whole-milk plain Greek yogurt or sour cream4Tbsp. extra-virgin olive oil, divided13½–4-lb. whole chicken, patted dryKosher salt3medium shallots, halved lengthwise1lemon, sliced into ¼\"-thick rounds, seeds removed4oregano or thyme sprigs, plus  leaves for servingFlaky sea salt (for serving)Special equipmentA spice millPreparationStep 1Finely grind coriander seeds, cumin seeds, peppercorns, paprika, and turmeric in a spice mill. Transfer spice mixture to a small bowl; whisk in garlic, yogurt, and 2 Tbsp. oil. Generously season chicken with salt, then smear yogurt mixture all over. Let sit on a rimmed baking sheet at room temperature at least 30 minutes, or chill, uncovered, up to 12 hours. If chilling, let chicken sit at room temperature 30 minutes before roasting.Step 2Preheat oven to 425°. Heat remaining 2 Tbsp. oil in a large skillet over medium-high. Place chicken, breast side up, in pan, then nestle shallots, cut side down, and lemon slices around. Season shallots and lemon with salt. Tuck in oregano sprigs and cook, undisturbed, until shallots are starting to brown, about 3 minutes.Step 3Pour ½ cup water into pan; transfer skillet to oven, arranging so legs are pointing toward back of oven. Roast until skin has taken on some color, 10–15 minutes. Reduce heat to 325°; continue to roast until chicken is cooked through and tender (an instant-read thermometer inserted into thickest part of breast should register 155°; it will climb to 165° as the chicken rests) and shallots are jammy, 60–70 minutes. Let rest 15 minutes.Step 4Transfer chicken to a cutting board and carve as desired. Arrange on a platter; tuck shallots and lemon slices around. Spoon juices in pan over, top with oregano leaves, and sprinkle with sea salt.How would you rate Shawarma Roast Chicken With Shallots and Lemons?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSo easy and so good! I subbed drumsticks and had zero time to marinate, but the chicken still came out juicy and flavorful. I served it with a mezze platter consisting of spring veggies, hummus, baba ganoush and pita. Definitely recommend!StephanieCA3/23/2022Delicious! I used thighs and regular onions and this was an actually doable weeknight dinner with some roasted asparagus Starchaser Detroit MI3/22/2022Delicious, simple to prepare, and used  basic ingredients I tend to have on hand. I roasted broccoli and yellow squash while the chicken rested. AnonymousKansas3/21/2022Thoughts on a side with this??\nAnonymous3/16/2022Explore Bon AppétitDinnerMainNut-FreeGluten-FreeHealthyishRoastChickenPoultryShallotVegetableYogurtOther IngredientsMiddle EasternLevantineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}