{"id": "622bdc15256116706660559e39dd00d8", "url": "https://www.bonappetit.com/story/go-international-this-summer-in-your-own-backyard", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Go International In Your Own Backyard this Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredGo International this Summer In Your Own BackyardBy Trader Joe'sAugust 15, 2018FacebookTwitterEmailFacebookTwitterEmailSummer is a super time to get away and explore more exotic worlds outside of our own. Of course, you can’t always jet around the world, but you can bring global flavors to your own backyard, with seasonal summer fare, while that passport takes a breather. Whether it’s the fresh Mediterranean flavors of Mykonos you crave, the fragrant spices of the Middle East, or the pungent heat of Latin American cuisine, we’ve got you covered. With a little help from Trader Joe’s, we’ve put together some of our favorite internationally-inspired dishes, using the freshest ingredients of the season, making it easy for you to travel the world without ever leaving your own backyard.Throw a Pita PartyTreat your guests this summer to an easy cookout featuring fragrant Middle Eastern fare. Fire up the grill for charred, pillowy pitas you can serve with everything from apps to sides and most definitely the main courses. In true Yemeni fashion, blend traditional Zhoug Sauce––cilantro-based pesto ignited with jalapeño, cardamom, and cumin––with Greek yogurt and serve alongside crispy, warm pitas as a starter. The cool-hot combo of the dip will awaken the palate. A Smashed Cucumber Salad (a BA favorite!) with Persian Cucumbers, Feta and za’atar seasoning lends a fresh crunch to grilled Chicken Shawarma. Another regionally-inspired side dish we love, rich with Middle Eastern flavors and aromas, is a Cauliflower Tabbouleh with mint, parsley, and tomato. Put it all together to create an exciting and exotic meal that goes perfectly with summer sunshine––and of course, pita!Make It a Mykonos Kind of NightThe most “summery” flavors tend to be those with the most crisp, fresh angles, like watermelon or cucumber. Start off with a refreshing cocktail of watermelon juice, paired with Organic Art of The Still Vodka over ice, with a twist – of cucumber. Skip the vodka and opt for sparkling water to make an easy-drinking mocktail if preferred. Take the feast in a Greek direction with a tangy, creamy Tzatziki Dip, and add a punch of color when you serve it with Three Seed Beet Crackers – with sesame, flax and chia seeds. To score bonus mezze points, grill up some fresh Halloumi, which is a semi-hard mixture of goat and sheep’s milk cheeses, and top it off with a drizzle of olive oil and lemon. Look to grilled, Greek-style Ahi Tuna Steaks, topped with a relish of Kalamata Olives, Feta, Olive Oil and Mint for the main dish. Don’t skimp on sides here––keep things fresh by throwing together a Grecian Potato Salad with Dutch yellow baby potatoes, Mini Heirloom Tomatoes, Persian Cucumber, lemon and parsley. This is how you “opa!” your way to summer deliciousness.Feel the Heat with Latin American FlavorsIce down the Simple Times Pilsner and spark up the grill! We’re bringing Latin American cuisine to your backyard this summer. Slather a bunch of Shishito Peppers in olive oil and a slightly-coarse ground Chili Lime Seasoning Blend for zing and texture, and grill them up until blistered and charred. Finish the mostly mild pepper bunch with a squirt of fresh lime. Balance the occasional heat of these piquant peppers with some fresh cut crudités paired with a creamy blend of Greek yogurt and Everything But the Bagel Sesame Blend for dipping. Throw in a side of Organic Longboard Tortilla Chips for those in need of more crunch. For the main dish, skewer some Argentinian Red Shrimp and Sausages with peppers and onions to set the grill ablaze and put some olé into your fiestas de verano.Pass the Burrata, BellaUnable to make it to the Italian coast this summer? Bring the amore to you and your guests at home instead. Start with a Spritz--a right of passage from Milan to Catania. Swap the usual Campari-style for a new one featuring Cecilia Beretta Freeda Rosé Trevenezie mixed with Lemon Elderflower Soda on the rocks with a twist. We’re all about delivering Italian flavors to the table, but we don’t want to spend our summer days crafting complicated recipes from scratch. And that’s exactly why we love grilled Rosemary-Balsamic Steak & Alt-Caprese, swapping the usual buffalo mozz and basil for creamy burrata and peppery arugula. Finish the salad with Heirloom Tomatoes and a generous drizzle of EVOO and balsamic, with salt and pepper to pop the flavors. A few gorgeously grilled Asparagus spears topped with shaved Parmesan colorfully completes this summer dinner that deserves to be enjoyed al fresco. Saluti! Or, as we love most, buon appetito!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-15", "author": ["Condé Nast", "Trader Joe'S"]}