{"id": "622d428e3927189e7ee245cab8ba5254", "url": "https://www.bonappetit.com/story/how-to-run-a-food-business", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "How to Start a Food Business in 2022 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs Starting a Food Business Worth It Right Now?Workers have been leaving jobs in droves to pursue their passions. But what are the costs of doing what you love for a living?By Ali FrancisFebruary 8, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“I remember getting an email,” Poppy O’Toole says, sitting in her London flat. “And then I was running around screaming, ‘Oh, my god! Oh, my god! Oh, my god!’” The Michelin-trained restaurant chef turned TikTok star is describing the moment U.K.-based publishing house Bloomsbury asked her to write a cookbook proposal in September 2020. “It was like, What on earth is happening?”Like many restaurant workers in the pandemic, O’Toole was furloughed in March 2020 and eventually lost her job as a junior sous-chef at the members-only social club, the AllBright. “I felt completely helpless,” she remembers. “I didn’t know how to do anything but cook.” That’s when her 10-year-old sister introduced her to TikTok. “I started scrolling through it and a recipe video came up,” she says. “I was like, I reckon I could do that.” O’Toole made daily videos showing her followers what a chef “who is unemployed, hungry, and trying to be healthy” eats in a day.Today, she has 2 million TikTok followers and counting. Her cookbook, Poppy Cooks, landed on shelves last September—by which time she was earning more money than she ever had in restaurants.Poppy Cooks: The Food You Need$26 at AmazonMany laid-off cooks and hospitality workers like O’Toole have suddenly had space to consider the realities of their work: low, stagnant pay. Wild schedules. Exhausting duties. And rude customers. After enough reflection, many of them have decided not to return to their past roles. Meanwhile, “HELP WANTED” signs are peppering restaurant windows all over the country as other hospitality workers are leaving their jobs at the highest rate in decades.I am trying to avoid a Benjamin Franklin turned Biz Bro aphorism like, “out of adversity comes opportunity.” But it does seem particularly apt here. Since March 2020, pop-ups have sprouted across the country, ghost kitchens have boomed, and unemployed food workers have started successful doughnut empires. This year, in what’s being termed the Great Resignation, more and more employees are quitting jobs they hate to do something they don’t. But there are plenty of costs associated with doing what you love. Americans have long idealized the side-hustle economy—The Dream™—yet entrepreneurial burnout and the fatigue that’s unique to restaurant work can look a lot alike. I spoke with O’Toole—and other chefs who recently left their gigs to pursue their passions—to find out: Is it worth it?Work-life boundaries are hard to define, but being your own boss is empowering.Bronwen Wyatt was working up to 14 hours a day as pastry chef at both The Elysian Bar and Bacchanal Wines in New Orleans when she was laid off during the summer of 2020. Before she was let go, Wyatt noticed the large-format cakes and desserts on Elysian’s to-go menus were selling well. “I had a couple of people reach out [after I left], asking if they could still buy cakes from me,” she remembers, which prompted her to start Bayou Saint Cake, her NOLA-based “tiny bakery” soon afterward. There was no business plan, Wyatt says, but “the orders kept rolling in.”These days, she makes 25 to 30 cakes per week—all whimsical, flower-crowned masterpieces. Wyatt loves her newfound autonomy and the creative freedom that comes with doing your own thing. Not having to be at work by 5 a.m. anymore has also improved her relationship with her wife. “Now we wake up at the same time and go to bed at the same time, and that’s been huge,” she says.Instagram contentThis content can also be viewed on the site it originates from.But even outside the all-too-demanding schedule of the restaurant industry, the toll of working can quickly add up. As a former entrepreneur myself, I know firsthand that nobody is going to set work-life boundaries for you—and doing so feels almost Sisyphean when you’re just trying to keep that boulder rolling. “I need to not work as much, because it’s reproducing a toxic framework from the restaurant industry,” Wyatt admits. “There’s this ‘feast or famine’ feeling, where I worry that if I don’t accept as many orders as possible now, that this will eventually fade away and I’ll regret [not doing more].” She has found ways to free up some time by using menu apps like Minimart to automate the ordering process.The outpouring of love for Wyatt’s cakes keeps her going. “People DM me from all over the country and world to tell me how much pleasure they get looking at pictures of [them],” she says. “It still blows my mind.”For a greater financial payoff, you might need to make sacrifices from the start.In February 2020, Rashida Holmes quit all of her restaurant gigs to fully run Bridgetown Roti, a Caribbean pop-up in Downtown L.A., selling a rotating menu of fish cakes, macaroni pie, roti, and more. Then the pandemic hit, and Holmes had to rethink what was possible. “I saw a friend of mine selling meal kits out of her house in April,” she tells me over the phone. “And I was like, Oh, I think I can probably sell patties [from home].” She began to make her version of the mouthwatering, half-moon-shaped golden pastries—filled with anything from oxtails to Trini eggplant—that are popular in Barbados, where her mom was born.Instagram contentThis content can also be viewed on the site it originates from.After advertising the patties on Instagram, she “sold out in the first weekend, and the next one, and then it just kept growing and growing,” Holmes says, highlighting the importance of testing the market in a low-risk, low-capital way—like selling food online before committing to a physical space. Now, she’s had enough success to start cooking and serving food out of a commissary kitchen and hire a staff of six, mostly part-timers. But she’s still not making a salary, choosing instead to “invest everything back into the business and our people.” It’s not uncommon that founders are often “the last ones to take a paycheck,” Holmes says, noting that she has the privilege of some financial support. “My wife’s kind of being my sugar mama right now—as much as a public educator can be.”Listen to Holmes on Our Podcast: Food PeopleContentThis content can also be viewed on the site it originates from.Despite the very real financial strain, she’s proud she can pay her employees properly and ensure no one on staff is relying on tips or working crazy hours like they might at a traditional restaurant. “I definitely feel a lot of pressure to make it work, but I also know this is the direction I want to go in,” Holmes says. “I see myself getting paid from this in the future, for sure. Right now I gotta make sacrifices; that’s kind of the entrepreneurial journey.”The pressure to succeed is all on you, but it could exceed your wildest expectations.“What you don’t know is that there’s so much more to it than meets the eye,” O’Toole says, describing her day-to-day work life. “You have to be your own timekeeper, boss, scheduler. You have to be writing, creating, and videoing content.” In other words, you have to do it all.While running my own food business, I was best at recipe development and creative work, but that was often the last thing on my to-do list, after fundraising, marketing, supply chain management, and the constant cost calculations that ran through my head. And, unlike a job you can leave at the door regardless of a bad day or week, O’Toole says she finds the constant pressure to perform overwhelming at times. “I had a period of time when I was like, I don’t know if this is for me,” she remembers. “Putting yourself out there [in the public eye], open for criticism, is quite daunting sometimes.”TikTok contentThis content can also be viewed on the site it originates from.Still, looking back to early 2020, when she was considering going on unemployment benefits, O’Toole is proud of how far she’s come. “I always had an idea that I’d be working [for someone else] until I was 40-something and then I’d want to open my own place,” she says. “A cookbook would’ve been great but I was thinking it probably would have been a lot longer down the line—not at 27.” Similarly, Wyatt had many career aspirations (like being featured in Bon Appétit!) that didn’t come to being until she started her own thing. “I just think it’s one of the strangest things that’s come out of the pandemic,” she says. “I was able to meet a lot of these personal goals for myself without any support around it; that’s not lost on me.”After a surge in new businesses during 2020 and 2021, we still don’t know what’s going to happen to them this year—as more and more employment opportunities bounce back and some start-ups inevitably fail. But I was deeply struck by the single, clear resolution every entrepreneur I spoke with agreed on: None of them are planning to return to their restaurant gigs anytime soon. “Why would I?” O’Toole asks. “I’ve managed to make a successful company for myself and I get to keep the profits.”The pandemic, for all its challenges, has given folks the time and headspace to consider the realities of the hospitality industry, and to decide when, and how, they want to participate going forward. And it’s given the oft-overlooked worker a voice. “I felt confident in my cooking for the first time,” Holmes says. “[Because] I was telling my own story for the first time.”Thinking of starting a food business? Read this next.1 / 13ChevronChevronFor Diaspora Co.’s Sana Javeri Kadri, a Community Is More Powerful Than a Marketing TeamThe spice company’s founder harnessed the power of people all over the U.S. to build her brand—and now she’s doing the same for other entrepreneurs.View StoryExplore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Francis"]}