{"id": "6235d68faca412de2dbcd7381f2d084b", "url": "https://www.bonappetit.com/recipe/phat-sii-krong-neua", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Phat Sii Krong Neua Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssuePhat Sii Krong NeuaSeptember 22, 20204.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintThinly sliced flanken-cut short ribs, packed with rich flavor, are the key to this Thai stir-fry. (Ask your butcher to cut them if you can’t find them because flanken-cut ribs have to be cut across the bone using a butcher’s saw.) You’ll want a big helping of rice to go along with it. This recipe is from chef Parnass Savang of Atlanta’s Talat Market.Ingredients4 - 6 ServingsMarinade4garlic cloves1Tbsp. finely chopped cilantro root or stem3Tbsp. oyster sauce2Tbsp. fish sauce2tsp. freshly ground white pepper2½lb. ¼\"–½\"-thick crosscut bone-in beef short ribs (flanken-style)Kosher saltStir-Fry and Assembly¼cup oyster sauce1Tbsp. fish sauce1tsp. freshly ground white pepper3Tbsp. vegetable oil1sweet onion, thinly sliced4garlic cloves, smashed2red Thai chiles, thinly sliced4scallions, sliced into 1\" pieces1cup Thai basil leavesCooked jasmine rice (for serving)Special Equipment:A mortar and pestlePreparationMarinadeStep 1Smash garlic and cilantro root with a mortar and pestle to a smooth paste. Scrape paste into a small bowl and whisk in oyster sauce, fish sauce, and white pepper.Step 2Cut short ribs between the bones to create flat pieces that are about 2\" wide. Season lightly all over with salt, place in bowl with marinade, and toss to coat. Cover bowl with a large plate or plastic wrap and chill ribs at least 2 hours and up to 12 hours.Stir-fry and assemblyStep 3Let ribs sit at room temperature 30 minutes before cooking.Step 4Whisk oyster sauce, fish sauce, white pepper, and 2 Tbsp. water in a small bowl to combine. Set sauce aside.Step 5Heat oil in a large heavy pot over medium-high. Working in batches to avoid crowding, cook ribs in a single layer until browned, about 2 minutes per side. Using tongs, transfer to a plate. Pour off all but 2 Tbsp. oil from pot.Step 6Place pot back over medium-high heat. Cook onion, garlic, and chiles, stirring occasionally and scraping up any browned bits and adding a splash of water if pan looks dry, until onion is slightly softened, about 5 minutes. Return meat to pot and pour reserved sauce over. Cook, stirring often, until flavors come together, about 2 minutes. Remove from heat and stir in scallions and basil.Step 7Transfer stir-fry to a platter or bowl and serve with rice.How would you rate Phat Sii Krong Neua?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis recipe is out of this world.  I also made it with chicken and thin rice noodles and it was to die for.  AlexSt. Louis 1/11/2022Delicious! At first I didn’t have any cilantro so I added Thai basil to the marinade, then I did get cilantro and added that also, yum! Seared the ribs in a cast iron pan then finished them in the oven at 375 because my ribs were cut really thick, perfection. Great flavor and awesome on rice or left over garlic mashed potatoes!AliaWenatchee WA1/1/2022This recipe was easy and super flavorful with the fish sauce/oyster sauce marinade. I marinaded the meat overnight and it was perfect for lunch the next day. Adding this to my recipe repertoire. My husband loved it. SKLong Island, NY12/12/2020Way too salty!AnonymousAustin, Texas 12/9/2020Explore Bon AppétitStir-FryRibsThaiSoutheast AsianAsianShort RibBeefMeatThai BasilBasilHerbs & SpicesMainDairy-FreeNut-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}