{"id": "6236bb788a3c176e5e25ad567767c21a", "url": "https://www.bonappetit.com/story/make-ahead-martini", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "The Make-Ahead Martini Is My Version of Meal Prep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Make-Ahead Martini Is My Version of Meal PrepA big-batch drink is way more fun than a dozen hard-boiled eggs.By John deBaryFebruary 25, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailMaking cocktails at home is kind of like cooking risotto. Sure, you can do it every day, but there are probably 10 people on earth for whom that would be practical, let alone desirable. Put another way: Making cocktails is a hassle. Yes, I wrote a whole entire book that teaches people how to make drinks for themselves, but to me making a cocktail is a special occasion. A lot of things have to come together: You need the right ingredients, the time and space to craft your drink, and willing drinkers.The stars don’t always align how we want them, so what’s a good midpoint between a Ramos Gin Fizz party of one and cracking open a cold one? Meal-prepping your drinks. This means pre-batching, re-bottling, and pre-chilling your drinks so that you can pour one here and there without having to bust out your bar kit. It does require a little forethought, a bit of math, and a couple of caveats, but once you get the hang of it, you’ll find the upfront time was well spent.A reusable bottle will also pick up flavors from the drink, so unless you want a permanently whiskey-flavored Nalgene, stick with an empty glass bottle of your favorite spirit, ideally with a screw cap. Empty spirits bottles are the ideal vessel to use because they’re semi-disposable and can be used once and recycled relatively guilt-free. A standard spirits bottle is 750 ml, which translates to about 24 ounces. Here’s how to scale up your drinks to fit inside of one:1. Add up all of the ounce measurements in your drink (except bitters) and add 1 ounce (for water).If you’re making this Fifty-Fifty Martini recipe, that’s 1½ ounces gin + 1½ ounces dry vermouth. In the normal course of making a drink, you’ll add about 1 ounce of water through stirring (or shaking) with ice, so you’ll need to add 1 ounce of water to account for that. (Since you're making this ahead, you won't be stirring it with ice later on.) All of this math gets you a total of 4 ounces. 2. Figure out how many of those drinks will fit into your 24-ounce bottle. For this 4-ounce cocktail, you’ll be able to fit 6 drinks in the standard bottle (because 4 x 6 = 24). 3. Finally, multiply the original recipe by the number of drinks you’ll be making. That will produce your scaled-up formula.For this drink, that’d be…1½ x 6 = 9 ounces gin1½ x 6 = 9 ounces dry vermouth1 x 6 = 6 ounces water1 x 6 = 6 dashes orange bittersThen, all you have to do is combine the ingredients in a mixing bowl, give them a quick stir, and re-bottle them in an empty 750 mL bottle. (If you don't have an empty spirits bottle yet, you can of course use whatever freezer-safe vessel you like.) After about six hours, it will be cold enough to serve. Grab the bottle, give it gentle inversion in case anything settled, pour, garnish with a lemon peel, and you’re set.Now that you’ve got your make-ahead martini down, you can move on to other drinks, keeping these things in mind:Start simple. These drinks are a relatively big commitment. If you mismeasure or get tired of your drink after a couple days, this technique can get wasteful. Try a Manhattan, Negroni, or an Old-Fashioned before graduating to more advanced drinks or using rare or expensive liquids.Measure first, then combine. Measure everything into separate vessels and then combine at the last step. This ensures you actually have all of what you need, plus it gives you an added layer of security if you flub a measurement.Careful with bitters. Bitters, especially intensely-flavored ones like Angostura, tend to get more intense over time as the ingredients integrate (similar to how spicy foods can get spicier after a day or two in the fridge). You can either just deal with it, if you don’t mind the flavors changing slightly, dial back the Angostura if you’re making, say a bottled Manhattan or Vieux Carré, or leave out the bitters entirely and add them back on a per-drink basis.Avoid citrus. I wouldn’t recommend meal-prepping citrus-based drinks like a margarita or a daiquiri because fresh citrus goes stale and tastes limp and metallic after about 36 hours, even in the freezer. In general, it’s best to stick to drinks that rely on non-perishable ingredients.Carbonation is also a no-no. Anything bubbly like seltzer, Champagne, or beer will lose its bubbles when poured from its original container and re-bottled.Once you master the fundamentals the possibilities are kinda endless. In addition to being a great at-home slacker solution, you can bring these to the beach or a picnic. And, trust me, if you show up to your next party (be it several months from now) with one of these in hand, you’ll be a star.Martini, anyone?How To Speak Fluent MartiniLearn how to make, order, and enjoy the cocktail-iest cocktail of all.View StoryJohn deBary is a former/semi-retired bartender, author of Drink What You Want: The Subjective Guide to Making Objectively Delicious Cocktails, the creator of a line of zero-proof botanical drinks, Proteau, and the co-founder and Board President of Restaurant Workers’ Community Foundation.Explore Bon AppétitCocktailAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-25", "author": ["Condé Nast", "John Debary"]}