{"id": "6248f94d498a897731c9d4ffb71119f6", "url": "https://www.bonappetit.com/recipe/roasted-broccoli", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Roasted Broccoli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted BroccoliBy Rick MartinezPhotography by Alex LauFebruary 24, 20223.9(11)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintKnowing how to roast a wide array of vegetables is a skill every home cook should master—and this simple roasted broccoli recipe makes it so easy. Once you get the hang of the cooking method, you can change the star ingredient, the type of fat, add herbs and spices, or incorporate any number of other finishes you likely already have in your kitchen (a squeeze of tart lemon juice, a sprinkle of toasted bread crumbs).A balance of golden crispy-crunchy bits and crisp-tender stems is the goal with oven-roasted broccoli. And those stems are just as flavorful as the broccoli florets, so only discard the dried-out ends. Some thicker stalks can be fibrous—use a Y-peeler or paring knife to remove the outer layer and reveal the tender core. To help with browning, make sure your broccoli is dry before you start cooking—any moisture leftover from washing the vegetable can cause the florets to turn mushy in the oven (if you feel empowered, don’t wash it at all). Finally, don’t overcrowd the pan, vegetables like broccoli need breathing space as they roast; allowing steam to escape helps guarantee those crispy edges.You can serve this simple healthy side dish as is—or pair it with a lemony tahini sauce, pile it on toast with garlicky ricotta and hot honey, shower it with Parmesan cheese, or switch up the spicing to make the veg taste a bit like Doritos. Discover more of our best broccoli recipes.Editor’s note: This recipe was originally published November 2015.Ingredients4 to 6 Servings2large heads of broccoli, cut into large florets with some stalk attached5tablespoons olive oilKosher salt, freshly ground pepperPreparationPreheat oven to 450°. Toss broccoli and oil on a rimmed baking sheet; season with salt and pepper. Roast, tossing occasionally, until tender and browned, 25–35 minutes.How would you rate Roasted Broccoli?Leave a ReviewTell us what you thinkReviews (4)Back to TopTrianglethis is great if u like baby food. failAnonymous2/25/2022Way too long on the cooking time. Check it at 15, 20 mins max. 450 for 35 minutes will yield burnt broccoli.Kevin RAtlanta, GA5/1/2021I love this recipe! It's so simple yet so delicious. My oven is a bit hotter than most so I checked on the broccoli every 10 minutes. The light charring of the broccoli gives it an amazing flavor you just don't get with steamed broccoli. Will make often! Thanks!Anonymous481765/29/2020I made this roasted broccoli to serve with grilled salmon.  Followed the recipe to a \"T\" and it was the temperature and time that I would adjust.  Use your oven thermometer to stay on temperature and start checking at 20 minutes.  My oven is spot on and I relied on the timing and that was my mistake.  I should know better! This recipe is a 2 as written and 5 with adjustment.AnonymousTexas10/20/2017Explore Bon AppétitBroccoliVegetableEasyQuickSideDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-11-12", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}