{"id": "624da9d23d6e9f553092c3649e37f91b", "url": "https://www.bonappetit.com/recipe/spicy-grapefruit-shandy", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Spicy Grapefruit Shandy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueSpicy Grapefruit ShandyBy Amiel StanekMay 24, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis sweet-tangy mixture transforms even the cheapest beer into a refreshing company-worthy cocktail, but even teetotalers (or, you know, the kind of people who don’t believe in hair-of-the-dog hangover cures) can enjoy a splash in a tall glass of seltzer.Ingredients10 servings4cups grapefruit juice, preferably fresh¼cup finely chopped pickled ginger¼cup (or more) pickled ginger juiceKosher salt, freshly ground pepperBeer, preferably light lager (for serving)PreparationStep 1Vigorously stir grapefruit juice, pickled ginger, pickled ginger juice, a small pinch of salt, and a good 20 cranks of pepper in a large pitcher. Taste and add more ginger juice, salt, and pepper if needed. Divide beer among ice-filled glasses and add a splash of grapefruit-ginger juice to taste.Step 2Do Ahead: Grapefruit-ginger base can be made 1 day ahead. Chill.How would you rate Spicy Grapefruit Shandy?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDidn’t have pickled ginger but I had Gari.. didn’t taste right so I added a dash of Gochugaru and it did the trick. Great drink AnonymousCalifornia4/22/2020Saw Alex Delaney drinking this on one of the recent BA test kitchen videos and had to give it a shot.  Absolutely amazing.Z. PowellLittle Rock, AR12/9/2019DELANEYAnonymousMinneapolis12/5/2019Explore Bon AppétitCocktailDrinks AllCold DrinkBritishEuropeanGrapefruitCitrusFruitQuickEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Amiel Stanek"]}