{"id": "6250844bb7d03c7b61eb72733b2501cc", "url": "https://www.bonappetit.com/story/grilling-recipes-breaking-me-out-of-rut", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "These 4 Grilling Recipes Are Breaking Me Out of a Cooking Rut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese 4 Recipes Are Breaking Me Out of a Grilling RutA weekly dispatch from Bon Appétit’s editor in chief.By Adam RapoportJuly 10, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he’s been cooking, restaurants he’s been eating at, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.Let’s forget about ribs and rib eyes.This is the summer I grill something different.Maybe you can relate.I’ve always thought of grilling less as a means of cooking, and more as a set roster of dishes. For big gatherings, I fire up my “famous” ribs, and everyone asks how they get so crispy, while remaining fall-apart tender. (Hint: Slow-cook in the oven, then shellack with sauce over a live fire.)For good friends, I splurge on a dry-aged rib eye and I then brag about the deeply seared, perfectly medium-rare finished product like a dad talks proudly about his child. Except I’m afraid I’m guilty of sharing photos of my rib eyes even more often than I do of my 10-year-old son.How do I break out of my routine when, like many of us, it’s so easy to fall back on what works?Best-Ever Barbecued RibsGot nothing but time on your hands? Cook these really low and slow. Set the oven at 300° and start checking the ribs after 3 hours.View RecipeWell, first, I’ll riff on what I already know. I recently came upon some lamb ribs at a local farm stand. I took the same approach as BA’s ultimate ribs, seasoning them with a basic dry rub, and pre-cooking them in the oven before finishing them on a medium-hot grill (beware of flare-ups; they’re plenty fatty). Because I had no pomegranate syrup, as our recipe by Seamus Mullen calls for, I simmered some honey with smashed garlic cloves and a pinch of chili flakes. When the nicely charred ribs came off the grill, I painted them with the garlic-infused honey. Sweet, smoky, crispy, meaty. Wow.And because I know I’m adept at developing a quality sear on a steak while hitting the just-right doneness, why not apply that touch to something other than a rib eye? I loved the article in our June/July issue on grilling cuts of meat we typically braise. In winter months, I’m all about pork shoulder and brisket, simmered slowly a Dutch oven. But did you know can take either cut and throw it on your grill?Grilled Brisket with Scallion-Peanut SalsaBrisket’s not just for braising! You have to try it on the grill with this incredible peanut topping.View RecipeFor the grilled brisket, senior food editor Chris Morocco freezes the meat for about 45 minutes, which allows him to thinly slice it, about ⅛\" thick. Into an Asian-inspired marinade it goes, a quick turn on a hot grill, and then it’s finished with a scallion peanut sauce. Brisket like you’ve never had before.Pork Shoulder Steaks with Grilled Mustard GreensNormally you want to braise a pork shoulder—but we’re making a case for throwing it on the grill, with a hell of a spice rub.View RecipeAs for the pork shoulder, it means asking a butcher to carve the boneless cut into ¾\"-thick steaks. Because it’s seamed with so much intramuscular fat, it yields an addictively flavorful and juicy steak. I couldn’t stop nipping at it when senior associate food editor Molly Baz was developing the recipe in the Test Kitchen.Charred Cabbage with Goat Cheese Raita and CucumbersGarnish with crushed Corn Nuts, win summer.View RecipeFinally, because you can’t survive on meat alone (I think?), I’m going to diversify my vegetable game. On a recent episode of the BA Foodcast about trying to lead a more vegetable-forward life, food director Carla Lalli Music got me all excited to grill cabbage. Who knew? We have a recipe for charred purple cabbage with a cooling mint raita and cucumbers. It’s officially now on my to-grill list.About those ribs though:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Adam Rapoport"]}