{"id": "6252315d3e98ee785dc4f13ba2047f61", "url": "https://www.bonappetit.com/story/you-need-a-meat-mallet", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "A Meat Mallet Belongs in Your Kitchen, Even if You Never Eat Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Meat Mallet Belongs in Your Kitchen, Even if You Never Eat MeatIt's just smashing. By Sarah JampelJanuary 3, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailI never thought that I’d be encouraging people to buy meat mallets. I'm a vegetarian and, listen, I know what meat mallets are typically used for: pounding meat to an even thickness so that it cooks quickly. Typically, you’ll employ one when you want flat cutlets for dredging and frying, like for saltimbocca, picatta, milanese, katsu, schnitzel, or when you’re hammering tough cuts of meat, like flank or skirt steak, to make them more tender. So, yes, it’s got lots of meaty applications.But as I learned from Carla Lalli Music, who turned to a meat mallet to squash an army of just-fried plantains for her tostones in no time, the meat mallet is no one-trick pony.Just think of what else it can do:Crush garlicCrack or crush nutsCrush olives to remove pitsCrush peppercorns (mmm cacio e pepe)Smash potatoesSmash ice for cocktails (wrap your ice in kitchen towels first!)Break down ginger and lemongrassCrack lobster or crab shellsPulverize crackers, candies, or cookies into crumbsRoughly “chop” chocolateFinally hang that photo on the wall?It’s multipurpose. It’s versatile. It’s not sexy but it’s useful. And it’s not just for meat! Petition to call it a “kitchen mallet,” please! Oh, and if you don't have a meat mallet but you need it right now? Bring out your rolling pin or your heaviest cast-iron skillet. Or grab an actual hammer, then add \"meat mallet\" of need-to-buy purchases, return the hammer to the toolbox, and tell no one.Buy it: KitchenAid Textured Aluminum Meat Tenderizer, $11 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-03", "author": ["Condé Nast", "Sarah Jampel"]}