{"id": "62543d6d1557b588d8ef9a458b06e1d2", "url": "https://www.bonappetit.com/story/what-is-mexican-oregano", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "What Is Mexican Oregano? And Is It Really Different From the Other Stuff? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Mexican Oregano? And Is It Really Different From the Other Stuff?Allow us to explain.By Jarrett MelendezAugust 11, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.For those who didn’t grow up eating Mexican and Tex-Mex cuisine, seeing “Mexican oregano” included in a recipe may raise a question or two. Namely, “What is Mexican oregano?” and “Can I just use any oregano instead?” Well, class, that’s what I’m here to answer.For starters, Mexican “oregano” is a bit of a misnomer. The oregano used in Mediterranean cuisine, and what I would call “true oregano,” is part of the mint family and is closely related to marjoram, whereas Mexican oregano is actually part of the verbena family. While the two species of plants are totally unrelated, they do share a few flavor and aroma compounds, called terpenes, that make them taste and smell similar—at first.But when you smell and taste them side by side, the differences become more apparent. True oregano is slightly sweet with bitter and peppery notes, likely stemming from its roots (pun unapologetically intended) in the mint family. Those secondary flavor notes can vary depending on the variety and region where it’s grown—Turkish, Greek, and Italian oregano, all subspecies of true oregano, are each a little different. Some may even have a slight cooling effect, though not nearly as potent as actual mint. Mexican oregano, on the other hand, is brighter with floral and citrus notes and a hint of anise, flavors that are characteristic of most herbs in the verbena family.Photo courtesy of The Spice HouseMexican Oregano$4.99 at Spice House$4.50 at Rancho GordoThe two types of oregano are even native to different parts of the world: True oregano is native to most temperate climates in western and southwestern Europe and Asia, as well as most Mediterranean countries, while Mexican oregano comes from (surprise, surprise) Mexico, Guatemala, and some parts of South America.In my kitchen, Mexican oregano shows up in a lot of recipes. I use it in Mexican meat dishes, like pollo al carbon and carnitas. It’s a key ingredient in almost every recipe I have for beans and chili. When I’m feeling ambitious, it’s a must-have component in my family’s delicious but time-consuming mole. Although all of these dishes are very different, Mexican oregano pairs beautifully with all of them. That warm, pungent flavor found in true oregano is just a part of what Mexican oregano brings to the party—it’s those floral, citrus, licorice/anise notes that balance and complete each dish.Personally, I don’t use Mexican and Mediterranean oregano interchangeably for the same reason I don’t swap thyme for oregano: They’re just not the same, even if they do taste a little similar. (If you’re without Mexican oregano, however, true oregano is better than nothing, but marjoram, a citrusy oregano relative, works even better.)Luckily, Mexican oregano is easy to find. In the U.S. it’s supplied by staple grocery store brands like McCormick and Badia as well as most Mexican and Latin American grocers and online retailers like Curio Spice Co., the Spice House, and Rancho Gordo. So grab a jar when you see one! Because Mexican oregano is always sold dried, it will last you through many pots of beans.About that pollo al carbon…Pollo al CarbonThese bright and succulent grilled chicken breasts are perfect for wrapping in warm tortillas with spoonfuls of fresh salsa verde. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-11", "author": ["Condé Nast", "Jarrett Melendez"]}