{"id": "62583b8c268de6694f9afab8aacafdbc", "url": "https://www.bonappetit.com/recipe/fancy-cranberry-sauce", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Cranberry Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueFancy Cranberry SauceBy Andy Baraghani and Brad LeoneOctober 15, 20194.7(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe dreamed of a sauce as sliceable and jiggly and fun as the retro canned stuff, but with deeper fruit flavor and more nuance. It’s subtly spiced with bay leaves and cardamom, then set in a gelatin mold that your cousins will never see coming and crowned with sugary orange zest and cranberries. You can use a Bundt pan (we like this one) as well; they’re slightly larger so the gelatin won’t fill the pan, but that’s okay, it’ll still flip out beautifully. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8–10 servingsNonstick vegetable oil spray1Tbsp. plus 1½ tsp. unflavored powdered gelatin1½lb. fresh (or frozen, thawed) cranberries4cardamom pods, lightly crushed3fresh bay leavesPinch of kosher salt1cup unsweetened cranberry juice or water1½cups plus 3 Tbsp. sugar22x1\" strips orange zest, very thinly sliced lengthwisePreparationStep 1Lightly coat a 4-cup mold or Bundt pan with nonstick spray. Stir gelatin and ½ cup warm water in a small bowl and let sit 10 minutes.Step 2Set 2 Tbsp. cranberries aside for serving. Bring cardamom, bay leaves, salt, cranberry juice, 1½ cups sugar, and remaining cranberries to a boil in a large saucepan, stirring to dissolve sugar. Continue to cook, stirring often and reducing heat as needed to avoid scorching, until cranberries burst and juices begin to look syrupy, 10–12 minutes. Remove from heat and pick out cardamom and bay leaves; discard. Stir in gelatin mixture (gelatin should be completely dissolved). Slowly pour cranberry mixture into mold. Chill until completely set, at least 12 hours.Step 3To serve, dip mold in a bowl of warm water and hold 30 seconds. Remove and place a platter upside down over top of mold. Invert jelly onto platter.Step 4Just before serving, toss orange zest, remaining 2 Tbsp. cranberries, and remaining 3 Tbsp. sugar in a small bowl to coat. Scatter over jelly.Step 5Do Ahead: Jelly (without sugared cranberries and zest) can be made 2 days ahead. Keep chilled.How would you rate Fancy Cranberry Sauce?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleWe make a version of this every year.  We have a few vegetarian guests and I sub a can of the cranberry jell for the gelatin.  I use water rather than juice to keep it from being too sweet. Add the canned  cranberry with fruit and boil.  I use a vintage mold and it comes out as a holiday showstopper! Jenn CState College, PA11/26/2021Whoa. This recipe made me fall in love with cranberry sauce. It made me realize the role cranberry sauce is supposed to play on my Thanksgiving plate. It also made me fall in love with Cardamom. Mmm. Whenever I bring this dish to a party, jaws are dropped (including my own).\n\nTip: I line my molds with Crisco using a paper towel and followed their hot water method for release. The molds come out perfectly clean.\n\nA variation to consider is adding some chopped-up hibiscus fruit along with the cranberries.Larissa S. Austin, TX11/15/2021This is not a joke: I wish I added the sumac. I didn't have it on hand and I didn't add it bc I didn't think it would be a big deal, that was a bad idea. It came out really needing that citrusy note. I remade it with lemon juice and tiny bit of zest and it was a lot better! I highly recommend adding in the sumac if you have it. Sorry Andy, but you were wrong on this one! AnonymousChicago, IL11/26/2020My husband used to like the canned cranberry until I made this.  Now it’s a requirement for him and it’s an absolute showstopper on the table.Adam BKenosha, Wisconsin11/24/2020Tastes great! I added some Sumac as Brad would’ve wanted, and it was delicious!Utah11/1/2020Great recipe! Could have used a little sumac.AnonymousChicago5/20/2020AMAZING made this just for fun to go with dinner!!! The only thing it could have used is a little bit of sumac Anonymous4/21/2020This was tasty and the flavors were unexpected with cardamom and fresh bay leaf to season the sauce. I didn’t make time for the gelatin, but the taste was still there! EnoughpotentialNorway12/5/2019How the measurements are listed in the recipe are incredibly awkward.  Having the gelatin listed in grams would have been far more helpful because when buying a package of gelatin that's how it is listed (I ended up using 28g of gelatin). I wasn't a huge fan of the cranberry skins that were in some bites so I think trying to strain those out or something might need to happen in future batches.AnonymousVirginia Beach, VA, USA11/30/2019I loved this. The flavor was complex but clean and I loved the presentation. Next time I will seek out a gelatin mold for extra drama (used Bundt Pan this time.) leighwhit25Atlanta ga 11/29/2019Cant find cardamom pods - how much cardamom spice is equivalent?VikaBellaQueens, NY11/26/2019I made this recipe with fresh cranberries, unsweetened 100% cranberry juice from Trader Joes, and the only modification was I skipped the gelatin step. FYI if you're weighing your ingredients, the sugar is 338g. The flavor is fantastic, with bright cranberry flavor. The texture was what I was going for as well, served out of a bowl and not inverted from a mold.dtempNC11/26/2019I just did a tester of this before making it for Thanksgiving. It tastes great, but it definitely did not set up like it did in the video. It was still a liquid after sitting for 16 hours. In my next attempt, I would use orange juice in place of water and probably double the gelatin to get something sliceable. cozyfiendWisconsin11/21/2019I decided to make this for Friendsgiving instead of my usual cranberry chutney and it was a hit. It's a delicious cranberry sauce that's pretty easy to put together the day before. AnonymousMichigan11/18/2019What happened to the sumac? It's a match made in heaven!AnonymousLos Angeles, CA11/13/2019Explore Bon AppétitAmericanCranberryBerryFruitSideDairy-FreeNut-FreeGluten-FreeThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani", "Brad Leone"]}