{"id": "625ab87d53e216c3b28f82c6d6cf1726", "url": "https://www.bonappetit.com/story/dr-sanjay-gupta", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Dr. Sanjay Gupta Has Pretty Much Figured Out How to Live Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDr. Sanjay Gupta Has Pretty Much Figured Out How to Live ForeverWe interrogate the star of Chasing Life, who travels the world to find out how to live to a very ripe old age.By Alex BeggsApril 10, 2019FacebookTwitterEmailPhoto by John Nowak/CNNFacebookTwitterEmailIn Japan, Dr. Sanjay Gupta is shirtless again. CNN’s strong-jawed trauma neurosurgeon is searching for the secrets to a long life on his new show, Chasing Life, and this includes several hot baths. His second bath, called jikan-yu, happens to be a whopping 115 degrees (F), an illegal temperature in the U.S. (anything above 104, FYI.) He’ll descend into the onsen (hot springs) for three minutes and hope for a rejuvenated bod by the end of it. The doctor looks at the steaming bath with dread and excitement.Chasing Life explores areas known as “blue zones,” where people have lived longer than the average lifespan. In Japan, which has the world’s highest average life expectancy, Sanjay Gupta is treated by a blind acupuncturist; in India he gets an Ayurvedic oil massage administered by a guy’s feet; and in Bolivia, he undergoes a grueling stress test at high altitude.By the end of just a few screeners, I wanted to get back into yoga and eat more bitter melon. I’ve been off my game. What else could I do to live until I’m 97 with a heart that’s 20 years old, like the flirtatious dancer he meets in Okinawa? I had a quick chat with Dr. Gupta—who was in between press interviews and reporting on the opioid epidemic for CNN—to find out.I had a green smoothie, and I’m feeling pretty on top of things so far today, but something tells me you’ve done better.[I had] a Mediterranean sort of breakfast. I had some hummus, some tabbouleh as well, and some olives. My kids were doing heavy carb breakfasts, waffles and all that in the morning, and hitting the afternoon lull. Now we started doing more protein and more of a micronutrient-focused breakfast, and I feel great.What changed in your eating and exercise routine after filming?India was really interesting to me because of Ayurveda, and the food as medicine part really resonated with me. I mean literally Hippocrates said, “Let food be thy medicine,” but I don’t think most doctors, or most people, really know what that means or how to implement it into their own lives. When the Ayurvedic diet was created, they looked at food and figured out what function the food had, and what types of food would be good with other types of foods. Everything was done with a sense of purpose, whereas in most of the world when you create a diet, it’s usually based on palate—what tastes good. Now I really do think about why I eat certain foods at certain times of the day, with much more focus on the micronutrients rather than the fat, carbs, and protein. I feel good. I feel really good.The other thing is, I’ve always been sort of focused on fitness and trying to exercise every day. But whether it’s losing weight or feeling more energized, I do think that the vast majority of that comes from diet as opposed to exercise.So there’s lots of hummus and…[My wife and I] add other things to our food now. I’ve always loved turmeric, but the thing that fascinated me about turmeric was that it’s fat-soluble. That means it dissolves in fat—you have to eat it with food. In India, turmeric is just a part of the diet in every meal. They’ll sprinkle it on rice. They’ll put it in dal. They’ll add it to the various sauces, sabzis, or whatever they’re cooking. You’re always getting it at a very high absorption rate.What are some things you’d tell people to help them live longer, healthier, happier lives?Well, they’re all connected: longer, happier, healthier lives. If you take Norway, for example, at the time the happiest country in the world—it didn’t make a lot of sense initially. They thought, we’re going to be in a city that’s 270 miles north of the Arctic Circle. They are plunged into darkness for months out of the year. But it was this notion that we really thrive as human beings by overcoming some sort of challenge on a regular basis. You could put yourself in a very beautiful setting that never changes, and you would have a certain level of happiness and maybe corresponding health, but [you need to be] challenging yourself in some way. For the people who live in Norway, [the challenge is] their environment. It wasn’t that they were happy in spite of their environment; they were happy in many ways because of their environment. [In the episode, we meet a group of swimmers who plunge into the freezing sea for 30 seconds to a minute every morning.] You don’t have to live in Norway to be happy, but what is something you’re going to overcome in some way today?Then we were in Japan, and the mainland of Japan is considered one of the most stressed places in the world now. [On the show, he takes a “forest bath,” called shirin yuko, a hike through the forest.] It’s one of these things where we know it feels good to be outside, in nature. We’ve been hearing that our whole lives. But there are chemicals, called phytoncides, that basically protect nature against harmful attacks and stresses, and those phytoncides are released into the air and we have receptors for these phytoncides in our own bodies—I found that intriguing. The aroma of the forest could potentially be very stress-relieving and work as an antidepressant.When you signed on to do this show, did the CNN producers and executives mention how often you were going to be shirtless?No. No, they didn’t.Chasing Life debuts on CNN April 13, at 9 p.m. EST.Explore Bon AppétitHealthyishCelebritiesTravelInterviewsRead MoreLifestyleHow to Eat for a Longer Life (There's Still Alcohol)By Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-10", "author": ["Condé Nast", "Alex Beggs"]}