{"id": "625ec5ec81adcd1394b2f6962e1820c8", "url": "https://www.bonappetit.com/story/hooters-first-time", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "My First Time in America Was My First Time at Disney World—and Also Hooters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy First Time in America Was My First Time at Disney World—and Also HootersThis is a story about Mickey Mouse, Snow White, and a waitress named Jessica.By Zainab ShahAugust 11, 2021FacebookTwitterEmailIllustration by Areeba SidiqqueFacebookTwitterEmailI am in America and it’s my favorite thing in the world. It’s a place called Orlando, Florida, and they say there are alligators around, but I’ve yet to see one. I’ve met Mickey Mouse and Minnie too, and Snow White and a few of the dwarves. Tomorrow we’ll go back to Disney World to see the rest of it and probably meet Cinderella. I care about these people, but it’s getting harder and harder for me to admit this to my friends, so I decide I’ll keep the photos to myself when I go back to Lahore at the start of eighth grade.I ask Ama and Abu if they’ll take me bungee jumping at that place we saw on the way; it looked so crazy, probably what it feels like to fly. If I get to go bungee jumping I can show my friends those photos instead of the ones from meeting Minnie and Mickey. But Ama and Abu tell me not tonight. Tonight Abu is taking us to a restaurant that is supposed to have the best chicken wings in the world.I like chicken, and I am looking forward to tasting these wings for myself. It’s not halal, but on holiday we make exceptions.Abu has given me the restaurant’s address and I am plotting it carefully on a map in the lobby of the Holiday Inn where we are staying. The last time my brother, Ali, mapped our route we ended up in circles while Abu yelled at us for a couple of hours.My parents wait patiently, Ama in her freshly ironed white silk blouse with pearl buttons, the white cotton trousers she had stitched by a master sahib in Lahore especially for this trip to America, and beige pointy kitten heels. I wonder momentarily about the usefulness of the delicate decorative strap that buckles around her ankles. Does she think her shoes might run off on their own without them? Her gold and diamond rings, bangles, tiny but elaborate art deco earrings, perfectly blow-dried hair, red nail polish, and matching lipstick further confirm what I am beginning to suspect: Ama is not just my Ama, knower of all things, protector of me, and caretaker of my Abu. She is also a glamorous woman who is not always interested in the practicality of things. She catches me looking and smiles with her whole face, the face I love.“I wish you would leave your hair down more often,” she says to me. “If you keep doing that it’ll hurt your head and make your forehead bigger.”But I don’t know how to blow-dry my hair like hers. It is big, curly, coarse, and impossibly frizzy, so even when I try it just gets bigger. That’s why I tie my hair up, so it looks straighter, more like hers, and now her reaction confuses me. How can she tell me she loves my hair frizzy and wild, that I should always wear it like that, when hers is so perfectly smooth?Abu asks me if I’m done mapping the route and I look closely at the lines and circles I’ve drawn with a ballpoint pen. I tell him I’m done.“Are you sure? It’s okay if you need to check it again, just to make sure it’s right.”I’m sure.On the way to the restaurant I want to keep an eye out for alligators, but I am too nervous we’ll miss a turn. I check off all the street names that indicate we are going in the right direction. Then, as we turn onto Palm Parkway, I think I see it. It looks like a shaadi ghar, where weddings are held in Pakistan—flashy, with thin parallel stripes of orange neon light wrapping around every inch of the building. When we get closer I notice the outline of an owl toward the front of the building. It has a tiny mouth and eyes that are entirely too big for its body. The eyes make up the O’s that spell the restaurant’s name: H-O-O-T-E-R-S. I appreciate the cleverness behind this substitution and love the owl immediately; to my relief it has confirmed that we are in the right place. In America owls signify wisdom; I know this because I have read Wise Owl’s Story at school. But in Urdu, being an ullu means you’re silly or stupid. I’ve been called this many times, especially after parent-teacher meetings that didn’t go too well for me.Abu parks the car and in that split second before we disembark I can feel everyone’s excitement.Inside the restaurant there are so many TV screens I almost get dizzy. The host welcomes us with a big bright smile and I am convinced she is really happy to see us. She takes us to our table and tells us our waitress will be right with us. We all open our menus and toy with the idea of eating something other than wings, but in the end Abu decides for us.Then our waitress arrives. She is so beautiful. She looks nothing like the women I know. The women I love. She has golden silky hair. It is perfectly straight and tumbles down to her waist. Her eyes are green like the ocean I saw for the very first time the day before. The tips of her eyelashes almost touch the thin arches of her eyebrows. Her lips perfectly match her skin. If it wasn’t for the gloss I wouldn’t be able to tell the two apart. Then her mouth parts into a dazzling smile of tube-light white teeth.She doesn’t dress like anyone I know either. Her skin shimmers and there is so much of it to look at. Unlike my T-shirt and Ama’s blouse, her shirt begins halfway down her front and has no sleeves. A golden necklace says “Jessica” in cursive across her collarbone, and I think of Jessica from Sweet Valley High. The Owl and its eyes make an appearance on her shirt, and I suspect there is even more cleverness to them than I originally thought. Her shorts are a little bigger than my underwear, and she has some kind of shiny see-through tights on.Her beauty is so alien to me that for a split second I wonder if she is one. Then it dawns on me: I have seen her before. She is the Barbie from my toy box. Even Ali who rarely looks away from his Game Boy is sitting up and paying attention.I wonder if there are others like her. It seems impossible that there could be. I look around to confirm and realize all the women here are variations of one another. Some with shorter legs and different shades of lipstick, but all with that long straight hair and a glittery-ness that makes them seem otherworldly. They are excited and bubbly, standing tall with shoulders pulled back, zipping about the space with ease in a way that makes them even more beautiful. One of them is sitting with a customer, who to my disappointment does not look like a Ken doll. He’s hunched over, seems a little sad and might even be crying. She generously consoles him, and it makes me like her even more.We order and we eat, and Abu is in a good mood. Laughing and smiling with Ama and us, he is the Abu we love, not the one from earlier asking about the route to the restaurant. My parents are excessively kind to Jessica, saying please and thank you and “sorry to bother you but,” every chance they get. This is not how they treat the waiters at restaurants in Lahore. When we finish eating and before we pay the bill, Abu politely requests a photo with Jessica.Later in the car Abu asks us if we had a good time. We talk about the wings, but I’ve already forgotten what they tasted like.“Everyone working there was so pretty,” I say.Abu chuckles, and Ama says, “In America sometimes you have to look a certain way to get a job as a waitress. Sometimes even just any job. Women here think that being able to sell your beauty makes you freer.”“But they’re happy,” I object as I think of Jessica’s smile.“They have to be to keep their jobs,” Ama tells me.I want to argue. To me Jessica looked confident. Her uniform wasn’t like a uniform at all; it was fun. She looked like the women my Ama watched on TV, the ones she straightened her hair to resemble. I want to ask Ama about her choices, why she painstakingly irons Abu’s shirts always, but especially on holiday, and why Jessica looks like a famous person who doesn’t iron anybody’s shirts. Maybe looking like Barbie in America means you work at restaurants instead of ironing shirts for free, and for the first time that evening I wonder if going to Hooters is actually about the wings at all. But I know this might worry Ama and Abu, who already think that I should be reading Urdu plays and novels instead of Sweet Valley High. So I change the subject.After the holiday, when I go back to school in Lahore, this is the picture I show my friends: Jessica in the neon glare from all the TVs, beaming from ear to ear, surrounded by my family after having served us the best chicken wings in the world. My friends agree with me—she is beautiful—and I wonder if I’ll ever be beautiful enough to be a waitress in America.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-11", "author": ["Condé Nast", "Zainab Shah"]}