{"id": "626cb197efacd4f8942f0622e1ead6b6", "url": "https://www.bonappetit.com/story/jessica-dore-tarot-readings", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "This Twitter Tarot Reader Finds Mental Health Wisdom in her Tarot Cards | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Twitter Tarot Reader Finds Mental Health Wisdom in the CardsSocial worker Jessica Dore turns the cards into a tool for self-care and healing.By Joseph HernandezFebruary 9, 2021FacebookTwitterEmailFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Jessica Dore, a tarot card reader and social worker currently writing a book reflecting on tarot through the lens of behavioral science and psychology.Jessica Dore doesn’t have the answers. When she pulls daily tarot cards for her 132,000-plus Twitter followers or 50,000-plus Instagram followers, Dore does not forecast the future or make predictions. Instead, the social worker turned tarot reader uses the cards to give her audience daily, thought-provoking mental health advice.As a tarot reader and Big Fan of therapy myself—seriously, I can’t shut up about it—I was floored the first time I interacted with Dore’s work. I don’t ascribe to tarot’s reputation as a divination tool, but over the past decade or so, I’ve found real value in the cards as a medium for self-reflection and understanding. Dore’s daily readings echo my own practice, while also distilling teachings of compassion, empathy, avoidance, obsession, and more into 280-character nuggets of wisdom. But she doesn't shy away from the harder truths, either. “Our inability to understand reality beyond pairs of opposites (this/that, good/bad) leaves us boxed into a flat & monotone shadow box life,” she wrote recently about the Seven of Cups, which depicts jewels, a castle, and a laurel wreath floating in a cloud.Like many, I’m all but drowning from near-constant anxiety and information overload. Dore (who holds a masters degree in social work and is a former publicist for New Harbinger, a publisher of clinical psychology literature targeting therapy pros) provides a modicum of comfort. When I find myself doomscrolling, her posts of brightly colored cards from the classic Rider-Waite deck stop me in my tracks.One particular reading about the Nine of Swords—a card often associated with fear and despair that depicts a person in bed, face in hands—stood out when I was particularly anxious. “Sometimes feelings are so laden with judgments & evaluations that we lose contact w/ what’s at the heart of our experience,” Dore posted. “Feeling rejected, attacked, uncared for, all are valid. But these feelings also contain assumptions about reality that we may want to explore.” Succinct and universal, she touches on subtle but deep truths about anxiety and depression, or rest and recovery, or any number of topics, seamlessly weaving together tarot’s ancient archetypes with modern therapy.Curious about her tarot practice and self-care in a time of deep uncertainty, I called up Dore to talk about how her routines ground her, how tarot helps her make sense of the world, and how she almost ended up as a bread baker.Many of the things I talk about in my tarot practice...manifested in my own life via my relationship with food. I had an eating disorder for a long time, and that’s probably my biggest mental health challenge. A big part of my interest in psychology and understanding obsession, compulsion, anxiety, dysmorphia, control and avoidance stems from it. I’ve been in recovery for several years, but when I started doing a daily yoga practice almost 10 years ago, my practice was so rigorous, it kept me hungry. I had to eat to sustain that practice. I need routine, and yoga helped me develop regular mealtimes.Before I went to grad school...I thought I wanted to be a bread baker. I considered going to culinary school, and I even worked at a bakery here in Philly. I only worked there for two weeks—I couldn’t handle the manual labor—so I have so much respect for professional bakers. But at home, I’ve been getting back to baking bread, which reminds me of my Ashtanga yoga practice. I’ve been performing the same postures for 10 years, but every day is different depending on the temperature in the room, my headspace, whether my body feels stronger or weaker depending on the day before. Bread is the same. You may have mastered it last week, but the conditions change and now it’s a new world. Like recently, a friend and I were baking, and then it got too cold so we were putting the bowls of dough against our bellies in an attempt to warm them up—you constantly have to attend to the present moment. You can’t get caught up in the technique, like “Oh I did this one time so I’ll always succeed at achieving a great crumb.” Nope. Bread does not conform to you, you have to adapt to the bread and the conditions you’re dealt with.Baking also reminds me of...the tarot journey. The Fool starts off not knowing anything about the World but by the end of the journey through the Major Arcana, they are this beautiful dancer, like you see in the classic Rider-Waite depiction. They are dancing between certainty and uncertainty, between so many binaries and polarities, like structure and chaos. When I’m baking, I can know about recipes, measurements, and proper technique: structure. The chaos manifests as that day’s conditions, like humidity, temperature, whether the oven is working. You have to find a way to move fluidly between the present moment and your understanding of structure.I love tarot because...the cards can give you a visual language to help your creative practice, whether that’s yoga, breadmaking, or whatever art. It’s all connected, in a way. From the beginning, while I was learning the meaning of these cards, I was also at this 40-hour-a-week job reading clinical psychology literature. I was absorbing a lot of visual metaphors from the cards and then seeing similar concepts and theories playing out in the studies trying to help people understand their behavior.When I’m meeting with clients struggling to be fluid in the space between structure and chaos...I speak with them about what grounds them. I often hear “I’m confused, lost, unmoored,” which is common and relatable, but I do think that there is so much rich material to learn in those spaces if we can quell that “flight” urge. Myths and folktales always start with someone finding themselves in a dark forest, or a cave, or out at sea. Everything they once used for navigation—breadcrumbs, the night sky, their compass—no longer works, but they eventually find their way back. That universal motif teaches me there is value in uncertainty. It’s not something you have to rush out of. I don’t do therapy. I read tarot cards and write about tarot cards for a public audience. I’m not working with people in crisis. If I was a therapist and a patient was diagnosed bipolar, I would be working with them to get on a regular routine, a sleep schedule, those things are important for those people. Instead, I get to be a little bit more flexible, dance in those liminal spaces and explore different ideas.I’m not here to convince someone that tarot...is not divination or satanic. I understand why people have those associations, but I have zero interest in engaging in conversation about it. You don’t have to pick up tarot cards. It’s fine. It can be esoteric and spiritual or it can be another tool for self-care and mental health work. I hear more and more that people are using tarot in clinical settings as a tool to gather insight, which is how I use it. So people can engage on that level while others can just play with a pack of cards.I challenge the idea...that anxiety is something that needs to be released. Instead, I’ve learned to relate to it differently, thanks to the various therapies I’ve studied over the years. Of course, you want it to go away, but what are you going to do if it doesn’t? How are you going to live your life with it? Steven Hayes, who wrote Get Out of Your Mind and Into Your Life, developed a practice called Acceptance and Commitment Therapy, which helps you recontextualize and accept your fears and worries even as you live a meaningful life in alignment with your values. If I was a fortune-telling tarot card reader with 100 percent accuracy and told you that the way you feel triggered by your family, or whatever problem you’re dealing with is not going to change—it’s gonna be like that for life—then what? The focus becomes less on trying to change something you can’t to working on what you can. You still have that power.Explore Bon AppétitHealthyishSelf CareBreadPerson of InterestInterviewsRead MoreLifestyleAstrology Apps and Tarot Cards: My Pandemic Search for CertaintyBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Joseph Hernandez"]}