{"id": "6270fa789a8b203be491a4393be4b149", "url": "https://www.bonappetit.com/story/new-west-knife-works-petty-knife", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "A Petty Knife is the Longer, More Useful Cousin of a Paring Knife | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Petty Knife Is Like a Paring Knife, Only More UsefulA knife that performs with grace and power, whatever the task.By Amiel StanekNovember 10, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Want to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.After years of preaching the all-you-need-is-a-chef’s-knife-and-a-paring-knife gospel, I find myself reaching for a petty knife—the red-headed stepchild of the cutlery drawer—more often than either of my old standbys. Sure, a 3\" paring knife seems like a natural companion to your chef’s knife. But the 5\" or 6\" petty (a.k.a. utility) knife is nimble enough to accomplish the tasks of a paring knife—peeling potatoes, segmenting citrus, trimming brussels sprouts—and then some. It’s long enough to function as a boning knife, a fillet knife, even a chef’s knife. It’s the champion of the all-around: agile enough to make delicate work of veggies and sturdy enough to bone a chicken. It strikes the perfect balance between power and grace. Corey Milligan of NewWest Knife Works says he gives their petty knife to people he doesn’t know that well, since they’re guaranteed to find use for it, no matter how they cook. And with the groovy colored handles and sleek Japanese blade, they're able to spot it from a mile (or a few feet) away.Sharp, huh?Photo by Ted CavanaughNewWest Knife Works 6\" Petty Utility Knife$200 at NewWest Knife WorksMercer Culinary Renaissance 5-Inch Forged Utility Knife$28 at AmazonExplore Bon AppétitGift GuidesGiftsHoliday GiftsKnivesTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-11-30", "author": ["Condé Nast", "Amiel Stanek"]}