{"id": "627d5e9d7880fcfee01cf3e4e0bb2ca7", "url": "https://www.bonappetit.com/story/granola-butter", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "Nut Butter Wishes It Were Granola Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingNut Butter Wishes It Were Granola ButterThis oat spread is sweet, drizzly, and allergen-free—and I can’t stop eating it.By Ali FrancisNovember 30, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah Morton. Prop Styling Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are eating, drinking, and buying right now. Next up, associate editor Ali Francis makes the case for Granola Butter.A few years ago I started experiencing a strange sweating sensation after eating nut butter. I am not a scientist, but I’d guess the ailment had something to do with the way I consumed it: Heaping spoonfuls straight to the gob. Over time the idea of nut butter made me sicker than Bruce Bogtrotter (a.k.a., that kid from Matilda who loses it when he’s forced to eat an entire chocolate cake). But avoiding it altogether left a Skippy-shaped hole in my heart. What would I spread on toast? Dollop into smoothies? Eat straight off the spoon? I needed something that was like nut butter but not.Luckily, the Instagram algorithm heard my plea—it’s listening right now—and delivered the solution: Oat Haus Granola Butter. Made from oats, flax, olive oil, maple syrup, coconut oil, and spices, it’s nut butter’s younger, more complex cousin. (It’s also nut-, dairy-, soy-, gluten-, and GMO-free, which is great if you swing that way.) Each flavor combines a cinnamon-y granola vibe with a texture that’s similar to slightly-grainy-in-a-good-way tahini. Meaning, it’s easier to drizzle over ice cream than your average store-bought PB, but it’s not so runny that you can’t slather it on toast. Nut butter wishes it were Granola Butter.Photograph by Isa Zapata.  Prop Styling by Paige HicksOat Haus Organic Original Granola Butter$13 at Amazon$10 at Thrive MarketThe Strawberry Shortcake, my favorite flavor of the bunch, is laced with freeze-dried strawberries for a sweet-tart kick. A spoonful of Vanilla Granola Butter is luxe and creamy, like a scoop of cake batter. The Original is akin to eating a liquified, buttery oatmeal raisin cookie—only without the chunky raisins. And the Chocolate is rich enough to squash afternoon office cravings but not so sweet that you’ll fall asleep while typing. You can order individual jars willy-nilly, of course, but all four come in the best-sellers variety pack, which is a better value and more realistic; once you start eating this stuff it’s impossible to stop.Oat Haus Organic Chocolate Granola Butter$13 at Amazon$10 at Thrive MarketDespite it being a nutritious and allergen-free product, I also love that the super-playful Oat Haus brand centers flavor over “function.” According to cofounder and creator Ali Bonar, that was by design. After a decade struggling with disordered eating, she wanted to develop a product that made food fun again. “I spent so many years fearing it, and that’s no way to live,” Bonar says. “Food should be emotional. It should be how we connect with others, it should bring us joy, it's meant to be played with.”When temps drop into the 30s, I like to go big on the cozy and spoon whichever GB flavor I see in my pantry first over hot porridge. Artfully blooped on yogurt with some coconut, berries, and seeds is an obvious but worthwhile choice. Slather it on sourdough and top it with fruit. Fill an ice-cube tray with Granola Butter, freeze it overnight, and you’ve got fudge-like cubes you can snack on whenever the mood strikes. And I just noticed this GB & J ‘quesadilla’ recipe on the Oat Haus Instagram account, which is exactly how I’m going to empty my last jar. No sweat: I’ve got another variety pack en route.Granola on the brain?Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-30", "author": ["Condé Nast", "Ali Francis"]}