{"id": "628bf24c46984f079fab1652462c7692", "url": "https://www.bonappetit.com/story/what-is-aleppo-pepper", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "What Is Aleppo-Style Pepper and How Spicy is It, Really? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Aleppo-Style Pepper and How Spicy is It, Really?So what is Aleppo-style pepper and why do we keep talking about it? Read on, friends.By Aliza AbarbanelFebruary 5, 2018FacebookTwitterEmailFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.We’re not normally in the business of playing favorites, but our love for Aleppo-style pepper is undeniable. A little sprinkle of the deep red, mild chile flakes will bring out the flavor of everything on your plate, from roasted tofu and grilled clams to basic microwave popcorn. But what is Aleppo pepper, exactly? You deserve some more info before adding another jar to that rack.Where it comes from:Named after the northern Syrian city of Aleppo, this spice is now largely sourced from Turkey and elsewhere, due to the challenges of growing and exporting from the war-torn Syrian region. It comes from a burgundy chile also known as the Halaby pepper. Once ripened, the peppers are semi-dried, de-seeded, and coarsely ground. Aleppo is a common Middle Eastern condiment, traditionally used to season meat, beans, salads, and muhammara dip, but it can be used like any other dried red pepper.Why we love it:This spice about half as hot as the crushed red chile flakes you put on your late-night dollar-slice pizza, and easily twice as flavorful. Like salt, Aleppo-style pepper is a flavor enhancer. It marries slow-building heat with earthy, cumin-y undertones and a little hit of fruity tang—and yes, it’s as delicious as it sounds.What to look for:Good Aleppo-style pepper is flaky, semi-oily, and has a rich burgundy color. It should smell bright and fruity, with a super-savory finish reminiscent of sun-dried tomatoes.Where to buy it:The war in Syria has made Aleppo-style pepper increasingly difficult to find. Many Syrian spice growers have moved their operations north to into Turkey in recent years, and the pepper is now grown in the U.S., so you can probably still find Aleppo-style pepper on shelves. Check your local Middle Eastern grocery store or spice shop, or buy it on Amazon. Just make sure it's \"Aleppo\" or \"Aleppo-style\" you're getting and not a darker, smokier spice like Urfa Biber.How to use it:Add Aleppo-style pepper to oil for a stand-out roast chicken marinade, rub it on roasted vegetables, add it to salad dressing, or even use it to rim a cocktail glass. Really, add this spice to anything that calls for a layer of slow-building heat. Aleppo-style pepper is sold de-seeded and coarsely ground, so it's mellow enough to act as a finisher—so please, feel free to sprinkle a hearty pinch on anything that needs a little extra punch.Use Aleppo-style pepper to cut through creamy miso dressing and more:Roasted Broccoli and Tofu with Creamy Miso DressingToasted sesame seeds can often be found in the Asian sections of some supermarkets, sometimes labeled Gomasio. If ever there was a time of year to keep a big jar of them on hand, pre-toasted and ready to go, this is it. They are the perfect crunchy topper for everything from salads to soups and roasted vegetables.View RecipeBraised Greens with Aleppo Oil and FetaAlso known as the “cooked to hell” method, this braise renders the greens meltingly tender.View RecipeQuick Aleppo Dill PicklesView RecipeExplore Bon AppétitHealthyishAleppo PepperSpiceRead MoreLifestyle12 Essential Middle Eastern Ingredients and Where to Buy Them OnlineGallery12 SlidesBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-05", "author": ["Condé Nast", "Aliza Abarbanel"]}