{"id": "6298c7b483a31855110c5933b63f04dd", "url": "https://www.bonappetit.com/story/chicken-salad-rules", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "How to Make the Best Chicken Salad According to Molly Baz | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm So Passionate About Great Chicken Salad, I Made a ChecklistI'm righting the wrongs done to chicken salad.By Molly BazMay 6, 2020FacebookTwitterEmailPhoto and Food Styling by Molly Baz FacebookTwitterEmailNo one ever accused senior food editor Molly Baz of not having enough opinions about food. In Molly’s Got Thoughts, she’ll dive deep into some of her favorite dishes and, along the way, drop looooots of knowledge for how you can achieve the best version yet. Today: The do's and don'ts  of chicken salad.Let’s talk about chicken salad. It’s a dish that doesn’t get much attention in this world, and, frankly, I think it deserves more. It’s clearly one of the greatest ways to transform cold leftover roasted or poached chicken into something far greater than the sum of its parts. And, when executed properly, it absolutely SLAPS. But when thrown together carelessly, chicken salad dramatically FLOPS.The key to a great chicken salad boils down to respecting its most fundamental elements. So, let’s take a look at those components, to find out what sets a superlative chicken sally apart from a dismal one:1. Breast meat is the best meat.This is a statement that rarely holds true, except in the case of chicken salad. Since chicken salad is served cold, chicken breast is preferable—it’s got a much more pleasant mouthfeel than dark meat when eaten at lower temps. Dark meat, which comes from chicken legs, contains a lot of connective tissue and fat, making it extra juicy and delish when enjoyed warm but unappealing and chewy straight from the fridge. So, white meat in our chicken salad it is, but with one caveat: It must not be overcooked! If you need a little assistance with that, follow our foolproof method for properly poaching breasts. Because poaching is a “wet” method of cooking it guards against overcooked breasts. But if you’ve made a (properly) roasted chicken—with breasts that are not dry—that’s also a great option. The next time you sit down to a roast chicken dinna, go for the dark meat first, and save the breast meat for leftovers.2. Fat is your friend—until it's not.Chicken breasts are naturally lean, which means they beg for some fat to keep things juicy. Mayo is an obvious choice here, but anything thick and creamy to bind that meat together will work: Sour cream! Crème fraiche! Whole-milk yogurt! You decide. Just don’t forget that it’s called chicken salad—not mayo salad. Let the chicken be the star, and add that mayo little by little until you strike a perfect balance. There’s nothing worse than a mouthful of chicken salad that is 75 percent mayonnaise.3. All about that CRONCH.The easiest way to take that chicken salad to the next level? A little bit of texture. There’s a reason those classic mayo-based salads usually contain some amount of celery. The crunchy, juicy pops of texture break up some of the monotony of the mayo-meat mouthful. And while celery is a fabulous choice, the fun doesn’t stop there. Other crunchy veg like cucumbers, radishes, and pickles (or even toasted seeds or nuts!) are just as welcome at this rager.4. There's no \"fruit\" in the words \"chicken salad.\"Which means there shall be exactly zero grapes, Granny smith apples, or other inappropriately sweet, frooty tooty things in the mix. Sorry, Waldorf. I respect your heritage but disagree with some of the choices you’ve made in life.5. Salt is the spice of life.Yep, me again, here to nag you about the importance of properly seasoning your food. I am nothing if not consistent, okay?! Not only should you season those chicken breasts before poaching or roasting them, but you’ll also need to season the mixture as a whole. Salt balances the fat of mayo and its creamy comrades while enhancing all of the other flavors present in the salad.6. A little acid goes a long way.As long as there’s salt and fat in your chicken salad, you’re gonna need a hit of acid too (does the name Samin Nosrat ring a bell?). That acid can take the form of citrus (lemon, lime) or vinegar (red wine/rice/ apple cider/champagne vinegar, pickle brine, hot sauce) and functions to balance out the fat and make all of the other flavors in your chicken salad pop. Add it little by little until your salad is lookin’ saucy and things start to taste suspiciously delicious.Once you’ve checked off those boxes, there’s no shortage of possibilities when it comes to flavor. Think beyond plain ol' mayo. Olives, capers, pickles, horseradish, pesto, chili oil, tender herbs, and citrus zest all make excellent additions to chicken salad.Once you’ve nailed the base components, nothing can come between you and bomb.com chicken salad sandwich. Or maybe you’re more of a lettuce wrap kinda gal, like me? Oh, you prefer to scoop your chicken salad on to Ritz crackers, you say? BLESS.Heck, I’ve been known to eat it straight out of the bowl.Explore Bon AppétitMolly's Got ThoughtsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Molly Baz"]}