{"id": "62986de189f7062fdbc7258fdfa9b316", "url": "https://www.bonappetit.com/story/blood-bros-bbq", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Blood Bros. BBQ Is Where Texas Meets China Meets Vietnam | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTexas Meets China Meets Vietnam at Blood Bros. BBQAt the Houston restaurant, actual brothers Robin and Terry Wong and pitmaster Quy Hoang bring their respective roots to barbecue.By Daniel VaughnAugust 26, 2019FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.They were the pop-up barbecue kings of Houston. Determined to offer a new perspective on Texas barbecue, brothers Robin and Terry Wong, who also operate a karaoke bar, and their best friend from high school, pitmaster Quy Hoang, spent their weekends setting up shop in various bars around the city, playing tunes and slinging pork ribs and their famous gochujang beef belly burnt ends to a growing crowd of devotees. Then late last year they went permanent, opening up a no-frills space dubbed Blood Bros. BBQ in Bellaire, on the city’s west edge. Here, they blend flavors from the Wongs’ Chinese heritage and Hoang’s Vietnamese roots with the Texas barbecue they grew up with, unafraid to test the boundaries of tradition. We met up with the trio to break down each item on a classic tray, from the hot-smoked meats to the soy-laced sauces.Brisket Fried RiceWhen slicing brisket, Hoang saves the burnt ends for fried rice, his best-selling side. The familiar peas, carrots, and eggs are plenty visible, but the unique tang comes from Hoang’s secret ingredient: kimchi.Smoked Turkey Banh MiA crusty-yet-fluffy baguette from the French Riviera Bakery down the street gets layered with smoked turkey, house-pickled daikon, jalapeños, and a nice thick schmear of Terry Wong’s house-made chicken liver pâté.Thai Peanut Butter Sticky RibsBarbecue purists, avert your eyes. These pork ribs come slathered in an umami-rich blend of peanut butter, ketchup, soy sauce, and Thai red curry paste—with chopped peanuts and Thai chiles for texture and heat.Smoked BrisketA Pitmaker offset smoker is Hoang’s weapon of choice. He bathes his beef in oak and pecan smoke for more than eight hours. The seasoning is pure Texas: salt, pepper, garlic, chipotle powder, and a kick of cayenne.Thai Green Curry BoudinHoang makes curry sauce with lemongrass and Thai basil, then adds pork shoulder, pork liver, jasmine rice, and sticky rice. “I mix my rice right into the curry when I eat Thai food,” he says, “and that’s basically what this boudin is.”Explore Bon AppétitBarbecueTexasChineseVietnameseDish DecodedRead MorecultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenrestaurantsTurkey Tails Are The Most Delicious Thing You Didn’t Even Know You Could EatBy Elyse InaminecultureThe Halo-Halo at Philadelphia’s Sarvida Is 5 Layers of PerfectionBy Amanda ShapirocultureThis Dive Bar Is Turning Out the Best Burger in OaklandBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-26", "author": ["Condé Nast", "Daniel Vaughn"]}