{"id": "629ad44234afd116007f1ce814b25dce", "url": "https://www.bonappetit.com/recipe/crab-paste-grilled-rib-eye", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Crab-Paste-Grilled Rib Eye Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueCrab-Paste-Grilled Rib EyeBy Silver CouslerMay 25, 20214.3(16)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThe summertime ceremony of cooking over fire will never lose its charm for me. Plus, there’s just no better way to cook a thick steak—it’s the only way to get the high heat you need without setting off the fire alarm. A perfectly marbled rib eye doesn’t need much to shine, but basting it with jarred crab paste adds a whole new level of flavor with almost no effort. Crab paste tastes like a cross between my two favorite Filipino condiments—bagoong, a fermented fish paste, and crab “fat,” a mixture of the crustacean’s guts and roe—and lends a pleasant intensity to an already-gorgeous cut. —Silver Cousler, Neng’s Jr., Asheville, NCThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksLarge Basting Spoon$16.37 At AmazonCutting Board$10 At IKEAIngredients4 Servings6Tbsp. vegetable oil, divided, plusmore for grill11¼-lb. bone-in rib eye (about1½\" thick)Kosher salt, freshly ground pepper1lb. yu choy or bok choy, halvedlengthwise if large2scallions, cut into 1\" pieces2garlic cloves, crushed1lemongrass stalk, bottom third only, tough outer layers removed, chopped13\" piece ginger, peeled, thinly sliced½cup crab or shrimp pastePreparationStep 1Prepare grill for medium-high heat; oil grill grate. Place a large cast-iron skillet on grill. Season steak generously on all sides with salt and pepper; drizzle with 1 Tbsp. oil and rub to coat.Step 2Place yu choy in a large bowl; drizzle 1 Tbsp. oil over and season with salt. Toss to combine.Step 3Grill steak on grate until deeply browned, about 2 minutes per side.Step 4Meanwhile, heat remaining 4 Tbsp. oil in skillet. Cook scallions, garlic, lemongrass, and ginger, stirring, until fragrant and starting to brown, about 1 minute. Stir in crab paste.Step 5As soon as crab paste mixture is bubbling, transfer steak to skillet. Cook, basting and turning every few minutes, until medium-rare (an instant-read thermometer inserted into the thickest part should register 125°), about 7 minutes. Transfer steak to a cutting board; let rest 10 minutes. Set skillet with sauce aside.Step 6Grill yu choy, turning occasionally, until wilted and charred in spots, about 6 minutes. Transfer to a serving bowl.Step 7To serve, cut meat from the bone and slice against the grain ½\" thick. Arrange on a platter and pour reserved sauce over. Serve with grilled yu choy.How would you rate Crab-Paste-Grilled Rib Eye?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleGreat recipe!!! Love it. OlgaNewport, RI8/11/2021I used a flank because that’s what I had on hand. I loved it. Where has crab paste been my whole life? \n\nSuper tasty and different. Kimmy New Orleans, LA8/2/2021I was looking forward to making this but will not make it again. Felt like I wasted a great ribeyeAnonymousAlexandria, VA7/31/2021I baste my steak with miso paste disolved in fish sauce and soy sauce. It gives it that funky taste of a well aged steak.GeneBloomington, Indiana7/18/2021We loved it!  Maybe use less oil. I made it the first time with bok choy but from now on I'm just going to make the steak with the sauce.SusanNew Jersey7/18/2021Sorry but this was a ‘mis-steak’.  Not a fan & I ruined a beautiful rib eye. AnonymousNew York, NY6/19/2021Explore Bon AppétitRib Eye SteakSteakBeefMeatBok ChoyLeafy GreensVegetableLemongrassHerbs & SpicesSummerQuickEasyMainDairy-FreeGluten-FreeNut-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Silver Cousler"]}