{"id": "62a01e2aaef4ecd46baa5e82994fac7e", "url": "https://www.bonappetit.com/story/best-way-to-cook-brown-rice", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "How to Cook Brown Rice Like a Pro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Brown Rice Like a ProThere’s no one way to do it, but these tried and true methods will set you up for brown rice success.By Chris MoroccoMarch 1, 2022FacebookTwitterEmailAlex LauFacebookTwitterEmailMy mom just wanted us to eat whole grains. Whether that meant slipping some whole wheat flour into pancakes, cooking brown rice with dinner, or packing me and my sister off to school with bread we thought tasted like cardboard, she never gave up. Now that I am a parent, I share her desire to get my own kids to learn to love the nutty complexity of whole grains, and have adopted her tendency to quietly slip an ever-increasing ratio of whole wheat flour into pancakes and waffles.Brown rice always posed a particular challenge for my mom, and it wasn’t until I was an adult that I learned how to cook it so it was tender, but not mushy, with a bit of al dente chew to it. I guess the word I would use is bouncy? The absorbency of rice, and the bran attached to brown rice in particular, makes it particularly prone to turning to mush. For some dishes, like sushi, I’ll still choose white rice because its flavor is so unobtrusive. But in fried rice, stir-fries, grain bowls, and as my go-to side dish, I actually prefer the nutty intensity of brown rice. When it comes to how to cook brown rice, though, there’s a shocking amount of bad info out there, whether it comes from the instructions on the bag of rice or the directions on your rice cooker.Genmai is a type of brown rice popular in Japanese cooking known for its chewy texture and nutty flavor.\nPhoto by Alex LauSo take solace in knowing that your inability to make brown rice that is pleasantly al dente and not mushy is not your fault. Below you’ll find four fail-safe approaches to making the best fluffy brown rice of your life. These methods can be used for short-grain or long-grain brown rice alike, including varieties like brown basmati rice and brown jasmine rice. And before you ask: Whether you choose to rinse your rice is a personal choice—some sources say you don’t need to rinse brown rice at all. Our opinion: For the fluffiest brown rice possible, rinsing is the way to go.How to cook brown rice in a rice cookerIn the Bon Appétit test kitchen, our fancy rice cookers—the kind with computer chips and special settings for different types of rice—have always worked perfectly for white rice. Brown rice, however, used to come out a bit mushy and overcooked.I called Zojirushi, the brand of rice cooker we’ve always sworn by, and spoke with Marilyn Matsuba, its marketing manager. It turns out she’s heard this feedback before, specifically from users outside Japan. In Japan, she told me, people often prefer brown rice a good bit softer and stickier, while Americans tend to prefer a much firmer grain.If you, too, want a firmer grain with dinner, the trick then is to cook brown rice on the white rice setting. Matsuba confirmed that, as long as you pour in enough water (i.e., add water to the mark indicated for brown rice inside the cooking pot), cooking brown rice on the white rice setting is perfectly fine. The resulting grains are perfectly distinct and chewy-tender. Bonus: The white rice setting cooks those grains in nearly half the time.Side note: You know what the brown rice setting is great for? Cooking super-dense whole grains like spelt, rye, einkorn, whole barley, and whole farro. You can even mix handfuls of several grain varieties and cook them all together.If You’re Serious About Rice, You Need This Rice CookerIt’s the unofficial appliance of the BA test kitchen.View StoryHow to cook brown rice in an Instant PotIf you haven’t gotten around to grabbing a rice cooker but were all over the Instant Pot craze, there’s good news (and a pot of perfect brown rice) in store for you. Pressure cookers like the Instant Pot make cooking brown rice more straightforward than ever, according to chef Tyler Kord. For this quick-cooking method, stick to a 1:1 rice-to-water ratio on high pressure for 15 minutes. Then use the Natural Release setting for perfectly cooked rice. Kord points out that using Natural Release won’t save you much on total time, but, like using a rice cooker, the method is mostly hands-off and a cinch to execute.I'm a Professional Chef and I'm Proud to Say That I Love My Instant PotWell, there ARE a couple of caveats. View StoryHow to cook brown rice on the stove (the standard method)This method is for the days I’m not rushing and don’t really care how long it takes to cook brown rice—it’s also especially good for maximizing the nutty flavor. While this process follows the one on the back of many bags of rice, the key difference in our technique is the ratio of water to rice: We recommend 1¾ cups of water for every 1 cup of brown rice. Salt is essential: Use about ½ teaspoon Diamond Crystal kosher salt (or a heaping ¼ teaspoon Morton kosher) per cup of rice. Bring the rice to a simmer in a heavy-bottomed medium saucepan over medium-high heat, then reduce heat to a simmer and cook, covered, until rice is tender and water has evaporated, 40–45 minutes. Fluff gently and let sit, covered, off heat, for 10 minutes to make it as light and fluffy as possible.How to cook brown rice on the stove (the faster way)Do you want the most distinct, beautifully separated, fluffy-tender grains of rice possible, even on the busiest of weeknights? Forget what you’ve heard about how long it takes to cook brown rice on a stovetop. Grab a large pot, your strainer, and say goodbye to both undercooked and mushy rice forever.The best thing about this method: The amount of water you use doesn’t matter. That’s because I’m talking about boiling the rice like pasta in a pot of salted water until it’s al dente—cooking time is about 25–30 minutes. Drain the rice, then return it to the warm pot for 10 minutes, covered, off heat, to steam and get even fluffier and drier.While I was very skeptical about this supremely easy recipe before trying it, it’s actually how I like to cook quinoa and most other grains, and it works just as well for rice. Some of the rice’s flavor does get lost to the excess water—chances are you won’t notice—but so does the starch and anything else clinging to the grains, which means that even if you’re a rice-rinsing devotee, you really can skip that step when choosing this method.Phew. You made it. Welcome to the world of people who love and know how to cook brown rice—and the total time to get here took less than an hour. Now pick a method and try it in one of these all-star brown rice recipes:Crispy Rice With Ginger-Citrus Celery SaladTo get the best texture, evenly distribute the rice in your pan and gently press down to flatten it. Don’t touch until you hear it crackle!View RecipeCrispy Brown Rice “Kabbouleh”Is it crazy to cook rice, dry it out, and then deep-fry it? Maybe a little bit. But when you taste this unique and addictively crunchy twist on tabbouleh, you’ll appreciate the effort.View RecipeFried Brown Rice with Kale and TurmericYes, fried rice for breakfast counts if there's an egg (or 3) in it!View RecipeEditor’s note: This story has been updated by Mehreen Karim since it was originally published in April 2017.Explore Bon AppétitHealthyishBrown RiceRead MoreBrown Rice Salad with Crunchy Sprouts and SeedsThe Perfect Pot of RiceLemony Lentils and Rice With Caramelized Onionsrecipes71 Creative Rice Recipes Using Our Favorite Pantry StapleGallery71 SlidesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-04-20", "author": ["Condé Nast", "Chris Morocco"]}