{"id": "62bfbbc98cacc3a99a1cba27e67ccefe", "url": "https://www.bonappetit.com/story/never-fail-roasted-butternut-squash", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "This Roasted Butternut Squash Recipe Is More Reliable Than Any Airline | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Roasted Butternut Squash Recipe Is More Reliable Than Any AirlineI just can't get enough of this soy-chile paste combo.By Alyse WhitneyJanuary 12, 2018FacebookTwitterEmailDanny KimFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the spicy roasted butternut squash recipe that associate web editor Alyse Whitney gets emotional over.Spicy food makes me sweat and cry. Seriously: The slightest hint of red pepper flakes in pasta or a jalapeño in guacamole can set me off. In spite of this extreme reaction, I will never stop eating gochujang-and-sesame-laced roasted butternut squash, one of my favorite Bon Appétit recipes of all time. I've lost count of how many times I've made it for my weekly meal prep, random weeknight dinners sides, or even an unexpected breakfast. (I like crying in the morning, what can I say?) Plus, the recipe is so simple I've got it memorized, ready to rattle off via text to a friend, out loud at the farmers' market, or (maybe too) enthusiastically to someone in the elevator at work. (All real-life examples. I love this squash.)It's laughably simple, and the only special ingredient is gochujang, a fiery Korean chile paste. I sometimes make it with sambal oelek, a vinegary Indonesian chile paste, and use a little bit less of it so I don't end up sobbing uncontrollably. First, preheat the oven to 425°. Then whisk together the dressing in a large bowl: 2 tablespoons sesame seeds, 2 tablespoons vegetable oil, 1 tablespoon gochujang, and 2 teaspoons soy sauce. Prep a medium butternut squash—peel it, take out the seeds, slice thinly—and toss it all in a bowl with all that sauciness. Divide the dressed squash onto two rimmed baking sheets and cook for 25–30 minutes, flipping halfway through if you remember, until they're caramelized and crunchy on the outside and tender inside. Make it rain scallions and flaky sea salt for garnish. And there you have it: The most reliably delicious recipe you've ever had. Whenever they're in season, I use delicata squash—you don't have to peel them, they don't have too many seeds to scoop out, and they slice into nice half moons. Acorn also works just fine.Sesame-roasted squash would be a great topper for this grain bowl.\nAlex LauSometimes I just pick these up and snack on them while watching TV after I've made a big batch. Other times I put them over a bowl of seaweed rice—a pack of nori blitzed in the food processor with toasted sesame oil, soy soy sauce, and vegetable oil, then folded into hot sushi rice—or mix into a medley of other roasted vegetables. It's also a great grain bowl topper for leftover lunches. The salty-spicy combination puts me on the edge of my spice threshold and makes me sweat out all the toxins in my body. If I really need a good cry, I put in extra gochujang, put on This Is Us, and let it all out. That's my kind of therapy.Get the recipe:Gochujang-and-Sesame-Roasted Winter SquashView RecipeExplore Bon AppétitWinter SquashSquashgochujangRead Morerecipes19 Gochujang Recipes to Give Your Food Some Sweet, Sweet HeatGallery19 SlidesBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-12", "author": ["Condé Nast", "Alyse Whitney"]}