{"id": "62d0abfd04d995131c6d6816f9fe398a", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/butagumi", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Butagumi Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoButagumiPork cutlets taken to a higher playing field.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: to experience the religious power of properly fried pork. Thanks to a kitchen that operates with a level of skill and craft befitting of one of Tokyo’s best restaurants, the tonkatsu—breaded deep-fried pork cutlets—exists on a higher plane than any other in the city. The meats are luxurious and the cooking is obsessive in detail. This isn‘t a taste of what tonkatsu has been—it‘s a taste of what it‘s become.ORDER THE: pork of your choice in the thickness you deserve. While the menu is based on a rotating selection of heritage pork, meaning that each visit might present different options, you’ll always get to select how thick you want your cutlet. Most pork will have regular or deluxe options with certain types available as “extra-fatty super deluxe.“ Be on the lookout for the two-month aged pork belly tonkatsu or the Iberico pork from Spain.THE VIBE IS: quiet. Butagumi occupies an old house in the Nishi-Azabu neighborhood, and its iconic moon-shaped window on the second floor makes it easy to spot from the street. Despite its high pedigree, dinner here is a relaxed affair.PRACTICAL STUFF: Opened from Tuesday to Sunday. Lunch is between 11:30 a.m. and 2 p.m., and dinner is from 6 p.m. to 10 p.m. Closed on Mondays. The staff speaks some English and the menu is available in English as well. Reservations are recommended. The nearest subway station is Roppongi (it’s a bit of a walk from the station).Photo by Xavier Girard LachaîneLook for the moon-shaped window on the second story.\nPhoto by Xavier Girard LachaîneThe chefs at Butagumi are details-obsessed.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}