{"id": "62d95fda3cf6910fdda36840bc9bb6b0", "url": "https://www.bonappetit.com/story/breakfast-burrito-to-go-wow-so-fast", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "A Breakfast Burrito Recipe You Can Take To-Go, Because Life Moves Fast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLife Moves Fast. That’s Why You Gotta Take Your Breakfast Burrito To-Go.And inside that burrito, there’s a layer of fluffy egg that will change your burrito technique forever.By Alex BeggsMay 17, 2018FacebookTwitterEmailPhoto by Chelsie Craig,  Food Styling by Yekaterina BoytsovaFacebookTwitterEmailIn the Planet Earth Volume 4 documentary of my life, you’d witness me staring into a bubbling skillet of eggs, my hair twisted in a towel, Walmart slippers looking a little worse for wear. And here she is, the American Female, trying to find something new to eat for breakfast.But then the music would abruptly transition from ambient aquatic sounds to a jazzy number–Planet Earth’s a musical now!—because WAIT A SECOND SHE DID.She’s making a breakfast burrito with an egg rolled up inside!!!So there she is, standing in front of the eggs, because that’s all you need to do. Two, three eggs, whisked a little, and then left to bubble and solidify in the pan, 2-3 minutes. Then you flip the egg crepe creation. This flip sounds harder than it is, because flipping can be stressful. But even when I did a sloppy job, the side of the egg I’d been cooking was forgiving, and I spread the egg crepe back into place with my spatula. A few seconds of cooking later, slide it onto a warmed tortilla.Optional, but are they, really?\nPhoto by Chelsie CraigFrom there, add your toppings—cheese, avocado, sour cream, hot sauce, healthy green things—and then roll the burrito in some aluminum foil. DO NOT skip this step. This makes the burrito convenient to stash and take to work, yes that’s the point. But it also steams the eggs and melts the cheese. Steamed eggs are fluffy eggs, fluffy eggs are a goddamn delight. So even if you’re eating at home, let it steam in there, slice it in half, and then un-foil your beautiful burrito. I’ve made this three times this week, which is more than I can say for flossing.I used to softly scramble eggs with cheese, throw them in a tortilla, have a ball. But something was missing, and it was that complete layer of fluffy egg. You get egg in every bite; none of those dry all-tortilla bites. Curds of scrambled eggs don’t fly out on a rogue mission for your cat to conquer. Maybe I’m getting granular here, but that’s sort of my job. Our job. To overthink breakfast. To turn breakfast into a moment so important, you’d narrate it to yourself as you stand in front of the stove, thinking about your goals for the day, and if you’ll need to pack an umbrella.Get the recipe:Breakfast Burrito to GoThe layer of fluffy egg inside will change your breakfast burrito expectations forever.View RecipeExplore Bon AppétitBreakfastBurritoEggRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Alex Beggs"]}