{"id": "62ddc3d60d3f9b1cc3c628cab07db5b5", "url": "https://www.bonappetit.com/story/restaurants-are-hanging-by-a-thread-edward-lee", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Restaurants Are Busier Than Ever, But We’re All Hanging By a Thread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRestaurants Are Busier Than Ever, But We’re All Hanging by a ThreadChef Edward Lee shares how independent restaurants are still struggling to find workers and source ingredients—and why he’s still hopeful.By Edward LeeAugust 5, 2021FacebookTwitterEmailA busy night at Savage restaurant in St. Louis, photographed before the COVID-19 pandemic.Photo by Laura MurrayFacebookTwitterEmailThe worst of the pandemic shutdowns are over, I am told, but I am still a nervous wreck. PPP and grants saved independent restaurants from closing and business is booming, I am told, but I am still worried about my restaurants. Food costs are at an all-time high. Scallops are 40 percent more expensive, shallots are up 44 percent, brussels sprouts are up 32 percent. Some weeks I can’t find chicken wings. And when thousands of restaurants across America tried to reopen all at the same time this past spring, I knew an employee shortage was bound to happen. But for it to last this long, you couldn’t predict that.So here we are, struggling to find workers, supplies, and ingredients for our restaurants. In the past three months, I have picked up shifts in every kitchen position; I’ve been a bartender, a host, a waiter. I have driven across town to buy ingredients from grocery stores when our purveyors shorted our deliveries. My restaurants are busier than ever—and yet we are all hanging on by a thread.Many of these industry problems were inevitable, as farms cut down on production during the pandemic and restaurant workers in search of a different lifestyle found jobs in other industries. Many of these issues were things we tried to address with the LEE Initiative. When the pandemic shut down restaurants in March 2020, we started opening relief kitchens to feed unemployed restaurant workers, not only because it was a need but because it was a way to acknowledge that all workers are essential. But it was impossible not to feel abandoned when you lose your job or get furloughed, and there is nowhere else to turn.Last summer we saw small farms suffering because they had no one else to sell their products to with so many restaurants shut down still. So we gave them grants to keep them in business and they gave their surplus ingredients to restaurants that were feeding their communities. I’m proud to say that every one of the 63 farms we helped is still in business, but all of them had to cut down on production not knowing what the future would hold.Now we are experiencing a pivotal time of upheaval and transition. The work of the LEE Initiative has always been about long term solutions of equity and diversity. And it is critical now more than ever to keep the work going of rebuilding our industry in a kinder, more transparent, and equitable manner. We keep pushing for women leadership in our industry; we have expanded our mentorship program beyond chefs to spirits professionals. We are funding programs for diversity and giving young kids opportunities in our restaurants. With Southern Restaurants for Racial Justice and Heinz, we have given out over $1 million in grants to Black-owned restaurants around the country, many of whom did not receive their PPP or other grants. Together they represent the future.I am often asked about the essay I wrote during the pandemic about how it was too late to save independent restaurants. It is too soon to say what will happen to independent restaurants. We are still in a crisis. We are not out of the woods. There is so much that is uncertain. Chefs and owners are facing dwindling profits as prices for everything skyrocket. Farmers and purveyors are trying their best to fill the demand. Workers deserve better and they are demanding it. They have every right to be angry, to be disappointed.But let’s not forget the innovative spirit of chefs and restaurateurs who survived the pandemic. Let’s not forget all the ways restaurants pivoted and worked their fingers to the bone just to stay afloat. Let’s not forget about chefs like Tom Colicchio, Naomi Pomeroy, José Andrés, JJ Johnson, Chris Shepherd, Erik Bruner-Yang and so many others who pushed for our industry and helped people in need. We should take a long pause and thank them for their tireless efforts. They represent the best in all of us.How do we save independent restaurants? By doing the slow and important work of building back trust, not only to our customers but to the millions of dedicated workers who are the backbone of this magical industry. It will take time. It will take us making sure our promises are upheld. It will take respect and transparency and community. But it starts with us. Hospitality begins at home. That is what independent restaurants have always excelled at, and we will rebuild again with policies and practices that will show the world how we can be better. This means first listening to my staff and making sure they have an open door of communication to me. Then it requires pay gaps to be corrected, transparency between owners and workers. I don’t want to get too much into this—these things differ from state to state, restaurant to restaurant, and that’s a whole other essay—but overall we need to offer better packages for workers. This is what we must do to show respect to every individual that works in our industry. This is what I am working on in my restaurants. We aren’t perfect, but we are always working towards change to make things better.All this gives me hope for the future. I wouldn’t be running restaurants if I didn’t believe it would survive. But there is going to be a long and bumpy road ahead of us. Hopefully, we can preserve the best of what we have learned about hospitality and make it better. We know that we can’t go back to all the ways of restaurants before the pandemic. But we can’t burn it all to the ground either.Explore Bon AppétitRestaurantsRestaurant DiariesFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-05", "author": ["Condé Nast", "Edward Lee"]}