{"id": "62e557ea09990afd7d8700690368528f", "url": "https://www.bonappetit.com/story/feel-better-chicken-soup", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "This Cozy Chicken Soup Is Getting Me Through Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cozy Chicken Soup Is Getting Me Through WinterMake this dish when you need a warm spot in the loooong cold.By Dawn DavisDecember 23, 2021FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.With so much focus on COVID-19, I can’t remember the last time I interacted with anyone grappling with a cold. Yet within the last week, it seems that colds are suddenly back in vogue. When the folks in my life get a cold, I’m an evangelist for the healing powers of chicken soup. For my go-to, I smash star anise, whole cinnamon sticks, ginger, and green onions before sautéing them in chili paste and adding chicken parts, a little fish sauce, and lots of soy to make a warming, comforting, and absolutely delicious soup.As much as I love it, however, even I sometimes need an alternative, especially when it seems like everyone—children, neighbors, and colleagues alike—are sniffling and sneezing, and I have to make my old chestnut again and again. Thankfully, our archives are full of options; there are over 20 in this gallery alone. Of all of variations, I was most drawn to Andy Baraghani’s Feel-Better Chicken Rice Soup, which has a lot in common with my signature soup yet distinguishes itself with some key differences: It uses jasmine rice instead of rice noodles; lime instead of chili paste for that touch of acidity; and sweet potatoes, which are loaded with vitamins.Between wrapping gifts and baking cookies, bingeing on Succession and crying while watching It’s A Wonderful Life—do try our Feel-Better Chicken Rice Soup. It is a dish that all but the vegetarians in your life will find comforting, cold or no cold.Get the Recipe:Feel-Better Chicken and Rice SoupIf you want this take on classic chicken soup to have a similar consistency to congee, add 10–15 minutes to the cooking time.View RecipeExplore Bon AppétitLetter From The EditorYou’ve Got Time for ThiscookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-23", "author": ["Condé Nast", "Dawn Davis"]}