{"id": "62e8e18586929099b1e1d40de83c0ee4", "url": "https://www.bonappetit.com/story/drifters-wife-panzanella-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "I’m a Panzanella Skeptic, But This Fried-Bread Version Changed Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m a Panzanella Skeptic, But This Fried-Bread Version Changed MeWhen else can you eat fried bread and call it a salad?By Amanda ShapiroSeptember 19, 2018FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailWhen this recipe for fried-bread panzanella appeared in Bon Appétit’s September issue, I eyed it suspiciously. Panzanella, a Tuscan salad made with tomatoes and stale bread soaked in vinaigrette, has never been my thing, thanks to one too many soggy-bread, underripe-tomato experiences at the mediocre Italian restaurants of my youth. But fried-bread panzanella? With ricotta? From Drifters Wife in Portland, ME—#9 on Bon Appétit's Hot 10 this year? It’s not every day you get to fry bread and call it a salad. I was convinced.This panzanella recipe rises to genius status thanks to one technique: Whereas most panzanella recipes call for stale white bread, this one calls for fresh sourdough, which you then fry in thick slices on one side only. This partial-fry method lets half the bread pull in the vinegary juices of the tomato salad, while the other half stays crunchy like a giant homemade crouton. (Don’t freak out; we’re not deep frying here. It’s just a few tablespoons of oil in a skillet.) Then the beautiful half-browned bread gets cut into large chunks and tossed with the healthy stuff: tomatoes, red wine vinegar, shallot, garlic, and herbs. This alone would be my new favorite salad recipe, but then comes the ricotta, the feather bed of cheeses. Stirred with a little olive oil, salt, and pepper, it gets spread over the plate before the salad gets poured on top in all its juicy, crispy, herby glory.It’s the kind of recipe that this wine bar turned restaurant excels at: simple at first glance, eye-openingly good at first bite. With such a small menu, every dish at Drifters Wife has to deliver, from the roasted eggplant with cashew butter to the olive oil cake with yogurt, and this panzanella is no exception. You start to eat it politely with a fork and knife, but within minutes you go back to the platter with your fingers, dragging wedges of salty, half-crisp, half-soaked sourdough through puddles of ricotta, piling chunks of tomato on top, and eating it in one bite like reconstructed tomato toast. It’s a square meal if you want it to be, or you can pair it with Drifters Wife’s cast-iron chicken or another protein of your choice. Either way, it‘s fried bread and it’s also salad, which counts as a proper dinner for me.Get the recipe:Fried-Bread Panzanella with Ricotta and HerbsTraditional panzanella is amped up by frying thick slices of bread in olive oil on only one side, achieving a combination of crisp and soft that soaks up all the tomato juices without getting soggy.View RecipeAnother great dinner salad:Explore Bon AppétitSaladBreadHot 10Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-19", "author": ["Condé Nast", "Amanda Shapiro"]}