{"id": "630c2f8bca5b8a1652145270046adaac", "url": "https://www.bonappetit.com/story/molly-bazs-4-step-checklist", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Molly Baz's 4-Step Checklist for Saving a Mediocre Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMolly Baz’s 4-Step Checklist for Saving a Mediocre MealEven Molly messes up (gasp!) in the kitchen. Here’s how she fixes it.By Molly BazApril 20, 2021FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“I just made a meal and it tastes pretty meh…” The next time you cook something and realize it needs some help, use this checklist, from my new book, Cook This Book, to save it.1. Check for seasoningMy feeling about meh food is that the number one culprit is usually underseasoning. Obviously, I’m the salt queen and I would say that, but I really do think that home cooks aren’t liberal enough with their seasoning. So the first move always is to add a little bit of salt. Take a spoonful aside, add a little salt to that spoonful. If that unlocks more flavor, then you’ve solved your problem. Go ahead, salt the entire dish—or move on to step 2.While it seems like I use a lot of salt, I’m actually seasoning as I cook in small incremental amounts—you can always add salt, but you can’t take it away. If you were to season a soup only when it’s finished cooking and ready to be served, it’ll register as salty because the salt has not yet penetrated all of the ingredients (it’s suspended in the broth, but not inside any of the vegetables). If you season often, and season early, the salt will have a chance to get absorbed and the dish will taste seasoned versus salty. I’m tasting my food right up until the last minute and adjusting the seasoning accordingly.Molly’s Blistered Cheesy Peppers get topped with vinegary shallots to cut through the cheesy fat.\nPhoto by Molly Baz2. Taste for balanceTake a bite and ask yourself, What is the prevailing flavor profile you’re tasting? Is it overpowering? What ingredients do you wish you could taste more (or less)? What can you do to accentuate or diminish that flavor? Could you balance the flavors with a bit more of an ingredient already present in the dish? What other flavor profile could you introduce to modify the flavor and steer it in a more delicious direction? If it’s a slow-cooked dish or a deeply roasty-toasty one, could you introduce something fresh to balance those deeper cooked notes?Refer to the ingredients list in the recipe you’re cooking. The first step is always adding more of the ingredients that are in it already, to bring the dish into better balance before you start looking outside for other stuff to throw on top. Look within the dish before you look outward.Here’s an example. In the book, there’s a recipe for Coconut Shrimp with Chickpeas and Basil. The first version I made when developing this recipe was overly fatty and rich (coconut milk will do that), and the final dish tasted bland. To fix it, I bumped up the sambal and added honey to balance out some of the fat and spice with sweetness. A big squeeze of lime brought out all of the already-present flavors even more.3. Assess for textureFlavor is not one-dimensional—it’s not just about how something tastes but also about mouthfeel and the eating experience at large. When you’re adding ingredients to make a dish taste better, consider what they’re bringing to the table texturally, and not just flavor-wise.Ask yourself: Is the dish feeling uni-textural? Could it use a little contrast? What quick-fix items do you have on hand that might add some dimension? Crack open your pantry and search for nuts, seeds, croutons, breadcrumbs, crackers, chips, and other highly textural sprinkle-y things that often solve the prob (that’s where all the sprinkle-y bits in my book come in). But texture doesn’t just mean adding crunch, it can also mean slippery things and chewy things, or something tender and soft. Maybe your soup needs a silky soft-boiled egg, or your salad a squeaky cheese like Halloumi.Soft lentils, meet fried bread.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich4. Get a second opinion (if you can), make adjustments, and carry onIt also helps to have a sounding board. Having a second opinion (my husband) who can step outside of the dish and eat it without any emotional attachment is incredibly valuable. So if you’re not sure if a dish needs more salt, more honey, some texture, or whatever, ask whomever you’re cooking for! I’m sure they have thoughts.…When all else fails, the condiments I’m turning to the most right now are sour cream (it’s fatty and really tangy at the same time—people don’t give it enough credit) and the perfect chile crisp by The Spicy Mamas. I put it on every rice bowl, egg dish, and vegetable and just call it a day. Add enough of that to your accidentally dried-out fillet of salmon and no one will be the wiser.Get the book!Cook This Book: Techniques That Teach and Recipes to Repeat$32 $20 at Amazon$30 at BookshopAdapted from ‘Cook This Book.’ Copyright © 2021 by Molly Baz. Published by Clarkson Potter, an imprint of Random House.Explore Bon AppétitCooking TipsCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Molly Baz"]}