{"id": "630da32ba1fddec4555bd5e9174a85be", "url": "https://www.bonappetit.com/story/petra-and-the-beast-dallas", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I Thought Fermentation Was a Tired Restaurant Trend, And Then I Ate At Petra and the Beast in Dallas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Thought Fermentation Was a Tired Restaurant Trend, And Then I Ate At Petra and the BeastGimme those potatoes in snapper bone salt!By Priya KrishnaApril 18, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Petra and the Beast is a no-frills spot in a neighborhood of Dallas I had never heard of (called Old East Dallas) until I entered this place into Google Maps. Keep in mind: I am from Dallas. But it’s also like no other restaurant I’ve ever eaten at. Here, in this city of flashy Tex-Mex joints and big box chains, is a place where the main event is the inventive things in jars that sit idly on shelves lining the restaurants. They are concoctions sprung from the mind of chef/owner Misti Norris, who fell in love with fermentation as a kid—she had good family and friends who loved pickling and preserving all kinds of vegetables and seafood.On a recent night at Petra and the Beast, there was one jar containing lilac bitters, another labeled “mustang sunflower soda,” and yet another housing differently colored carrots marinating in an herb-y brine. The results of these fermentation experiments are what give brightness and complexity to the restaurant’s burnt potato terrine, crispy chicken feet, and malfatti with pork ragout. The short chalkboard menu changes frequently, but it’s usually broken down into “Meatums,” or meats, “Noods” (you can figure that one out), and anything else that Norris happens to be excited about—and pretty much everything features some kind of fermented element. Here, Norris is testing the bounds of fermentation, with wildly flavorful consequences. Case in point: She told me that she recently preserved Texas potatoes with shio koji, garlic, snapper bone salt (yes, you can apparently make salt out of fish bones), and shrimp powder. “The result was a bottarga-ish texture, super smoky, fishy, dried truffle looking thing,” she says. Yeah, I’d eat that.Go there: Petra and the BeastExplore Bon AppétitHighly RecommendRestaurantsDallasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Priya Krishna"]}