{"id": "6314daccef59516bca3d28a64cab2df2", "url": "https://www.bonappetit.com/story/tiered-cooling-racks", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Tiered Cooling Racks are the Space-Saving Tool We Won’t Bake Without | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can’t Bake in My Tiny Kitchen Without This Essential ToolI’m climbing these tiered cooling racks to the moon.By Sarah JampelFebruary 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhen you can't build out, build up! That's the principle behind two of our greatest innovations: skyscrapers and the tiered cooling rack that changed my life.Perhaps that is an exaggeration, but here's the truth: The amount of baking I do is disproportionate to the counter space in my kitchen. This means that there are almost always hot baking sheets or flocks of cookies in need of a resting place to cool undisturbed. I'll leave them in the turned-off oven (which seems smart until I start preheating it for something else), or on top of the stove (smart until I need a burner), or on the table in the other room (smart until I hear a crashing sound and realize the cats have had free reign).The tiered cooling rack—double the vertical space for the same amount of horizontal space—alleviates the problem. Suddenly I can cool twice the amount of stuff in the same constrained space. It's like a space-making machine. There are even tiered racks with three levels: The sky's the limit!I first learned about multi-level cooling racks when I was a peeping at a total stranger's wedding registry (oh, you don't do this? Welcome to a new fun way to waste your time). What is this magical contraption, I thought, before ordering one immediately. The Nordic Ware rack is particularly convenient because it's stackable—you don't have to have two tiers unless you need both—and it's easy to assemble and disassemble (read: nothing like Ikea furniture).Now that I have one tiered cooling rack, I just might need two. Or three! That's six levels, people. That's so many cookies. I'll just need to get a second oven to keep up with my baking habit.Buy it: Nordic Ware Stackable Cooling Racks, $27 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingRead MorecultureThese Seaweed Snacks Put All Other Seaweed Snacks to ShameBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-05", "author": ["Condé Nast", "Sarah Jampel"]}