{"id": "631671ebdb0e819fbeb361a3f39fec15", "url": "https://www.bonappetit.com/story/animal-crossing", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Animal Crossing Is Teaching Me How to Slow Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAnimal Crossing Is Teaching Me How to Slow DownI finally discovered the cute game, and now I can’t stop tending to my virtual garden.By Christina ChaeyFebruary 8, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,I’ve been spending all of my free time these days picking fruit, chopping hardwood trees for wood, digging for fossils, and catching a lot of sea bass. Yes, I’m talking about Animal Crossing: New Horizons, the video game everyone else began collectively obsessing over a full year ago in the early days of quarantine. (If that makes me sound behind on the times, I should mention that I still haven’t seen a single episode of The Wire; I am nothing if not consistent.)For the four other people who don’t already know the premise of the game, it’s simple (it has to be as it is literally a children’s game. I have no shame). You are the overlord of a private island that you can make into your very own utopia. You share your island with a band of adorable little animal villagers who give you presents and teach you how to make items like butter churns and garden benches. You get a house to decorate and fill with cute objects like petite popcorn machines and teeny-tiny incense burners. You can try your hand at playing the “Stalk Market” and potentially make a fortune selling turnips in exchange for the local currency, Bells, which you can then use to buy more popcorn machines and incense burners. But for the most part, the bulk of your time playing the game is spent doing mundane chores, like picking weeds, collecting wood, catching fish and bugs, to sell for Bells, and farming resources, like stones and iron, to make tools and furniture. The point, I think, is for it to be relaxing.When I first started playing a few weeks ago, I quickly noticed a pattern in my game play: I would race through my laundry list of chores at breakneck speed, trying to juggle multiple tasks and running around everywhere (and trampling so many flowers in the process) as if someone was timing just how quickly I could harvest those coconuts. The irony that I felt stressed out by a video game whose entire premise is that I’m supposed to create a paradise for slowing down and chilling out was...not lost on me.This fear that I’m constantly running out of time has followed me for a long time, but only after writing my last newsletter about the relationship between cooking and my anxiety have I started to ask myself why I feel the need to rush through life all the time. What is it that I have to get to that makes the tasks of day-to-day living feel so urgent? What, after all, is the big rush?The non-spoiler spoiler alert here is, of course, that there’s nothing so important waiting for me on the other side of all my chores (in-game and IRL) that I need to race toward it like the Road Runner. If only it were so easy to simply recognize this and move on. But that’s not how unlearning works. It’s a constant practice to have to remember to slow down and just b-r-e-a-t-h-e, regardless of whether I’m catching boatloads of pixelated fish in the game or trying to meal prep a week’s worth of food in an afternoon. When I inevitably find myself on the hamster wheel again, I’m slowly learning to come back to the same question: What’s the big rush?Yours in slowness,Christina ChaeyAssociate editorWhat I’m Cooking This Week:Photo by Alex Lau, Food Styling by Yekaterina BoytsovaFrench-ish Onion SoupVegetarian RamenSquash and Caramelized Onion TartBraised Chicken and Spinach Soup with Pita ChipsOlive Oil Galette With Spicy GreensHeartbeet Chocolate CakeExplore Bon AppétitHealthyishHealthyish NewsletterSelf CareessayRead MoreLifestyleWhy I’m Trying to Cook Less in 2021By Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-08", "author": ["Condé Nast", "Christina Chaey"]}