{"id": "6318317763a3a043d3f81a057d27b858", "url": "https://www.bonappetit.com/story/vibrant-life-cookbook", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "The Vibrant Life Cookbook Is My Wellness Roadmap | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cookbook Is My Wellness RoadmapIt has strength training tips and aging advice, plus crowd-pleasing staple recipes.By Sarah Thomas Drawbaugh November 2, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!With The Vibrant Life, Amanda Haas didn't just write a cookbook. She wrote a wellness road map with tips for strength training, yoga, and even a dash of sex and aging advice. Admittedly, I was skeptical that one book could successfully cover such a wide variety of topics, but the expertly sourced advice and delicious, approachable recipes proved me wrong.For breakfast, I absolutely adore the smoky sweet potato hash with eggs. It’s baked on a sheet pan, so it’s simple to make and easy to clean up, and the paprika packs a serious punch of smoky flavor.  For dinner, my household leans towards vegetable and fish recipes like the coconut ginger sea bass baked in parchment with king trumpet mushrooms and bok choy. But most of all, I find myself reaching for this book before hosting dinner parties to grab a few of Amanda's crowd-pleasing staple recipes. Her mustard vinaigrette pairs perfectly with a simple green bean snap pea salad, and the chicken stock is a great base for soups and gravy.Recently, I’ve been trying to remember to take time for myself, slow down, and listen to my body. Luckily, these rejuvenating recipes allow me to do just that. —Sarah Thomas-Drawbaugh, Healthyish FoodsBuy it: The Vibrant Life: Eat Well, Be Well, $20.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItCookbooksShoppingRead MoreLifestyleThis Cookbook Is Changing the Way I Use VegetablesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-02", "author": ["Condé Nast", "Sarah Thomas Drawbaugh"]}