{"id": "63199a9849bf15b56d4375ec2f8b9287", "url": "https://www.bonappetit.com/story/set-sail-for-adventure-this-holiday-season", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Set Sail for Adventure this Holiday Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSet Sail for Adventure This Holiday SeasonBy Princess CruisesJune 28, 2018FacebookTwitterEmailFacebookTwitterEmailPrincess Cruises is setting sail to destinations like The Caribbean, Mexico, Asia, and more. With incredible curated shore excursions and onboard experiences for the whole family, we’ll help you create remarkable new holiday traditions for your family and discover how other cultures around the world celebrate this time of year. You heard us right-let Princess take care of the details this holiday while you relax and explore! Taste new delights around the globe, dance and drum in the streets with locals, and celebrate being together in new and exotic destinations. Grab your passport and get ready to book yourself some adventure!Get Down with the Locals for a Caribbean ChristmasPicture yourself swapping your mittens for sunscreen, snow galoshes for a floppy hat and eggnog for beachside tropical cocktails. Like what you see? Book your family a Caribbean cruise with Princess Cruises and create an unforgettable family escape this year. Join the traditional Junkanoo festivities in The Bahamas on Boxing Day (where locals sing, dance, and drum their way through town), try a Jamaican-style Christmas cake made with fruit soaked in rum (yes please!) or sample a spiced sorrel traditional drink—this isn’t your grandmother’s holiday celebration.Traditional Mexican Celebrations and Week Long FeastsFill this year’s holiday feast with classic Mexican dishes like ceviche, pozole, tamales, or horchata on your Princess Cruises cruise to Mexico! Take your family to gorgeous Puerto Vallarta, where locals are known for their hospitality and warmth, see the hugely popular vacation destination Cabo San Lucas, or get lost in the streets of colonial Loreto. Mexico is rich with holiday-time traditions; in the nine days leading up to Christmas Eve, you may stumble upon one of the traditional fiestas called \"posadas,\" filled with elaborate processions, song, celebration, and prayer.Try Exotic Holiday Dishes in SingaporeSpend your holiday this year visiting Singapore, the gateway to Southeast Asia. If the tropical climate, gorgeous temples, and cosmopolitan attractions aren’t enticing enough, wait until you hear what’s on the holiday menu in Singapore! Locals serve Feng, a rich stew made up of pig intestines, heart, stomach and liver, ground spices, garlic and ginger, as well as the infamous Devil Curry, known for-you guessed it - it’s fiery color and intense heat. If you've never tried this dish, you're in for something special.Spend your Holidays Down Under in Australia and New ZealandIf you’re planning on booking a Princess Cruise Down Under to Australia and New Zealand, take note of a few unique holiday traditions you’ll encounter when you arrive! On Christmas Eve, you’ll find swarms of residents crowded into neighborhood fish markets vying for the freshest cuts of fish, best-looking shrimp, and biggest oysters for Christmas day. The golden beaches will be packed, as this is peak summertime weather for locals and they will flock to the shores after their holiday meals. It may not be what you’re used to, but you’ll love spending this holiday season buried under a sandcastle with your new Aussie pals.Discover the Beauty of Vibrant Culture and Cuisine in South AmericaIf you’re looking for the best way to visit multiple countries with rich cultures for your holiday escape, look no further than a Princess Cruise to South America. When you arrive in Chile, say adios to hot chocolate and mulled wines, and try a traditional Chilean holiday beverage, the cola de mono, which literally translates to monkey’s tail! The cola de mono is made of aguardiente, milk, coffee and is flavored with vanilla and cloves. Next, get yourself a seafood empanada- bonus points if you can find one made with mussels! For a sweet surprise, the traditional Italian Christmas fruitcake panettone is also a staple in South America, but here it gets topped with a layer of dulce de leche for an added touch of holiday sweetness.Create incredible new holiday memories on a cruise adventure this year. Find out more about each destination via princess.com/bonappetit.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Princess Cruises"]}