{"id": "63373253a693f9682ceca5b147f292a4", "url": "https://www.bonappetit.com/story/zajc-cvicek-rose", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The 1-liter Bottle of Rosé Wine I Bring to Every Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Bring This Liter Bottle of Wine to Every Dinner PartyIt’s rent-week friendly, tastes like a melted Jolly Rancher, and guarantees a fun night.By Emily SchultzMay 10, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.One of my many talents is overthinking extremely trivial things, like not having enough wine at a dinner party. When it comes to hanging with my group of friends, whether we’re cooking a meal together or just sitting by candlelight, talking about our days, there’s usually that point in the night when I start nervously eyeing the bottle, debating whether or not I should set out to try to find more. It sends me into an anxious tizzy just thinking about it—or at least it used to. Now I just bring around this liter bottle of Slovenian rosé every time we hang out.Zajc’s Cvicek is perfect for reasons other than its size, though that added 250 milliliters does mean you’re getting an extra glass or two out of a single bottle. It’s also only $13, which means it’s rent week–approved. It’s low-ABV—we’re sitting at home not raging all night, remember?—so even a few of us can sip on it without worrying about how much we’ve consumed. It’s super chuggable, with tons of cherry and raspberry notes (it actually kind of tastes like a melted Jolly Rancher, a good thing). Plus, it’s got a screw off cap, which makes it easy to put it back in the fridge if the party ends early. Yeah, right. Like that’s ever going to happen.Learn more: Zajc, Cvicek RoséExplore Bon AppétitHighly RecommendWinenatural wineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-10", "author": ["Condé Nast", "Emily Schultz"]}