{"id": "634bbdfe6d2bfe935e8e47cc2b0ca0b7", "url": "https://www.bonappetit.com/story/better-periods", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "What a Period Coach Can Teach You About Your Period | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Ways a Menstrual Coach Could Help You Have Better PeriodsJudy Blume never told us this.By Aliza AbarbanelJune 14, 2018FacebookTwitterEmailPhoto by Nicki SebastianFacebookTwitterEmailErica Chidi Cohen wants to talk about your period. With you, of course. (It would be weird otherwise.)And right now, there's a lot to discuss. Sex Ed is far from comprehensive, \"cramp-busting\" supplements are everywhere, and pad commercials are still using that weird blue liquid to symbolize blood. On the other end of the spectrum, interest in hormone balancing foods and life-hacking your cycle feels higher than ever. Happily, Chidi Cohen, a doula and the co-founder of L.A.-based wellness center LOOM, is part of a growing industry of “period coaches” helping to demystify, destigmatize, and destress menstruation.“I look specifically at what your lifestyle looks like and make adjustments to better improve your cycle based on your needs,” says Chidi Cohen. She creates personalized systems for happier periods, pairing protocol recommendations for specific menstrual products and supplements with self care prescriptions for acupuncture, meditation, and more. Clearly, working with a menstrual coach is a full-body approach—we want to know more. Here are five other reasons you might want to talk to a menstrual coach.1. If you want to biohack your cycleFirst off, the menstrual cycle doesn’t just include bleeding. LOOM's class covers the four main phases of the menstrual cycle—menstruation, the follicular phase, ovulation, and the luteal phase—and what you can expect from your body in each stage. By understanding hormonal shifts, people with periods can build their routine around their menstrual cycle with a technique often called phase-based eating.  “You might be able to work out three to five days a week in your follicular phase and when you get to your luteal you aren’t as able to do that, you might go down to two days a week,” says Chidi Cohen. “By introducing people to how those hormones are working, they can lean into their own architecture as opposed to working against it.” It’s a kind of biohacking uberman sleepers can only dream of.2. If you want to eat for happier periodsLet's be honest: We sometimes associate \"period food\" with Reese's and pints of Ben & Jerry’s. However, Chidi Cohen focuses on optimizing nutrition with hormone-balancing foods to create a healthier cycle.  “Cis women need more calories and fat than men in order to ovulate,” says Chidi Cohen. “When women are on low-calorie or low-carb diets, that can set off a signal to your brain not to secrete the hormone that controls ovulation.” She recommends people with periods consume a good combination of protein and fat, along with insoluble fiber to promote good gut health. For people on low-carb diets like keto, speaking with a nutritionist and menstrual coach to ensure a regular cycle can be especially important.3. If you want to find the menstrual product that's right for you“We curate our outfits, we curate our food, why not curate our menstrual products?” asks Chidi Cohen. She assesses period symptoms like pain and intensity of bleeding then recommends a range of menstrual products like period underwear, pads, tampons, and menstrual cups. “Menstrual cups move with the body whereas tampons are more stiff, so for a lot of people that have cramps, switching to a cup helps mitigate a lot of that,” says Chidi Cohen. Still, switching to a menstrual cup after a lifetime of using pads or tampons can take time. “The journey to find your menstrual cup might be a little long—it’s a Princess and the Pea journey,” she says. Start slow, and try multiple products like Super Jennie, Saalt, and Lunette, to ensure an optimal fit.4. If you want to support your cycle with self care“There’s a feeling that the reproductive organs are in your abdomen, but the reality is that all the hormones that control your reproductive system are in the brain,” says Chidi Cohen. “When your body is in a stress state, it limits the optimization of your reproductive hormones—the more stressed you are, the more there is a direct connection to the quality of your menstrual cycle.” Her classes focus on this mind-body connection, teaching people with periods to recognize times of increased stress and establish healthy coping mechanisms. She also teaches sustainable self-care and protocol recommendations like meditation, acupuncture, and massage to create a hybrid system that makes menstruation more comfortable.5. If you want to regain a sense of power over your bodyAbove all else, menstrual coaches provide an opportunity for people with periods to learn more about their bodies and themselves. At LOOM, class members learn how to check their own cervical fluid, basal body temperature, and track fertility with apps like Clue to paint a fuller picture of their reproductive system. While these techniques are commonly used by people trying to conceive, they're valuable to everyone. “Learning about your menstrual cycle and period doesn’t have to have anything to do with pregnancy; it can be about pregnancy prevention and body literacy,” says Chidi Cohen.“It’s an awakening now: Women and people with female reproductive parts are wanting to take back control. The more we know about our body, the better off we are and the more power we can take.”Explore Bon AppétitHealthyishTrendsRead MoreLifestyleWhat to Eat When You Feel Moody AFBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-14", "author": ["Condé Nast", "Aliza Abarbanel"]}