{"id": "6350c2db45421525994d96d78749f17f", "url": "https://www.bonappetit.com/recipe/red-curry-paste", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Red Curry Paste Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueRed Curry PasteBy Ugly Baby, Brooklyn, NYAugust 14, 20183.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintChef Sirichai Sreparplarn of Brooklyn's Ugly Baby, our No. 3 Best New Restaurant 2018, doesn’t believe in using food processors for making curry paste, but we won’t stop you from using one. He also prefers a blend of two parts shorter dried chiles (prik haeng) and one part longer chiles (prik chee fah), but any Thai chile will work.IngredientsMakes about 1 cup1tsp. black peppercorns1tsp. coriander seeds2lemongrass stalks, trimmed, tough outer layers removed, thinly sliced crosswise3Tbsp. finely chopped peeled galangal¾cup dried Thai chiles, torn or chopped into small pieces2small Asian shallots or 1 medium shallot, coarsely chopped8garlic cloves5cilantro roots or 3 Tbsp. thinly sliced thick cilantro stems11\" piece dried kaffir lime zest or 2 very thinly sliced kaffir lime leaves (optional)1tsp. (or more) shrimp paste, preferably ThaiSpecial EquipmentA large mortar and pestleIngredient InfoPrik haeng chiles can be found at most Asian markets and will often be labeled as dried Thai chiles or just dried chiles. Prik chee fah chiles are much harder to source; the next best equivalent is Mexican puya chiles.PreparationStep 1Pound peppercorns and coriander seeds in mortar and pestle until finely ground (if using a food processor, you will want to grind these spices in a spice mill first). Add lemongrass and galangal and pound until ground to a coarse paste, 6–8 minutes. Add chiles (if you want, soak them in hot water 10–20 minutes beforehand to soften and make them easier to break up) and pound until pasty, 6–8 minutes. Add shallots, garlic, cilantro roots, and kaffir lime zest, if using, and pound until everything comes together in a relatively smooth paste, about 5 minutes. Mix in shrimp paste; taste and add more if needed.Step 2Do Ahead: Curry pastes are best consumed the day they are made, but you can freeze any leftovers up to 1 month.How would you rate Red Curry Paste?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentSauceThaiSoutheast AsianAsianLemongrassHerbs & SpicesGalangalCilantroShallotVegetableThai ChileChileDairy-FreeNut-FreeGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Ugly Baby", "Brooklyn"]}