{"id": "63529a99a9c026a99c0d502b87aa493e", "url": "https://www.bonappetit.com/story/sunday-lunch-king-restaurant", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "A Long Sunday Lunch Is Better Than Saturday Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Long Sunday Lunch Is Better Than Saturday DinnerLazy afternoon eating is king.By Adam RapoportJune 4, 2019FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I like to think that Jess Shadbolt and Clare de Boer cook just like me. But, you know, better.They see what looks good at the market, they’re not shy with the olive oil and butter, they toss in some fresh herbs, and they always keep the salt pig within arm’s reach.The menu at King, their small, understated Italian-ish restaurant in New York’s West Village, never wanders—there’s a handful of appetizers and entrees and a dessert or two. It’s the kind of place where you can be all posh without feeling extravagant.Want this letter before it hits the website? Sign up for our newsletter!Photo by Adam RapoportMy wife and I ended up there this past weekend for a long, lazy lunch. (Meanwhile, can we talk about how Sunday lunch rules over Saturday dinner?)Asparagus is everywhere at the farmer’s markets in the northeast these days, so Jess and Clare layered some poached spears beneath a tangle of mixed bitter greens and shaved, sharp cheese. They threw in a bunch of hand-shelled favas, too, because they’re fancy like that.Photo by Adam RapoportAs a home cook, if you’re not buying asparagus right now, you’re doing something wrong. Snap off the woody ends, then grill it with some olive oil and salt, or blanch it quickly in well-salted water and serve immediately. Or plunge it an ice bath to preserve its bright green color and incorporate it into a salad, or hit it with a bunch of lemon juice, some olive oil, and Maldon.To go with the salad, Simone ordered the handmade ricotta ravioli with sage butter—one of those wonderfully simple dishes that I’m never going to make myself. Just saying!Photo by Adam RapoportWe split the pan-roasted chicken thighs, which might as well be the national dish of Bon Appétit. Season the thighs well (or brine them, if you’re a restaurant chef), start them skin side down until the skin renders its fat and gets crispy. Flip, and then slide them into a 400° oven until done. Oh, and layer the pan with all sorts of other good stuff that you want to luxuriate in that glorious chicken fat, from spring peas to potatoes to leeks, you name it. Again, Jess and Clare’s take tasted better than any version I’ve made, but not so much better that I couldn’t relate.Finally, there was a trio of homemade ice creams for dessert. Another thing I could make if I wanted to but...probably never will. Hence, King.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Adam Rapoport"]}