{"id": "63551826f10825fc188de2655c3b3054", "url": "https://www.bonappetit.com/story/houston-march", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "March Restaurant in Houston Has the Perfect-Looking Dining Space | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAt Elegantly Designed March, Even the Exit Signs Are BeautifulFrom the custom purse stools to the hand-painted Champagne buckets, every detail at the Houston restaurant stuns.By Alex BeggsFebruary 9, 2022FacebookTwitterEmailPhotograph by Jody HortonFacebookTwitterEmailSuddenly, June Rodil realized that the exit signs in March, a new fine dining restaurant in Houston, were ugly. Or maybe just that they could be beautiful. So she worked with the design team at Studio Robert McKinley to procure custom exit signs based on vintage ones (you know, when fonts were cooler). Then she got the new signs retrofitted to meet safety requirements—for that warm, up-to-code glow. When I dined there last year, I thought they were the prettiest exit signs I’d ever seen.Every detail at March has been so carefully considered that Rodil, a partner and master sommelier, laughs at herself when she tells me the lengths she went to find the perfect bathroom scent. But details matter! Especially when you’re trying to craft the most elegant, memorable meal in town, one that transports diners to the Mediterranean, even if they can see the strip mall and CBD store on Westheimer Road out the window. (The unobscured view is intentional.) I was stunned by the food, the service, and the Champagne buckets. I wanted to steal the water glasses and run away with the porthole of pink vermouth. But I didn’t! Instead, I asked Rodil to share their secrets.Photograph by Jody HortonThe TapestryThe showstopper is a woven tapestry by Buenos Aires artist Alexandra Kehayoglou that’s meant to feel like a place where Mediterranean landscape meets the lush bounty of Texas agriculture (much of the restaurant’s produce comes from a farm in nearby Bellville that’s owned by March partners Bailey and Peter McCarthy). It covers the ceiling and extends down the far wall of the private dining room, encapsulating diners in green and coincidentally serving as a sound absorber. Go ahead, touch it!Photograph by Jody HortonThe Tables—and Purse StoolsIndustrial designer Hayley Riccio, who’s married to March chef and partner Felipe Riccio, devised dining room tables with tops that unscrew like giant lazy Susans. Shower cap–style white tablecloths fit on them snugly to create a clean, modern look without any drapery. And whaddya know, Rodil’s husband, Aaron, is an industrial designer too. He created the purse stools that give everyone a place to stash their phone…and maybe even forget about it for a few hours.Photograph by Jody HortonThe Trippy TilesAppetizers are served on Portuguese Surrealejos tiles in the lounge. The trippy tiles—some with a kaleidoscope of sardines, roosters, oranges, and eggplants—start the meal with a wink. Don’t take things too seriously here. Get the martini; it comes with a fried olive stuffed with duxelles—when you bite into it, the color resembles a pit.Photograph by Jody HortonThe Champagne BucketsRodil chases hand-painted enamel French Champagne buckets at curio shops and sites like eBay and 1stDibs. “We’re in a new building with new stuff all over,” she says. “We want to strike a balance with something older, which has a sense of timelessness.”Photograph by Jody HortonThe Lonely Maître d’A saturated painting by Oliver Jeffers shows a maître d’ wearing an old-school tux and holding a candle, adrift at sea. A metaphor for the restaurant industry during the pandemic? If you want it to be. In the lonely, uncertain months before March opened, Riccio spent so much time standing in front of the painting, deep in thought, that the staff joke that it’s “Felipe’s dad.”Photograph by Jody HortonThe Sweet Scent of…the BathroomIs that a sun-kissed Seville orange I smell? Rodil chooses fragrances that change biannually with the menu to reflect a different region of the Mediterranean, so far often from Yucatán-based perfumer Coqui Coqui. The Andalusian menu was matched with an orange scent, and the Maghreb menu called for spicy tobacco. In February, March is exploring Occitania, paired with Coqui Coqui’s lavender and chamomile.Photograph by Jody HortonThe Dancing LadiesRodil hunts online for vintage Austrian Bimini glassware like these—rare, delicate glasses with blown-glass figures of dancing ladies on the stems. The restaurant keeps track of which glasses it serves guests so that the next time you visit, you’ll sip out of something different.Photograph by Jody HortonThe Exit SignsAren’t they beautiful? And sooo up to code.Explore Bon AppétitRestaurantsHoustonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-09", "author": ["Condé Nast", "Alex Beggs"]}