{"id": "63559de3edae2e0bd5b1c3fff50cc7f9", "url": "https://www.bonappetit.com/story/mexican-cooking", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "I've Never Felt Truly Mexican, But Cooking With My Mom Helps | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI've Never Felt Truly Mexican, But Cooking With My Mom HelpsAre you Mexican if you only have stories and food? I'm still not sure.By Alexis WattsJanuary 31, 2019FacebookTwitterEmailRachel Levit RuizFacebookTwitterEmailThis is a story about being Mexican but not Mexican enough. It’s also a story about tamales.I grew up in a small beach town in California. My mom is third generation Mexican-American and my dad is European; his family has been in America since the 1700s. When I was very little, my life was a mix of cultures: we spoke a kind of Spanglish at home, we had bi-weekly dinners with my mom’s big, extended family and regular beachside barbecues with my dad’s family, and I went to school an hour early to participate in a program that offered lessons in Spanish before “normal” school began.When I was ten, my mom’s parents disowned her. The details of how and why are complicated, sad, and deeply patriarchal, and my mom was, and is, better off without them. That same year, my Mexican friends came up to me at recess and demanded that I choose between them and my white friends. Because my white friends were making no demands, I chose them.I should also mention that I present white, and so does my sister, which has led to awkward situations like our mom being mistaken for our nanny and several people over the years doubting, downplaying, or denying my ethnicity when mentioned.Making tamales requires an assembly line of family members.\nPhoto by Alex LauAs I got older, my Mexican identity slowly began to slip away. We spoke less and less Spanish around the house, and my mom stopped cooking Mexican food from scratch—I think both made her too sad. There were no more weekly dinners with her family, of course. We were still close with my dad’s side, and my mom seemed otherwise happy except she would cry whenever there was a mariachi band around. I knew I was Mexican, but I felt on the outside of my own culture, like I had been born with all the ingredients but didn’t know the recipe. I pushed my identity questions aside while trying to get through the turbulence of middle school and high school. But around the time I reached college, I wanted to know more.I started hounding my mom with questions about growing up, what my grandmother cooked, and where our ancestors came from. I wanted to know everything. My mom grew up with second-generation parents who wanted nothing more than for their daughter to be American. They gave her and her four brothers white-sounding names, encouraged assimilation, and never discussed the details of the family’s immigration. When I started asking questions, my mom asked one of her cousins whom she still spoke to, and discovered that our ancestors came to the U.S. from Oaxaca. I’ll never forget reading the email from her: I ran to my roommate (who happened to be Mexican), and proclaimed loudly that I finally learned my family was from “OH-AXE-ICA”. She laughed for a full three minutes before pulling it together to correct me. I remember the hot shame of ignorance rising in my face as I realized how little I knew.It wasn’t until after college, in my first New York City apartment, that I started to cook Mexican dishes. First, I would scour the internet in an attempt to find recipes, often piecing together more than one to try for something that seemed “authentic,” whatever that meant. I spent hours in grocery stores up and down the west side of Manhattan foraging for the right chiles, and I spent days stumbling through my first batches of chile verde, enchilada sauce, and chicken mole. Through making these dishes and sharing them with people I loved, I started to create a connection to what I lost, or a piece of it anyway.I would call my parents every time I made something new, and we’d discuss my process, what worked and what didn’t. They were both cheerleaders and helpful consultants. A year later, after incessant pleading, my mom agreed to make tamales at Christmas with me, something she hadn't done since she was little in my grandmother's kitchen. Making tamales is long and arduous, even when you don’t make your own masa. It’s not totally essential to have a veteran tamale maker help you on your first try, but it is incredibly helpful. The process requires a lot of time, space, and a cumbersome tamale pot when done right. And it guarantees time to sit down, catch up, and listen.My grandmother had died earlier that year, and my mother, still estranged from her family, never said goodbye. And as we sat down with the masa from El Indio, corn husks from our local market and my dad’s slow-roasted pork, we filled champagne flutes and toasted her. My mom cried and told me stories about her mom. Since then, we’ve made tamales together every year.Are you Mexican if you only have stories and food? I’m not sure. What I do know is that making tamales with my mom opened up a new place for connection, memories, and a line to my lineage. As we pile tamales into the steamer, the smell of masa is everywhere, in the air and on our skin, and it’s starting to feel like home.Explore Bon AppétitHealthyishMexicanTamalesFamilyessayRead MoreLifestyleI’m Scared to Come Out to My Mom...As a Meat EaterBy T. WiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-31", "author": ["Condé Nast", "Alexis Watts"]}