{"id": "6359410cd11551ca8274c01a45346349", "url": "https://www.bonappetit.com/story/bumble-cafe-date-friendly-food", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "23 Date-Friendly Foods, According to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture23 Date-Friendly Foods, According to MeThe dating app Bumble’s new Manhattan café promises to serve only “date-friendly” food. But what does that mean exactly?By Alex BeggsJune 4, 2019FacebookTwitterEmailPhoto by Kevin Fleming/Corbis via Getty ImagesFacebookTwitterEmailNothing makes me want to vomit into the pockets of my linen jumpsuit like the scene in Lady and the Tramp when the two doggos share a splattering plate of sauced-up spaghetti. Hel-lo! NOT a date food, ya dumb pooches! The possibility of stains, a red halo around your mouth vicinity, and suggestive slurping noises—all too high. Dangerous. Woefully unsexy.I’m not the only one who feels this way. This week, Bloomberg reported that Bumble, the dating app, is launching a café/wine bar that will thankfully only serve “date-friendly” fare, which they say is DEF NOT spaghetti. But what does “date-friendly” food mean, exactly? Well good thing you asked me, a food expert, because I know. Herewith, the only date-friendly food I will eat in the company of love interests, possible investors, and my agent*:The sleeve of Saltines I keep in my purseA single raviolo—NO SHARINGLittle Debbie’s Banana Twins—OKAY TO SHARE, COMES IN PACKS OF TWOSteak tartarePeking duck with all the fixinsSoft shell crab, when in seasonMilk Duds from the box I keep in the pocket of my blazerNachos from a stadium helmetAn extremely flaky ham and cheese croissantA gigantic burritoA seafood tower we can’t see each other’s faces throughTrader Joe’s elote chipsThe soup du jourA nice slice of cheesecakeA porterhouse for three even though it’s just two of usA bulging, uncut movie theater dill pickleCone of rapidly melting soft serveRack of ribs, extra sauceSteamed artichoke with side of mayoMystery-flavored AirheadsA Bloomin’ Onion™Spicy red chile oil wontonsA cheeseburgerWhattya know, it turns out the foods I eat in the company of those I love and seek the admiration of are the foods I eat with my sworn enemies and step-siblings. Take me as I am, world! It’s gonna be messy.*My friend’s mom Bridget, who shares everything I write on Facebook. Thanks Bridg!!Explore Bon AppétitTrends + NewsDateRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Alex Beggs"]}