{"id": "635e8d45008711f17cd4ee7d2e9e6d89", "url": "https://www.bonappetit.com/story/back-pocket-soup", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "How to Make Coconut Vegetable Soup With Any Kind of Vegetables You Have | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You've Got a Can of Coconut Milk and a Pound of Vegetables, You've Got SoupBecause you've been staring down that same bag of spinach for five days.By Caroline LangeMay 7, 2020FacebookTwitterEmailPhoto and Food Styling by Emma Fishman FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Much has been written about back-pocket pasta, but what about back-pocket... soup? Mine has just three main elements: an onion, a can of coconut milk, and a pound of almost any vegetable (or a combination of a few). It’s the rare comfort food that soothes and invigorates, and that comes together fast enough for it to be a midweek work-from-home lunch or a hunger-frantic dinner. Since the vegetables are flexible—tomatoes (even canned ones), winter squash, kale, carrots, sweet peppers, zucchini, corn, frozen peas, fennel, potatoes (sweet or otherwise), mushrooms, even beets—it’s just as suited to a CSA surplus as to the I haven’t been to the store in three weeks and all I have left are carrots conundrum. It’s the coconut milk, sweet and mellow, that makes all of the ingredients hold hands.Start with an onion or any other allium you’ve got—maybe a couple of shallots or leeks or a bunch of scallions. Thinly slice it into half-moons, then add to a medium pot with 2 tablespoons extra-virgin olive oil and 1 teaspoon kosher salt. This is a good time to infuse the oil and the onion with big flavors: a stemmed and halved jalapeño (seeded or not, up to you), a couple of roughly chopped garlic cloves, a nub of roughly chopped ginger, or spices, like coriander, cumin, turmeric, crushed red pepper flakes, paprika, fennel seeds… Sauté all of this over medium heat until soft and translucent, 7 to 10 minutes.While the onions soften, peel, trim, or stem your vegetable as necessary, then chop into roughly ½-inch pieces; the more finely you chop, the faster the vegetable will cook. Keep in mind that denser veg, like squash and carrots, will take longer to cook than the tender ones, like corn, peas, kale, or tomatoes. Add them to the pot, bump the heat up to medium-high, and cook, stirring occasionally, until your chopped vegetables have softened slightly: your tomatoes are starting to burst, your carrots are softish at the edges, your collards have wilted. This is a jumpstart on the rest of the cook-time, but it’s also a chance to concentrate and meld the sweetness of your alliums, your vegetable of choice, and any other add-ins you’ve brought into the mix.Add one 13.5-ounce can of coconut milk, then fill the can with water and add that, too. Bring this to a boil over high heat, then reduce the heat so that it simmers gently but steadily. Cover partially with your pot’s lid and let cook until your vegetables are completely tender. I mean completely. This will probably take 15 to 20 minutes. It should all be smelling pretty good by now.Pull the pot off the heat. Now’s your final flavoring opportunity: Some fresh herbs (cilantro/mint/parsley/basil/dill—tender stems as well as leaves), maybe? Or a wee lump of miso or gochujang? A few slivers of preserved lemon? Some citrus zest and/or juice?Now it’s time to blend: Because blenders rank highly on my list of least-favorite kitchen appliances to wash and transferring hot liquid to a small container is always risky, my choice for puréeing soup will always be the immersion blender. (If you don’t have an immersion blender, make sure you work in batches—don’t fill your blender all the way to the top—and allow the soup to cool for a couple of minutes before powering the machine on low, then gradually increasing to high.) Purée until totally smooth, thinning with a little water if you like.Serve as is, or top with some freshly ground black pepper, a swirl of olive oil or coconut cream, some toasted garlic chips, more fresh herbs, or toasted breadcrumbs or croutons.Here are some combinations that I like...Carrots + fresh ginger + ground turmeric + orange zest + orange juiceChard + jalapeño + ground cumin + cilantro + miso paste + lime juiceLeeks + fennel + fennel seeds + grapefruit zestFrozen peas + spinach + lemon zest + basil + mint...but try whatever speaks to you (or try using up whatever you've got lying around). This is one of those rare meals that's made from pantry staples but actually feels fresh—and fresh for reinventing every time you make it.Caroline Lange is a recipe tester and developer, private chef, and food stylist living in Brooklyn.Explore Bon AppétitIt's That SimpleSoupVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Caroline Lange"]}