{"id": "637295c7cc7a5886bab87cc84cd8da61", "url": "https://www.bonappetit.com/recipe/sour-cream-and-onion-biscuits", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Sour Cream and Onion Biscuits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSour Cream and Onion BiscuitsBy Molly BazMarch 15, 20204.9(310)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan Spungen EmailPinterestPrintEmailPinterestPrintIf you've ever had trouble making biscuits in the past, consider the sixth recipe in the Basically Guide to Better Baking your saving grace. While many other methods count on pockets of butter and an angel’s touch for pull-apart flakiness, we weren't willing to leave it to chance. Our simple folding technique manually multiplies the number of layers for guaranteed, no-risk success. And the sour cream isn’t just a gimmick. Used in place of the more typical cream or buttermilk, it adds rich, tangy flavor, and acidity that helps make the biscuits incredibly light and tender. These are at their peak when they’re warm out of the oven. Plan accordingly. Questions? Head to our forum to ask questions and get answers.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketWhisk$10 At AmazonLarge Bowl$18 At AmazonForkPastry Brush$9 At AmazonIngredientsMakes 88scallions12Tbsp. chilled unsalted butter, divided2½tsp. Diamond Crystal or 1½ tsp. Morton kosher salt1tsp. freshly ground black pepper1¾tsp. baking powder½tsp. baking soda1¼tsp. sugar2½cups (313 g) all-purpose flour, plus more for surface1¼cups sour cream, plus more for servingFlaky sea saltPreparationStep 1Place a rack in middle of oven; preheat to 425°. Line a baking sheet with parchment paper. Trim root ends from 8 scallions. Thinly slice crosswise (not on a diagonal); set aside.Step 2Melt 2 Tbsp. chilled unsalted butter by whatever method is easiest for you; set aside. Whisk 2½ tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, 1 tsp. freshly ground black pepper, 1¾ tsp. baking powder, ½ tsp. baking soda, 1¼ tsp. sugar, and 2½ cups (313 g) all-purpose flour in a large bowl to combine.Step 3Cut remaining 10 Tbsp. chilled unsalted butter into ½” pieces. Add to dry ingredients and toss to coat. Using your hands, work butter into dry ingredients, smashing it between your fingers and flattening it between your palm until there are lots of thin shards and pea-size bits. Add reserved scallions and toss to evenly distribute.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Create a well in the center of mixture and add 1¼ cups sour cream to the center. Using a fork and working in circles, mix until large shaggy clumps form. If your bowl is wide enough, fold dough over itself a couple of times inside it until it comes together.Step 5Turn out onto a lightly floured surface and knead once or twice until it comes together; flour your hands if needed. If there are any loose bits, add them to center of dough and knead once more to incorporate.Step 6Pat dough into an 8x4” rectangle about 1” thick.Step 7Working from a short side, fold dough in thirds as you would a letter. It doesn’t need to overlap perfectly. Pat dough into another 8x4” rectangle, then fold dough in thirds like a letter one more time. (You'll have done the folding procedure two times total.) Pat dough back into an 8x4” rectangle and straighten up with your hands and/or your bench scraper. (This folding method is what will create those nice flaky layers in your final biscuits.)Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Cut rectangle in half lengthwise, then cut each half crosswise into 4 squares for a total of 8 biscuits.Step 9Transfer biscuits to prepared baking sheet. Brush tops gently with melted butter; sprinkle with flaky sea salt.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 10Bake biscuits until golden brown, 18–22 minutes. Serve warm with sour cream (or more butter!) for slathering.How would you rate Sour Cream and Onion Biscuits?Leave a ReviewTell us what you thinkReviews (187)Back to TopTrianglethey are the best...as is Molly. Used to love watching her. I add grated cheddar and today, straight buttermilk; have also added greek yogurt and that was terrific, too. Tonight serving with homemade French lentil soup. So Good!\nJo-Ann in NYCNYC10/17/2021Delicious! I closely followed the recipe and found it slack, so I did have to add a bit more flour in, but otherwise the recipe is perfect. I got lots of compliments and requests for them again. A fantastic savory recipe! SuzMontana10/9/2021AMAZING! The best biscuit recipe I’ve ever used. Cut it in half for the 2 of us and it was flaky, soft and absolutely delicious. 18 minutes was perfect on convection. Thanks, Molly! This will be the keeper forever! Rebecca Youngstown, OH8/26/2021These biscuits are the bomb!  Easy to make, tall and fluffy with amazing flavor.  Yes to sprinkling Maldon salt on top after brushing on the butter.  Yum!WendieOakand CA8/15/2021Easy recipe, impressive results. Would work with chives or other herbs … thinking some chunks of sundried tomatoes would be yummy too. But just as is, these are spectacular and fairly quick to make. Bengali Cowgirl Austin TX7/24/2021I've made this many times, and it's a banger. Very easy to make and to eat :) Laura FariaMontreal, QC7/8/2021I watched Molly and her Father bake these biscuits together via Zoom. \nThe biscuits really deliver on the sour cream and onion flavor (I only used 3 green onion shoots). Hefty, but layered biscuits that went well with sage sausage gravy and eggs I made for my son and I. I am excited to make them again, but pair them with some thin broth based soup on a cold day. Really delicious with more butter and salt slathered on the interior as Molly recommended. Thanks for sharing Air_Rick_SightsEugene, Oregon5/8/2021I did a bad job making these and they still turned out pretty great! But don't make the mistake I did: make sure your butter is CHILLED. I left mine out of the fridge for about half an hour and I think it melted into the flour a bit too much, which resulted in slouchy/flatter biscuits without much rise or layers. My dough was also way wetter than pictured – not sure if that was due to the melting butter but it seemed like too much sour cream. I baked these in my convection oven without altering the temp for 18 minutes and they were a little undercooked inside. I also used salted butter and didn't add any of the salt and the saltiness was perfect. Next time I would try with fully chilled butter, a tiny bit less sour cream, and closer to 20 minutes' baking time. Considering all my mistakes, these were still amazing!AnonymousOttawa, ON4/6/2021Best biscuit recipe ever (I am 66 so have a lot of miles of biscuit dough behind me). The dough was a tad crumbly (correction - very crumbly) but I just worked with it. Flaky, yummy biscuits. \n\nThe third time I made these I melted the butter in a small skillet. I took each cuboidal biscuit  and rolled it in teh melted butter. Much easier than brushing (for me anyway).  \n\nFourth time I realized somoeone helped themselves to my sour cream. I used greek yogurt.  Still good!\n\nOzark HIkerGreenfield MO3/26/2021The recipie is wonderful, but it would be helpful to included weights for the butter - the butter for the dough should weigh 141 grms.ScottBrandon, MB3/20/2021Easy AND delicious!!PrismdsfMatlacha, FL3/12/2021Finally a biscuit that doesn't have to be rolled out!  So I can't review because I haven't actually made it but I am very excited to try and can't wait - thank you!AnonymousCentral IL2/13/2021So delicious and very doable! I added some shredded cheddar cheese and loved the flavor. These biscuits are great for brunch or really any time! Allison HamffTexas1/27/2021Outstanding biscuits. I cheated and pulsed in food processor until just coming together, then finish with handsAnonymousSeattle 1/24/2021I made these GF/vegan with Namaste flour, earth balance for butter, and forager dairy free sour cream. Amazing! I used about 1/4 cup less sour cream than the recipe called for because my dough was really wet, and the end product did come out a bit dry (but with GF flour, the lamination worked which I haven’t been successful with before!). Next time I think I’d use the full amount of sour cream and increase my flour by 1/8 to 1/4 cup, or try a different flour blend (I think the flour blend from GF artisan bread in 5 minutes a day would better than namaste blend in this recipe for celiacs looking to try this out). 100% would recommend.AnonymousSt Paul, MN1/11/2021Explore Bon AppétitBiscuitSouthernAmericanScallionOnionVegetableSideNut-FreeVegetarianBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-15", "author": ["Condé Nast", "Molly Baz"]}