{"id": "637740a7bbe4afab5b81b508fd1c2c74", "url": "https://www.bonappetit.com/story/salmon-feud", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Pork Sauce, Salmon Feuds, and Reese's THiNs: The Week at BA | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePork Sauce, Salmon Feuds, and Reese’s THiNs: The Week at BAAlex Beggs recaps the riveting week in the Bon Appétit Test Kitchen in her newsletter.By Alex BeggsFebruary 23, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the _BA_offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Spicy Pork SauceAround the office we called it “Sambal-ognese.” Chris Morocco’s new weeknight sauce that we’re all crazy about. Buttttt some fact-checking happened and we couldn’t really call it that in the final edition. Bolognese is beef, this is pork. It cooks in a half hour, not three hours. No milk. Etc. The recipe also takes a few cues from pad kee mao—soy sauce, ginger, basil. It ultimately became its own thing. And a beautiful thing. Spicy and unabashedly punchy, flavors don’t meld together here as much as scream in a punk chorus. During tastings, people would drop by to try it, uninvited. It was rude but understandable. The sauce is ...awesome... sauce. I made it for dinner using Korean rice cakes instead of noodles and it was one of the best decisions I’ve made in 2019. The other was switching to Geico.Get the recipe: Spicy-Sweet Sambal Pork NoodlesBrad’s career trajectoryBrad Leone’s new show, “It’s Alive: Goin’ Places,” debuted this week and you should probably watch it so we can keep making magazines and employing people—no pressure. I caught up in the Bon Appétit Test Kitchen with the host, Bradford Leone, about what this is even about. “‘It’s Alive’ was based in the kitchen,” he explained, “but this is dedicated to travel. Four episodes in one place.” Season one is Texas! There are bison! “It ended up being about world health,” said Professor Brad, and then three minutes of “regenerative agriculture” talk around the espresso machine ensued. “Are you talking about bison poop?” I asked. “Well, yeah, that’s a part of it.” Two more minutes of talk about bison aerating soil: “...and we just scratched the surface!” Brad brought back a Stetson hat. “I had to buy it with my own money, but I got a good deal,” he said. “I wore it everywhere. I was ma’aming people, holding doors. Texas brought the gentleman out in me. Then when I landed in New York I had to take it off immediately.” Put your beanie back on, buckaroo.Here’s how to watch it!Want this letter before it hits the website? Sign up for our newsletter!Reese’s Thins, reviewedWe tried the new Reese’s THiNS this week. No paper wrapping! Some of the chocolates were so thin, there was nothing in the little sleeve. (They were empty. Factory error?) Half of the staff, including Meryl Rothstein, felt “the peanut butter ratio was off.” When I bit into it, I had to squint to see the fine line of peanut butter product slipped in there. “This doesn’t have the peanut buttery payoff I’m looking for,” reviewed Carla Lalli Music. The other half of the staff loooooved them. “The PB in thick Reese’s gets kind of pasty and dry,” said Rachel Karten. “These were gloopy in the good way, like real peanut butter. I needed four to satisfy the craving of one Reese’s though.”Overheard in the Test Kitchen“So that’s your thing now? You’re a loaf pan girl?”Mysterious barbecueMy favorite genre of outside readin’ is murder mysteries. But regular mysteries will also do. I just finished the latest edition of Best American Mystery Stories 2018, edited by my hero Louise Penny, and there were two great stories about FOOD and I can’t stop thinking about them. “Smoked” by Michael Bracken takes place at a middle-of-nowhere barbecue stand in Texas that gets discovered by a food magazine (while the pitmaster is hiding from something worse than long lines); in “Takeout” by Rob Hart, a Chinatown delivery guy drops off terrifying omens instead of egg rolls. OoooOoo.Unnecessary food meme of the weekWhat are “Froats”?Frozen oats. Think frozen oat milk “ice cream.” Hey, I’m just the messenger.**Regurgitator of press releasesUnnecessary food feud of the week“There’s a sliminess to it,” said Claire, who was back in the Test Kitchen this week surrounded by approximately 15 cakes. She was talking about the rise of foolproof, slow-roasted salmon. But too often it can have a texture closer to raw if you undercook it. “I want my salmon cooked all the way through so that it flakes on its own,” said Claire, a reasonable request. She cooks it on the stovetop. So does Andy Baraghani: “I’m a skin on, pan seared, finished in the oven kind of guy.” Carla wants crispy skin, so she cooks it stovetop as well, which some home cooks can fear for overcooking. “It gets dry and stringy when it’s well-cooked—cat food town.” Christina Chaey “had a traumatically undercooked salmon recently,” and therefore cooks hers “hard,” which either means on a hot skillet or on the back of speeding motorcycle. When Carey Polis slow-roasts salmon, she has to serve it at two different temperatures, “one for my mom, and one for everybody else.” (It was a staff theme that moms prefer well-done salmon. Why? How?) Emma Wartzman fears the fine line between medium-rare and well-done, so better safe than sorry—she cooks it slow-roasted. Rachel Karten is a slow-roaster all the way: “It gets tender, buttery, fall-apart-y. I’m scared of over-cooking it on the stove.” “Claire and I are right,” concluded Andy. “Are there winners in this feud? Because we win. And I want my prize to be a pork chop.”Cook salmon how you feel the most comfortable! By asking someone else to do it!Some salmon ideas, slow-roasted, stovetop, grilled, cured, all the ways!Explore Bon AppétitBeggs NewsletterRead MorecookingBA’s Best Bolognese Is a Sunday Gravy for All TimeBy Alex BeggscookingWeeknight Dinner Party? Start with Brown Butter-Basted SteakBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-23", "author": ["Condé Nast", "Alex Beggs"]}