{"id": "637c2c80bc5ff502687ccd6615c98342", "url": "https://www.bonappetit.com/recipe/bas-best-tabbouleh", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Best Tabbouleh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA's Best TabboulehBy Andy BaraghaniSeptember 1, 20214.6(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThe herbs are the star of this tabbouleh recipe—and require a bit of care. Make sure to use a very sharp knife so that you can slice through the parsley and mint just once. You don’t want to run your knife over them again and again or use a food processor; doing so will bruise the tender leaves and lead to a soggy salad. In classic recipes, like this one, there should only be enough bulgur and tomatoes to balance all those herbs, so keep the proportions in check. When tomatoes aren’t in season, you can replace them with pomegranate arils, which add a modern touch and gem-like look to the final dish. And, if you don’t eat gluten, you can swap bulgur for quinoa.No matter how it’s made, tabbouleh is never served on its own in the Levant. Its bright, herby notes make it an ideal pairing for rich dishes like Seven-Spice Grilled Lamb Chops and Crispy Pita with Chickpeas and Yogurt called Fattet Hummus in Arabic.Editor’s note: This recipe was originally published on July 31, 2019.Ingredients4 servings¼cup fine-grind bulgur3medium ripe tomatoes (about 1 lb. total)⅓cup fresh lemon juiceKosher salt2bunches of parsley, thick stems trimmed1½cups mint leaves4scallions, very thinly sliced crosswise¾tsp. ground allspice5Tbsp. extra-virgin olive oilFreshly ground black pepperPreparationStep 1Place bulgur in a small bowl and cover with boiling water by 1\". Let sit until bulgur is soft and tender, 20–30 minutes.Step 2Finely chop tomatoes and transfer to a large bowl (juices and all). Add lemon juice and bulgur to bowl; season with salt, then toss to combine.Step 3Rinse parsley under cold water and shake to get rid of excess water. Working in batches and starting at stem end, finely slice stems and leaves with your sharpest knife, making one even pass. This is so the parsley doesn’t get bruised or wilt and stays light in the salad (you should have about 4 cups).Step 4Gather mint leaves in a tight bunch and repeat same slicing motion as you did with the parsley.Step 5Add parsley, mint, scallions, and allspice to bowl with bulgur mixture; toss to coat in lemon juice. Drizzle with oil; season with salt and pepper. Toss once more and serve immediately.How would you rate BA's Best Tabbouleh ?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI love taboule! This is a very good recipe but as a Lebanese, I would like to mention that we don't add allspice only salt. \nAlso, after soaking the burghul and before you add it to the bowl with tomatoes, it is important that you put the burghul in a fine sieve and press out all the water, which you can do with the back of a spoon. Also, to avoid having a soggy taboule, the parsley and mint are best spin dried, shaking them is not enough.AnonymousParis, France8/30/2021Excellent recipe, but I prefer it with much more bulgur than called for (I used 3/4 of a cup) and substituted grape tomatoes sliced in half for a more colorful presentation.WendiLancaster NH5/2/2021This is my favorite salad that I have always wanted to learn how to make. Thank you; it was perfect!Yannin2/3/2021As a Lebanese person, I can verify that this recipe is the real deal. A simple adjustment for those who can't eat gluten or find that bulgar ultimately makes leftover tabbouleh soggy is to instead use quinoa. Anonymous9/27/2019Delicious!Anonymous8/15/2019I loved this recipe. My bulgur didn’t cook as much as it should, and it was still delicious. The techniques suggested in the recipe are spot on and really make a difference. ClaireW17Dallas8/13/2019Explore Bon AppétitSaladLebaneseMiddle EasternBulgurRice & GrainsParsleyHerbs & SpicesMintTomatoVegetableQuickEasyWeeknight MealsSideDairy-FreeNut-FreeVeganVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-31", "author": ["Condé Nast", "Andy Baraghani"]}