{"id": "638335d9513626465a71b06a113ebd72", "url": "https://www.bonappetit.com/story/how-aussie-chef-aaron-brooks-brings-the-unexpected-to-his-miami-steakhouse", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "How Aussie Chef Aaron Brooks Brings the Unexpected to His Miami Steakhouse | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow Aussie Chef Aaron Brooks Brings the Unexpected to His Miami SteakhouseWhat do Miami and Australia’s Gold Coast have in common? More than you might think.By Wine AustraliaJuly 16, 2019FacebookTwitterEmailEDGE Steak & BarFacebookTwitterEmailAaron Brooks, the executive chef of EDGE Steak & Bar in Miami’s Four Seasons Hotel, has worked up and down the eastern coast of his native Australia, in Canada, and in the United States. But there’s a certain kinship he feels with his adopted city of Miami — and its distinctive cuisine.Executive Chef Aaron Brooks\nPhoto by Daniel Krieger“It’s all the ways I like to eat,” he says. “Lighter fare, grilled meats, wood-roasted vegetables, fire-roasted fish. Things I grew up with, in a warm climate. It’s almost like a homecoming, cooking here, letting me do what I love.”At EDGE, Brooks is introducing an unconventional idea of what an American steakhouse can be. He doesn’t limit himself to predictable meats, served in massive portions. “At some steakhouses, you get 14-ounce, 16-ounce, even 40-ounce cuts. I just don’t like to eat protein like that,” he says. “You don’t need to be locked into a massive slab of meat on your plate. You can diversify it so much more.”He calls his approach “steakhouse light” — beautifully prepared steaks and the like, of course, but “accompanied by fresh salads and crudos and ceviches. It’s lighter, more progressive. We embrace the eclectic melting pot that Miami is.”Prime Porterhouse, Roasted Mushrooms and Charred Brussels Sprouts\nPhoto by Daniel KriegerBrooks didn’t have a deep knowledge of Latin or Caribbean cuisine when he came to Florida seven years ago, with prior experience in Vancouver and Boston after moving from Australia, but set about to remedy that. “I love the community here, and I wanted to embrace it,” he says. “I wanted to learn more about it, and incorporate those flavors into our dishes.”While EDGE is very much the product of Miami, there’s a distinctly Australian element to his culinary philosophy. “To me, Australian food is really all about embracing the ingredients,” he says. “When I came to the States, it reminded me of what we then called ‘California cuisine’ — it’s all about taking high-quality ingredients and treating them with respect.”And Australian fare — like that of Miami — is inherently multicultural. A nation of immigrants, Australian cuisine draws influence from all over. “There’s a huge community from Southeast Asia, but it goes well beyond that,” says Brooks. “I lived in a neighborhood in Melbourne for years that was predominantly Lebanese and Turkish — and the food in and around it was phenomenal. You can take those flavors and incorporate them into your food.”“Australian food is embracing what’s around you. Not only the product but the culture as well.”On a recent trip back to Australia he found inspiration in the wine scene that has taken off. “What really, really excited me is the way Australia is on the forefront of natural wines,” he says. “I like the direction and opportunity to try new things, in addition to 'conventional' wine.”“There is a real zest for the style in Oz and the folks down there are producing some phenomenal wines from both well-known and more obscure grape varieties.”His favorite wines of the moment often buck tradition in favor of experimentation. “Lucy Margaux Wines out of South Australia don't use any sulphur and refrain from intervention,” he says. “A fine line to tread, but they do it well. The Wildman Blanc is an absolute quaffer! Skin contact fermented 100% Savvy Blanc, wild yeasts with racy acidity. I absolutely love the stuff. A tropical drop perfect for Miami's scorching midday sun.”Lamb Chops & Sausage, Roasted Carrots, Onions, Coriander and Pepitas Vinaigrette\nPhoto by Daniel KriegerYou’ll find many such wines in Australia, he believes, “done in a way that’s not overdone. Where you taste the integrity of grape, but also the influence of terroir, and also the influence of the winemaker.”Brash Higgins, the work of Brad Hickey, a Chicago native making wines in South Australia’s McLaren Vale, is just one example. “He’s almost like me,” laughs Brooks; “I’m an Aussie guy in Miami cooking with American ingredients; he’s an American dude doing great things with wine in South Australia.” Hickey also works with Nero d’Avola, an Italian variety, and ferments it in amphora, “in these big open clay pots,” Brooks says. “In the Australian climate, the wine has a juicy richness to it.”Even Shiraz, a grape so deeply associated with Australia, isn’t quite conventional in Brash Higgins’s expression. \"It’s not too fruit-forward,” Brooks says. “It doesn't punch you in the face with jammy berriness.\"It’s a wine Brooks would recommend with his signature lamb dish at EDGE — which, like the Shiraz, is iconically Australian, yet a bit unorthodox. “Often people take a safe route with lamb,” Brooks says. “I go bolder, playing into the gaminess, with strong flavors that can really match up to it. I think that with a great char and great spices, you can’t go wrong.”His Australian lamb is given an aggressive spice rub, then char-grilled. Lamb sausage, seasoned with a fenugreek-heavy spice blend called ararat, is grilled as well; it’s all served with a dill- and honey-accented carrot yogurt, with whole slow cooked heirloom carrots, red onions, and a molasses vinaigrette. “It’s inspired by what we call a 'Mixed Grill' in Australia,” he explains, “where various cuts of lamb are served on one plate all from the barbie.” And yet the flavors on the plate are singular, eclectic and international.American steakhouses tend to be formal, even staid, which makes the lively environment Brooks encourages at EDGE so welcome. He attributes some of this to his childhood; his mother was a cook and his father managed pubs in Australia. “They were places where locals would come in and share beers, and share laughs,” he says. “To me, it’s a lot about the culture of a place. That’s the way I like to cook and entertain as well.”“Australian food to me is fun. It embraces people and embraces hospitality. It shouldn’t stifle you, or become intimidating. That’s what food should speak to — just getting together and having a good time.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Wine Australia"]}