{"id": "638db26b0d13e7f9f323ada1fb24f227", "url": "https://www.bonappetit.com/story/cake-tester-for-fish", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "How to Use a Cake Tester to Make Sure Fish Is Cooked Through | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Cake Tester Is the $3 Tool Chefs Use to Make Sure Fish Is PerfectIt works every time—without tearing a gash in your fish.By Alex DelanyJanuary 25, 2018FacebookTwitterEmailPhoto courtesy of OXOFacebookTwitterEmailAs much as we wish it was, a “cake tester” is not a job. Well, maybe it is, but we haven’t found a way into a career path that allows us to sit around and give a thumbs up or a thumbs down to cakes all day. Yet. We mean cake testers, the little stick-like kitchen tools that are used to test the doneness of cakes.Cake testers are long, thin metal pins with small plastic handles, used to poke cakes to test interior doneness. And while we definitely encourage using a cake tester for its official, obvious use, there’s a lot of other things you can use a cake tester for. Professional chefs use them to test proteins and vegetables just as often as they do cakes, and there’s no reason you can’t adopt this technique at home. They only cost five bucks.Our favorite non-cake application for the cake tester is fish. Since fish is so soft and (generally) thin, using a meat thermometer to test internal temperature destroys your beautiful filet. Instead, we like to insert a cake tester into the thickest part of the fish and leave it there for three seconds. Immediately after removing the cake tester, touch the tip to the skin under your bottom lip for three seconds. If the metal is warm, the fish is done. If it’s hot, the fish is probably overcooked, and if the metal is still cool, keep that fella cooking.Meaty proteins can be tested this way too, although we still prefer a meat thermometer. The substantial protein can stand up to a larger puncture and the results will be more precise.Crispy-skinned salmon is great, as long as it's cooked through.\nMichael Graydon & Nikole HerriottWe also love to test the doneness of potatoes, and the process is a little bit simpler. We’re looking for a soft texture to tell if a potato has been cooked through, and while forks or knives work, they ultimately end up ruining the presentation of the potato with slits or holes. The slenderness of a cake tester allows it to puncture the potato, test the interior texture, and get the hell out, undetected.Sure, this seems like a primitive, imprecise technique. That’s because it is. But just because something is primitive doesn’t mean it won’t work. The most impressive fish you’ve had in restaurants were most likely tested this way, and bringing it home will take you one step closer to that crispy-skinned, perfectly-flaky filet you paid a bit too much for at dinner last week.Cake tester as a job? That would be amazing. Cake tester as a cheap instrument that guarantees the doneness of fish? That’s good too. And maybe a touch more realistic.Buy It Now: OXO Cake Tester, $5 at amazon.comNow, it's time to get that cake tester to work:Slow-Roasted Salmon with Fennel, Citrus, and ChilesDon’t bother trying to divide this fillet into tidy portions. Instead, use a spoon to break it into perfectly imperfect pieces.View RecipeExplore Bon AppétitFishShoppingToolsBA RecommendsRead MorecultureThis Kitchen Tool Is Perfect for Anyone Who Cooks. At All. Even a Little.By Brad LeonetechniquesHow to Cook Fish with Crispy Skin, Every TimeBy Bon AppétitPhotography by Michael Graydon Nikole HerriotttechniquesLearn How to Cook Salmon by Avoiding These 6 Common MistakesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Alex Delany"]}