{"id": "639581d4e67a77c5925a7db724fe3b81", "url": "https://www.bonappetit.com/recipe/miso-polenta-with-spring-vegetables-and-tofu", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Braised Spring Veg with Miso Polenta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMiso Polenta with Spring Vegetables and TofuBy Chris MoroccoApril 25, 20183.7(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintWe used to think making polenta meant deciding between adding butter and milk or taking a flavor hit and just using water. But miso adds the umami and richness we crave without dairy.Ingredients4 servings¾cup polenta (not quick-cooking)2Tbsp. white misoKosher salt1bunch spring onions or scallions2Tbsp. vegetable oil, divided½14-oz. block firm tofu, drained, patted dry, torn into bite-size pieces4oz. shiitake mushrooms, stems removed, caps sliced if large3garlic cloves8oz. asparagus, trimmed, cut into 1\"–2\" pieces4oz. sugar snap peas2Tbsp. black bean garlic sauceChili oil and toasted sesame seeds (for serving)PreparationStep 1Bring 3 cups water to a boil in a large saucepan. Add polenta and miso and whisk vigorously to incorporate. Bring to a simmer and cook, whisking frequently in the beginning and less often as it thickens, until polenta is tender, 30–35 minutes. Season with salt. Keep warm over low heat until ready to serve.Step 2Meanwhile, cut dark green tops from spring onions and thinly slice; set aside for serving. Cut white and pale green parts into 3\" pieces, halving lengthwise if thick; set aside. Heat 1 Tbsp. oil in a large nonstick skillet over medium-high. Cook tofu, tossing occasionally, until browned and crisp around the edges, about 5 minutes. Transfer to a plate.Step 3Heat remaining 1 Tbsp. oil in skillet and cook mushrooms, tossing occasionally, until browned, about 5 minutes. Add garlic and reserved white and pale green parts of spring onions and continue to cook, tossing often, until softened, about 3 minutes. Add asparagus and peas and cook, tossing occasionally, until bright green and beginning to soften, about 3 minutes. Add black bean sauce and ¾ cup water and bring to a simmer. Cook, stirring once or twice to incorporate sauce, until vegetables are crisp-tender and liquid is reduced by half, about 3 minutes.Step 4Transfer polenta to a platter. Top with tofu and vegetables. Spoon sauce over, then drizzle with chili oil. Finish with sesame seeds and reserved spring onion tops.How would you rate Miso Polenta with Spring Vegetables and Tofu?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleOMG, what an awesome combo!\nLoved it!\nThanks for the recipe!Ludia BoothChatham NY9/14/2021Really good and pretty easy! If you can’t tolerate something a little bit unusual, maybe it’s not for you. Natalie Hillsboro, OR6/14/2021I love this recipe, but a couple of things which you can see though the reviews. It is not a set of and forget it. Polenta needs as much water as it needs and it needs to be added slowly. The key is tender and a smooth but not soupy texture , especially when you are using miso and water and no dairy. Depending on the firmness of your vegetables you will need to steam some of them by using a lid a bit in the process, add more oil for mushrooms that suck up the oil, adjustthe water with the black bean garlic sauce, etc.  Crispy tofu requires really firm tofu and even then still needs to be patted dried and squeezed a bit, and then thrown in a very hot pan (unless you’re has a coating) to prevent it from sticking. Ingredients are important too, it’s best with great spring vegetables, high quality, very firm tofu, and nice black bean garlic sauce (I actually use a Taiwanese glutinous black bean soy sauce). In short, it’s got a lot variables, but worth the effort in my opinion. AnonymousNew York, NY4/13/2021I really liked this recipe and think the use of miso with polenta was different and very tasty. When I make this again though, I'm going to leave out the tofu as it didn't get that crispy for me and the soft textures of tofu and polenta were not great. DanaNew York City2/24/2021What is black bean garlic sauce? Anonymous5/8/2020I like the concept of trying miso with polenta over dairy and fat, and I really liked the stir-fry flavorings. The kitchen smelled wonderful as I cooked, but my boyfriend and I both felt pairing an Asian stir-fry with polenta just didn't make palate-sense and the disconnect pervaded the entire meal. I might do the stir-fry bit again but just serve it with rice.California5/6/2020From the previous reviews, I figured we would either love this or hate it, but it was somewhere in between. In fairness, I only made the polenta portion, to serve with Korean short ribs. Miso can be sensitive to too much heat, so I stirred that in close to the end of the cooking time, and hoped that might make the flavour more pronounced. But it was very subtle. The polenta was good regardless, and it was a nice change-up to serving rice or noodles as an Asian dish accompaniment.  Donna LaveranHaverford, PA4/3/2020The miso flavor didn't come through in the polenta, and the polenta was too thick and stiff due to lack of fat.  Polenta as a base for a tofu dish is odd.  I was hoping this would be a new unique mixed bowl type of dish, but it just didn't really work.shaxonSan Ramon, CA3/28/2020This would serve 4 very tiny or very full people. We made a full cup of polenta and doubled the tofu and snap peas (from the magazine version). That being said, it was absolutely delicious! I'm going to miso all my polenta from now on. AnonymousChicago3/27/2020This was delicious- Incredible amount of umami balanced out with the bright, fresh notes from the added vegetables. mcflubberdubbsVirginia9/13/2019I just made this and I love it! The veggies had just enough crunch, and the miso flavored the whole dish. Highly recommend! AnonymousBerkeley5/8/2019Loved this! The miso in the polenta, along with the addition of the black bean sauce, made for a savory, rich, but not unhealthy base. Then the veg, sauce and tofu/meat are just yours to riff on. We subbed in scallops for tofu but changed little else. Making again tonight!markstenbergAustin1/21/2019Just okay. The miso polenta was pretty good, but the entire dish didn’t work because the ingredients didn’t harmonize together. The whole thing had too much umami.KJ56Seattle8/14/2018I love Bon Appetit and this column--but my goodness, this was a horrible recipe. I am not sure why I didn't spot it before shopping for it. But miso and polenta just don't work. This ruined dinner, and we threw away the leftovers, which makes me very sad. Don't make it.AnonymousOakland, CA6/25/2018I love Bon Appetit and can always rely on their recipes, but my partner and I could not even finish this.  I followed the instructions exactly.  The miso polenta itself tasted fine and the vegetable stir fry was okay.  Together, the flavors melded very poorly and the texture was extremely unenjoyable.  I don't want to dissuade the curious, but I felt a dissenting voice was necessary because the other reviews had me excited and this was one of the worst meals I have ever made.adt28Boston, MA5/14/2018Explore Bon AppétitPorridgePolentaRice & GrainsMisoCondiments, Sauces & PastesTofuOther IngredientsAsparagusVegetableShiitake MushroomMushroomSugar Snap PeaPeaSpringEasyMainDairy-FreeVegetarianVeganHealthyishFrySimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Chris Morocco"]}