{"id": "63cb8c1701559d78d80532c36b95098d", "url": "https://www.bonappetit.com/story/crazy-rich-asians-food-singapore", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "Dumplings, Kaya Toast, and Chili Crab: Inside the Food of ‘Crazy Rich Asians’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDumplings, Kaya Toast, and Chili Crab: Inside the Food of Crazy Rich AsiansAuthor Kevin Kwan and star Jimmy O. Yang reveal the stories behind some of the best Singaporean dishes in the hit book-turned-movie.By Alyse WhitneyAugust 30, 2018FacebookTwitterEmailSanja Bucko/Warner Bros.FacebookTwitterEmailThe premise of this summer’s runaway hit movie Crazy Rich Asians is Rachel Chu (Constance Wu) flying to Singapore to meet her boyfriend Nick Young’s (Henry Golding) family. But before she exchanges any awkward hugs, she’s first introduced to Singaporean food. The moment after she lands, Nick and his friends, Colin (Chris Pang) and Araminta (Sonoya Mizuno), take her to eat at a hawker centre, a huge lineup of local, affordable street food stalls serving satay, chili crab, stir-fried noodles, and huge bowls of laksa curry. Little does she know that all of that food is just fuel for the drama she’ll endure with his crazy-rich relatives.Nick (Golding), Colin (Pang), Araminta (Sonoya Mizuno), and Rachel (Constance Wu) at a hawker centre.\nCourtesy of Warner Bros.That scene serves as an introduction to Singapore for many moviegoers in America,  and if there’s one clear takeaway, it’s that you should want to eat there. The hunger pangs only grow as Rachel devours a lavish lunch of lobster, longevity noodles, and braised abalone with her friend Goh Peik Lin’s (Awkwafina) family; walks through a kitchen full of decadent roast meats, salt-baked salmon, and intricate desserts at Nick’s grandmother’s party; and attends the wedding of the century with an endless buffet of whole suckling pigs, a shellfish display, and a literal boat full of caviar. Casual.Golding, Kwan, director Jon M. Chu, and Wu on set.\nSanja Bucko/Warner Bros.Food may be only seen for brief glimpses in the film to punctuate just how crazy rich these people are, but in the original book trilogy, written by Kevin Kwan, it’s a major character. There are footnotes dedicated to explaining the origins of dishes, and detailed descriptions that make you feel like you can taste that piece of kaya toast or banana-leaf-wrapped sticky rice. To celebrate the film’s incredible success over the past two weeks, we spoke to Kwan about the Singaporean dishes he holds most dear after growing up there, and the stories behind their place in the books and movie. “I try to feature the greatest hits in my book, but there are so many amazing dishes that I could write a whole other book just about food,” he explains. Jimmy O. Yang, who plays Nick’s ridiculously over-the-top childhood friend Bernard Tai in the film, is also the guest on this week’s Bon Appétit Foodcast, and shares some anecdotes from his time filming in Singapore. Listen to the full episode below, and then read more about each dish’s importance in the wild, dramatic, and hungry world of Crazy Rich Asians.ContentThis content can also be viewed on the site it originates from.1. Hokkien Fried MeeGetty Images“I’m such a noodle boy. I grew up just loving noodles like you wouldn’t believe, especially traditional hawker stall hokkien fried mee: thick, yellow noodles that you find only in Singapore, stir-fried with seafood, meat, and egg in this thick, brown gravy,” Kwan says. “For me, that’s a plate of heaven.” This dish is featured in the book and movie during a whirlwind trip to Newton Hawker Centre, one of the largest in Singapore. Kwan adds: “In Singapore, the richest billionaire in the world will go to a hawker stall for the right plate of noodles. People there are so obsessively in love with food that it doesn’t really matter what the surroundings are like. They’ll eat in a Michelin-starred restaurant that’s decorated to the hilt, or they’ll go to some back alley to look for the best fish porridge in the world. The best food can be found for $3 or $300.” Watch a behind-the-scenes video about hawker centre foods in Crazy Rich Asians below.ContentThis content can also be viewed on the site it originates from.2. Chili Crab and Hainanese Chicken RiceChristopher WiseChili crab, considered one of Singapore’s national dishes, is messy to eat. It is whole cooked crab tossed with a not-actually-spicy, thick, sweet, and savory tomato-chili sauce, served with fried mantou buns (crispy Chinese steamed buns) for dipping. “Chili crab is great, and so are the satays and oyster omelets [at hawker stalls], but the best is Hainanese chicken rice,” Yang adds, referring to the country's unassuming yet iconic dish of poached chicken over garlicky rice with chili and ginger sauces on the side. “Every stall is just a little different, and it’s just wonderful.” He also notes that laksa, a coconut-based noodle curry soup eaten at all times of day in Singapore, is one of his all-time favorites. “I’m a big noodle soup guy. My diet consists of mainly noodle soups: pho, ramen, Chinese noodles, and laksa.”3. PopiahGetty ImagesIn a scene that didn’t make the movie, Rachel has a popiah-making party with Peik Lin’s family, which Kwan says shows how “communal and intimate cooking can be, and how close their family is.” He explains popiah as “beautiful rice pancakes that are thin and filled with various delicious things, like meat, vegetables like carrots and jicama, shrimp, egg, ground peanuts, and cilantro.” Then they are rolled up like a “sleek little burrito,” Kwan explains. “You make and eat them during a big, family-style feast. Everyone sits around a table and makes their own. There’s a very special sort of sugary brown sauce that goes over it all. It’s similar to hoisin sauce but it’s not exactly that, and it is delicious.“4. DumplingsNick (Golding) and Rachel (Wu) make dumplings in Crazy Rich Asians.\nSanja Bucko/Warner Bros.This food-centric scene features one of the most tense back-and-forths between Rachel and Nick’s mother (Michelle Yeoh), but it wasn’t in the original book. “The dumpling making was a surprise to me when I first read about it in one of the early scripts. They had created this scene just for Rachel to get to know the family. I thought it was very effective, quite frankly, and just a lovely moment in the movie,” Kwan says. Dumpling skins were hand-rolled carefully with a dowel, and Nick teaches Rachel to put the “baby” (filling) into bed (wrapper) and tuck, tuck, tuck (pleat) it in. “Then you eat the baby,” she jokes. Kwan says that he did not have dumpling-making parties in his Singaporean home growing up, as his family had a staff that would make everything. But he would sneak into the kitchen and run errands for the cooks as a kid, “learning to fold wontons, sort through rice, and just see what happens behind the scenes.”5. Kaya ToastDanielle Tsi/Getty Images“Kaya is a coconut jam that’s infused with pandan leaves that is very popular in Singapore. It is the uni of jams. There’s something so rich and decadent about it, the texture and flavor. There’s a lusciousness to how smooth and yet thick it is,” Kwan raves. “Uni is kind of sexual, in a way—there’s this confluence of flavors and a sensual pleasure to eating it. In a strange way, I feel the same way about kaya.” Many people toast and butter their bread before spreading it with kaya to make a sandwich, and dip it in either coffee or soft-boiled eggs with soy sauce and white pepper for breakfast, but Kwan prefers things simple. “I had mine on very fresh white bread, crusts cut off, spread with a thick layer of kaya. It was all I needed.” Sometimes it is bright green in color from the pandan leaves, and other times it is more cream-colored—both are equally delicious.6. Nyonya Kueh Pastries and Cheng TngAn assortment of nyonya keuh set out for Nick’s mother’s bible study group.\nCourtesy of Warner Bros.Desserts are a huge part of Crazy Rich Asians. Trays of intricate nyonya kueh (the Peranakan name for a style of bite-sized desserts) are on display at Nick’s mother’s bible study, at a lavish party at his grandmother’s, and, of course, the blowout reception after Araminta and Colin’s wedding. However, one of Kwan’s favorite desserts is actually a soup. “Cheng tng is often found in hawker markets, and it is like shaved ice, but they pile all these different types of translucent jellies inside and on top of different toppings and flavors. But the root of it is this lovely chilled soup that is sweet and aromatic, and I think infused with longan fruit. It’s subtle and beautiful—it’s like the Armani dress of soups.” Soup, but make it fashion. Crazy Rich Asians always stays on brand.Explore Bon AppétitMoviesSingaporeCelebritiesTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-30", "author": ["Condé Nast", "Alyse Whitney"]}