{"id": "63ce60252b7220422a0080ecabd34338", "url": "https://www.bonappetit.com/story/peels-cbd-oil", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "This CBD Oil Made from Orange Peels Goes With Me Everywhere | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis CBD Oil Made From Orange Peels Goes With Me EverywhereAnd it tastes like a Creamsicle.By Iona BrannonFebruary 3, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.It always was a dream of mine to become a flight attendant, and recently, that dream transformed into reality. The process is rigorous, the competition is steep, and after multiple rounds of interviews, I received a job offer conditional on passing a four-to-six-week training course. But to get to the training course, I first have to pass a background check and a drug test by the Department of Transportation.Flight attendants and commercial truck drivers, pilots, train engineers, ship captains, and others performing safety-sensitive functions in the transportation industry must abide by DOT rules. That means my system must be clear of a litany of substances including THC, or tetrahydrocannabinol, the chemical compound in marijuana that gives people a high. Easy, right?Not so easy, actually. Or straightforward. As a naturally anxious person, I often use cannabidiol (CBD) to relax, especially in the darker winter months and when I’m having trouble sleeping. From CBD honey to CBD gummies, I’ve tried them all. The best way to describe the effect of CBD? It creates a softened world without the high of THC. Although there isn’t much concrete research around CBD, it certainly works to make life more manageable for me.Many CBD products claim to have little or no THC, but mislabeling has been a consistent issue in the industry since there’s no FDA certification necessary to make the claim. For example, a 2020 FDA study showed that nearly half of the CBD products tested contained THC.“There is, unfortunately, a great variability in the CBD products being sold, including mislabeling of the actual amount of CBD, contamination with THC, and even [contamination with] heavy metals and insecticides,” says neuroscientist Yasmin Hurd, M.D. and director of the Addiction Institute of Mount Sinai, which has ongoing clinical trials studying the neurobiological effects of CBD.Were CBD and drug tests incompatible? Would I fail the test even if I didn’t intentionally consume THC? I went to the DOT website to investigate and I found that any CBD product with over 0.3% THC will trigger a positive result. So while I still believe that hemp and cannabis-derived CBD have a great deal of potential for healing pain and easing anxiety, consuming them is not worth the risk of losing a job or having a positive drug test follow me for the rest of my career.Enter Peels. Founded by former NFL player Chris Hetherington, Peels CBD oil is bio-identical to pure hemp-based CBD oil, but it’s made from orange oil extracted from discarded orange peels—part of the company’s attempt to reduce the environmental impact of the CBD industry. While CBD is only naturally found in the cannabis plant, Peels uses a proprietary molecular reconstruction process to duplicate the structure of CBD molecules using a compound—orange terpene—that occurs naturally in orange peels. The result is an oil that is molecularly identical to CBD oil but without the THC, heavy metals, or residues often found in traditional CBD.Photograph by Isa Zapata.  Food Styling by Kat BoytsovaPeels CBD Oil$95 at PeelsThe Peels CBD oil comes in a vibrant orange glass dropper jar, and unlike many other CBD products I’ve tried, there’s no skunky aftertaste. In fact, the oil tastes like an orange creamsicle, dense and easy to swallow. Their certifications from the Clean Label Project give me an added sense of security, knowing that I can soothe my anxiety and irregular sleep patterns without ingesting something unknown.As someone who often travels on the job and off, I bring my Peels CBD with me to help me sleep when I’m jet lagged and to ease my anxiety in new environments. Because it’s 100% cannabis and THC-free, not only do I not have to worry about Peels CBD and drug tests, I also know I won't run afoul of cannabis laws that vary from state to state. And a reminder from your friendly flight attendant—at 1 fluid ounce, the bottle is also TSA-friendly.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-03", "author": ["Condé Nast", "Iona Brannon"]}