{"id": "63e36205e37fc81235ce7fd4de2c164f", "url": "https://www.bonappetit.com/story/soup-that-saved-me", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Healthyish Newsletter: The Soup That Saved Me and an Epic Thanksgiving Tart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Soup That Saved Me and an Epic Thanksgiving TartThanksgiving recipe recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroNovember 15, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends!I admit I'm not in a Thanksgiving mindset yet, thanks to the stomach bug I've been battling, but Healthyish food editor Chris Morocco has been in the mindset since July. Which gave him plenty of time to dream up this beautiful, festive, and utterly delicious squash and caramelized onion tart. (For the record, Chris wanted to call this recipe Things Fall, A Tart, for which he deserves many hand-clap emojis). If you're having a vegetarian Thanksgiving or just want a centerpiece that's better-looking than the turkey—sorry, turkey—I can't recommend this savory, jammy, tender-crusted recipe enough.Squash and Caramelized Onion TartFor a vegetarian main that can hold its own at the center of the table, this tart makes a very convincing argument.View RecipeThis Week on HealthyishOn Monday we published Elazar Sontag's story about Andre Springer, drag performer and maker of Shaquanda's Hot Pepper Sauce. It's a real feel-good story about increasing queer visibility by literally putting it on the shelf, but just as we published it, we learned that Shaquanda's operations had to stop because its commercial kitchen space shut down. Donate to Springer'sKickstarter if you can so they can fulfill their holiday orders and get back on track.Make This StatBecause of the aforementioned stomach thing, my diet for the last two days has consisted of bananas and steamed sweet potatoes, i.e. baby food, until last night, when my gentleman friend coaxed me to the table (okay, the coffee table next to the couch where I was sprawled) and gave me a bowl of this chicken and rice soup. It tasted so good I nearly cried, and I swear I feel cured since eating it. The moral of the story? Make this soup.Chicken and Rice Soup with Green Chiles and GingerThis chicken and rice soup has everything we're craving, plus a big handful of crushed peanuts on top.View RecipeThe Rave Review: Pink ChaiIt's finally #teaseason, and I'm all about this caffeine-free Pink Chai from Lee's Provisions. The packaging may be millennial bait, but I love chai anything, and it's rare to come across versions without caffeine.Reads of the WeekNow that the midterm elections are over, I'm reading some fiction again: Neon in Daylight by Hermione Hoby and the fairy tales in T's recent travel issue. (The story written in sequence by 10 Florida-based writers is a feat, but my favorite might be Michael Cunningham's, narrated by an actual fairy and inspired by that Leonard Cohen song.And Last But Also FirstWe're thinking about our Healthyish friends and communities that've been affected by the fires across California. We recommend donating to the California Fire Foundation's SAVE program, which distributes gift cards directly to victims on the front lines.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterThanksgivingessayRead MoreLifestyleThis Caramelized Onion and Squash Tart Is the Vegetarian Stunner Your Thanksgiving Table NeedsBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Amanda Shapiro"]}