{"id": "63e560740982b19c9db4d47d3f2dca63", "url": "https://www.bonappetit.com/story/riccardo-enoteca-chicago", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Riccardo Enoteca, My Favorite Red Sauce Joint, Is Haunted | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Red Sauce Joint Is HauntedSo why have I never been visited?By Claire CarusilloApril 16, 2019FacebookTwitterEmailPhoto by Jeff MariniFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.You could say the unofficial architectural style of the neighborhood I grew up in in Chicago is “nothing to look at here.” Whether it’s a pizza shop, hot dog joint, strip mall, or office building, the brickwork and sepia-tinted windows ubiquitous in Lincoln Park resulted in an aesthetic my siblings and I coined “Classically Chicago Brown.” Sure, it was a little melancholy, but I found it supremely comforting.On one block of Clark Street, the area’s main drag, sits Riccardo Enoteca, a pipsqueak Italian restaurant that pins down this exact aesthetic. It’s got a tiled name-plate pizza oven, a tiny bar, and about five tables jammed into an itty-bitty space. It offers remarkable charcuterie (including prosciutto, which my father insists on pronouncing “bra-shoot”), bomb-ass old-timey pasta, and too-bright bathrooms too close to the kitchen with one-ply toilet paper and antiseptic pink soap. Riccardo’s empire spans across the street to the fancier yellow-bathed Riccardo Trattoria, but we are simple people, and we like wearing athletic leggings and crewnecks to dinner.Spirits, are you there?\nPhoto by Jeff MariniUntil a few months ago, I was ignorant of the fact that Riccardo Enoteca also stands on the site of the infamous prohibition-era St. Valentine’s Day Massacre of 1929, wherein seven men associated with Bugs Moran’s gang were gunned down in what was then a parking garage, likely by Al Capone’s associates. People say the restaurant’s haunted.I’ve never been visited by their ghosts, even though I’m a joy to spend a dinner with. But it makes sense that seven sets of invisible hands would get to work each evening—winding up the pasta maker and the meat shaver, stoking the pizza coals, and refilling red-pepper shakers, marveling over a completely legal wine and beer menu—arranging everything just to remind us that those unrelenting Chicago winters will eventually end, and sometimes, forever and without notice. While you’re here, they seem to tell us, you might as well enjoy the dim lighting and the mahogany bar and the complimentary bruschetta.Claire Carusillo is a writer living in New York. She is working on her first novel.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Claire Carusillo"]}