{"id": "63ec133bd22b5dcdbe1088ac20b27838", "url": "https://www.bonappetit.com/story/on-eating-cooking-with-and-actually-enjoying-weed", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "On Eating, Cooking With, and Actually Enjoying Weed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOn Eating, Cooking With, and Actually Enjoying WeedCooking with cannabis and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroMay 2, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This week on the site, we’re talking about cannabis and food: How to eat weed, how to cook with it, and how to actually enjoy it now that the plant is accessible (and legal) in more places than ever before. There’s a ton of great stuff to read, like a guide to buying ethical weed, an extremely doable step-by-step guide to making your own weed butter, some of our favorite cannabis-adjacent products (Do I need a 24K-gold eggplant-shaped pipe? No, but boy do I want it.), and a profile of the woman who baked 600 pot brownies a day for AIDS patients—then helped pass the first medical marijuana law in the country. And, of course, there’s tons to cook too: mango smoothies, brown butter carrots, and lemon semifreddo, all infused with your CBD oil of choice.Are carrot coins cool again?\nPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiHere at Healthyish, we’re experts in food, not cannabis, so we tapped Broccoli, a magazine about women and weed, to help us out. Luckily their founder and creative director Anja Charbonneau was very down, so we worked together between Portland, OR, and NYC (with help from contributors around the country and in Mexico) to create this dreamy, delicious guide. You can read it in Broccoli’s gorgeous new spring issue or on Healthyish today.And to celebrate, we’re having breakfast! On Monday, our friends at Future of Women threw an amazing porridge party and cannabis convo at Porridge and Puffs in L.A. And on May 8th, they’re helping us host a second breakfast and panel at Kopitiam in NYC. It’s sold out, but if you snagged a ticket, I’ll see you there.Until next week,Amanda ShapiroHealthyish EditorP.S. A few months ago we were honored to publish this essay from Fatima Ali on Healthyish; chef Fati passed away a few months later. On Friday, her piece received the James Beard Award for Shortform Personal Essay. Her brother, Mohammad Ali, came to NYC to accept the award on her behalf, and he asked the audience: “What would you do if you were in Fatima’s shoes? Who would you call? After that, ask yourself, what are you waiting for? Enjoy the things in life that are simple and beautiful. Thank you everyone who was involved in her life.\"Explore Bon AppétitHealthyishHealthyish NewsletteressayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Amanda Shapiro"]}