{"id": "63ec919ae73783fb64e6a1b1ade27a24", "url": "https://www.bonappetit.com/story/annie-beebe-tron-freaky-cocktails", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Meet Annie Beebe-Tron, The Bartender Behind Chicago's Freakiest Drinks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow One Chicago Bartender Makes the Freakiest, Dopest Cocktails in TownFor Annie Beebe-Tron of Fat Rice, it all starts with an intense desire to touch things.By Maggie LangeNovember 29, 2018FacebookTwitterEmailPhoto by David KasnicFacebookTwitterEmailIt’s an overheated and sweaty morning in Chicago, and Annie Beebe-Tron is admiring a particularly soft, floppy plant at the Garfield Park Conservatory. We have a few hours before Annie takes their spot behind the bar at the beloved Macanese restaurant Fat Rice, and the city’s brilliant cocktail sorcerer is visibly enamored.Freaky plant energy is part of the whole cocktail ethos at Fat Rice and its adjacent bar The Ladies’ Room, where Annie—who is gender fluid and uses the plural pronouns they/them—runs both the beverage program and front of house. The first drink of theirs that I ever tried tasted like acid rainwater and came garnished with a wayward ramp stem leaning out of a double rocks glass. Sort of like a well-tailored suit in a wild color, Annie’s cocktails are surprising and unexpected. They use ingredients like avocado leaf tincture and salted coconut foam; umeboshi vinegar and jerk spices. They play with texture, salt, and umami. They’re silky, creamy, salty, and foamy. They are some of the most boundary-defying drinks in a city celebrated for its bars.Annie Beebe-Tron at the bar at Fat Rice.\nPhoto by David KasnicFat Rice is the first and only restaurant that Annie has ever worked in—if we don’t count their undergrad cafeteria (“you shouldn’t,” they joke). They taught themself how to bartend on the job and revisited basic chemistry to develop their own liqueurs, infusions, and Chartreuses, which coat the tongue in a savory oil slick and blow wide open what was even available for mixing cocktails. Annie is accustomed to learning like this; they were homeschooled as a child (under a Christian evangelical doctrine) and grew up an “indoor kid” with a bent for plants, and later for art.“I figured out midway through my art career that I wasn’t a visual person, but a kinesthetic person—a texture person,” Annie says of their stint making art with food themes. The art of the cocktail, we’ll say, let them meet in the middle.Governed by a tactile approach, Annie’s menu prioritizes the active experience of swirling a garnish or adjusting the flavor yourself. The Saigon Street Breakfast, made with ingredients including Thai basil, lime, and a housemade pho vermouth, is an ideal show of their ethos: “I wanted that experience you get when you’re drinking pho—the temperature changes and the dilution changes. It’s all fluctuating as you’re drinking it.”Some of Annie’s projects.\nPhoto by David KasnicA close up.\nPhoto by David KasnicStraining... something.\nPhoto by David KasnicTheir drinks are also a testament to their role as devoted collaborator and steadfast leader at Fat Rice—a job Annie has excelled at as a queer feminist boss seeking to upend the traditional hierarchy. Co-owner Adrienne Lo’s mother is growing ingredients for a house absinthe. A Romanian janitor’s plum liqueur recipe features in the Onu You Didn’t cocktail. The backbar hosts bottles of cardoon amaro, a creation Annie was able to salvage from one of chef Abe Conlon’s infusion experiments gone wrong. It’s just one of many projects Annie tends to with a gardener’s patience—there are currently an estimated 150 bottles (and “lots more to go”) brewing and infusing in their personal “vault.”As we walk through the conservatory, we pick out which of the freaky plants would make the best garnishes. There’s a furry velvet-looking one and the iridescent rainbow spiky one and the medium-leafed, glossy, proud, type A looking one. I watch Annie’s excitement builds as their attention darts from species to species. Each and every detail noticed; everything eyed for its potential.A view inside The Ladies’ Room bar.\nPhoto by David KasnicExplore Bon AppétitChicagoBarsRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-29", "author": ["Condé Nast", "Maggie Lange"]}