{"id": "63f69c051fb0bd79fdccfce89d16e75f", "url": "https://www.bonappetit.com/recipe/turmeric-yogurt-dip", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "Turmeric Yogurt Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurmeric Yogurt DipBy Seamus MullenMarch 29, 20193.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintVigorously squeezing the cucumbers to remove as much water as possible helps to concentrate their flavor and creates a thicker dip.IngredientsMakes about 2 cups2Tbsp. extra-virgin olive oil1tsp. ground turmeric½English hothouse (or 2 mini) cucumbers1cup whole-milk Greek yogurt1small garlic clove, finely grated1Tbsp. chopped mint1tsp. finely grated peeled fresh ginger (from one ½\" piece)½tsp. finely grated fresh lemon zest1Tbsp. fresh lemon juiceKosher saltSliced raw vegetables, bread, and/or crackers (for serving)PreparationStep 1Heat oil and turmeric in a small saucepan over medium-low, stirring occasionally, just until oil begins to bubble, 2–3 minutes. Let cool.Step 2Coarsely shred cucumbers on the large holes of a box grater. Squeeze out excess liquid. Transfer cucumbers to a medium bowl. Add turmeric oil, yogurt, garlic, mint, ginger, lemon zest, and lemon juice; season with salt and stir to combine. Serve with crudités alongside for dipping.How would you rate Turmeric Yogurt Dip?Leave a ReviewTell us what you thinkExplore Bon AppétitDipCondimentCruditéIndianSouth AsianAsianCucumberVegetableYogurtOther IngredientsTurmericHerbs & SpicesSnackStarterGluten-FreeNut-FreeVegetarianKetoHealthyishSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Seamus Mullen"]}