{"id": "63fdaed673720e7fdb4acafcace84a0b", "url": "https://www.bonappetit.com/story/how-to-seed-a-pomegranate", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "How to Seed a Pomegranate Because There's Only One Good Way | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Seed a Pomegranate Because There's Only One Good WayIf you've never known how to seed a pomegranate, we're here to help.By Emma WartzmanFebruary 15, 2018FacebookTwitterEmailFacebookTwitterEmailThe other evening on the subway I saw a lady, her Whole Foods shopping bags at her feet, eating pomegranate seeds straight from a plastic container, and I felt a flash of recognition. Until recently, I had no idea how to seed a pomegranate; those ruby-red seeds were one of the few ingredients that I always bought ready-to-eat.There is a myth—and yes, it's just a myth!—that pomegranates are a huge pain to de-seed yourself, that you're not very likely to get all of them out, and that you'll make a big stain-inducing mess in the process. But what if we told you it's not actually as hard as you think? And that from now on you can buy full pomegranates for way less of the money than it costs when someone else is doing the work.Here's how: Cut the pomegranate in half through the equator, then a hold it over a bowl of water, cut side down. With a wooden spoon, smack the skin assertively and repeatedly and watch the seeds hail down. Yep, that's really it.There are other videos on the internet that use a similar method, though often they use a paring knife to carve the pomegranate into a flower-like shape ahead of time. We think that's unnecessary if you use our patented (not really) water method. While the seeds sink to the bottom, any white membrane bits that come out will float the top. You can scoop those out with a slotted spoon once you're done, then drain the water from the seeds.Sure, you might still want to a wear an apron to avoid splatter, but now you're well on your way to making wheat berry bowls with merguez and pomegranate, citrus-pomegranate relish, and Moroccan lamb shanks with pomegranate.Lady from the subway, if you're out there, I hope you're reading this.More pomegranate recipes right this way:1 / 21ChevronChevronShredded Cabbage Salad with Pomegranate and TomatoesView RecipeExplore Bon AppétitPomegranateHealthyishFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-15", "author": ["Condé Nast", "Emma Wartzman"]}