{"id": "6403cf1dbadcd4e53f76ce40b341c7c6", "url": "https://www.bonappetit.com/story/sheldon-simeon-hawaii-cookbook", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "How Chef Sheldon Simeon Who Embodies Hawai'i’s Past, Present, and Future | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Chef Who Embodies Hawai'i’s Past, Present, and FutureSheldon Simeon wants you to pay attention to the islands.By Elyse InamineJuly 19, 2021FacebookTwitterEmailPhoto by Marylane StudiosFacebookTwitterEmailEvery writer loves to see their book out in the wild. And they love to share it. You know the photo: a seemingly innocuous cover shot by a proud author at a fluorescent-lit Hudson Booksellers in the airport. Perhaps the portrait is cheekily art-directed so all other books are pushed aside and the author’s tome is front and center, vanity acknowledged.Let me describe to you a different kind of book-in-the-wild work. A giant metal table fit for Paul Bunyan but naturally at home in a Costco in Kahului, Maui, cookbooks rising a foot above the already tall table. Carved into this layer of books is a rectangle of empty space where one particular book clearly resided until it sold out. This photo doesn’t show off a book’s cover art but rather our fervent demand; even bulk-size-everything Costco can’t restock it quickly enough. The book I’m talking about is Cook Real Hawai’i by Sheldon Simeon, cowritten with Garrett Snyder, and the photo was posted on Facebook by Simeon’s wife, Janice, on April 2, just three days after its release.This is just one anecdote, but the book, now in its third printing, has connected with people both in Hawai'i and on the mainland in an I-must-buy-this-now way. Perhaps it’s because there is a primer on poke, everyone’s favorite Hawai'i export. Maybe it’s because there are recipes that appeal to tourists and locals alike: Spam musubi, fishy saimin, craggy mochiko chicken, butter mochi. But I think there’s so much hype because of the author himself.Simeon's saimin broth calls for pork spareribs, kombu, dried shrimp, and dried shiitakes.\nPhoto by Kevin J. Miyazaki/courtesy Penguin Random House“I don’t think I’d be a chef if I didn’t grow up in Hawai'i,” Simeon told me years ago. “As crazy as it sounds, aloha spirit is a real thing. It touches you. It makes you want to rep Hawai'i hard.”His cookbook is a testament to that. It’s a 304-page ode to the people, the stories, the food that makes Hawai'i Hawai'i. There’s an entire chapter dedicated to heavy pupus (!), the local term for appetizers that go beyond tired tiki tropes and range from dip studded with squeaky kamaboko to Hawaiian jerky known as pipikaula. You’ll find riffs on Simeon’s favorite version of cold ginger chicken from Chun Wah Kam on Oahu; the church potluck staple hekka, Hawai'i’s version of Japanese sukiyaki with tons of garlic and ginger; and salted lemons, which are often left to preserve on roofs in Hawai'i. Simeon got the latter recipe after eight years of gathering the courage to ask one auntie for hers (he used her jars for target practice as a kid; thankfully he was a bad shot). This is homey Hawai'i food, not the stuff you see at resorts or fancy restaurants, but the kind of food that people eat at home with family and friends. The kind of food that Simeon wants everyone to love, not just poke.You may know Simeon as the chill dude from Hawai'i on Top Chef season 10 and the eventual fan favorite of that series. The guy with 100K followers on Instagram, desperately trying to keep up with reposting what people are cooking from the book. The person who constantly says yes to everything.Simeon is an entrepreneurial guy, almost to a fault. Most of his culinary education was in Hawai'i—save for an internship at Walt Disney World—and after graduating from the Maui Culinary Academy, he worked his way up to become the executive chef at Star Noodle, where Top Chef producers stumbled across him.Even though he didn’t win in 2013, Top Chef led to opportunities that seemed too good to pass up. Later that year Simeon became the executive chef at the Asian fusion restaurant MiGrant inside the Marriott Wailea, one of the luxury resorts in the tourist-swollen stretch of Maui known as Wailea. He opened Tin Roof in Kahului near the airport, a small counter serving modern takes on the classic plate lunch, like chop steak with ginger-scallion pesto and ulu (breadfruit) mac salad that’s as mayo-laden as it should be. He consulted on a poke chain in New York City. He starred in Eater’s “Cooking in America” video series, traveling all over the country to highlight mom-and-pop restaurants and immigrant cuisines that have shaped regions of the U.S. in the same way they shaped Hawai'i. In October 2018 he opened Lineage, his ode to the food he grew up with, a fine-dining-ish restaurant across from a Louis Vuitton in a fancy mall in Wailea.Even though I didn’t grow up in Hawai'i, I always felt like I belonged. Partly this is because Hawai'i has so many Asians; at 37.6 percent, they make up a plurality of the population. Being Japanese, I always resembled someone’s cousin or a friend of a friend. But the islands also have a magnetism, whether you have been living there your whole life or just a couple of weeks every year, crammed into your grandma’s house in the Kuliouou Valley of Honolulu. You learn, slowly, what it means to be a local.Being a local means you understand that Hawai'i is a special place. You understand that everyone drives a little slower (there’s a speed minimum on the highways) and that you’re going to talk story (local slang for chatting) with every cashier at every grocery store. You understand business casual in the office means aloha shirts and that a power lunch is eating at Helena’s Hawaiian Food. You understand that everyone is “auntie” or “uncle,” even if there is no blood relation. That is the allure of being local. And it’s why Hawai'i’s cuisine is a mash-up of cultures. And it’s why a shy Japanese girl from California found a piece of home in, of all places, a mall restaurant in Wailea.“This is my favorite thing in the wo-o-orld: pick-ing po-ho-le!” Simeon sang. We met up in the literal wild after I visited my dad’s side of the family in Kuliouou Valley and as he was working on this cookbook, back in November 2018. (We also visited Oprah’s (OPRAH’S!) farm. And that is all I can divulge, per the NDA I signed.) Simeon wore his usual uniform: black T-shirt, black baseball hat that says “Aloha,” gray shorts, worn-in flip-flops. He’s 39, without a single white hair in his inky beard. He’s dark-skinned and stocky like every other guy on this island, but his blindingly white all-teeth-bearing smile sets him apart.Thigh-deep in fern leaves and bugs, we waded through the sprawling backyard jungle belonging to Christopher and Becky Speere. Christopher is a culinary instructor at the local University of Hawai'i campus, and Becky is the dining editor at Maui No Ka ʻOi Magazine, a bimonthly magazine celebrating Maui culture. They’ve been Simeon’s mentors since he was Christopher’s student. Simeon ran his fingers along tall reedy stalks, feeling for the familiar curled tendrils of pohole (fiddlehead ferns). In three seconds he twisted the pohole free from the bush and shoved them into a canvas bag, which is harder than it looks. (I had more bug bites than pohole by the end of our forage.) The pohole was destined for a cold savory tomato tea I’d drink later on at Lineage.Simeon comes to the Speere’s wild backyard often. It reminds him of growing up in Hilo on the Big Island, then just a local Filipino boy who never thought he’d be a big deal. Big enough to publish a cookbook. Big enough to put Hawai'i back in the national spotlight.As he’s built his empire, Simeon has become somewhat of a household name. Pre-COVID-19, it was normal for tourists to stop Simeon if they saw him walking around Maui and ask for a photo (I was tasked with taking one once during my visit). At Tin Roof there was often a line of customers, six or so deep, snaking around the restaurant an hour before it opened. Back then it was open only four hours a day, from 10 a.m. to 2 p.m., and people didn’t want to miss out on trying his food and getting a glimpse of Maui’s hometown hero.But for aspiring cooks it’s more than just fandom—Simeon represents something new, something exciting, something important in the Hawai'i culinary scene. While the wages at Lineage weren’t as high as the hotels surrounding it, young cooks still applied for jobs. “They came because they wanted to work with Sheldon,” said Rob Ramshur, the former chef de cuisine at Lineage who left his previous job working in San Francisco restaurants to join Simeon. “It’s a once-in-a-lifetime opportunity. I knew I would regret it if I didn’t take it.” Now Ramshur is working on opening his own musubi and crack seed shop called Traveling Plum. “The way he moves in the kitchen makes you want to follow him,” said Kelley Pittman, a native of Hawai'i who is currently a sous-chef at Misi in New York City. “He’s one of the Hawai'i chefs we’ve always looked up to. He’s the next generation of Hawai'i chefs bringing eyes back here.”Simeon foraging for pohole \nPhoto by Kevin J. Miyazaki/courtesy Penguin Random HouseThe first generation Pittman was alluding to formed in 1991, when a dozen chefs across the islands launched a movement called Hawai'i Regional Cuisine (HRC). Their goal was to reclaim and redefine the food of Hawai'i by pushing back against mainland stereotypes of shipped-in resort food and Spam. They sourced locally. They dug into the flavors of native and immigrant cuisines that shaped the islands. They flexed the French techniques they picked up at mainland restaurants. Now you know how macadamia-crusted mahi-mahi was invented.It was a pivotal moment in Hawai'i’s food history that made people recognize the islands as a culinary destination. Roy Yamaguchi, George Mavrothalassitis, and Alan Wong, three of the HRC chefs, received James Beard Awards in the years after. But since then, Hawai'i has fallen off the radar.“I remember, maybe 10 years ago, a chef in Hawai'i told me, ‘We gotta get out of this Hawai'i Regional Cuisine rut,’” says Martha Cheng, the food editor at Honolulu Magazine. “A lot of young chefs were tired of things like soy mustard. They wanted to do something different. They were trying to figure out what makes Hawai'i unique and translate that into food.”There is a word that comes up as I talk to chefs, cooks, and food writers familiar with Simeon: “rooted.”“Sheldon is very rooted in Hawai'i, which speaks to his food,” says Chris Kajioka, the chef behind Miro Kaimuki and Papa Kurt's in Honolulu. “That guy can make dirt taste good.”“He sticks to his roots; there’s no changing that,” adds Pittman. “Sheldon’s food is fluent in Hawai'i.”It’s an interesting word choice to describe anyone or anything associated with a food culture that has been defined by external influences. The food of Hawai'i is complex and thorny, the result of a unique mash-up of people who made the islands their home over the last 1,500 years, from the intrepid Polynesians; British colonizers; immigrant workers from Japan, China, Korea, Portugal, and the Philippines; and the American military.Even among these distinct cultures, an almost universal Hawai'i identity has somehow formed among island locals, and in turn, a food culture reflecting that. This is why your Spam might be griddled in shoyu (soy sauce) before being slapped onto hot white rice for musubi. This is how poke morphed from being a native Hawaiian method for preserving fish to a universal way of eating fish on the islands. This is how things like huli huli chicken (a Portuguese take on teriyaki chicken) and saimin (a noodle soup with Filipino, Chinese, and Japanese origins) came to be.Whereas HRC leaned into the flavors of these individual immigrant groups, highlighted local ingredients, and used largely Western cooking methods, Simeon focuses on how the stories and techniques of these different groups formed one distinct Hawai'i cuisine. He’s bringing context to the food that has come to define Hawai'i, as complicated as it is, and celebrating it through whatever platform he has—his restaurants, his cookbook. “I want to represent Hawai'i food, what we grew up with, not shying away from it but being proud of it,” Simeon explained. “I want to show everyone how amazing Hawai'i food is. These recipes and dishes are as important as the songs and dances ingrained in our culture.”Simeon likes his cold ginger chicken with extra ginger-scallion sauce on the side.\nPhoto by Kevin J. Miyazaki/courtesy Penguin Random HouseAs I drove down the Pi’ilani Highway to Wailea, I saw serene cul-de-sac hotel entrances, perfectly manicured lawns, and white tourists in the midst of a vacation fantasy. Locals avoid this area at all costs, and I wondered why Simeon kept returning to this particular stretch of Maui again and again. It seemed like the exact opposite place where you’d want to showcase food that’s an homage to residents.Then I sat down at Lineage. Young families took over the picnic tables outside and hotel workers filed in next to me at the bar. I dug into a tangle of thinly sliced pipikaula, chewier and spicier than you’d normally get at old-school Hawaiian spots but mixed with the kind of dried, intensely fishy squid threads stocked at any drugstore on the island. It’s a collision of two eras of meat preservation in Hawai'i that somehow made sense. I drank the smoky saline tea, bobbing with preserved tomatoes and the pohole Simeon and I had gathered earlier, like a vegetable-based bubble tea. Of course, there was what most people think of as Hawai'i’s essential ingredient—Spam—but Simeon, insanely, made it in-house and it tasted like the real thing but better. It came lacquered with a sticky tamarind glaze instead of the usual teriyaki or shoyu, nestled atop sticky white rice, and wrapped with salt-flecked, brittle nori, just as you’d see at any family gathering on the islands.“We were on the front lines of tourism, on the high-end side of Wailea, and there wasn’t a menu that represented local food,” Ramshur says of his time there under Simeon. “We wanted to re-educate tourists and offer nostalgia to locals.”This is the crux of Simeon’s mission, and it belies his special power. He can make food that invites tourists in while also transforming this place where locals never really felt welcome into a home, even for a wannabe local like me. I began to understand Simeon a little better. He’s just like me, a relentless hype man for Hawai'i.In 2016 Simeon ended up closing MiGrant because “Uncle Keen wouldn’t come,” meaning 90 percent of the diners who came through were visitors. After helping the poke company with improving the sourcing of the fish and recipe development, he ended his consulting contract. He left Lineage in February 2020 to spend more time with his family, right after he was nominated for a James Beard Award, Best Chef: Northwest & Pacific, like the HRC chefs before him. It seemed like just as things were taking off for Simeon, he pumped the brakes, hard.I wondered if there was drama behind these moves. (There wasn’t, from what I’ve heard, just the usual chef not seeing eye to eye with management.) I thought about how antithetical they seemed, how Simeon walked away from the opportunities he took on to highlight the food he and so many others grew up with. I remembered a story Pittman told me about a time she helped Simeon cook at the James Beard House in New York City, a jewel in the crown for any chef. I’ll let her tell it in her words:“I did a weeklong stint cooking at the James Beard House and I planned it around Sheldon. What made me excited was that he was going to put a Hawai'i mix plate on the menu: mochiko chicken with mac salad and rice. It was wild. People loved it because people loved Sheldon. We had about five or six of us from Hawai'i, all there to help Sheldon with this event. We shed a tear at some point. It was super emotional. This is the food that makes me happy. This is the reason why I cook. This is the food I’ve been wanting to feed people for a really long time, but thought people wouldn’t understand it.”This was the fire that Simeon had started, kindling a new appreciation for old traditions and local food and making way for a new interpretation and a bigger audience.Photo by Kevin J. Miyazaki/courtesy Penguin Random HouseWhen COVID-19 brought everything to a halt, Simeon seemingly started back up. The hustler was still hustling, not for his own gain but for his community. To keep the lights on (and as much of his staff employed) at Tin Roof, he expanded the hours to offer dinner. More locals, who were previously deterred by the long line of tourists, could finally make it to Tin Roof. Simeon invited Koko Ichiban Ya, the Japanese mom-and-pop restaurant that previously occupied the space Tin Roof is in, to do a bento box pop-up to commemorate what would have been the restaurant’s 25th anniversary. And now with his cookbook, he’s donating sales of copies sold at Tin Roof to Maui Food Bank—so far he’s raised $15,000—and doing virtual demos with chefs (and Mario Lopez) and hopping on podcasts to talk about tourism and what local food really is.“Ultimately, my journey to celebrate Hawai'i food will continue,” he told me. “Just through a different platform.”Maybe that’s through Cook Real Hawai'i. Maybe it’s through his poke chain consulting or maybe another restaurant. I never know with Simeon. But I finally understand what he’s doing, years after I spent a weekend with him, eating, foraging, and visiting farms he works with and years of researching, interviewing, and understanding the food of Hawai'i and where Simeon fits into it. He’s a loud and proud ambassador of Hawai'i as well as a dude with an aloha shirt on his back, flip-flops on his feet, and thick pidgin in his speech.He’s using whatever platforms come his way as a pulpit to preach the gospel of Hawai'i. He’s not selling out. In fact, he’s doing the opposite—he’s doing everything he possibly can to make sure Hawai'i food gets its due. And I can’t blame him, because I’m doing the exact same thing.Explore Bon AppétitRestaurantsHawaiiChefsCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-19", "author": ["Condé Nast", "Elyse Inamine"]}