{"id": "6408374b024645762cc22ff7042cb985", "url": "https://www.bonappetit.com/story/butter-your-sandwich", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Here’s Why Butter Belongs on Every Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHere’s Why Butter Belongs on Every SandwichYou can have your mayo and keep your mustard—butter is my weapon of choice.By Carla Lalli MusicNovember 14, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can't stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I just spent three days in Milan and the most delicious thing I ate was a buttered salami sandwich.It was also the first thing I ate, and to be honest I expected it would be bested, but that never came to pass. Immediately after checking into our hotel in the Brera neighborhood, my husband and I ducked into the legendary Pasticceria Marchesi around the corner for a jet-lag prophylactic of an espresso and a snack. Sitting inside the glass-fronted case, Marchesi’s brioche panini—with its braided dough and logo’d napkin belly band—looked marvelous, classy, impeccable. If I were anywhere else in the world, the idea of eating a pre-made sandwich would be laughable, borderline offensive! But at this moment, it was irresistible.We stood at the crowded bar, extremely fashionable people elbowing in all around us, and I beheld the majesty. First of all: great bread. Enriched like a good brioche but sturdy like you want a panino to be. Second: the salami was not shaved into ribbons, but cut thick as a nickle, and arranged so that the slices overlapped at the edges but were otherwise in a single layer. I liked this! But the thing that brought it all together, as it does so often in so many scenarios, was butter. Both slices of bread were schmeared wall-to-wall with a discernible spackling of the stuff. Immediately, I felt love.Want this letter before it hits the website? Sign up for our newsletter!Look at that braid!\nPhoto by Carla Lalli MusicMy mother, Carole Lalli, buttered every sandwich I ever ate my whole life. I butter my children’s sandwiches. Even if there might be mustard also in play, a base-coat of butter is an added-value primer. This step shouldn’t be skipped even if the sandwich filling itself is fatty—in this case it was salami, in another case it could be mortadella or French ham or maybe aged cheddar. I’ve buttered the bread before adding peanut butter. No one blinked! Buttering a sandwich is underrated but cannot be over-endorsed.Then I ate the sandwich. Of course butter has a flavor, and the dairy’s sweetness made the salami’s saltiness more apparent and also more balanced. But what I really loved was the little textural barrier the butter brought, as though there were a flexible but watertight layer between the tender crumb of the bread and the chewy pull of the cured meat. There’s also the buttery gloss you feel on your lips, and the subtle adherence that helps the salami stick the sandwich together instead of just lying there on dry bread. Butter brings it all together, and it brings it to another level. Butter makes it better.To be fair, I had some excellent risotto in Milan, lots of terrific coffee, drank approximately one thousand Campari spritzes, and I even saw the Last Supper! I also won the best cookbook of the year award from Correire della Sera for my book, Where Cooking Begins, which was an incredible honor. Listen—it was a great trip. But, the butter. That’s what I’m bringing home.Explore Bon AppétitCarla NewsletterButterSandwichRead MorecookingThe Impatient Baker's Guide To Bringing Dairy To Room TempBy Michelle LopezrestaurantsI Will Never Make a Sandwich as Good as The One at Lula CafeBy Adam Rapoportcooking6 Rules for a Perfect Grilled Cheese, Every TimeBy Emma WartzmanrestaurantsAn Adult-Sized Hangover Calls for the XL Breakfast Sandwich at Philly’s Hungry PigeonBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Carla Lalli Music"]}