{"id": "6411f0c4f3faf46c751689badf72ba3d", "url": "https://www.bonappetit.com/story/extra-thanksgiving-turkey-breast", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "If You Care About Thanksgiving Leftovers, You Need to Make an Extra Turkey Breast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Care About Thanksgiving Leftovers, You Need to Make an Extra Turkey BreastYour dry, already-sliced bird is going to make a terrible sandwich. Follow us if you want the good stuff.By Alex DelanyNovember 14, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailIf you want the best leftover turkey sandwich of your life, you have to make an extra turkey breast. That’s just how it works. It sounds like turkey overdose, but we promise you, you’ll thank us when you take the first bite of the sandwich that will change your day-after Thanksgiving tradition forever.The ultimate flaw of the next-day turkey sandwich is that the turkey breast that was sliced from your beautiful bird has dried out even more in the fridge. Your mouth is going to be walking through a poultry desert no matter how much mayo you slather on that thing. That’s why you take out the ultimate turkey insurance policy. You roast a bone-in, skin-on turkey breast in addition to whatever else you’re making for Thanksgiving.Wait, turkey breast that’s attached to the bone? But not to the turkey?Yes, precisely. Cooking turkey breast by itself is the perfect move for turkey sandwich obsessives, because it lets you concentrate on cooking the turkey breast to perfection, without worrying about whether or not the dark meat off to the sides has finished cooking. And if you’re unfamiliar with the cut, have no fear, because a bone-in, skin-on turkey breast isn’t hard to find at your grocery store, especially around the holidays.We like the breast to have the skin on and the bone attached, because it offers a bit of insulation for the meat, giving you a juicer, more tender turkey when you roast it. (You can definitely fry or grill the breast, but the evenly distributed heat of an oven will cook your turkey more gently—especially when you follow our method right here.) They also offer the meat an extra dose of flavor as it cooks, since they’re filled with fat, proteins, and collagen.Always cut against the grain!\nPHOTO BY MICHAEL GRAYDON + NIKOLE HERRIOTT, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIAnd while we’re on the subject of flavor, you should absolutely be seasoning your turkey breast  with a dry-brine. A dry-brine will deliver flavor quickly and efficiently, while taking up less space than the large, turkey-sized tub of wet brine that would be sitting in your fridge. We’re really into the dry-brine from this dry-rubbed turkey breast recipe, which is packed with coriander, fennel, kosher salt, brown sugar, and black pepper. Plus, all that salt helps break down the tough turkey fibers a bit, again helping keep everything nice and moist.Having an untouched, perfectly-cooked breast makes slicing up meat for a turkey club the next day effortless. But it also offers a couple other options: You can serve it the night of Thanksgiving as the star of your platter—or as backup, should the breast on your main turkey end up dry. Roasting a skin-on, bone-in breast is also a great move if you’re only cooking for a couple people, or have never roasted a turkey before. It’s a more approachable, less intimidating way to get that bird on the table.Yeah, maybe the idea of roasting an extra turkey breast seems gratuitous. But this is Thanksgiving. It comes once a year, and you better be bringing your A-game. The turkey breast is insurance that you will. Do it for yourself. Do it for your guests. But also, more importantly, do it for the sandwich.Get the recipe:Dry-Rubbed Turkey BreastWorried you won't have enough leftovers for next-day sandwiches? Rather not bother with a giant turkey? The bone-in breast is your ticket.View RecipeExplore Bon AppétitThanksgivingTurkeySandwichLeftoversRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Alex Delany"]}