{"id": "641c8eea96e70560fdf24e4edf80344d", "url": "https://www.bonappetit.com/story/stenciling-to-decorate-baked-goods", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Stenciling Is My Favorite Way to Decorate Baked Goods | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStenciling Is My Favorite Way to Decorate Baked GoodsIt couldn't be easier, and you don’t need to buy any new baking gear.By Lisa RulandOctober 13, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Until I became a pastry chef, I associated stencils with quaint country inns and old-fashioned arts and crafts projects. But they can be used for so much more than retro wall decor. If you’ve got a good stencil and a powdery ingredient—think powdered sugar or cocoa powder—then you’ve got a chic and effortless way to decorate a cake, cookies, tarts, or even the plate your dessert is served on. Best of all? You don’t need any equipment beyond what you already have in your kitchen. To embark on this aesthetic journey, all you need are two things: something to use as a stencil and an ingredient you want to decorate your baked goods with.What can you use as a stencil?Any lightweight object that can cover part of a cookie or cake can be a stencil. Fancy “official” cake and cookie stencils can create intricate pro-level designs. But several basic kitchen items stand out as my favorite ways to make simple homemade cake and cookie stencils.A sheet of parchment paper ranks at the top of the list, with many ways to get creative. Lightly drape a square of parchment over any portion of your cake top. Dust the negative space not covered by the parchment with a topping like powdered sugars and lift the stencil from the cake. Play around with angles for a modern, minimalist design.For more involved stencil action, get scissor happy. Cut parchment into strips of any thickness. Arrange the strips on the top of your baked good in lines, angles, crisscross patterns, or a combination. Top with your stenciling ingredient.You can also cut paper into stencil shapes: hearts for Valentine’s Day, little stars just because, and so on. Tear parchment into narrow, uneven strips and arrange the strips closely together for zebra lines.Beyond the world of paper, fresh leaves (clean, of course) make beautiful negative-space stencils for fall. An old-fashioned paper doily can be used as an instant intricate stencil, and kitchen tools like a fish spatula can be employed to create modern lines.Photo by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksWhat can you decorate with?Once you’ve determined what kind of design scheme you’re after, you need to decide what ingredient you’re going to use to create it. Keep two considerations in mind when deciding on your stenciling ingredient: Will it look good, and will the flavor complement the dessert?Some of my go-to dry ingredients for stencil-decorating the surface of a cake, tart, or cookie include the always-classic powdered sugar, different colored sanding sugars, cocoa powder, and matcha powder. (And, honestly, rainbow sprinkles are always a good decision.)Blue Butterfly Pea Coloring Powder$19 at AmazonIf you want to get a bit more involved, and the flavors work, blitz freeze-dried fruits like strawberries in a blender until they’re ground to dust. The resulting powder will have a gorgeous natural hue and a bright, tart flavor.Freeze Dried Strawberries (3-Pack)$15 at AmazonHere’s how to stencil like a pro.Use a light touch. Unless you are going for a stucco look, make sure your stencil rests very lightly on top of your cake frosting, otherwise it will leave a distinct impression. You can even chill the frosted cake for a few minutes to stiffen the frosting before stenciling, which will prevent the stencil from sinking or making a deep indentation.Make sure the flavors work. Dutch cocoa powder has a beautiful, rich brown color, but the flavor may clash with your lemon tart. (On the other hand, freeze-dried strawberry powder and powdered sugar would be amazing.) While the appearance of your finished creation is important, it has to taste good first and foremost.Remove the stencil carefully. You don’t want to spill cocoa powder onto your carefully-stenciled vanilla buttercream. Gently lift the stencils straight up and off the surface. Peeling a stencil off will tip the stencil and pour whatever excess ingredient is on top of it right onto your baked good.Play around, get creative, and experiment first. If you’re curious, or don’t want to commit a pattern onto your cake or cookies right away, stencil patterns onto a countertop or piece of parchment as practice first.Go forth and stencil!The beauty of this decorating technique is just how easy it is. Stenciling is so much simpler and more straightforward than piping elaborate shapes of frosting, and can be used to gussy up everything from a complex layer cake to the most beginner-friendly sheet cake. (Honestly, you could decorate a store-bought cake slathered with baking-aisle frosting this way and everyone would want to snap a picture.) Just don’t get upset if all of your friends suddenly start asking you to make their birthday cakes.This seems like a good candidate…Easiest Chocolate Birthday CakePure homemade birthday love. If you've got a bowl, a cheap hand mixer, and a couple of measuring cups, you can make this rich, chocolatey cake.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-13", "author": ["Condé Nast", "Lisa Ruland"]}