{"id": "6424671f6b241bf017677ff0bf8fd23a", "url": "https://www.bonappetit.com/story/crispy-glazed-brussels-sprouts-recipe", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "How to Make Crispy Brussels Sprouts in the Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Glazed Brussels Sprouts You’ll Be Making All FallA new recipe + tips for how to make the crispiest possible brussels sprouts in the oven.By Alex BeggsSeptember 25, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailToo many times! Have I been plagued with soft, unsatisfying roasted brussels sprouts. I try to crank up the heat, coat them with oil and salt, and keep a close eye. But somehow they’re never as good as when restaurants do it. I want crispy edges and a slight crunch, and a slightly sweet caramelized flavor on these mini cabbage heads. But how??? HOW?!!!!!When Molly Baz was working on this new recipe for roasted brussels sprouts with a warm honey glaze, there was a debate in the office about the ideal texture of a roasted sprout. It turns out some people want the BS so crispy they’re no longer soft—at all—while some like a crispy exterior and tender interior. That’s determined by cook time (go close to 35-40 minutes for full crisp). The crispy exterior, however, is achieved by preheating the sheet pan itself in a 450° oven. You’re essentially treating the baking sheet like a sauté pan, searing an entire side of the brussels sprouts. Without preheating the pan, they’d overcook before they got to the ideal crispy state.That’s pretty much it, honestly. You cut the sprouts in half, toss in olive oil, salt and pepper, and then arrange them cut-side-down on the hot-hot sheet. Use tongs! Move fast. Then they’ll roast for 20-25 minutes, until deeply browned. They’ll be seared on one side, and fully cooked within in that time. But if you’re in senior food editor Chris Morocco’s camp, you might want them to lose all moisture and become completely crunchified, which might take 10-20 more minutes. “Learn your brussels sprout,” Molly advised, looking deeply into my eyes.But we’re not done yet. What seals the deal with this recipe is the warm honey glaze. While the brussels sprouts (or “brussies” if you’re Molly) roast, heat up honey in a saucepan for around 5 minutes, and then doctor it up with sherry vinegar, red pepper flakes, and butter. It thickens to the consistency of maple syrup at which point you toss it with the brussels sprouts, sliced scallions, and lemon zest. The sweet-spicy-acidic glaze is good on any cruciferous vegetable, noted Molly, like cauliflower, but not so much on already sweet veg like carrots or parsnips.This is the kind of recipe that’s your go-to side all season long. It just goes with everything. Like, dare I say, Thanksgiving turkey. Or a big leg of lamb. Or a bowl of pasta. A weeknight grilled cheese. At some point I have to end that list, and the time is now.Get the recipe:Roasted Brussels Sprouts With Warm Honey GlazeRoasty toasty brussels soak up this delicious honey sauce, creating a combo you just can’t beat.View RecipeExplore Bon Appétitbrussels sproutSideRoasted VegetablesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Alex Beggs"]}