{"id": "6428d85589d8d7f405c451936f923c55", "url": "https://www.bonappetit.com/story/homemade-kaju-katli", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "I Never Thought to Make My Own Kaju Katli Until I Was Stuck at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Never Thought to Make My Own Kaju Katli Until I Was Stuck at HomeYou probably already have the essential ingredients for this South Asian confection.By Priya KrishnaNovember 6, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by Rebecca JurkevichFacebookTwitterEmailI rarely make ambitious desserts. I don’t have the patience or the knowhow on the particulars of whipping egg whites or browning butter. But when the pandemic hit, I found myself living with my parents in Texas, searching for activities to occupy my time during lockdown. I didn’t want to do anything too ambitious—maybe a two-layered chocolate cake or a latticed apple pie. Any dessert that would even mildly stimulate my brain and help pass the many hours at home. But our house in Dallas is noticeably lacking in baking staples like flour, butter, and eggs. “Why not kaju katli?” my mom suggested one day.I had never thought to make kaju katli, also known as kaju ki burfi, by hand. I’m used to buying the fudgy, cashew-based, and diamond-shaped variety of South Asian confection by the dozen at my local mithai shop. In the realm of mithai, a dizzying category of South Asian sweets that encompasses all different regions, flavors, colors, and textures, kaju katli is among the more simple. The only essential ingredients are cashews and sugar. But this seemingly straightforward combination yields a luxurious texture—dense yet delicate, like biting into a freshly made caramel—and a rich taste.When I was young, my family would make regular trips to India to see family. My mom’s cousin lives in Delhi, near one of the more famous mithai shops in the city, Evergreen. Every few days, I would accompany my aunt to Evergreen. There was always a man frying spirals of jalebi outside the shop, and inside, kalakand, or milk cake, was showered with verdant pistachios. But I came for one thing: kaju katli.I’d buy a box to eat that day, one for friends, and yet another to freeze when I got home. So well-known is my love for kaju katli that anytime a friend or a family member visits Delhi, I don’t even have to put in a request for my box of Evergreen sweets. It’s automatic. Mithai is meant for celebrations—everything from a good score on a test to Diwali—but I like to consider kaju katli as more of an everyday snack.So when my mom found a few 40-year-old sheets of edible silver, the topping used to adorn the sweet, it felt like fate. Kaju katli has always been one of those desserts that we usually outsource to mithai shops rather than bother with making at home. But as it turns out, while kaju katli is an ambitious-looking dessert, it’s very doable, and you may even have most of the ingredients in your pantry right now.The process for making kaju katli isn’t super complicated, but it does require some patience and precision. First, you have to grind cashews into a fine powder. A food processor will get the job done (it may require a few rounds of pulsing), but as the many aunties I consulted for this recipe told me, a coffee grinder is even better, as it has settings for a really fine grind. But grind your cashews too long, and they’ll turn into nut butter. Grind your cashews too coarsely, and you won’t get that fudgy texture.From there, the cashew powder is heated with simple syrup, plus ghee and cardamom for flavor, until it forms a thick dough. The dough is then kneaded while hot—not the most pleasant experience, but thankfully a short one—and then rolled to a half-inch thickness. And mind you: This all has to happen quickly, otherwise the dough will harden.The final step is the most satisfying: laying the edible silver over the top and cutting the dough into diamonds. When I made kaju katli at home for the first time, we didn’t have enough edible silver to cover all the dough, but I loved the way some of the diamonds bore ombre-esque areas from where the silver didn’t cover them, like some kind of ancient fresco.Many varieties of mithai demand being eaten the day of or soon after—otherwise, they start to lose their signature texture. Kaju katli, on the other hand, can be stored in the freezer for at least a month. I love eating one straight from the ice box, its chilly exterior giving way to a soft bite. I made a batch about a week ago that’s sitting in the freezer for Diwali. It’s taken all my willpower not to eat them prematurely, but even if I do, at least I don’t have to rely on cousins bringing boxes of sweets back from India. I can just make another batch myself.Kaju KatliThis five-ingredient sweet is Priya Krishna’s all-time favorite, and it’s as good for a Wednesday-afternoon snack (keep some in your freezer!) as it is for a Diwali celebration.View RecipeExplore Bon AppétitDiwaliDessertIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-06", "author": ["Condé Nast", "Priya Krishna"]}