{"id": "643034c2263185c38329a3afedfd251a", "url": "https://www.bonappetit.com/story/crispy-tofu-crumbles", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Vegetarian Cooking Can Feel Hard, But This Crispy Tofu Is Easy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingVegetarian Cooking Can Feel Hard, But This Crispy Tofu Is EasyI felt like Goldilocks trying to find the perfect tofu recipe, but this one is juuuuuust right.By Carla Lalli MusicFebruary 27, 2020FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery other Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.There are a lot of things I love about my 10-year-old son, but the fact that he’s newly vegetarian isn’t at the top of the list. I know—that sounds super harsh! After all, the guy wants to help save the planet and loves animals, and here I am complaining about it. Truth is, his commitment to a plant-based diet is inspiring to me, but it definitely makes dinnertime complicated. I know it’s important that he get enough protein—both because he’s growing and because it will help him feel satiated for longer stretches of time—and overnight, he eliminated 80 percent of our protein sources. There are only so many ways to cook chickpeas, edamame, and eggs, which I’ve leaned hard on, and when he gets sick of them, it’s game over.Then, of course, there’s tofu. For an eater who has always been—let’s say—selective about his likes and dislikes, the vegetarian’s delight hasn’t been too delightful. We tried soft tofu in brothy soups: “Too mushy.” We tried blending it into creamy dressings, but who’s going to eat a bowl of dressing for dinner? I tried breading it—didn’t work. I tried glazing it: “Too slippery.”What I needed was a way to cook tofu that gave it actual crunch without having to dredge it in rice flour or deep fry it in several inches of hot fat. That’s when the method for these tofu crumbles came into our lives. The technique couldn’t be easier, and will feel intuitive for anyone who has pan-roasted a chicken thigh. Hot pan, slick of oil, add protein, cook until crisp. The secret, though, happens before the tofu ever hits the skillet.Want this letter before it hits the website? Sign up for our newsletter!On their way to crispy town.\nPhoto by Chelsie CraigYou need to start with extra-firm tofu, which holds its shape under high-heat conditions, and it must be pressed to expel excess liquid first. The original recipe says to slice the tofu, sandwich it between layers of paper towels, and press with your hands to achieve this. At home, I’ve gotten a little more aggressive: I place the sliced tofu on a rimmed baking sheet that’s been lined with a clean kitchen towel. I fold the towel over the tofu, then put another baking sheet on top of that, and weigh it down with something heavy—a bottle of olive oil or big can of tomatoes work well. Then I prep the rest of the meal while the tofu is being squozen, usually about 10–15 minutes.When it’s fry time, I tear the tofu into raggedy 2- to 3-inch pieces, so their edges will have more exposed bits to get crunchy, similar to how hand-torn torn croutons have more texture opportunities. Drizzle some neutral oil into a cast-iron pan over medium-high heat, then cook the tofu, undisturbed, until browned on the underside and they release cleanly from the pan when you wedge a metal spatula underneath. Turn and repeat on second side. Once the tofu comes out of the pan, season it with salt right away. I serve it like any other simply prepared piece of protein, with a little hot sauce and soy sauce to dip it into, maybe—but it doesn’t have to be more complicated than that. The unadorned flavor of packaged tofu may be subtle, but these crumbles are as crunchy and addictive as popcorn shrimp, and there’s no trawling involved.Get the recipe:Spicy Tofu CrumblesTry this versatile protein-packed side/condiment/snack tossed into stir-fries, as a burrito filling, or folded into sautéed greens.View RecipeExplore Bon AppétitCarla NewsletterTofuVegetarianWeeknightRead MorecookingIf Tofu Scramble Can Fuel My CrossFit Workouts, It Can Keep You Satisfied Until Lunch By Lukas VolgercookingTofu That’s Crispy and Glazed All at the Same TimeBy Adam RapoportcookingI Have This Tofu-Kimchi Soup Recipe MemorizedBy Sasha LevinecookingI’ve Always Liked Tofu, But This Recipe Made Me Love ItBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-27", "author": ["Condé Nast", "Carla Lalli Music"]}