{"id": "64335e78996e0846ce0cb4e1cf9e05a5", "url": "https://www.bonappetit.com/story/wine-shop-growing-up", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "How Drinking Wine Helped Me Make Peace With My 30s | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Wine Shop Helped Me Make Peace With My AgeI was always worried that, the older I got, the less interesting I would become.By Liz RiggsDecember 2, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAn hour before the dinner party, my husband drives across town in the pouring rain to pick up fried chicken. It’s Nashville, so he must have passed 16 other fried chicken spots on the way, but this is the best. The OG. No bones, no spice, no online lists causing tourists to pour through the doors. Just greasy, crispy chicken fingers with a bunch of sauces same as they were ten years ago when I was 23, lived across town, and my best friend was picking up the food, not my husband.While he’s gone, I get things ready. A poorly attempted salad, yogurt sauce, and basically nothing else. Cozy-chaotic is usually the vibe in my house—enough details to make it feel thoughtful but not so much that it feels formal. I set my parents’ hand-me-down plates on the table that my brother-in-law built for us when we got married five years ago. I move a small cart into the living room (where we are quickly running out of space) and line the wine bottles up on butcher paper. And then I attempt to write tasting notes on labels in permanent marker, as if other people will care about the regions and grapes and producers as much as I do.Caring about wine is new for me. My interest (obsession?) has a lot to do with proximity to my local wine shop. And perhaps even more to do with being in my 30s. A decade ago I measured my life—my coolness, my relevance—by the cocktails I’d tried and the restaurants I’d visited and the musicians I kissed. Now I prefer dinner parties to bar dancing and quiet nights to bleary mornings. Deeper friendships to loose acquaintances.The morning before the party, I went to the wine shop, Woodland Wine Merchant. I told them the dinner plan—a dozen or so friends, no particular occasion. Just an excuse to get together and an even better excuse for me not to leave my house on a Friday night. And the main attraction: chicken fingers. They recommended a few bottles—a buzzy Bugey-Cerdon, a sparkling rosé from a small region somewhere between Switzerland and France. It’s slightly sweet, low-alcohol, and effervescent. I picked up a magnum of Reignié Beaujolais, because I can’t not. Its light-bodied unfussiness is always invited, as is a magnum bottle.The party is perfect. There are comments on the wine but mostly it is drunk. The rain comes down and people shift from the table to the couches and we eat a cheesecake from Trader Joes for dessert. Our fingers are greasy and everybody is just drunk enough, the kind where you can still get up and take on a Saturday, because we are in our thirties and we have things to do.When I first moved to the city from Ohio, straight out of college, I was obsessed with being out. After long weeks as a high school English teacher, lesson planning and debriefing my always-hard day with my best friend and roommate, I wanted to be seen. I drank lots of local pale ales and gin and tonics. I ran myself ragged as if to prove I could never be boring; my life wasn’t boring. And it wasn’t. In hindsight, I was worried that, the older I got, the less interesting I would become.I was also drowning in the existential crises of any twentysomething—that whole what the hell am I doing with my life? thing. Being in crowds with cheap drinks and loud conversations and vaguely familiar faces made it easier to exist in my own head. I didn’t want to be alone with my thoughts, and I didn’t want to go home to my room, where the quiet felt suffocating.If my twenties were about spinning my wheels until I couldn’t anymore; running around trying to find myself in the mess, my thirties are about settling into what I’ve found.Maybe it started when I met my husband or maybe when I got a therapist or maybe it was when I got into graduate school that the focus of my life began to shift. I started to stay in more. My world expanded while the scope of my daily activities contracted—my desire to be out dwindled, and my anxiety did too.I knew a little bit about wine in my twenties, but my consumption was mostly limited to Two-Buck Chucks and random bottles of rosé from Provence, where I’d studied abroad. Occasionally, when I was feeling particularly classy, I’d seek out Beaujolais, which I’d learned about during a Wine Tasting class in college.Then, in 2014, my husband and I bought a small house in East Nashville and adopted a grumpy old dog. Planted a garden and invested in a velvet couch that I could write a whole separate essay about. I was finally—and more formally—pursuing writing. I started to find myself aching to be home. Why go out for a syrupy gin and tonic when there’s a chilled red in the fridge? We settled into our house and our neighborhood. And down the street, in an old post office on the corner of 10th Street, in the heart of East Nashville, was the wine store called Woodland where we went to stock our new, we-own-a-house bar.Nashville is constantly changing. New, shiny bars catering to bachelorette parties and honky tonkers open up on what feels like a weekly basis. Amidst this shifting landscape, Woodland has been an anchor. It’s been in the neighborhood longer than I have. And it, like me, seems to have dug in its heels and withstood all the changes.I like to visit Woodland in the morning, when the shop is quiet. The staff is usually stocking, sliding bottles into shelves that line the small aisles. Each wine is accompanied by a hand-crafted card with succinct and insightful notes—the elevation of the vineyards or the process of fermentation; specific, helpful descriptors, like “red fruit” to compliment the nerdier wine notes about expression and structure. The bottles range from $10 to the low hundreds, but much of the store is in the $15 to $45 range. It’s the kind of shop that has fresh bread from local restaurants on weekends, artisan glassware, and fancy dark chocolate. It’s a special place. While the staff stocks the shelves, I often find myself staring at the wall of bubbles, reading descriptions of regions and producers I’ve never heard of. I get carried away like I do when I’m reading a novel, or—at my best—when I’m writing.Recently I’d brought Will, the owner, a blurry picture of a menu from a restaurant I’d been to in New York. I’d gone to a cozy place in Brooklyn and had a nearly-perfect evening out with some friends from graduate school. The wine I had was chilled, light and refreshing but still earthy and savory in surprising ways. Will knew the wine, Elisabetta Foradori’s Lezèr, and in fact, he had just put in an order. The next time I visited his shop, my chance-encounter wine was already on its way to Tennessee.One Saturday afternoon, not long after I had inquired about the Elisabetta Foradori Lezèr, my husband and I head to the shop on our usual weekend stroll. On Saturdays Woodland does small tastings, which means we will likely run into someone from the neighborhood. Today it’s my best friend and former roommate, Caitlin, and her dad, and another friend named Ryan. I give Caitlin a hug. We recommend the Lezèr and Ryan buys a bottle, too.There is something about Woodland—and the interest and taste it has fueled—that makes me feel like a grown up in a way that I never imagined a grown up could be. There is a magic to it. A magic to having a wine called into my local shop from the foothills of Italy after trying it in New York. A magic to running into my closest friends in the same city, ten years later, and having new friends I never expected to make.We’re all old enough to know exactly how that kind of night ends and how the morning after begins.Caitlin and her dad head home to prepare dinner, and Ryan comes with us. We end up sitting on our stoop. It’s night now and the temperature is one we get so rarely in Tennessee—dry and mild with a breeze. We open the bottle of Lezèr. There is no mention of going to some new bar. No one is dragging us down to Broadway to drink shots of Fireball. We’re all old enough to know exactly how that kind of night ends and how the morning after begins. Instead we eat some Aldi sharp cheddar and feel fancy as fuck, though the wine was only $24 and the cheese comes from a store that makes you put down a deposit for a cart.If my twenties were about spinning my wheels until I couldn’t anymore; running around trying to find myself in the mess, my thirties are about settling into what I’ve found. What I get at the wine shop is a reminder of the life I’ve built, the life I like. It’s another reason to stay home on a Saturday with my husband and my dog, to invite a dozen friends over because I don’t want to see anybody else. I’m not exactly where I thought I’d be, but I like where I am—and that is something to celebrate, with a glass of chilled red and a bed time before 12:30 a.m.Explore Bon AppétitHealthyishWinenatural wineLifestyleRead MorecultureYou're Not Going to Believe I'm Saying This, But Merlot Is BackBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-02", "author": ["Condé Nast", "Liz Riggs"]}