{"id": "6441dfc75f4984fbc580c555e6b2f9e5", "url": "https://www.bonappetit.com/story/thanksgiving-menu-peter-som", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Peter Som’s Ultimate Thanksgiving Menu Is a Chinese American Feast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePeter Som’s Ultimate Thanksgiving Menu Is a Chinese American FeastThis year the fashion designer and recipe developer is going all in.By Peter SomOctober 25, 2021FacebookTwitterEmailPhoto by Jenny Huang, Food Styling by Susie Theodorou, Prop Styling by Martha BernabeFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you don’t count last year, I’ve always hosted Thanksgiving at my place in the West Village. It’s one of my most favorite holidays. I love renting long tables and arranging flowers, squeezing 25 people into my apartment, and cooking everything from scratch. It’s very come one, come all.That’s just how it was in my family, growing up in San Francisco. We’d have anyone who was free over: assorted aunties and uncles, a few neighbors, oftentimes a family friend’s son or daughter in the states for college. I’m Chinese American, so our Thanksgiving menu was always a mash-up of those cultures. We had the turkey, the sweet potatoes with marshmallows on top, and then steamed gai lai or bok choy and my grandmother’s no mai fan—sticky rice studded with lap cheong. It was so focused on what, to me, cooking is all about: bringing people together.Photograph by Jenny HuangLast Thanksgiving I celebrated with just my boyfriend and two friends, our little pod. Since we were in the middle of the pandemic we thought, let’s make what we adore. I cooked char siu, which is a Chinese barbecue pork that’s sweet, sticky, tender, and delicious, and my version of no mai fan. This year I’m keeping that ethos but doing things a little differently: I’m going all in. I’m making char siu but rolling it up with shiitake duxelles and turning it into Wellington. I’m indulging in the vegetables, with a sweet potato tian speckled with five-spice, roasted brussels sprouts tossed in a flavor bomb of gochujang and brown butter, and a super crunchy Asian pear and shaved cauliflower salad. The no mai fan is a must, and to finish I’ve got a bread pudding with a milk-tea-sweetened custard as a nod to my family’s Hong Kong history. Adding boba to milk tea is de rigueur these days, but I thought in this case it might be gilding the lily too much.No matter how topsy-turvy the world can feel in these times, this is one Thanksgiving menu that makes me smile.The RecipesChar Siu WellingtonThis showstopping centerpiece combines the flavors of very Cantonese sticky-sweet char siu pork with those of very British beef Wellington.View RecipeAsian Pear Salad With Peanut-Lime DressingThis sweet-tart salad gets its satisfying crisp-crunchy texture from floral Asian pears and nutty raw cauliflower.View RecipeDutch Oven No Mai FanThis one-pot wonder of sticky rice studded with sweet and savory lap cheong, umami-packed shiitakes, and other savory bits is the cozy meal your weeknight cooking repertoire needs. View RecipeSweet Potato TianThin rounds baked until tender and crispy-edged in a warming five-spice brown butter sauce might just be our new favorite way to serve sweet potatoes.View RecipeRoasted Brussels Sprouts With Gochujang Brown ButterCrispy Brussels sprouts + sweet-spicy gochujang + nutty brown butter = the side dish you can’t say no to.View RecipeMilk Tea Bread Pudding With Crème AnglaiseSweet, bitter, creamy, and so, so good, milk tea makes for an irresistible base for this bread pudding.View RecipeThe PantryKam Yen Jan Chinese Style SausageThis Cantonese cured pork sausage has a distinctive sweet and savory flavor. For me it’s a must-have in fried rice and no mai fan, but I like to toss it into braises and anything else that needs an extra bump of flavor.\n$29 at Amazon (3-Pack)$6 at YamiLee Kum Kee Premium Dark Soy SauceDark soy is thicker—and yes, darker—than the usual light soy sauce with which most of us are familiar. It’s slightly sweet and adds a lovely amber color to anything you add it to like noodles, rice, and chicken.\n$15 at Amazon (2-Pack)$3 at Umami CartKoda Farms Premium Sweet RiceAlso known as sticky rice or glutinous rice, this round-grain rice becomes sticky when cooked and it’s used widely in Chinese cooking (and many other Asian cuisines too). I grew up eating it in my grandmother’s no mai fan, but it’s also great for Thai-inspired coconut sticky rice with mango.\n$22 at Amazon (5 lbs)Mother-In-Law's GochujangI didn’t grow up with gochujang, but now I always reach for the Korean fermented chile paste when I’m looking for a hit of complex heat. I love it mixed with honey for barbecue sauce, Kewpie mayo for a quick dipping sauce, or combined with browned butter for roasted vegetables.\n$13 at Amazon$12 at Snuk Foods Lee Kum Kee Hoisin SauceA base of fermented soybean paste gives this rich sauce an umami punch. Hoisin is widely used as a dipping sauce or a glaze, but I also like tossing it with butter and pasta for a quick dinner.\n$6 at AmazonThe TableCourtesy of Lost QuarryLost Quarry Ribbed PlatesMy friend Doris [Josovitz] started this ceramics company a few years ago. I love the feel and the nuanced finish to her pieces.\n$35 at Lost Quarry$36 at Mohawk General StoreCourtesy of Bowen Liu StudioBowen Liu Saddle Cutting & Serving BoardThere is no chicer way to serve charcuterie than on these boards. They are crisp and graphic.\n$265 at Bowen Liu$265 at 1stDibsCourtesy of Loyale StudioLoyale Grey Stripe Linen NapkinI like these napkins for many reasons—they’re made from beautiful Japanese cotton and can be used as napkins or kitchen towels—but the main two are because they’re from an AAPI women-owned company and they’re made in my hometown, San Francisco.\n$24 at LoyaleCourtesy of Nude GlassNude Jour Red Wine GlassesThese wine glasses add a touch of elegant whimsy to the dining table. They’re always a conversation starter.\n$75 at Food52 (Set of 2)Photography by Mischelle MoyWing on Wo & Co. Dragon BowlThese bowls work for anything, from no mai fan to cereal, and the tonal dragon motif goes with any table setting. Also Wing on Wo & Co. has been a fixture in NYC’s Chinatown since 1890!\n$25 at Wing On Wo & Co.Explore Bon AppétitRecipeCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-25", "author": ["Condé Nast", "Peter Som"]}