{"id": "6447257ed477bd5df0168d0406ae692b", "url": "https://www.bonappetit.com/story/pancake-social-atlanta-waffle", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Why I’m Ordering Waffles at a Place Called Pancake Social | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhy I’m Ordering Waffles at a Place Called Pancake SocialHint: They’re hot, toasty, savory…and steeped in Atlanta dining history.By Hilary CadiganAugust 13, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are seven types of pancakes on the menu at Atlanta’s Pancake Social. All of them are delicious, but I’m telling you to order the waffles. These are not just any waffles. They’re savory sourdough waffles, born from a 27-year-old starter that the city’s crowned Queen of Fine Dining, Anne Quatrano, created at her first restaurant, Bacchanalia.Back then, starters were made by coaxing the yeast off the skin of organic grapes (yeah, for real), so you know this thing is no joke. It’s traveled with Quatrano through more than half a dozen restaurants—not to mention Bacchanalia’s multiple relocations—and spawned countless boules. (It’s even spent holidays and closures at various staffers’ homes, so someone could look after it.)The waffle recipe that makes this starter sing dates back to 1998, when Quatrano and her husband Clifford Harrison opened Floataway Cafe, a bright little French-Italian bistro inside an old warehouse. It came off the menu three years later when Floataway’s brunch got 86’ed (nobody likes working brunch), but Quatrano says loyal customers from the old days light up when they order Pancake Social’s iteration: a crisp, slightly tangy delight served hot and hissing under a splotch of melty butter. Pair it with eggs to stay savory or apply the requisite maple syrup bath for a hits-the-spot study in sweet-toasty contrast.Long live the Queen.Go there: Pancake SocialExplore Bon AppétitHighly RecommendAtlantaRestaurantsRead MorerestaurantsI Hate Brunch, But I Love Root Baking Co.By Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Hilary Cadigan"]}