{"id": "644efadfa15b33b35c9360f5b2121722", "url": "https://www.bonappetit.com/recipe/marinated-olives-and-feta", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Marinated Olives and Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueMarinated Olives and FetaBy Claire SaffitzJanuary 18, 20184.7(57)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintThis appetizer is so fast and easy, you can have it on the table within 10 minutes of walking in the door.  Save any leftover oil, which has been flavored with the red pepper flakes and garlic, for another use like salad dressing.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSieve$18 At AmazonCutting Board$10 At IKEAVegetable Peeler$10 At AmazonSmall Saucepan$155 At AmazonShallow Serving Bowl$26.99 At AmazonIngredients2 servings4ounces drained Castelvetrano, Cerignola, or other unpitted green olives3garlic cloves1lemon½cup extra-virgin olive oil½teaspoon crushed red pepper flakes3ounces fetaCrusty bread (for serving)PreparationStep 1Preheat oven to 400°. Drain 4 oz. olives and place on a cutting board. Lightly smash with the heel of your hand just to break apart skin and flatten slightly.Step 2Smash 3 garlic cloves and peel.Step 3Using a vegetable peeler, remove peel from 1 lemon in long wide strips.Step 4Cook lemon peel, olives, garlic, ½ cup oil, and ½ tsp. red pepper in a small saucepan over medium-low heat, swirling occasionally, until garlic is sizzling and golden around the edges, 5–7 minutes.Step 5Meanwhile, crumble 3 oz. feta into a shallow serving bowl.Step 6Pour oil mixture over feta. Let sit at least 10 minutes and up to 1 hour.Step 7Meanwhile, tear bread into large pieces and place in oven directly on rack. Bake until craggy edges are golden, 5–8 minutes. Serve with marinated feta and olives for dipping.How would you rate Marinated Olives and Feta?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleA tasty appetizer and super easy to make! I've made this twice and I'll be making it again, just with some modifications to my taste: omitted the lemon peels and squeezed fresh lemon juice over the entire dish at the end (the peels imparted a bitterness I didn't like, whereas the juice adds fresh acidity); doubled the garlic; and added freshly ground black pepper and chopped roasted cashews at the end. No need for flaky sea salt thanks to salinity from the olives and feta. A tip for crushing and de-pitting Castelvetrano olives: use a pestle, it's less messy (and painful lol) than using your hand.MollyPortland, OR12/22/2021This is such an easy and delicious appetizer! A friend made it last night and added a small spoon to the serving dish and our guests scooped it on crostini’s. I’m making it again today! Carrie McCarthyLA, CA9/18/2021Absolutely delicious and super easy.  Watching the video was really helpful for the flow of how to do work smoothly.  I like the layout of the video.Patricia MillsBrooklyn, NY6/1/2021I made the recipe once and loved it.  \nI am wondering if I can make this a day a head.  What do you all think?Natalie LAnn Arbor, MI4/21/2021Those olives appear to be pitted.AnonymousLouisville, KY2/8/2021This looks delicious and I'm looking forward to making it. It would be helpful if the hands in the videos would actually demonstrate the proper way to serve one's self this app. Do you use a toothpick to snag an olive and a chunk of feta? Obviously you would want to soak the bread with some of the yummy oil but do you try to scoop an olive up with a piece of the bread? How do you do that without everyone getting their fingers in the oil? Just wondering...........\nDianeMurrells Inlet, South Carolina2/1/2021Love this recipe, made it many times.  I may try heating the ingredients in a microwave, want to see if that would work if I brought everything to a guests home. SteveCorona Del Mar, CA11/29/2020fantastic app for castelvetrano olives which we\nabsolutely love.  please share the brand of olives that you especially like; they vary a lot!\nthanks for the great recipe!\n😬\n\nsassygirl711chicago5/28/2020Wow...love this and the story that went with it. I am always needing something quick to bring to Gatherings....since I work as a teacher of students with visual impairments. I don't arrive home at 5..so this is a perfect recipe. Thank you. Love your site. MASTexasTexas 3/28/2020I have served this quick and delicious appetizer 3 times and my friends have asked for the recipe every time.AnonymousSan Francisco3/17/2020How often can I say \"Yummy!!!\" in one post?  I love this stuff!  My husband isn't a big fan of feta, so I often make it with buffalo mozzarella.  It's great, too!r2swangerTennessee12/27/2019I love this recipe - fast, easy, and delicious.  You missed the boat on your 32 Hanukkah Recipes by not including this.  It's perfect for Hanukkah - lots and lots of olive oil.  It's a shoo-in.Pesha27Philadelphia12/23/2019 Anonymous12/10/2019This takes so little time to prepare and wins rave reviews every time I serve it! I've learned to double it because the recipe as written never goes far enough. I use Castelvetrano olives. I cook them with the pits intact but remove them after the olives cool to avoid jeopardizing my guests' teeth. After three repetitions making this recipe, I decided to count the olives so I know how many pits I should have! I do let the mixture cool before pouring it ver the feta. I've had no issue with the appearance (i.e. the user who reference 'oily curdled milk'). I will make this over and over!\nJean HerremanHilton Head, South Carolina5/30/2019Pouring hot oil all over the cheese makes for a presentation that looks like oily curdled milk. If they had written better directions and relied less on cutesy gifs it could have been betterJamey LTX3/16/2019Explore Bon AppétitGreekEuropeanFetaCheeseCastelvetrano OliveOliveOther IngredientsQuickEasySnackStarterGluten-FreeNut-FreeVegetarianKetoEasterDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Claire Saffitz"]}