{"id": "645775801f082cef436c6dee3e4e23b3", "url": "https://www.bonappetit.com/recipe/instant-pot-tomato-soup", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Instant Pot Tomato Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInstant Pot Tomato SoupBy Carla Lalli MusicMarch 1, 20194.7(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintA straight-down-the-middle, simple, nostalgic-tasting tomato soup with long-cooked flavor, thanks to a generous amount of aromatics and a short but intense cook time under pressure. This is pretty delicious on its own but would be an ideal teammate for a great grilled cheese sandwich.Ingredients6 servings¼cup extra-virgin olive oil2medium onions, thinly sliced1medium fennel bulb, thinly slicedKosher salt2tsp. smoked paprika1tsp. fennel seeds, lightly crushed¼tsp. cayenne pepper (optional)228-oz. cans whole peeled tomatoesFreshly ground black pepper3Tbsp. unsalted butter1tsp. (or more) sugarHeavy cream, Greek yogurt, or sour cream (for serving; optional)Flaky sea saltSpecial EquipmentAn Instant Pot or other electric pressure cookerPreparationStep 1Heat oil in Instant Pot on the Sauté setting. Add onions and sliced fennel; season with a big pinch of kosher salt. Cook, stirring occasionally, until vegetables start to soften and sweat, about 2 minutes. Add paprika, fennel seeds, and cayenne (if using) and stir to coat vegetables with spices. Set lid on pot askew and continue to cook, stirring occasionally and reducing heat if needed, until vegetables are very soft but have not taken on color, 10–12 minutes. Add tomatoes, crushing them with your hands as you go, then use 1 cup water to rinse out cans and add to pot; season with kosher salt and pepper. Seal lid and cook on high pressure for 12 minutes.Step 2Release pressure manually, then uncover and add butter and 1 tsp. sugar to soup. Using an immersion blender directly in pot, blend until smooth. (Alternatively, allow soup to cool slightly and purée in small batches in a blender.) Taste and season with kosher salt and pepper; if soup tastes tinny or acidic, add more sugar, as needed.Step 3Divide soup among bowls. Serve with a drizzle of cream or a dollop of yogurt or sour cream (if using). Season with sea salt.Step 4Do Ahead: Soup can be made 3 days ahead. Let cool; cover and chill.How would you rate Instant Pot Tomato Soup?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleLove this recipe! Made it last year, such a great pairing with a good grilled cheese. The fennel really gives this recipe the depth to elevate it subtly while keeping the flavor nostalgic. I used a blender in place of an immersion blender which I do not own. Simple recipe to make as well; I've made this multiple times last year and it was a hit; looking at it again this year because I'm thinking of making it again! Def going in my book as one of the reliable recipes. Tony PNew York, NY11/9/2021I love, love, love this recipe, and, even better, so does one of my teenage sons.  He requests it often.  I feel like the fennel and onion being sauteed together really give it a naturally sweet flavor and I haven't had anyone be able to recognize the fennel in it.  So I think non-fennel fans should give it a try if they are hesitating.  I follow the directions precisely and I prefer yellow onions. I use the immersion blender right in the instant pot and it really is a one-pot recipe.   I usually don't add anything creamy when serving but that's just personal preference.  I have served right away or made it ahead and both are good.  This week, I'm going to try freezing and see how it is after a week of being thawed and reheated.  Perfect tomato soup to go with grilled cheese in my opinion.Kate B-GSunnyvale, CA9/7/2021I don’t have an instant pot so if I was just making it on top of the stove how would I adapt the cooking time ? Or could I use my crock pot ?AnonymousWinnipeg8/25/2021can this recipe be used in a slow cooker application?RoseveltWestlake, Ca11/29/2020I just made this delicious soup.  We're having it with grilled cheese on sourdough bread.  As a heads up to the person who melted the lid to the pot, right after I started using my Instant Pot, I bought a glass lid that is sold separately for those times you're not cooking under pressure.  I'll make this soup again and again.Sandy LevyNorth Carolina10/23/2020Absolutely amazing, made it for my family for iftar and they loved it. 10/10 would recommendAnonymous5/2/2020Added 3 grated carrots and 1 red bell pepper. Topped it with parmesan cheese. Delish! AnonymousMontreal, Canada5/1/2020I wasn't really a soup guy but made this for my sick fiance. That has now changed. I crushed a whole loaf of bread making grilled cheeses over the next 3 days. This will be a winter go-to. New Jersey12/2/2019You should NOT set the instant pot lid on pot askew while the vegetables continue to cook. The steam from the pot melted the plastic on the lid and now my instant pot is broken and unusable. So disappointing!AnonymousBoston11/24/2019New favorite tomato soup recipe! I especially appreciate that this soup isn't seasoned like a spaghetti sauce...I hate when tomato soups taste like thin marinara. THIS soup recipe is delicious, and I don't think it needed anything. Try this, you won't be disappointed! AnonymousColorado, Man11/11/2019I loved this!  Not a fan of smoked paprika so I did not use that. I  also did not use the cayenne pepper.  What I did add just before eating this was the Garlic Chile Oil that I made for another recipe from Bon Appetit.  It was an excellent touch.AnonymousHarwich, MA10/19/2019I am a fan of the roasted tomato/red pepper soup from Trader Joe’s since it has more depth than Campbell’s  (I usually add more cayenne and paprika to flavor it up a bit more) and almost didn’t try this recipe bc my expectations were low after perusing the ingredients. I’m really glad I did bc it’s really really good. Ditto to a previous comment about adding roasted red peppers, or even roasted tomatoes—a good modification. I used San Marzano but I think they do roasted whole tomatoes too. \n\nVolume-wise, I got two 32oz take-out containers out of it, plus one more serving when I was done — great for dinner tonight and freezing for later. AnonymousHouston3/29/2019Very good, but there's a strong smoked paprika and fennel flavor, so if you're looking to relive Campbells this isn't the soup for you.AnonymousCalifornia3/18/2019Can’t we make it with pureed tomatoes?PicolabbAnkara, Turkey3/14/2019Making again today - love it.  I'm going to try adding some roasted red peppers for deeper flavor.  AnonymousCary NC3/14/2019Explore Bon AppétitSoupSoups and StewsAmericanCanned TomatoTomatoVegetableStarterMainGluten-FreeNut-FreeVegetarianInstant PotLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Carla Lalli Music"]}