{"id": "645bcbaca4be498a536fb70ae762d35d", "url": "https://www.bonappetit.com/story/best-muffin-pan-oxo", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "The Best Muffin Pan Will Change Your Muffin-Baking Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingFor Better Muffins and Cupcakes, You Need This PanMy cupcake-baking life tooBy Claire SaffitzJanuary 21, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I went in search of the best muffin pan because I couldn’t figure out why the cupcakes and muffins I was baking at home were coming out wonky—not just stuck to the surface of the pan but too dark in some places and pale in others. I thought my oven might be to blame, but after calibrating with an oven thermometer, I seized on the real culprit: It was my bargain-store aluminum pan.One of the easiest (although admittedly not the cheapest) ways to improve your baking at home is to invest in heavy-duty bakeware. For me, switching to the Oxo Good Grips Non-Stick Pro muffin pan was key. As far as I'm concerned, it's the best muffin tin there is. And if you bake more than twelve muffins or cupcakes at a time, it’s worth investing in multiple pans so you can pop two in the oven at the same time for identical results.Photo by Alex LauOXO Good Grips Non-Stick Pro 12 Cup Muffin Pan$26 at Amazon$26 at Bloomingdales'sWhy is the Oxo Good Grips Non-Stick Pro the best muffin pan?Muffin and cupcake pans come in a variety of materials—carbon steel, aluminum, and food-grade silicone, for example—but the Oxo Good Grips 12-cup muffin pan is made of heavy-gauge aluminized steel, which conducts heat more evenly than other materials and therefore bakes whatever’s inside more evenly too. No more cupcakes with burnt bottoms and gooey centers. It also sports a PTFE, ceramic-reinforced coating, and after using a nonstick muffin pan, I’ll never go back. Even if you use liners, the batter can rise out of the cups, and with a basic pan you can end up with stuck muffin tops. Annoying. The Oxo pan's nonstick surface is textured and easily releases any baked-on batter.The pan’s lighter color plays a part in more even baking too. A dark pan encourages too much browning around the sides and bottoms, which is why our favorite cake pans are light in color as well. The other nice thing about this one? The ends extend well beyond the baking cups to make it easy to grasp with oven mitts—no thumbprints on the sides of your fluffy, perfectly baked muffins. And unlike some other nonstick pans, this one is dishwasher safe.Do I have to grease a nonstick muffin pan?The nonstick coating is a game-changer, especially for those muffin tops, but it’s still a good idea to grease any baking pan for extra reassurance. You can opt either for a cooking spray (here’s our favorite one for baking) or melted butter, applied with a pastry brush. You can always skip the greasing and use muffin liners, but they may prevent your baked goods from achieving an optimal golden brown crust along the sides.What can I make in my muffin pan besides muffins and cupcakes?This piece of cookware is far from a one-trick pony. It's got you covered for bake sales and birthday parties, but well-greased muffin tins are also the secret to Dorie Greenspan’s adorably chubby, perfectly round chocolate chunk cookies. They’re also the key to making the flaky crust of these custardy Portuguese egg tarts and these cinnamon sugar–topped cardamom tea cakes.Caramel Crunch–Chocolate Chunklet CookiesThese chocolate chunklet cookies are ingeniously baked in a muffin tin, resulting in perfectly crispy, caramelized edges and soft centers.View RecipeThe Oxo muffin pan is our top pick, but if you’re looking for other options…You’ve just decorated the prettiest cupcakes piled high with vanilla cream cheese frosting. Now you need to pack them up and head to the bake sale. You could divide your cupcakes among a few storage containers, or, using toothpicks as tent poles, attempt to cover the pan with Bee’s Wrap or aluminum foil without messing up the frosting. But in the best case scenario, you’d have a muffin tin that comes with a tall, fitted lid—like this aluminum pan from Nordic Ware, which also makes our favorite sheet pan and loaf pan. (The plastic lid is BPA-free.)Nordic Ware Naturals 12 Cavity Muffin Pan with High-Domed Lid$30 $20 at Amazon$20 at TargetBakers love Silpat’s nonstick baking mat for everything from rolling pie dough to baking cookies. Now you can get the same engineering in a muffin mold. This oven safe muffin mold is made with fiberglass silicone mesh and has a premium nonstick finish, which makes it one of the few muffin pans that doesn’t need any greasing, at all, ever. The lightweight, flexible material also makes for even heat distribution and easy release. This pan is dishwasher, freezer, and microwave safe, but it does need to be supported by a half-sheet pan in the oven.Silpat Perfect Non-Stick Muffin Mold$63 at Amazon$63 at Sur La TableWhether you go big or small, there’s something about switching up the size of your muffins that makes them feel more special. You'll need a mini muffin pan for these homemade chocolate almond butter cups or these adorable, scarfable jam-filled doughnut muffins. And nothing says “Happy Birthday!” like a giant cupcake (or a batch of six). Or bust out the jumbo tin for these corn-packed cornbread muffins. Split one open and griddle with lots of butter.USA Pan Bakeware Mini Cupcake and Muffin Pan$30 $28 at Amazon$28 at Sur La TableNordic Ware Jumbo Muffin Pan$29 $22 at Amazon$24 $22 at WayfairNow put it to work:BA's Best Blueberry MuffinsYou can make these blueberry muffins with just all-purpose flour, but using whole wheat too gives them a heartier, nuttier flavor. View RecipeThis article was written in 2017 by Claire Saffitz and updated in 2022 by Tiffany Hopkins.Explore Bon AppétitToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-11", "author": ["Condé Nast", "Claire Saffitz"]}