{"id": "6469387602a087b588523a565e5ca3b8", "url": "https://www.bonappetit.com/recipe/naked-apple-tart", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Naked Apple Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNaked Apple TartBy Carla Lalli MusicNovember 14, 20184.8(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis unadorned tart bakes at a fairly high temperature and boasts a deeply browned crisp crust. The apples at the bottom of the tart are insulated from direct heat, so they steam and soften into a very tender layer. The ones up top hold their shape, which means you’ll get a mix of textures in each bite.IngredientsMakes one 9\" tartDough1tsp. sugar½tsp. kosher salt1cup plus 2 Tbsp. all-purpose flour, plus more for dusting½cup (1 stick) chilled unsalted butter, cut into 6 piecesTart and AssemblyAll-purpose flour (for surface)4Tbsp. chilled unsalted butter2lb. firm sweet-tart apples, such as Pink Lady (3–4 medium/large apples)1Tbsp. fresh lemon juice2tsp. sugarPinch of kosher saltCrème fraîche, sour cream, whipped cream, or vanilla ice cream (for serving; optional)Special EquipmentA 9\"-diameter tart pan with removable bottom, with or without fluted edgesPreparationDoughStep 1Toss sugar, salt, and 1 cup plus 2 Tbsp. flour in a large bowl with your fingers to combine. Add butter and toss to coat with dry ingredients.Step 2Turn out mixture onto a lightly floured surface. Using a rolling pin, flatten butter pieces into long, thin sheets. This may take a few passes to achieve; flour pin as needed and use a bench scraper or metal spatula to loosen any butter pieces that want to stick to the surface.Step 3Once all of the mixture is in flexible, thin pieces, use bench scraper to gather it up and return to bowl. Drizzle 3 Tbsp. ice water over. Using a fork, mix in water until evenly dispersed. The dough may break into smaller pieces as you do this, which is fine.Step 4Turn out dough back onto surface and loosely gather into a rectangular shape with a short end toward you. Roll out dough until it flattens. Because dough will be moist, more of it may stick to the pin this time. Scrape pin clean when this happens, and lightly dust pin, surface, and dough with flour as needed.Step 5Using bench scraper to help you, bring top third of dough up and over middle section, then bring bottom third up and over the middle as well (like folding a letter). The dough will be a floury, crumbly mess; you just want to achieve a loose stack at this point.Step 6Rotate dough 90° and repeat rolling out and folding, gathering loose bits into the center to incorporate. The dough should be a little more manageable now, but will still be very dry and crumbly on the long sides. Rotate dough 90° and repeat rolling out and folding a third time. The dough should be mostly together by now and will look smooth, matte, and creamy almost everywhere, though the edges may still be dry and crumbly. If needed, repeat one more roll-and-fold. Form dough into a disk, wrap in plastic, and chill at least 30 minutes.Step 7Do Ahead: Dough can be made 2 days ahead. Keep chilled, or freeze up to 3 months. Thaw overnight in the refrigerator before using.Tart and AssemblyStep 8Preheat oven to 400°. Roll out dough on a lightly floured surface to a round about ⅛\" thick. Roll onto pin, brushing excess flour from underside if needed, then unfurl into tart pan. Working around the circumference, lift up dough, then press lightly into pan, working into corners and making sure dough is making good contact across bottom surface. Using your fingers, press dough against sides of pan, letting excess hang over. Roll pin across top of pan edges to shear extra dough cleanly off. (Dust dough scraps with sugar and bake into little misshapen cookies, if you want!) Chill crust until ready to use.Step 9Cook butter in a small saucepan over medium heat until butter foams, then browns, 3–5 minutes. Set brown butter aside.Step 10Core apples and slice crosswise into rings (do not peel them unless you absolutely insist).Photo by Chelsie Craig, Food Styling by Kate Buckens Transfer to a medium bowl. Add lemon juice, sugar, and salt and toss to coat. Arrange apples into chilled crust in rough concentric circles without making a big mound in the center (they should come up about ½\" over top of pan; snack on any extra pieces left in the bowl). Brush or drizzle brown butter over apples (use all of it). Place tart on a rimmed baking sheet and bake, rotating pan halfway through, until crust is deep golden brown and apples on surface are softened and starting to take on a little color at edges, 55–65 minutes. Do not underbake. Let tart cool on baking sheet until warm, then remove ring and cut into wedges.Step 11Serve each wedge with a spoonful of crème fraîche, if desired.How would you rate Naked Apple Tart?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleOfficially found my go to rosh hashana recipe. I threw this together with the apples I had lying around (a mix of sweetango, honeycrisp, and cosmic crisp), added a touch of lemon zest and honey to the filling and the results were INCREDIBLE. Delicate, light, perfectly balanced flavors, and a perfect, golden flaky crust. The rolling technique in this recipe yielded the best pastry dough I have ever made and I will be using this crust recipe in all my tarts from here on out. This came together very quickly and easily with little to no fuss. Only tweak I’d make in the future is baking the tart on the lower rack as my apples browned too quickly on top.AnonymousLos Angeles, CA10/27/2021I loved this.  I made it for Thanksgiving last year.  It is for me the best part of apple pie -- the taste of the apples and the pastry -- not soaking in syrup.  Making it again this year for a different crew.LissyBrooklyn11/24/2020Came out beautifully using a frozen pie crust (already in a pan). I’m sure the dough is lovely I just don’t enjoy working with it. The filling was superb - just the right amount of sweet and tart and it looked beautiful, all despite me using rather old apples. I was skeptical of the overfill by 1/2” and shouldn’t have been it did noticeably sink. Using a frozen pie crust I could prep this in probably under 10 mins and it looks/tastes so impressive. Some of my apple rings got almost black on top (my oven can be unpredictable and I was being lazy) but they still tasted great, not burned. This one’s a real winner folks. BananaMartiniElkins Park, PA 10/29/2020I just made these and they were really good! I didn't have a pie/tart tin, so i molded the dough into a cupcake tin, and it worked really well! Very buttery and flakey! AnonymousLos Angeles 4/26/2020This was honestly the best apple tart I've eaten. Just perfect. Not too sweet, the dough was amazing. Thank you Carla!AnonymousBogota, Colombia4/26/2020I’ve made this twice. It’s so delicious and the pink lady apples really shine in this recipe. I also used the crust recipe to make blueberry pop tarts. Its almost a rough puff pastry. Flaky and delicious 😋 CorrieElizabethKansas City4/23/2020I burned two batches of browned butter, blame it on multitasking in the kitchen + wine. I settled on melting the third batch in the microwave. Even though I'm sure the browned butter would have added depth of flavor, the tarte still turned out delicious! This recipe's going into my permanent collection.AnonymousTwo Harbors, MN4/17/2020You definitely want a tarte pan for this. I tried making it with a springform pan and it came out ugly.AnonymousShaver Lake, ca11/24/2019I made this today to test it for Thanksgiving. It's wonderful. Good crust with tart, clean apple flavor and a nice texture. Delicious and not heavy.  Moist but not runny. Good with vanilla ice cream or solo.Elissa RossiBrooklyn, NY11/24/2019I knew I need to try this recipe when I realized that all I needed to have for it was a tart pan, a rolling pin and a bench scraper. I couldn't believe how beautiful and DELICIOUS my tart was. I'm not a big apple dessert person but this recipe changed that. Definitely want to make this again for Thanksgiving. kcromwellIndiana10/22/2019This recipe is amazing. I always avoid making pie dough because I don't own a food processor and somehow always mess up when I try to make it by hand, but this technique was super simple. The crust was flaky and soft - definitely the best pie crust I've ever made. I added some cinnamon to the filling (just personal preference) and the tart turned out delicious.  AnonymousNew York3/10/2019Oh my my... I mare this recipe just tonight. I ate 2 slices and there's nothing that would make me regret it. I had never cooked an apple tart before, and I was scared because I'm not so good at homenade tart doug, but this recipe came out just perfect. The tart literally disolves in your mouth, and if you do like i did, add pink Himalayan salt instead of kosher salt into the doug mix, you'll get a really sweet filling on a kind of salty base. Mind blowing. CelelovesbradArgentina2/22/2019This is simply the BEST apple tart I've ever eaten. It's just perfect. I'm speechless. My wig flew the moment this tart became in contact with my mouth.RoseLecterBarcelona, Spain1/12/2019Where is the video for this recipe? Can you provide a link? Thanks AnonymousToronto 11/29/2018Loved this. Thought the pastry technique was really good and produced great results.AnonymousLondon11/26/2018Explore Bon AppétitTartDessertAppleFruitFallNut-FreeBakingThanksgivingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Carla Lalli Music"]}