{"id": "647a4f8efb2d2d447111ffda3c55fdaa", "url": "https://www.bonappetit.com/story/spring-rhubarb", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "It Isn’t Spring Until I’ve Had Rhubarb | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt Isn’t Spring Until I’ve Had RhubarbI have many big plans for the slim pink-and-green stalks.By Carla Lalli MusicMay 28, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.During a normal spring, the return of chirping birds and fresh produce signal the return of a brighter, kinder season. But this year, when time seems to have stood still, the transition to warm weather was all that, times a million. My hunger for a normal spring morphed into an unnatural craving for rhubarb, which I’ve always loved, but didn’t realize could take on messianic status.Why rhubarb? Well, it confirms by existing that the earth has been rotating this whole time, because it’s one of the earliest spring crops here in the northeast. It’s pink and green, the quintessential spring palette, and it’s pretty to photograph. It can go savory, on account of its sour crunchiness, or sweet and lucious, especially if you cook it with fruit or simmer it with sugar and vanilla. You can serve it with lamb, or make a cocktail out of it. You can play up its crunchiness in a rhubarb salsa. Mostly, I love to make desserts with it: Rhubarb cake. Rhubarb bars. Rhubarb compote.Want this letter before it hits the website? Sign up for our newsletter!Throw this sweet, slow-roasted number over ice cream. Thank me later.\nAlex LauBut, rhubarb is a weird fruit. First of all, it’s a vegetable. If you eat it raw, it’s tannic sourness will contort your tongue and squeeze your eyes shut. It can be stringy. It’s hard to know if it’s ripe, since it’s a stalk (nothing to press on, nothing to sniff). It’s not cute like a berry or delicate like a pea shoot—its leaves are poisonous! But, along with spring onions, and pea shoots, rhubarb gives me the mini thrill of having something new to cook with.That’s how the quest began. Seemed simple enough. I wanted it; I needed it. We had a cold, wet spring, and rhubarb was an elusive little rascal. Starting back in April, I visited my local Brooklyn farmer’s market every Saturday to see what was popping, but my trips were less about scoring new produce and more about seeing how the stands had been reconfigured for social distancing, cashless transactions, and safer food handling. I came home feeling the particular kind of alienation that comes from doing something totally familiar in a new and totally unfamiliar way. And on top of that—no rhubarb! Ramps showed up, and hothouse cucumbers, too. May arrived. But the iridescent pink and green stalks were nowhere to be found.I’m coming for you, pie.\nLaura MurrayThe only rhubarb I could find was on my local grocery site, but the price was exorbitant. They were treating it like a rare and precious jewel, but I know for a fact that when rhubarb is truly in season, it grows like crazy! I waited another week. I trotted my masked self back to the market. I snagged little red radishes, big-bulbed ramps, frilly purple lettuces. No rhubarb. It was mid-May. I should have baked strawberry-rhubarb pie by now. At the farmer’s market, there were turrets of asparagus, and everyone was getting very good at staying patient while standing six feet apart in line. I started practicing smizing and loud-small talk with the vendors (to be heard through my mask), but I still pined for rhubarb. A few days later, I made a quick trip by car to pick up a local seafood box from Marlow and Daughters, one of my favorite butchers. (Yes, I was getting fish from the butcher. Things are weird, go with it.) And there, stacked alongside a few other produce offerings, was a crate of Pennsylvania rhubarb. It was perfect: bright pinkish-red, narrow stalks, poisonous leaves trimmed away. That was the day the rhubarb was secured.I’m still waiting on strawberries, but thanks to Pennsylvania, I finally got to make my first rhubarb crisp. It was sweet and sour, sticky from fruit juices, its velvety texture offset by a buttery, oat-studded topping. The whole crisp was gone in a day, but as the warm weather keeps creeping up the coast, home-grown rhubarb will eventually appear at the farmers market, and I have other things I still want to make. I know it’s just rhubarb, but I’m really happy it’s back.Explore Bon AppétitCarla NewsletterRhubarbRead MorecookingRhubarb Shrub is Spring in a BottleBy Al CullitoncookingThis Pink Drink Is My Favorite Way to Consume RhubarbBy Alex BeggscookingA Strawberry-Rhubarb Pie Recipe, with Special Guest Star: VodkaBy Alex BeggscookingA Rhubarb Custard Cake Somewhere Between Pudding and HeavenBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "Carla Lalli Music"]}