{"id": "6487f4f3f074c7bebc40b938d5bf4186", "url": "https://www.bonappetit.com/story/dumpling-making-tips", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Homemade Dumplings Tips, From How to Season the Filling to How to Fold Them So They Stay Put | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking12 Tips for Pudgy, Flavorful Homemade DumplingsHow to make dumplings that look great and taste better.By Hetty McKinnonApril 11, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Before I learned to scramble an egg or boil dried pasta, I was pleating dumplings under the watchful eye of my mother. In many Asian homes, making dumplings is a ritual, a meditation, and often a multi-generational family affair. Homemade dumplings are one of the simplest foods to make, yet they can intimidate even the most confident home cooks. And I understand the reticence. With the constant onslaught of perfectly formed dumplings on social media, we naturally question our ability to replicate these beautiful little morsels.But I am here to offer this cliched-yet-essential piece of advice: When making dumplings, practice does make perfect (or near-perfect). Your first attempts at forming dumplings may leave you feeling disheartened. They will likely be a tad ugly, perhaps not Instagrammable just yet. Put down that phone and persist. Fold, crimp, pleat, and repeat. Again and again. I have had decades of practice and yet, some days, if I have not made them for a while, or if I’m not feeling the vibe, I can still dish out fairly mediocre-looking dumplings. But the upside? Ugly dumplings, like imperfect vegetables, can still taste delicious—and these tips, which I wrote in my new book To Asia, With Love, will help you get there:1. Season the filling wellWhatever you choose for your filling, season it well. If it tastes bland before you stuff it into the wrapper, it will be even more tasteless as a dumpling, as the wrappers will mute the flavor slightly. Depending on what your filling is, and if you don’t want to taste it raw, you can perform a “spot test” and cook a tablespoon of filling to test the seasoning.2. Then be sure to dry it outMake sure your filling is not too wet, as excessive moisture will increase the chance of the wrapper breaking. Remove as much liquid from vegetables as possible before adding to the mix. For greens like spinach, kale, or bok choy, blanch them first, then squeeze them tightly with your hands. If you find that your filling has too much liquid, I recommend draining the entire mixture in a colander. Another trick that I learned from my mother is to add a teaspoon of cornstarch or breadcrumbs to help soak up the liquid.3. Don’t be afraid to experiment with fillingsI like to experiment with the dumpling fillings, trying different vegetables and flavors which are not specifically Asian. Almost anything can be fashioned into a dumpling. For example, my zero-waste “leftovers dumpling” is filled with repurposed roasted veggies, beans, herbs, spices, and other foods found in my fridge filling.This springy filling includes peas, chives, and ricotta (which helps bind it together!).\n4. Keep it togetherFillings that “fall apart” can make folding your dumpling even trickier. Chop your filling ingredients finely or even give them a quick blitz in the blender or food processor to make the mixture easier to handle. If you have a filling that feels too sparse, like it won’t hold together (a simple trick is to squeeze the filling in your hands to see if it stays together), add something that will “bind” it, like mashed beans, mashed potato, or a soft, creamy cheese like ricotta. This will make the filling easier to “hold” in place when you are folding them.5. Less is moreOverfilling the dumplings can make the folding process cumbersome. If you are new to making dumplings, less is more and will give you more control over your folding - start with 1–2 teaspoons of filling, and work your way up; once you become more comfortable with the process, you will be able to handle more filling, say about 1 tablespoon.Just 1 teaspoon!\n6. Store-bought wrappers are the most convenient optionStore-bought dumpling wrappers are the best option for everyday cooking. I keep packets of round dumpling wrappers in my freezer and put them in the fridge to thaw overnight before using. Store-bought wrappers are incredibly versatile and can be used to make dumplings for either steaming, boiling, or for potstickers.Unlike homemade wrappers, they do need to be moistened around the edges so they will stick together when folding. The easiest way to do this is to have a small, shallow bowl of water nearby. Dip the very edge of the wrapper into the water and, using two hands, rotate the wrapper in the water until it is wet all the way around.7. But homemade wrappers are easier than you thinkThe most basic and versatile homemade dumpling wrappers consist of just flour and water, making them incredibly pantry-friendly. Doughs made with just-boiled water are malleable and require minimal resting. They’re easy to roll out into thin wrappers, which are best for potstickers, frying, and steaming (rather than boiling). One of the best things about hot water doughs is that you can work with them straight out of the fridge, which is great if you want to make your dough in advance.For boiled dumplings, a thicker skin will better withstand the pressures. Use a cold water dough by replacing the hot water with the same amount of room temperature water. This dough will be less malleable so it will need to be rested for around 2 hours, or up to 4 hours, before rolling out.Homemade wrappers typically do not need to be moistened, as there should be enough moisture in them to stick together when folded. If you have dusted your wrapper with too much flour and it won’t stick when you’re folding, just dip your fingertip in water and run it along the edge.8. Choose your shapeStore-bought wrappers come in either a round or square shape. Round wrappers are best for traditional pleated dumplings and should be at least 3 ½\" in diameter in order to give you enough dough to fold a good size dumpling. I use the square ones primarily for wontons.9. Eliminate air pocketsWhen sealing your dumplings, take care to enclose the filling tightly to avoid any air pockets, which can make the dumplings burst.10. Appearances can be deceivingFor people who are new to making dumplings, don’t get too wrapped up about appearances. Treat each batch of dumplings as practice. Even though they may not look perfect, they will still taste great.A baking sheet of Christina Chaey's frozen dumplings.\nPhoto by Christina Chaey11. Go big or go homeThere is nothing more satisfying than finding a batch of frozen dumplings in your freezer when the craving hits, so I suggest making big batches and freezing them. To freeze, place folded dumplings onto a small tray or plate lined with baking paper. Pop them in the freezer until they're hardened, then transfer them to a freezer bag or airtight container. Cook directly from frozen (no need to thaw—uncooked dumplings, and this goes for any you’ve just folded, too, will go soggy in the fridge).12. Cover upAs you fold your dumplings, keep them covered with a slightly damp kitchen towel. This prevents the dumplings from drying out (dry skins can split when cooked).Your hard-earned reward:Pea and Ricotta Potstickers With Homemade Dumpling WrappersMaking fresh dumpling wrappers isn't hard when you have Hetty McKinnon to guide you. (But we won't tell if you use store-bought.)View RecipeTo Asia, With Love$43 at AmazonPartially excerpted from TO ASIA, WITH LOVE by Hetty McKinnon. Copyright 2020 by Hetty McKinnon. Published by Prestel, an imprint of Penguin Random House. Reprinted with permission.Explore Bon AppétitHow-ToRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-11", "author": ["Condé Nast", "Hetty Mckinnon"]}