{"id": "648cddd67b0d37a4816a2ad4517fff2a", "url": "https://www.bonappetit.com/story/2018-winter-olympics-breakfast", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "What 6 U.S. Athletes Are Eating for Breakfast at the 2018 Winter Olympics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat 6 U.S. Athletes Are Eating for Breakfast at the 2018 Winter OlympicsThe 2018 Winter Olympics are here, and the U.S. team is eating more oatmeal and eggs in one day than you do in a week.By Alyse WhitneyFebruary 7, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailAthletes may be plastered across Wheaties boxes, but there's more to fueling up for the 2018 Winter Olympics than just a bowl of cereal. Although their diets vary, there's one thing in common for these U.S. athletes' breakfasts: a lot of food. Preparing for the biggest competition of your life requires more oatmeal, eggs, yogurt, and fruit than most of us eat in an entire week—and that's just the first meal of the day. There's also plenty of caffeine involved to get them through those long, cold days of competition. Check out six athletes' breakfasts below.1. Jessie Diggins, cross-country skiing\"I like to keep breakfast simple and eat a lot. I make about 1 cup of dried oatmeal with 1 cup of berries, ½ cup of yogurt with nuts and honey, and a fried egg on the side almost every day. If I want something like French toast or pancakes, I load them up with protein-heavy peanut butter, bananas, nuts, and other toppings that'll last me throughout a long run. I try to make sure I have food that is easy to digest when I’ll be working my hardest, but also keep my energy up for hours. As an endurance athlete that burns through more than 3,500 calories a day during summer training, I eat whenever I'm hungry to keep all the muscles I've worked hard for! And I am a huge sucker for coffee. I can't start my day without it! Every morning it’s the first thing I go to in the kitchen, and the rest of the day I drink water, tea, or Nuun to keep my electrolytes up. When you’re out for a 3-hour ski you lose a lot in sweat and it’s important to keep giving my body the sugars and electrolytes it needs to rebuild.\"2. Chris Mazdzer, lugeTypically, for competitions, I like to eat at least two hours before my run, as this gives me enough time to digest and get a solid warmup in without feeling sluggish and uncomfortable. Feeling bloated from recently eating never looks good in a skintight suit. My first choice is always eggs: scrambled, over medium, in omelettes with onions, peppers, mushrooms and spinach. I also love smoked salmon and a side of avocado, but can substitute with granola or muesli, plain yogurt, and honey. I find that these foods keep me full for a really long time and help maintain weight. Since luge is a gravity-based sport, maintaining weight and strength is an important factor for a good time. I also really like tea in the mornings. I enjoy the warmth that it gives me right before I go, because our speed suits don't offer any warmth. I'll take it however I can!Smoked salmon is a great source of morning protein for Mazdzer.\nChristopher Testani3. Meghan Duggan, hockeyA few eggs, Greek yogurt, oatmeal, fruit, and lots of coffee are an everyday breakfast for me. You have to eat regardless of how nervous you are, and getting in protein throughout the day is incredibly important. In addition to eggs, I'll go for nut butters spread on a banana or toast. A lot of the team watches the Today show while we're eating breakfast, so that's a big part of our morning routine too, no matter what we're eating.4. Ashley Caldwell, freestyle skiingI’ve been on a pretty consistent breakfast plan for the last couple years that makes me feel good and stayed fueled for training. I eat two eggs, spinach, and cheese on a bagel or toast. For a bit of caffeine in the morning, I have coffee or tea, and I've been adding a bit of Rockin Protein to my coffee in the morning as a creamer. Being light in aerials is pretty important for landings. We do fall from about 60 feet in the air so you want a good strength-to-weight ratio. A good protein/carb/fat balance of my morning breakfast is really good for feeling fueled and keeping a good body composition. Also it’s a good meal for keeping a happy stomach while I’m flipping around.Almost every athlete eats eggs for breakfast.\nTed Cavanaugh5. Aja Evans, bobsledI keep my breakfast simple: oatmeal or toast, three eggs over medium or an omelet, bacon, and fruit. I also like to make my own protein bites. I use oats, peanut butter, a little honey, protein powder, dark chocolate chips, crushed almonds, and sometimes dried cranberries and mix it all together and roll it into bite-sized balls. They're so good! Then I have a protein bar or snacks with me at the track, and have a lot of protein later in the day at lunch and dinner.6. Adam Rippon, figure skatingI usually make overnight oats with almond milk. I just try to have something that has high in carbohydrates so I have energy to get through practices [or competition]. After that is when I try to add in protein—after I’ve done some exercise—to use it as recovery and help repair muscles. What I like about oatmeal is its pretty easy to find everywhere. It's important you stay consistent with breakfast when you’re traveling just because you don’t want your stomach to be upset. I try to keep breakfast light enough that I don’t feel heavy and filling enough to keep me going. I live for a cappuccino or latte in the morning, I keep frozen packets of wheatgrass with me, and I will take some Manuka honey to keep from getting sick when traveling. I think it’s a secret weapon to staying healthy.To learn more about the 2018 Winter Olympics team, visit teamusa.org. The Winter Olympics begin live on February 8 on NBC.We bet the Olympics athletes would love this porridge:Explore Bon AppétitOlympicsHealthyishBreakfastRead MorecookingAll the Ways to Make Oatmeal Taste Actually AmazingBy The Healthyish TeamcultureAll of the Quirky Food Facts We Learned About Team USA's Winter OlympiansBy Maggie Langecooking28 Yogurt Upgrades You Should Eat for Breakfast Every Damn DayBy The Healthyish Team and Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Alyse Whitney", "Rochelle Bilow"]}