{"id": "6499d832b53855d24ce67b59ee4db1f7", "url": "https://www.bonappetit.com/story/turbinado-sugar", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "What is Turbinado Sugar, the Raw, Unrefined Sugar That Makes Cakes and Muffins Look So Fancy and Sparkly?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Ingredient Makes Any Cake Look Like It Came From A Fancy BakeryThose fools (um, your friends) will never know.By MacKenzie Chung FeganFebruary 19, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Consider the humble loaf cake. It’s what you make when you want cake but don’t relish spending hours separating eggs for French buttercream or searching for piping bag tips among cookie cutters and that pie bird you’ve never used. But just because loaf cakes are quick and easy doesn’t mean they have to look that way.“The simplest trick for making a cake look fancy or professional is to sprinkle the top with turbinado sugar,” says Basically editor Sarah Jampel. Unlike regular refined sugar, turbinado—also known as raw sugar—won’t melt into the batter while baking, so you’ll be left with a crunchy, sparkly, expensive-looking finish on your loaf.But what is turbinado sugar? While refined white sugar can be derived from sugar cane or sugar beets, turbinado comes exclusively from the first pressing of sugar cane. That cane juice is then boiled just once (as opposed to refined a.k.a. granulated sugar, which is boiled multiple times to rid it of all residual molasses and, with it, any brown color). The boiling process causes sugars to crystallize, and those crystals are then whirled in a centrifuge—or turbine, if you will—to spin off excess moisture. The result is turbinado sugar.Turbinado grains are coarser than refined white sugar, which is why they make an ideal finishing sugar. Just like how Maldon salt’s flaky, pyramidal structure adds texture to a dish rather than melting away into salty nothingness, turbinado granules contribute a contrasting, crunchy exterior to Salted Butter and Chocolate Chunk Shortbread or a crackly crust to a moist Earl Grey Tea Cake. Molly Baz, the brains behind said Earl Grey Tea Cake, says that while the recipe calls for sprinkling either turbinado or granulated sugar on top of the loaf, she highly recommends turbinado. “If you use granulated sugar, you’ll still get a glisteny finish, but you won’t get a crunch,” she explains, adding that she also supports a final shower of turbinado on banana bread, pumpkin bread, and zucchini bread—“anything humble and unitextrual.”If you want your cakes to look not merely fancy but positively unaffordable, Sarah recommends combining turbinado sugar with other elements for an unexpected and texturally complex finish. She likes her loaves of banana bread topped with a blend of turbinado, Maldon, and raw millet, but you could also experiment with sesame seeds, poppy seeds, or pepitas. Or try sprinkling your peanut butter cookies with turbinado, flaky salt, and paprika.The Test Kitchen uses Sugar in the Raw Turbinado Cane Sugar, and if you’re a regular baker, we suggest you keep a box on hand as well. However, if you find that a recipe calls for turbinado sugar and you’ve none on hand, you can always follow the advice of senior staff writer Alex Beggs: “Steal a packet from Starbucks! You only need, like, three of them.”Buy it: Sugar in the Raw Turbinado Cane Sugar, $3 on AmazonThen make this!Earl Grey Yogurt CakeA tea cake that's true to its name, this loaf harnesses the power of citrusy Earl Grey tea for its distinct flavor. Lemon poppyseed can't hold a candle. View RecipeAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBasically BakingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-19", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}