{"id": "64b541c345f356c3dd3fc8409f6fac15", "url": "https://www.bonappetit.com/story/risi-e-bisi-recipe", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Make This Risi e Bisi Just So You Can Say It Over and Over Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Risi e Bisi Just So You Can Say It Over and Over AgainLike risotto, but lighter, brighter, and topped with sizzled scallions.By Alex BeggsMay 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailRisi e Bisi. Risi e Bisi. Risi e Bisi. Isn’t that more fun to say than “risotto”? Say it three more times to make sure and then wipe the spittle from the screen. We were craving a risi e bisi recipe—at this point you’re just hissing—this spring. Something lighter than risotto; a vehicle for green spring peas, pancetta, and as much parm as you can handle.Other things to know about risi e bisi (“rice with peas”). Like risotto, there will be stirring. Lots of stirring. It’s meditative! And ultimately not that much brute strength. You can do this.Andy Baraghani, who developed the recipe, couldn’t resist doctoring it up, so our recipe is topped with something extra: sizzled fried scallions. You can skip this, but the added crispy crunch is exactly what it sounds like, and the scallion oil you create when frying them can be used to drizzle over the bowl when serving. Andy is the definition of extra. But damn, is it good.Otherwise, you begin with pancetta, then add in aromatics (onion, garlic), then arborio rice, then white wine, and finally chicken stock, a ladleful at a time. Each of those commas is you stirring. This isn’t the case where you dump everything in at once and wait; the texture hinges on the slow roll, the nonstop stirring action.The peas come in last, with mint, butter, a ton of parm, and lemon zest to keep things from getting too one-note (the note is: butter). Thanks to the starch in the rice, everything emulsifies and gets wonderfully creamy. You’re finished when the risi e bisi has a barely soupy consistency, not as set as risotto but not watery.I was wrong. That’s not when you’re finished. You’re really finished when you add the sizzled fried scallions on top with a swirl of scallion oil, and even more parm, because going the extra distance is worth it. Just ask Andy.Get the recipe:Risi e BisiLike risotto, but a bit lighter and brighter. Oh, and there’s pancetta.View RecipeExplore Bon AppétitItalianSpring PeaRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Alex Beggs"]}