{"id": "64edf5a571a222bd6674b323100aa454", "url": "https://www.bonappetit.com/story/polkapants-chef-pants", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "I Am Not a Chef But I Wear PolkaPants Chef Pants Every Day Anyway | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Am Not a Chef But I Wear These Chef Pants Every Day AnywayFor all the female chefs sick of saggy, uncomfortable chef trousers. And for all of the rest of us sick of constricting, unflattering civilian trousers.By Sarah JampelMay 20, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.You know what’s one of the hardest parts of adulthood? Pants!I dread getting out of bed and squeezing myself into pants. What’s even worse than putting on pants is shopping for pants, and because I have so little patience for the task, nearly every pair in my closet is either ill-fitting or uncomfortable. The cycle is impossible to break.But the real low point of my relationship with pants came when I was working in a restaurant where I was required to wear black trousers (as in, not jeans). Black trousers that could hold up to heavy-lifting and frequent stair-climbing and the heat of a dysfunctional oven and the occasional torrent from the dishwasher? Fat chance! I ended up wearing a pair of H&M pants (with faux leather trim, purchased for my gospel choir performances of yesteryear) to pieces.In came PolkaPants to save the day. The London-based, women-owned company makes chef trousers specifically tailored to women chefs and designed to be stylish, comfortable, and durable. High-waisted and cropped at the ankle, with a cute little gold zipper on the back, they’re more than just acceptable-looking: They’re flattering. Suddenly I could go straight from the kitchen to “drinks with friends” (read: dinner with my mom) without having to change clothes. (And the less frequently I have to change clothes, the better.)I don’t work in kitchens anymore, but I still wear PolkaPants. And now that my pants don’t have to be all black all the time, I can take advantage of all of the fun colors and patterns, like the signature polka dots and the spring-appropriate camomile flowers. PolkaPants makes wearing pants not quite so bad. But I’m still waiting for the day they come out with skirts.Buy It: Chef trousers, from $76 at PolkaPantsAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-20", "author": ["Condé Nast", "Sarah Jampel"]}