{"id": "64f1a6f9de74924c09d6e7a1e1252806", "url": "https://www.bonappetit.com/recipe/spring-panzanella", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Spring Panzanella Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpring PanzanellaBy Molly BazMay 4, 20204.8(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Pearl Jones, props by Nicole LouieEmailPinterestPrintEmailPinterestPrintThere’s no denying that panzanella made with peak-season juicy tomatoes and crispy-gone-soggy bread is one of summer’s greatest dishes. But we don’t think we should have to wait until the weather warms to enjoy such an iconic dish. Enter this herbaceous, crunchy version that features all of our favorite spring vegetables, a tangy buttermilk dressing, and slabs of bread fried in olive oil. You be the judge, but we think it’s just as satisfying and delicious as the original. (Can’t find some of the vegetables? No problem! Double up on what’s available—just aim for about the same amount of green things overall.)Ingredients4 servings1garlic clove2lemons¼cup buttermilk8Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper1English hothouse cucumber, halved lengthwise, cut crosswise into 1½” pieces4scallions, thinly sliced on a diagonal6oz. sugar snap peas, trimmed, thinly sliced on a diagonal (about 2 cups)21”-thick slices round country-style bread1bunch asparagus, trimmed, sliced on a diagonal into 2” pieces1cup (packed) tender herb leaves with tender stems (dill, mint, basil and/or parsley)4oz. fetaPreparationStep 1Finely grate garlic and the zest of 1 lemon into a large bowl. Slice both lemons in half and squeeze their juice into the bowl. Add buttermilk and 6 Tbsp. oil and whisk to combine. Season dressing with salt and lots of pepper.Step 2Lightly crush cucumber on a cutting board with a rolling pin or wine bottle. Add cucumber, scallions, and peas to dressing and toss well to combine. Let sit while you fry the bread and asparagus.Step 3Pour remaining 2 Tbsp. oil into a skillet large enough to fit both slices of bread in a single layer. Add bread and set over medium heat. Cook, undisturbed, until golden brown and crisp underneath, about 5 minutes. Turn bread over and cook just to lightly fry on the other side, about 2 minutes. Season both sides of bread with salt. Transfer to a plate.Step 4Arrange asparagus in same skillet, season with salt, and increase heat to medium-high. Cook, tossing occasionally, until bright green and blistered in some spots, but still crisp-tender, about 3 minutes. Add to salad.Step 5Tear bread into 1½” pieces and add to salad. Toss to evenly coat and help bread soak up some of the dressing. Taste and season with more salt and pepper as needed. Add herbs to salad and toss once more.Step 6Divide salad among shallow bowls, reserving any dressing and juices that pool at the bottom of bowl. Break feta into large pieces and nestle into salad in each bowl. Drizzle reserved dressing and juices over.How would you rate Spring Panzanella?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI love this salad and I’m not a big salad person. So much flavor. I like to do mine more classic with tomatoes and cucumbers and I add prosciutto and burrata! KariNapa, CA3/18/2022It may not look like much, from the ingredient list, but this dish is amazingly good.  The dressing is light and tasty, and all the veggies are perfect together.  We've made it twice now.  Both times used ½ basil, ½ flat leaf parsley.  The lemon was pretty big so I only used one, and the garlic seemed a little small so I used two. Yum.JCEugene, OR7/4/2021Hi Molly, me and louise both loved the dish tremendously. We both love you and your fun personality. Sorry that BA are all racist scum :( keep it up with the aspergusPanza NellaItaly5/7/2021So yummy! Our small grocer was out of buttermilk, so I used plain yogurt with a splash of milk to loosen it up a bit. Cut back on the lemon and only used the juice of half, mostly because my husband hates lemon and also because prior reviews noted it was a bit too tangy. For herbs we used a lot of dill, basil and parsley, and a little mint. Super fresh and delicious, and enough to fill our family of 3 for dinner.RebeccaChicago4/15/2021This recipe was amazing! I was doubtful, I didn't think it would be anything special, but the dressing and the bread made it so satisfying. The cucumbers and the feta was the perfect pairing. I recommend using a large garlic clove, or two small ones, the garlic added such a nice touch. Like others, I only put the juice of one lemon, not two. To make it a meal, I added faro (italian grain) and roasted almonds. Will 100% do it again :)AnonymousOttawa, Canada3/27/2021Really enjoyed this salad, I went dill and parsley for my herbs, and only used 1.5 lemons for juicing, as that's all I had on hand. Otherwise made the salad to the recipe and it was bright and fresh, with some wonderful moments with the chewy fried bread. I would make again, especially when looking for a way to use up the veggies in my fridge.AnonymousRichmond, Virginia3/17/2021Subbed buttermilk with plain yogurt and it's soooo good.Anonymous7/26/2020Simple and delicious! Now that we're all baking at home this was a nice way to use up some stale bread. Used only one lemon and half of a (big juicy) cucumber per the suggestions in the comments. Great dressing and bread prep that seems super riffable with many veg and herb combos, will definitely use it again. AnonymousBerkeley, CA6/12/2020This was a great way to use up a couple of heels of sourdough bread, a ton of herbs, and a half a container of feta cheese. The choice of veggies here doesn't seem super important so I think you can sub out for your favorite spring green things. Next time i'll skip the cucumber since this is otherwise a hearty enough salad to last a couple of days. I also second the comments that it was a bit heavy on the lemon juice (and I love high-acid salad dressings!) and extra bread is a welcome addition. AnonymousSeattle6/8/2020yum! my boyfriend thought it was a bit unbalanced - too bright - so next time I might halve the lemon juice. I thought it was delicious though!cece.so.flyUK6/8/2020Very delicious! Lots of flavor for such a green salad. Don’t know if we misunderstood, but the cucumbers were huge, at 1.5”. Would have quartered the cucumber and cut them smaller. Used basil and mint which were good complements.AnonymousBrooklyn, NY6/6/2020I made this for a picnic on the weekend and I'm obsessed. I'm already planning to make it again this weekend. I used basil, mint, and parsley as my herbs (not a dill fan) and I'd probably leave out the parsley next time, the flavour didn't seem to mesh as well as the other herbs did. AnonymousToronto6/5/2020Extremely refreshing, love this one. Would reduce the cucumber if it isn't your favourite flavour, it tasted slightly overpowering. E^B^RLondon6/1/2020This was SO good. My instacart shopper brought me a zuchinni instead of a cucumber so I left out the cucumber. I added shredded rotisserie chicken and an extra slice of bread. This was absolutely delicious. AnonymousNew Hampshire5/31/2020Made this just as written and it was DELICIOUS!  My sister called it 'transcendent.'\nWe'll definitely be making it again - it was a huge success.AnonymousArkansas, USA5/25/2020Explore Bon AppétitSaladMediterraneanAsparagusVegetableSugar Snap PeaPeaCucumberButtermilkOther IngredientsSpringQuickEasyMainSideVegetarianNut-FreeEasterLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-04", "author": ["Condé Nast", "Molly Baz"]}