{"id": "64f1a9f28d51e179e2b7973ae2e85a1e", "url": "https://www.bonappetit.com/story/vegetable-recipes-reset-thanksgiving", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "The Vegetables I’m Eating to Reset Post-Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Vegetables I’m Eating to Reset Post-ThanksgivingEditor in chief Adam Rapoport shares his antidotes to all that buttery, slow-cooked goodness.By Adam RapoportNovember 27, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailMy post-Thanksgiving reset plan“I just want some vegetables.”That was my wife talking Saturday night, though I imagine it’s what most of America was feeling post-Thanksgiving.And while I’m right there with her, I’m going to take it one step further—I want crisp, bracing vegetables. I want crunch. I want an antidote to all that buttery, slow-cooked goodness that I swaddled myself in last week.First up, celery—always available, always delivers. I’m currently fixating on Chris Morocco’s celery, green bean, and tofu salad with chile crisp. The addictive sauce, which you spoon over the sliced-up veg, is what pulls it all together. A mixture of ginger, garlic, cinnamon, chiles and more, it’s inspired by a version that Bad Saint chef Tom Cunanan bestowed upon the BA Test Kitchen last year. It’s one of those condiments that you taste once and insist on always having around—for eggs, rice, salads, you name it.In this video, I’m making soy-basted grilled pork chops with a riff on the Tiger Salad.\nWhen chile crisp is not an option, I’ll quickly riff on Alison Roman’s cucumber-and-celery Tiger Salad (watch me make it in this video). It is the perfect complement to a pan-roasted pork chop—hey, I never said I was going vegetarian this month.Let’s see, what else? Again and again, this past year, I’ve found myself turning to Amiel Stanek’s dead-simple Napa cabbage salad, spiked with lots of lime juice and a flurry of chopped cilantro and dill. It’s as satisfying as it is simple.Alex LauAnd If I’m feeling a bit more ambitious, I’ll pull out my mandoline and trying to recreate Chef Ignacio Mattos’ subtle—almost beguiling—shaved fennel salad. It sings of orange zest and sweet champagne vinegar, while crushed Castelvetrano olives and shaved, sharp Provolone keep kicking at you with every bite.It’s the ideal salad for a rich meal ahead. Of which, I imagine, I’ll have plenty between now and New Year’s Eve.Get the recipes:Celery, Green Bean, and Tofu salad with Chile CrispTiger SaladPan-Roasted Brined Pork ChopHerby Napa Cabbage SaladShaved Fennel Salad with Green Olives and ProvoloneExplore Bon AppétitVegetableAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Adam Rapoport"]}