{"id": "650a7728befc84f60826508b074a1260", "url": "https://www.bonappetit.com/story/we-graduated-from-chocolate-chips", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Why Chocolate Discs, Wafers, Fèves, and Pistoles Are Great For Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSome Personal News: We’ve Graduated From Chocolate ChipsWe're taking chocolate to the chopping block.By MacKenzie Chung FeganFebruary 9, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.You’ve just read the recipe for Salty Buckwheat Chocolate Chip Cookies. Your salivary glands are activated, and you’re ready to dash to the store for a bag of buckwheat flour. Running down the ingredient list, you confirm that you have everything else in your pantry—with the exception of “bittersweet chocolate bars or discs.” But not a big deal, you have chocolate chips and can use those instead, right?You could, but before you do, allow us to talk you out of it. There’s a time and a place for chocolate chips, but these cookies were developed specifically with chopped-up chocolate discs or bars in mind. Here’s why.Chocolate chips are formulated to hold their shape, even at high temperatures. “You could microwave a chip for 20 seconds, and it’ll still have that Smurf hat thing going on,” says Basically editor Sarah Jampel. Think of chips like the Meg March of the baking chocolate world—poised, put-together, and composed in every circumstance.Chocolate discs and chopped bars, on the other hand, have a higher percentage of cocoa butter, which means that when they’re exposed to heat, they melt down into gooey choco pockets. They’re the Jo—a little sloppy, a little messy, but absolutely the life of the party.In situations where you want to bite into a self-contained nugget of chocolate—double chocolate brownies, banana bread, scones (a very Meg baked good)—chips are the answer. Were you to use discs or chopped bars instead of chips in a pancake batter, you’d end up with a melty pool of chocolate in the frying pan rather than distinct pieces of chocolate speckled throughout your stack.But when melty is the goal, reach for discs or bars. “If you use chopped-up discs or bars in these cookies, when you break them in half, you’ll get a chocolate river,” says Sarah. A chocolate river. If you substitute chips for discs, instead of an unctuous puddle of molten chocolate adorning the top of every cookie, you’ll get...Smurf hats.Chopped bars or discs can be used interchangeably with chocolate wafers, pistoles, or fèves, all of which are suitable for melting and look like either buttons or beans. In the Test Kitchen, we use Guittard Organic Bittersweet Chocolate Baking Wafers, which also come in semisweet and milk chocolate varieties, though you can often find similar products packaged near the bulk section. Store them in a cool dry place for whenever the baking urge strikes. “You won’t ruin anything by using chopped discs when a recipe calls for chips,” Sarah says, “although you might not get the precise look you want because they’re going to melt. But if a recipe calls for discs or bars—especially melted down for something like a chocolate mousse—you might ruin it by using chips.”Diplomatically, we’ll say that discs and chopped bars aren’t necessarily better than chips; they’re just different. But let’s be honest, is Meg anyone’s favorite March sister?Guittard, Organic 74% Chocolate Baking Wafers, 12 oz$12 at AmazonGuittard, 70% Bittersweet Cocoa Baking Bars, 6 oz (Pack of 4)$25 at AmazonExplore Bon AppétitBasically BakingShoppingChocolateRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-09", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}