{"id": "6516c581e0523f3e7b4192d4be22eb8d", "url": "https://www.bonappetit.com/recipe/cardamom-pistachio-carrot-cake", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "Cardamom-Pistachio Carrot Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCardamom-Pistachio Carrot CakeBy Sohla El-WayllyMarch 29, 20204.4(146)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan SpungenEmailPinterestPrintEmailPinterestPrintWhen carrot cake meets carrot halwa, the milky, long-cooking, spoonably-soft confection common in South Asia, you get the eighth recipe in the Basically Guide to Better Baking. Raisins, cinnamon, and cream cheese frosting get the boot and brown-butter pistachios, cardamom, and sticky carrot glaze take center stage. For the best possible cake, make sure that your eggs are at room temperature (cold eggs can't whip up to the same volume) and take your time when streaming the butter into the whipped egg and sugar mixture—you want to create a creamy emulsion, as when making a vinaigrette. If you go too quickly, you’ll end up with a greasy batter. More questions? Ask them in our forum! All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRound Cake Pan$12.99 At AmazonParchment Paper$3 At AmazonSmall Bowl$13 At AmazonVegetable Peeler$10 At AmazonBox Grater$13 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMesh Sieve$13 At AmazonGlass Measuring Cup$19.99 At AmazonMedium Saucepan$39 At AmazonLarge Bowl$18 At AmazonElectric Mixer$40 At AmazonChef's Knife$34.53 At AmazonSpatula$12.99 At AmazonSmall Offset Spatula$6 At AmazonWire Rack$23 At BA MarketPlate$55 At Bon Appétit MarketStainless Steel Skewer$5.89 At AmazonIngredientsMakes one 9\"-diameter cakeVegetable oil (for pan)3large eggs, room temperature3medium carrots1cup (2 sticks) plus 2 Tbsp. unsalted butter, divided1cup (130 g) raw pistachios1cup (packed; 200 g) dark brown sugar¾cup (150 g) granulated sugar, divided1¾tsp. baking powder¼tsp. baking soda1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided1½tsp. ground cardamom½tsp. ground cinnamon1½cups (188 g) all-purpose flour½cup carrot juice½cup heavy creamPreparationStep 1Place a rack in middle of oven; preheat to 350°. Lightly coat bottom and sides of a 9”-diameter cake pan with vegetable oil. Cut a parchment round: The easiest way to do this is to trace the bottom of the pan onto parchment, fold the paper in half until you have a slender arc, and then use a pair of scissors to cut the arc. Place pen side down in pan and smooth to eliminate any air bubbles. Lightly grease the parchment.Step 2Your 3 large eggs need to be at room temperature for this recipe. If they aren’t, put them in a small bowl and cover them with warm tap water. Let them sit to take the chill off (room-temperature eggs gain more volume than cold eggs do when whipped; cold eggs could result in a tight or dense cake).Step 3Peel 3 medium carrots and grate on the large holes of a box grater. Measure out 2½ cups (lightly packed; 250 g); reserve remaining carrots for another use (like raita!).Step 4Set a fine-mesh sieve over a measuring glass and place next to stove. Cut 1 cup (2 sticks) unsalted butter into pieces and heat in a medium saucepan over medium until foaming, about 2 minutes. Add 1 cup (130 g) raw pistachios and cook, stirring often, until butter browns and nuts smell toasty, about 5 minutes. (Butter will get very foamy and it will be hard to see what’s going on, so once the foam is golden brown, remove pan from heat and lift out a few nuts with a spoon every 10 seconds to check how they are browning.) Pour mixture through prepared sieve, scraping in all of the browned bits; set nuts and butter aside separately.Step 5Remove eggs from water and crack into a large bowl; add 1 cup (packed; 200 g) dark brown sugar, ¼ cup (50 g) granulated sugar, 1¾ tsp. baking powder, ¼ tsp. baking soda, 1¼ tsp. Diamond Crystal or ½ tsp. Morton kosher salt, 1½ tsp. ground cardamom, and ½ tsp. ground cinnamon. Using an electric mixer on high speed, beat 3 minutes (mixture should be thick, pale, and slightly increased in volume). Decrease speed to medium-high and gradually stream in reserved brown butter (including browned bits); beat until combined. Go slow during this part—if you add the butter too quickly, it'll be hard to achieve the emulsion you're aiming for.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Coarsely chop reserved pistachios. Using a rubber spatula, fold in 1½ cups (188 g) all-purpose flour until almost completely combined. (In this cake, as in most, be gentle with the flour: Use rubber spatula to make broad strokes down the middle of the bowl and up along the sides, and stop as soon as the dry bits disappear. Being too aggressive leads to excess gluten development and  tough cake.)Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Add nuts and carrots and continue to fold until everything is incorporated. Scrape batter into prepared pan; smooth surface with a small offset spatula or a small spoon. Place pan on a clean smooth surface and give it a fast 360-degree spin (this pushes the batter up the sides of the pan and minimizes doming during baking).Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Bake cake until deeply browned and a tester inserted into the center comes out clean, 50–55 minutes. (When in doubt, it’s better to slightly overbake this cake than to take it out too early. If underbaked, it will sink in the center.) Transfer pan to a wire rack and let cake cool in pan.Step 9Run a small offset spatula or butter knife around perimeter of cake to loosen. Place a large plate upside down over cake and invert cake onto plate (leave flat side up; this will give the top of your cake a smooth, even surface and create that dramatic drippage when you glaze it). Remove parchment paper; discard.Step 10Place a small plate in the freezer. Cook ½ cup carrot juice, ½ cup heavy cream, remaining ½ cup (100 g) granulated sugar, and remaining ¼ tsp. Diamond Crystal or Morton kosher salt in a medium saucepan over high heat (don’t be tempted to stir; the layer of sugar at the bottom of the pan will insulate the cream from the heat) until a consistency similar to lava, 8–10 minutes. Mixture will initially bubble and foam vigorously and look like it’s going to boil over, but it won’t! Don’t be tempted to reduce the heat; the bubbling will subside and mixture will thicken. You want it to be thick enough to stick to the cake, but do not let it brown.Step 11Test glaze by putting a small dollop onto the chilled plate: When you run your finger through the glaze, it should leave a defined trail. Once the glaze is thick enough, remove pan from heat and stir in remaining 2 Tbsp. unsalted butter. Let glaze cool until you can comfortably hold your finger in it (if it’s too hot, it will run right off the cake), about 15 minutes.Step 12Stir glaze well and pour over center of cake, nudging to the edges with offset spatula or a butter knife. Pop any air bubbles with a skewer or toothpick. Let glaze cool at least 10 minutes before slicing cake.Step 13Do ahead: Unglazed cake can be baked 3 days ahead. Store tightly wrapped at room temperature.How would you rate Cardamom-Pistachio Carrot Cake?Leave a ReviewTell us what you thinkReviews (96)Back to TopTriangleI seriously love this cake.  Its everything I want in a carrot cake and the flavors work so well together.  Don't ask me about the frosting.  I didn't think it needed any so I didn't bother.  But this cake is magnificent all by itself.Lisa BobanChicago3/5/2022I see several negative reviews. I am surprised. This is one of our very favorite recipes!  It is a bit 'technical', esp. the lava frosting. But it works well, and tastes great, especially if you are a cardamom fan (strongly recommend Burlap and Barrel for your cardamom needs, in fact all of your spice needs).  I will be making it again today!EricSwarthmore, PA2/26/2022I wanted to love this cake, but didn't.  I did do what one reader suggested and reduced the sugar to 1 cup, ,so that might have made a difference.  I found it dry and not exciting. I did love the glaze, and made it exactly as written.  Marlene's CuisineSan Francisco2/24/2022Way too much butter and sugar! I passed for that reason.Pat CAnn Arbor, MI2/24/2022This cake is excellent.  I broke away from the directions and used a greased and floured bundt pan.  It was the \nperfect size for the amount of batter.  I think that i either cooked to glaze too long or let it sit too long as it really firmed up and didn't drape over the cake but the flavor was good and i'd make it again.JanAbq1/29/2022It boiled over.Big MessNonya, USA1/6/2022I am Indian and my favorite dessert is gajar ka halwa and I love this recipe.  I thought it might just taste like carrot cake with cardamom but the texture + pistachio brown butter + butter roasted nuts really do make it feel like a gajar ka halwa cake.  The carrot juice caramel glaze is not Indian at all, but it is truly unique and delicious and a necessary addition to this wonderful recipe.  AnonymousWoodside, CA11/18/2021This is a keeper despite the fact that I let the glaze cook for a bit too long and it became caramel. It was still delicious.  Everyone liked it, event those I was afraid might not. I had a fresh bottle of cardamom and the flavor was quite prominent though not overwhelming on the first day.. It was better the next day, as is often true with cakes and cookies that highlight butter and/or spices, when the flavors had blended a bit. Will chop the pistachios a bit more next time.AnneSacramento, CA8/26/2021I tried to leave a one star review, but the review stayed at five stars no matter what I did. I followed the recipe exactly and was dubious about high heat and not stirring the topping in the final stages. I ended up with a BADLY burned expensive pan! I hope I can get rid of the burn layer!Anonymous6/6/2021This cake is DELICIOUS! It's so good that I would make it for my mom, and possibly even for a dinner party. But most importantly I will make it for myself again, and again, and again. AnonymousOxford, MS4/26/2021Amazing recipe. The cake was a huge hit, this one is a keeper.AnonymousNew York, NY4/11/2021any thoughts on how best to turn this into cupcakes? I made it as a cake last summer and absolutely loved it, but would love to be able to more safely distribute to a crowd! Basically just wondering what cook time would look like? Thanks!CaseyMadison4/10/2021I planned to make this cake and discovered last minute that all my pistachios were rotten, so I made a simple carrot cardamom cake from another recipe and topped it with the glaze from this recipe. It was AMAZING. I accidentally browned the glaze and made something closer to caramel, which in my opinion was a happy mistake. Can’t wait to make the cake too (and the glaze the right way lol)SarahUtah4/1/2021I made this today and I cooked it for 52 mins, which was as about 2 mins too long for where I live. As a lover of cardamom I would have added more to the batter. I added some cardamom to the glaze. Otherwise this is an amazing cake. HRAINES Victoria, BC3/28/2021Recipe is a WINNER. The carrot glaze is such a refreshing substitute for the traditionally heavy cream cheese frosting on carrot cake. I've made this multiple times. Everyone loves it.AndreaChicago, IL2/23/2021Explore Bon AppétitCakeDessertCarrotVegetablePistachioNutCardamomHerbs & SpicesSnackBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-29", "author": ["Condé Nast", "Sohla El-Waylly"]}