{"id": "6517bd299cba5cba12802164583e84d1", "url": "https://www.bonappetit.com/story/make-stock-when-you-roast-chicken", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "If You Don't Make Stock When You Roast a Chicken, You're Throwing Away Free Money | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Don't Make Stock When You Roast a Chicken, You're Throwing Away Free MoneyThat roast chicken has so much more to give than one measly dinner.By Molly BazNovember 14, 2018FacebookTwitterEmailFacebookTwitterEmailThis is a Public Service Announcement: If you aren’t making stock out of that leftover roasted chicken carcass, you are throwing money in the trash! According to Title 18, Chapter 17 of the U.S. Code it is illegal to dispose of money.  STOP BREAKING THE LAW, PEOPLE!!!In my household, roasting a chicken has become a non-negotiable twofer operation. The chicken gets roasted until golden brown and delish (duh), and then that roast-y, toasty carcass gets turned into stock. There’s simply no question about it. Good quality chicken stock does not come cheap these days, and I for one, am not in a position to throw away free food. A quart of chicken stock from my local butcher (granted I live in NYC which is a ridiculously overpriced place to live), retails for $9. That’s about half the cost of an entire chicken!I’ve always held the belief that free food tastes more delicious. Think about it: when a waiter drops a dish on your table and declares it complementary, you are already predisposed to liking it a whole hell of a lot more than you would if you knew you had to pay for it. So think of your roast chicken as a two-for-one deal. Buy a chicken, and get two free quarts of made-from-scratch chicken stock. Thats a value of nearly $18. Did I chose the wrong career path?? I’m starting to think I’d make a pretty sweet salesperson.Now that we’ve sorted out the financial bit, here’s all you need to know about making it. Once the bird has been roasted and carved, I try to break the chicken carcass into a few pieces with my hands and huck it straight into a large pot, cover it just barely with water, bring it up to a boil, and then drop it to a gentle simmer. This takes a total of five minutes, which you can surely carve out of your day. If you have any aromatics laying around (think onions, shallots, carrots, parsley stems, garlic, ginger, a dried chile, mushrooms), you’ll only benefit from throwing those in the pot as well. No need to practice your fancy knife skills here, just halve ‘em and get em in there on the quick. Don’t have any aromatics laying around? GREAT. You’re still on your way to free AF liquid gold.The carcass in question. A pot of stock is a great way to make the most of a sloppy carving job, just sayin'...\nPhoto by Alex LauHere’s the most important part about this very awesome two-for-one deal I’ve just walked you through. You gotta get that stock on the burner before sitting down for dinner. If you start in on your meal, you risk getting lazy, entering food coma and deciding you’ll start the stock later. A rookie move (yes, of course I’ve done it). Full flavored stock takes a couple of good hours of simmering to truly develop flavor, so the sooner you get it going the better. That way, you aren’t simmering into the wee hours of the night.Season with plenty of salt and taste as you go—the stock is done when it tastes delicious, you make the call. Strain it through a mesh strainer and discard all the bits and pieces; they've given all the flavor they have to give to the liquid. Let it cool and then refrigerate until you're ready to use it, freeze it, or just drink it as-is. This chicken stock isn't going to be as crazy and flavor-packed as the kind you make with pounds of fresh chicken you bought specifically for this purpose, but it will still be an incredible base for a quick soup the next day, a speedy risotto, or a casual braise. And that's money, kids.Let's back up for a second—first, you gotta roast a chicken!No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitBasicallyroast chickenStockLeftoversRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Molly Baz"]}