{"id": "651840ce8672dce43cf3bf19b96ded82", "url": "https://www.bonappetit.com/story/egg-and-merguez-breakfast-wrap", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "This Breakfast Wrap with Merguez and Eggs Will Sustain You All Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Egg and Merguez Breakfast Wrap Is the Dinner of Your DreamsYou won’t wanna wait til morning.By Alex BeggsJanuary 2, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailAre we, as a collective cooking community, taking breakfast-for-dinner seriously enough? Really think about it. Pause and reflect. This is the hot-skillet issue Molly Baz took on when she developed five new dinner recipes that give breakfast-for-dinner the respect it deserves. I would call them restaurant quality recipes, because I’d pay good money for them with unlimited cups of coffee, but that also implies difficulty. And they’re not.Take, for example, this phenomenal merguez and egg wrap. There are a few individual components here that all come together in the most delicious lavash package: crispy sausage up against jammy hard-boiled egg up against garlicky yogurt up against acidic pickles and onion. And if that isn’t enough, the whole damn wrap then gets griddled in the reserved merguez fat, causing crispy edges and extra sausage flavor while everything inside melds together. MOLLY, YOU BEAUTIFUL BASTARD. THANK YOU.My assembly station was not this tidy, but how aspirational!\nPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiHere’s how to make it happen on a desperate and dark Monday night:Boil some water, drop in some eggs. For only 8 minutes, people. We want bright orange, slightly soft yolks, not hard and dried-out yolks. (Honestly that’s a personal preference, you do you.)While the water’s coming to a boil for the eggs, mix up some yogurt. With lemon juice, salt and pep, grated garlic.Maybe the eggs are still boiling. Get on that merguez. First, brown the sausage meat in patties for maximum crispy-edged potential. When the pan-side has browned, flip the patties over and then break up the sausage into morsels as the other side cooks through.Slice some stuff. The eggs, red onion, pickles, herbs.Assemble your masterpiece. Swoosh that yogurt all over, leaving some room at the edges. Layer on sausage, layer on eggs, layer on the pickles, onion, and herbs. Wrap it up tight. Unless you got small tortillas or flatbreads like I did, in which case, make a taco, you did your best.The grand finale. This THREE MINUTE extra step yields the greatest breakfast-for-dinner reward, so please DO IT. Heat up that pan again, the one with the merguez fat shimmering and ready for duty, and plop the wrap in, don’t even touch it, until it’s crispy on one side, then flip and repeat. (If your wrap is too small, I highly recommend still frying it open-faced anyway.)Slice and eat. Hopefully by now you’re in your comfy pants, unfolding the TV tray, and settling in for the best breakfast-for-dinner you’ve ever had. From now on, don’t settle for less.Get the recipe:Egg and Merguez WrapsIt’s a wrap griddled in sausage fat until the outside is crispy and warm. Need we say more?View RecipeExplore Bon AppétitSausageEggBreakfastDinnerWeeknightSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-19", "author": ["Condé Nast", "Alex Beggs"]}