{"id": "6519c239dcefdfa1fa7b3498aacf3c64", "url": "https://www.bonappetit.com/story/dunkin-donuts-food-memories", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "How Dunkin’ Donuts Shaped My Parents’ New Life In America | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Dunkin’ Donuts Shaped My Parents’ New Life In AmericaThe doughnuts reminded them of sugar-coated Indian sweets. But also they really love doughnuts.By Priya KrishnaOctober 10, 2018FacebookTwitterEmailullstein bild/Getty ImagesFacebookTwitterEmailNo restaurant has been as influential in my parents’ lives as Dunkin’ Donuts (or rather—Dunkin’, the restaurant formerly known as Dunkin’ Donuts, a name change that was announced last week).It’s a funny thing to say out loud, considering my mom is a health nut, my dad is a homebody, and neither of them regularly eats fast food. But whenever they talk about their favorite food memories, the conversation always turns to the first time they had doughnuts and coffee at Dunkin’ Donuts.After they got married in India in 1980, my parents settled down in New Hampshire. Dunkin’ Donuts, which was founded three decades earlier, was a fixture of the Northeast. Neither of them could tell me with certainty about the circumstances surrounding their maiden visit. What my dad does remember perfectly is what he heard upon entering the store: “I’ll have a donut and a regulaaaaaah,” as he recalls to me in his exaggerated imitation of a New England customer (a regular meant coffee with a little bit of cream and sugar, he says).“It was love at first sight,” my mom says of her inaugural taste of Dunkin’ (a glazed doughnut and a coffee). It reminded her of Indian sweets, like balushahi, circular puffs of dough deep-fried in ghee and dunked in sugar syrup. My dad’s order was a chocolate doughnut and a coffee. (It’s worth mentioning that my dad hadn’t realized doughnuts were deep fried until I called him for this story. “Are doughnuts fried?” he asks me, incredulously. “Oh, boy.”)My parents quickly developed their standard order: a glazed doughnut for my mom, a chocolate-chocolate doughnut for my dad, and black coffee for both of them. At that time, their lives involved nonexistent office snacks and terrible instant coffee (Starbucks had yet to go mainstream). At Dunkin’, the donuts were always fresh, the coffee was always good, and the whole experience never cost more than a few bucks. When the weather got cold, a shock to my parents coming from India, the hot coffee warmed them up. My mom reminisced on the phone with me about driving down New England roads lined with vibrant orange and yellow trees, en route to doughnuts.Perhaps they won’t outright admit it, but my parents are Dunkin’ Donuts superfans. They can both recite frame-by-frame accounts of the iconic Dunkin’ Donuts “Time to Make the Donuts” commercial (if you ever meet my dad, please ask him to do his impression of the doughnut guy). They don’t eat any other doughnuts besides Dunkin’ Donuts (though my dad has been occasionally tempted by Krispy Kreme). And when they moved to Dallas, my mom says she genuinely felt forlorn that she no longer lived near a Dunkin’. A few locations eventually opened up in the city as Dunkin’ expanded across the country, but my mom claims it wasn’t the same.When the time came, my sister and I both decided to go to college in New Hampshire—I guess the state had just become part of our family’s collective memory, and even my sister and I felt some strange pull to that part of the country. My parents would visit every leaf peeping season, making a necessary pit stop on the drive from Logan airport to Hanover at a Dunkin’ Donuts.Fast-food spots can hold a special appeal for people when they arrive to a new place. They’re often the most affordable and consistent option as you’re getting the lay of the land. The glowing signs are ubiquitous and recognizable. They feel accessible. I ask my parents if Dunkin’ Donuts was special to them because it made them feel like they were assimilating to America. They both give a forceful no. “We spoke the language!” my dad says. “We just liked the doughnuts.”My parents have now lived in Dallas for almost thirty years, and they have fully bought into Texas culture: my dad wears a cowboy hat on his walks, my mom is snobby about salsa, they are both weirdly loyal to various Texas brands. But Dunkin’ Donuts is the lasting legacy of their time in the Northeast; it represents the part of their life when they were newly married, not yet parents, and learning to appreciate the unfamiliar (foods, weather) about America.When Dunkin’ Donuts announced it was dropping the “Donuts” from its name a few weeks ago, my dad was the first one to tell me. He quoted a fan in an article who said, “I’ll call them Dunkin’ Donuts until I die.” An hour later, he sent me another text: “New Englanders are passionate about their donuts!” In that moment, I could see him, probably out for his walk during a hot Dallas afternoon, dreaming about the days of chocolate-chocolate donuts and coffee, sipped in the front seat of his Dodge Omni 024, driving with my mom down the Massachusetts Turnpike on a cool, crisp day—both of them young and hopeful about their yet unwritten story in this foreign country they would come to call their home.Priya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Explore Bon AppétitNostalgiaDoughnutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Priya Krishna"]}