{"id": "651d093ad377d71e7c2556ef691a8c0b", "url": "https://www.bonappetit.com/story/laundress-stain-bar", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "This $7 Stain Bar Erases My Toughest Food Spills | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis $6 Bar of Laundry Soap Removes My Toughest Food StainsI love food and fashion in equal measure, and this bar keeps everything I own miraculously spotless.By Jenna Adrian-DiazJuly 1, 2021FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Last fall, I excitedly swapped out single-use paper products in my kitchen in favor of a durable-but-chic set of upcycled napkins and towels. Admittedly, I wondered, Were these beautiful linens, in their blue, cream, and ivory hues, doomed to end up covered in stains and shut away in the back of a kitchen cabinet? After about 10 months of subjecting them to lipstick and red wine, tamari-glazed tofu, so much chili oil, and the saucy, greasy remnants of pepperoni slices from my go-to pizzeria, they’re doing just fine. The magic of The Laundress’s wash and stain bar keeps them looking good as new.This $7, 2.5-inch square of soap is the only spot treatment I buy because it’s the only one I need. It works on everything from my cotton napkins to “dry-clean only” silk blouses, chunky knit sweaters, and synthetic blends. It also lasts forever. My messy household of two goes through two bars a year, with at least twice-weekly use.The Laundress Wash & Stain Bar$7 at The Laundress$6 at AmazonEager to learn more about what exactly makes this bar work so well, I called up Gwen Whiting, who cofounded The Laundress with business partner Lindsey Boyd in 2004. The two started the brand after studying fiber science at Cornell University. “The philosophy for The Laundress was not ‘one size fits all.’ It was very specialized—a product specifically for woolens, one for silks and synthetics, one for whites, one for denim, and a stain treatment. And I wanted all the products we created to be really effective,” Whiting says.What really sets it apart is how much thought was poured into its design. “The bar format is really tactile, and it allows you to have more control than you would with a liquid,” Whiting says. It also means that, unlike with a liquid detergent, my stain bar ships in fully biodegradable packaging, with no single-use plastics in sight. “We were inspired by old-fashioned laundry bars, which are more common in South America or Europe. Those were traditionally made with animal fat, but we make our bar with plant-derived soap and borax, which is very old-fashioned but highly effective.”More effective, in my opinion, than any other stain remover because it works on every stain I’ve subjected it to (many) and on every textile I own. While the Tide Pen enjoyed a moment on the big screen this summer In the Heights, the packaging specifically calls out that it doesn’t work well on blood, grease, or ink stains. Bummer. Shout, another laundry aisle staple, advises against use on silk or wool fabrics and pointedly says that stains from ink or dyes can be impossible to remove. And yet, over the weekend, blue dye from a new pair of dark-wash denim shorts bled onto my favorite white tee, and I was able to easily wash it away with my Laundress bar. (Later that night I also treated the marinara sauce that dripped onto the other white tee I changed into. Did I mention my household was messy?)I have yet to meet a stain that these mighty little bars can’t handle: food or makeup, fresh or a week-old and forgotten at the bottom of my hamper. The combination of soap and borax is hardly a new way to tackle laundry—it’s been used for hundreds of years, according to Whiting. But—like my billowy white silk button-down which, thanks to The Laundress, is miraculously stain-free—some things are classics for a reason.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-01", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}