{"id": "65208277bbb4c26de805b996bc3fc6d5", "url": "https://www.bonappetit.com/story/may-cookbook-club-bravetart", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "May’s Cookbook Club Pick Is BraveTart, One of the Greatest Dessert Books of Our Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMay’s Cookbook Club Pick Is BraveTart, One of the Greatest Dessert Books of Our TimeWe’re throwing a cookbook club tea party and it’s going to be sweet.By Alex BeggsMay 1, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf you find yourself in a room full of friends in front of a table covered in cakes, cookies, puddings, and pies, things in your life, I’d venture to say, are heading in the right direction. This is why we chose Stella Parks’s BraveTart, the 2017 bestseller and James Beard award-winning dessert cookbook, for our May Bon Appétit Cookbook Club pick.We wanted a table of cake, an excuse to throw tea party, and a chance to dive deep into America’s sugary history. BraveTart isn’t a swanky bakery cookbook or a cheerful blogger’s “sugar addiction” on display, it’s dessert scholarship. I’d argue that no other dessert cookbook has pulled off such a feat—giving a full historical analysis of Oreos before offering an at-home recipe better than the original—and certainly not with such humor. BraveTart is a blast to read, an adventure to cook from, and one of the most essential cookbooks in the modern cookbook canon alongside Salt, Fat, Acid, Heat, The Food Lab, and Six Seasons.Think I’m exaggerating? Here’s what Parks, who started off as a pastry chef in Lexington, Kentucky restaurant kitchen, does in BraveTart (named after her blog). Say she wants to make the quintessential chocolate chip cookie. Before she starts sifting flour and chopping chocolate, she goes to the library. She calls up some historians. She buys a freaking antique chocolate grater at AUCTION. She (probably) flips off Wikipedia and lazy writers whose shoddily researched posts she comes across on a fruitless Google search. In BraveTart, she gives us the cookie’s complete cultural context: She tells us how chocolate rose to popularity in American kitchens, how drop cookies became all the rage, how grating chocolate with this tricky tool snuck chocolate into cookies, and finally, how Toll House and Nestle took credit for the invention of the chocolate chip cookie as we know it. Meanwhile, Parks is literally bleeding from the knuckles replicating early 20th century chocolate “jumbles.” SHE DID THE RESEARCH. She sets the record straight! Then you turn the page and boom, fantastic, guaranteed delicious recipe—with a few variations (Maple walnut! Gluten-free! Malted!) for extra credit.Parks’s Nutter Butter cookies (homemade = so much better).\nPhoto by Penny De Los SantosThe book pays homage to classic homemade desserts like peanut butter cookies, apple pie, and red velvet cake, as well as packaged classics like Twinkies, Little Debbie Oatmeal Creme Pies, and yeah, Oreos, whose four-page controversial history is nothing short of riveting. Recipes range in difficulty, like a banana pudding that even offers a recipe for homemade Nilla Wafers if you want to go all out. A Reese’s Peanut Butter Cup will never taste the same after you read this book, and you’ll realize there is only one Philadelphia cream cheese to rule them all. The vintage ads for Swans Down cake flour and Karo corn syrup will transport you back in time, while the close-up photos of whipped cream dollops and gooey melted chocolate will shove you into the kitchen. Parks loves dessert so much she dedicated her book to midnight snacks. And so we’re happy to dedicate our monthly gathering to her fantastic cookbook. It’s going to be a sweet one.Buy it: BraveTart: Iconic American Desserts, $24 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubCookbooksDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-01", "author": ["Condé Nast", "Alex Beggs"]}