{"id": "6537ed681bf9925ddafa3bb8c77b4ce3", "url": "https://www.bonappetit.com/recipe/chocolate-pizzettes-cookies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Pizzettes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssuePizzettesBy Chris MoroccoDecember 1, 20204.4(39)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“As a kid I spent Christmases tearing around my grandmother’s house, rattling dish cabinets and nerves, fists full of green-tinted, crumb-trailing buttery spritz cookies,” says Chris Morocco. “Cookies were my grandma’s version of a Christmas bonus: doled out to, or withheld from, family and friends. Even after she passed away, nobody dared mess with her recipes, least of all the pizzette, an Italian classic with fudgy texture, piercing bittersweet chocolate, almonds, citrus zest, and a heady undertone of cinnamon and clove. But perhaps a bit dry? A touch too much clove? My first attempt at an overhaul fell flat and I scrapped it, fearing angry Nonna vibes. But this year I didn’t hold back. I made the dough more like brownie batter, used butter instead of oil, and took out the coffee. Buttery, rich, and balanced…who could be mad about that?”IngredientsMakes about 20Cookies¾cup raw skin-on almonds1½cups (188 g) all-purpose flour1tsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½cup (1 stick) unsalted butter¾tsp. ground cinnamon½tsp. ground cloves½tsp. ground nutmeg½cup (100 g) granulated sugar¼cup Dutch-process cocoa powder1large egg1large egg yolk4oz. bittersweet chocolate chips (about 1 heaping cup)1tsp. finely grated lemon zest1tsp. finely grated orange zestGlaze and assembly2oz. bittersweet chocolate2tsp. unsalted butter⅔cup (75 g) powdered sugarPinch of kosher saltPreparationCookiesStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Toast almonds on a rimmed baking sheet, tossing once, until slightly darkened in color and fragrant, 7–10 minutes. Let cool, then finely chop. Set aside. Increase oven temperature to 375°.Step 2Meanwhile, whisk flour, baking powder, and salt in a medium bowl. Melt butter in a medium saucepan over medium heat. Stir in cinnamon, cloves, and nutmeg. Remove from heat and let sit 5 minutes to infuse.Step 3Whisk granulated sugar and cocoa powder in a large bowl. Pour in spiced butter, scraping pan so you don’t leave any spices behind, and whisk vigorously to combine. Add egg and egg yolk; whisk vigorously to combine. Mix in dry ingredients, then almonds, chocolate chips, lemon zest, and orange zest. Turn out onto a clean surface. Divide in half, then roll each half into a log about 1½\" wide. Flatten logs to 2\" wide and slice on a diagonal into 1\"-wide cookies. Divide between 2 parchment-lined baking sheets, spacing at least 1\" apart.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until firm around edges but still soft in the middle, 8–10 minutes. Let cool.Glaze and assemblyStep 5Melt chocolate and butter in a small heatproof bowl set over a small saucepan of barely simmering water (do not let bowl touch water), stirring occasionally, or melt in a small microwave-safe bowl in a microwave in 20-second bursts, stirring between bursts. Add powdered sugar, salt, and 2 Tbsp. boiling water and whisk until glaze is smooth and glossy.Step 6Dip tops of cookies into glaze and let sit, glaze side up, on a wire rack until glaze is set, about 2 hours.Step 7Do ahead: Pizzettes can be made 5 days ahead. Store airtight at room temperature, or freeze up to 1 month.How would you rate Pizzettes?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleMy family made pizzettes and a few other cookies for every holiday and weddings. I have been making them for years from my mothers recipe. I decided to try his one and it was good. My family put the orange flavor into the glaze instead of the cookie. I use orange oil because it tastes more natural. Either way they are delicious! I followed this recipe. They are hard to roll into a log and cut no matter which recipe you use.  I did roll them  and it was ok. Rather than cut the amount of nuts and chocolate chips because those things make the cookie, a couple of years ago I decided to scoop them.  It works. They made them look great so I wonder how they did it because they're not a pretty cookie. The glaze does wonders for them. \nBecause of the spices and citrus it's fun to see peoples reaction to  the flavor.  Chris L.A., Ca.1/10/2021These were really good. My housemates couldn’t get enough of them. Only changes I made were halving the spices, and adding finely chopped dark chocolate instead of chips. Dough was a little tricky to roll out, but nothing that a careful hand couldn’t manage. A sharp chefs knife worked well for cutting them. I also refrigerated them on their baking sheets for about 15 min before baking because I was worried about them melting in the oven. They still collapsed a little in the heat, so I think next time I’d chill them for about 30 min. 10 min in the oven made for a really nice, fudgey cookie with fun textures and flavors. I’m not usually a huge icing fan but in this case I think it really makes the cookies sing.LGPortland, OR1/8/2021Is it just me, or is the new \"print-ready\" format a huge failure? The amount of space between ingredients and steps wastes an inordinate amount of paper. I end up having to save as PDF and then go in with Adobe Acrobat pr and completely reformat the whole recipe and add in the now-missing photo. :-( This new endless scrolling format trend on websites makes for a needlessly tedious and exasperating user experience that makes me not want to try the darned recipes. Whether you choose to print or use a tablet, the formatting makes it really hard to follow a recipe. \n\nAs for the cookies; thanks to the GF baker for their tips as I have a gluten-sensitive roommate I'd like to make these for. I am assuming from the (rather vague) instructions that the intent is to cut these along the lines of a biscotti? But given the number of reviewers who had issues rolling out the logs, it sounds like it may be more trouble than it's worth, and patting them out into a sheet then cutting them as oblong bricks might be easier? In any case, I'll give these a try as written with the \"chop the nuts and chips first\" addendum and see how they come out. Many thanks, reviewers, for your input and detailed experiences with this (and other) recipes!SuzinsfSan Francisco1/7/2021I followed the recipe exactly, resulting in a crumbly dough which would not hold together in logs. I added another egg and a little more butter which helped moisten the dough enough. The end result was a delicious cookie. The orange zest in the chocolate is decadent and tastes even better two days after baking.DavidWeaverville, NC 1/3/2021Not a fan of this cookie at all. The dough was too crumbly, didn’t shape well, and impossible to cut. Flavors were off. Never had such a dismal recipe from BA before.AnonymousLos Angeles, CA12/31/2020Delicious!  I followed the recipe exactly except for pulsing the chocolate (I put it in the freezer while I prepped everything else) and the almonds together in the food processor as mentioned by a couple reviewers.  The dough was easy to work with, and the cookies were easy to slice.  I did use an extra piece of parchment paper to help roll the dough into logs (I wrapped the parchment around the dough and rolled it back and forth on the counter).  Beautiful combination of citrus, spice, and chocolate.  I will definitely add this to my holiday cookie repertoire!blackcurrant72Utah12/28/2020These turned out amazing - followed the directions to a T.  I loved the mix of spices and chocolate. I only wish I had doubled the recipe. L and LAlbuquerque12/27/2020One last comment- I misread the butter amount in the chocolate topping, assumed it was 2 Tablespoons, not teaspoons as the recipe states and topping was still perfect. Perhaps  teaspoons is a misprint...? I’ll stick with my error and continue to use Tablespoons.Ellen W12/26/2020Tasted delicious, just the right amount of spices. I used zest from most of 1 lemon and 1 orange, did not measure, and Cup 4 Cup gluten free flour. I had the same problem as most people with the dough not holding all the chips and nuts. It’s nice to bite into the larger chunks of nuts and chip so I’m not sure chopping in the food processor would be a good solution as people have suggested (also, who wants another item to clean). I used my hands to mix the dough and plastic wrap to try to shape the logs; the cookies don’t hold well together, especially when slicing. The dough was definitely NOT brownie like consistency. However, the end result was DELICIOUS and I will make again next winter. Any improvements/pro tips on the recipe would be welcome.Ellen W12/26/2020OMG, all of these reviews made me very nervous, but these pizzettes are delicious. Good tips from the bakers here: yes, DEFINITELY put the chocolate chips and almonds in a food processor (I didn't even end up needing the entire mixture). Be careful not to over-bake them. As the author wrote, they're based on an old Italian cookie recipe (which I never think of as soft), which s/he reworked to be softer. But it's a delicate balance. I couldn't \"roll\" them, but pressed them into a kind of log shape before slicing. Great flavor and will definitely be lovely with coffee on Christmas morn'!Kerri A.Brooklyn, NY12/23/20202 TEAspoons of butter for the glaze? Is that a misprint? Sure it's not 2 Tablespoons?ChrisPhiladelphia12/20/2020Dough turned out great, flavor is good, complex adult cookie perfect w/ coffee...but damn are they unfortunate looking.\n Like 💩. 😳\n Next batch will be balls, this was a hard sell to my crew. AlicaSouth Florida 12/16/2020I was really excited to make these, but the experience was less than satisfying. I printed the recipe right when it came out, so I hadn’t read any of the reviews, but when I was trying to roll the dough, it was so dry that I came to check them to see if it was just me.  Clearly not.  I really agree with other commenters. Blitz the almonds and chop the chocolate. Or just find a different recipe, unfortunately. They were basically inedible, they were so dry. I triple checked the instructions and weighed everything, but they just didn’t work. The glaze helped a little with the dryness, but not enough to really make me want to eat them. AnonymousDenver, CO12/12/2020These are incredible!  I hesitated to make them after reading the reviews, but I'd already purchased the ingredients so, why not?  I weighed the flour, sugars, and chocolate chips, and carefully measured the other ingredients.   The dough wasn't too dry, and it shaped into logs beautifully. I shaped the dough on parchment paper that was printed with 1-inch grids, so shaping it to the size in the directions was not too difficult.  I was able to use a sharp, thin bladed knife to cut through the chocolate chips, nuts, and dough, and they transferred to the baking sheet with no problems.   It's rare that I follow a recipe exactly, but I did this time, and I'm pleased with the result.  In the future though, I won't bake them as long as I did this time.  I didn't want to under bake them, so I ended up baking them a little too long.  I'll also not bother to cut them on the diagonal and might shape and cut the dough so the cookies aren't quite as big as in the instructions.  I've had my share of baking fiascos in the past 60 years, but this wasn't one of them.AnonymousNorth Richland Hills, TX12/11/2020Ok so the recipe says to put the oven racks in the upper and lower thirds of the oven but doesn’t say where to toast the almonds once thus configured. ???  I suppose the instruction is just for the baking. J. EalyRedondo Beach, CA12/11/2020Explore Bon AppétitCookieDessertItalian AmericanAmericanChocolateOther IngredientsSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Chris Morocco"]}