{"id": "655026a4a2ef20747c911b0480132880", "url": "https://www.bonappetit.com/recipe/crispy-mushrooms-with-creamy-white-beans-and-kale", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Crispy Mushrooms and Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Mushrooms With Creamy White Beans and KaleBy Chris MoroccoOctober 9, 20194.6(54)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintIf you’ve ever tried maitake mushrooms, then you already know this, but they have an unbelievably rich flavor and aroma of piney forest floor and fresh fallen leaves. They are, in a couple of words, very good, and this recipe celebrates everything we love about them.Ingredients2 servings6Tbsp. extra-virgin olive oil, divided4oz. maitake mushrooms, broken into large pieces4oz. shiitake mushrooms, cut into ½\" slicesKosher salt114.5-oz. can cannellini beans, rinsed, drained2Tbsp. fresh lime juice, plus wedges for serving2garlic cloves, divided4scallions, cut into 1\" pieces1bunch Tuscan kale, center ribs and stems removed, leaves torn½cup crumbled feta cheese1Tbsp. toasted sesame seeds1cup cilantro leavesPreparationStep 1Heat 2 Tbsp. oil in a large skillet over medium-high until shimmering. Add maitake and shiitake mushrooms and cook, tossing occasionally, until browned and crispy, 8–10 minutes. Season with salt and transfer to a plate.Step 2Meanwhile, purée beans, lime juice, 3 Tbsp. oil, 1 garlic clove (if it’s a large one, you may want to just use half), and 3 Tbsp. water in a blender until smooth, adding more water by the tablespoonful as needed to loosen if it doesn’t want to cooperate in blender. Season with salt.Step 3Heat 1 Tbsp. oil in same skillet over medium-high. Add scallions and remaining garlic clove and cook, tossing, until just beginning to brown, about 1 minute. Add kale and cook, tossing often, until wilted and crisp-tender, 3–5 minutes. Season with salt. Transfer to plate with mushrooms.Step 4Divide bean purée between bowls. Top with greens, feta, mushrooms, sesame seeds, and cilantro. Serve with lime wedges alongside.How would you rate Crispy Mushrooms With Creamy White Beans and Kale?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleI made this today and it was sooo delicious. It's really versatile and works as a main dish for a vegetarian/vegan dinner. I'm in an Italian palate mood these days so I made very minor tweaks. As another reviewer mentioned, the beans are very creamy so I didn't use any cheese. I didn't use a can, I soaked and boiled the beans in water, bay leaf, celery stick and made an herb sachet with rosemary, celery seeds and thyme. I used the bean broth to thin out the purée and added some crushed red pepper to give it a zing. I swapped the lime with lemon juice.  I used porcini  and portobello mushrooms because that's what I had in the fridge. And instead of sesame seeds I toasts some pine nuts and finally I topped the whole thing with homemade pesto. It was delightfully delicious and will definitely make it again.RolalaLos Angeles, CA1/11/2022I honestly thought this was incredibly bland and mushy. Everything was kind of the same texture, and feta seems like the wrong flavor profile for this dish. If I made it again I think I would sub in toasted almonds or pistachios for something crunchy and probably leave out cheese entirely? It’s already creamy from the beans.jillNew York10/18/2021This was really good. I have made it twice and the second time I made a few changes: I added a head of roasted garlic and some sun dried tomatoes to the bean purée and heated it up before serving. It tastes better warm. I also topped it with toasted pine nuts and shaved pecorino cheese since I didn’t have feta.  The second time I used shallots instead of scallions and liked it better. Jennifer 3/28/2021This is a winner and will be a go-to for me from here on out. Super easy, only needed 1 pot, minimal prep and simply delicious! I used pre sliced mushrooms and pre chopped kale to make prep work a breeze.  I am vegan and prefer simple dishes like this that aren't so grain forward, though I might try Jennifer's suggestion below and try the left overs on some toast tomorrow :-) highly recommend!KateNY2/5/2021Delicious! I had to add a little extra salt on the top but otherwise it was perfect.\nI also tried it all on top of toast for lunch and it was a real winner. I felt like I was at a cafe having a fancy toast.Jennifer H.New York1/26/2021I made this today and it was fantastic. I am not a huge fan of kale, but we get it in our farm share and I'm always looking for new recipes to make it more tolerable to my pallet. This was a winner. \nHowever, the paucity of legumes called for in this recipe is an obscenity. The meager purée harkened to an age of famine, and was an affront to humanity, decency, and general good sense. A fivefold increase in legume purée is requisite for minimal reparations of this indignity.MattyCA12/4/2020Great recipe. Loved it!Diane ZSeattle11/16/2020I made this today because I had maitake mushrooms and kale to use up. This was the first time I'd used maitake mushrooms (I got them in my weekly box from ImperfectFoods).  I did some improvising because I didn't have all the ingredients: I skipped the shiitake mushrooms because I didn't have any,  I used sliced red onions instead of shallots, I used a few pine nuts instead of sesame seeds, and the only can of cannellini beans I had was \"S&W Tuscan Style Savory Sides Sauced Cannellini Beans with Olive Oil, Garlic & Herbs\", so I blended that up with a hand held blender without adding anything else to them. I blanched the kale in the microwave first because I thought it would be bitter.  It all turned out great, I think, and I would make this again.   I would of course try to have all the proper ingredients first!CNPEscondido, CA11/9/2020Delicious lunch! Can't beat some crispy mushrooms... Grocery store didn't have lacinto kale so I used fresh baby kale and arugula instead. I liked it. Better the second day with parsley instead of cilantro on top. AnonymousSan Diego10/28/2020AMAZING!  Flavor profile an absolute win w/hedgehog & shiitakes from farmers market.  Lime in beans is a new awe inspiring component.  Feeling thankful!!  Light & hearty in same bite - happy to  bean there!KayLaurenLincoln Park, Chicago8/3/2020Overall this was a great recipe, but not amazing. Maybe that's just because I'll never find kale amazing but I had some in my fridge to use. But I would definitely make again. The white bean puree was easy. I did use garlic cloves briefly sauteed in some olive oil with the beans prior to pureeing as others have said. Also the amount of olive was a little too high in calories for me, so I did 1 TBSP of olive oil and maybe 1/4 cup-ish of homemade chicken broth to make it smooth and creamy and it tasted super delicious. I did also use lemon juice instead of lime. I paired this recipe seared scallops and thought the lemon worked better, but I'm sure the lime would be delicious maybe paired with blackened shrimp?  Overall I would definitely recommend this recipe, but it just was a knockout 5 star recipe for me. (But not every night can be!)cshll31San Diego, CA7/26/2020Bean sauce is so good. Recipe made a lot more than 2 servings; I would say 4 servings. It looks very nice on a serving platter layered like this: bean sauce, then kale, then mushrooms, then cilantro and sesame seeds. Ohioan5/29/2020We made this recipe last night for a big family dinner.  We doubled the recipe and tripled the bean puree (which made a great dip for corn chips today).  We used shallots instead of scallions; delicious.  We also served it with a filet of baked salmon. Our adult children thought it was very fancy! JoJoYoungVirginia Beach3/28/2020I loved this. Made a few changes per other comments and my taste. Doubled the recipe. Spruced up the beans with a quick sauté and some bone broth. Used lemon (generously) instead of lime. Left off the feta, but added roasted Brussels sprouts for texture. The scallions are a revelation in this dish!sadie medleyPDX1/12/2020Loved this recipe! I made a few adjustments – unfortunately there were no Maitake available in my area, so I used portobello. I also made a garlicky polenta instead of the white bean puree, and cooked the beans with onions, garlic, green onions, then added the kale to pan. So it ended up as a creamy polenta topped with white beans, onion, kale green onions and mushrooms. So good and will definitely make again!FeedResponsiblyAtlanta, GA12/9/2019Explore Bon AppétitMushroomVegetableMaitake MushroomShiitake MushroomBeanCannellini BeanWhite BeanKaleLeafy GreensFetaCheeseCilantroHerbs & SpicesWeeknight MealsOne-Pot MealsMainVegetarianGluten-FreeNut-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-09", "author": ["Condé Nast", "Chris Morocco"]}