{"id": "655d36e4ac202d48d8b43b9a578989c7", "url": "https://www.bonappetit.com/story/amazon-prime-day-vitamix", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Amazon Prime Day Means You Can Snag a Vitamix at a Serious Discount | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingAmazon Prime Day Means You Can Snag a Vitamix at a Serious DiscountThe Vitamix 5200 Blender is on sale for just $298.By The Healthyish TeamJuly 16, 2018FacebookTwitterEmailCourtesy of VitamixFacebookTwitterEmailUpdate: The Vitamix sale has ended, but to see what other kitchen products are left for Prime Day, click here.Some kitchen tools change everything. A good blender means the difference between grainy smoothies and impeccable green juices, suspiciously chunky soups and beautifully smooth purées. BA senior food editor Chris Morocco puts it best: \"If, like me, you are the kind of person who uses their blender a lot, it’s just a matter of time before you come to see the world of blenders as I do: There’s the Vitamix, and there’s everything else.\"Of course, there's one thing standing in the way of attaining the Holy Grail of blenders: the price. Dropping $450 on a kitchen appliance is a tough pill to swallow, even with the promise of perfectly smooth purées.  So when we saw the Vitamix 5200 Blender on Amazon Prime Day sale for just $298 (originally $450), we sounded the alarm.  Then immediately started daydreaming about putting that blender to good use. These are the recipes we're going to make first.1. Seriously Delicious SaucesWhen it comes to making luxuriously creamy dressings and sauces, blenders get us there. Round out your next grain bowl with tahini-ranch dressing, an impossibly creamy vegan miso-hemp dressing, or the golden raisin pesto that stole our hearts.2. The Smoothest SmoothiesWe promise: You won't notice the kale nearly as much when it's been seamlessly blended with avocado, pineapple, and coconut. Also try a refreshing one-ingredient coconut licuado and a stunningly purple blueberry, cashew, lime smoothie.3.  Perfectly Puréed SoupsWhen the inevitable August heat wave hits hard, lay out with a glass of green gazpacho.  Then make spiced coconut soup, and cauliflower-cashew soup until your teeth have totally forgotten what it feels like to chew.4. New School SlushiesHealthy slushies exist, and they're nothing like the 7-Eleven Slurpees we know and love. We like to blend coconut water with an array of frozen fruits for the chillest slushies around. They whip together in a blender in seconds, and scale up for big batches to keep your next summer party happy and hydrated. And if you want to add a shot of mezcal to that Beauty Food Mango Slushy, well, that's more than fine by us.5. Creamy DessertsWhen summer gets serious, we rely on blenders to create creamy desserts that won't weigh us down. We love everything from banana-based \"nice cream\" and mango-yogurt pudding to a cashew-based chia pudding that tastes like ice cream—but is virtuous enough to have for breakfast.Buy it: Vitamix 5200 Blender, $298 (originally $450)Amazon Prime Day begins at 3 p.m. ET time on July 16 and ends on 3 a.m. ET on July 18. You need to be a Prime member to get the deals. Check out all the best kitchen deals right here.Explore Bon AppétitHealthyishAmazon Prime DayblenderShoppingRead MoreshoppingThe New Vitamix Blender Is Cheaper than the Pros and Just as AmazingBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast", "The Healthyish Team"]}