{"id": "6568182035c8cc45b37072332cb64f63", "url": "https://www.bonappetit.com/story/how-to-thanksgiving", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "This Thanksgiving, Forget the Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Thanksgiving, Forget the RulesSkip the turkey, go big on the sides, or order takeout. Our November issue is all about doing Thanksgiving your way.By Dawn DavisOctober 30, 2021FacebookTwitterEmailPhoto by Kelly Marshall, food styling by Susie Theodorou, prop styling by Sophie StrangioFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.In college I lived the dream and took advantage of my university’s study-abroad program. Atop a windy road in Florence, I settled into la dolce vita. It’s nearly impossible not to sound clichéd when describing that first encounter with Italian life. Like so many before me, I loved the idea of eating pasta virtually every night, loved the experiential learning that involved bold Tuscan reds and bright proseccos—to say nothing of that special indulgence, bistecca alla Fiorentina. Come Thanksgiving I was so happy that I didn’t fret when roast duck instead of turkey graced the table. It didn’t matter to me because there were still plenty of potatoes, veggies, rice (okay, risotto) and, of course, desserts.Not everyone shared my “when in Rome” attitude. Indeed, one classmate actually burst into tears when he realized there’d be no turkey. I learned then there are three kinds of people when it comes to Thanksgiving. Those who ignore tradition to do their own thing—and Alex Beggs’s singularly moving piece on grief encourages anyone who’s had a difficult year to do just that. Those who think it’s sacrilege to have anything but turkey as the main attraction. And those, like myself, who’d much rather fill their plate with sides.Luckily, the BA team is evenly split. Some love turkey and are wild about Kendra Vaculin’s recipe for Sheet-Pan Turkey and Gravy. Others go big on the sides. We indulged our potato obsession this month, from Christina Chaey’s Cacio e Pepe Rösti to Brad Leone’s Garlic-Miso Butter Mashed Potatoes, which was inspired by his forthcoming cookbook, Field Notes for Food Adventure. We also have recipes for Bitter Greens With Cranberry Dressing, a subtly spicy Chorizo and Calabrian Chile Stuffing, and more. If you’re still searching, check out our expansive recipe archive.Speaking of Calabria, we have a look at Stanley Tucci’s new book, Taste, and the scoop on how he celebrates Thanksgiving. Like Tucci, recipe developer Peter Som shares how his upbringing influences the big meal—his mouthwatering menu draws from his Chinese heritage. As beautiful as they are tasty, these dishes are perfect for the holiday table or any table that’s meant to impress.Because no Thanksgiving would be complete without desserts, we brought in esteemed baker and boss lady Cheryl Day. If anyone wants to know what they can bring to your table, send them this feature (sweet potato cake with chocolate ganache, anyone?). And unless you want to see someone break out in tears at your table, warn them if you’re going to skip the turkey.Explore Bon AppétitLetter From The EditorCultureThanksgivingTurkeyGravyRead MorerecipesThe 69 Best Thanksgiving RecipesGallery69 SlidesBy Nico AvallecookingBehold! Our Easiest Thanksgiving Dinner Menu YetGallery6 SlidesBy Kendra Vaculinrecipes41 Thanksgiving Potato Recipes We Can’t Live WithoutGallery41 SlidesBy Mehreen KarimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-30", "author": ["Condé Nast", "Dawn Davis"]}