{"id": "65894237782b3708586c3d8b544cb123", "url": "https://www.bonappetit.com/story/donabe-season", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "One Japanese Donabe, One Million(ish) Options | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOne Pot, One Million(ish) OptionsA Japanese donabe makes it simple to whip up beautiful, nourishing, riffable meals.By Christina ChaeyOctober 24, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Rebecca JurkevichFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,From late October to early April, one piece of cookware takes up permanent residence on my stovetop, quietly burbling up hot pots and soups on cold nights. People message me on Instagram whenever I post photos of my donabe: What is it? (A Japanese earthenware pot used for cooking and serving.) Where did I get it? (Toiro Kitchen in L.A.) What do I make in it? (Everything!)At a basic level, a donabe is a pot that just happens to be pretty enough to double as a striking serving piece. High-quality versions have thick walls that effectively retain heat and are especially good for gently cooking the vegetable-heavy meals I want constantly this time of year.When I’m short on time, I opt for a quick nabe, or hot pot, which starts with a light broth that I season with good soy sauce and mirin. My broth of choice is often dashi, an essential Japanese stock of dried bonito flakes, kombu, and water that gives dishes like miso soup their subtle briny flavor. When I need dinner to be even more hands-off, I’ll make a vegan mushroom dashi by placing dried shiitakes and a strip of kombu in a big jar of water and refrigerating it all overnight. The resulting golden broth is savory and lightly earthy. It lacks the body of a lipsmacking chicken stock, which is exactly why I like it: A bowlful leaves me feeling satisfied but not weighed down.Photo by Emma Fishman, Food Styling by Rebecca Jurkevich When warmed in the donabe, the dashi creates a small hot tub environment for whatever kitchen-sink assortment of vegetables and protein I’m cooking. Some days I may have peeled, seeded, and sliced kabocha or butternut squash already prepped and ready to drop into the simmering broth. While the thick squash starts cooking away, I’ll quickly tear greens and mushrooms, slice tofu, and boil a little pot of noodles like soba to slip in right before I’m ready to eat. In those few minutes I enter an almost flow-like state, moving seamlessly from cutting board to stove; dinner is ready in minutes.Though this recipe is a nabe I make often, it’s meant to be a guideline not scripture. That’s the beauty of this style of cooking: Each rendition is slightly different from the one before. But no matter how much you mix it up, you’re guaranteed a meal that’s vibrant and delicious, nourishing yet light, and that leaves you feeling good inside. If there’s one thing I want you to take away from this, it’s that you can absolutely riff without a recipe. And that you should have a donabe of your own, of course.May your weekend be broth-filled,Christina ChaeyAssociate editorMake the recipe:Fridge Clean-Out Nabe With Mushroom DashiChristina Chaey’s mushroom dashi can go with whatever vegetables and proteins you have in the fridge. It’s her favorite cold-weather meal.View RecipeExplore Bon AppétitWhat's Chaey Cooking?HealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-24", "author": ["Condé Nast", "Christina Chaey"]}