{"id": "659174cd4d63b451a7fcad5dc451ea6f", "url": "https://www.bonappetit.com/recipe/rose-and-yogurt-panna-cotta", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Rose and Yogurt Panna Cotta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueRose and Yogurt Panna CottaBy Vivek SurtiSeptember 17, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrintChef Vivek Surti of Tailor in Nashville, No. 7 on our 2019 Hot Ten list, says: “I first tried falooda at an ice cream parlor near my grandmother’s sewing machine shop in India. I never had anything like it in the States: a milkshake with rose syrup, pistachios, raisins, and crunchy noodles. I loved it. For the restaurant, I wanted to put all those flavors into a dessert.” This unconventional panna cotta uses tangy yogurt in the base, which helps offset the sweetness of the rose syrup.Ingredients8 servings½cup raw pistachios1envelope unflavored powdered gelatin (about 2½ tsp.)1½cups plain Greek yogurt1Tbsp. rose syrup1¼cups heavy cream, divided½cup sugar1Tbsp. basil seeds (tukmaria) or chia seeds (optional)½cup golden raisinsBlackberries (for serving; optional)PreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 7–9 minutes. Let cool, then coarsely chop. Set nuts aside.Step 2Whisk gelatin with ¼ cup water in a small bowl to combine. Let sit 15 minutes.Step 3Mix yogurt, rose syrup, and ½ cup cream in a medium bowl to combine. Heat sugar and remaining ¾ cup cream in a small saucepan over medium, stirring often, until mixture is hot and sugar is dissolved, about 2 minutes. Whisk in gelatin mixture, then pour into yogurt mixture and whisk to combine.Step 4Divide panna cotta mixture among eight 4-oz. ramekins, small bowls, coffee cups, or any small vessel you’d like to use for serving. Place on a rimmed baking sheet and chill until set, at least 2 hours.Step 5If using, scoop a spoonful of basil seeds into a small bowl; pour in water to cover. Let sit until gelatinized, about 10 minutes.Step 6To serve, top panna cottas with basil seeds, raisins, a few blackberries, if desired, and reserved pistachios.Step 7Do Ahead: Panna cotta (without toppings) can be made 2 days ahead. Cover and keep chilled.How would you rate Rose and Yogurt Panna Cotta?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI haven't made this yet, but I do make a wafer cake that uses mascarpone and rose preserve in its layers.  Rose is such a wonderful flavor.  My great-grandmother made a salad of pink rose petals and lobster (this was a long time ago when lobster was still considered poor man's food) that I recreated a few years ago that was just delicious. Kudos to Bon Appetit having rose recipes. I will definitely make this soon as it has my favorite ingredients.arbpen9300Glendale7/30/2020I'm Italian, a real Panna Cotta purist. I was nervous about this recipe..... But I will definitely be making this again soon! This is the type of Panna Cotta you could eat for breakfast, lunch, or dinner. The Greek yogurt gives it such a unique taste and texture and the toppings match oh so well👌🏽. Thank you Chef Surti, you are a Panna Cotta God.Gemma GroverSalt Lake City10/6/2019Explore Bon AppétitPanna CottaPuddingDessertPistachioNutRaisinDried FruitFruitYogurtOther IngredientsGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}