{"id": "65951aa3d13d8343f9b73433a1e1ef3c", "url": "https://www.bonappetit.com/story/healthy-clubbing", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Healthy Partying Is the New Frontier of Nightlife | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWelcome to the Underground World of Healthy ClubbingClubs in NYC are incorporating wellness practices to help ravers find self-care after dark.By Arielle GordonMay 2, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAt Public Records, a new “listening bar” in Brooklyn’s Gowanus neighborhood, the owners are so nerdy about sound that many advertisements for the space feature glamour shots of its speakers. But while the main room is set to host an impressive lineup of DJs, the bright, airy cafe and bar attached is just as much of a destination. The beverage menu offers an array of housemade non-alcoholic tonics like blood orange celery soda and coconut water chamomile. And with food options like “no bone” mushroom broth and spelt with summer squash debuting this week, a night out at Public Records feels legitimately healthy.Public Records' blood orange celery soda\nPhoto by Emma FishmanFor many, going out and dancing have always been forms of stress release, ways to escape the anxieties of everyday life. But now more and more clubs are intentionally incorporating wellness practices—like deep listening, adaptogenic cocktails, and plant-based cuisine—to give partiers even more ways to find self-care after dark.At Nowadays, a sprawling nightclub complex in Ridgewood, Queens, you can lie on a woven blanket and listen to ambient music during their Thursday night Planetarium, dance until dawn on the same wood floor on Friday and Saturday, then bring your kid or your dog to the outdoor space on Sunday afternoon. The whole venue feels nearly spa-like, with salt lamps, kombucha on tap, and even, this past winter, a mobile outdoor sauna.Vibamins's lineup of rave-friendly smoothies\nPhoto by Laura MurrayHenry Rich, who owns several Brooklyn restaurants including Metta and Rucola, is a food and beverage partner at both Nowadays Public Records. For him, health and wellness are especially important in a club: “You're up until eight in the morning, so caffeine is great, but it’s great if you can also have nutrients that will allow you to enjoy yourself all night and make you not feel terrible the next day,” he said. “Just living in New York, it's so important to refill the well that's constantly being drawn down.”For Nowadays co-founder Eamon Harkin, design elements like natural light were integral to the way he and his partner, Justin Carter, thought about the eclectic clubbing experiences they wanted to offer. “When we went looking for a place to build Nowadays, we wanted a place that had outdoor space and indoor space, and we wanted the indoor space to have some natural light. Those characteristics afforded us the greatest flexibility to create different experiences,” he said. “People are really craving an environment where they can switch off and just lower the noise levels in their lives.”Remedi Food founder Marie Bedross\nPhoto by Emma FishmanThe beverage offerings at Nowadays include “Vibamins,” non-alcoholic drinks with flavors like “Pre-rave” (featuring raw cacao and maca root for energy) and “Post-rave” (with 5-HTP and milky oat straw for winding down). Vibamins are the brainchild of Marie Bedross, whose catering company, Remedi Food, supplies plant-based foods like tempeh BLTs to all-night raves and venues around the city. Bedross’s goal is to introduce ravers to healthy eating when they need it most. “The only option [dancers] had was to dull themselves,” she said. “Let me make [them] sparkle a little bit.”For stud1nt, a DJ and producer who often performs at Nowadays’ Thursday night Planetarium, giving up alcohol redefined their relationship to clubbing. Planetarium is appealing to them because unlike the drinking-heavy culture of so many club nights around New York, “you don't have to be in this super party mode.” They compared it to the underground warehouse parties that used to be much more common in the city, where drinking was often much less of a focus.It took a cross-country move for journalist and event producer Michelle Lhooq to revisit her relationship to traditional party drugs. After moving from New York to L.A., “a place where you want to be outside during the day,” as she put it, she began to replace stimulants with weed. “It was amazing. I think my body felt like it was literally unwinding and unclenching,” Lhooq said. Inspired by her newfound practices, she started Weed Rave, a cannabis-fueled party that held its first New York rave on (when else?) 4/20 in a secret warehouse space, following its maiden voyage in L.A. earlier this year. For Lhooq, raving has always been a communal activity; adding events like CBD yoga and a cannabis cooking class opens up the community to those who might not otherwise venture out to an all-night dance party.Public Records co-founders Francis Harris and Erik VanderWal\nPhoto by Emma FishmanFor others in the nightlife industry, wellness is more about inclusivity. Event producer Brian Sweeney founded Ambient Church to be “a hybrid between a meditation class, a concert at a venue, and a techno party.” A nomadic concert series held in cathedrals across the city, Ambient Church pairs electronic music with light shows mapped onto the churches’ gothic details. The seated event often ends before 10 p.m., and its audience is just as likely to contain retirees as ravers. “There's people that like to go to meditation class, but they really don't like standing around in a venue. And then there's people who used to go to a lot of raves and nightlife, but they're trying to go to bed at a reasonable hour,” Sweeney explains of his audiences. By its very nature, the music at Ambient Church, whether it’s William Basinski’s atmospheric compositions or Suzanne Ciani's methodical Buchla synthesizer loops, encourages mindfulness. “It's about listening carefully and not waiting for the song to end or progress,” Sweeney said. “It's about being in the moment as it happens.”To Public Records co-founder Francis Harris, a DJ and producer who has incorporated meditation into his daily life, sustainable partying is the only way forward: “As you get older, the only pathway to happiness, I think, is to let go of the short term gains for long-term wellness.”The Nowaday's dance floor is a phone-free zone.\nPhoto by Laura MurrayExplore Bon AppétitHealthyishNew York CityPartyTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Arielle Gordon"]}