{"id": "65a73f8ca3b204530a20fbba55e551aa", "url": "https://www.bonappetit.com/recipe/spiced-chocolate-pumpkin-cake-with-spiced-pumpkin-glaze", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Spiced Chocolate-Pumpkin Cake With Pumpkin Glaze Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpiced Chocolate-Pumpkin Cake With Pumpkin GlazeChocolate cake, meet pumpkin cake. By Yossy ArefiDecember 6, 20204.4(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThis lightly spiced chocolate cake from Yossy Arefi's book Snacking Cakes is packed with pumpkin purée and features spices often found in Mexican chocolate. If you choose to use it, the pinch of cayenne adds a pleasing bit of warmth. You can also top the cake with 2 tablespoons granulated sugar mixed with 1/2 teaspoon ground cinnamon and another pinch of cayenne instead of the glaze. If you're making a loaf cake, halve the sugar-spice mixture.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8\" Baking Pan$25 At AmazonParchment Paper$3 At AmazonOffset Spatula$12 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonLarge Bowl$18 At AmazonSpatula$12.99 At AmazonCake Tester$3 At AmazonWire Rack$23 At BA MarketIngredientsMakes one 8x8\", 9\"-diameter, or 9x5\" cakeUnsalted butter or nonstick vegetable oil spray (for pan)2large eggs¾cup (packed; 150 g) light brown sugar1cup (230 g) plus 1 Tbsp. unsweetened pumpkin purée, divided½cup extra-virgin olive oil½cup plus 1 Tbsp. (or more) whole milk, divided1tsp. vanilla extract1¼tsp. ground cinnamon, divided½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more2pinches of cayenne pepper, divided (optional)½cup (45 g) unsweetened Dutch-process cocoa powder1cup (125 g) all-purpose flour1tsp. baking powder½tsp. baking soda½cup (85 g) bittersweet or semisweet chopped chocolate or chocolate chips1cup (110 g) powdered sugarPinch of ground clovesPreparationStep 1Place a rack in middle of oven; preheat to 350°. Butter or lightly spray an 8x8\" baking pan, 9\"-diameter cake pan, or 9x5\" loaf pan with unsalted butter or nonstick vegetable oil spray. Line pan with parchment paper, leaving overhang on all sides if using square pan or long side if using loaf pan. Use a parchment paper round on the bottom if using cake pan.Step 2Whisk 2 large eggs and ¾ cup (packed; 150 g) light brown sugar in a large bowl until pale and foamy, about 1 minute.Step 3Add 1 cup (230 g) unsweetened pumpkin purée, ½ cup extra-virgin olive oil, ½ cup whole milk, 1 tsp. vanilla extract, 1 tsp. ground cinnamon, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and a pinch of cayenne pepper (if using). Whisk vigorously until smooth and emulsified.Step 4Add ½ cup (45 g) unsweetened Dutch-process cocoa powder and whisk until smooth. Add 1 cup (125 g) all-purpose flour, 1 tsp. baking powder, and ½ tsp. baking soda and whisk again until incorporated. Using a rubber spatula, fold in ½ cup (85 g) bittersweet or semisweet chopped chocolate or chocolate chips.Step 5Pour batter into prepared pan; smooth surface with an offset spatula. Tap pan gently on the counter to release any air bubbles.Step 6Bake cake until puffed and a tester inserted into the center comes out clean, 45–55 minutes for square or round cake, 55–65 minutes for loaf cake. Transfer cake to a wire rack and let cool in pan 15 minutes. For square or loaf cake, using parchment overhang, lift cake out of pan and onto rack. For round cake, run offset spatula around edges of cake and turn out. Remove parchment and let cool completely.Step 7To make the glaze, whisk 1 cup (110 g) powdered sugar, a pinch of ground cloves, a pinch of kosher salt, remaining 1 Tbsp. unsweetened pumpkin purée, remaining 1 Tbsp. whole milk, remaining ¼ tsp. ground cinnamon, and remaining pinch of cayenne pepper (if using) in a small bowl until smooth. Glaze should be pourable. If it’s too thick, whisk in a few more drops of milk.Step 8Pour glaze over cooled cake and let sit 20 minutes to allow glaze to set before slicing.Step 9Do ahead: Cake can be made 3 days ahead. Store covered at room temperature.Adapted from Snacking Cakes by Yossy Arefi. Copyright © 2020 by Yossy Arefi. Reprinted with permission from Clarkson Potter. All rights reserved.How would you rate Spiced Chocolate-Pumpkin Cake With Pumpkin Glaze?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleMy taste buds were quite impressed with this cake. It was so moist and perfectly spiced. I raised my baking bar by baking this cake. I will definitely be baking another one soon to share with friends.BrigitteArizona11/16/2021I think the cake is really nice, moist, not too dense nor tender, and chocolate-y. Unfortunately the only purpose of the pumpkin in this recipe is to give moisture and some added nutrition perhaps. I didn't think it needed a glaze (although it was yummy) as the cake itself was already sweet ehough for my taste. I loved how easy it was to put together though. I personally would add perhaps more cinnamon and cayenne next time, maybe even black pepper would be nice. As-is it does not come across as a spiced or pumpkin cake, rather a chocolate one. I feel like I probably won't make this version of cake unless I happen to have extra pumpkin around, I'll just make a chocolate cake instead. But still a great recipe!!!!DChutoronto, canada10/27/2021I went off of the other reviews and upped the spice - 1 tsp cinnamon and 1 tsp of pumpkin spice in the cake and 1/4 tsp pumpkin spice in the icing. I was bummed I was out of cayenne, it would have been a nice addition. Make sure to be careful with the cloves in the icing; it's very easy to do too much! I am celiac so made some swaps for a GF version: 1 cup of bobs all purpose flour (includes xanthan), 1 tsp baking soda, and 1/2 tsp xanthan gum. I realized after the fact that I should have decreased the liquid a bit and added another egg but still came out absolutely delicious even if a bit dense. love this recipe because it uses basic pantry staples and was simple enough to bake on a weeknight after work! Madi Baltimore, MD10/26/2021A solid recipe! The pumpkin isn’t that noticeable, but it definitely adds a richness that I don’t think you’d get without it. Also, the cayenne is wonderful in this — it adds a toasty warmth that is very reminiscent of Mexican hot chocolate :) JessicaSioux Falls10/25/2021I thought this was a really nice fall loaf. I didn't have whole milk so subbed 50/50 heavy cream and oat milk in both the batter and the glaze, which worked fine. I also subbed chopped peanut butter cups for the chocolate chips. The pumpkin flavor is subtle; next time I might add some pumpkin pie spice. Don't rush the cooling before adding the glaze. Lauren DProvidence RI10/7/2021Well written recipe. Love the weight measurements in the instructions. Beautifully chocolatey. I used butternut squash instead of pumpkin, but the flavour was overpowered by the chocolate. Might need more pumpkin. While I got away with a pinch of cayenne in the batter, a little goes a long way in the glaze. I used a 9\"  cake tin and got a fairly short cake. More like a brownie. Still tasty though!AnonymousNairobi, KE3/8/2021A truly excellent cake--though I am a sucker for chocolate paired with warm spices. The pumpkin makes this cake extra moist! I couldn't stop cutting off bits to snack on as I walked by. I also made my cake gluten- and dairy-free using Almond Breeze Unsweetened Original Almond Milk and King Arthur Gluten-Free All-Purpose Flour. Textures and flavors are spot-on! Definitely will make it again, and probably soon!AnonymousFranklin, TN1/16/2021Great recipe! I made it in a bundt cake mold and only cooked it 30min. It was just perfect: moist, good balance with the glaze. I used a little more liquid for the glaze to achieve a pourable consistency. Definitely a keeper! AnonymousSan Francisco12/23/2020So good! I didn’t get the right consistency for the glaze, but it was delicious. I recommend. JJB12/13/2020This was so easy! And very delicious. Def not too sweet. Next time I’d add a bigger “pinch” of cayenne. Will be making again! JennNew York 12/11/2020I added more than a pinch of cayenne and a bit of nutmeg too - so delicious!Anonymous12/10/2020This was an easy and tasty cake. There was very little pumpkin flavored it could have used more spice.  It is a solid one bowl cake.AnonymousVT12/7/2020Explore Bon AppétitCakeDessertLoaf CakePumpkinSquashVegetableChocolateOther IngredientsFallSnackNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-06", "author": ["Condé Nast", "Yossy Arefi"]}