{"id": "65ab45365d63204daef9df68fcca7d29", "url": "https://www.bonappetit.com/story/yangs-kitchen-alhambra", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "I Fought L.A. Traffic Just for This Beef Noodle Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Fought L.A. Traffic Just for This Beef Noodle SoupAnd I’d do it again—that’s how much I love the version at Yang’s Kitchen.By Rachel KartenJanuary 6, 2020FacebookTwitterEmailPhoto by Jennifer ChongFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Before I even booked my flight to Los Angeles in November, I knew I was going to eat at Yang’s Kitchen. For months, I had been seeing its beef noodle soup pop up on my Instagram. And at this point, the weather was dropping in New York—and I needed it in my life. So when I got to L.A. (on a 90-degree day, no less), I drove all the way from Venice to Alhambra (a 40-minute journey on a good day) to meet the noodle-y bowl I couldn't stop thinking about.The soup is filled with a broth that’s beefier than a #GymBro. That’s because chef Chris Yang  simmers bones from Santa Carota cows (they eat grass and carrots!) for more than 24 hours. The wide, chewy noodles that bob in the broth are freckled like they’ve been getting sun, thanks to Grist and Toll’s freshly milled whole grain flour. Then there’s the beef shank and brisket, both braised to peak fall-apart-y texture. And the cilantro, the scallions, and the fresh chrysanthemum greens. And the fermented mustard green relish that I want to Oprah (a verb) to every dish I eat moving forward—“You get fermented mustard green relish! And you get fermented mustard green relish!” I’ll yell as I finish each dish with a generous dollop of the pickle-y condiment.So if you can’t tell by now, the bowl was everything I imagined it would be: deeply rich and satisfying, and exactly what I now crave on both 27-degree days and 90-degree days. Oh, and yes, I posted a photo of it on my own Instagram for all the other soup scrollers out there.Go there: Yang’s KitchenExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRead MorerestaurantsThis Restaurant Nearly Convinced Me to Move to Los AngelesBy Emma FishmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-06", "author": ["Condé Nast", "Rachel Karten"]}