{"id": "65abce126490016aed41d09d0964204e", "url": "https://www.bonappetit.com/story/costless-abundance-macaroni-grills-free-bread", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Incredible Costless Abundance of Macaroni Grill’s Free Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Incredible Costless Abundance of Macaroni Grill’s Free BreadBut how does it even make sense for them to offer this?By Sarah JampelApril 16, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.If I ever ate anything other than the free bread at Romano’s Macaroni Grill, I can’t remember it.I must have ordered the fettuccine Alfredo (what ten-year-old could resist) or begged my parents for the New York–style cheesecake, but the only food that is lodged in my mind all these years later is that bread: pleasingly square, scented with rosemary, glistening with oil like a competitive bodybuilder.It would land on the table sometime between when the server introduced herself, scrawling her name (Jessica, Rachel, Dani, Mel) backward and upside down on the paper-lined table in crayon so that each guest could read it, and when she took our orders. But almost as soon as the cracked black pepper, fresh from a mill the size of a baseball bat, hit the chartreuse olive oil, the bread was gone, torn to bits by grabby preteen hands.And then Jessica would bring another gleaming loaf. And another. It was the size of what I now know to be an iPad—enough for four people to demolish in minutes or for one person to slowly winnow away throughout the course of the meal. It was plentiful and fresh and free and the servers never grumbled about bringing more (or if they did, we never noticed, our vision clouded by carbs).I haven’t been to the Macaroni Grill in Timonium, a Baltimore suburb that, yes, sounds like a chemical element, since the celebration lunch after my fifth-grade graduation—which also happened to be my last social event with the cool girls before we headed to middle school, where I failed to maintain my social standing. But I still think of that bread fondly and, thanks to the internet, the world’s great connector, I know I am not alone.When you're here you're... oh wait, wrong chain of Italian-American restaurants.\nPhoto by Lisa DiederichThe Macaroni Grill’s rosemary peasant bread has made all of the internet's prestigious listicles of restaurants with the best free bread (including Buzzfeed’s “definitive” one) and inspired copy-cat recipes aplenty.And the company knows its power. Holly Wagstaff-Bellomo, vice president of marketing, told me that when the brand surveyed guests to find out the parts of the dining experience they valued most, “bread was one of the top things that was universally loved.” Macaroni Grill serves 100,000 loaves of its rustic-style rosemary bread per week (that’s over 5 million annually), which arrive parbaked and frozen from a centralized kitchen in order to maintain flavor and consistency. “It has to be handled in a certain way so that it has that crusty delicious outside but light and airy inside,” Wagstaff-Bellomo explained—not to mention that sending parbaked loaves accounts for variations in altitude across the 88 U.S. locations.We peasant-bread zealots (and, yes, I speak for all of us) don’t just love it because it’s free. But the fact that it’s so delicious makes its costless abundance all the more amazing. Is it wrong that I don’t remember any of the food we paid for? If that were the case, why would they serve free bread at all?Many people smarter than I am—namely Stephen Dubner and Steven Levitt of Freakonomics fame—have pondered this very riddle.On their podcast, the duo address a mountain of common conjectures. First, there’s the dessert theory: Free bread keeps customers from ordering cheap-ish desserts, which means the restaurant can turn the table over to another party faster. Second, the service theory: It staves off hanger and makes the servers’ jobs easier. Third, the drink theory: Salty food encourages customers to order drinks, on which restaurants earn a bigger margin.They then get into the addiction theory (the initial food opens a floodgate, spurring customers to order more); the theory of free fanaticism (we dumb humans simply love free stuff and those who provide it); and the peer-pressure theory (once one restaurant starts serving free bread, they have a competitive edge that drives other restaurants to do the same).Yes, yes, yes. This all made sense. These were the same hypotheses I had found in my very official Google research, scans of user-generated sites like Quora and Reddit, where people pose questions (like on the “No Stupid Questions” thread) and answer them like fact (“it’s in the law in France,” one person writes. I haven’t been able to verify. Or “it’s a sign of hospitality,” which, no offense, but duh).But actually, in the end, Levitt and Dubner debunked the laundry list of explanations and landed on…historical precedent, the answer to so many of the world’s bizarre quandaries.The first restaurants in the western hemisphere, as the historian Andrew Haley explains to Dubner and Levitt on the podcast, were taverns that served a set menu for a set price at a set time. It was thus in the economic interest of the tavern owners to supply complimentary bread, typically made by a local baker, so that customers would fill up on carbohydrates instead of expensive proteins. This continued to be the case with the subsequent popularity of prix fixe menus and was hard to shake even when the seismic shift to à la carte menus in the 20th century made it economically impractical. When, in 1913, New York restaurants moved to introduce a cover charge to finance bread, water, and other free accompaniments, it was met with extreme resistance and incredulity: Patrons started taking their own bread to offending restaurants, which quickly reversed course. Even by this time, the tradition of free bread had become deeply rooted in restaurant culture.Olive oil bottles upcycled into flower vases? It's all happening at Macaroni Grill.\nPhoto by Lisa DiederichA century later we’re still not over it. A quick search of “best free bread” gives you best-of lists, sure, but also lots of laments: In 2014 ABC News declared that free bread was hitting endangered status. The crisis had not been resolved as recently as 2017, when a New York Post story lamented the glory days of mediocre—but free!—bread.Restaurants that do offer complimentary bread aren’t run by money-squandering dimwits (though, I did learn that Olive Garden’s investors, believing otherwise, tried to put the kibosh on unlimited breadsticks): Customers are generally wary of what economists call “price partitioning” (X amount of money for a cover, Y amount of money for bread, Z amount of money for coat check), so instead of listing the bread for a fee, restaurateurs fold it into the prices elsewhere.All of which means that the bread’s not actually free at all.I’ve spent years eating highfalutin bread—naturally fermented, made with locally milled heirloom grains, wood-fired, priced at $8 a loaf, sold out by noon, spread with cultured butter. I love everything about it: the open crumb that can hold no jam; the wheaty complexity that makes it resistant to most applications (don’t try French toast); the way it makes me feel holier-than-thou. But I’ve missed the warm fluff of the rosemary peasant bread, so light you could stomach the whole loaf in one sitting—a beach read compared to the Great American Novel. I had to go back to Macaroni Grill, decades later, to taste it again.Because the Timonium location closed since I moved away from home, I dragged my parents and husband an hour south, to the Annapolis branch, which looked comfortingly similar: same faux stucco siding, some faux stone pillars, same mural of…is it Cinque Terre?...on the exterior. But this time we didn’t have to put our names down with the hostess and wait 20 minutes for a pager to light up and buzz when our table was ready. We walked right in. It was 4 p.m. on a Sunday, and there were plenty of booths to choose from. We alerted Kendyll, our truly lovely server, that we’d be having drinks and, as my dad said, “apps,” and that we definitely wanted the bread.But would it still be free? A 2018 post on TripAdvisor suggested that the price had been raised to $2 a piece. When I called the location before our trip (because would 60 minutes trapped in the car with my parents even be worth it if we had to pay for bread?), I was told that the bread was free with entrées but $1 if we wanted a loaf and nothing else. I got to the bottom of it with VP of marketing Wagstaff-Bellomo, who clarified that “If you’re in the restaurant, it’s absolutely complimentary.” It’s when you want to buy a bunch of loaves to, say, hoard in your freezer that they charge $1 each.We ordered our drinks—cucumber soda for me, Riesling for my mom, a Negroni (?!) for my husband and, inexplicably, Moscato (?!?!) for my dad—along with crispy fresh mozzarella (“mozz sticks,” as my dad requested) and the signature mac-and-cheese bites. Then, we waited.The bread came out first. It was just as shiny as I recalled but not as large. It was only slightly warmer than room temperature, but even that was enough to distract us, at least for a moment, from its lack of flavor and spongy dryness. It wasn’t as rich or salty or fragrant or crusty as I remembered. It wasn’t as good as what I could make at home. I was disappointed but also not surprised, like looking at old photos of myself from high school prom and realizing that that sky-blue sequined dress wasn’t nearly as cute as I remembered (especially since two of us wore the same one). But with enough olive oil, the bread was passable. We still ate half before our various hot and fatty fried cheese snacks, with their various dipping sauce sidekicks, arrived.It was, after all, free.Sarah Jampel is a contributing editor at Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Sarah Jampel"]}