{"id": "65ad6082a0ecd1d5314ff06f52f05147", "url": "https://www.bonappetit.com/recipe/red-velvet-cookies", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "Red Velvet Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSparkly Red Velvet CookiesBy Jessie SheehanMarch 24, 2022EmailPinterestPrintPhotograph by Isa Zapata, Food Styling by Judy KimEmailPinterestPrintEmailPinterestPrintIf you love red velvet cake, this easy one-bowl red velvet cookie recipe has your name written all over it. The cookies have just the right balance of crispy edges, soft middles, and big chocolate flavor, with the prettiest shade of red in the land and crunchy sparkle from sanding sugar. In addition to requiring no special equipment, you won’t need to refrigerate this cookie dough or let it rest before baking, making it perfect for when you need a cookie right away. Gel food coloring works best to achieve the deep red color—plus, it won’t affect the texture of the final cookies the way liquid food coloring does (if the dough is too wet, the cookies will spread upon baking, resulting in less chewy cookies with crackle-less tops—a tragedy on both fronts). And while any brand of sanding sugar is fine, we’ve found that the Betty Crocker brand delivers the most vibrant, sparkly finish (you’ll definitely end up with red-stained fingers no matter which sugar you use, but that’s a sacrifice we’re willing to make). —Jessie SheehanAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBamboozle Nesting Bowls$80 At Bon Appétit MarketSilicone Spatula$13 At BA MarketScale$25 At AmazonWhisk$10 At AmazonWire Cooling Rack$17 At Bon Appétit MarketIngredientsMakes 16 cookies1½cups (packed; 300 g) light brown sugar1cup (2 sticks) unsalted butter, melted, slightly cooled2chilled large egg yolks1½tsp. vanilla extract⅔cup (54 g) unsweetened Dutch-process cocoa powder1tsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2tsp. red gel food coloring2cups (250 g) all-purpose flour½cup red sanding sugar (preferably Betty Crocker; about 2 oz.)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Vigorously whisk 1½ cups (packed; 300 g) light brown sugar and 1 cup (2 sticks) unsalted butter, melted, slightly cooled, in a large bowl until lightened in color and smooth and glossy, about 30 seconds. Whisk in 2 chilled large egg yolks and 1½ tsp. vanilla extract. Adding one at a time and whisking after each addition, sprinkle in ⅔ cup (54 g) unsweetened Dutch-process cocoa powder, 1 tsp. baking soda, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Whisk in 2 tsp. red gel food coloring, then add 2 cups (250 g) all-purpose flour and fold in with a rubber spatula just until the last streak of flour disappears (be careful not to overmix).Step 2Pour ½ cup red sanding sugar (preferably Betty Crocker; about 2 oz.) into a small shallow bowl. Divide dough into 16 equal portions (about 3 Tbsp. or 55 g each) and roll each portion into a ball. Roll each ball in sanding sugar to evenly coat, then divide between 2 parchment-lined baking sheets, spacing 2\" apart.Step 3Bake cookies, rotating baking sheets top to bottom and front to back after 6 minutes, until puffed up and tops begin to crack, 12–14 minutes. Let cookies cool on baking sheets 5 minutes (they will collapse as they cool), then transfer to wire racks and let cool completely.Do ahead: Cookies can be baked 3 days ahead. Store airtight at room temperature, or freeze in a resealable plastic bag for up to 1 month.How would you rate Sparkly Red Velvet Cookies?Leave a ReviewTell us what you thinkExplore Bon AppétitCookieDessertSnackNut-FreeEasyBakingCocoaOther IngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-24", "author": ["Condé Nast", "Jessie Sheehan"]}