{"id": "65b754d99ba1ebcfde69fb819ce2e3b6", "url": "https://www.bonappetit.com/story/chef-defeating-monsters", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "I Used to Be a Chef. Now I’m Defeating Monsters With a Toddler in My Empty Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI Used to Be a Chef. Now I’m Defeating Monsters With a Toddler in My Empty RestaurantHow Tyler Kord juggles full-time parenting with running an emergency kitchen at Brooklyn’s No. 7.By Tyler KordMay 13, 2020FacebookTwitterEmailPhoto by Katherine PangaroFacebookTwitterEmailI’m super good at cooking. Making big pots of beans and rice and prepping 200 fried chicken sandwiches in 15 minutes is not difficult for me, or my exceptional wife, Katherine, or my always killer kitchen staff. It’s essentially what we’ve been doing at my restaurant, No. 7, for almost 12 years, and at other places in the industry since long before that. It’s just that right now my restaurant is closed and all the cooking we’re doing is for hospitals, fire departments, and first responders in Brooklyn. And we’re doing it while also having a three-year-old lunatic named Barbara at my side at all times.My daughter, Barbara, does not know that there is a global pandemic happening. She is aware that there are “yucky germs” around and that’s why we wash our hands so much and wear masks and gloves, and it is absolutely affecting her. The other night as I was trying to convince her to go to sleep, she had a small-scale freak-out and demanded hand sanitizer and it’s troubling. She doesn’t get why all of the playgrounds are closed or why she isn’t allowed to come into the grocery store with me and push the cart. I realize there are tons of people out there who don’t share my privilege—of having food and stable housing and cable television loaded with as much Blue’s Clues & You as she can possibly watch (Josh rules!!)—but I’m having a harder and harder time explaining why our lives are so constricted without scaring her. Luckily, I am her best friend in the world, so she is fine with hanging near me all day and not going to daycare.Unfortunately, I have a lot of work to do.PHOTO BY KATHERINE PANGAROWhat this all looks like in practice is a dad constantly trying to convince his daughter that what would really be best right now, as he glazes 60 pounds of chicken-and-broccoli meatloaf with ketchup and sweet chili sauce, is if she would just have a little more screen time over in that booth. Maybe some Frozen 2? Maybe some YouTube, which Katherine has meticulously combed through to remove all the videos of creepy adults unwrapping toys, though they still find a way of occasionally popping up? But she’s unfortunately capable of staring at a screen for only so long, probably because she was born to be the greatest chef/surgeon/abstract painter of all time.So, while the cooks stand six feet apart finishing those meatloaves, and Katherine boxes a huge amount of food and then tries to figure out loans and insurance and how to keep our restaurant open (she spent a couple of years volunteer cooking in post-Katrina New Orleans, so she’s not as stressed as me), and my amazing friends Matthew Maddy and Josh Borock drive the deliveries to the hospitals, Barbara and I run. A lot.Thankfully, No. 7 is a very long restaurant—an 1800-square-foot indoor playground, but with cooks to sneak up on and plenty of ice cream in the freezer. We’ve used up all the good hiding spots for hide-and-seek, but recently we’ve taken to drawing pictures of monsters and taping them up in crafty places, like under the soda gun or on the top shelf of the walk-in. Then we go around, find the monsters, and “defeat” them by vigorously pointing our magic wands (markers!) at them and shouting “Powers!” because YouTube must have taught her that is how magic wands work. Sometimes one of them will freeze me and I will fall to the floor, unable to move, until Barbara finds the nearest monster and neutralizes it.But even with an oblivious three-year-old sprinting around, the restaurant feels somber. Every time we unlock the door and wrangle Barbara’s stroller into the entrance, she asks where everybody is. She says hi to the cooks, or gets shy and hides behind me, even though she’s known these guys her short but entire life. I suspect it’s the masks. The guys are here because they want to be, but they’re worried about the future, and so am I. We’ve all made the choice to accept an increased risk of infection, the significance of which I don’t mean to casually understate. But my hands feel figuratively tied to feeding the front line. Clueless Barbara is just along for the ride.I know if we didn’t have her with us all day, I would feel more comfortable about all of this. I know we would all be less exhausted. I know we could take more orders from the group paying us to cook for the hospital workers (go to brooklynforlife.org to learn how you can help, and when I say help I mean give them lots of money!!). And with more orders, I could be paying my undocumented kitchen staff more money, which is the reason I’m doing this in the first place, because the government has yet to address the lack of a safety net for restaurant workers. My guys work hard and pay taxes but aren’t able to collect unemployment or stimulus checks or get access to health care—even when they’re in a situation like one of my favorite uninsured cooks who is sick at home with what seems to be COVID-19, which is deeply troubling.But I can’t help value this time with Barbara anyway.When we’re not running around, she “helps” me cook, essentially by making a huge mess. She likes to stir things, but it’s a little scary when it’s 10 pounds of boiling macaroni and cheese. And she is entirely in charge of putting unicorn stickers on the finished take-out boxes (I don’t want to steal any credit there). The cooks find my constant need to entertain her in itself entertaining, and I’m glad we can provide some comic relief in all of this. When she’s not feeling shy she will dance and insist that the cooks look at her iPad from time to time because sometimes a joke is so funny that it needs to be shared to really experience it, even when you’re three. The restaurant is starting to feel more like home for her instead of just a place where Daddy takes her in between brunch and dinner while Katherine finishes her shift and I get ready for dinner service.A monster hiding in a pile of meatloaf sandwiches.\nPhoto by Katherine PangaroIt may be harder being one part chef, telling the cooks what to do, and two parts babysitter, making sure Barbara eats things other than the potato chips we use to lure her to the restaurant in the first place, but these are not ordinary times. Barbara being there means we all get to keep working and keep getting paid, and I think there is something reassuring about her presence. Maybe when we reopen she will have a permanent, though honorary (for legal purposes), job. Because while the restaurant feels hollow right now, it will feel even more lonely to be there without her when things go back to normal.Tonight at home we’re going to make lamb dumplings and Barbara probably won’t touch them, but she’ll eat some broccoli (she’s definitely my kid!) and be horrible at bedtime. And then I will drink too much vodka and remember to take my anti-anxiety medication, which seems to be the only reason this is not the craziest article ever written.Then we’ll do it all over again tomorrow. And the next day. And the day after that. And eventually this will end, and we will have done everything we could to help the undocumented immigrants and first-line responders that do so much for us (frankly, the “everything we could do” will likely have amounted to very little, and that is frustrating). We’ll see what’s become of restaurants and whether the independently owned ones like No. 7 have a place in it all. But I am relatively at peace waiting to find out what will happen. Because I have work to do, literal mouths to feed, and monsters to hunt with magic wands.Tyler Kord is the chef-owner of No 7. You can support his work feeding health care workers here, or support his staff by donating to this GoFundMe, or by buying these extremely cool Vans.Explore Bon AppétitCoronavirusFirst PersonRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-13", "author": ["Condé Nast", "Tyler Kord"]}