{"id": "65c9d099b3f11397a841d28a2ea36b36", "url": "https://www.bonappetit.com/story/that-fall-feeling", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "All the Fall Recipes We Can’t Wait to Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll the Fall Recipes We Can’t Wait to CookSummer has been fun, but our September issue is about getting organized with fast and tasty weeknight meals.By Dawn DavisAugust 19, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.What kind of cook are you? Do you sit down on Sunday and plan your meals for the rest of the week, or do you flip through the pages of BA at 4 p.m. to figure out what’s for dinner at 8? In the summer I lean toward the latter. With near endless daylight and ubiquitous farm stands, I can almost get away with it. But with the end of summer and the return of tight schedules, it’s time to get more organized. Our series of pantry recipes comes to the rescue with wonderful weeknight meals and plenty of intel to make dinner faster, easier, and tastier. We’ve also got a braising collection that’s perfect for autumn. There’s Braised Short Ribs With Onions and Curry Leaves, an update on a classic, as well as Braised Tofu and Chiles, a speedy midweek braise—yes, a weekday braise—and so much more.For this month’s “All on the Table,” Dani Shapiro, a writer I admire and one of my favorite podcasters, recalls the time she met her biological father for the first time and what she could (and couldn’t) eat in the emotional aftermath. This refreshing take on comfort food is inspired by her story, and the main ingredient, tomatoes, is abundant at the farm stands if you’re lucky enough to live near one.Two other stories I’m moved to share: As we know, 9/11 was a national tragedy that affected so many families, including those tied to the restaurant industry. In a tribute to our colleagues in restaurants, Peter Kaminsky looks at how nearly two decades later the industry was challenged again. I’m also keen to debut culinary authority Bryant Terry’s new book, Black Food. A chef-in-residence at San Francisco’s Museum of the African Diaspora, Terry has set a new standard with a book that artfully combines recipes from different contributors alongside essays, poetry, and photography. I can already smell Jocelyn Delk Adams’s cake with its fragrant mix of vanilla and cinnamon.More weeknight faves:1 / 55ChevronChevronOne-Pot Gingery Chicken and Rice With Peanut SauceView RecipeExplore Bon AppétitCultureLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Dawn Davis"]}