{"id": "65d9664c933630fd155eb14b1d83c9cf", "url": "https://www.bonappetit.com/story/what-is-keto", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "What Is the Keto Diet, and Should We Truly Be Doing It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is This Keto Diet You Keep Hearing About, and Is It Healthy?The high-fat, low-carb diet promises big results, but it shouldn't be entered into lightly.By Aliza AbarbanelAugust 2, 2018FacebookTwitterEmailIllustration by Annalee SoskinFacebookTwitterEmailButter-laced coffee. Piles of bacon. An avalanche of fried eggs. These are the promises of keto, the high-fat, low-carb diet steadily increasing in popularity over the past few years. Keto's reputation as a route to rapid weight loss has the diet trending, and with celebrities like Halle Berry and Kourtney Kardashian getting on board, we have a feeling that interest won't be waning any time soon. But what exactly  is keto, and is it truly healthy?Okay, what is keto?The ketogenic diet is a high-fat, low-carb eating plan designed to force the body into ketosis, a metabolic state that burns fat for energy. Once in ketosis, the body creates organic compounds called ketones to help create energy lost from those missing carbs. As the body adjusts to running on ketones by burning fat for energy, it's common to experience weight loss. This is the crux of keto's popularity: Many people see results. Still, it's important to note that much of this can be attributed to water weight shed from depleting carb stores, which can easily fluctuate. Despite these benefits, undergoing a seriously restrictive diet like keto shouldn’t be taken lightly.Is it a new diet?Keto is definitely trendy, but it’s not a fad. The ketogenic diet was introduced by modern physicians as an epilepsy treatment in the 1920s—a technique that is still used to treat child epilepsy today in concert with seizure medications. Many high-fat, low-carb diets like Atkins have popped up over the years, but keto has eclipsed them all to join the ranks of high profile diets like intermittent fasting and Whole30.Despite keto's relatively long-standing history, interest has exploded over the past few years. A quick search through Instagram reveals over 7 million #keto posts, an endless scroll through dramatic transformation photos, niche keto memes, and diet-friendly meals. (There are a lot of eggs.) Over on Reddit, /r/keto has a community of over 706,660 subscribers, and thousands more follow along in the comments. These online communities act as a place for commitment, celebration, and commiseration, and for good reason. The demands of following keto are intense: Most keto followers aim to get around 60-75 percent of their calories from fat, 15-30 percent of their calories from protein, and the rest from carbs. Bread, fruit, starchy vegetables, and even whole grains like oatmeal are strictly banned. These demanding macronutrient ratios mean some people get creative, consuming fat in unexpected ways like bulletproof coffee, a.k.a. coffee mixed with butter or coconut oil.Is it actually healthy?Eating nourishing healthy fats is always a good idea, but it's important to set yourself up for long term success. Amy Shapiro RDN notes that when done incorrectly, keto can come with a host of nasty side effects like constipation due to a lack of fiber.“I generally don’t think [keto is sustainable] unless you are motivated by an illness or the health outcomes,” she says. “It is hard to meet all your nutritional needs, socialize, eat out, travel and follow the diet exactly as you should unless you pack and bring your own food and know exactly what supplements you need to take for all the antioxidants, vitamins and minerals you are missing out on by avoiding fruit, veggies, and grains.”If your primary goal is weight-loss and you're able to commit to a seriously strict diet, keto can be an effective option. \"I prescribe keto to patients that are not getting the health benefits they are looking for from other tried methods such as the paleo diet or that have other health issues such as high blood sugar levels, hypertension, polycystic ovary syndrome (PCOS), Alzheimer’s, obesity, and diabetes,\" says Dr. Frank Lipman. A study published in the American Journal of Clinical Nutrition found that obese men following the keto diet for one month lost an average of 14 pounds. The study also found that high-protein, low-carb keto diets are more effective at reducing hunger and lowering food intake than high-protein diets that include a medium amount of carbohydrates. And a review study published in the European Journal of Clinical Nutrition found that keto has potential therapeutic uses for epilepsy, weight loss, cardiovascular disease, and Type 2 diabetes.If you do choose to follow keto, it's important to have medical supervision to monitor blood sugar and ketone levels, as well as make sure you aren't missing any key nutrients or suffering other nasty side effects. Shapiro also stresses that high-fat diets should include well sourced fats and proteins (not just regular butter and oils), and should be paired with an active lifestyle. Even when carefully balanced, a keto diet is difficult to maintain. “Doing the diet long-term can actually be harmful,” says Mascha Davis MPH, RDN, spokesperson for the Academy of Nutrition and Dietetics. “Cutting out carbs from your diet will cause deficiencies, as you are not eating whole grains and starchy vegetables. Drawbacks include feeling fatigued or muscle loss, and long term drawbacks can include hypoglycemia and high lipid levels.” It's therefore thought that keto works best as a short-term diet—no more than a couple months—but medical advice can vary.If you're keto-curious but reluctant to take the plunge, it's possible to incorporate elements into your daily routine. Fat is our friend, and butter-coffee (and chaider!) is seriously delicious. Not everyone can—or should— commit to keto, but everyone can reap the full-fat benefits of avocado cups or fried eggs bathed in a fiery chile crisp. Now that's a non-diet diet we can get behind.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleWhat's Up With Intermittent Fasting, and Should We Be Doing It?By Jennifer Bradley FranklinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-02", "author": ["Condé Nast", "Aliza Abarbanel"]}