{"id": "65dae63a5fa1d86f5e18f1f858eb8bf0", "url": "https://www.bonappetit.com/story/diet-food-in-america", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "Diet Foods of the ’80s Are Out. But Has Anything Really Changed? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDiet Foods of the ’80s Are Out. But Has Anything Really Changed?Americans continue to expect that food will make us healthier, more virtuous, and thinner.By Alex BeggsJanuary 10, 2022FacebookTwitterEmailIllustration by John GallFacebookTwitterEmail“I’m like everybody else,” says ConAgra CEO Mike Harper as he walks into a private airplane hangar. “I lead a busy life.” In the 1989 commercial Harper tells the camera that after he had a heart attack he couldn’t find “healthy food that was really great-tasting.” So he invented Healthy Choice. Cut to a glamour shot of the low-fat, low-sodium, low-cholesterol frozen dinners: a sectioned oval tray with gravy-covered sirloin tips, a side of baby carrots, potatoes, and a fruit-topped dessert. By the end of the spot, Harper is piloting his little blue propeller plane off the runway. In the three years following that ad, Healthy Choice would rake in $1 billion in sales. And it was hardly alone. Lean Cuisine, Diet Coke, Crystal Light, Bud Light: Diet food became a juggernaut in the 1980s thanks to a winning combo of government influence, food tech, and good old-fashioned societal pressure to be thin. And in the years following, the industry would only grow. We don’t like to call it diet food anymore, but in 2020 foods with a dietary claim made over $100 billion.From the moment in 1898 when J.H. Kellogg introduced Toasted Corn Flakes to get our digestion on track and help stave off the urge to “self-pollute” (masturbate), we’ve looked to food to make us healthier, more virtuous, and, yes, thinner. Has it worked? Not really. So why do we keep expecting it to?What was going on in the ’80s? (Other than leotards)Let’s crack open a can of Diet Coke, put on those leg warmers, and step back in time for a moment. In 1977 a Senate committee released a report telling Americans that they needed to cut the fat, salt, and cholesterol (meat, butter, and eggs) in their diet right now—or else. Those types of food, the report said, directly link to heart disease, cancer, obesity, and stroke. It cited evidence that scholars at the time, and today, said is flawed. The report drove home the idea that taking control of our diets meant taking control of our health. “For those who are overweight,” the report said, “the best protection against heart disease is weight reduction.” Later the U.S. surgeon general and the World Health Organization chimed in with their own low-fat reports, every major newspaper and magazine covered the news, and suddenly all over America, fridges were stocked with watery skim milk and margarine. “From 1984 through the 1990s, dietary fat was increasingly blamed not only for coronary heart disease but also for [weight gain] and obesity,” writes Ann F. La Berge in the article “How the Ideology of Low Fat Conquered America.” By swapping your milk, the thinking (but not the evidence) went, you’d reduce your chances of heart disease—and your waistline.From the moment in 1898 J.H. Kellogg introduced Toasted Corn Flakes to get our digestion on track, we’ve looked to food to make us healthier, more virtuous, and thinner. Has it worked? Not really. So why do we keep expecting it to?In response to these reports, the same companies who’d sold us fat, sugar, and salt for decades quickly pivoted to selling such delicacies as Lean Cuisine, Healthy Choice, Stouffer’s Right Course, The Budget Gourmet Slim Selects, Campbell’s Le Menu LightStyle, and Molly McButter (cholesterol-free butter-flavored sprinkles).Jenny Craig launched. Cooking Light magazine debuted. Jane Fonda’s famous workout VHS tapes sold millions. Oprah dragged a Radio Flyer wagon full of animal fat onstage and said, “I’m gonna live on broccoli now.” In a 1983 Glamour magazine survey, 76 percent of women said they were “too fat” when 45 percent of those same women were considered underweight. Seventy percent of Playboy playmates were underweight, according to a study that went to the trouble of examining the waist-to-hip ratio in 240 nudie centerfolds. Deaths from eating disorders reached an all-time high. In the ’80s, writes food scholar Claude Fischler, people “dreamed of being thin, saw themselves as fat, and suffered from the contradiction.”And yet! There was no evidence that low-fat Kraft Singles advertised on television by a young Leo DiCaprio made us thinner or healthier. Meanwhile, obesity rates in America shot up for the first time in the ’80s. Chicken McNuggets made their debut. By 1988 fast-food sales had increased to $60 billion (up from $6 billion in 1970). Portion sizes for what constituted a single serving sharply increased. President Reagan restricted food-stamp eligibility, making it harder for low-income Americans to get affordable fresh food. The health care system became increasingly privatized and Medicaid spending was cut, widening the health disparities between the rich and the poor. My mom—a nurse—was drinking cold Pepsi after cold Pepsi and also smoking Marlboro reds while she was pregnant with me. What I’m saying is: There were other things going on in this country that affected American health more than the food on grocery store shelves.But back to Healthy Choice. The year the brand was founded, 1989, 626 new “reduced-fat” products were introduced, up 127 percent from the previous year. Healthy Choice stood out because it wasn’t marketed as a weight-loss solution the way Weight Watchers’ frozen dinners were. The focus was on “healthy.” “Listen to your heart,” was the slogan slathered on ads showing svelte grandpas flexing for their grandkids and thin couples canoodling. The ads compared Healthy Choice’s fat, sodium, and cholesterol counts to other brands and “reaffirmed notions that health is a personal choice, a lifestyle choice, and that health concerns should be addressed through commodity solutions,” writes S. Bryn Austin in her essay for the book Weighty Issues. In other words: Skip the doctor, head to Safeway! And that mindset has everything to do with where the diet food industry is today.Illustration by John GallDieting is dead. Long live dieting.Somewhere along the line, after the Mediterranean diets of the ’90s and South Beach and Atkins of the ’00s, dieting went out of fashion. In 1992 a panel at the National Institutes of Health reported that people on weight-loss diets gain the weight back in five years (though the findings were flawed because the subjects were already chronic dieters). There were women’s magazine stories like “Stop Dieting— And Start Losing Weight” (Redbook, 1996) as well as coverage of the growing “size acceptance” movement. A 1994 issue of Woman’s Day included a chart of “politically correct weight-loss terms”: “diet” was out, “healthful eating” was in; “calorie counting” was out, “portion control” was in. The chart was credited: Weight Watchers International.Skepticism for diets only grew—in the early ’90s the Federal Trade Commission charged 17 diet companies with making false and deceptive claims. Intuitive Eating: A Recovery Book for the Chronic Dieter by Evelyn Tribole and Elyse Resch came out in 1995 and guided readers on how to rebuild their body images. But the diet industry simply adapted. Weight-loss pills, low-cal frozen dinners, books, and workout tapes talked about “healthy lifestyles.” The idea of “functional foods” took root, which was great news for bran. The FDA passed a food labeling act that allowed companies to put health and nutrition claims like “heart healthy” and “supports immune health” on their products, which marketers ran with. I saw a full-page ad for both prunes and mammograms (beneath a tastefully covered bare breast: “helping prune the risk of cancer every day”). Pharmaceutical companies launched lines of digestive biscuits. By 2001 the diet industry was worth an estimated $34.7 billion.For the first time since it started tracking the diet industry, the market research firm Datamonitor saw a decline in new products with the word diet in the brand name starting in 2005. That same year Coke launched Coke Zero, which is a diet soda like all that came before it but largely marketed to men, as scholar Emily J.H. Contois explains in her book Diners, Dudes, and Diets. The word diet was too intertwined with women’s deprivation diets, which were historically huge bummers, while the word zero implied a lack of bullshit.Dieting kept dying, for the most part. In 2013 the trade publication FoodNavigator-USA wrote that “marketers are avoiding the word ‘diet’ like the plague” and quoted an expert who said weight loss had become “a ‘stealth’ issue.” In 2015 Lean Cuisine’s brand manager at the time told Ad Age “diets are dead” and the brand deleted all uses of the word diet from its marketing, pivoting to a strategy that emphasized women’s empowerment. (And when that didn’t quite save ’em, in 2020 the company introduced a new brand: Life Cuisine.) In 2017 Shape wrote, “The Anti-Diet Is the Healthiest Diet You Could Ever Be On.” Yet another nail entered the coffin when Weight Watchers changed its name to WW in 2018 to take the emphasis away from weight loss.The word diet may be as passé as a cold can of Tab (discontinued in 2020), but that doesn’t mean the concept has gone flat and stale in the back of the fridge too. In the last few years, “wellness” has come into fashion—hell, Bon Appétit even had a whole website dedicated to it called Healthyish, which is also the theme of the very magazine issue this story was published in! In the food industry but also in skin care, fashion, fitness, and beyond, the concept of “self-care” cozily slipped in where “health” once reigned. Wellness wraps up food, mental health, and self-love into one beautifully designed package that can try to disentangle itself from the diet industry but can never quite escape one thing: our body obsession.The path to purityIn the last two weeks, I’ve sampled Cheez-It dupes made from heirloom corn flour, chickpea pasta, pea protein puffs, and cauliflower crust pizza from a brand that made nearly $39 million in 2020, and $35 million in just the first six months of 2021.In the grocery store world, these food products are called “better for you” (BFY!) foods, and the BFY snacks market grew to $39 billion in 2020. BFY products are a response to what industry adviser David Portalatin, who writes an annual report called Eating Patterns in America, calls a “path to purity”—people who are looking for minimal, whole ingredients. Brands like Rxbar emphasize how few ingredients its product has right on the front of the sticky protein bar’s package: three egg whites, six almonds, four cashews, two dates, no B.S. The brand sold to Kellogg’s for $600 million in 2017.“The change [in the American diet] today is really driven by the fact that consumers want to feel good about what they’re eating,” Portalatin says. It reminded me that two years ago, I wrote a headline for a recipe story: “Cook How You Want to Feel,” which haunts me every time I make a frozen pizza. (Sometimes I want to feel like melted cheese, oozing off the couch.)In 2006 Michael Pollan’s seminal book, The Omnivore’s Dilemma, argued that local organic food is good and so-called processed food is bad, very generally speaking. The book explores the ethical, planetary, and cultural cost of industrialized food and was a huge best seller, racking up accolades and even a young readers’ version. It’s arguably shaping a generation of eaters, including farmers-market-loving me. In much of his work, Pollan “sets up a moral hierarchy of food,” writes dietitian Christy Harrison in her book Anti-Diet, and it gave some readers even more food anxiety than we already had. Though hardly the first to do so (see Kellogg and masturbation), his influence, along with the seemingly uncontainable wellness industry, has given us another layer under which to cloak diet culture.“Wellness” wraps up food, mental health, and self-love into one beautifully designed package that can try to disentangle itself from the diet industry but can never quite escape one thing: our body obsession.Consider the pink can of Strawberry Vanilla Olipop prebiotic tonic on my desk, which includes 32 percent of my daily recommended fiber. That seems like it could have repercussions I’m not ready to face. I show it to Harrison, whom I’m interviewing, over Zoom. “What’s in it?” she asks. “Botanicals,” I reply, holding the can to the screen.She laughs. “This really exemplifies the switch from aboveboard diet culture to wellness diet culture,” she says. In her book, Harrison writes about how the wellness industry seems to be selling overall health, but it can’t exist without making you fear being unhealthy, which most Americans still associate with fatness. The diet culture lurking in food activists like Pollan’s work, she explains, is the underlying idea that the wrong foods will make you fat and that fatness is a national shame. Eating more sustainably farmed food is great and all, but if you’re eating out of self-loathing, fear, and hatred of being fat, it’s still diet culture. And so I drink the Olipop because it tastes delicious, like cream soda, and not because I’m trying to cleanse my colon.In Diners, Dudes, and Diets, Contois posits that the wellness industry really took off during and after the chaos of the 2016 presidential election. When the world outside feels out of control, people seek control over the closest thing in the vicinity: their bodies. The Wellness Diet, Harrison writes in Anti-Diet, “is a type of virtue signaling that people use to secure and maintain their own class status.” The pandemic only magnified the problem. Sales of sleep-aid teas, calming chocolates, and anything labeled “immune-boosting” skyrocketed. We’re in such a crowded mess of new diet foods that it’s funny to me that the most popular diet last year was old-fashioned deprivation rebranded as intermittent fasting.The Eating Instinct author Virginia Sole-Smith tells me that even though the language has changed, a “better for you” food is still a diet food: “It’s still telling people that there’s a right way to eat and a wrong way to eat and if you’re eating the wrong way, it’s a reflection on you as a person, and your value, and your body. And it’s still selling weight loss.\"Big food fights backSo what’s Healthy Choice doing now? To find out I’m having lunch at the headquarters of its parent company, ConAgra, in Chicago’s Merchandise Mart. Specifically, I’m here for the Healthy Choice Power Bowls. Bob Nolan, my dining companion, is head of Demand Science, a job I understand to mean “figure out what consumers want before they even know they want it.” We have a tasting menu of their newest dishes, microwaved and plated in airplane-size square bowls and garnished with a little parsley. They’ve printed a menu that says “Welcome Bon Appétit!” and there are flowers on the table.“To become a national way of life, weight control had to be built into the culture as if it had always been there,” writes historian Hillel Schwartz in Never Satisfied: A Cultural History of Diets, Fantasies and Fat. “Diet food had to seem to be basic food.” Prebiotic sodas, bags of LesserEvil avocado-oil air-popped popcorn (love the stuff ), all seem like snacks to me at this point, but something deep down, or not so deep down anymore, knows they’re tugging at my anxiety over eating my one true love: kettle chips. This is just lunch food, the Healthy Choice bowls say, there’s nothing diet about it. But a calorie count on the front of the box, the callout of “low carb lifestyle,” and a yellow flag that shouts “made with riced cauliflower!” or “8g net carbs” signals to customers that it’s healthy, and healthy food will keep you thin. My favorite is the Cuban-style pork power bowl, with sweet bites of plantains.Nolan is an industry legend who helped bring Healthy Choice (among other brands) out of the red by completely scrapping the old way of making brand decisions and embracing data instead. Frozen food sales, not just the sad diet ones, were lagging for decades because, while the brand led the way by marketing “health” over weight loss, the food tasted terrible. By revamping the food and the format—power bowls, baby!—Nolan brought Healthy Choice back to the top of the frozen food charts. His team uses data from credit cards, Google searches, and grocery store rewards cards (the places where consumers never lie) to determine what new flavors and diets they’ll target in different bowls.The words on food packages are so important you can put a dollar value on them. Gluten-free is an $87 billion industry. Protein is $26.8 billion. Oat milk: $37 billion. By making a dish that appeals to each specific category—Nolan calls these “jobs”—the brand can make a lot of money. “Plant-based,” Nolan tells me, is the biggest area of growth right now, despite the fact that Americans’ vegetable consumption continues to decline. The truth is, the top “job” customers are “hiring” Healthy Choice to perform when they buy most of the dishes is losing a few pounds. From there Healthy Choice has a meal for every diet that might (but probably won’t) get you there, whether you’re keto or vegan or on a 30-day sugar challenge. For that last one, have a sesame chicken and zoodle Zero bowl—even the O in “zero” is skinny!Food companies are responding to the demands of the marketplace, and those demands reflect all of our inner demons: body insecurity, food guilt, wanting to be a “better” person, a willingness to trade off flavor for perceived nutrition, never-ending confusion over what “healthy” even means, feelings of utter lack of control in a chaotic world, fear of death. So we end up volleying these anxieties back and forth at each other from behind the frosted freezer doors. NPD Group’s David Portalatin thinks the next big movement in the diet food space will be personalization, which we’ve already seen in the beauty industry (I took a “hair quiz” and tried personalized shampoo once; it had nothing on Head & Shoulders). Who am I kidding, I would probably buy a personalized meal delivery kit based on my sun, moon, and rising signs. It’ll all be fun, and make people money, and still not keep you from dying.You aren’t what you eatI set out to figure out whether these “better for you” foods were making us healthier, but all I could prove is that they’re still selling. The diet—sorry, “health”—food industry is cranking along, thanks to internalized biases that equate health with thinness, a long cultural history of body obsession, and fantastic marketing. Meanwhile, the people propping up the industry (generally white, middle- and upper-middle class) are the least likely to be in poor health. “Rather than spending so much time fretting over what to buy at the supermarket,” Eating Anxiety author Chad Lavin told me, “I wish we spent more time as a culture fretting about making sure people had health care.” By the way, did you know that our diet and physical activity really only contribute a small portion of our overall health outcomes? There are so many other major factors, most of which are out of our control, that determine what happens to our bodies. “Diet matters, but it does not matter in the way that most people think,” Harvard’s Fatima Stanford, M.D., told me, standing in front of a fake leafy background on Zoom. To illustrate this point she shared her screen with me to show a slide from a presentation about the complexity of obesity. Some of the factors in her color-coded chart were: Prescription drugs. Sleep deficit. Portion sizes. Trauma history. Hormone fluctuation. Age. Gut microbiota. Maternal stress. Weight cycling (yes, losing weight causes weight gain). Family conflict. Lack of health care provider support. Heightened hunger responses. Delayed satiety. Gestational diabetes. Thermogenesis. Weight stigma.“Rather than spending so much time fretting over what to buy at the supermarket,” Lavin told me, “I wish we spent more time as a culture fretting about making sure people had health care.”The last one there is so crucial. Studies have found that weight stigma—being bullied, shamed, and ostracized for being fat (by others, and by one’s self)—in fact causes weight gain and is just as damaging to health as “poor diet.” I’m really just scratching the surface here, but almost every diet expert I talked to agreed on one thing: Americans need to stop giving food so much power. “Food should really just be such a small part of our lives,” says Christy Harrison. “It’s essential for living, but in a way it’s like breathing or going to the bathroom. We all have to do it, but there’s so much more to life.” For those of us who work at food magazines or love to cook, food is one of life’s greatest pleasures. Don’t get bogged down in the net carb count. Get your basic nutrients; have a little fun while you’re at it.As Diet Coke hits the ripe old age of 40, Coke Zero is now projected to be the company’s biggest source of growth. It’s basically the same drink, just with a slightly different blend of artificial sweeteners, and I can say with confidence that it tastes great. I’ll never get tired of that sweet, sparkly taste of nothing. And I’m not the only one.Explore Bon AppétitCultureessayLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-10", "author": ["Condé Nast", "Alex Beggs"]}