{"id": "65e49c56662f1f06fe51dca9a22eb9db", "url": "https://www.bonappetit.com/recipe/ramen-noodles-with-spring-onions", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Ramen Noodles With Spring Onions and Garlic Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueRamen Noodles With Spring Onions and Garlic CrispBy Andy BaraghaniMarch 17, 20204.6(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA slight twist on scallion noodles: the same savory, lip-smacking flavor but instead of wilting the scallions in the sauce, we crisp them up in the pan, creating a crunchy, spicy, garlicky topping.Ingredients4 servings1bunch spring onions or scallions, very thinly sliced, divided13\" piece ginger, peeled,  thinly sliced4garlic cloves, thinly sliced½cup vegetable or sunflower oil½serrano or other green chile, thinly sliced (with seeds)¼cup finely chopped tender herbs (such as cilantro, mint, and/or basil)2Tbsp. low-sodium soy sauce1Tbsp. unseasoned rice vinegar1Tbsp. toasted sesame seeds1tsp. freshly ground black pepper½tsp. kosher salt½tsp. sugar25-oz. packages fresh wavy ramen noodles1Tbsp. unsalted butter, cut into piecesPreparationStep 1Place half of spring onions in a large heatproof bowl and set a fine-mesh sieve on top; set aside. Combine remaining spring onions with ginger, garlic, and oil in a small saucepan. Set over medium-high and cook, stirring occasionally, until garlic is golden and scallions are beginning to crisp and turn golden brown, 8–10 minutes.Step 2Pour mixture through reserved sieve onto spring onions. Turn out garlic crisp in sieve onto paper towels to drain. Stir spring onions in bowl until just softened, about 1 minute. Stir in chile, herbs, soy sauce, vinegar, sesame seeds, pepper, salt, and sugar. Let dressing sit 10 minutes.Step 3Meanwhile, cook noodles according to package directions. Drain and rinse under warm water to get rid of any excess starch.Step 4Transfer noodles to bowl with dressing and add butter and half of garlic crisp; toss to coat noodles. Divide among bowls; top with remaining garlic crisp.How would you rate Ramen Noodles With Spring Onions and Garlic Crisp?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIn line with other reviews, I found this oilier than necessary, but intensely flavorful. Next time, I'll cut the oil by half, and probably also pour the dressing over the noodles before tossing instead of noodles over dressing (the toppings tended to pool at the bottom and were hard to integrate evenly with the ramen).Anonymous3/25/2021A lot of work for a little flavor. I don’t see the point of using low sodium soy sauce and then adding the salt back in separately. It needed a lot more soy sauce abs I added pan fried shrimp which helped. Overall I wouldn’t go through the trouble again.AnonymousWilmington NC1/11/2021Delicious! 1/4 C of oil was a good amount. The garlic, green onion, ginger and oil mixture burn easily. I did not need to wait 8 minutes for it to brown. MickeySan Jose12/13/2020Made this as a side dish to serve with hoisin pork (also a BA recipe). These noodles are awesome! Could definitely serve as a dinner with an added egg or ground pork or something.Detroit, MI10/8/2020These were a hit! Used soba noodles instead of ramen because I couldn't get my hands on any ramen (pandemic related). They worked well with the recipe but at the end of the day, ramen is definitely the move for this dish. Anonymouscalifornia 6/10/2020My boyfriend and I have made this once a week since the stay-at-home stuff started; it's so simple to make, takes like, 20 minutes once you've got the recipe down, and is one of the most addicting meals I've ever eaten. If you just remove the dressed noodles from their final bowl with like, chopsticks or tongs, you don't get as much oil with them, so if you're finding the recipe too oily, try that instead of pouring the noodles out onto a plate.jmrichardsMadison, WI5/28/2020This was good! More light and less spicy than I anticipated. Thanks Andy. 100 percent allium forward. I used chapaghetti noodles and cooked them for 3 minutes.roxyticoLucas Valley, CA5/14/2020This is very tasty, and I even used packaged dry ramen noodles, however in my opinion it is much much too oily.  I suggest using only the minimal oil needed to crisp the crisp.  Otherwise the flavor blend is nice.  I used cilantro.  Anonymous972324/20/2020Wow this was easy to make and tasted great!. I added ground lamb (and the residual lamb fat... because we are in quarantine and well why not!). When finished cooking I added soy says and rice wine to give the lamb added flavor.  I agree with what others have said that this was too oily, but that could have been due to the fat (yum!!) I added (still yum!). I used basil as my herb and the one true critique for this recipe, other then reduce oil, is to use a whole serrano chile. AnonymousPhiladelphia, Pa4/15/2020This was SO good. I reduced the oil a bit, and added chicken to make it a full dinner. I also seeded the serrano and fried it with the garlic crisp-- I'm glad I did since it was perfectly spicy for me (I'm a wimp, though). Really easy, lovely recipe! It's one of the rare things i've made that feel like I could've bought it in a restaurant. whdavdenver4/15/2020Per other reviews, I reduced the oil (but used at least 1/4 c.). To give it sufficient protein to stand as a meal, I strained some dressing to fry half a package of chopped tofu in. When that finished, I scooped it out and used the liquid to fry 1/2 c. chopped kimchi, to which I stirred in an egg at the end. Combined everything at the end -- including all the crispy bits, ginger included. Next time I'd at least double all my add-ins, but this made for a good lunch at home.danzfoolAnchorage4/13/2020Super easy, flavorful way to prepare ramen. Very fresh, tangy and the right amount of spice. Lindsey PetersenSpringfield, IL4/13/2020Made this last night, using a jalapeno instead of a Serrano, and just cilantro as the \"herbs\" portion. MAN was this good. Like a Pho pasta. Because I was by myself, I used two Halo ramen pucks, so significantly less than the recipe calls for, with the thought that I would just make more noodles for the leftovers. I think this was a mistake, given how oily the dressing is, I would have liked to have the extra noodles in there from the start. Still, absolutely delicious!Aperoli SpritzioliArlington, Virginia4/9/2020The flavors were good but this was way too oily. I would decreased the amount of oil by at least half or I would drain the oil after I poured it over the scallions. Otherwise it’s a decent version of ginger scallion noodles dylandogPhiladelphia 4/8/2020loveloveloveloveloveAnonymousBrooklyn4/6/2020Explore Bon AppétitEast AsianAsianRamen NoodleNoodlePasta & NoodlesScallionOnionVegetableSpring OnionMainVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Andy Baraghani"]}