{"id": "65f4a8d1db810ad890a57446bfd7e6b2", "url": "https://www.bonappetit.com/story/baking-supply-co", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "I Launched My Dream Food Business. Then I Lost Myself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Launched My Dream Food Business. Then I Lost MyselfI’d made the mistake of thinking that “doing something” was a shortcut to “being someone.”By Ali FrancisFebruary 3, 2021FacebookTwitterEmailIllustration by Jackson JoyceFacebookTwitterEmailThe first time I ever spoke on a panel as the CEO of the Baking Supply Co., I wore overalls, high-tops, and some gigantic hoop earrings. I didn’t look like your stereotypical CEO, but that was the point. I was there to talk about the edibles company my brother and I had cofounded. We were calling it “the Blue Apron of weed.”I’d flown to Washington, D.C., to speak to millennial women about how good branding could legitimize an industry dominated by stonerisms and neon green. It was 2017, and Big Weed was dominated by ex-Wall Street execs who realized they could get rich and get high. I was ready to talk change: namely, Small Weed. Lady-Friendly Weed. Earlier that week, our Indiegogo campaign had reached a funding milestone, and we’d just had a positive—albeit grueling—three-day investor meeting in Denver discussing a potential deal with a bigger cannabis company. Being asked to speak on a panel was the cherry on top: a concrete sign that the brand we’d spent two years building was more than just a pipe (ha!) dream.I explained how we used color and font and “vibes” to, essentially, Goop-ify cannabis—make it less masculine, less dank, more “wellness.” I talked about the importance of mission: how my ovaries were swollen sacks of cysts, how shooting homemade canna-rockets into my vagina made them hurt less. How I started the business because pharmaceutical companies were evil and I wanted to make natural pain relief accessible to others suffering from chronic illness. At least that was what I’d been telling myself.Intentionally obscured on stage were the details of my personal life. I lived in a 900-square-foot apartment with three other people. The most regular emails I received were from my bank: “Account Alert, Balance Below $25.” I schlepped weekly to a warehouse in Rockaway, Queens, to measure out flour mixes, pack boxes, and print shipping labels with a semiretired Sky Chefs manager who smoked cigars and called me Kid. I was so burned-out that I’d often need to take a power nap on the office couch, and my friends knew better than to try and see me. But most important to conceal was the fact that any cash I did earn came from freelance gigs—big brands that hired me to create emotional narratives for their products. Money is what legitimizes a new venture, and I didn’t want to admit that my business wasn’t making any.After the panel, the validating glow of the crowd already fading, I struggled to fall asleep in my friend’s bed (I couldn’t afford a hotel). Staring up at her stucco ceiling, I felt suffocated under the weight of my own impostor syndrome. I’d spent all night selling a carefully curated story to a room full of progressive women. In that story I was a thoughtful, cool, easygoing female founder. I was chill but successful, effortlessly relatable and influential. But laying there in the dark, none of those descriptions felt true.The business wasn’t doing well—and I wasn’t doing well—so what was the point? I realized I didn’t have an answer to that question. I couldn't remember who I was outside the selling, the branding, the spreadsheets. Any time a customer complained, or a press piece fell through, I felt these losses as personal failings. After spending years branding start-ups, then trying to create my own, I’d made the grave mistake of thinking that “doing something” was a shortcut to “being someone.” I’d been suckered into hustle culture.Back in New York I had to shove my clear-eyed revelations under the rug and get back to work. After all, I made my actual income from freelance brand strategy: creating coherent and persuasive brand narratives for new businesses. I’d been selling brand stories for years, and I started noticing a daisy chain of disturbing similarities between myself and the mostly young founders I worked with.My job as a creative consultant was to come in, “discover,” and articulate the value systems that would underpin a company’s reason for being. These belief sets were designed to justify the “why.” Yet most of the time the connection between the product and the purpose was tenuous at best. The products made them money, the brand made them cool, and the rest was a fiction.When it came to my own company’s value system, I felt uncomfortable promoting weed as a wellness tool despite the very real benefits it seemed to provide me. I knew we all had very different operating systems. I can go surfing and climb mountains on edibles, but a close friend always needs to eat a hundred dumplings and then spend the rest of her night crying in the fetal position. We’d worked hard to position weed as a natural plant medicine, but was it good for everyone? I wasn’t sure, but to work those crazy-making hours—managing our finances, creating recipes, building out a supply chain, finding a co-packer, and trying to entice customers to buy stuff—I had to believe it was. Start-ups have little time for second thoughts.I’d tethered my whole being to something that only half my heart was in, and I hardly recognized myself anymore.I worked with countless founders like this, like me, who were obsessed with image: constantly tweaking the look, feel, and tone of voice of their companies; creating barely relevant blogs and expensive productions that were often abandoned at a whim (or as soon as investors raised eyebrows); and spending more time on social media and taking press calls than actually managing their teams. Then they’d explain how important it was that their “community” understood that they were really buying into a “lifestyle.” From there they would continue to ignore the boring-but- important stuff, like product quality, return rates, and customer service, focusing instead on creating flashy brand collateral.Instead of inventing products to solve problems in the world, many of the founders I worked with seemed indistinguishable from #influencers, creating brands as pathways to personal relevance, pillars on which they could define themselves and advance their own reputations. This was the hedonic treadmill I was stuck on too. In the months since the panel, I started feeling cold sweats spiked with paranoia every time I thought about my business. I’d tethered my whole being to something that only half my heart was in, and I hardly recognized myself anymore. So, two years after starting the Baking Supply Co., I sat across from my brother at Dudley’s on the Lower East Side and anxiously backed out of our venture.I read my horoscope daily, and so I believed it a sign when a colleague introduced me to a man who wrote a book titled How to Be Alive. (For the record, I still refuse to call him my life coach, though that’s what he became.) He knew what I didn’t: that finding peace and wholeness in an era of global unrest, poverty, and environmental peril was tricky business. But instead of chasing validation, we should chase our values, passions, and concerns. Achievement was arbitrary if it lacked meaning and connection; recognition empty if it ignored authenticity.Getting off the treadmill was hard. As with any breakup, I could recognize that my company wasn’t for me, but it took time to shake the idea that I’d failed. Over my six months with the coach, I stopped scheming on new business ideas that could house my newly untethered identity, and started trying to find better metrics to measure success. Do I feel fulfilled? Is this work serving others? Does it allow me to show up fully in my relationships? Eventually, and with enough therapy, it stopped hurting so bad. And so I canceled our bank accounts, dissolved the business, and let our web domain expire. Together, my brother and I traveled to Rockaway to move the last of our ingredient stores, lugging bags of dehydrated vegetable flour, ginger, cinnamon, and baking powder into my one-bedroom.Now, as the pandemic, and all it has collided with, has reshuffled my priorities like a deck of playing cards, it’s been easier to see how the pursuit of accomplishment and relevance distracts from the aspects of life that make it most meaningful. Almost two years since The End of my company, I’ve just finished the last five-pound bag of coconut sugar-sweetened chocolate chips I’d had shipped from Santa Barbara, California, for our sweet potato brownie recipe. I used them to make an oat milk hot chocolate, and they were just as bittersweet as I remembered.Explore Bon AppétitCannabisHealthyishessayRead MoreLifestyleThe Healthyish Guide to Cooking With, Eating, and Truly Enjoying WeedGallery13 SlidesBy The Healthyish TeamLifestyleMy Mom's Pot Brownies Were Legendary During the AIDS Epidemic. This Is Her Recipe.By Alia VolzLifestyleWhy Your Next Cocktail Might Taste Like WeedBy Gillian FergusonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-03", "author": ["Condé Nast", "Ali Francis"]}