{"id": "65f61a12d5a3b658a8592a966bdec3d5", "url": "https://www.bonappetit.com/story/julia-kramer-hot-10-2019", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "The Hot 10 Is Here—and It Took a Ton of Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Hot 10 Is Here—and It Took a Ton of WorkWell. The woman behind the list did a lot of work.By Adam RapoportSeptember 24, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailA few weeks ago, I was wandering around the Bon App offices, swinging a 9-iron—my version of a fidget spinner. As is often the case, the last thing I wanted to be doing was sitting in one of those meshy Aeron chairs, staring at my laptop.So I dipped my head into Julia Kramer’s office. Julia, of course, was doing just that—glued to her computer, cup of Pret A Manger lentil soup in hand, a stack of article printouts nearby, and next to them, a teetering pile of cookbook galleys that she would “totally get to” one of these weeks.If you think the life of a restaurant critic is glamorous, you should drop in on Julia. At a time when we are all being asked to do more and more (that’s not just a publishing-industry thing, right?), Kramer is the one at BA who I’m always urging to do less.As the brain (and belly) behind this year’s Hot 10—our annual list of America’s Best New Restaurants—Kramer is Bon App’s chief restaurant critic.But she’s also our deputy editor. Which means she edits every word of every issue and lays eyes on nearly every piece of content that goes up on bonappetit.com. And because that’s not enough, she also writes copy for our new online store, shop.bonappetit.com. (On the tie-dye shirts: “Which is the safest bet: taking that ayahuasca trip, going to a Dead & Co. concert, or buying this T-shirt? We’re gonna go with that last option.”) And when there is a going-away party, she’s our Bob Dylan, drafting sing-along lyrics for departing colleagues.It’s this all-you-can-eat work ethic that Julia relies on while traveling to more than 200 restaurants in 30 cities during her search for her 10 favorite restaurants of 2019. It’s a multi-month grind where the phrase “third dinner” is not uncommon, and a satellite membership to CorePower Yoga is invaluable.This is the first year with Julia running point on the Hot 10 after five years of riding shotgun with Andrew Knowlton. By now she knows enough not to think of this as a solo show. Amiel Stanek selected and wrote up two of the 10 restaurants. Photographer Alex Lau and creative director Michele Outland barn-stormed the country to shoot nearly all the award winners. And then there is the entire team back in New York, who assembles the issue, builds the digital experience, and plans the Hot 10 party, a massive come-one-come-all bash in Brooklyn on October 19 (which, for the record, you can and should buy tickets for here).Oh, and one more thing. Julia was pregnant while she did her research, which marks the second time in her hunt for the Hot 10 that she has crisscrossed the country eating for two. “Just think of how much money I saved BA,” she likes to point out, “by not sampling all those cocktail and wine lists.”Well, that’s one way of looking at it. Another way is that for the next four months, we won’t have Julia to lean on to do pretty much everything. We’ll just have to pick up the slack—if not the lentil soup.You can buy your ticket to the Hot 10 party right here!Explore Bon AppétitAdam NewsletterHot 10 2019Read MorerestaurantsThe Hot 10: America's Best New Restaurants 2019By Julia KramerLifestyleThree Months, 200 Meals, and a LOT of Time on the RoadBy Amanda ShapirorestaurantsOur 50 Nominees for the Hot 10: America’s Best New Restaurants 2019By The Bon Appétit StaffrestaurantsEverything I Know About Running Restaurants, I Learned From My MomBy Donny Sirisavath, as told to Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-24", "author": ["Condé Nast", "Adam Rapoport"]}