{"id": "65f7a63786daaf3535a8cc1042b2dad6", "url": "https://www.bonappetit.com/recipe/chewy-ginger-rye-cookies", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Ginger-Rye Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueChewy Ginger-Rye CookiesBy Rick MartinezNovember 19, 20194.1(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintIn this cookie, rye flour pulls double duty, pairing with molasses and ginger in both the deep, toasty batter and the crunchy streusel topping. It adds an earthy-nutty dimension (and absorbs more molasses than all-purpose flour) for a smoky, caramel-y, rye whiskey-esque finish. The result is something like gingerbread, but softer and way more delicious. IngredientsMakes about 241cup (128 g) all-purpose flour1¼tsp. baking soda1½tsp. ground cinnamon¼tsp. ground cloves¾cup (110 g) plus 6 Tbsp. (60 g) rye flour, divided3tsp. ground ginger, divided1¼tsp. kosher salt, divided⅓cup (50 g) finely chopped crystallized ginger⅔cup robust-flavored (dark) molasses¼cup (packed; 50 g) dark brown sugar¾cup (1½ sticks) unsalted butter, melted, plus 2 Tbsp. unsalted butter, room temperature2large egg yolks6Tbsp. (90 g) raw sugarPreparationStep 1Whisk all-purpose flour, baking soda, cinnamon, cloves, ¾ cup rye flour, 2 tsp. ground ginger, and 1 tsp. salt in a medium bowl to combine; add crystallized ginger and toss until coated and evenly distributed. Whisk molasses, brown sugar, and ¾ cup melted butter in a medium bowl to combine. Add egg yolks and whisk just until egg yolks are absorbed but mixture is still very dark, about 10 seconds. Add dry ingredients and fold until no streaks of flour remain. Let sit, uncovered, at room temperature 30 minutes (batter will thicken as it sits).Step 2Meanwhile, place a rack in middle of oven; preheat to 375°. Whisk raw sugar, remaining 6 Tbsp. rye flour, remaining 1 tsp. ground ginger, and remaining ¼ tsp. salt in a small bowl to combine. Add remaining room-temperature butter and smash together until mixture resembles clumpy wet sand; this is your streusel topping.Step 3Using a 1-oz. ice cream scoop, portion out dough (about 2 Tbsp. each) and roll into balls between your palms. Working one at a time, toss balls in streusel mixture to coat and place on 2 parchment-lined baking sheets, spacing 3\" apart. Bake 1 sheet of cookies until they have spread and are slightly cracked and just set around the edges and streusel is lightly browned, 8–10 minutes. Let cool 10 minutes on baking sheet. Transfer to a wire rack and let cool completely. Bake remaining sheet of cookies.Step 4Do Ahead: Dough can be rolled into balls 2 weeks ahead. Freeze on a baking sheet; transfer to resealable plastic freezer bags. Let sit at room temperature 30 minutes before rolling in streusel and baking.How would you rate Chewy Ginger-Rye Cookies?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleWe LOVE these cookies. We made this when they originally came out- I made lots of mistakes ( left the sugar out of the streusel topping!), but it seems form all the other comments that mistakes can be made ( i may try a little less butter next time, just a little. Now I follow the recipe correctly and... we still love them. I do find that i really like to toss the streusel all over the dough balls in the streusel to get enough to stick ( as opposed to rolling the ball in the streusel). My cookies are all just a little under three inches. I used a small scoop and they were under an ounce of dough. Yes, they spread, just like they were supposed to. Makes a nice chewy flat cookie. The rye really adds nuttiness and chew. They are a great addition to our Christmas cookies since I tend to make everything chocolate....KristenWesthampton Beach, NY12/22/2021Definitely depends how you like your ginger cookie...soft and chewy or hard and snappy.  These have an amazing flavour, but are much too soft for tastes. They almost fall apart in your hard. NikkiToronto, Ontario.2/3/2021These look beautiful. To get the streusel to really adhere, it helps to use wet hands to roll the balls and to sprinkle extra streusel on top of the dough balls once on the sheet. The flavour is lovely, very spicy and molasses-y. I don't specifically taste the rye but I'm sure I'd taste the difference side-by-side with all AP flour. They aren't very sweet, which is nice but I could see upping the brown sugar a little. The only thing I really wish is that they were chewier - they are more tender and soft. MelissaMontreal12/28/2020I forgot to mention that I only used about a third of the streusel (I put the rest in the freezer and used it later for a plum crumble). AnonymousSeattle12/23/2020These are very good.  I refrigerated the dough overnight and the cookies did come out just like the picture. AnonymousSeattle12/23/2020I followed this one to the letter, except had to leave the dough to rest on the counter for probably 2 hours. I was worried as the dough looked a little like it was going to spread like mad but they didn't!! In fact they are amazing and looked just like the pictures! The flavour is amazing.  I made my own candied ginger (super easy btw) and we had lovely fresh ginger so the ginger shines in this one. Its not too sweet and just soft enough to be a delight. Thanks!!ering21Nova Scotia Canada5/15/2020I wasn't sure how these would work out based on some of the mixed reviews (and b/c ginger is not one of my go-to dessert flavors), but I was really pleasantly surprised. A little crunchy, a little soft, plenty of ginger shines through. They're a different beast entirely from ginger snaps, but just as worthy of being dunked in milk or tea.AnonymousNew Jersey4/27/2020Made these exactly as directed, except that the dough was refrigerated overnight for convenience, and I LOVED them!  Rave reviews from the family, too! Would not change a thing!StokerSCOhio12/29/2019These cookie are pretty good, not mind-blowing, but pretty good. I didn't have a spreading problem like others here did and my dough firmed up perfectly. I wish the flavour had packed a bit more punch, you would think with the spices included that it would. I would also like to know how they got the streusel to come out so colourful with only a teaspoon of ginger in it to give colour? Mine looked a little dull in comparison but overall happy with how they turned out.AnonymousToronto, ON12/24/2019I've made this twice now. The second time I made a mistake and used a 3/4 stick of butter instead of 3/4 cup (1.5 sticks). We liked them better with half the butter! Less spreading, more chewy, and the streusel was more obvious. AnonymousBrooklyn12/20/2019Molasses ginger cookies are my absolute favorite this time of year, but this recipe is not going in my repertoire. The rye flour doesn't add a complementary flavor the way it does with a rye pie crust, and overpowers the ginger flavor. I would skip the streusel rolling completely and only roll in raw sugar - you miss the crunch otherwise. \n\nBon Appetit's chewy molasses cookie recipe or Red Truck Bakery's recipe are perfect. Skip this recipe and save your rye flour for pie dough! Anonymouscharlottesville 12/16/2019I followed the recipe, including weighing out the ingredients, and made sure the melted butter and eggs were at room temp before adding. My dough was pretty thick even in the beginning  and only let it sit for like 20-25 min and I didn't have any issue with spreading while baking. I did have a little trouble figuring out when they were done - mine didn't really crack on top or brown the struesel as described and I think I overcooked the first batch. The texture is great - very chewy! Next time I'll add more crystallized ginger because I was expecting it to be VERY gingery and it was more balanced (probably better for most, but I love the ginger!).AnonymousAnn Arbor, MI12/16/2019I really wanted to like these but couldn't combat the spreading. I creamed the butter instead of melting it and refrigerated the dough and they still spread into unappetizing pancakes.  The nice streusel topping was also completely subsumed into the cookie. But the flavor was very nice! Could be a great cookie with some troubleshooting, but I'm currently baffled how others have made these turn out as pictured.elizabeth.strohbeck2637NY12/16/2019I would definitely make these again. They are delicious! The only suggestion I would make is to let the dough chill for AT LEAST 1 hour as opposed to 30 minutes. Much easier to work with.seharrison626Aurora IL12/15/2019I would make again but not the way it was written. Problems: the streusel was lumpy. Baking the cookies one sheet at a time is inconvenient and time wasting. That said I followed some reviewers and creamed the butter instead of melting it. I ran out of molasses so subed in honey which changed the cookie. I think it would have been better with all molasses. I made balks of approximately 1 Tbsp instead of 2. They spread into smaller cookies. The smaller cookies were nicer looking. If I make these again I will let the dough rest for 30 minutes bikingbakerTorrington, CT12/15/2019Explore Bon AppétitCookieDessertRye FlourFlourGingerHerbs & SpicesVegetarianNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}