{"id": "65fa7b65be8ec764f2a1fc9b0f504e0b", "url": "https://www.bonappetit.com/recipe/sparkly-ginger-margarita", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Sparkly Ginger Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSparkly Ginger MargaritaHilary Cadigan’s Sparkly Ginger Margarita packs a one-two ginger punch with ginger syrup *and* powdered ginger. Top it with seltzer for a bit of fizz this February. Produced in partnership with Patrón Tequila.By Hilary CadiganFebruary 22, 20214.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintIngredientsCocktail:1½oz. Patrón Silver Tequila1½oz. fresh-squeezed lime juice2dashes of orange bitters¾oz. ginger syrup*Splash of soda (to taste)Garnish:2tsp. sugar1tsp. salt1tsp. powdered ginger1lime wedge (can use a leftover piece after squeezing for juice)1sprig fresh rosemaryPreparationStep 1Mix sugar, salt, and powdered ginger together and pour in an even layer onto a flat surface. Wet rim of glass with lime wedge then dip glass into powdered mixture to coat rim.Step 2Combine 1½ oz. of Patrón Silver Tequila, lime juice, ginger syrup, and bitters in a shaker with ice. Shake for 30 seconds or until exterior of shaker is too frosty to hold.Step 3Pour cocktail into glass and top with soda and rosemary sprig.Step 4Enjoy!* Ginger syrup should be easy to find at most grocery stores (and some liquor stores) but you can also make your own out of 1 cup sugar, 1 cup peeled and sliced ginger, ¾ cup water. Mix together, bring to a boil, simmer 15 minutes, steep for an hour and voila!How would you rate Sparkly Ginger Margarita?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWish I had seen this sooner!  Margaritas are my fav!!!! Sitting by the pool with one now in beautiful St. Augustine, FL. YUMMY🌴☀️Deborah CosioSt. Augustine, FL9/14/2021Yummmm this is really good and so refreshing, will be making it all summer!AnonymousDallas, TX3/11/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-22", "author": ["Condé Nast", "Hilary Cadigan"]}