{"id": "65fe5802b386354b046a27cdf60cd088", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/apollo-bar", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Apollo Bar & Kantine Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenApollo Bar & KantineLook at contemporary art, eat some stellar bread at this Indre By hot spotFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: to see what the super stylish Café Atelier September folks did for their encore. (Hint: It’s even cooler than their Insta-favorite a few minutes away.) Anchored near the modern art museum right off the touristy Nyhavn canal, Apollo offers a well-edited menu with several ways to enjoy some of the best bread in town, whether it’s with whipped butter or mascarpone.ORDER THE: Comté with bread; ricotta with olive oil and berries; ceviche of the day; and matcha-dusted “Kermit cake.”  Natural wines, cocktails, healthy juices, matcha (no lattes, thanks), and house-made shrubs round out the drinks.THE VIBE IS: student art league clubhouse in early ‘60s Eastern Europe, from the life-size classical sculptures to the paint-encrusted chairs. Diners range from Café Atelier September regulars to befuddled museum tourists. And come summer, the courtyard seating is the place to be. Make sure to shop the bookstore and, if you’re really lucky, you’ll be there for the monthly flea market!PRACTICAL STUFF: Open Tuesday, from 8 a.m. to 5 p.m.; Wednesday to Friday, 8 a.m. to midnight; Saturday, 10 a.m. to midnight; and Sunday 10 a.m. to 5 p.m. Closed Monday. Book online, just to be safe.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVESlurp Ramen JointObsessively, meticulously made ramen that’s got people lining up in Indre ByRestaurant PalægadeHead to Indre By to eat all the open-face sandwiches (and herring)Ved Stranden 10Get lost in natural wines at this living room-esque Indre By barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}