{"id": "660c9c343e073cd29fc942c3b2ceeff3", "url": "https://www.bonappetit.com/recipe/soft-scramble-sandwich", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "The Soft Scramble Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesThe Soft Scramble SandwichBy Molly BazJune 21, 20194.2(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintTo get the most flavor out of this open-faced breakfast sandwich, look for spring onions with round bulbs and very tender dark green stalks. If you can find only thicker-stalked spring onions, cut the stalks in half lengthwise, then into 3\" pieces. Cook the stalks along with the bulbs; they’ll benefit from the extra time.Ingredients2 servings8spring onions3Tbsp. unsalted butter, dividedKosher salt, freshly ground pepper¼cup white wine vinegar1cup fresh ricotta1oz. finely grated Parmesan (about ¼ cup)½lemon1small garlic clove25x5\" pieces focaccia4large eggs, beaten to blendPreparationStep 1Place a rack in center of oven; preheat to 350°. Trim woody ends of spring onions. Separate white bulbs from green parts with a knife. Cut bulbs in half through the root end; if size varies wildly, cut larger bulbs into quarters. Cut tender green parts of stalks into 3\" pieces; set aside separately from bulbs.Step 2Heat 2 Tbsp. butter in a 10\" nonstick skillet over medium until foaming. Add onion bulbs and toss to coat in butter; season with salt and pepper. Cook, stirring often, until deeply golden brown and starting to soften, 4–5 minutes. Add vinegar, onion stalks, and ½ cup water and continue to cook, stirring occasionally, until almost all liquid is cooked off and bulbs are very soft and jammy, 6–8 minutes longer. Transfer to a plate. Wipe out skillet.Step 3While onions cook, mix ricotta and Parmesan in a small bowl; season with salt and pepper. Finely grate lemon zest and garlic into ricotta mixture and stir to combine.Step 4Warm focaccia in oven (place directly on rack) until soft and warmed through but not browned, 2–3 minutes. Divide between plates. Spread ricotta mixture in swooshing dollops on top of focaccia.Step 5Melt remaining 1 Tbsp. butter in skillet over medium-low heat. Add eggs; season with salt. Cook, stirring frequently in large sweeping figure-eight motions with a spatula, until eggs have set into creamy folds, 1–2 minutes.Step 6Divide scrambled eggs between focaccia. Top with onion mixture.How would you rate The Soft Scramble Sandwich?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleVery good savory breakfast that was quick to prepare. I also used the BA Shockingly Easy No-Knead Focaccia. I used a mix of different spring onions and they turned out very sweet in the end. I would make this again.jslotnickEmeryville, CA4/30/2020Made this with the BA Shockingly Easy No-Knead Focaccia, and it was PERFECT. I didn't encounter any problems with the liquid ratio for the spring onions and loved the super acidic kick it gave the rest of the really rich dish. We ate the dish in three servings, so be ready for a lot of food!lcwassermanBerkeley, California4/3/2020Make it with cornstarch eggs.MASSEY LAMBARDcoastal Alabama2/28/2020Makes a TON of food for two servings. Neither my boyfriend or I could finish ours, would've been better off splitting one. I also couldn't find spring onions and used scallions, so they ended up tasting pretty vinegar heavy. I would cut the total liquid back some, maybe in half. sarahbear518Atlanta, GA6/26/2019Explore Bon AppétitSandwichEggRicottaCheeseSpring OnionOnionVegetableScallionSpringSnackNut-FreeVegetarianBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Molly Baz"]}