{"id": "6610daa8d12aa9ed1e020bf08fe43aeb", "url": "https://www.bonappetit.com/story/cafe-ohlone", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Cafe Ohlone Serves Indigenous Foods Only, From Acorn Bread to Chia Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFrom Acorn Bread to Chia Cake, This New Cafe Serves Only Indigenous FoodsThe co-owners used tribal notes and advice from elders to design the menu at Cafe Ohlone.By Flora TsapovskyNovember 13, 2018FacebookTwitterEmailPhoto by Magdelena MaddoxFacebookTwitterEmailCafe Ohlone is hard to find. Named for the Ohlone tribe indigenous to Northern California's East Bay, the cafe  is in a small backyard behind a local bookstore in downtown Berkeley. But in this small backyard, the cafe’s founders, Vincent Medina and Louis Trevino are dreaming big. Representing, respectively, the Muwekma Ohlone Tribe and the Rumsen Ohlone community, Medina, 32, and Trevino, 27 have dedicated themselves to reviving native Ohlone foods through pop-ups, events, and now their first brick-and-mortar venture.Medina and Trevino have crafted a menu brimming with ingredients like acorn flour and venison that are rooted in Ohlone tradition. Many of these ingredients are gathered locally, in the company of the tribe’s elders, while others are sourced from reliable locals. Without a formal culinary education, Medina and Trevino had to rummage through tribal notes and ask a lot of questions to arrive at the recipes they now serve at the cafe, which is open for lunch on Thursdays and dinner on Saturday, with additional hours to come.  “We didn’t grow up eating our native foods; our parents didn’t have access to them,” says Medina. “There’s a way to fix it, through hard work and carrying on in our families’ footsteps.” He sees the cafe as part of a larger global trend: “It’s all part of the decolonization happening all over the world now,” Medina says, “We’re taking away the shackles and returning back to our ways.”Instagram contentThis content can also be viewed on the site it originates from.Trevino and Medina walked us through some of  the staple ingredients on the menu at Cafe Ohlone, which is available in both English and Chochenyo, the language of the East Bay Ohlone.Acorn flour: This is an Ohlone staple, and no meal is complete without it. To make acorn flour, acorns are gathered, often with the community, and peeled. The meaty central part is dried and ground into powder, which is then washed to clear the acorn of its tannic acids. Used in bread, soup, and porridge, the flour is a superfood, rich in proteins, monounsaturated fats, and carbohydrates.Venison: While many associate bison with Native American cuisines, venison, elk, and duck are what’s native to the Ohlone. At the cafe, venison is wrapped in yerba buena and bay laurel and smoked in a smoker. For a recent tribal youth gathering, the two made venison and huckleberry sliders in chia flour buns, and the dish made it onto the cafe menu as well. “It’s still our food, in modern form,” Trevino says.Instagram contentThis content can also be viewed on the site it originates from.Bay Laurel: Present through the Bay Area and close to Ohlone villages locations, laurel has a lemony, sweet scent and medicinal and ceremonial properties. The leaves are used to infuse the cafe’s sauces and stews, and the nuts inside the fruits are featured too. “They have natural caffeine, and we’re big coffee people—it’s an adopted part of our culture,” says Medina. The antioxidants-rich nuts are crushed and incorporated into truffles and an Ohlone twist on coffee served with hazelnut milk.Chia: Long before it became trendy, the Ohlone were roasting chia and incorporating it into breads and cakes. “It’s full of Omega 3, vitamin B and fiber,” says Medina. “It’s one of those ingredients that make life good.”Yerba buena: This is a Californian type of mint, and,  according to the Trevino, “a quintessential taste of home.” Widespread in areas where Ohlone villages were once located, yerba buena is thought to reduce stress, and it flavors the cafe’s stews and sweet sorbets.California Huckleberries: Dotting the cafe’s sauces, salads, pancakes and meatballs, the tiny tart berries are native to East Bay’s hills and are a “great source of energy” according to Medina. They are often incorporated into the Ohlone’s spring and summer dishes.Explore Bon AppétitHealthyishNative AmericanCaliforniaRead MorecultureBrit Reed Is Leading a New Generation of Indigenous ChefsBy Nicholas Mancall-BitelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Flora Tsapovsky"]}