{"id": "66183e11b3526ee804d8a41e9f0193a1", "url": "https://www.bonappetit.com/story/desperately-seeking-certainty", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Astrology App and Tarot Cards: My Pandemic Search for Certainty | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAstrology Apps and Tarot Cards: My Pandemic Search for CertaintyI’d never been into crystal balls or natal charts, but the pandemic had me looking for answers in unexpected places.By MacKenzie Chung FeganJanuary 19, 2021FacebookTwitterEmailIllustration by Patricia DoriaFacebookTwitterEmailThe weekend before the world shut down, I was told to prepare for judgment. It was Friday, March 13. By Monday, New York City schools would close, bars would shutter, theaters would go dark. But on Friday there was relative normalcy upstairs at Raoul’s, a 45-year-old SoHo bistro known as much for its legendary parties as for its steak au poivre.As New York City hit 150 reported COVID-19 cases, my fiancée and I decided—with baffling arbitrariness in hindsight—to keep our anniversary dinner reservation but to forgo the subway. We had our Greek wine-themed dinner, and before walking back over the Brooklyn Bridge we stopped for a nightcap at Raoul’s. Drinks in hand, we spiraled our way up the staircase and slid into a booth, dimly lit by the glow of the fish tank. A few minutes later a tarot reader with long braids and a kind round face set up next to us and unpacked her decks, a celestial-themed tablecloth, and, in a nod to the moment, a bottle of hand sanitizer. In the spirit of the Last Night on Earth, my fiancée and I bought each other readings—my very first.The reader laid before me a series of nine cards, all but two of which were major arcana, the most significant cards in a tarot deck, I would come to learn. There was the Emperor, a stern, bearded elder robed in red with strong Evil Santa vibes. Death(!), a skeleton on a horse greeting children and kings alike. Judgment, a golden-haired Gabriel rousing the dead with his horn. Even as a tarot virgin I could tell that these cards were intense. The reader sensed my alarm. The Emperor, she told me, was about structure and a sense of control. Death, she reassured me, didn’t literally mean dying, and Judgment needn’t be ominous. It’s a wake-up call, she said, perhaps signaling a new beginning or heightened awareness. It could be a good thing—look at those well-preserved corpses rising joyously from their coffins. Ha ha, nothing to worry about!Despite being both a queer 30-something Brooklynite and the granddaughter of a Chinese face reader who conversed with ghosts, I have always been skeptical of various forms of mysticism and divination. I’m bullish on science. I don’t know my moon sign. The only crystals in my home are pyramids of Maldon sea salt. How many times have I peered intently into my drink while friends discussed the Scorpio-ness of their exes? That a series of cards laid out in a specific pattern can divine the future runs counter to my sense of personal agency. My destiny is controlled not by the harmony of the spheres but by the choices I make, and even if I could know the future, who likes spoilers? “That’s so Aries,” some of you are clucking right now, but I prefer to see my “energy” on any particular day as a reflection of my hormones and whether or not I’ve consumed enough water. If my future is already written in the stars, why bother getting out of bed?But my end-of-the-world-as-we-know-it tarot reading kept coming back to me through months heavy with death, judgment, and a loss of control. Near constant ambulance sirens gave way to a summer of protest and reckoning, and as we canceled our wedding and watched my home state of California burn and obsessed over the outcome of the upcoming presidential election, I began to feel crippled by uncertainty and stasis. By nature I don’t consider myself a control freak. But in a year without linear progress, when the hubris of planning something as simple as a meeting with a friend was punished by rain or a rising line on a graph of infection rates, I felt trapped in a state of suspension. My life was on hold for the foreseeable future, and my usual coping tools—community, access to nature, and a relentless focus on finding solutions—were out of reach. What was going to happen? I needed guidance.Could mysticism be the antidote to a year that felt like swinging at a piñata, blindfolded and dizzy, and the piñata may or may not be a hologram?Entire civilizations have sought clarity and comfort in organized religion during times of strife, but a traumatic semester at Catholic school ruled out that option for me. What about the spiritual practices that seemed to work for so many of my peers? My friends are no dummies, and if they tote crystals around in their pockets, chat with their dead ancestors, and commune with the full moon, should I too? Could mysticism be the antidote to a year that felt like swinging at a piñata, blindfolded and dizzy, and the piñata may or may not be a hologram?In November 1918, as the influenza pandemic raged across the U.S. and people sheltered at home, the Los Angeles Times published a piece about the creative ways in which Angelenos were entertaining themselves. “Here’s a queer light on human nature,” Grace Kingsley reported. “Many persons are buying decks of cards with the statement they want them to tell fortunes with! No wonder, either, is it, that in these hazardous days, we should want to find out what’s going to happen to us and ours?” No wonder indeed. According to Google Trends, search volume for psychic reached a five-year peak the week of March 8, 2020, and the New York Times reported that the websites AstrologyZone, CafeAstrology, and Astro.com saw jumps in traffic in March.Since I already celebrate Chinese New Year and its accompanying menagerie of zodiac animals, astrology seemed like a gentle enough entry point for me. I downloaded the Co—Star app, which purports to use NASA technology to deliver a highly personalized daily horoscope. I liked the look of it—sleek with a Dada vibe, designed to appeal to millennials who were in Poetry Club in high school—but was almost immediately foiled when it asked me to input the time of my birth. This was important, Co—Star scolded, so if I didn’t know it I should text my mom. (I was heretofore unaware that eye rolls could be audible until I called my mom, an actual retired NASA scientist, to tell her that afternoon wouldn’t cut it.)The first day, Co—Star told me to seek out the desert but avoid elderberry. The next, I was to lean into bunk beds but shun supermarkets. In one section it told me I was the type of person unlikely to make the first move, but in another that I was intrinsically the type of person who felt compelled to make the first move. “Well, which is it?” I snapped, startling my dog.Perhaps I needed the guidance of a real human, someone whose approach to the world of woo was more relatable. I consulted a few friends eager to serve as Virgils on my descent into the spiritual realm, and they pointed me toward a handful of astrology accounts on Instagram. Whether it’s thanks to Harry Potter’s mainstreaming of the mystical, the wellness movement’s focus on introspection, or the decline of organized religion, Western astrology—which 20 years ago was largely relegated to an occult-hippie ghetto—has proliferated across social media. For the politically active there’s author and now Netflix star Chani Nicholas (378K Instagram followers), who follows a post about the new moon in Libra with a primer about state-sanctioned violence in Nigeria. Just here for the memes? Try @notallgeminis (584K), a pop culture romp through the 12 signs of the zodiac. There are even sign-specific accounts like @cancerdailyhoroscope (195K) and the Spanish language @libra_horoscoponegro (1.1M), I suppose so that sensitive Libras don’t have to absorb the energy of an Aries horoscope. With so many options, I’d be sure to find someone who spoke my language.That someone was Alice Sparkly Kat, author of the forthcoming book Postcolonial Astrology and an organizer of the Queer Astrology Conference. Sparkly Kat was recommended to me by several friends; if anyone could reach me, perhaps they assumed, it would be a political, queer Asian with a sense of humor. Most of their posts about conjunctions and retrogrades whizzed far above my head, but I chuckled at the astrology cat memes and the chart ranking the signs on a “Dad” to “Daddy” spectrum.I asked Sparkly Kat if they’d seen an influx of people seeking astrological readings during this time of deep uncertainty. They had, and the average age of their clients was skewing younger—more Gen Z’ers. “Many are coming to me looking for a sense of hope,” they told me. “Jupiter is the planet that rules institutions, and right now it’s in Capricorn, which means it’s debilitated. We’re feeling cynical about institutions like capitalism. Plus, there’s a grand conjunction of Jupiter and Saturn, which Renaissance astrologers would have seen as a transitional time.” I felt my skepticism fluttering.Perhaps I could approach a spiritual reading like therapy, a jumping-off point for knowing myself better, deeper. No predictions, just self-reflection.But the more I talked to Sparkly Kat about their approach to astral charts, the more I relaxed my preconceived notions. “Astrology isn’t about making predictions,” they emphasized. “My role is to tell a story about the position of the planets and facilitate a conversation so that you can go and make your own decisions. It’s one part therapy, one part science fiction.” This, I thought, I could get down with—archetypes and agency, not forecasting and fate. Perhaps I could approach a spiritual reading like therapy, a jumping-off point for knowing myself better, deeper. No predictions, just self-reflection.“You’re going to have problems with your feet in the future. Arthritis runs in your family.”I know Heather Carlucci from a previous life—an imprecise turn of phrase in this case because she is a psychic medium. I met her when she was the chef-owner of an Indian restaurant in the West Village called Lassi. Before that she was a celebrated pastry chef at some of New York’s top restaurants in the ’80s and ’90s like Union Square Cafe, Mondrian, and Judson Grill. Carlucci left the industry after nearly 30 years for a career that wouldn’t keep her on her feet for 10 hours at a time. What she turned to was the skill she’s had for as long as she can remember—psychic intuition and the ability to communicate with dead people.I booked a session with Carlucci because as much as the phrase psychic powers caused my eyebrows to fly toward my hairline, I’ve never known her to be anything but down-to-earth. “I am not crunchy,” she confirmed. “I feel very strongly that what I do is completely scientific. We just don’t understand that science yet.” She’s a skeptic’s psychic, if such a thing exists.“Thousands of years ago it was accepted that some people are tuned in to something that not all of us can see clearly,” Carlucci said. “Now that we’re in this moment of existential panic, people who wouldn’t have sought me out before are letting down their guards. They’re thinking, ‘There’s something I’m not listening to, apparently.’” Ninety percent of Carlucci’s clients these days are new, and she’s been tickled to see the names of chefs she worked with decades ago pop up on her calendar. “And they thought I was crazy when I left the industry,” she laughed.Sparkly Kat’s explanation of astrology allowed me to envision a more Jungian, less magick way into mysticism, but once my session with Carlucci began, I realized this was a different thing altogether. An hour with Carlucci is decidedly not therapy. She tells you what she hears, smells, and sees—in my case, the click of my grandmother’s mah-jongg tiles, my grandfather’s cigarette smoke, the colony of chipmunks that she says will invade my house. Her predictions are not metaphors; her claim is bigger. There was no archetypal father in the form of the Emperor card—only my literal father, four years dead, chatting with Carlucci and sporting a sizable mustache.As Carlucci channeled, pausing to take in what she perceived before delivering messages in a matter-of-fact tone, she brought insights from my ancestors. My grandmother was especially pushy about airtime—which absolutely checks out—wanting me to know about her own encounters with ghosts and a forbidden love for a mah-jongg partner. And although Carlucci said the concept of linear time wasn’t really a thing, energetically, she delivered predictions from the future. There’s another dog coming. Consider seeing a kinesiologist. Write down the words Rockefeller Foundation. It wasn’t so far off from Co—Star telling me to give myself over to the desert, but Carlucci invited questions and encouraged my active participation. This time I was surprised at how relaxing it was to be told exactly what would happen. Who wouldn’t like the directive to buy jewelry in preparation for “queendom,” especially after spending the last seven months at home in sweats? This, I thought, must be what it feels like to believe in fate or that there is a grand plan for us. I have no idea when I will see my mother next, but at least I can ready myself for chipmunks.My tarot reader from Raoul’s proved difficult to track down. She was a substitute, and none of the normal readers seemed to know who had filled in. Only on close examination of a photo from that evening did I catch a corner of a business card—the name Gina and a phone number with a Brooklyn area code.Gina Jean appears in my Zoom room wearing a crisp white shirtdress, a visual oasis amid the vibrant tapestries and posters—Frida Kahlo, Yves Klein, Andrew Lloyd Webber’s Cats—on the mango yellow wall behind her. She remembers March 13 because, like me, she hasn’t been inside a restaurant since. I remind her of the cards I pulled. “2020 has been a year of judgment,” she reflects.“This was a long time coming, and now it’s the day of reckoning. Either we deal with it, or we run.”Jean comes from a family of Haitian-American doctors. Her mother was a pediatrician; her sister has a practice in Arizona. She sees what she does as an extension of the family business of healing and, like Carlucci, connects her work as an intuitive seer to hard science. “The foundations of so many medicines are derived from plants,” Jean says. “Crystals are, like, Earth Science 101!” Because crystals are also present in computers, Jean says that making the transition from in-person to virtual readings has been easy—although sometimes screens will pixelate or otherwise act up when the energy of a session is especially potent.What before looked like torture now looks different. The man balances en pointe on the slender branch, seeming to levitate, weightless.Jean shuffles her deck and asks me to tell her when to stop. She cuts the deck into thirds, has me select a pile, and begins my reading. The two of cups: “Your relationship is good!” The four of swords: “Take advantage of this time to rest.” And then...the Hanged Man. He dangles by an ankle upside down from a tree, a method of capital punishment popular in the Middle Ages. He is mere inches above a body of water, suspended, immobilized. Relatable! But his expression is serene, and a luminous halo surrounds his head. “This card is about sacrifice,” Jean says. “You see here he’s hanging upside down, but he does not suffer.” She asks me what I’m willing to sacrifice. The deck Jean is using features circular cards, and her question lingers as she rotates the Hanged Man 180 degrees. She asks me what I see now. What before looked like torture now looks different. The man balances en pointe on the slender branch, seeming to levitate, weightless.In early October, Kate McKinnon appeared on Saturday Night Live’s Weekend Update as Dr. Wayne Wenowdis, a mustachioed pipe-smoking medical expert. Breezily confident, his feet kicked up on the desk, Dr. Wenowdis answers all of Colin Jost’s COVID questions with an assured “We know dis.” But eventually McKinnon breaks character, dissolving into manic giggles. “Kate. Kate. Are you okay?” Jost asks. “I’m obviously not,” she responds. McKinnon tells him that the character Dr. Wenowdis is a coping mechanism, that in the face of all these things we don’t know—“who will win the election, when the pandemic will end, what will happen to the world”—it’s refreshing to pretend to be someone who “knows dis.”It is terrifying to be certain of nothing, and I thought cosplaying someone who believes in a divine plan might calm my fears. And at times, especially while talking to Carlucci, letting go of my skepticism did feel like a small present to myself, an indulgence like getting a pedicure or buying the fancy peanut butter. But of all the things I learned during my hesitant foray into mysticism, the image of the Hanged Man is what’s helped me the most. When I’m clenched with frustration waiting for the pandemic and a million other uncertainties beyond my control to be done so I can move forward with my life, I think of him. The Hanged Man doesn’t know his future, but what at first appears to be a depiction of torment can be seen as something else entirely. From one angle, he’s waiting in submission. But with a shift of perspective, he is unbound, floating upward toward the sky.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureConfessions of an Obsessive Quarantine Step CounterBy Brodie LancasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-19", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}