{"id": "662bb0532c30712c462ad7f786f80baf", "url": "https://www.bonappetit.com/recipe/maple-roasted-carrots", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Maple-Roasted Carrots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMaple-Roasted CarrotsBy Andy BaraghaniNovember 13, 20184.6(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintThese are the glaziest, most addictive carrots you’ll ever eat. Just keep an eye on them as they near the end of their cooking time as the sugar and maple can darken quickly.Ingredients4 servings2lb. medium carrots, tops trimmed to about ½\", scrubbed6Tbsp. unsalted butter, cut into pieces⅓cup (packed) light brown sugar⅓cup pure maple syrup¾tsp. crushed red pepper flakesKosher saltFlaky sea salt (optional)PreparationStep 1Preheat oven to 400°. Line a rimmed baking sheet with 3 sheets of foil (you’ll need it!). Cut carrots on a diagonal into 3\" pieces (halved or quartered lengthwise if large).Step 2Spread out carrots on foil. Evenly top with butter, brown sugar, syrup, and red pepper flakes. Season with kosher salt and toss to combine.Step 3Bake carrots, tossing every 20 minutes, until tender and browned around the edges, 50–60 minutes. Transfer to a platter (with syrup, if desired). Sprinkle with sea salt (if using).How would you rate Maple-Roasted Carrots ?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThese are absolutely delicious!!  I made them exactly as written and everyone loved them.   I may try adding garlic like some of the other commenters suggested the next time around, but it's fantastic as written.\n\nAlso, I made these several hours in advance and popped them back in the over right before serving with no issues.\n\nGreat recipe, thank you, Andy! AmyNew York, NY3/3/2022Fantastic recipe. Agree with cutting back on sugar to 1/4 cup. Also agree with adding garlic and adding extra pepper flakes. Made this for New Years and did not have any any left. AnonymousMurfreesboro, TN1/2/2022Delicious!  The sauce is abundant - use more carrots.  One has all the ingredients in the pantry....except, of course, the carrots.  I used whole carrots, peeled, cut into 2\" pieces. Raw carrots are hard, but a Cutco knife will make the job easy.  Whole carrots are much more flavorful than the mini, processed carrots.  Andrea TaylorChicago, IL12/5/2021Can these be made ahead and reheated?ShelleyMae10/10/2021Five Stars!!!  AnonymousTulsa OK4/4/2021Excellent recipe! I would decrease brown sugar to 1/4c. I added a crushed garlic clove also. I would definitely make again!\n\nMichaelMpls, MN4/4/2021Really good, but a little too sweet (even for a sweet tooth). The sea salt was a must. Would definitely make again but would cut back on the brown sugar. Also only took me 40 minutes to cook before the sugars started to turn. I added a couple of crushed garlic cloves, which was nice. Anonymous10/31/2020I usually make honeyed carrots but wanted a maple version to top a salad I was making. I added a few whole cloves of garlic I had laying around and this was a great recipe.  I will definitely make it again. The note in the recipe to keep an eye at the end - pay heed to this because indeed mine started to get a little too toasty especially the thinner pieces so I'd wished I'd kept a better eye on it.  Next time!  AnonymousSeattle, WA10/17/2020My favorite way to make carrots. Sometimes I use honey instead of brown sugar and either way they’re great. Perfect mix of sweet, salty, and spicy.Detroit, MI9/29/2020Delicious! I absolutely loved that sweet glaze. I think I'll be stepping up the chili flakes next time because I like it hot and not enough of it came through for me once everything was done, but that's a small nitpick. Do NOT skip out on the flaky sea salt, it's the perfect finishing touch that makes the dish in my opinion. heyguysitsmerobRaleigh, NC7/30/2020Easy and delicious comfort food! I did a mix of carrots and parsnips to make a full recipe. I cut down the sugar & syrup to ~1/4 c. and I only roasted for about 40 minutes total because the sugars started to get a little burned off around that time. Watch closely towards the end! Would definitely make this again, and will try it with a different combo of root veggies as well!AnonymousPhiladelphia4/18/2020This was very yummy, but a little too sweet for me personally. More like a candied carrot dessert, but nonetheless delicious (note: I eat very little sugar usually so may be more sensitive to it). I’ll be trying it again but with half the maple/sugar next time! I love the idea of using cubed butter instead of oil, and it somehow doesn’t burn in the oven but adds to the caramelized crust. Anonymous3/10/2020Absolutely the best way to eat carrots.  These were a big, big hit when I made them for a potluck dinner with everybody commenting on them and asking for the recipe.  Thanks BA for another great recipe!!!AnonymousYuma1/7/2020easy and delicious recipe! I'll make it again at christmas for sure!AnonymousFrance12/15/2019We LOOOOOVE this recipe.  It is in heavy rotation in my house.  Even my husband that doesn’t really do sweets thought This was amazing! I literally make it 4 times a month....eholmes80sColumbus, Ohio11/2/2019Explore Bon AppétitCarrotVegetableEasySideVegetarianGluten-FreeNut-FreeRoastRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Andy Baraghani"]}