{"id": "66571978cb45b11f017361651a29fa79", "url": "https://www.bonappetit.com/story/stop-fussing-with-your-food", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "The Secret to Crispier Food? Don't Touch It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to Crispier Food? Don't Touch ItIt takes minimal effort. Actually, it doesn't take any effort at all.By Alex DelanyJanuary 4, 2019FacebookTwitterEmailFacebookTwitterEmailDo you know who William Langland is? No, not that annoying kid named Billy Langland who sat behind you in 8th grade algebra class. I’m talking about William Langland, the poet who wrote the 80,072-word poem Piers Plowman in 1387. It was said to be the inspiration behind The Canterbury Tales? Whatever. Doesn’t matter if you know it or like it or care about it. What does matter is the five-word phrase that appears in Piers Plowman that directly correlates to what should be your food resolution for 2019: Patience is a fair virtue.That’s right. Our boy Willy Langland was the first to record the phrase that’s now said countless times a day by dads and great aunts alike. And like I mentioned, it’s the key to 2019 being the best home cooking year of your life. This is going to be the year that you stop fussing with your food while it cooks. It's going to be the year in which, when you're trying to brown anything from veggies to chicken to beef, you just leave it the hell alone. 2019 is going to be the year that things actually get crispy.It's only human to want to fidget and futz around with everything. All the time. Our need to be involved is admirable at times, but in the kitchen it can be the thing that prevents us from achieving the glorious, properly-browned flavor and texture we're looking for in so many dishes. If a recipe says to add something to a skillet and leave it undisturbed, you should listen. Say you’re making broccoli fried rice and want your broccoli to pick up some char. You add the broccoli to the skillet, make sure it’s evenly spread out, and then do nothing. Not a single thing. The only way that broccoli is going to pick up color in the way you want it to is to let the heat do its work. You have to be patient.And you should also be wary about how strictly you follow the time guidelines set out in any given recipe. Back to that charred broccoli. Say you hit the seven minute mark that the recipe says should be long enough to get the color you're after, but when you flip a floret there's no browning to be found. Do you go ahead and flip all of the broccoli pieces because the recipe said seven minutes was enough time? NO! You hang tight and wait for it to get properly browned—then you flip it. Cook to the indicator, not the time. Again, it’s about patience.If you want it crispy, you've got to let it sit.\nPhoto by Alex LauThis lesson applies to almost every food you want to get browned or crispy. When we get a beautiful sear on a steak or pork chop, we do so by letting the cut of meat have prolonged, direct, uninterrupted contact with the hot pan. When we want to brown cubed beef on the bottom of a Dutch oven, before we braise it, we let the beef sit until it's good and browned before we fuss with it. Then we flip it and let it sit again. We don’t stir. We just wait patiently.And if there’s one shining example of how fussing with food destroys its textural potential, it would be the simple process of browning ground meat. You will never get crispy, browned meat by doing anything other than spreading it out in your skillet and letting it cook. Gray ground meat is the result of impatience.The bottom line is this: If you don’t need to be doing anything, you shouldn’t be doing anything. Obviously, there are times when \"stirring often\" or \"whisking constantly\" is the order of the day. But when it's not, it's not, and doing nothing is the move. Your food will become better for it. Exercise restraint. In the words of William Langland: These hash browns are not crispy enough. Did you let them sit in the pan undisturbed? Wait, no. They might not have had hash browns in the medieval times. Not that. This: Patience is a fair virtue.Speaking of charring broccoli for fried rice:Broccoli and Egg Fried RiceA pan full of veggie-packed fried rice is one of the easiest and most satisfying weeknight dinners we know of.View RecipeExplore Bon AppétittechniqueVegetableMeatRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-04", "author": ["Condé Nast", "Alex Delany"]}