{"id": "665e328651dc8fd74dcef759082a9454", "url": "https://www.bonappetit.com/story/brothy-meatballs-vacation", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "When a House Full of Hungry Friends Calls, Alison Roman Makes Brothy Meatballs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen a House Full of Hungry Friends Calls, Alison Roman Makes Brothy MeatballsDinners like this minimum effort, maximum payoff dish are your biggest ally while on vacation.By Alison RomanMay 17, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneFacebookTwitterEmailWhen I’m cooking for my friends on vacation, I generally start out with an ambitious plan, excitedly proclaiming something like, “We should roast a whole lamb outside in a fire pit!” But as soon as I’ve said it, I’ll realize the town we’re staying in doesn’t have a butcher shop, the kitchen only has one (dull) knife, and the house..uh..doesn’t have a fire pit. When that happens, I simply pivot to a dish I know will work under any circumstances, no matter how dinky the grocery store or limited the equipment. That’s right: I’m talking about meatballs.I don’t mean the Italian-American variety that simmers for hours in red sauce. The meatballs I speak of are light and bright, loaded with fresh herbs and garlic, and swimming in a pot of brothy spring vegetables. It’s the ideal dish to make when you want an easy and meaty main course, but aren’t looking to spend hours on a braise or roast. And whether you’re shopping at a small local spot or a giant chain, most grocery stores will have what you need to make meatballs, which is a lot more than I can say about cooking a whole lamb.The meatballs themselves are made of nothing more than ground meat (I like pork, lamb, beef, or a mix), onion, chopped herbs like chives or parsley, and a little yogurt to bind them. Spices like crushed fennel seed or black pepper are optional, but recommended. If you’re wondering where the breadcrumbs and egg are, well, they aren’t here—I told you, these are light!I like to brown the meatballs in a large Dutch oven or pot, then add whatever spring-y vegetables I can get my hands on (which, if it’s not quite spring yet where you are, frozen peas are totally fine—don’t @ me!), and let that briefly simmer in some chicken or vegetable broth. And since I’m not trying to cook a keto-friendly meal for anyone ever, I also like to serve large bowls of cooked grains or tiny pasta such as fregola or Israeli couscous to ladle the brothy meatballs over. Torn pieces of crusty bread would also be an excellent substitute if you wanted to dunk and dip.All that’s left to do is spoon everything into bowls and set out a few unfussy toppings: lemon wedges, some fresh herbs to scatter over, and yogurt for dolloping (you already bought both to make the meatballs, so why not?). It’s lazy, it’s impressive, it’s vacation food at it’s finest.Get the recipe:Brothy Meatballs with Peas, Fennel, and Tiny PastaThis dish is a perfect choice for those blustery but bright early spring days: It's comforting from the simple-but-flavorful broth and bright from the crunchy fresh topping.View RecipeExplore Bon AppétitRecipeMeatballSpringVacationsRead MorerecipesIf Your Ideal Weekend Involves Cooking With Friends, These Recipes Are Meant for YouGallery4 SlidesBy Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Alison Roman"]}