{"id": "66733fd00a0a4c067e95411a9327547e", "url": "https://www.bonappetit.com/story/food-delivery-apps-for-the-community", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "These Food Delivery Apps Are Built for the Community by the Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThese Food Delivery Apps Are Built for the Community by the CommunityAnd they want to change the food delivery industry.By Flora TsapovskyJanuary 27, 2021FacebookTwitterEmailIllustration by Dalbert B. VilarinoFacebookTwitterEmailFood delivery apps have not typically been known for their community support. But for Traiilo, a soon-to-launch Brooklyn-based platform that works exclusively with grocers, liquor stores, and Latinx-owned restaurants, that is the reason the company exists. “We’re helping family-owned businesses,” founder Jose Salcedo says.Traiilo initially began as a catering company in 2017, but Salcedo decided to reimagine it as a delivery app once he saw how much restaurants in Washington Heights, where he lives, were struggling during the pandemic. “Small Latino restaurants are having their dreams crushed by third-party apps’ high fees, and when someone orders through Seamless or UberEats, these platforms ‘own’ the customer,” Salcedo explains. “In our model restaurants will get to keep that connection with the customer.”Along with Black and Mobile, Chowbus, and others, Traillo is one of several new and growing food delivery services that are taking a more holistic approach to delivering food. Prioritizing community and guided by transparency, these apps are changing the rules by relying on less aggressive revenue plans and more on building relationships that last. They’re championing industry-wide change, and it couldn’t come at a better or more crucial time.Once Traillo launches later this year, it plans to charge lower transaction fees than its competitors and provide marketing tools, like SEO and social media guidance, all in Spanish for clients. “They have the tools but may not know how to use them, and there are potential language barriers,” Salcedo says. “We want to empower the merchants.” Traiilo also plans to process EBT (Electronic Benefits Transfer) for food deliveries in the future. (According to recent data, food insecurity has affected, on average, 17.4 percent of the adult Latinx population living with children in New York state between July and October 2020.) “That will have a huge impact in our community,” Salcedo says.It’s been a year of reckoning for the food industry. The pandemic has brought up tough questions about the future of dining and exacerbated what restaurant owners and workers have already been grappling with: extremely thin margins, long hours, reliance on cheap labor, divide in pay between the back of house and front of house, and now delivery. At the same time, long-overdue conversations about racism and social justice have surfaced, as people of color have spoken out about what they experienced working in this industry, forcing restaurants large and small to reconsider how they operate.Amid all of this, food delivery platforms haven’t been looking great. While business for the major players like DoorDash and GrubHub boomed, their customers (restaurants) have suffered. At the height of the pandemic, some apps imposed inflated fees that prevented already struggling restaurants from making feasible profits. (Since then, cities like Berkeley, California, and New York City have capped delivery fees at 10 to 15 percent and are aiming to extend the cap beyond the pandemic.) Other apps steered customers away from non-partner restaurants and initiated aggressive and frequent acquisitions, causing turmoil, chaos, and confusion for restaurants and customers. And when it was time to stand with essential workers, some companies instead supported legal measures classifying delivery drivers and couriers as independent contractors, preventing them from being eligible for important employment benefits and protections.Meanwhile, the major food delivery apps, predominantly led by white CEOs, have been plagued by allegations of discrimination and performative allyship. While some, like Caviar (owned by DoorDash), have made efforts to highlight Black-owned businesses, UberEats was accused of stopping deliveries to San Francisco’s lower-income neighborhoods. When the news of the pandemic raised concerns about discrimination against mom-and-pop Chinese businesses, delivery apps stood idly by, not standing up for affected restaurants on their platform.“The day after Trump got elected [in 2016], we ended up dropping out of college,” David Cabello says, referring to his twin brother, Aaron, and himself. “We wanted to help Black businesses and Black people. I didn't know how I was going to do that, just that I had to.” While he was figuring things out, Cabello started delivering for Postmates. “At some point, I said to myself, ‘If I can make this much money delivering food on a bike, how much could I make owning the company?’” he remembers. He soon realized there were no food deliveries in the country focusing on Black-owned businesses. So he decided to start one after watching “the corniest YouTube video about starting a business.”In 2019, Black and Mobile was born, dedicated to delivering food from Black-owned businesses. The first year was tough. Cabello and his brother had only five restaurants in Philadelphia for a few months and delivered the food themselves on bicycles. He ran a humble Kickstarter campaign, raising $5,000. But when a big local restaurant endorsed him, business took off. Black and Mobile earned $25,000 in revenue in its first year. In 2020, the start-up earned $500,000 to $600,000, thanks to improvements in the app, the addition of new restaurants, COVID-19-fueled interest in delivered food, and, as Cabello calls it, “the ‘trend’ to support Black-owned businesses.”“We bring attention to restaurants. They don’t have to compete with McDonald’s and Chick-fil-A and Popeyes,” Cabello says. Currently, the app is available in Detroit, Atlanta, Baltimore, and Philadelphia, the twins’ hometown, and partners with 70 restaurants. They charge restaurants on the platform a 20 percent fee. They also pay delivery drivers $10 to $12 per delivery, which averages out to $20 to $25 per hour and can go up to $30 to $37 per hour. In comparison, rates for drivers on UberEats or Caviar range from $8 to $25 per hour.Additionally, Cabello contracted a Black-owned tech firm to help with the app and the website. “If you look at all these other delivery services, they’re making millions of dollars. Black people need to be in this field,” he says.Nuyen and Shon Emanuel, the mother-daughter owners of Supreme Oasis Bakery and Deli in Philadelphia, joined Black and Mobile in April 2019. Initially, they were working with UberEats, but after two months, they switched to Cabello’s platform. “We’re Black and Muslim,” Nuyen says. “It was important for us to support not only a business but a legacy. In Philly, there are not many Black-owned businesses—and many of them go under—so we wanted to circulate the dollar in our community.” Financially, adds Shon, the fees are about 25 percent lower than on UberEats, and customer support is more personable. “They were very honest and forthcoming, and we thought, People gave us a try, so let’s give them a try.” she says. The bet paid off. According to Shon, their delivery business has been growing ever since they switched. “We’re in West Philly serving vegan soul food, and they have really promoted us and helped people discover us,” Nuyen says.This year Cabello plans on expanding to Washington, D.C., driven by the same vision: go where Black communities flourish.For Chowbus, the fast-rising app founded by Chinese immigrants Suyu Zhang and Linxin Wen in 2016, representation on the tech stage goes hand in hand with a nuanced approach to delivery. Last year the app secured a $33 million investment from venture capitalist firms in Silicon Valley and banks like Altos Ventures and Silicon Valley Bank. Investors praised its narrow focus on the Asian restaurant market. This sizable chunk of money contributed to the platform’s steady growth; in the past year, Chowbus has increased its revenue by 700 percent.Featuring a variety of neighborhood restaurants whose owners might have been lost on bigger platforms, Chowbus employs staff members who can speak to restaurant owners in their native Korean, Thai, Mandarin, or Cantonese. On the platform, certain regional dishes, such as Indonesian-style dry ramen or Beijing-inspired roast lamb, are highlighted for each restaurant, with images taken by Chowbus.“We really want to empower small restaurants that serve authentic food,” Wen says. That effort translates to money: The average commission Chowbus charges, which varies by city, is 10 percent lower than the fees that platforms like GrubHub have in place. It also offers a bundling system, which allows customers to order different items from neighboring restaurants. “In Chinese culture, a dinner is expected to include multiple different dishes that people share,” Wen says. “This feature allows customers to discover different restaurants in a single order without extra charge, and it benefits businesses that focus on desserts or drinks, such as bubble tea shops. They get additional delivery orders and online exposure because customers can add them to their food orders.”Delivery drivers are considered independent contractors at Chowbus, but they keep 100 percent of their tips and are incentivized to work during popular time slots for additional pay. Kuan Ren, a Chowbus contractor in Chicago, has been with the platform for two and a half years. He came to the U.S. from China in 2014 and worked as a delivery person at restaurants before joining Chowbus. Through a translator, he said, “I get 20 more orders a day on average. The information for every customer that the platform provides is very helpful, and the customer service is there to support me, as they speak Chinese.” While Ren takes pride in being part of a company founded by Chinese immigrants like himself, Chowbus has also been extremely convenient. “It feels very smooth to communicate, language-wise and culture-wise. We think in the same way,” he says.In the near future, Chowbus plans to expand to additional cities, and has introduced a \"dine-in\" function, which allows diners to order and pay from their phone for a contactless dining experience at their favorite restaurants. “We feel responsible to help our partners recover faster and become stronger, due the disruption of the pandemic,” Wen says. “We are able to give them better support, more attention, and help them transition to the digital age, so that they can compete effectively with the larger, more technologically savvy competitors.”Traiilo, Black and Mobile, and Chowbus are just the beginning of this industry shift. ChopEats, a bilingual delivery app that works exclusively with Asian restaurants, has recently started operating in Madison, Wisconsin. Runningman, a small delivery service offering multi-restaurant orders from restaurants in Los Angeles’s Koreatown, received national attention thanks to its neighborhood focus and its decision to forgo commissions on orders, instead charging customers directly for the distance the driver travels to deliver the food.For these companies, their delivery operations aren’t just an alternative to the Wild West–like practices of bigger platforms but a way to uplift and support their clients and customers. “My focus is to simply help Black restaurants and Black people economically,” Cabello says. Salcedo wants to see Traiilo “in every major Hispanic city.”“COVID-19 has exposed the flaws of the system,” he says. “We want to give our community the tools and guidance to succeed.”Explore Bon AppétitTechnologyRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-27", "author": ["Condé Nast", "Flora Tsapovsky"]}