{"id": "668741d8f178bd0ef799a90b46bd3320", "url": "https://www.bonappetit.com/story/carlie-steiner", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Carlie Steiner Is Making the World More Fun to Drink In | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCarlie Steiner Is Making the World More Fun to Drink InAnd at her D.C. restaurant Himitsu, she's not afraid to set her guests straight.By Alex BeggsDecember 7, 2018FacebookTwitterEmailFacebookTwitterEmailIn our series Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Up next, Carlie Steiner, the co-owner of Himitsu in Washington, D.C. and all-around powerhouse in the wine and spirits world.When I met Carlie Steiner for breakfast at Ellē, she was late as hell. It was all good. I had nowhere to be, stuff to read, conversations to overhear—and when things get too perfect, you know it’s all about to blow up in your face anyway. She hopped in, crutches under her armpits. Ah, shit. A few days earlier, she’d torn her ACL in a bike accident, and you know that stuff about perfect worlds all blown up? Hers just had.Steiner is the co-owner of Himitsu, one of our favorite restaurants in D.C., where she also runs the drinks program. If you go, here’s my move: Line up at Himitsu at 4:30 p.m. even though it hurts, make it your mission to sit at the bar, order a glass of Baia’s funkadelic skin-contact wine, all of the crudos, absolutely the fried oysters, and oh my god they have Peking duck now? I gotta go back.So the restaurant’s amazing and the drinks are bomb, but the reason Steiner is a Person of Interest is because she represents a new generation of industry leaders. Her sommelier philosophy champions women winemakers, her hospitality philosophy puts family first, and nothing stands between her and her team. The manual she wrote for her employees includes generous policies for personal days and instructions for how to read body language and how to take action if a guest is sexually harassing a staff member—or another patron. Oh that’s nice in a book, you’re thinking, but it translates to the floor of Himitsu, where Steiner circulates and keeps a lookout. “I might not be the best boss in the world, but I’m a damn good mom,” she tells me. (Not literally—she’s keeping a mother’s eye out for her team, though she also has a fluffy white dog named Storm.)We ordered nearly everything on the breakfast menu plus the anchovy-topped Caesar salad at Ellē, and while I shoved peanut butter doughnut in my face, Steiner had a London Fog and laid it all out for me. The secrets of the universe...or at least a handful of them.I feel empowered when... I lift. I’d never worked out a day in my life before I joined a gym earlier this year. My friend said, ‘Come to the pool with me.’ I was like, ‘Oh, hell yeah.’ You know, the Vida pool is super gay. I had the best day ever. It was like, All right. I’m gonna join this for the pool. I realized it’s a really empowering space. I can't tell you how many people have said, ‘But, don’t get too strong.’ ‘You look good where you are.’ ‘Don’t go anymore.’ I’m like, ‘Yeah, no.’ I want to look beefy.I find joy in... Queer spaces. I have more fun when I’m hanging out with a bunch of gay people. It’s still not ‘normal’ to be gay. But [in queer spaces] I’m like, No, no. It’s normal.I work hard:  Educating my staff. [Ending sexual harassment] comes down to the management in restaurants, it comes down to owners in restaurants. Kick more people out, and take authority. I’ve seen dates where I could clearly tell the woman was super uncomfortable. I asked, ‘Would you like another round of cocktails?’ She said, ‘No, I'm okay.’ The man said, ‘No, she’ll have another.’ That’s when I directly looked at him—and because it’s my space, I have the privilege to do this, but I also tell my team, 'You are empowered to do this. I would never fire you.' So, I said, ‘No she won’t. She said no.’ Oh my god, I thought this guy was gonna punch me in the face.The biggest lesson I learned from working for José Andrés was... Take care of your staff, not your guests. Because your staff will take care of your guests. José Andrés is the only person I look up to in this world more than my dad. He’s everything to me. He’s a mentor. He is a personal friend. I want to be him like 100 percent. The thing is, at the end of the day, do you want to be a cook, do you want to be a chef, or do you want to change the fucking world?The best part of the restaurant industry is... The community, the family that you create, and the experiences you’re able to create for other people.The worst party of the restaurant industry is... The constant and ongoing sexual harassment and not having a work-life balance.A good morning looks like... Gaining a new weight at the gym. Competing with myself, like I always do.Every day I... Do something gay. I purposefully say things when I do interviews now to get the stigmas taken away. To normalize lesbians and normalize mental health problems.I feel grounded when I’m... Doing yoga. It’s such a basic answer, but it’s literally a reason so many people do it. Like straight-up savasana though. I’m not talking about hard stuff. I just want to lie on the ground.I used to... Drink too much. I was 21. You think, You can’t be an alcoholic at 21 but when I was working at Mini Bar, we’d get blackout every single night, five nights a week. You just think, This is a bartender’s life. It took a toll on my body and it took a toll on my mental health. Alcoholism runs in my family; alcoholism runs in my community. But I’m not here to preach about not drinking either. I still drink because I’ve learned that if I cut myself off completely from anything, then I want to do it. I just tell myself, ‘Well, indulge when you want, but normally don’t.’ That’s a much better method for me.I’m inspired by... Ashtin Berry. She just keeps me in check. She keeps everyone in check. She’s probably my biggest source of education right now outside of my own readings and studies. I’m just trying to be a more inclusive, better person. She has a very direct way of talking to people that, for me, works.The cocktail that the world needs right now… Is a daiquiri. We should all be drinking more daiquiris.Explore Bon AppétitPerson of InterestWashington, D.C.WineRead MorecultureHospitality Activist Ashtin Berry Enjoys Caviar Potato Chips, Radical Self-Awareness, and a Good Twerk SessionBy Shanika HillocksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-07", "author": ["Condé Nast", "Alex Beggs"]}