{"id": "669b492a0f3124bd1aa3b1dd049e5fb0", "url": "https://www.bonappetit.com/story/best-cutting-boards", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "The Best Cutting Boards, According to Professional Chefs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Cutting Boards, According to Professional ChefsWhether wood, rubber, or plastic, we’ve got something for every home cook.By Ali FrancisDecember 22, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The season of endless chopping has arrived. A good cutting board is your winter workhorse for prepping custardy roasted sweet potatoes, cheesy butternut squash bakes, and vibrant winter salads. Along with a fresh haul of stubborn-skinned root vegetables comes a series of pressing questions: What types of cutting boards are there? What are the best cutting boards? How many of each do I need? And, of supreme importance, what should I do with that frosted glass board Great Aunt Mabel gifted me 35 holidays ago?Whether you’re adding to your current chopping board collection or just looking to replace a warped old thing, you’ll need to know which boards are the most durable, gentlest on your knives, and pretty enough to adorn your countertop. To get you through the coming months of cold-weather meal prep, we tapped the pros—executive chef Suzanne Cupps, who chops a helluva lot of veggies over at 232 Bleecker, along with test kitchen director Chris Morocco and chef Andy Baraghani. The experts all agree: The best cutting boards are made from wood, rubber, or plastic. Here’s how they compare.The Best Wooden Cutting BoardsAs a cutting board material, wood is soft enough to protect your chef’s knife but still hard enough for smooth cuts, making it perfect for prepping everything except raw meat, Morocco says. (Though you can do that too, if you’re willing to give them a thorough, soapy hand wash afterwards.) The best wood cutting board, according to Baraghani, is made of maple or walnut, because those are the softest and most beautiful. But we’ve outlined a range of others—like the best bamboo board—that come with their own set of perks.  Most wood boards tend to “heal” themselves (i.e., they close up those cut lines after use), which prevents germ-harboring grooves from forming and keeps them in good shape for longer. On the flip side, wood is also the most absorbent board material, which means it tends to retain odors and stains. Cleaning and caring for wooden cutting boards requires a bit more work than plastic and rubber. To keep yours in tip-top shape, you should wash and dry both sides evenly so it doesn’t warp and slick the surface with mineral oil or beeswax every other week. John Boos Mystery Butcher Block Oil$14 at AmazonThis Five Two Double-Sided Bamboo Cutting Board is a great all-rounder. It’s lightweight and pretty enough to serve up your favorite charcuterie platter. It's also a reversible board, with one side that's a flat and smooth cutting surface and the other that features a juice groove to catch liquid plus a slot to prop up your iPhone while cooking. Bamboo boards are more porous than your traditional maple wood, teak, acacia wood, and walnut wood boards. This means they take a little more elbow grease to clean but tend to be stronger than the aforementioned other types of wood.Five Two Bamboo Cutting Board$59 $41 at NordstromA John Boos block is our go-to large cutting board. When you need to prep full meals fast, having ample surface area is key, and this reversible maple cutting board will be nice and gentle on your knife edges. It’s an edge grain board, which means it was made with strips of wood that are arranged side-by-side and then grafted together. This technique makes the board super beautiful (all those stripes!) but not quite as resistant to cuts and scratches as end grain cutting boards (see below).John Boos Maple Wood Reversible Cutting Board$124 at AmazonThis heavy duty, high quality John Boos butcher block is a splurge that’ll last you a lifetime. It does everything the sister board above does but is thicker and made using an end grain technique. A board like this is composed of short pieces of wood that are arranged vertically and then fused together. Because the ends of each piece make up the cutting surface area, your board boasts a stunning checkerboard pattern that allows your knife’s edge to sink easily into the wood fibers. It’s a one-two punch: Your favorite knife stays sharp, and your board heals quickly from nicks and scratches.John Boos Maple End Grain Chopping Block$256 at AmazonAn end grain cutting board in action\nFor a teeny, travel-friendly option, we love this adorable portable board. It’s smaller than most paperback books, which means you definitely have room in the pack for it, and comes in a chic leather case to protect it from spills. No more cutting apples on rocks!Photo by Emma FishmanTravel Cutting Board$45 at EtsyThis pretty walnut cutting board from Our Place is our top pick if you chop a lot of juicy fruits. Unlike regular, flat cutting boards, one side of this handsome board slopes down into a little juice trench that’s been carved into the wood. It’s made of soft walnut, which is perfect for repetitive tasks—like dicing herbs—that wreak havoc on your knives. And it doubles as an ideal serving platter for showcasing a fresh fruit spread with some hunks of cheese and requisite prosciutto coils. A word of warning: For the first few uses you might notice some wood splintering. With proper care, this will settle over time.Photo by David Kitz/courtesy Our PlaceOur Place Walnut Cutting Board$95 at Our PlaceThe Best Rubber Cutting BoardsEven softer than wooden cutting boards, rubber cutting boards are most commonly used in restaurants. For all chopping tasks, including raw meat, these boards are Cupps’s top pick.  “They’re durable, sturdy,” and easy on your knife, she says. Morocco agrees, adding that they’re simpler to care for, too; they aren’t usually dishwasher safe but, unlike wooden boards, they don’t need to be oiled. Just wash them with mild detergent and leave them to air dry. A couple of drawbacks: They “don’t have as nice a tactile feedback on a knife as wood does,” he says. While they will last for many years, rubber boards also tend to be pricier and heavier than their plastic brethren.For price to quality ratio, we love NoTrax's professional-grade Sani-Tuff Premium Rubber Cutting Board for daily use. It’s reversible, large enough for most home cooks, and won’t dull your knives or harbor nasty bacteria.NoTrax Sani-Tuff Premium Rubber Cutting Board$99 $79 at AmazonFor a slightly smaller, synthetic rubber board, the Asahi Cooking Cut does everything the NoTrax does but for less money. If you have a small kitchen or minimal bench space, this one's for you.Asahi Rubber Cutting Board$50 at AmazonThe Best Plastic Cutting BoardsThe biggest things going for plastic cutting boards is that sanitizing them is easy—most are dishwasher safe, though very hot temps could result in warping—and they’re cheaper than most wood and rubber boards. Plastic is also a less absorbent material than wood (and about the same as rubber), Morocco explains, which means they won’t harbor bacteria easily. In other words: They’re good for home cooks who want to cut up raw chicken or chop chocolate without fear of picking up yesterday’s minced garlic juices. Plastic is a popular choice because it’s lightweight, Cupps concedes, “but it can also be slippery, which isn’t safe.” Morocco recommends laying a damp dish towel, paper towel, or nonslip rubber mat under your plastic board to keep it steady. They’re also probably not the move if you’re looking for a super long-lasting purchase. Plastic boards tend to warp more easily than rubber, can get irreparably scuffed, and “develop deep grooves [with frequent use], that make them less sanitary over time,” Morocco says. Still, if you’re looking for affordable all-rounders, you’re in the right place.The OXO Good Grips cutting and carving board is a great option for home cooks wanting to chop veggies and slice up raw and cooked meats. It’s a fairly large cutting board, the juice groove catches any stray liquid, and the rubber ‘feet’ prevent slippage—excellent news for anyone wielding a sharp knife.OXO Good Grips Carving & Cutting Board$29 at AmazonThese colorful, mid-sized ReBoard cutting boards by the kitchenware enthusiasts at Material are a supremely pretty and lightweight option suitable for most tasks. Made from repurposed sugarcane fiber and upcycled plastic, they’re dishwasher safe and more sustainable than the majority of plastic cutting boards.Material reBoard Cutting Board$35 at MaterialThis Fredricks and Mae confetti chopping block is one of the most joyous things we’ve seen in a while. Perfect for prep and presentation, it’s niftily made using the bits and bobs leftover from producing solid color plastic boards. Associate food editor Zaynab Issa likes that the \"confetti-like flecked patterns offer even more visual camouflage\" than plain black cutting boards, \"disguising discoloration and knife scratches.\" Your charcuterie platter is dying to get in touch.Fredericks & Mae Cutting Board$95 at Bon Appétit Market$100 at Coming Soon New YorkThe Best Glass Cutting BoardsIt's a trick! That glass cutting board from 1985 is brittle and breakable. Best case scenario? The extremely hard surface has no give, so you risk dulling, chipping, or even breaking your chef’s knife, according to Baraghani. Worst case? You’re going to be vacuuming shards of glass off the kitchen floor. Morocco could think of only one reasonable use case for glass boards: “They make a perfect gift for your enemies.”Of all the kitchen tools and gadgets, cutting boards are where you want to invest. If you’re serious about cooking and have the space, you might want to buy multiple cutting and carving boards. Buy a specific (color-coded) rubber or plastic board and designate it for tasks like breaking down chicken or filleting fish, which will help you avoid cross contamination. For vegetable prep, when your knife is interacting with the board more, opt for “wood or rubber, which will be so much gentler on your blade and feel more pleasant\" to work with than plastic, Morocco says. Whatever your preferences, Cupps and Baraghani agree that while three boards is the dream—a smaller one for jobs like cutting cheese or crushing garlic and then two large ones to keep meat and vegetables from fraternizing—a minimum of two is ideal. And if you really can’t bear to disappoint Aunt Mabel, save your glass cutting board for serving snack platters, an onion galette (presliced!), hunks of this cheesy apple crumb bar, or pre-topped tinga tostadas with bacon-y black beans.Explore Bon AppétitKnivesToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-11", "author": ["Condé Nast", "Ali Francis"]}