{"id": "66bc684433337ee8e523df1d042bb63e", "url": "https://www.bonappetit.com/story/beer-shandy-cocktail", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "How to Make a Shandy Cocktail with Cheap Beer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You Can Open a Cheap Beer, You Can Make This CocktailThe shandy is the ultimate day-drinking drink.By Alison RomanJuly 12, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.You could technically refer to a shandy as a beer cocktail. And while this wouldn’t be wrong, making one takes about as much effort as cracking open a beer. A shandy, loosely defined as beer poured over ice and topped with a tart-sweet mixer, is a gloriously unfussy drink.It’s all about honoring the tenets of summer, which include consuming alcohol and quenching thirst—ideally simultaneously. If the thought of drinking beer on ice horrifies you, lest the dilution degrade the integrity of the brew or whatever, know that I‘m talking about using the cheap stuff, not some hopped-up IPA or chocolaty stout.The shandy is especially friendly for hot-weather gatherings that last well into the evening since it’s the kind of low-ABV all-day sipper that keeps you in check (and, uh, hydrated?). I recommend staying away from hard alcohol while the sun's out—daytime drinking is a marathon, not a sprint.Bonus points if you add a paper umbrella.\nPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiMaking shandies for a crowd requires almost nothing on your part. The ingredients are store-bought, the drink is built right in a cup (no pitchers needed), and people can make their own, regardless of skill level.Here’s how it’s done: Just fill a tall glass of ice two-thirds of the way with the inexpensive beer of your choice (I’m a Tecate woman), then top with any number of refreshing drinks such as Ting, lemonade, or kombucha to taste. And although this low-key drink is antithetical to garnish of any sort, I wouldn’t say no to one of those cute paper umbrellas.You know what goes well with beer? Grilled food, that's what:With a Mini Grill, the World is Your CookoutBuy a mini grill, fulfill all of your summer hot dog fantasies. (So, all of your fantasies.)View StoryExplore Bon AppétitParty TricksCocktailbeer cocktailBeerSummerSummer DrinksRead MorecookingThis Spicy Grapefruit Shandy Is the Only Shandy Worth Drinking, IMHOBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Alison Roman"]}