{"id": "66c07f79c9b45643e4be9736f998111b", "url": "https://www.bonappetit.com/story/avocado-water", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Avocado Water Is Way More Delicious Than it Sounds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Life Gives You Avocados, Make WaterLess dipping, more sipping.By Carla Lalli MusicFebruary 21, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.There are a thousand reasons why you’ll never make this recipe, and the main reason is because it’s called Avocado Water.I have no one to blame but myself, but for crying out loud, can we try a little harder with these recipe names? Honestly! Here are some options, right off the top of my head: Whipped Avocado Beverage. It’s Green But Don’t Worry About It Drink. Glass O’ Guacamole. Dairy-Free Lizard Mylk.Want this letter before it hits the website? Sign up for our newsletter!Right. Avocado Water. I’ll be perfectly honest with you, the first time I heard about this frothy concoction, I was dubious (at best). But senior food editor Chris Morocco, who got the recipe from NYC chef Daniela Soto-Innes, said it was good, and there is no one more credible, more sound of mind, and more believable than Chris Morocco.Drink up.\nPhoto by Alex LauThese are some of the sensible, avocado-positive things that Chris told me when I scrunched up my face at him and said, “You expect people to drink that?” First of all, remember that avocado is a fruit. Yes, it’s green, but the prevailing flavor of a just-ripe one is mild and sweet, similar to fresh coconut. Think of it’s high fat content like the starchy flesh of a banana—ultra smooth when blended. And when it comes to said blending...there’s ice to lighten, dilute, and chill; plain old H20 to make it quaffable; fresh lime juice to counter the richness; sugar to make it palatable and refreshing; and salt to make you crave more.It does make sense when you think about it that way, doesn’t it? I know you have a kitchen full of avocados, because you bought extras for the Super Bowl. So why not try something other than a big bowl of guac? Like that tattooed, shirtless Adam Levine guy in the halftime show, maybe it’s time to take a chance on life. Unlike that guy, do something you won’t regret. Show the world you’re unafraid: Go drink an avocado. Just, whatever you do, don’t look at the recipe picture. It’s looks like a sad glass of thickened pea juice sitting in the middle of a hot rock garden. Some recipes just can’t catch a break.Get the recipe:Avocado WaterAvocado gives this refreshing drink the creamy, sippable texture of a milkshake but without a drop of dairy.View RecipeExplore Bon AppétitCarla NewsletterAvocadoRead MorecookingOnly Vitamin C Can Save Us NowBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-07", "author": ["Condé Nast", "Carla Lalli Music"]}