{"id": "66c346292b802e3f726b57e974be5e98", "url": "https://www.bonappetit.com/story/focaccia-pizza", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Make Focaccia Pizza Using Basically's No-Knead Focaccia Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Turn Basically's Focaccia into Focaccia PIZZA!The only thing better than focaccia? Focaccia topped with delicious stuff.By Sarah JampelApril 25, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailThis no-knead focaccia is a lot of things—fluffy and light inside, but with crisp oil-fried edges that make it nearly impossible to stop eating—but there’s one thing it’s not: pizza. CORRECTION: It's not pizza yet. With a little bit of creativity, a few toppings, and the acceptance that focaccia pizza will always be closer to a Chicago deep-dish pie than a New York slice, your focaccia dough can be pizza. Here’s how:First, decide what sort of vessel you want to bake the dough in. If you desire a topping to dough ratio that’s closer to that of a standard pizza, bake it on a rimmed half sheet tray, which will give the dough more room to spread out and produce a thinner crust. If you’re in it for a bready bottom (hehe), go with a 13x9\". If you’re not feeding a crowd, you can easily halve the recipe and bake the dough in a 9\" cake pan, a medium cast-iron skillet, or a quarter sheet tray. (The cook times will be approximately the same, but as always, set your timer early and bake to indicator, not to the time.)Once your dough is in the pan and has doubled in size, proceed to dimple it and drizzle it with olive oil. At this point you can add any toppings that aren’t wet—crushed olives, sprigs of rosemary or thyme, thinly sliced red onion or shallot—before baking as usual.BUT if your plan is to add a high-moisture and/or heat-sensitive topping—like crushed tomatoes or grated cheese—you’ll want to parbake the dough: Put it in the oven for 20 minutes, sans toppings. When you pull out the focaccia, it’ll be slightly blond but firm enough that those wet toppings won’t seep into the dough, which would prevent it from fully rising and result in a soggy mess.Once the focaccia is parbaked, then add your toppings, trying not to overload it no matter how excited you get. Start with a thin layer of tomato sauce, then add cheese, maybe pepperoni, and return to the oven for 5 to 10 minutes, until the cheese is bubbling. Finish with torn basil, grated parmesan, and a scattering of crushed red pepper flakes.Or try any of these other combinations:Caramelized onions + mozzarella (as shown above)Thinly sliced lemon + oil-cured black olivesTomato sauce + anchoviesThinly sliced boiled potato + scallions + cheddar cheeseSo maybe not everyone can be everything for everyone—but this dough CAN be your pizza and your focaccia, too.Get the recipe:Shockingly Easy No-Knead FocacciaIf you want to fill your kitchen with the smell of fresh-baked bread but you're nervous about shaping a boule or working with a starter, focaccia is the best place to begin. We're not exaggerating when we say it requires zero skill and provides ample opportunity to be amazed by yourself and by the wonders of yeast. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-25", "author": ["Condé Nast", "Sarah Jampel"]}