{"id": "66c45627f5858c93b572ba2de4eaa897", "url": "https://www.bonappetit.com/recipe/grilled-summer-squash-and-red-onion-with-feta", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Summer Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Summer Squash and Red Onion with FetaBy Claire SaffitzMay 21, 20194.8(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintSay it with us: No more squishy, bland summer squash! This year, we're flipping the script and marinating after grilling. Inspired by the technique called escabèche, where cooked fish and meat are preserved in an acidic mixture, we're cooking first, marinating second. In the case of squash, it produces maximum flavor without compromising char or texture. To ensure that the squash is crisp-tender, do pull it off the grill as soon as it's picked up some grill marks and a paring knife easily slips through the flesh.Ingredients4 servings½cup plus 3 Tbsp. extra-virgin olive oil, plus more for grill1garlic clove, finely grated¼cup white wine vinegar4medium summer squash and/or zucchini, cut lengthwise ¼\" thick1medium red onion, cut through root end into 8 wedges2bay leavesKosher salt, freshly ground pepper8oz. feta, crumbled into large pieces4banana peppers from a jar, thinly sliced crosswiseGenerous pinch of crushed red pepper flakesPreparationStep 1Prepare a grill for medium-high heat; lightly oil grate. Whisk garlic, vinegar, and ½ cup oil in small bowl to combine; set marinade aside.Step 2Toss squash, onion, and bay leaves on a rimmed baking sheet with remaining 3 Tbsp. oil to coat; season generously with salt and black pepper.Step 3Arrange squash and onion on grate. Grill squash, undisturbed, until grill marks appear, about 3 minutes. Turn over and grill on second side until tender and starting to release liquid, about 2 minutes. Transfer squash back to baking sheet. Grill onion, turning occasionally, until tender and charred around the edges, about 5 minutes. Transfer back to baking sheet.Step 4Arrange squash, onion, bay leaves, and feta on a rimmed platter and pour reserved marinade over. Scatter banana peppers on top and sprinkle with red pepper flakes. Let sit at least 15 minutes and up to 1 hour before serving.How would you rate Grilled Summer Squash and Red Onion with Feta?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis was really good as written.  I grill squash often and it was a nice upgrade from EVOO and S&P.  I didn't get the Bay Leave contribution. Maybe would have made a better contribution if added to the marinade early on. Also didn't get using 3 Tbls. of oil to grill when you had a bowl of fantastic garlic infused EEOO. Next time I'll just brush everything lightly with the marinade for grilling. The marinade with the Feta was really perfect.  I think going forward I would just include the Feta in the marinade from the get go and then spoon over the grilled vegetables at the end as directed. I'll definitely be doing this again.  Thanks.J. WayneAlexandria, VA9/7/2021I've tried this recipe fairly close to how it was written--it was a big hit--and made a few alterations (ie: parmesan cheese, less oil, with and without the marinade... etc.) and it is delicious. As a gardener with seasonal selective memory loss, every spring I plant too many zucchini plants, and while I love zucchini bread, I love any way to use them up in new, creative ways. Two thumbs up! AnonymousSalt Lake City8/19/2021So good! Because this is best served after sitting/marinating for a short time, it is the perfect side for a summer barbecue or entertaining. Grill the squash outside or inside - just be sure not to overcook. The squash can handle the oil in the marinade if it is still quite firm. I've made several times as is, and recently swapped the feta for queso fresco and served with pork tacos! Don't throw the leftovers out - they're just as good then next day!AnonymousJacksonville, FL2/17/2021Great recipe! Agree with comments about less oil. I made a large serving for a bbq and had left overs which were even better the next day! Recommend making at least an hour before serving. I served mine 15 minutes after grilling and it is much better room temperature. AnonymousOhio9/3/2020This recipe is fantastic. Such a unique way to cook summer squash that really lets the flavors shine. I subbed peperocini for banana pepper and it was great. Like others said, there was a lot of oil, but I just served with bread to mop it up. This will be my new, go to, summer squash recipe. ClaireW17Dallas8/13/2019Love, love, LOVE!  What a quick, easy way to pump up the flavor on summer squash.  My husband isn't usually a big fan, but everyone gobbled this up, saying they could eat it as a meal itself.  Agree with previous reviews that the oils seems like a bit much, so next time, I'll scale that back.  We had some really good French bread to sop up the flavored oil with this time.  Super quick and easy and the room temperature at serving was great, instead of hot off the grill.  We'll definitely be doing this one again!AnonymousTexas7/1/2019This was great - strong flavors, very light and summer-y!  I thought the oil looked a bit much so I scaled it back a tablespoon or two, and I’d probably omit another couple next time.  Also my grocery store didn’t have banana peppers (?!) so I sliced up some peppadew peppers instead and it worked fine - I bet pepperonis would work too!kdb133DC6/16/2019So, I made this and the flavors were really great. I used zucchini and squash. However, I let the veggies marinate for the longer end of the window and found them much too oily, especially after all the oil put on them before grilling. In the future, I would make this again, but use half the amount of marinade and only drizzle it on I think.AnonymousNashville, TN5/31/2019Explore Bon AppétitSummer SquashSquashVegetableRed OnionOnionFetaCheeseZucchiniSummerQuickEasyWeeknight MealsSideGluten-FreeNut-FreeVegetarianKetoHealthyishGrillingFourth Of JulyDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}