{"id": "66c81c94aa24737896fbf4f4b1709121", "url": "https://www.bonappetit.com/recipe/vegetable-nasi-goreng", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Vegetable Nasi Goreng Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetable Nasi GorengBy Lara LeeOctober 15, 20204.3(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrint“It is no wonder that Indonesians eat nasi goreng for breakfast, lunch, and dinner,” says Lara Lee, the author of Coconut and Sambal: Recipes from My Indonesian Kitchen. Leftover rice is transformed into an umami-laden fried rice topped with a crispy fried egg and a side of crunchy kerupuk (savory prawn crackers that stimulate the appetite). Named as one of Indonesia’s national dishes and described by some as the world’s greatest comfort food, nasi goreng is often seasoned with a combination of light soy, the fermented sweet soy sauce kecap manis, chiles, turmeric, and white pepper. Lee’s version is a feast of texture and flavor, adding the fresh citrusy zing of the lemongrass and makrut lime to the sambal matah, a beloved condiment eaten all over the island of Bali. (If you want to make it vegan, simply omit the fried egg.) Ingredients2–4 servingsSambal Matah4small shallots, thinly slicedKosher saltZest and juice of 1 makrut (Thai) lime or 1 regular lime2makrut (Thai) lime leaves, thinly sliced, or zest and juice of 1 regular lime2lemongrass stalks, bottom third only, tough outer layers removed, thinly sliced2long red chiles (such as Holland or Fresno), finely chopped, seeds removed if you prefer less heat11½\" piece ginger, peeled, cut into matchsticks1garlic clove, thinly slicedPalm sugar or brown sugarSunflower oil or other neutral oil (for drizzling)Nasi Goreng3Tbsp. virgin coconut oil or sunflower oil, divided½leek, white and pale green parts only, thinly sliced2small shallots, thinly sliced1long red chile (such as Holland or Fresno), thinly sliced, seeds removed if you prefer less heat¼tsp. ground turmeric1bok choy, coarsely chopped3cups cooled cooked jasmine or basmati rice2Tbsp. kecap manis (sweet soy sauce)4tsp. light soy sauce1tsp. tomato purée½tsp. unseasoned rice vinegar or white wine vinegarKosher salt, freshly ground white pepper2large eggsHomemade or store-bought fried shallots (for serving)1scallion, thinly sliced on a diagonalKerupuk or prawn crackers (optional)PreparationSambal MatahStep 1Place shallots in a small bowl and sprinkle with a generous pinch of salt. Let sit at least 15 minutes. This will take the raw edge off them.Step 2Mix makrut lime zest and juice, makrut lime leaves, lemongrass, chiles, ginger, and garlic in a small bowl to combine. Add shallots and add palm sugar to taste. Taste and season with more salt and/or lime juice if needed. Drizzle with oil; set aside.Nasi GorengStep 3Heat 2 Tbsp. oil in a large wok or skillet over medium. Add leek and shallots and cook, stirring, until just softened, about 5 minutes. Add chile and turmeric and cook, stirring, 2 minutes, then add bok choy and cook, stirring, 1 minute.Step 4Add rice to pan and cook, breaking up any clumps with a wooden spoon and stirring to combine well, until rice is warmed through. Add kecap manis, soy sauce, tomato purée, and vinegar and stir well to combine, then stir in sambal matah. Remove fried rice from heat and season with salt and pepper.Step 5Meanwhile, heat remaining 1 Tbsp. oil in a large nonstick skillet over medium. Crack eggs into pan and cook until whites are partially cooked, 2–3 minutes. Tilt pan and spoon hot oil over egg whites until fully cooked (I like my yolk runny, but cook yours to your liking). Season with salt.Step 6Divide fried rice between plates and top with fried shallots, scallion and a fried eggs. Serve with crackers if desired.Step 7Recipe excerpted with permission from Coconut & Sambal, by Lara Lee (Bloomsbury Publishing). Copyright © 2020.How would you rate Vegetable Nasi Goreng?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleEasy to make a few times a week. Loved the inclusion of more veg. 1000% tasty AF. Haven't eaten this for 10+ years. Truly enjoyed this recipe!!!!Alodie WestenbroekCanada10/13/2021I'm irrationally upset at the inclusion of one teaspoon of tomato purée. What the heck am I supposed to do w the rest of the can?? I'm not buying it just for a teaspoon of tomatoAnonymousUlm, Germany8/30/2021Is the rice already cooked before adding to the recipe?Jeff7/13/2021This was... weirdly sweet? It might be my fault - I couldn't find kecap manis so I made my own based on a recipe I found (soy sauce + brown sugar). That plus the sugar in the sambal matah just made for a sticky, almost candy-like concoction that is not the nasi goreng I am used to. The chiles were basically raw and VERY spicy. If I made it again, I would cut way down on the sugar and chiles. All in all, not really for me. My husband said he liked it though, so I guess it's a wash? AnonymousLos Angeles1/26/2021Way too hot for us! Flavors were good, but not a keeper for me. I don't like my mouth and lips to feel scorched!AnonymousPhiladelphia, PA1/11/2021It's perfect. It's so delicious. I used carrot and spinach instead of bok choyAnonymousIndonesia11/8/2020What a great weeknight treat, can't wait to try!AnonymousBrooklyn, NY 10/16/2020HlpAnonymous10/16/2020This recipe is so simple and wonderful! I didn't have lemongrass or scallions and subbed lime for the lime leaves and red onion for shallots (blasphemous, I know, but trying times here) and made it anyway! It was delicious, quick, and flavorful. AnonymousMinneapolis10/15/2020Explore Bon AppétitFried RiceIndonesianSoutheast AsianAsianRiceRice & GrainsOne-Pot MealsMainVegetarianDairy-FreeSautéRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-15", "author": ["Condé Nast", "Lara Lee"]}