{"id": "66d7fd6d437f96f803636e174c88f179", "url": "https://www.bonappetit.com/story/sweet-potato-bowl-recipe", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "This Sweet Potato Bowl Is the Best Single-Person Dinner of All Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Sweet Potato Bowl Is the Best Single-Person Dinner of All TimeThis sweet potato bowl recipe is my guaranteed feel-good, taste-great weeknight dinner for one.By Anna StockwellFebruary 12, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna Stockwell, Prop Styling by Emily EisenFacebookTwitterEmailIt took me a long time to be good at cooking for myself when I first started living alone. But I’ve gotten better at it—I even enjoy it sometimes—and I’ve learned some good tricks for making nourishing dinners like this sweet potato bowl when I come home exhausted on a weeknight and need to talk myself out of ordering takeout. (Why it’s easier for me to justify cooking for loved ones is a question I’m still figuring out).I try to always have sweet potatoes in my kitchen. They keep for a long time, I will always be excited to eat them, and I’ll always feel good about the choice. Sometimes, I’ll slice one up into wedges, toss it in coconut oil, and make oven fries, or I’ll roast a few whole ones on a Sunday to repurpose in various ways during the week. But, more often than not, I make what I like to call a sweet potato bowl.My weeknight sweet potato bowl never takes longer than half an hour to prepare. Either it starts with half a leftover roasted sweet potato, or I quickly half and steam a fresh one. While the potato steams, I prep some meat and/or vegetable toppings to smother over my soft warm sweet potato (that’s how we turn it into a “bowl”—see?)These days, I’m into topping my sweet potato bowl with a little bit of ground lamb (I keep some in my freezer at all times) spiced with cinnamon, cumin, and Aleppo-style red pepper flakes and fried to a flavorful crisp with a bunch of wild mushrooms. To balance out that earthy richness with a pop of brightness, and to get some more vegetables into my bowl, I quick-pickle some thinly sliced fennel and red onion while the lamb cooks. I make a super simple yogurt-lemon sauce, drizzle that all over the sweet potato, top it with the lamb and mushroom mixture, then pile the tangy pickled veg and some fresh mint on top.My recipe here serves two—because if you’re making one you might as well make two. You can share it with a friend, or you can store the elements separately in the fridge and reassemble your second sweet potato bowl for dinner tomorrow. I’m never mad about eating this one two nights in a row. It’s warm and comforting and better than any takeout I could order, and it’s all mine.Start up your steamer:Sweet Potato Bowls with Spiced Lamb and MushroomsThese sweet potato bowls are an easy go-to weeknight dinner: Steam the sweet potatoes while you sauté the mushrooms with spiced ground lamb, quick-pickle fennel and onions, make a simple yogurt sauce, and dinner is ready in about half an hour.View RecipeExplore Bon AppétitSweet PotatoHealthyishDinnerRead Morerecipes46 Best Sweet Potato Recipes to Cook This FallGallery46 SlidesBy Mehreen KarimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Anna Stockwell"]}