{"id": "66f449f5a922c3ba2431734d8d9ab5d5", "url": "https://www.bonappetit.com/recipe/creamy-braised-beans-with-charred-pickles", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Creamy Braised Beans With Charred Pickles and Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueCreamy Braised Beans With Charred Pickles and CroutonsBy Jason VaughanSeptember 14, 2021EmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBean love runs deep in the kitchen at Tiny Champions in Houston. Chef Jason Vaughan recommends using the best-quality beans you can find (like Rancho Gordo) for this recipe. You can skip the toppings and serve these beans with toasted crusty bread, or as an appetizer alongside cheese and pickles. If you want to make this dish vegan, use toum instead of the labneh sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSmall Saucepan$155 At AmazonVegetable Peeler$10 At AmazonCitrus Juicer$7 At AmazonTongs$13 At AmazonIngredients6 Servingsbeans1lb. dried large lima beans5Tbsp. plus ⅓ cup extra-virgin olive oil, divided5garlic cloves, coarsely chopped1Tbsp. freshly ground black pepper1½tsp. fennel seeds½tsp. fennel pollen (optional)1medium onion, finely chopped½fennel bulb, fronds reserved, finely chopped2celery stalks, finely chopped3wide strips lemon zest2bay leaves1⅓cups low-sodium vegetable broth1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus morepickled peppers1lb. fresh banana peppers, Anaheim chiles, or other sweet peppers1small bunch dill1Tbsp. coriander seeds2tsp. black peppercorns1½tsp. fennel seeds1tsp. mustard seeds2cups distilled white vinegar¼cup sugar2Tbsp. plus 1½ tsp. Diamond Crystal or 1 Tbsp. plus 1½ tsp. Morton kosher salt6garlic cloves, smashedCroutons3slices sourdough bread, torn into 1\"–2\" pieces¼cup extra-virgin olive oil1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. freshly ground black pepperLabneh sauce and assembly1cup labneh1Tbsp. fresh lemon juice1garlic clove, finely gratedKosher salt, freshly ground pepperPreparationbeansStep 1Place beans in a medium bowl and pour in cold water to cover, Let soak 1–3 hours, then drain.Step 2Heat 3 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Cook garlic, pepper, fennel seeds, and fennel pollen (if using), stirring often, until garlic is lightly browned, about 2 minutes. Add onion, fennel, celery, lemon zest, and bay leaves and cook, stirring often, until vegetables are softened, 6–8 minutes. Add beans, broth and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, then pour in water to cover beans by about ½\". Increase heat to high and bring to a boil. Cook 10 minutes, then reduce heat to low. Cover and simmer, adding more water if needed, until beans are tender, 60–65 minutes. Taste and season with more salt if needed. Stir in remaining ⅓ cup plus 2 Tbsp. oil.Pickled peppersStep 3Rotate banana peppers directly over the flame of a gas burner until charred all over, about 1 minute per side. (Alternatively, you can broil peppers on a rimmed baking sheet, turning occasionally, until charred all over, about 2 minutes per side.) Transfer banana peppers to a medium heatproof bowl and add dill, coriander seeds, peppercorns, fennel seeds, and mustard seeds to bowl.Step 4Bring vinegar, sugar, salt, and 1½ cups water to a boil in a small saucepan and cook, stirring often, until sugar and salt are dissolved, about 1 minute. Pour into bowl with banana peppers (they should be submerged) and let sit at least 2 hours.Step 5Remove banana peppers from brine and slice before serving.Do ahead: Peppers can be pickled 5 days ahead. Let cool, then transfer to an airtight container. Cover and chill.croutonsStep 6Preheat oven to 400°. Spread bread out evenly on a rimmed baking sheet. Drizzle oil over and toss with your hands until all the bread is lightly coated. Sprinkle salt and black pepper over and toss again to combine.Step 7Bake, tossing after 10 minutes, until croutons are golden brown but still chewy in the center, 18–20 minutes.labneh sauce and assemblyStep 8Mix labneh, lemon juice, and garlic in a small bowl; season with salt. Cover and chill until ready to use.Step 9Ladle beans evenly among bowls and top each with a dollop of labneh sauce and some pickled peppers, croutons, and fennel fronds; season with a grind or two of pepper.How would you rate Creamy Braised Beans With Charred Pickles and Croutons?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleTo Anonymous in CA, check out Step 8 for the garlic.catosixtails@gmail.comNew Mexico1/18/2022there's garlic listed in the ingredients for the pickled peppers, but nowhere in the instructions does it tell you what to do with them.AnonymousCalifornia10/24/2021Explore Bon AppétitLima BeanWhite BeanBeanVegetablePickleCondimentCroutonBraiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Jason Vaughan"]}