{"id": "670016c9edafc20372a3e1b35ee60c42", "url": "https://www.bonappetit.com/recipe/tomato-choka", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Tomato Choka Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueTomato ChokaBy Peter and Jeanine PrimeSeptember 22, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Rey LopezEmailPinterestPrintEmailPinterestPrintIn this Trinidadian vegetarian side, chopped onions, peppers, and chiles get briefly sizzled in hot oil before they’re poured over broiled peak-season tomatoes. Use whatever tomatoes look good (plum, sun golds, heirlooms) then broil them until their skins blister and the flesh softens, leaving them raw in the very center. Serve right away while warm or the next day after chilling in the fridge, alongside all the other dishes in Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast: Fruit Chow, Aloo and Chana, Curry Goat, and flaky Buss Up Shut Paratha Roti.Ingredients4 - 6 Servings2lb. tomatoes½cup vegetable oil½medium red onion, thinly sliced3garlic cloves, thinly sliced2Trinidad seasoning peppers, Cubanelle peppers, ají dulce peppers, or Anaheim chiles, coarsely chopped1Scotch bonnet or habanero chile, finely chopped1Tbsp. thyme leavesKosher salt, freshly ground pepper2scallions, thinly sliced½cup coarsely chopped cilantro2Tbsp. sliced chivesPreparationStep 1Heat a broiler. Broil tomatoes in a single layer on a rimmed baking sheet until skins are charred and flesh is beginning to collapse (cores should still be fresh and raw), about 3 minutes for smaller cherry or Sun Gold tomatoes and up to 15 minutes for larger heirloom or beefsteak tomatoes. Transfer to a shallow bowl or dish and gently crush with a fork or potato masher, removing any stems and tough bits; discard.Step 2Heat oil in a small saucepan over medium-high. Remove from heat; add onion, garlic, peppers, chile, and thyme. Stir to combine and drizzle over tomatoes; season with salt and black pepper.Step 3Just before serving, top with scallions, cilantro, and chives.Step 4Do ahead: Choka can be made 1 day ahead. Let cool; cover and chill.How it all comes togetherStep 5Use the silky shreds of roti to scoop up all the various curries, chows and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Tomato Choka?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMy partner and I loved this recipe, very flavorful and the crispness of the peppers was great. I think the Bus Up Shut Paratha Roti is very important to eat with this.\n\nI used heirloom tomatoes, and they worked very well.Phoenix, Arizona, USA10/2/2020Explore Bon AppétitTrinidadianCaribbeanPlum TomatoTomatoVegetableHeirloom TomatoEasyQuickSideVegetarianVeganDairy-FreeGluten-FreeNut-FreeBroilJuneteenthKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Peter", "Jeanine Prime"]}