{"id": "67063962a950d5d84ed3a216ef839d92", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/azul-y-oro", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Azul y Oro Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityAzul y OroMexican history in a bowl at this breezy University City restaurantFacebookPinterestTwitterEmailPhoto by Matt Taylor-GrossGO: to Azul y Oro for chef and culinary historian Ricardo Muñoz Zurita’s thoughtful takes on traditional Mexican recipes from around the country.ORDER THE: Oaxacan tortilla soup, a rich broth brimming with tender chicken, guajillo chile paste, and fresh crema that will put the watery varietals you’ve had before to shame. It’s served in a giant colorful bowl with a top shaped like La Calavera Catrina, the fancy lady skeleton of Día de los Muertos. Follow it up with cochinita pibil, melt-in-your mouth pork roasted slow and low and served on a crisp tortilla under a tangle of red onions. Oh, and then get the mole!THE VIBE IS: super chill, yet reverent of the surroundings. After all, you’re eating under umbrellas smack dab in the middle of a university campus, National Autonomous University of Mexico, which happens to be a UNESCO World Heritage site. But instead of cafeteria plastic, there’s beautiful plateware sourced from local artisans.PRACTICAL STUFF: Open every day: Monday to Tuesday, 10 a.m. to 6 p.m.; Wednesday to Saturday, 10 a.m. to 8 p.m.; Sunday, 9 a.m. to 7 p.m.—Hilary CadiganWE ALSO LOVENicosMeet the chef who turned his parents’ restaurant into a pioneer of Mexican “Slow Food”Fonda MargaritaWelcome to Mexico City’s breakfast clubBartolaA fresh take on cantina culture for a food-savvy generationExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Hilary Cadigan"]}