{"id": "67148eb2e5d5fb639d50ad6c73f91f54", "url": "https://www.bonappetit.com/story/weekday-french-toast", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Make French Toast On a Weekday | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake French Toast On a WeekdayDon’t just save the indulgent breakfasts for Sundays.By Adam RapoportMarch 19, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.One weekday morning this past month, my wife announced that she was making French toast. I’m not sure if I told her she was insane, but that’s definitely what I was thinking. Who makes French toast at 7:03 a.m. when you’re hustling to get your kid out the door to school?Hardly for the first time in our marriage, I was wrong—and glad to have been.Pretty soon the kitchen smelled of melting butter, and then I heard that tssss...the sizzle of the custard-soaked bread hitting the hot (but not too hot!) cast-iron skillet.Want this letter before it hits the website? Sign up for our newsletter!And before we knew it, our son Marlon was sitting down to a couple of griddled, golden-brown slices of country bread, and he was pouring maple syrup all over them and, being the dad that I am, I had to blurt out, “Marlon, not so much syrup!”Inevitably, he always leaves a bit of unfinished French toast on his plate, and one of his parents, usually this one, steps in to finish it off. (I need some fuel before I head to the gym, right?)Obviously, you don’t need me to tell you how good homemade French toast is. But sometimes a nudge to remind you how makable it is does comes in handy.How, if you have heavy cream or half-and-half on hand, go ahead and blend that in with the beaten eggs. How a splash of real vanilla extract is never a bad move. Or a dash of cinnamon, if that’s your thing. And fry the toast in a mixture of butter and vegetable oil, which prevents the butter from burning.Oh, and most importantly, how the quick-and-easy custard needs a healthy pinch of salt (just like your favorite chocolate chip cookies do).So, yeah, go ahead and make French toast—no matter what day of the week it is.Get the recipe:BA’s Best French ToastA mixture of milk and cream delivers a custardy interior texture.View RecipeExplore Bon AppétitAdam NewsletterFrench ToastBreakfastRead MorecookingThis Overnight French Toast Casserole Is a Holiday Breakfast as Exciting as PRESENTSSSSBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Adam Rapoport"]}