{"id": "67191a6edbef96a486af5f3a2affc133", "url": "https://www.bonappetit.com/story/scarrs-pizza", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Scarrs Pizza, NYC's Chillest Pizza Place, is Low-Key Milling Their Own Grains in the Basement | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Slice Shop Is Low-Key Milling Its Own GrainsThere's pét-nat on the drinks menu and a grain mill in the basement.By Priya KrishnaMay 22, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThe first time I visit Scarr's Pizza, I almost walk right past it. From the outside, it could be any of the thousands of old-school slice joints that dot the city, complete with the classic red-and-blue bubble-lettered sign capped with a phone number, the neon beer sign, and the dark, wood-paneled walls and stained glass light fixtures visible through the window. As I go inside, certain details become clearer: the pizza boxes made of recycled material, the impressive board of organic wines on offer, and the sheer number of Opening Ceremony-clad models packed into the booths.Then the pizza arrives. At first glance, it could be just another New York slice: thin, wide-brimmed, with a rippled coating of cheese hiding a schmear of tomato sauce. But I quickly realize it’s much more special: the complex texture, the light-as-air crust, the weirdly wholesome feeling I have even after eating an entire personal pie. This close-to-perfect pizza, as I found out, is the result of what happens downstairs in the tiny, all-white basement: Owner Scarr Pimentel mills his own grains. Every. Single. Day.Owner Scarr Pimentel standing next to his basement grain mill.\nPhoto by Emma FishmanPimentel is not your typical pizzaiolo—he’s neither the wizened Italian dude of the old guard nor a lanky, tattooed young gun. He’s a 38-year-old Dominican-American guy dressed in a black hoodie and Champion sweatpants who loves to complain about mediocre pizza places (of which, he says, there are many). He has just returned from a trip to Los Angeles, for example, where he claims he had “the worst pizza of my life—even the places that were hyped and expensive were terrible.”He is a die-hard New Yorker, having lived here most of his life and seen the city through much of its ever-evolving pizza scene. He cut his teeth at many of the pizza greats: Joe’s, Artichoke, GG’s, Lombardi. “Back then,” he says, “every pizza by the slice place was good to amazing. Now, it’s not like that.” He claims that about a decade ago, a lot of the old-school spots started cutting corners, hoping customers wouldn’t notice. They added sugar to their tomato sauce, sourced meats from questionable origins, and committed the most cardinal sin of all in Pimentel’s mind: using flour laced with chemicals that improved its yield. Even worse, they stopped fermenting their dough—the process that allows the glutens in the flour to activate, yielding a light crust. “Why does pizza have to be considered a bad food?” he says. “Why do you have to use garbage ingredients?” And yet, he adds, incredulously, people still flocked to these heritage joints. “Nothing against these old spots, but they suck,” he deadpans. “You’re gonna wait three hours for that? I just didn’t understand the culture of pizza.”Meanwhile, Pimentel was reading up on people like Chad Robertson from Tartine and Chris Bianco of Pizzeria Bianco who were taking the time to use the best ingredients and make pizzas and breads that were carefully plotted at every point.So, when it came time to open his own pizza joint, he decided he was going to go a step further than all the other New York slice joints. “I wanted to future proof this method, and get ahead of the class,” he says. Not only was he going to source good ingredients, he was going to mill his own flour.Here’s why: Wheat is packed with nutrients, but those nutrients start dying when exposed to oxygen. By milling wheat berries fresh, he’s preserving those nutrients in the pizza, making it more airy and digestible.The outside of Scarr's Pizza\nPhoto by Emma FishmanAt first, the pizza dough at Scarr’s was made entirely with those milled wheat berries, a process Pimentel completed himself in a large, dusty, white miller each day. “And then we got busy,” he says, which prompted him to find a less time-consuming compromise. He now buys flour from a farm in upstate New York (he won’t tell me which one for fear of copy cats) that grows heritage, organic, non-GMO wheat and combines that with the flour he mills himself. The process is hilariously old-school: Pimentel adds the berries to the miller, turns on a rusty switch dangling from the wall, and after they have been finely ground, adds the flour from the farm and lets it all sift through an extremely fine sieve. Flour spills all over Pimentel’s black sweatshirt as he reaches into the mill and pulls out the freshly sifted grains, which feel like silk. The flour gets mixed with water and fermented for a few days, then it’s ready to be baked.The result of this time-consuming process is a more nutrient-dense pizza that, Pimentel claims, even gluten-free folk can eat. “There is this perception that wheat is bad for you,” he says. “But the reason we have gluten intolerances is because we’ve been eating Wonder Bread with chemical flour our whole lives.” This is probably why the models are flocking to Scarr’s, he explains. “Because you can eat a slice here and not feel like shit.”I ask Pimentel why he hasn’t advertised the milling practices at Scarr’s. He seems to revel in having people come in with lowered expectations because of how the place looks on the outside. “People assume that we will be a shitty slice spot,” he says. “They don’t see a ninety-year-old man making pizza. They see a Dominican man and they’re like ‘What do you know about pizza?’”And then they taste the grandma pie, whose crust brims with air bubbles and shatters like glass, with their pet nat in hand, NBA memorabilia surrounding them, as Usher blares on the speakers. And they get it.Explore Bon AppétitHealthyishPizzaNew York CityWhole GrainRead MoreLifestyleThe New Frontier of Dessert Is Local FlourBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Priya Krishna"]}