{"id": "6728ad04a77c9e6ebdcbfaf8280c7a54", "url": "https://www.bonappetit.com/story/squash-hands", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "What the Heck Is This Butternut Squash Skin Reaction? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRed, Itchy, Peeling Palms? Uh Oh, You’ve Got Squash Hands'Tis the damn season.By Ali FrancisNovember 12, 2021FacebookTwitterEmailFacebookTwitterEmailAs holiday season approaches, the BA Slack channels are popping off with squash content. What’s the best peeler? Butternut squash soup or baked pasta on a cold night? Can you eat the skin? (It depends!) Then outta left field comes this question from senior cooking editor Sarah Jampel: “How does everyone feel about eating raw butternut squash?”“Big no for me because I get that weird contact dermatitis that some people get with raw squash,” wrote assistant print editor Chala Tyson Tshitundu. “If I’m not wearing gloves when I slice it, my hands get all tight and red and crackly.”“SQUASH HANDS!” replied Jampel. “I am similarly afflicted.”“It’s a curse! I just wanna love you, squash!” Tyson Tshitundu commiserated.Meanwhile, the rest of us were all: 🤨 🎃Apparently, Jampel and Tyson Tshitundu aren’t the only ones burdened with this butternut squash skin reaction. A quick Google search reveals many people experience the sensation known as squash hands: When peeling, cutting, or handling raw chunks of it, they’re left with a sticky-but-stiff orange-ish film that’s difficult to remove; physically irritating, particularly to the soft skin on the palms; and a major buzzkill. With all those winter butternut recipes on the line—creamy mac and cheese, coconutty muffins, and pretty tarts—we simply had to get the skinny on this strange phenomenon.So, what is this butternut squash skin reaction all about?A 1994 study titled “Butternut squash (Cucurbita moschata) dermatitis” by Thomas Potter and Ken Hashimoto describes a “30-year-old female” with no history of hand dermatitis who, “within minutes of peeling and cutting up” uncooked butternut squash, experiences a “blistering eruption on the palms of her hands.” Six weeks later she repeats the process and the hives return. In both cases a topical steroid cleared up the inflammation within a day or so.The first time Tyson Tshitundu experienced squash hands was last fall, while they were slicing up a bunch of raw butternut and honeynut squash to make soup. “I noticed that my palms started feeling tight,” they tell me. “I thought maybe the squash [sap] had dried on my hands. But after washing them the issue persisted and I was so freaked out I truly thought I was going to have to amputate.” A few supportive Reddit threads later and Tyson Tshitundu was “off the ledge.”What causes butternut squash dermatitis?While no precise culprit has been named as the catalyst for squash hands, Morgan Rabach, M.D., a board-certified dermatologist at LM Medical in NYC, says there is an unidentified allergen present in squash—and other members of the Cucurbitaceae family, including pumpkins, acorn squash, cucumbers, melons, chayote, and zucchini—that can result in a kind of contact dermatitis. Essentially: Some mystery compound found in these fruits “irritates the skin to trigger an allergic reaction,” she says.What are the symptoms of butternut squash dermatitis?As with most allergic reactions, the symptoms vary. For Tyson Tshitundu, squash hands manifest as “super tight, itchy palms that get hot and scaly” that ease within 30 minutes or so. Others may feel “tingly hands or ‘burning’ skin after touching squash,” Rabach adds. In the most severe cases, where blistering of the skin occurs, scarring or some skin discoloration could linger after the reaction has passed. Either way, squash hands will “eventually clear up on their own,” Rabach says.The other good news is that, unlike a food allergy, squash hands only affects the skin. “The skin reaction does not mean you will get an allergic reaction if you eat squash,” Rabach confirms. (Read: You can still go to town on those seared butternut squash steaks, even if you’d rather not touch them raw.)Okay, this is me. What can I do to avoid a butternut squash skin reaction?Abstinence is obviously the most effective way to avoid ‘squash hands.’ But if you (understandably) cannot NOT make that creamy soup, you’ve got three options:Wear gloves: Using food-safe latex gloves while chopping and peeling butternut squash (and its cronies) creates a barrier between your hands and the offending sap-like liquid that seeps out.Buy pre-cut squash: I know those expensive little tubs filled with pale orange cubes look sad and flaccid, but they’ll save you the irritation.Outsource the task: “Hey, babe…”Too late! I’m currently experiencing squash hands. What should I do?If your symptoms are mild, the reaction will likely clear up its own. If it’s uncomfortable or severe, you’ll probably want to:Use a topical steroid: If you are having an intense reaction, Rabach says these doctor-prescribed lotions are the fastest route “to reduce itching, inflammation, and burning” caused by squash hands.Take an antihistamine: Over-the-counter medications like Zyrtec or Allegra could also relieve symptoms, according to Rabach.Time to glove up:1 / 35ChevronChevronButternut Squash Steaks with Brown Butter-Sage SauceView RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-12", "author": ["Condé Nast", "Ali Francis"]}