{"id": "67287aefdae8e7439b1bb2e5a11d6e66", "url": "https://www.bonappetit.com/story/just-buy-it-metal-steamer-basket", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "My Steamer Basket Decides What I Should Make for Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Let My Steamer Basket Decide What I Should Make for DinnerWhen I have no idea what I'm going to eat for dinner, I steam.By Christina ChaeyJune 20, 2018FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.A few years ago, I started getting into the habit of putting a pot of water on the stove as soon as I got home from work, even when I had no idea what I was going to eat for dinner. It was a tip I learned from the book An Everlasting Meal by the chef and writer Tamar Adler. In it, she writes: \"Instead of trying to figure out what to do about dinner, you put a big pot of water on the stove, light the burner under it, and only when it’s on its way to getting good and hot start looking for things to put in it.\"On many weeknights, I'll use that pot of boiling water to steam whatever I have in the fridge, because I am definitely not going grocery shopping. (Bonus: You use a lot less water to steam, so it comes up to a boil way quicker than a whole pot of the stuff does.) Steamers get a bad rap as the vehicle of sad diet food, conjuring up images of too-soft carrot coins and yellowed cauliflower florets that dissolve into grainy mush as soon as they hit your tongue. But when done properly, steaming makes everything from peak-season vegetables to seafood taste like the best possible version of itself. And all you need to make it happen is a humble metal steamer basket.There are lots of options to choose from within the steamer realm, from the multi-tiered bamboo situation to this super-fancy ceramic one. But after years of apartment-hopping (and subsequent manic Kondo-ing), a collapsible lightweight metal steamer basket is the only kind I'll keep in my kitchen. It's super easy to clean, takes up very little space, and can expand or contract to fit inside almost any pot.Fact: a kicky dressing on the side makes steamed vegetables even better.\nPhoto by Alex Lau, Styling by Sue LiOnce the cheap Chinatown steamer I've become deeply attached to inevitably falls apart, this $18 OXO Good Grips Stainless Steel Steamer with Extendable Handle is the one I'll spring for. The handle extends as you lift the steamer out of the pot, which is useful when you're trying not to burn off your fingers (steam is hotter than any heat-blasting oven. Trust.) But even more usefully, the handle also detaches when you want to use the entire basket, which comes in handy when you want the extra space to cook a large piece of fish, half a squash, or a bowl of chawan mushi, a savory, jiggly Japanese steamed-egg custard.Turn steamed potatoes into...salad!\nMost days, of course, I'm not making chawan mushi. I'll usually get some cut-up sweet potato or baby potatoes going in my steamer basket, letting them gently cook first because I know they'll take the longest. Then, I figure out what else I want to eat. One day that might be a few big broccoli florets or a handful of snap peas; another it might be scrubbed baby turnips and little carrots. The point is to get everything cooked and ready to be seasoned, sauced, or tossed—because once everything is cooked and right in front of me, it's so much easier for me to picture a big, colorful, vegetable-centric dinner. Those baby potatoes would be perfect tossed with a mustardy vinaigrette and a few chopped medium eggs. The turnips and carrots belong with a bowl of white rice and a quick miso-ginger sauce drizzled over it all. And as for the dozen frozen Trader Joe's pork gyoza I am 95% sure I will be steaming for dinner tonight? Well, those don't require a damn thing.OXO Stainless Steel Good Grips Steamer with Extendable Handle$20 at AmazonAnd then steam some artichokes if you're feeling crazy!Steamed Artichokes with Garlic ButterAll you need are your hands, some friends, and permission to get a little messy.View RecipeExplore Bon AppétitBasicallyShoppingToolsRead MoretechniquesHow to Make Pillowy Soft Steamed Buns at HomeBy Alex Delany and Chris MoroccoSteam Your Own Damn LobsterBy Rochelle BilowSteamed Clams: Made Even Better with BeerBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Christina Chaey", "Chris Morocco"]}