{"id": "672a1af09fb5780e7499f233cb024245", "url": "https://www.bonappetit.com/story/i-cheated-great-british-baking-show-challenge", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "I Tried a Technical Challenge from the Great British Baking Show | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Only Way I Got Through a ‘Great British Baking Show’ Challenge Was By CheatingWould I have survived in the big hot, tent? Probably not.By Sarah JampelFebruary 15, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Sarah JampelFacebookTwitterEmailEvery time I finish an episode of the Great British Baking Show and head into the kitchen, I feel like a kid cartwheeling in the living room after watching Olympic gymnastics. There’s something about seeing those athletes—I mean, bakers—schvitzing in the hellishly hot conditions of the tent that I find not only entertaining but also fomenting. It lights a fire under my butt and launches me straight toward the stand mixer with hopes that, with enough creaming and folding (and maybe some lessons in British pronunciations), I too could be in that tent, attempting the impossible: an ice cream bombe made from scratch in 90 minutes and 99° weather, a “selfie” constructed from cake, a chandelier of sugar cookies, a handshake with Paul Hollywood without crumbling to the floor.And since this wasn’t actually the Olympics, my aspirations weren’t all that irrational. These tasks were something I—an avid home baker, just like all of the show’s actual contestants—could really, possibly, maybe, theoretically do. Hadn’t my years of baking brownies on the weekend (and—okay, okay, I’ll admit it—a few stints in professional kitchens) prepared me for this very moment? So, to see just what sort of baking chops I really had, I embarked on a journey to make just one recipe straight from one of the show’s technical challenges. How would I fare at the judges’ table?The recipeThe constraints of a true technical challenge include a bare-bones recipe, a stunningly short period of time, and bakers groaning all around you (also: equipment spontaneously combusting and proofing drawers that seem intent to sabotage any dough that’s put inside). Since no one wanted to play GBBS with me, I would be on my own. And since I’m no masochist, I decided to give myself plenty of time and to choose a recipe from early on in the contest. It didn’t need to be anything totally wacky—no raspberry blancmange or two-tier lavender and lemon curd fox cake for me. Just something most of the bakers had made with moderate success.So, I landed on Le Gâteau Vert, a lemony pistachio cake colored green with spinach (!), and the technical challenge from 2018’s cake week (episode 2). First of all, it was supposedly Claude Monet’s favorite cake, which he ate every year on his birthday. I love Monet! Who doesn’t? Second, did I mention its Kermit-green hue comes from spinach? Monet, you crazy artist, you. Third, it’s decorated with edible flowers. So twee. Fourth, could it even taste good (have I mentioned the spinach)? I had to know. And fifth, it’s made up of several components—marzipan, génoise sponge cake (pronounced gen-o-ease in British speak), buttercream, fondant—that would each present ample opportunity to flounder flourish. (If you’ve watched the episode...poor Karen!) Finally, it was short and simple, but less in the reassuring, “this’ll be easy” way, and more in the “holy cow, how do I make a sponge cake without any details about what the batter should look like” way.The set upSince I was only a contestant on the GBBS of my imagination, I had to source everything myself: multiple types of sugar (icing, caster, and “fondant icing sugar,” which does not seem to exist in the U.S.); 500 grams of pistachios (which, as it turns out, is a lot of money); kirsch (cherry brandy); and the impossible-to-track-down pistachio essence.Now’s a good time to confess that I took some liberties here: Why buy pistachios when I could buy pistachio flour and skip the shelling and grinding? Why buy caster sugar when I could grind regular ol’ sugar in a food processor? And why order “fondant icing sugar” from the U.K. when I could just...find a poured fondant recipe consisting of white chocolate, corn syrup, and confectioners’ sugar? I wasn’t going to walk into a burning building blindfolded, okay?The moment(s) of truthI spread out my process over two days. (Call me an imposter—I’d say I’m a realist.) On day one, I made the marzipan and the génoise, both of which I chilled overnight. On day 2, I made the spinach buttercream and the fondant, which set me up to assemble the cake.I started with the pistachio marzipan—baby steps!—which was easy to make. Mix ground pistachios with confectioners’ sugar, an egg white, and “pistachio essence” (equal parts vanilla and almond extract, in my version), then knead it together into a Play Doh-esque mass. The only problem was that one egg white did not even moisten the dry mixture. I added another, grateful that neither Prue nor Paul was looking over my shoulder, and trudged on.Next came the “sponge” (a.k.a. the cake), which was doomed from the get-go. For a notoriously difficult cake (leavened with only eggs, rather than a mixture of baking powder and baking soda, génoise are known to fall flat), the instructions were vague. So...I started to read other recipes. But just for some reassurance! How “thick and pale” should the eggs really be? I wondered. Could I pour hot butter into that sensitive mixture without tempering it first? All of this outside research felt a little bit like taking an open-book exam—i.e. condoned cheating. The down side? It totally shook my confidence: What would I have done in the tent, with no access to well-written sponge recipes?But once I saw that the cake didn’t rise high in the oven—it was a fairly squat thing, only an inch or so tall—I knew I should’ve separated the eggs, whisked the yolks until they held ribbons, and folded in well-whipped whites. Basically, I should’ve followed a different recipe altogether. Instead, I wrapped up my small friend, stuck it in the fridge, and tried to forget about the fact that I’d have to cut it in three horizontal slices the next day.The following morning, I set out to make the French buttercream. First step: “spinach water,” made of blanched spinach blended up and squeezed through a cheesecloth. I then used this pond scum to make a simple syrup, which I brought up to 235°F. (This I also had to research, frantically Googling, “At what temperature does sugar syrup form a thread between two spoons?”). I streamed it slowly into egg yolks before adding softened butter, ground pistachios, and, for some reason, kirsch. It was at this point in the process that the entire Bon Appétit Test Kitchen began to smell so strongly of hot spinach that everyone walking by said aloud, “What is that smell?” I promised them the result would be delicious, trying to convince myself the same.Spreading the spinach buttercream over the first layer. The second “layer” is on the bottom right.\nPhoto by Chelsie CraigNext, I had to slice the sponge into three layers. This was a fool’s errand: No matter how many videos I watched about how to evenly divide a cake into layers, no matter how many toothpicks I used to mark where the slices should be, no matter how long and sharp my serrated knife, it was impossible. Senior food editors Molly Baz and Chris Morocco, standing nearby, grimaced. I got halfway through trimming off the first paper-thin layer when I decided to turn back and slice the cake in two instead. But this was sort of like deciding halfway through a bob haircut that you actually want a trim. The cake was butchered: The top “layer” was thin shavings of disparate pieces connected by the puniest of crumbs. If I were in the tent, Noel and Sandi would’ve come over to my station at this moment to offer some comedic relief. Instead, I had only the glares from BA’s food editors.There was only one way forward: I smeared the bottom layer with spinach buttercream, pieced the crumbs on top, then covered the whole situation with more of the green stuff, hoping no one would notice that, where there were supposed to be three layers of cake, I had just one and a half. I rolled out the marzipan and draped it over the cake, an extremely satisfying process because it covered the whole mess in a smooth surface—the equivalent of stuffing the cake into Spanx.If an even marzipan cover hides all the mistakes, did they even ever happen?\nPhoto by Chelsie CraigThe final step: fondant. Since I followed a different recipe entirely (forgive me, God), I had no problems. I poured the mixture—melted white chocolate, corn syrup, confectioners’ sugar, water, and leftover spinach water—over the cake and watched it drip down the surface and over the sides in thick ribbons. Now the cake wasn’t only smooth—it was also shiny. The one thing it wasn’t? Very green. The white chocolate muted the spinach’s green into something just shy of white, like the color of my sneakers after one day of wear.Pouring the fondant over top. It should’ve been a vibrant green but, instead, leaned towards off-white.\nPhoto by Chelsie CraigThankfully, festooned with pansies and $50-per-pound Sicilian pistachios, it actually looked presentable. I wouldn’t have been so ashamed to bring it to the judges’ tables.The part where we eat itThe cake sliced nicely: There was a layer of fondant and a layer of marzipan followed by a mash of sponge cake and buttercream.Chris Morocco gave it one look and decided he wouldn’t deign to taste it: Génoise, he told me, was meant to rise, then be sliced into beautifully discrete layers. Chris, I said to myself (because I would never actually talk back to Chris), I was just (kind of sort of) following the recipe!!! Would the génoise have been fluffier, taller, prouder had I used Natasha Pickowicz’s extremely detailed recipe? Why, yes! Did the GBBS bakers have the knowledge and wherewithal to skip Prue’s instructions and go with what they knew to be a better technique? Clearly! With episodes that jump between nearly a dozen contestants, how the heck was I supposed to grasp the sort of wizardry going down when the cameras cut away?It's not so bad but, hey, where are the layers?\nPhoto by Chelsie Craig, Food Styling by Sarah JampelBut Morocco missed out. Because it tasted…fine! The extreme amount of buttercream in comparison to sponge produced a sweet, tender, and not-at-all dry effect. The marzipan was pleasantly chewy, and the fondant, since it was mostly white chocolate and corn syrup, was candy-like. People liked it! It was nutty and lemony, with no detectable spinach. Some folks at the office even asked to take slices home. Maybe my cake, with its short stature, ill-defined layers, and dirty-white hue, wouldn’t have placed high in terms of looks, but it got the flavor down pat. It lost the swimsuit competition but won the talent segment.So what did I learn, besides the fact that television is deceptive and that spinach is a suitable but stinky natural food coloring? Well, as much as people say baking is about precision, that’s only true if you’re following a recipe you trust. As soon as you sense that something isn’t right—like that sponge cake isn’t going to work if you pour hot butter directly into whipped eggs or that the dough is lumpy when it really should be smooth—that’s when baking becomes about instincts and improvisation. Those contestants aren’t just good bakers, they’re forward-thinking problem-solvers.And on that note, I also learned that I won’t be tossing my hat into the GBBS ring any time soon.Explore Bon AppétitPop CultureCakeRead MoreLifestyleRuby Tandoh On Throwing Out Sick Day Rules and Eating Curry InsteadBy Ruby TandohRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-15", "author": ["Condé Nast", "Sarah Jampel"]}