{"id": "672d32fc9bf8664387df194fea486947", "url": "https://www.bonappetit.com/story/femi-oyediran-and-miles-white-charleston", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Femi Oyediran and Miles White's Guide to Charleston | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFemi Oyediran and Miles White’s Guide to CharlestonA highly opinionated guide to the city’s hyped lunch spots, late-night drinks, and best views.By Femi Oyediran and Miles White, as told to Jennifer Hope ChoiJuly 14, 2021FacebookTwitterEmailPhoto Courtesy Bar GeorgeFacebookTwitterEmailThe sommeliers behind Graft Wine Shop aren’t just adventurous and ambitious with the wines they stock and sell. The same goes for their appetite. Femi Oyediran and Miles White have quite a detailed agenda for their perfect day in Charleston, starting with coffee, pastries, and a bike ride and ending with the city’s best views (at a Holiday Inn no less) and, naturally, lots of oysters.Check out more food-focused itineraries from our favorite food people here.This barstool at Bar George has your name all over it.Photo Courtesy Bar GeorgeHello, Rainbow Row!Photo by Peter Frank Edwards/ReduxCharlestonWe start off at Sightsee Shop + Coffee. It’s the ideal neighborhood spot, where everybody knows everybody. Joel Sadler, one of the owners, just gets you excited about coffee (they serve Springbok; we love those guys too).Babas on Cannon is a few blocks away, perfect for a prelunch snack and a pick-me-up. Grab a couple pastries, maybe a sandwich, and enjoy the scenery right off King Street from the patio. Then head out for a bike ride. We’ll usually take King Street all the way down to The Battery and get lost in the streets.Next, we hit up 167 Raw for lunch, a pretty clutch move. (To avoid long waits, do a late lunch around 3 p.m. or go on slower days, Tuesdays or Wednesdays.) Start out with drinks, order ceviche and a dozen oysters, and it’ll feel like something’s building. It’s like how your California friends leave the airport and head straight to In-N-Out. 167’s the same for us, just infinitely more bougie. You really get this grand introduction to the city.Make sure to go next door to House of Nomad, an eclectic, curated home goods store nearby. Miles got his mom some funky cookbooks and a huge antique kudu horn from there—best Christmas she’s had in a while.If you’re down to venture off the peninsula, any true Charlestonian knows the best views in the city are from the Holiday Inn’s Harborview Restaurant & Lounge, next to the Waffle House in West Ashley. Stop there for a happy hour drink on the way to The Pourhouse on James Island for an early show on the deck (free on Sunday and Monday nights).Then cross the street and get more oysters, plus hot dogs and Peruvian spit-roasted chickens at Bar George. Or head downtown for dinner at Chubby Fish. It just reopened, and it’s better than ever.Wrap it up with late night drinks at Dalila’s or Doar Bros. It’s an aggressive day, but a solid day.WHERE TO STAY:Stay Duvet for rentals with a historic downtown feelWHAT TO BRING BACK: High Wire Distilling Co.’s Southern Amaro, or the Sorghum Whiskey if you can find itExplore Bon AppétitRestaurantsTravelCharlestonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Femi Oyediran", "Miles White", "As Told To Jennifer Hope Choi"]}