{"id": "673ec8dda694c3ca01d9c53159b082dc", "url": "https://www.bonappetit.com/story/what-is-dal", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "What Is Dal? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDal Is an Ingredient, Dal Is a Dish, and Dal Is So Much More Than EitherWhat is dal? There’s no short or simple answer.By Chitra AgrawalNovember 22, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food styling by Cyd McDowellFacebookTwitterEmailLook up “what is dal?” on the internet and you’re not likely to stumble upon one codified definition. Dal recipes vary from household to household and even person to person, and this beloved staple is a source of comfort and a reminder of home for many South Asians living around the world. So, long story short, the answer to the question “what is dal?” is not a simple one. Dal is both an ingredient and a dish, a humble meal and a luxurious indulgence, and there’s always something new to learn, whether you’ve grown up enjoying it or are cooking it in your kitchen for the very first time.What is dal?Dal in Sanskrit, an ancient Indo-Aryan language, means “to split.” Today, in Hindi, dal can refer to certain dried lentils, beans, or peas in split or whole form or to the dish made from them—a preparation that some researchers date back as far as 800–300 B.C. in South Asia. India is the second largest producer of lentils in the world, so it follows that dal is a South Asian mainstay for billions of people, not only because it’s readily available and has a rich history, but also because it’s economical, wholesome, and, of course, delicious.Dal also goes by different names throughout the subcontinent: My father, who is North Indian and speaks Hindi, grew up using the word dal, for instance, but my mother, who speaks Kannada and was raised in the South Indian state of Karnataka, refers to dal as bele.There are infinite ways to prepare dal and recipes tend to be regionally specific. From spicy and tangy sambar in Tamil Nadu to creamy and luxurious dal makhani in Delhi, dal preparation varies widely from region to region. I grew up eating toor dal—called togare bele in Kannada—a nutty-tasting lentil also referred to as split pigeon peas that my mother cooked in a pressure cooker until they fell apart into a creamy, rich consistency. Another favorite in our house was masoor dal (a.k.a. red lentils), which you can find with or without their brown skin. My North Indian grandmother would often prepare whole masoor dal with onions, ginger, tomatoes, and spices, including her homemade garam masala, serving it with basmati rice and plain yogurt. And the first dal I prepared for my own children was yellow moong dal without its green skin, which is relatively easy to digest, even for babies.Where can I find dal?You can find the largest varieties of dal at your local South Asian grocer or at online purveyors. I recommend visiting a store in person just to appreciate the sheer variety available—some types of dal can even come in several different preparations. Urad dal, for instance, is sold in its whole bean form with black skin, in whole bean form without skin (in which case its color is pale white), split with skin, and split without skin. Each would be prepared differently.How can I use dal?To save time, I often cook a few cups of masoor dal over the weekend and zhuzh up a portion throughout the week with whatever spices and veggies I’m craving. In my Dal Palak, for example, a tadka—the cooking technique of tempering aromatics, spices, and sometimes curry leaves in hot fat such as oil or ghee—is mixed with spinach before stirring into dal to impart toasty, fatty, aromatic flavor.Dal recipes like this one are extremely forgiving and versatile. Sub in other lentils, pair it with different vegetables, proteins, spices, herbs, souring agents like tamarind or lemon or sweeteners like coconut milk, jaggery, or unrefined cane sugar, and serve over rice with achar, a hot pickle, or chutney of your choice. My ultimate comfort food is khara huggi, moong dal cooked with rice and ginger and finished with a tadka of crushed cumin seeds, black peppercorns, asafetida, and cashews fried in ghee.In addition to a hearty soup or stew-like preparation, dal as an ingredient can also be used to pack a nutty, crunchy punch of flavor. A spoonful of urad and chana dal can be roasted in hot fat with spices to add texture and toastiness to vegetable stir-fries like green beans palya or rice dishes like chitranna. Whole skinless urad beans can be fermented and ground with rice to make dosas or steamed idlis. You can also go full meta by grinding dry-roasted chana and urad dal to make spice blends like huli powder, which are then added to sambar, a South Indian dal dish. You can soak moong dal or chana dal in water and add to salads like carrot kosambari. One of my favorite dishes is dahi vada, little disks of deep-fried urad dal batter (vadas) served in yogurt with chutneys. On special occasions, dal is even used in desserts like ladoo and halwa.While one singular definition of dal may be tricky to pin down, what’s certain is that its beauty lies in the endless possibility.Get the recipe:Dal PalakThis spinach-packed dal is the lifesaving dinner for nights when we’re strapped for time but still crave something deeply cozy.View RecipeExplore Bon AppétitcookingLentilIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-22", "author": ["Condé Nast", "Chitra Agrawal"]}