{"id": "674070ac80aa6476f2ef1f586e64e716", "url": "https://www.bonappetit.com/story/oddfellows-boozy-capsule", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "The Only Thing Better Than Ice Cream Is Cocktail-Inspired Ice Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Only Thing Better Than Ice Cream Is Cocktail-Inspired Ice CreamOddFellows’ boozy flavors let me pretend I’m at my favorite watering hole.By MacKenzie Chung FeganJune 1, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My favorite thing about the Long Island Bar is the deep-fried cheese curds served with a side of ranch. My second, third, and fourth favorite things about the Long Island Bar are eavesdropping on the couple inches away from me, the glow of the neon “No Dancing” sign reflecting off the terrazzo floor, and the smell of freshly cracked ice and sticky whiskey. The cheese curds I can have at a patio table outside. As for the rest, although my personal pandemic comfort zone is rapidly expanding, I’m not quite ready to return to my favorite type of cocktail bar—one that’s dimly lit, packed with strangers, and hygge like a cozy cave.OddFellows’ Boozy Capsule isn’t a substitute for the bars I love and miss most, but it is a balm of a different sort: ice cream. This limited edition series of pints pays homage to some of the best bars in the world—Mexico City’s Limantour, Barcelona’s Two Schmucks, Sydney’s Maybe Sammy, and New York’s Death & Co, Attaboy, and Long Island Bar. Death & Co’s Buko Gimlet flavor, the pastel green of an after-dinner mint, is a coconut cream sherbet infused with pandan leaf, gin, and Novo Fogo cachaça. The La Finca ice cream from Maybe Sammy, which features oloroso sherry, Mr. Black Coffee Liqueur, and gooey nuggets of manuka honey, tastes like a frozen version of the best Vietnamese coffee I’ve ever had. The Long Island Bar’s pint is a tart, juicy riff on a Cosmopolitan, which was developed by the bar’s owner, Toby Cecchini, when he was working at the legendary Odeon. It tastes like pink lemonade and 2002.The cute conceit makes these pints worth recommending, but what makes them worth highly recommending is the quality of the ice cream itself. OddFellows, one of my favorite scoop shops in New York, is the brainchild of Sam Mason, formerly the pastry chef at WD-50. He’s been turning out small-batch flavors like miso cherry and pistachio cardamom caramel since 2013, and in his hands, even bacon, egg, and cheese ice cream is worth lining up for. At $99 for six pints (shipping included), these are definitely a splurge. But think of each pint as a couple of cocktails—which they essentially are, in ice cream form—and consider that you don’t have to tip. Plus, OddFellows is donating 10% of proceeds from the Boozy Capsule to Another Round Another Rally, a nonprofit that aids those in the hospitality sector. May I suggest sending a pack to your best bar crawl buddy for her birthday?The ice creams in the Boozy Capsule do contain alcohol, but a subtle amount—under 5% ABV, which is not so much that they approach frozen marg territory but enough that they’re perfectly scoopable straight from the freezer. If you were feeling moreish, you could, conceivably top a bowl of Attaboy’s Penicillin ice cream with a shot of peaty scotch or float a scoop of the Cosmopolitan in a glass of Crémant. Or do what I do—dim the lights, turn on a little background noise, sidle up real close to your partner or roommate or dog, and stick a spoon straight into the pint.Photo by Isa Zapata, food styling by Micah MortonOddFellows' The Boozy Capsule Ice Cream (6 Pints)$119 $99 at GoldbellyExplore Bon AppétitShoppingHighly RecommendSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-01", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}