{"id": "6758f133a5bda952dfe595ff28e4ff72", "url": "https://www.bonappetit.com/story/never-fail-how-to-make-rice-stovetop", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Learning How to Make Rice (Without a Rice Cooker) Got Me Through a Daaaark Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLearning How to Make Rice (Without a Rice Cooker) Got Me Through a Daaaark TimeI got dumped. I lost my rice cooker. But, hey, I learned how to make rice on the stovetop!By Amiel StanekJanuary 26, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the rice cooking method that changed Basically editor Amiel Stanek's life.It was a bad time. I was 21, just out of college and fresh off of a three month long cross-country road trip. (Read: b-r-o-k-e.) My girlfriend had just dumped me, and I had just moved into a hovel of an apartment in South Philly—roaches, rats, a ceiling leaked like a colander whenever it rained. And somehow, in the process of moving to a new city with almost no friends, even less money, and even less of a job, something happened that almost broke me: I lost my beloved rice cooker.It wasn't in the car. It wasn't in any of my boxes. It wasn't back at my parents' house. It was just gone. And when the reality of that rice cooker's absence really dawned on me, I felt lower than low. Not because it was one of those fancy ones that can make yogurt and read you your horoscope at the same time or anything like that. But because that yard sale rice cooker meant rice—perfect, just-sticky-enough-and-just-fluffy-enough, never-mushy rice. And rice meant safety, and comfort, and stability, all things I was very much lacking at that particular moment.Rice turns a fried egg into dinner. Rice turns an avocado into dinner. Rice turns half a can of sardines and a dill pickle into dinner. Take the rice out of the Poor Man's Dinner equation, and you are just left with a Poor Man. A Poor Man who had never in his life managed to make rice on the stovetop without messing it up.I knew it was possible, of course, to make rice without a rice cooker that didn't turn out gummy, or burnt, or somehow undercooked and overcooked at the same time. I had just never done it. And at that particular juncture, the mere idea of failing at something like making a pot of rice was just too much to bear.White rice + whatever you've got = dinner.\nPhoto by Laura MurraySo I went without. For an entire unemployed week I rummaged around the fridge and cupboard trying to put together odds-and-ends dinners and always coming up just a liiiiiiittle bit short. I would gaze longingly at the gigantic bag of short grain white rice my mom had bought me at BJ's before sending me off, feeling like Tom Hanks in that scene in the 2000 film Cast Away where he has all of the cans of food but doesn't have a can opener to open them with. (Not sure if that is an actual scene in that movie, but you get the idea.) I was at my wits end. And I was hungry.So, after a week of moping, I bucked up. I took a deep breath and...looked online. Why I didn't just Google \"perfect pot of rice\" on Day One of this whole affair is anyone's guess, but there it was: a Bon Appétit recipe auspiciously named \"The Perfect Pot of Rice.\" I didn't think all that much of the publication at the time, but I figured, what'd I have to lose?I followed it exactly, religiously, with a furrowed brow-intensity that I rarely ever devote to recipes. I rummaged around in our Cabinet of Misfit Cookware until I found a 2 quart saucepan with a matching lid. I measured out 1 cup of short-grain white rice—OK, the recipe calls for long-grain, but I did everything else!—and added it to the pot with ½ teaspoon of kosher salt. I measured out 1¼ cup water, added it to the pot, and gave the mixture a gentle swirl. I turned the heat to high, brought the whole thing up to a boil, then covered it and dropped the flame to the barest flicker before setting a timer for exactly 18 minutes. After much pacing and clock-watching, the timer went off and, as instructed, I whisked the pot off the heat, removed the lid and wrapped it in a clean (OK, the cleanest-looking I had) kitchen towel before putting it back over the rice, and set another timer for 10 minutes.There was something appealingly witchy and ritualistic about the whole process—the measuring, the bubbling, the specificity of the timing and where the pot should and shouldn't be at any given point. After the second timer went off, I half expected to remove the lid only to have live frogs or a swarm of moths emerge. But underneath that lid was something even more astonishing to me in that special moment: Perfect, just-sticky-enough-and-just-fluffy-enough, not-even-kind-of-mushy rice.And so I had rice. And I had dinner. But more than that, I had success, an achievement that I could hang my hat on at a time when everything else was in the shitter. I had learned How to Make Rice, and I knew that I would never forget. 1 cup rice; 1¼ cup water; a pinch of salt. High heat, boil; cover, simmer, 18 minutes; towel, recover, 10 minutes. Rice. And it is for this reason that I love cooking, and teaching people about cooking: It has the ability to create a sense of efficacy and accomplishment that can be summoned at will, whenever it is needed most. If you can make food for yourself, you can always make yourself happy. And you can have rice. And you can have dinner.Get the recipe:The Perfect Pot of RiceEver wondered how to make the perfect pot of rice without a rice cooker? We got you.View RecipeExplore Bon AppétitBasicallyNever FailRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Amiel Stanek"]}