{"id": "676d7defc6e4fbf5bba3e26806f0c871", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/ifuu-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Ifuu Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoIfuuCome to this izayaka for the sake, stay for the seasonal fish.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for an elegant izakaya where seasonality is king and dishes are prepared with a level of craft that transcends any normal pub food. While a cold draft beer is a fine choice, cooking of this caliber really demands good sake. Plus, you get to pick your own tiny cup to drink from, which is even better than choosing your favorite Monopoly piece.ORDER THE: sashimi to start, picking at least a few from the daily specials, which feature peak ingredients. The yakitori is also a popular option. But only amateurs would tank up on proteins and cheat themselves out of the rice, which is the best—and last—part of the meal: One of Ifuu’s most famous specialties is a giant donabe of hot rice that has been steamed with a flotilla of uni on top.THE VIBE IS: spare but warm, like eating dinner in a Muji advertisement. The bottom floor is a brightly lit room where the chefs bustle about the open kitchen and the bulk of the seating is at a counter. There are tables for bigger groups upstairs, though you’ll still want to call ahead if you have a party of more than four.PRACTICAL STUFF: Open Monday through Saturday from 5:30 p.m. to midnight. Closed on Sundays and some holidays. Little English is spoken by the staff, but the menu will list the regular offerings in English. Specials are not usually translated, but try your best to ask for recommendations. Reservations recommended. The nearest subway station is Naka-Meguro.Photo by Xavier Girard LachaîneThe peak-season sashimi is listed on the daily specials menu.\nPhoto by Xavier Girard LachaîneYou can’t go wrong with the yakitori.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}