{"id": "676e7bf6f62b30b54faea05a0e6608ff", "url": "https://www.bonappetit.com/story/coronavirus-shopping-cooking-tips", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Grocery Shopping During Coronavirus FAQ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusWhat to Know About Shopping and Cooking During CoronavirusFiguring out how to buy groceries and cook safely can feel complicated right now. So we’ve turned to trusted health and safety experts to help answer some of our most pressing questions.By Jesse SparksApril 13, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAs the number of reported coronavirus cases increase and stay-at-home mandates are extended, many of us are turning to our kitchens. Cooking isn’t just a way to nourish ourselves in these uncertain times, but something to ground us too—which may explain why you’ve made enough beans to fill a kiddie pool. Yet even this source of comfort comes with its own questions: Can coronavirus be spread through food? How should I shop for groceries now? Every day we’re learning new information and in turn identifying new concerns, so we consulted virologists and food scientists to better understand how to safely buy groceries and cook. The rules are constantly changing, so make sure you consult the CDC and FDA for the most up-to-date information, but here’s what we know so far.First things first: Can I get coronavirus by eating or touching food?“COVID-19 is a respiratory virus and is transmitted person-to-person through respiratory droplets,” says Kali Kniel, Ph.D., a professor of animal and food sciences at the University of Delaware and the president of the International Association for Food Protection. “It is not likely to survive the acidity of the stomach in the way that foodborne bacteria and viruses are able to.” Kniel also advises that currently “there is no evidence of food being associated with transmission of COVID-19, and this includes food-packaging materials and fresh produce.”Still, because shopping can put us into contact with others, there are ways to limit your exposure and get what you need.Where do I start with grocery shopping during coronavirus?With staying at home becoming more encouraged, grocery delivery and pickup options are more widely available—even for retailers that never offered them before. Stores like Target, Whole Foods, and Costco are giving customers curbside pickup and door-to-door shipment opportunities. Websites like Peapod, FreshDirect, and Amazon are still shipping with no-contact delivery. Plenty of independent purveyors will also deliver right to your door.Additionally, many local vendors who previously serviced only restaurants are now available for consumers. You can order meat, fish, and other food products to be shipped or delivered directly to your home with limited contact. While CSAs have been always around, more farmers have begun offering boxes of assorted produce for pre-order, on-farm pickup, and home delivery; check the websites of your local farmers market or farmers’ association for additional details. Above all, if you’re ordering groceries to be shipped or delivered, opt for no-contact delivery when you can.“These ways of obtaining food are good in that they support social distancing and reduce the potential for person-to-person transmission of the virus,” Kniel says—a reminder that merely limiting the amount of human contact significantly lowers the risk of contraction.If shopping in-person is a necessary and safe option for you—and won’t put others at risk—it’s possible to still visit stores at this time. But this isn’t your moment to go to multiple locations in search of a specific ingredient or walk the aisles looking for inspiration. Instead, prepare by making a shopping list so you can get in and out quickly.“When you go to the grocery store, have an idea of exactly what you want to get, which store you want to go to, and minimize your time there,” says Matthew Moore, Ph.D., an assistant professor of food science at the University of Massachusetts Amherst. He also recommends shopping during off hours when the store is less likely to be busy and, if you are a senior citizen, using those shopping hours set aside for you. Of course, maintain your distance from other shoppers. “Avoid going down an aisle with one or two people, or wait for them to leave before grabbing that food item you need,” he says.If I go shopping, what should I take with me?If you’re planning to use a shopping cart or basket, take sanitizing wipes to clean handles and a portable bottle of hand sanitizer to use after touching surfaces like freezer door handles, credit card readers, etc. Moore advises that sanitizer should be made up of 60 to 70 percent alcohol. A higher alcohol content means that the product is more likely to evaporate before it has time to adequately disinfect your hands. Water in the disinfectant actually helps break down and dissolve bacteria proteins.As of Friday, April 3, the CDC shifted its stance on masks and began encouraging everyone to wear them in public as a way to prevent those without symptoms from inadvertently spreading the virus. “Ideally, everyone wearing masks could potentially reduce the transmission,” Moore says. “But it is better to save [medical masks] for people in healthcare or who are giving care to high-risk individuals” since an increased demand may impact the medical field, which is already facing severe mask shortages.Cloth masks, which are also effective, are becoming more available for purchase, and you can even make them at home. Kniel advises not touching or adjusting the mask while wearing it and routinely cleaning with soap and warm water or in a washer and dryer.Is there a certain way I should be interacting with items in the store?Generally, it’s safe to handle fruits and vegetables in the produce section, packaged meat from the butcher counter, and any other product as you normally would, Moore says. “An apple is not a high-contact surface like a doorknob or credit card machine,” he adds. “Those frequently contacted surfaces are the concern.”That said, you’re likely still touching those high-contact surfaces while shopping, so use hand sanitizer and avoid touching your face. When you get home, make sure you wash your hands with soap and water.Do I need to sanitize all my purchases?Although there is data to prove that the virus can survive on surfaces for one to three days, surface transmission shouldn’t be your main concern, according to Kniel. These small particles generally aren’t strong enough to make someone sick. You’ve probably seen (or been tagged in by a well-intentioned friend or family member) viral videos on social media calling for people to wash produce with soap. While that seems like a safe practice, it’s unnecessary and can actually make you sick.“There is no evidence to support transmission of COVID-19 through fruits and vegetables,” Kniel says. “While it is always important to rinse the outside of fruits and vegetables with water and to remove the outer layers of things like lettuce or cabbage before eating, consumers should not wash produce with soap. No one wants to, or should, eat soap.”Instead, stick to the basics of hygiene, advises Martin Wiedmann, DVM, Ph.D., and a professor at the Institute for Food Safety at Cornell University, and wipe down or sanitize food as you normally would. Unpack and put away groceries; wipe down kitchen counters, tables, and any other surfaces where you may have placed uncooked meat or soiled produce bags, first with water and then disinfectant wipes; and, finally, wash your hands. As for reusable shopping bags, experts recommend washing them if they haven’t been cleaned recently.Do I need to clean and disinfect my kitchen after shopping?These two practices are key, and part of basic everyday food safety procedures, Moore says. Though not specific to grocery shopping during coronavirus, they play an important role in your overall health by decreasing the likelihood of contracting other illnesses or foodborne bacteria like salmonella. These could lead to a hospital visit, which can increase your risk of coming into contact with people who may be carrying COVID-19.“It really is important to clean up afterward with soap and water before disinfecting with those 60 to 70 percent alcohol wipes,” Moore says. Cleaning first allows you to strip away what scientists refer to as “organic load” (think residual soil or other residue), so that the disinfectant can be as effective as possible.Can I still cook for other people?As long as you have been practicing social distancing and routinely wash your hands, then cooking for others in your immediate household is safe, according to Linda J. Harris, Ph.D., professor of food science and technology at the University of California, Davis. “Unlike foodborne gastrointestinal viruses, like norovirus and hepatitis A that make people ill through contaminated food, COVID-19 is a virus that causes respiratory illness,” she says. “This virus is thought to spread mainly from person to person. Foodborne exposure to this virus is not known to be a route of transmission.” But if you suspect you might be sick or have been in contact with someone who is, you should avoid cooking for others as a precaution, she says.Wiedmann agrees: “COVID-19 is not a foodborne virus,” he says. “When you talk to scientists, they’ll never say never, but it’s so unlikely that someone would transmit it through contact with food.”Does a certain cooking temperature kill coronavirus?“Applying heat will kill the virus,” Harris says. “But we don’t have data for this particular virus to be able to recommend a specific time or temperature.”Will we run out of food?“The food supply chain is working, and there is no shortage of food, so there is no need to overstock,” Kniel says. Empty grocery store shelves are only an indication that the recent demand for those goods has surpassed what stores initially planned for. It’s not a permanent shortage. But we get it—this is a really stressful and uncertain time, and being appropriately stocked can ease that anxiety. However, others need to get their essential groceries as well, so Kniel recommends buying only what you need for two weeks.Explore Bon AppétitCoronavirusRead MorecultureSay You’re Stuck at Home for Two Weeks…By Carla Lalli MusiccultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffCoronavirus3 Things to Make You Feel Better About Cooking at HomeBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Jesse Sparks"]}