{"id": "67752eab4c8eea2dc6e0c5173ca6550a", "url": "https://www.bonappetit.com/recipe/better-than-celery-juice", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Celery Juice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBetter Than Celery JuiceBy Anna Stockwell and Sohla El-WayllyNovember 19, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintCelery juice—all the rage! But still kind of a hard sell. With apple, parsley, apple cider vinegar, and a dusting of black pepper, things start to get interesting. Better yet: It also tastes good with gin.Ingredients10–12 servings3Granny Smith apples, scrubbed, coarsely chopped½bunch parsley, coarsely chopped (leaves and stems)5celery stalks with leaves attached, coarsely chopped, plus more for serving¼cup apple cider vinegarPinch of kosher salt¼tsp. freshly ground black pepper, plus more for serving12oz. gin (optional)PreparationStep 1Purée apples, parsley, 5 celery stalks, and 3 cups water in batches in a blender. Strain through a fine-mesh sieve into a pitcher, gently pressing with a spoon to extract as much liquid as possible (alternatively, run apples, parsley, and celery through a juicer and mix with 3 cups water). Stir in vinegar, salt, and ¼ tsp. pepper and add more celery stalks.Step 2To serve, pour 4 oz. juice and 1 oz. gin, if using, into an ice-filled glass and sprinkle with pepper.How would you rate Better Than Celery Juice?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleA question first:  what about adding juniper berry to mimic the taste of gin?AnonymousBay Area, California1/6/2020Explore Bon AppétitCold DrinkDrinks AllAppleFruitCeleryVegetableParsleyHerbs & SpicesEasyDrinksDairy-FreeGluten-FreeNut-FreeNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Anna Stockwell", "Sohla El-Waylly"]}