{"id": "677d1f88a137737978da7cd329086c13", "url": "https://www.bonappetit.com/story/ederique-goudia-taste-the-diaspora", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "How One Detroit Chef Is Serving History in a Shoebox | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow One Detroit Chef Is Serving History in a ShoeboxEderique Goudia noticed there weren’t really any formal celebrations of Black food in Detroit, a majority Black city. So she started Taste the Diaspora.By Kiki LouyaFebruary 26, 2021FacebookTwitterEmailPhoto by Germaine WilliamsFacebookTwitterEmailMy hometown, Detroit, is often characterized by outsiders as a blighted city, plagued with food deserts and abandoned storefronts after the white flight of the mid-20th century. Those of us on the ground have been quietly at work, collaborating with local farmers and makers to reshape our community from the ground up. In the past five years though, a new narrative has emerged, with countless media outlets deeming Detroit a “blank slate” of opportunity for any hardworking, ambitious restaurateur and a burgeoning gastronomic destination.But with more than 300 square miles of land, the city’s supposed restaurant boom seems concentrated to a small, 7.2-mile swatch of its predominantly white Greater Downtown. Worse yet, while this dining revival mirrors a more exalted citywide comeback narrative, painting Detroit as a welcome center for the young and entrepreneurially minded, one group has remained visibly absent from the conversation.Chef Ederique Goudia took notice. Realizing Detroit lacked formal celebrations of Black food, she organized Taste the Diaspora Detroit (TDD), a Black History Month lunchbox project featuring dishes that celebrate the city’s African diaspora. Each week, Goudia’s team partnered with two Black chefs and sourced ingredients from local Black-owned farms to create vibrant meals—from spicy red red stew to smoky jambalaya and plantain mash—available for preorder and pickup at Oakland Avenue Farm in the city’s North End. The project’s success has allowed TDD to distribute 100 free lunchboxes to Detroiters in need. Now, as Goudia looks to build on this momentum, her purpose is clear: to bring visibility to a community so often overlooked in national culinary conversations.Recently, we sat down (via Zoom) to discuss Goudia’s Louisiana roots, how shoebox lunches offer a glimpse into Black history, and the legacy this Southern chef hopes to leave in the Motor City and beyond.Kiki: What was your experience working with local farmers prior to Taste the Diaspora?Ederique: I grew up in Wallace, Louisiana, across the street from my grandfather. He had three large gardens, and we lived off the land in the truest sense; he raised and slaughtered hogs, and we ate everything we grew. I didn’t go to a grocery store to buy produce until he passed away when I was 16! I moved to Detroit in 2002, with the goal of one day opening a restaurant, and I couldn’t believe how many urban farms existed—over 1,600 to be exact. It felt so familiar. Even back then, I knew this was where I was supposed to be.Why do you think it’s taken this long for Detroit to celebrate Black food despite being the largest majority Black city in the country?The narrative surrounding Black food can be very misguided, especially when Eurocentrism is the standard. The reality is that the contribution of food from the African diaspora is the cornerstone of American cuisine today.Instagram contentThis content can also be viewed on the site it originates from.Right, and even as Black Americans, many of us have to search far and wide to learn our family history, never mind our food history too. But that foundation is so important, which is why I love how Taste the Diaspora lunches are packaged in shoeboxes. Can you explain why?During Jim Crow–era travel, Black people weren’t able to eat at certain places. If you were on a road trip, the choice to stop was sometimes a matter of life or death. So you kept food in your car, packed in shoeboxes, paper sacks, or wrapped in fabric. I don’t claim to be some scholar, but I believe there are ways we, as chefs, can educate through the food we make. That’s why TDD’s cocreators—Raphael Wright of Urban Plug and Jermond Booze of June Consulting—decided to package our meals in repurposed shoeboxes. Yes, this is a painful part of our history, but it can also serve as a reminder to show how far we’ve come.Yes, and where we’re headed too! In fact, what was it like collaborating with other chefs for this project? I imagine the work took on new meaning during a pandemic, especially given what the restaurant industry has been through in the past year.At first I really didn’t expect for this to be such an emotional journey. But the pandemic caused so many of us food industry folk to feel very isolated. Some of the participating chefs and farmers were people I hadn’t seen in a year. We’re all just trying to survive here. When we reconnected for Taste the Diaspora, I was so moved, especially by the stories behind each dish. One of the participants, Hamissi Mamba, is an immigrant from Burundi; he owns an East African restaurant called Baobab Fare in New Center. Most months of the year, the people in his village lived in poverty. But when it came time to harvest peas, they knew that food would be plentiful. That’s why he wanted to contribute petits pois, a flavorful pea stew with potatoes and carrots. I would have never known that significance if it weren’t for him, which made me think about food, and this whole Taste the Diaspora experience, in a different way.This is not just about us—you know, Africans or enslaved people. It’s also about the journey the food went through, its migration, how it evolved, and how we evolved with it too.How’s the response so far? Are there plans for this project to return?The response has been incredible! I feel like we have people’s attention now, and I don’t want the conversation about Black food to end just when Black History Month is over. I’d love to continue year-round. I’m currently working on more event programming, maybe a celebration for Juneteenth. There’s so much to learn about how the African diaspora has influenced American cuisines; I really feel like it’s only just getting started.As a fellow chef, I know that the dream of owning a restaurant usually starts with one hope: to feed people and make them feel good. It’s once you get into business when things get really complicated. In the hospitality industry, what can we do to create more inclusive dining spaces, where everyone feels welcome and can enjoy good food together?This really is about as basic as it can get, but start with your neighbor. In Detroit, where nearly 40 percent of people are food insecure, you don’t have to own a restaurant to be of service to people. If you have access to fresh food, share it. As chefs, we need to remember that 30 percent of what’s grown in this country goes to waste. Be mindful of food waste at home and at work and coordinate with the communities around you to extend access. Make friends with your local farmers and build better, more sustainable foodways. Challenge the status quo. We can reform our food system to better serve us all if our work stays rooted in collective action.Lastly, what do you want your legacy to be?Pastry chef and author Klancy Miller recently launched her new magazine, For the Culture, and in the editor’s letter she writes: “I did this because Black women have shaped cuisine in the U.S. and in many countries throughout the world, and our stories about our expertise and relationships to food do not get enough attention.” I couldn’t agree more. I want to create a lasting space for Black women—particularly, those in food—where we can see, and celebrate, our own beauty.Explore Bon AppétitChefsInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-26", "author": ["Condé Nast", "Kiki Louya"]}