{"id": "678246b476ce7a6c9e833a280015d56a", "url": "https://www.bonappetit.com/recipe/fall-larb", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Fall Larb Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueFall LarbBy Parnass SavangSeptember 22, 20205.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintAccording to chef Parnass Savang of Atlanta’s Talat Market, this is a rebellious dish. At first he was hesitant about it as it went against all his training: Larb should only be made with meat! When Talat Market was a pop-up, the kitchen at one point had too many butternut squash, carrots, and parsnips lying around. In a late-night menu session to find a solution, co-owner Rod Lassiter suggested using them to make a larb. They tried it, liked it, and customers loved it.Ingredients4 ServingsToasted Rice Powder¼cup dry sticky rice1lemongrass stalk, bottom third only,tough outer layers removed, thinly sliced11\" piece galangal, peeled, thinly sliced4fresh makrut (Thai) lime leavesDressing2garlic clovesKosher salt2–3red Thai chiles3Tbsp. fresh lime juice1Tbsp. fish sauce2tsp. granulated sugarLarb and assembly½small butternut squash (about 1 lb.), peeled, seeds removed, cut into 1\" pieces1lb. medium carrots or parsnips (about 4), peeled, cut into 1\" pieces2Tbsp. vegetable oilKosher salt2scallions, thinly sliced½cup cilantro with tender stems½cup mint leaves, torn if largePreparationToasted Rice PowderStep 1Toast rice, lemongrass, galangal, and lime leaves in a dry medium skillet, stirring occasionally, over medium heat until about 80 percent of rice is golden brown, 5–7 minutes. Transfer to a plate; let cool.Step 2Place rice mixture in a blender and pulse until texture is sandy but not too fine (a little texture is good). Set aside.DressingStep 3Smash garlic and a small pinch of salt to a coarse paste with a mortar and pestle. Add chiles and lightly smash (the finer you pound the chiles, the spicier the dressing will be). Mix in lime juice, fish sauce, sugar, and 1 Tbsp. water. (Or, finely chop garlic and salt, then chiles, on a cutting board and smash with the side of a chef’s knife. Mix in a bowl with remaining ingredients.)Larb and assemblyStep 4Preheat oven to 400°. Toss squash, carrots, and oil on a rimmed baking sheet to coat; season with salt. Roast, tossing halfway through, until golden brown around edges, 20–25 minutes.Step 5Transfer vegetables to a large bowl. Pour dressing over and sprinkle reserved rice powder on top; toss to coat. Add scallions, cilantro, and mint and toss again to combine.How would you rate Fall Larb?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a real keeper. I made this with sticky rice for my vegan-skeptical family members and they all loved it. Super delicious and so worth it! (I didn't have galangal so I substituted w/ginger). Jennifer KLittle Rock, AR1/18/2021Super good! I couldn’t find galangal, so I had to omit it, but it was still delicious. This will definitely go into our rotation.  Anonymous10/6/2020Explore Bon AppétitLarbSaladThaiSoutheast AsianAsianButternut SquashSquashVegetableFallSideNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Parnass Savang"]}