{"id": "6787289ed44db0f6c70ef7020dfa34c6", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/shirube", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Shirube Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoShirubeA bustling, all-are-welcome pub where the mackerel’s as good as the fried chicken.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for a casual, low-pressure night of drinking and food. While some izakaya skew fancy and others grungy, Shirube is an egalitarian affair where the tired salarymen and the local cool kids can all take off their shoes and down a beer. It’s got an unpretentious menu full of crowd favorites, plus a rambunctious, lively atmosphere for anyone who finds Tokyo too quiet.ORDER THE: shime saba, marinated mackerel fillet that the staff torches at your table; the karaage (Japanese fried chicken); the stewy fishcake and egg oden; and the yakisoba omelet, which is a helping of stir-fried noodles topped with an omelet that is a couple inches thick and doused in a mayo-based sauce.Like any Japanese meal, the finale is everything. The end-of-meal offerings change every now and then, but fried rice is always on the menu. Miso soup, which comes after the main dishes in Japan, is complimentary. To bring it home, order the vanilla ice cream, which comes topped with kinako (a sweet, nutty powder made from toasted soy) and kuromitsu (sugar syrup made from unrefined muscovado).THE VIBE IS: loud and convivial, and the seating is old-fashioned. Find a place on the floor and watch the activity in the large open kitchen as you wait on your order to come out. Don’t worry: The servers will scuttle around you.PRACTICAL STUFF: Open daily from 5:30 p.m. to midnight. The regular menu is in English and Japanese, but the specials are Japanese only. Some English is spoken by the staff, but it’s not a guarantee. Reservations are recommended for groups over four, but smaller parties can usually walk in. The nearest subway station is Shimokitazawa.Photo by Xavier Girard LachaîneThe mackerel fillet gets torched table-side.\nPhoto by Xavier Girard LachaîneTake off your shoes and order a beer.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}