{"id": "67940cb181c8c592e6c0c5a75c6ad41c", "url": "https://www.bonappetit.com/recipe/plantain-and-lamb-casserole", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Plantain and Lamb Casserole Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssuePlantain and Lamb CasseroleBy Commander’s Palace, New Orleans, LAFebruary 9, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintYou will be tempted to cut into this magical casserole as soon as it comes out of the oven. Restrain yourself and let it sit 10 minute before slicing so it can firm up a bit. This recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings4ripe plantains, peeled½cup plus 3 Tbsp. vegetable oilKosher salt2lb. ground lamb1large onion, finely chopped1green bell pepper, ribs and seeds removed, finely chopped3garlic cloves, finely chopped2tsp. chili powder2tsp. dried oregano2tsp. garlic powder2tsp. ground coriander2tsp. ground cumin1tsp. achiote (annatto) powder1tsp. finely chopped thyme8stuffed green olives, thinly sliced½cup chopped raisins1cup tomato sauce or crushed tomatoes7oz. white cheddar, coarsely grated (about 2 cups)3large eggs2Tbsp. whole milkIngredient InfoAchiote powder can be found at Latin markets and in the spice section of some supermarkets, and online.PreparationStep 1Preheat oven to 350°. Slice plantains lengthwise into ¼\"-thick planks. You should get 4 slices per plantain. Heat ½ cup oil in a large heavy skillet, preferably cast iron, over medium-high. Working in batches, fry plantains until deep golden brown, about 3 minutes per side. Transfer to paper towels to drain; season with salt while still hot.Step 2Wipe out skillet and heat 2 Tbsp. oil over medium-high. Add lamb to skillet and cook, breaking up into pieces, until brown, about 5 minutes. Transfer lamb to a medium bowl with a slotted spoon.Step 3Pour off all but 3 Tbsp. fat from skillet and set back over medium-high heat. Cook onion, bell pepper, and garlic, stirring occasionally, until vegetables are soft and golden, 8–10 minutes. Return lamb to skillet and add chili powder, dried oregano, garlic powder, coriander, cumin, achiote powder, and thyme. Cook, stirring often, until fragrant, about 30 seconds. Add olives, raisins, and tomato sauce and cook, breaking lamb up with a wooden spoon, until flavors come together, 8–10 minutes. Remove from heat; season with salt.Step 4Rub a 11x9\" baking dish with remaining 1 Tbsp. oil. Arrange half of the plantains in a single layer in baking dish. (They should be hugging one another). Spread lamb mixture over and evenly sprinkle with cheese. Top with remaining plantains, arranging in a single layer.Step 5Whisk eggs, milk, and a pinch of salt in a small bowl. Evenly drizzle egg mixture over casserole. Using your hands or a metal spatula, press down gently on casserole to adhere layers. Cover dish tightly with foil.Step 6Bake casserole until cheese is melted, about 10 minutes. Remove foil and continue to bake until deep golden brown around the edges, 20–25 minutes longer. Let rest 10 minutes before slicing.Step 7Do Ahead: Casserole can be assembled 1 day ahead. Cover and chill.How would you rate Plantain and Lamb Casserole?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI had a bit of a learning curve on slicing the plantains evenly--and having 5 on hand instead of 4 would be my plan for next time--but this came out really well. I used an oval CorningWare that is my go-to for casseroles, and that was the right size for two layers of fried plantains. They weren't all nestled as closely as they could have been, and another 3 or 4 slices would have been perfect. Tamping down the top fit everything in nicely and there was no overflowing of the cheese and custard layers on top. The top browned beautifully. \nIt did take quite a bit of time to make this, but it was worth it. The picadillo component was delicious and making it with beef instead of lamb would also work and be somewhat cheaper. The 10 minute resting period was enough for everything to be solid enough to slice for serving. I didn't slice up the rest to portion for leftovers until later, and everything had cooled so much that there was a crumbling problem getting some of it out. Next time I would cut and remove all of it from the casserole after that 10 minute period.Anonymous9/7/2018Essentially shepherd's pie from New Orleans. Pretty solid. Use between 1-2 eggs (3 is definitely overkill) and you probably need 2 additional plantains. Doing this in a relatively deep Dutch oven is also preferable given the volume of food here. canadianbaconBoston by way of Hamilton5/14/2018Explore Bon AppétitCasserolePlantainVegetableGround LambLambMeatCheddarCheeseTomatoMainGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}