{"id": "679dde6bd35557a00786367d17260b48", "url": "https://www.bonappetit.com/story/pork-tenderloin-is-good-everyone-else-is-wrong", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "I’m Sick and Tired of People Hating on Pork Tenderloin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Sick and Tired of People Hating on Pork TenderloinPork tenderloin is rad and tasty and awesome and tender, and I want you to give it the love it deserves.By Alex DelanyJune 12, 2018FacebookTwitterEmailPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyFacebookTwitterEmailA lot of people love pork tenderloin. And a lot of people hate pork tenderloin. I fall into the first category, and most of my colleagues at the Bon Appétit office  fall into the second, claiming it’s a passé cut of meat. As much respect as I have for my coworkers, I can’t help but wonder how it must feel to be so wrong. Pork tenderloin should be embraced (figuratively). Let me tell you a story about me, friendship, and pork tenderloin.Do you know how much pork tenderloin I ate growing up? I ate so much pork tenderloin. So. Much.It was a weekly staple in the Delany household at some point in my childhood. It was most likely because my mom had four kids, and throwing a pre-marinated, affordable pork tenderloin in the oven was easy. That’s the draw of supermarket pork tenderloin: convenience. You get a cut of meat that’s individually-wrapped and seasoned with a marinade like lemon-garlic something or sweet-soy-ginger whatever. It feels special, because it’s one big piece of meat. And I liked it. But I got tired of it.It seemed like a relic of early 2000’s suburbia, which was not the wave I was interested in riding through college. I didn’t reintroduce myself to pork tenderloin until I really learned to cook in my senior year of college. I’d make it when I could afford it and needed a homely comfort. Sometimes I’d grill it. Sometimes I’d wrap it in bacon and roast it. But I was still cooking the individually-wrapped, pre-marinated pork tenderloins of my childhood.Pork tenderloin can be a sandwich, if you want it to be.\nPhoto by Alex Lau, styling by Judy ManciniIt wasn’t until I decided to graduate to a grown-up butcher shop where I could buy a freshly-butchered pork tenderloin, sans-marinade, and wrapped in paper (instead of plastic), that my views really changed. It was while standing at a hand-me-down Weber in the backyard of my college home that I realized something: The pork tenderloin of my childhood was not good.Eating the pork tenderloin that came off of that grill, seasoned only with lime juice, chile flakes, salt, and pepper, ruined it for me. With each bite, I realized that the pork tenderloin I grew up with was a shade of what that cut of meat could be. This grilled tenderloin was tender and supremely juicy, nothing close to stringy as a result of being marinated in plastic for far too long. From there I only learned more.I learned that pork tenderloin should be cooked somewhere between medium-rare (145°) and medium (160°). My parents grew up in the time of gray pork. Medium-rare pork was considered unsafe. It’s not my parents’ fault that we ate overcooked pork tenderloin. But we know better now. Most people who hate pork tenderloin haven’t cooked it properly. On the grill or in the oven, I like my pork tenderloin cooked to an internal temperature of 150° to get it to that pink-but-not-chewy point. You can go a little less pink, but never to an internal temperature higher than 160°.You can coat pork tenderloin in chiles, if you want to.\nMarcus NilssonI learned that you get what you pay for. In all matters of life, sure, but also in matters pertaining to pork tenderloin. This is pork tenderloin’s main problem: If you buy shitty meat, it will taste shitty. If you do a quick search online, you’ll see pork tenderloin being sold anywhere from $7.00 to $19.00 a pound. That’s a huge margin for the same cut of meat. There’s a time and place for everything, but you should buy the best quality meat that you can afford. It’s better for the butchers, the animals, the earth, and your dinner. But...back to cooking.I learned that pork tenderloin is amazing in a stir-fry. After cooking an entry-level pork tenderloin and eggplant stir-fry recipe with a college girlfriend multiple times, it became my favorite meat to stir-fry. And it still is.  Slicing it thinly, across the loin, creates perfectly-sized meat medallions. You can throw a quick marinade on sliced pork tenderloin and stir-fry it to perfectly-cooked, tender, manageable pieces in about five minutes. It’s cheaper than a cut of steak that will give you that level of satisfaction, and it’s more interesting than chicken. Obviously.You can serve pork tenderloin with golden beets, if you want to.\nAlex LauNow, I work in an office where the mention of pork tenderloin gets met with a chuckle or a smirk. Oh, pork tenderloin? Ha! How silly of you to bring it up, you uncultured swine. Let’s talk about real meat. That’s the attitude, most of the time. My coworkers think they’re too cool for pork tenderloin. I think they view it as a dusty trend, still living in grocery store refrigerators, and on the menus of sub-par “New American” restaurants. I’m not calling people out here. I just wish we were more accepting.So whether or not you care about my family history with this cut of meat (love you, mom) or the opinions of almost everyone at Bon Appétit (love you all, in a professional type of way), I just want to say that pork tenderloin should be on your plate. It is a fantastic cut of meat. And after all the times that pork tenderloin has been there for me, whether we’re talking low or high-quality meat, writing this is really the least I can do. I love you, pork tenderloin. Not like I love my mom, but still. Love you lots.Get the new recipe pictured up top: Grilled Pork Tenderloin with Peach-Mustard SauceSpicy pork bowl? Yeah, with pork tenderloin.Spicy Pork Bowl With Greens and CarrotsGiving pork tenderloin a bulgogi-influenced makeover makes it flavorful, fast-cooking, and weeknight-friendly.View RecipeExplore Bon AppétitPork TenderloinPorkGrillStir-FryRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-12", "author": ["Condé Nast", "Alex Delany"]}