{"id": "67b96e992e0a4b862dfd1589476e0414", "url": "https://www.bonappetit.com/recipe/tiramisu-with-amaretti-cookies", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Tiramisù With Amaretti Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueTiramisù With Amaretti CookiesBy Ignacio MattosApril 17, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe crunchy almond cookies replace soft smushy ladyfingers for a welcome twist on the classic dessert. For a long, lazy lunch menu serve this dessert after a spread of sea bream crudo, tomatoes and haricots verts, handmade malfatti, and grilled turbot.Ingredients8 servings 6large egg yolks½cup sugar3cups mascarpone3Tbsp. dark rum¼tsp. kosher salt1cup espresso or very strong coffee17-oz. bag amaretti cookies (Italian macaroons; about 4 cups)2Tbsp. unsweetened cocoa powderSpecial EquipmentEight 6-oz. glasses or ramekinsPreparationStep 1Whisk egg yolks in a medium bowl to blend, then gradually add sugar, whisking constantly until mixture is thick, smooth, and pale yellow. Using a rubber spatula, gently fold in mascarpone, rum, and salt; set aside.Step 2Place espresso in a small bowl. Working in batches, gently mix and turn cookies in espresso 20 seconds to soak. Divide cookies among glasses and top each with ½ cup mascarpone mixture. Chill at least 1 hour.Step 3Dust tiramisù with cocoa powder just before serving.Step 4Do Ahead: Tiramisù can be made 1 day ahead. Cover and keep chilled.How would you rate Tiramisù With Amaretti Cookies?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertItalianEuropeanMascarponeCheeseEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}