{"id": "67be426e9c504ca2ff94da80fc36102f", "url": "https://www.bonappetit.com/story/gluten-sensitive-sourdough", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Why Sourdough Bread Can Still Be Eaten By Some Gluten-Sensitive People | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Some Gluten-Sensitive People Can Still Eat Sourdough BreadGluten-sensitive but bread-obsessed? Try sourdough.By Keri WigintonApril 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHumans have eaten sourdough since the ancient Egyptians were grinding grains and leavening bread thousands of years ago. But as a child of the ’80s, I grew up on processed white bread so soft it practically made chewing unnecessary.As an adult I’ve had to part ways with the bread of my childhood. I could no longer digest the commercially processed stuff, but, unfortunately, most of the whole grain loaves I picked up from the bakery weren’t any easier on my stomach.Then I found sourdough.The fermentation process that gives the bread its distinctive sour taste also makes it more gut-friendly. Millions of people are suffering from digestive malaise, and if you’re sensitive to foods containing gluten or have irritable bowel syndrome, sourdough bacteria’s ability to break down flour has never been more important, says Vanessa Kimbell, who’s been baking since she was 11 and runs The Sourdough School in the UK.“The same microbes that are in the soil are the same microbes that are in that pot of sourdough starter, which are the same microbes that are in our gut,” Kimbell says.I have endometriosis, an inflammatory condition that not only affects my reproductive organs but also takes a toll on my digestive tract. So when I eat certain foods—like quickly leavened bread—my stomach suffers.I switched to sourdough when a gastroenterologist suggested I try to ease my constant abdominal cramping and bloating with the low-FODMAP diet. Researchers at Monash University in Australia designed the six-to-eight week elimination plan to ease symptoms for those with irritable bowel syndrome, but research shows it might help those with endometriosis as well.FODMAP stands for fermentable oligosaccharides, disaccharides, monosaccharides, and polyols—poorly absorbed sugars and fibers found in certain grains, fruits, and vegetables, along with some dairy products and artificial sweeteners. When these carbohydrates—like those found in wheat—are fermented by bacteria, they produce gas and attract water when they pass through the gut, causing the bowel to stretch, says Jane Varney, senior research dietitian at Monash University.If you have a normal gut, this stretching and expanding isn’t a problem. But those with IBS sometimes have visceral hypersensitivity, Varney says. Simply put, if you have a sensitive gut, this extra water and gas can cause you more pain than your digestively blessed friend who just ate the same whole wheat sandwich.What makes sourdough easier to digest?The wild yeast and bacteria in a sourdough starter break down some of the carbohydrates and proteins found in flour, says Kate Scarlata, a Boston-based dietitian and author of The Low-FODMAP Diet book. When bread is made with fast-rising yeast, the bacteria don’t have time to do any pre-digesting.“When you add baker’s yeast, that speeds the process of the rising of the bread, and it doesn’t give the fermenting event enough time to really happen,” Scarlata says. “It should be a 12-hour-plus process for best digestibility.”The process also breaks down a carbohydrate found in wheat called fructan. “We know from our research that in a large proportion of people it’s the fructans in foods that they’re sensitive to as opposed to the gluten,” Varney says. When you limit foods containing gluten, you also limit exposure to fructans, which will help symptoms in those people.What are the health benefits of sourdough?Bacteria are often considered germs or disease agents, says Anne Madden, a researcher with the Sourdough Project at North Carolina State University’s Rob Dunn Lab. But often bacteria ward off other, harmful bacteria and help make some food more nutritious.“Unlike standard yeast bread, sourdough has a community inside of it,” Madden says.The process also increases the body’s ability to absorb vitamins and minerals from the bread. As the dough ferments, it produces enzymes that break down phytic acid. Phytic acid can lead to gas production in those with IBS and can inhibit the body’s ability to absorb nutrients, according to Kimbell in her new book The Sourdough School.Basically, you poop out all the good stuff.Last, if you’re trying to control your blood sugar, sourdough is a better option than fast-fermented breads. Research shows sourdough has higher levels of resistant starch than other breads, especially when whole grains are used. This means blood sugar levels spike less because it takes the body longer to digest the carbohydrates.How do you know if it’s real sourdough?If you’re not making your own sourdough, it can be hard to know if you’re getting the real deal. Some bread labeled sourdough just has a sour flavor added but is leavened with fast-rising yeast. Others don’t include a fermentation time on the package.“If you’re buying it from a store, you’re buying blind,” Kimbell says. “When you say sourdough—because there’s actually no legal definition whatsoever—we’re open to interpretation. It’s not wrong. It’s just not transparent.”Scarlata advises her fructan- and gluten-sensitive clients to read labels closely, avoid products with baker’s yeast, and call the bread producer directly to ask how the bread is leavened and for how long.Want to make your own?There are about a million recipes, instructional videos, and books on sourdough, but there is no “right” way to make a loaf, Kimbell says. The secret, it seems, is just practice. If you’re interested in delving into the world of sourdough, check out Kimbell’s (free) recipe, along with 50 other options, at sourdough.co.uk. (Or check out Alex the French Guy on YouTube, whose method I use.)While the sourdough process makes bread easier on my gut, I still can’t eat as much as I want. Since I have a wheat intolerance, not an allergy, I have to limit my overall intake of fructans, which are also highly concentrated in garlic and onions. And if I’m eating bread, I exclude foods high in FODMAPs like apples, cauliflower, and beans, just to name a few.I learned to make sourdough so I could set my own proving time to reduce the fructan load even more. Personally, I find a 24-hour rise is best for my digestion, but depending on individual sensitivity, Kimbell says bread can rise for up to between 36 to 48 hours.“I have people who say just sourdough itself is easily digestible,” Kimbell says. “I have another lady who has colitis who couldn’t digest it after 12 hours, couldn’t digest it after 24 hours, but then did 36, and she’s now eating as much bread as she can stuff in her face because she’s eating bread for the first time in years.”If you think you might be sensitive to fructans or other FODMAPs, consult a medical professional to rule out celiac or another gastrointestinal disorder. For an up-to-date guide on FODMAP foods, download the smartphone app designed by the Monash team for details on specific items.Explore Bon AppétitHealthyishBreadRead MoreLifestyleWhole Wheat Is No Healthier than White Bread, Food Scientists ClaimBy Ali RosenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-16", "author": ["Condé Nast", "Keri Wiginton"]}