{"id": "67bfcd2b0393df0e68b133b093e763ed", "url": "https://www.bonappetit.com/story/homemade-sour-mix", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "Homemade Sour Mix Is Your Ticket to Happy Hour Bliss | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHomemade Sour Mix Is Your Ticket to Happy Hour BlissWith a bottle of this sunny concoction on hand, a whole host of tart, refreshing cocktails are just a shake away.By Amiel StanekJune 30, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.“Who wants a cocktail?” is an offer that I always want to make to guests as a lazy summer afternoon begins to bend toward sunset. But the thing is, I’m not trying to spend those precious golden hours squeezing citrus, or making simple syrup, or measuring out dribs and drabs from a bunch of bottles while my friends lounge around expectantly. I want those cocktails to just happen. Which is where homemade sour mix comes in.What is sour mix, you ask? Well, it’s easiest to understand in the context of The Sour, a category of bright and bracing shaken cocktails that you already know and love—think whiskey sours and classic daiquiris, margaritas and gin gimlets—that are all essentially comprised of booze, tart citrus juice, and sugar. Sour mix is simply the sour and sweet elements of that tantalizing trifecta combined in the proper ratio, thus saving you from having to measure them out separately when it’s time to make a drink. You can find a shelf-stable version for sale at most supermarkets, but it’s often fluorescent, corn-syrup laden, and lacking the characteristic bite of freshly squeezed citrus. But the good news is that making sour mix yourself could not be easier, or more delicious.To make a quart of your very own sour mix at home, which is enough for about 18 individual cocktails (!!!), start with 1 grapefruit, 4 limes, and 6 lemons. Give all the citrus a good scrub under cold water to get any schmutz off, and then use a vegetable peeler to remove wide strips of the zest from that grapefruit, all those limes, and three of the lemons. Toss all of the zest into a saucepan along with 1 cup of granulated sugar and ½ cup of water, bring the whole situation up to a simmer over medium heat and let it bubble, stirring occasionally, until the sugar is totally dissolved, which should only take 3 or 4 minutes. Take that saucepan off the heat to cool while you get juicing. (You can also set the saucepan in a bowl of ice water if you’re really in a hurry; it doesn’t need to be cold-cold, but it shouldn’t be super hot when you mix it with the citrus juice.)Now, using your citrus juicing-mechanism of choice, go to town on the zested and un-zested citrus. You’re ideally looking to get ½ cup grapefruit juice, ½ cup lime juice, and 1 cup lemon juice, which may mean that you don’t need to use all of your citrus depending on their juiciness. Strain the juice through a fine mesh sieve into a quart-sized jar or bottle, then strain your zest-infused simple syrup into the same vessel, close tightly, and shake to combine. Ta-da! Homemade sour mix that will stay good for three days in the fridge (if it lasts that long).Having a batch of this sunny concoction waiting in my fridge means any number of refreshing, heat-beating drinks can be ready at the drop of a hat. Simply combine 2 oz. booze and 1¾ oz. sour mix in a cocktail shaker, fill with ice, shake hard, strain straight-up into frosted coupes or rocks glasses filled with fresh ice, and serve. Mixology types might balk at this loosey-goosey approach to cocktails in the sour family—a daiquiri is technically made with only lime juice; a margarita typically also contains orange liqueur—but you know what? Whether I’ve combined this sour mix with whiskey or rum, tequila or mezcal, gin or vodka, I’ve never heard a single person complain about the resulting drink. They do always ask for another, though—and I tell them they can go ahead and shake up the next round.Explore Bon AppétitIt's That SimpleBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-30", "author": ["Condé Nast", "Amiel Stanek"]}