{"id": "67c0acc10689f84715ace0c026f635cf", "url": "https://www.bonappetit.com/recipe/tofu-and-summer-vegetable-curry", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Tofu and Vegetable Curry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueTofu and Summer Vegetable CurryBy Heidi SwansonAugust 13, 20193.7(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintThis quick vegetarian curry from Heidi Swanson, the vegetarian cookbook author and blogger behind 101 Cookbooks, is a great way to use a CSA’s bounty of eggplant and summer squash. Feel free to change that lineup depending on your haul. You can eat the curry as is, or ladle it over cooked noodles or rice to add some heft.Ingredients4 servings4Tbsp. virgin coconut oil or extra-virgin olive oil, divided114-oz. package firm or extra-firm tofu, patted dry, cut into ½\" cubesKosher salt2medium onions, coarsely chopped⅓cup red curry paste2large zucchini, cut into ½\" pieces1large or 2 small Japanese eggplant, cut into ½\" pieces8oz. green beans, trimmed, cut into 1\" pieces113.5-oz. can unsweetened coconut milkLime wedges, cilantro leaves with tender stems, and coarsely chopped salted, roasted peanuts (for serving)PreparationStep 1Heat 2 Tbsp. oil in a large skillet, preferably nonstick, over medium-high. Add tofu in a single layer and cook, turning over once, until cooked sides are golden brown, about 4 minutes. Transfer to paper towels to drain. Season with kosher salt.Step 2Heat remaining 2 Tbsp. oil in a large pot or high-sided skillet over medium-high. Add onions and a generous pinch of salt and stir to coat. Cook, stirring often, until softened, about 4 minutes. Stir in curry paste and cook, stirring often, until darkened in color, about 2 minutes. Add zucchini, eggplant, and green beans and cook, tossing to coat, until vegetables are softened and starting to brown in spots, 5–7 minutes. Pour in coconut milk and ½ cup water and bring to a simmer.Step 3Add tofu to pot and stir gently to combine. Cook until warmed through, about 3 minutes. Season with more salt if needed.Step 4Divide curry among bowls and add a generous squeeze of lime juice to each. Top with cilantro and peanuts.How would you rate Tofu and Summer Vegetable Curry?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI saw the reviews saying it was bland, but didn’t make alterations until towards the end. I did add more vegetables though (head of cauliflower & a red bell pepper) so I upped the curry paste & coconut milk a bit. And I cooked it slightly longer for the cauliflower. After it had simmered in the coconut for a few minutes I tasted it. I don’t think it was super bland, but my boyfriend and I both like LOTS of seasoning no matter what we are eating. I pretty much dress up every recipe I make. I added fish sauce, sriracha, ground ginger, garlic powder, paprika, curry powder, and more salt. I think it is perfect after that! I think this is a really great base recipe that has tons of room for customization & it is pretty quick & easy!  AnonymousSouth Carolina3/21/2021I ended up making several tweaks to this and thought it came out good!\nUsed green curry paste instead of red, and substituted carrots for eggplant.  I didn't really have a problem with blandness like others mentioned, though I think if I were to make this again I'd add a hot pepper of some kind because I think it'd really benefit from some spiciness.  AnonymousChicago10/6/2020I found this to be quite bland. Maybe I used a bad curry paste or used too many veggies to be properly flavored. AnonymousEasthampton, Ma8/30/2020I don't understand this recipe at all. How are you supposed to add curry paste and then brown the vegetables, without burning the curry paste in the bottom of the pan?AnonymousBrooklyn8/19/2020This recipe is so good ! I made little changes, I used only coconut milk and no water. added some curry powder and paprika. Don’t hesitate to add good amount of salt. Also tried to roll this in flat bread and this was even better than just dish it self.EccotoTbilisi , Georgia8/9/2020Echo many others here. Becomes quite bland unless you change the recipe. I would not add any water, just the coconut milk. I also added a lot of fish sauce to salt it up instead of adding salt. \n\nVery low mess, low effort meal though which is nice. AnonymousSan Diego6/20/2020I love this recipe and 101 cookbooks and this is my go to curry recipe. If you think this doesn’t have enough flavor, I strongly suggest you adjust the salt. This recipe has plenty of flavor but you need salt to make sing. No need for more aromatics, just taste, add salt, taste, add salt, until you get it right.AnonymousPortland, OR6/5/2020So I made this and tried to add more flavor as commenters suggested. I added a couple cloves of garlic, basil, and extra curry paste but unfortunately, it still fell short for my taste. Definitely needed more spice. Perhaps I should've used a different brand of curry paste (I used the thai type you can get at whole foods).AnonymousNashville, TN11/5/2019Out turned out pink in color and looks like barf :(\nIt does taste good - but the color throws us off. Lime is definitely required.alextorontoToronto9/26/2019This recipe is lacking MAJOR flavor! Usually BonAppetit is better. Also, curries no matter for what season demand lots of flavor...you can't call a dish a curry dish if you only flavor it with a processed curry paste. But with some added garlic (approx 2-3 bulbs depending on like), black pepper, cumin, garam masala, curry powder, pureed Serrano or other hot pepper of your choice...the recipe is basically a building block for a summer curry. AnonymousPittsburgh, Pa9/25/2019Followed this recipe as is plus a jalapeno for extra spice and loved how easy and flavorful this recipe was! I will definitely use this as my go to curry recipe from now on. I will also try this with chicken next time to mix it up.stephlifebeauty7488Washington, DC9/24/2019Delicious! this goes into the rotation.\nmcmargy10801Arizona9/7/2019This was super bland. I used an entire jar of Thai brand red curry paste, and it basically didn’t have any flavor at all. I ended up adding chili sauce to my bowl for something, but then it was only heat and not so much flavor. Lime is a must. I also needed to cook the tofu for longer than indicated, as well as simmered the veggies for longer because they weren’t quite done after the listed time. Maybe it was bad curry paste? Celina WillDenver, CO9/7/2019I thought this was excellent.  I used thai red curry paste, and I also found it took alittle longer than the recipe called for to brown the tofu and simmer the veggies.  DELICIOUS !  Loved the eggplant.  cschmidt1120phoenxi9/6/2019I used Thai red curry and the recipe was exploding with flavor! I'm not a fan of coconut so I subbed creme fraiche and it worked out fine. Added potatoes for heft. Will be dividing into containers for the freezer for on the go lunches throughout the year.iamerykaNew York9/2/2019Explore Bon AppétitCurrySoutheast AsianAsianTofuOther IngredientsEggplantVegetableZucchiniSquashGreen BeanCoconut MilkSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeVegetarianHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Heidi Swanson"]}