{"id": "67c849e956543092fd83eb0e10833d5b", "url": "https://www.bonappetit.com/story/imbiblia-cocktail-app", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Need Easy Cocktails to Make at Home? Take a Look at This App | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis App Taught Me Everything I Know About CocktailsBar menus used to fill me with dread. Not anymore!By Ali FrancisMarch 4, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailFor a long time I felt the same way about making cocktails as I did about learning to code. And that is to say: not for me. It’s not that I didn’t think either were solid life choices—one will make you popular and the other will make you rich—it’s just that I honestly couldn’t tell you what Chartreuse is any more than I could JavaScript. (Some kind of ancient scroll?) I am almost 31 years old, with no basic cocktail knowledge, and it felt too late to start learning now. This haggard old sponge simply can’t be expected to absorb everything.Last year all that changed. My boyfriend, who loves a craft cocktail, and I went on a road trip for the better part of 2021. Our “thing” was going for a drink at whichever local watering hole we were closest to. I’d stare blankly at the menu while he confidently zeroed in on his perfect order—usually something with lemon and cognac, whatever that is. I would struggle through my ill-ordered cocktail like it was a poisoned chalice, a bystander to my BF’s blissful sipping. Until one night it struck me that—as someone who recently learned to snowboard, regularly surfs big waves, and once stood on the spikes of a deadly fish and lived to tell the tale—the only thing holding me back from booze actualization was my own insecurity.Soon after our trip I found my cocktail teacher in the form of an app: Imbiblia, which was designed for bartenders, restaurants, and drink nerds but features a very simple, beginner-friendly user interface and 450 recipes for cocktails and ingredients like syrup. Like the digital version of your mom’s old recipe folder, the “library” features an alphabetical list of cocktails. When you click into one, the page displays the ingredients and quantities, along with a series of cute illustrations that quickly suggest whether your drink should be shaken or stirred, served over ice or neat, in a martini glass or highball, and a few garnish options. A little info section also outlines the history of each drink, and a batch calculator helps you scale up the recipes for a crowd. I had to go and look up some cocktail jargon (double-strain?), but Imbiblia definitely teaches a man to fish.After cringing through And Just Like That…—which a colleague aptly said she “affectionately hated”—I binged all of Sex and the City. Hence came the inspo for my first experiment: cosmopolitans. Once I’d mastered Imbiblia’s recipe, I tried swapping out vodka (a spirit I’m going to leave in my university days) for a floral gin, and cranberry for pomegranate juice (much better!). I learned that I loved the citrusy Cointreau, despite blacking out on the dance floor after doing four shots straight in school and never touching it since. So I tried a White Lady next: two parts gin to equal parts lemon juice and Cointreau, shaken with ice, double-strained, and served neat in a coupe. Super easy to make but chic-looking enough to feel accomplished doing it. When I wasn’t sure what I felt like next, I chose the cocktails with cute names: Swizzle! Fizz! And the Bicicletta, a spritz that is also the Italian word for bicycle. Sip by sip, I learned.Imbiblia’s Canada-based developer, Jean-Marc Dykes, designed the app during his own existential crisis: After more than a decade working behind bar counters, he was laid off from his job in March 2020. So he moved into a souped-up van, borrowed friends’ wifi, and decided to teach himself to code by working on the project he’d always dreamed of.“I got the idea for it years before the pandemic,” Dykes tells me over the phone. “I was behind the bar and dealing with that sticky [cocktail recipe] binder—peeling two pages apart from one another just to check one tiny little ingredient—and I remember thinking that there's got to be a better way than this monstrosity.” After building the app over nine months, he launched the first version of Imbiblia on the iOS App Store last August, and then on the Google Play Store in September. (In both places it costs a one-time fee of $2.99 to download.) It’s been ranked the number one food and beverage app by Apple a couple of times since launch and has been downloaded over a thousand times by cocktail enthusiasts of all types.After a long day snowboarding recently, my boyfriend and I went out for après. I confidently ordered a sour, made with local honey rye whiskey, apricot puree, and maple syrup. As we sat by the fire reminiscing about our runs, I remembered why I wanted to learn about cocktails in the first place—not to flex my knowledge or make sure I remain employed at this food magazine, but to bask in shared bliss with the people I love. Those sunset-hued Cosmos? Adorable! The fruity-sweet White Lady? Soooo fun. The syrupy sour? A bright spot on a cold day. In an era of almost constant FOMO, nailing your cocktail order in good company is a small pleasure.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-04", "author": ["Condé Nast", "Ali Francis"]}