{"id": "67ce7000b71402efa2ef562cca5a29b7", "url": "https://www.bonappetit.com/story/the-shop-portland-maine", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "The Shop in Portland, Maine, Is My Ultimate Summer Hang | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Shop in Portland, Maine, Is My Ultimate Summer HangIt’s got oysters, tinned fish, refreshing wine, and, oh, caviar.By Alex DelanyJuly 30, 2019FacebookTwitterEmailPhoto by Greta RybusFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If you do something simple the wrong way, that’s a one-way ticket to boredom. Case in point: Unsalted potato chips. (Just, why?!) But if you do something simple the right way, it’s like the world just makes sense. The folks at The Shop in Portland, Maine, understand this, and absolutely nail it.There are no elaborate seafood stews or grilled whole fish or ambitious desserts at this seafood joint from the crew at Island Creek Oysters in Massachusetts. It sells oysters, caviar, and tinned seafood spreads. That’s it. The oysters, usually local Maine and Massachusetts varieties, are just $1.50 each and come on large trays of ice with the classic fixings: lemon wedges, horseradish, cocktail sauce, and shallot mignonette. The caviar is also produced by Island Creek and best enjoyed on top of said oysters (not to mention very affordable). The tinned fish—smoked mussels, oil-packed tuna, beautiful sardines—is served with slices of sourdough bread, spicy mustard, butter, chives, flaky salt, sauerkraut, pickles, onions, and saltines, and is arranged in such a way that you almost don’t want to disrupt the harmony of the composition. Almost.But then you and your friends dig in. Maybe you order one more, and sip local pilsners and refreshing, light-bodied natural wines while you wait. Then another round of oysters—actually, let’s make that two. Caviar, too. After a few more beers, you’ll look down at your watch (people still wear those, right?) and realize you’ve been sitting in the airy, sun-soaked room for just about all afternoon. Then someone will ask who needs another pilsner. And you’ll give a joyous nod, as you continue living out the best day of your summer. Simple, done the right way.Go there: The ShopExplore Bon AppétitHighly RecommendRestaurantsPortland MaineSeafoodRead MorerestaurantsForget the Solstice, Only Tandem Bakery’s Loaded Biscuit Tells Me It’s SummerBy Alex DelanyrestaurantsPortland, Maine, Is the 2018 Restaurant City of the YearBy Andrew KnowltonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-30", "author": ["Condé Nast", "Alex Delany"]}