{"id": "67d33a44da68d046194adbe52d860b23", "url": "https://www.bonappetit.com/story/chaat-masala-spice-blend", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Chaat Masala Is the Indian Spice Mix I Put on Almond Butter Toast (and Everything Else) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Indian Spice Mix I Put on Almond Butter Toast, and Everything Else HonestlyIt adds a blast of umami and who would not want that??By Priya KrishnaMay 7, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailTrader Joe’s may have its Masala Simmer Sauce and Whole Foods its countless curry powders, but it’s very obvious to me that none of these generic-tasting, premixed Indian-inspired concoctions holds a candle to using fresh spices and making your own blends.Except, that is, when it comes to chaat masala.Chaat masala is an otherworldly spice mixture in Indian cuisine often consisting of amchoor (dry mango powder), cumin, coriander, black salt (also known as kala namak), asafetida (sort of like Indian MSG), and chili powder. I use the word otherworldly here because its powers are mysterious and forceful—the blend itself smells somewhat alarmingly like rotten eggs, but the effect it has on a sandwich, a piece of fruit, a salad dressing, and about a million other things is mesmerizing. It adds a combination of elemental funk, umami-like intensity, and inexplicable depth and complexity. It is the only acceptable type of store-bought Indian spice blend you should have in your kitchen.Alex LauThe origins of chaat masala are somewhat mysterious. A popular (though unproven) story claims it was created in the 17th century by the kitchen staff of the Mogal emperor Shah Jahan, when he was sick and could eat only smaller, lighter fare. The cooks invented chaat—a category of tangy, spicy Indian snacks like a puffed-rice salad called bhel puri or yogurt-coated crackers called papdi chaat—as well as chaat masala to be the accompanying seasoning. These days, though, Indians don’t just use chaat masala for chaat—it’s become a go-to flavoring for practically anything savory or fruity.Growing up, I was ashamed of my love for chaat masala. I never dared pack it in a school lunch out of fear that the pungent smell would stink up my lunch box and make me the subject of endless ridicule. I was embarrassed when my dad put chaat masala in a miniature pill bottle and brought it with us on all of our family trips abroad. (Have you ever witnessed the reaction of a Tokyo ramen master after your father has added chaat masala to his shoyu broth? Spoiler alert: not great.) But in private, I was addicted to the stuff.Here was a spice that you could add to anything with cheese (I like it on grilled cheese sandwiches, in particular) and make an already umami-packed ingredient even more savory and craveable. You could sprinkle it on even the limpest of sandwiches and you’d think you were enjoying something far more sophisticated. You could throw some in a tomato soup that needs waking up, a vinaigrette that needs a touch of interest, or ANY kind of roasted vegetable (though I strongly recommend potatoes). Remember when the internet became collectively angry at a video that suggested putting salt and spices on fruit? This reaction infuriated me as there is no sweet-tart-tangy combination more wonderful than chaat masala on watermelon slices.My mom blew my mind a few months ago when she told me that chaat masala tastes great on almond butter toast. Yes, you read that right. There’s something about the nutty richness of almond butter that tempers the salt and funkiness in chaat masala. You can check my Insta story: I’ve eaten almond butter toast every day for the past several months, bad breath be darned.I am no longer a clandestine chaat masala lover. In fact, I would go so far as to say that chaat masala is the single most used seasoning in my pantry. Nothing else packs such a powerful punch in a single serving or can be used in such a wide variety of foods. And now that my favorite brand is available on Amazon (for only $6.29!!!), I suspect that I’ll be Prime Now-ing chaat masala to essentially everyone when my book comes out.So, on behalf of Indian people everywhere, please, please stop buying prepackaged “curry” powders. Skip the Masala Simmer Sauce! Do your cooking routine a solid: Get chaat masala instead.Buy it: Badshah Chat Masala on Amazon for $6.29Other options:Shan Chat Masala 100 gram box (Pack of 3), $10 on AmazonMDH Chunky Chat Masala, 100 gram box, $1 on AmazonPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Read more: The Raita Formula I’ve Memorized for Yogurt Sauce SuccessAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitIndianishShoppingSpiceIndianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-07", "author": ["Condé Nast", "Priya Krishna"]}