{"id": "67e3a17ac97780a7b9a8d0f32ad8891c", "url": "https://www.bonappetit.com/story/museum-of-candy-new-york", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "A Museum of Candy Is Coming to New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Museum of Candy Is Coming to New YorkA candy unicorn, the world's largest gummy bear, and 15 \"experiential rooms.\"By Emily WangFebruary 13, 2018FacebookTwitterEmailBruno Raffa/Getty ImagesFacebookTwitterEmailTwo years ago, all of our respective Instagram feeds were taken over by the Museum of Ice Cream, a pop-up shrine to the popular frozen dairy dessert. It was impossible to open the app without seeing a photo of the pit of rainbow sprinkles, edible candy balloons, or the seesaw in the shape of a giant scoop. This summer, you can expect the same but much, much bigger (and high-fructose-corn-syrup-ier), because the Museum of Candy is coming to New York City.The Museum of Candy, an offshoot of the Sugar Factory restaurant chain, is for everyone who didn’t think the Museum of Ice Cream was Willy Wonka enough. As reported by Eater, this museum of sweets will be 30,000 square feet with 15 “experiential rooms” themed around candy, a dessert market, a Sugar Factory branch, an outdoor cafe, and no shortage of exhibits. Said exhibits, according to Eater, will include candy murals, candy art installations, candy-tasting areas, a candy unicorn, and, allegedly, the world’s largest gummy bear.“The idea to create a Museum of Candy originated from the imagination of my inquisitive children and my own personal dreams about a magical candy land,” Charissa Davidovici, the founder of Sugar Factory, told Time Out. “We also drew inspiration from all of our guests at Sugar Factory taking pictures at our life-size Candy Dot wall and with our over-the-top food and drinks. New York City is the perfect location to open our first museum, it’s the epicenter of entertainment—we can’t wait to share this concept worldwide.”It's not clear yet whether the Museum of Candy will be a pop-up exhibition like the Museum of Ice Cream, but Eater reports that there are similar plans to open a Los Angeles location and one in an as-yet-unspecified city. The New York location will be in Chelsea, at the building that formerly housed the Limelight nightclub and currently serves as Jue Lan Club, a high-end Chinese restaurant. Other than that, there’s not much in terms of specs, but knowing the Sugar Factory's penchant for opulent, photogenic desserts, you should start preparing your Instagram no matter what.Or stay home and attempt to make homemade gushers instead:Explore Bon AppétitNew YorkCandyTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Emily Wang"]}