{"id": "67ebdaac11bc2267efa319d76c187af6", "url": "https://www.bonappetit.com/story/raspberry-rugelach-recipe", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "A Good Rugelach Recipe Is Hard To Find, So We Made One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Good Rugelach Is Hard To Find, So We Made OneThey’re jammy, flaky, and holiday party ready.By Julia KramerDecember 11, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiFacebookTwitterEmailWhen I think about rugelach, I think about something my grandmother said about me at my grandfather’s memorial service. We were standing over his grave, and she was giving him reports on all of his grandchildren. When she got to me (age 12), she said, “When Julia is good, she is very, very good. And when she is bad, she is very, very bad.” The same goes for most Jewish baked goods, but it’s particularly true of rugelach. (And if you want more explanation on what my grandmother was talking about with that one-liner, I’ll just be over here working on my memoir.)Good rugelach are made from tender, flaky pastry. They have textural contrast: soft dough playing against the crunch of finely chopped nuts rolled inside. They’re evenly cooked—toasty and golden all the way through. The absolute best rugelach have a filling that spills out just enough to form a lacy edge surrounding the cookie, like the finest, thinnest smash burger.Bad rugelach is dry and pasty. And yet it’s also simultaneously burnt and greasy. It tastes like it was made sometime during the last world war. And worst of all, it looks basically identical to a good rugelach. You won’t know the truth until you’ve taken a bite, and it’s far too late.So, I was curious how my colleague, definitely-not-a-member-of-the-Tribe-senior-food-editor Chris Morocco, would unleash his unerring exactitude on this iconic Jewish deli cookie. Turns out, he made a few key modifications to ensure that his rugelach, which are not just any rugelach but the cover stars of the Bon Appétit December issue, would land in the “good” camp—and then some.One: He adds a hit of orange zest and (this is key) a full teaspoon of salt to the raspberry jam-and-walnut filling, giving it the seasoning it rarely receives.Two: Rather than rolling each rugelach into its own mini croissant shape, Chris makes one big log, then slices off triangular rectangles (a mathematical impossibility, I know). This makes for a speedier process and a more evenly rolled cookie, which ensures that the center will bake through.Now, all of this was going fine until I got to the third and final modification in Chris’s recipe, which was to top the rugelach with blitzed freeze-dried strawberries, which give the cookies the sparkly red luster that makes them look and feel so, you know, holiday-ish.I question what the rabbis would say about this. I also question where one buys freeze-dried strawberries. I also, to be completely honest, tried my hardest not to F up this recipe but also to complete it during actual Hannukah. So please, no one tell Chris, but I made these without the freeze-dried strawberries. And they were very, very good.Get the recipe:Raspberry RugelachThese bright, sweet-tart beauties are the perfect addition to the typical cookie plate.View RecipeExplore Bon Appétitholiday2018DessertCookieHoliday CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Julia Kramer"]}