{"id": "6803e1bca99dc23a9d3b26de8c3e6173", "url": "https://www.bonappetit.com/story/citrusy-asparagus-stir-fry", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Put This Asparagus Recipe on the Top of Your Spring Bucket List | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestylePut This Citrusy Asparagus Stir-Fry on the Top of Your Spring Bucket ListAsparagus season is beautiful and brief, so make this bright stir-fry while you can.By Aliza AbarbanelMay 9, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailI’ll admit it: I have a thing for asparagus. After months of steaming sweet potatoes, roasting carrots, and cursing my weather app, when asparagus bouquets finally hit the farmers’ market, I don’t like to do much to them. I’ll shave raw stalks into a bracing salad or toss slices into a tangle of miso-tahini noodles, but once I tasted senior food editor Andy Baraghani’s new asparagus stir fry, I couldn’t get it out of my head.The asparagus shards were crisp-tender and buttery, and generously dusted with a shower of sesame seeds and cilantro leaves. What really sold me was the sauce: A light soy dressing spiked with orange juice and smoothed with a knob of butter that coated each asparagus stalk, even the paintbrush-like tips. I begged Andy for an advance copy (just a peek!) of the recipe until finally, he caved. Then I roamed the farmers’ market like a hypebeast hunting a pair of Supreme x Vans slip-ons until I found a perfect, perky bunch.Andy is famous in the BA test kitchen for his uncompromising aesthetic, and here, each stalk is cut on the arty diagonal—but it isn’t just for looks. Those  ¼\" slices cook hot and fast, which develops the flavor with little risk of overcooking. Like all stir-frys, the trick is to get your pan roaring hot before adding the ingredients. Start by sautéing the sliced garlic and Fresno chiles, then add the asparagus and cook.And good news, that citrusy soy sauce happens in the same pan. When the asparagus is beginning to brown around the edges, add soy sauce, butter, and a 1 Tbsp. water, then toss constantly until the asparagus is still crisp but cooked through and coated in a glossy, emulsified sauce.  Brighten things up by adding orange juice and zest to the pan, and top the final dish with plenty of torn cilantro and sesame seeds.This recipe would be an excellent side dish for grilled chicken or crispy tofu, but I went the minimalist route and served the stir-fry over white rice with plenty of dressing spooned over. Oh, and an extra squeeze of orange, just for the hell of it. It was the quickest dinner I’ve made in months, and one I’m already planning to make again next week. We only have a few weeks of asparagus season, and if my pee smells forever, that’s a risk I’m willing to take.Secure your asparagus:Simple and Citrusy Asparagus Stir-FryThe trick to this citrusy stir-fry is to get your pan roaring hot before adding the ingredients.View RecipeExplore Bon AppétitHealthyishAsparagusStir-FryRead MoreLifestyleGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Aliza Abarbanel"]}