{"id": "680dda87aab91794314f2b1c58ef121a", "url": "https://www.bonappetit.com/story/what-is-chlorella-powder", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "What Is Chlorella Powder and Why Do We Love It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Chlorella Powder and Why Do We Love It?The superdust is popping up everywhere, including our new hemp milk chai.By Aliza AbarbanelJanuary 23, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailFact: Toppings make everything better. Here at Healthyish, we drizzle date syrup on our banana nice cream, sprinkle nutritional yeast on our popcorn, and blanket our oatmeal in pretty much every ingredient imaginable. So, when we decided to develop a hemp milk chai that captured the all-day-cafe ethos, of course it came with a little something extra on top: \"superdust.\"Superdust is a vibrant powder that owes its dark, blue-and-green hue to one super ingredient: chlorella powder, a single-celled green alga rich in chlorophyll, omega-3 fatty acids, and proteins. Paired with reishi or cordyceps powder and ground cardamom, it makes a topping that tastes good, looks great, and packs a nutritional punch.“Chlorella consists of sixty percent protein, and because it contains all of the essential amino acids the body needs, it can be described as a “complete protein,” says Taylor Johnson, RDN, LDN of Roots Reboot. “As more and more people are adopting a plant-based diet, they are in search for complete protein and vitamin B12 sources outside from pill form but rather from food first,” says Johnson.Chlorella powder's potent combination of style and substance is driving it's popularity at health stores and all day cafes across America. GT's Kombucha combines chlorella and spirulina in their potent Multi-Green flavor, and chlorella lends its color palette to the appropriately-named \"merman smoothie” at L.A. cafe Honey Hi.For our hemp milk chai, chlorella powder plays a somewhat more subtle—but still notable—role. “We often will top lattes with dusted cardamom or cinnamon, so this was an attempt to reimagine what that stuff could be,” says senior food editor Chris Morocco, who developed the recipe. The frothy, impossibly creamy non-dairy drink is packed with cinnamon, ginger, and cardamom—with a dusting of chlorella powder for aesthetics, we admit it. “You won’t get a significant amount of nutritional impact, but you do get that visual hit,” Morocco says. The result? A delicious, warming drink that makes us want to start our days with something green.Buy chlorella powder, $18.95.Make your own superdust chai:Hemp Milk ChaiHemp milk makes the fastest, creamiest alt-milk with very little waste, but any nondairy milk works.View RecipeExplore Bon AppétitHealthyishHealthySuperfoodRead MoreshoppingThe Best Greens Powders You'll Actually Want to DrinkGallery5 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Aliza Abarbanel"]}