{"id": "680eda8bf35695a120380cf4fd73c4a9", "url": "https://www.bonappetit.com/story/bavel-restaurant-ori-menashe", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Bavel Is L.A.’s Biggest Opening. This Is the Notebook That Made It Come to Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow a Cheap, Bent-Up Composition Notebook Helped Me Open a RestaurantAfter ups and downs, delays after delays, Ori Menashe finally opened Bavel in Los Angeles.By Ori MenasheMay 18, 2018FacebookTwitterEmailFacebookTwitterEmailA rumor has been rippling throughout the restaurant industry for the last five years. Ori Menashe is opening a Middle Eastern restaurant. Each time it was echoed, it was with a little more exasperation. But when?? This is Ori Menashe we’re talking about. The chef who turned the once-derelict Arts District into a dining destination in Los Angeles. His first restaurant, Bestia, won awards (Food & Wine Best New Chef, James Beard Award nominations) and consistently earned spots on Jonathan Gold’s and Besha Rodell’s the best-of lists for its the inventive pastas and salty, fatty, unforgettable charcuterie. And finally, after delays due to partner changes and construction, Menashe debuted Bavel last month.While it seemed like an eternity to us on the other side, it felt even longer for Menashe, as he rode the rollercoaster of opening something very new and very personal: Bavel is an homage to his Jewish-Turkish-Moroccan heritage and his wife and pastry chef Genevieve Gergis’s Egyptian background. Here he takes us into the notebook that held together not only his random thoughts but himself in the midst of constant change, fear of living up to the rumored restaurant, and determination to bring Bavel to life. —Elyse InamineI bought this notebook almost four and a half years ago, when my wife was pregnant. It’s a green Mead composition book with wide lines. We were going on our first vacation after we first opened Bestia in November 2012. We closed the restaurant for 12 days because everyone was working six days a week and needed time off. But when I’m on vacation, it doesn’t matter: I wake up at 6 a.m. like clockwork. While we were in Maui, I’d sit out on the patio and start writing for two hours until she woke up. I was getting ideas for a new restaurant.Courtesy of Ori MenasheIt began with bread and hummus, then more elaborate things, weird ideas that didn’t turn out the way I wanted them to, and eventually dishes that ended up on the menu at Bavel. But you can’t just write an idea, or at least that’s not what I do. I jot down what I think the quantities are going to be. If there’s cumin, coriander, and caraway in a dish, the cumin is the most aggressive, so there will be less of it. That’s how I think: 10 grams of this, five grams of that, and that might change to 20 grams or none of that.Ori Menashe and Genevieve Gergis\nPhoto by Nicole FranzenRemember in Back to the Future, the second one, when Biff has that notebook he brings everywhere, the magazine with scores from the future? And Biff gambles with it and makes tons of money because he knows the scores? That’s how I treated this notebook. It was on me all the time: in my back pocket, tucked in the front part of my apron, or in my backpack. After jogging alone or getting a massage, while my daughter Saffron was sleeping or I was parked in my car, every chance I had, I would write. I had an idea for fish with an eggplant-based sauce, thinking it would get some feta and a hazelnut dukka on top.Courtesy of Ori MenasheThere are probably 200 ideas in this notebook. It kept me going when we ran into complications with opening Bavel. We leased the space and started construction when we split with our business partner. We tore up the plans and started from scratch. It was like, ‘Okay, if there is still time, I’m going to continue to develop dishes.’ And up until two weeks before the opening of Bavel, I was writing down things.The spread at Bavel\nPhoto by Nicole FranzenGrilled octopus with an herby yogurt at Bavel\nPhoto by Nicole FranzenBut honestly, I’ve been working on this menu my whole career. And people expect this to be Bestia from day one. A lot of pressure. Sometimes I look through the old notebook I had when I was opening Bestia, recipes I wrote 15 years ago. It’s almost funny; I wonder what I was thinking. I’ll find a recipe for shrimp marinated with rosemary and orange juice and served with a mixed greens salad. That’s kind of lame, but I was so young and I didn’t have experience combining flavors or understanding the right technique. It’s like looking at a photo of you and your friends when you were 16. ‘Why did I have dyed yellow hair and a mohawk? I was an idiot!’When I’m 50, I’m going to look back at the Bavel notebook and crack a big smile on my face.—As told to Elyse InamineExplore Bon AppétitRestaurantsOpeningsLos AngelesRead MorerestaurantsAfter Three Moves, A Cult Neapolitan Pizzeria Calls NYC HomeBy Anthony MangiericultureHow ‘Sweetbitter’ Compares to Real Fine-Dining Restaurant TrainingBy Alyse WhitneyrestaurantsThe New Pho Spot That’s Bending a Few Family TraditionsBy Angela GarbesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-18", "author": ["Condé Nast", "Ori Menashe"]}