{"id": "681abe44543c6b8d6c202b0c09ee9a51", "url": "https://www.bonappetit.com/story/calorie-counts-on-menus", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Are Calorie Counts on Menus Actually Making Us Healthier? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAre Calorie Counts on Menus Actually Making Us Healthier?Calorie displays can be as harmful to some as they are helpful to others.By Audrey BrunoApril 25, 2019FacebookTwitterEmailIllustration by Haley TippmannFacebookTwitterEmailEvery year on Christmas Eve, my family and I get the holiday started with a brunch at IHOP. I don’t remember how the tradition started, but it’s stuck, and now Christmas just wouldn’t feel complete without it.But this year, as I opened up the menu to my usual pick—a chicken-fried steak with hash browns, eggs over easy, and black coffee—I noticed the calorie count of my meal staring up at me from the menu. My annual treat clocked in at 1,760 calories—roughly ¾ of the daily recommended amount. Did I really want to eat 1,760 calories in one go? Would I even be able to enjoy my meal with the knowledge that I would be doing so? I started to consider other options, finally settling on an omelet that I didn’t really want and barely ate half of.I’d forgotten what it was like to be faced with calorie counts, probably because I’d spent the last year living in Berlin. Growing up in the U.S., calories were often a point of focus for me. I’d never personally been a calorie counter, but I’d watched both my mom and my sister do so excessively, and I frequently felt their influence as a result. For some time, just the sight of those numbers was enough to make me uncomfortable in my skin—they were a reminder that there were limits to what I could and should eat, and they turned food from a source of pleasure to a source of anxiety.In Berlin, though, I’d never seen calorie counts written on menus, not even on my occasional trips to chain restaurants like McDonald’s. It seemed to me that people weren’t thinking about those numbers, so I stopped thinking about them too. In a matter of months, the C word quickly left my vocabulary and my eating habits changed as a result. No longer was I focusing on how much I ate, if it was the right kind of food, or if it was the right amount. Instead, I was eating exactly what I wanted and however much made me feel good. It was a relief, and it made me feel healthier too. But in that moment at IHOP, all my icky feelings surrounding calories came swarming back at once.Displaying calorie counts on menus is a fairly new concept. The first law requiring calorie counts was introduced in New York City in 2007, but it took a legal case and a lot of rounds of revision before a version of it was passed in 2008, as Brian Elbel, M.P.H., Ph.D., an associate professor in the Department of Population Health at NYU, tells me. The final law stipulated that any chain restaurant with 15 or more locations would legally be required to provide the caloric content of every item on their menu boards and printed menus. In 2018, similar legislation was enacted on a federal level.I watched my sister spend years obsessively restricting and tracking her calorie intake, so much so that a single misstep would often send her spiraling.Elbel says that the primary aim of this legislation is to lower the obesity rate by encouraging consumers to make “healthier” purchases. “There was a fair amount of data that said people didn’t have great insights into what they were eating and [public health advocates] thought this could help with that,” Elbel explains. Another hope was that it would force fast food corporations to offer healthier options by “naming and shaming” their offerings. “[If a restaurant] suddenly realizes that one of their products is very caloric, maybe that information alone would be enough for the industry to change what it offered,” he says.But now that the federal law has been enacted, is it actually helping people? Not necessarily. “Somebody like me, who’s in the health industry, who cares about these things, I’m going to be the one who’s going to look,” says Rachel Goldman, Ph.D., at fellow at the Obesity Society and a clinical assistant professor of psychiatry at NYU School of Medicine. But the population that could really benefit from transparent nutrition information might not know to look for it or even notice if it’s there.A 2016 survey from academic journal Preventive Medicine Reports shows that Goldman may have a point. The survey was conducted at restaurants in Canada that were testing a health check symbol on menu items that constituted a nutritious meal. Only five percent of over a thousand people surveyed reported noticing the health check symbol after having eaten there only moments before.However Elbel tells me that over half of customers interviewed in surveys on the subject agree that restaurants should have to display calorie counts on menus. He says it remains highly likely that calorie displays on menus will lead to positive outcomes—they just might be a lot smaller and harder to document. “If, nationally, people are eating 20 fewer calories, that could have an important cumulative impact from a broader public health perspective, but it’s not one we’re going to see from [surveys],” he explains. The best way to uncover this kind of nuanced data would be to pull it directly from fast food and chain restaurants. A study in the National Bureau of Economic Research did just that with Starbucks. They found that the average calories per transaction decreased by six percent with the addition of the nutrition displays. “Not whopping, but not zero,” he says.Even when I take the potential positives into consideration, I keep thinking back to how bothered I was that day at IHOP. And I know I’m not the only one who shifts in their seat at the mention of calories. Calorie displays can be as harmful to some as they are helpful to others, Goldman confirms. I watched my sister spend years obsessively restricting and tracking her calorie intake, so much so that a single misstep would often send her spiraling. In one particularly bad instance at Shake Shack, she accused me of trying to sabotage her because I had accidentally ordered a cheeseburger for her instead of a regular burger. “There are a hundred calories in that slice of cheese,” I remember her telling me, “and now I can’t eat it!” For someone like my sister, seeing calorie counts on menus is undoubtedly triggering.Restaurants affected by this legislation are largely concentrated in food deserts, where there are fewer alternatives to fast food.I understand the potential benefits of showing calorie counts, but I think it would be better to shift the focus away from a single number. “Calories aren’t all equal, and they’re only one measure,” explains Abby Langer, R.D., a Toronto-based dietitian and writer. There are so many other factors that determine what makes something healthy or not, and everyone has different definitions of what it means to be healthy.It’s also worth noting that the restaurants affected by this legislation are largely concentrated in food deserts, where there are fewer alternatives to fast food. We can’t reasonably expect consumers to use calorie information to change their eating habits if we’re not also giving them access to more nutritious choices.If the goal of calorie labelling in restaurants is to lower the obesity rate and educate consumers about nutrition, there is so much more we need to do beyond listing a number on a menu. “No matter which epidemic you’re facing, you need a multi-pronged approach,” says Cheryl Healton, dean of the NYU College of Global Public Health. “In some countries, you cannot advertise fast food on TV, you can’t give toys away with fast food, and you can’t serve unhealthy food in the public school system.” Increasing the taxes on sugar-sweetened beverages, as countries like Mexico and cities like Berkeley have done with success, is another option to consider.But Healton says the main way to affect real change is to educate kids about nutrition as soon as possible. “To stop obesity, efforts should be focused on educating young people, educating parents, and changing policies,” she explains. But for any of that to actually happen, she says, Congress and the Department of Health & Human Services need to step up and push for the right policies, whether that’s increasing taxes on sugar-sweetened beverages, regulating the way food corporations advertise, or offering healthier options at schools. Sadly, these kinds of policies aren’t a priority for the current administration, so it may be a long time before this problem gets the attention it deserves.In the meantime, calorie counts on menus will continue to roll out across the country whether or not we like it. After my visit to IHOP, I noticed them everywhere I went—during fast food stops on a road trip up the coast, in the drive-through at Starbucks, even at gas stations. Every on-the-go food choice I made was presented with a side of calories, and I had to decide if I was going to continue to intuitively eat the way I’d learned abroad or let these arbitrary numbers influence my decisions like they once had. But maybe there’s a third option, which is to keep reminding myself that my self-worth isn’t tied to my weight or what I choose to eat. I may never be totally at ease with what I see on the menu, but at least I can be more at ease with myself.Explore Bon AppétitHealthyishessayRead MoreLifestyleIs Your Wellness Practice Just a Diet in Disguise?By Melissa A. FabelloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Audrey Bruno"]}