{"id": "68385448050e9739a5baed3b09e06470", "url": "https://www.bonappetit.com/recipe/kuku-kadoo", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Kuku Kadoo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueKuku KadooBy Andy BaraghaniMarch 15, 20225.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Graydon Herriott, food styling by Sue Li, prop styling by Aneta Florczyk.EmailPinterestPrintEmailPinterestPrintKukus (a Persian egg dish) can be made with a wide variety of fillings, like potatoes, eggplant, even dates. In this spring-y version, Andy Baraghani caramelizes the zucchini and leeks so they get sweeter and, in his words, “a lot more interesting” before he incorporates the eggs. To make it a full meal, serve each slice with a dollop of yogurt and warm flatbread.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSilicone Spatula$13 At BA MarketWhisk$10 At AmazonIngredients4 servings5garlic cloves, thinly sliced¼cup extra-virgin olive oil, plus more for drizzling3medium zucchini or summer squash (about 12 oz.), thinly sliced2medium leeks, white, pale green, and dark green parts, halved lengthwise, coarsely choppedKosher salt, freshly ground pepper¾tsp. ground turmeric8large eggs, beaten to blend½cup coarsely chopped dill and/or parsleyLemon wedges (for serving)PreparationStep 1Heat a large ovenproof nonstick or cast-iron skillet with a lid over medium. Combine garlic and ¼ cup oil in pan and cook, stirring occasionally, until garlic is golden around the edges, about 2 minutes. Add zucchini and leeks, season with salt and pepper, and cook, tossing and stirring occasionally, until zucchini and leeks are very tender and almost jammy, 15–17 minutes. Sprinkle turmeric over and stir until vegetables are coated.Step 2Drizzle more oil around edges of skillet, then pour in eggs and season with salt and pepper. Swirl pan a few times to incorporate ingredients (also using a rubber spatula works well here). Cook, undisturbed, until eggs are set around edges of pan, 1–2 minutes. Cover and cook until bottom is set but top is still a little wet, about 4 minutes.Step 3Heat broiler. Uncover skillet and broil kuku, watching closely, until top is set and lightly browned, 2–3 minutes. Remove skillet from broiler and scatter herbs over kuku, squeeze juice from lemon wedges over, and season with more pepper.How would you rate Kuku Kadoo?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis was such a pleasant surprise. Remarkably tasty considering there are so few components to the dish. I made it exactly as written and it turned out really well. Great for our hot Aussie summer nights! Def don’t scrimp in the fresh herbs and lemon at the end. Delicious!! Miranda Perth, Western Australia3/17/2022I could not get the recipe.  I tryed everything to sign in.   But recipe would pop up and then disappear. Anonymous3/15/2022Explore Bon AppétitDinnerLunchBreakfastMainWeeknight MealsVegetarianNut-FreeDairy-FreeGluten-FreeHealthyishFryPersianMiddle EasternFrittataEggZucchiniSquashVegetableSummer SquashLeekSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}