{"id": "683a43a33dd4f80e9f5d7deca67d189b", "url": "https://www.bonappetit.com/recipe/romano-beans-with-mustard-vinaigrette-and-walnuts", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Romano Beans with Mustard Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueRomano Beans with Mustard Vinaigrette and WalnutsBy Ignacio MattosApril 17, 20185.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintRomano beans, also known as Italian pole beans, are wide and flat and have a less delicate texture than green beans but share their mild and sweet flavor. For an over-the-top dinner menu, serve these beans with arugula with Italian plums, paccheri with shellfish, grilled red mullet, grilled bistecca, and brioche au rhum. We said over-the-top.Ingredients8 servings1cup walnuts3lb. Romano beans or green beans, trimmed3Tbsp. red wine vinegar2Tbsp. Dijon mustard1garlic clove, finely grated2Tbsp. extra-virgin olive oil, plus more for drizzling½lemon¾cup very coarsely chopped parsleyFreshly ground black pepperPreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool, then coarsely chop.Step 2Cook Romano beans in a large pot of boiling salted water until bright green and tender, 8–10 minutes. Using a slotted spoon, transfer to a bowl of ice water and let cool. Drain and pat dry.Step 3Meanwhile, mix vinegar, mustard, garlic, and 2 Tbsp. oil in a large bowl to combine. Let sit 10 minutes for flavors to come together.Step 4Add walnuts and Romano beans to dressing. Finely zest lemon over beans and add parsley. Season with salt and lots of pepper and toss to coat. Transfer to a platter and drizzle with more oil.How would you rate Romano Beans with Mustard Vinaigrette and Walnuts?Leave a ReviewTell us what you thinkExplore Bon AppétitGreen BeanVegetableQuickEasySideDairy-FreeVeganVegetarianGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}