{"id": "683ebdcd34867d3dbb8c9f195b44ed86", "url": "https://www.bonappetit.com/story/microdosing-butter", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Microdosing Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMicrodosing ButterA bit of it on everything I cook is the daily luxury I need right now.By Christina ChaeyAugust 22, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,For the last few weeks, I’ve been dreaming of a simple bowl of fresh, short-grain white rice topped with a small pat of butter and a drizzle of soy sauce. It’s my Ratatouille moment, the food that transports me back to the occasional school night when my mother would allow my sister and me to gussy up our side of rice. It was a special treat tied to no real occasion—I think she could just sense when we needed a little pick-me-up but didn’t have time to pull out all the stops when she had to get dinner ready in 30 minutes.For years after I moved out of my parents’ house, I nearly forgot about that simple pleasure. But my quarantine cooking habits have revealed that what I want to eat when seeking a little extra comfort is just a little bit of butter on/with/in/over...everything, rice included. These days, I’ve been stocking up on European-style butter, like Kerrygold—just a dab makes anything taste decadent.This Butter-Roasted Halibut has been in my rotation.\nPhoto by Christina ChaeyWhen I say I’m putting a bit of butter in/on everything, I don’t just mean toast or scrambled eggs (though I eat a lot of both). I’m making a lot of produce-heavy dishes these days, like glazed beets or turnips and glossy green stir-fries, finishing with a pat of the good stuff that leaves me feeling sated. I’ve also made Andy Baraghani’s Salt and Pepper Fish, which includes a side of vinegar-and-butter rice, about six times. Then there have been the times when “just a bit” of butter won’t do, which is when only a bowl of velvety mushroom pasta or a tall, hot biscuit will do the trick. Because sometimes butter isn’t best in small doses—sometimes, you need to go big.Yours in dairy,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishButteressayWhat's Chaey Cooking?Read MoreLifestyleThese Are a Few of My Favorite FatsBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-22", "author": ["Condé Nast", "Christina Chaey"]}