{"id": "684278923af9a5d7386af9472ea896c9", "url": "https://www.bonappetit.com/recipe/pumpkin-soup-with-spiced-nuts", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Pumpkin Soup With Spiced Nuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssuePumpkin Soup With Spiced NutsBy Marcus SamuelssonDecember 1, 20201.2(764)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintHaitians often commemorate Independence Day on January 1 by eating soup joumou. While rebellion was ongoing throughout slavery, the Revolution began in 1791 and by 1804, Haitians had wrested control from the French. Black people in Haiti had been forbidden from eating soup joumou during enslavement, as the dish was a delicacy. Upon independence, the dish became a symbol for Black Haitians' freedom. This is my take on it.This recipe was excerpted from ‘The Rise: Black Cooks and the Soul of American Food.’ Editor’s note: We’ve updated the name and byline of this dish, and changed the headnote to match the excerpted recipe, which is chef Marcus Samuelsson's take on Haitian soup joumou, from  Samuelsson’s cookbook ‘The Rise.’ We apologize for misrepresenting this recipe.Ingredients8 ServingsCandied Spiced Nuts1½cups raw almonds, walnuts, or pecans3Tbsp. pure maple syrup1Tbsp. vegetable oil1tsp. berbere½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltChile-Nutmeg Oil1Tbsp. crushed red pepper flakes1tsp. freshly grated nutmeg½cup vegetable oilSoup and assembly8sprigs thyme23\" cinnamon sticks1Tbsp. whole allspice1tsp. whole cloves¼cup extra-virgin olive oil1medium onion, thinly sliced8garlic cloves, thinly slicedKosher salt1large butternut or kabocha squash or pumpkin (about 4 lb.),peeled, halved, seeds removed, cut into 1\" cubes (about 8 cups)3cups vegetable stock or water3cups unsweetened coconut milk (from two 13.5-oz. cans)special equipmentA piece of cheeseclothPreparationCandied spiced nutsStep 1Preheat oven to 350°. Toss almonds with maple syrup, oil, berbere, and salt in a medium bowl until nuts are evenly coated. Scrape onto a rimmed baking sheet and roast, tossing occasionally, until nuts are toasted and maple syrup is caramelized, 20–25 minutes.Step 2Transfer to a sheet of parchment and spread out in an even layer to prevent clusters from forming. Let cool, then coarsely chop and set aside.Chile-nutmeg oilStep 3Place red pepper flakes and nutmeg in a small heatproof bowl. Heat oil in a small saucepan over high until you see the first wisp of smoke. Gently pour oil over spices and let cool, about 1 hour.Soup and assemblyStep 4Place thyme, cinnamon sticks, allspice, and cloves in center of cheesecloth; bring up edges together and tie closed with kitchen twine. Set aside.Step 5Heat oil in a large pot over medium-high. Cook onion, stirring often, until softened but not browned, 7–9 minutes. Add garlic, season with salt, and cook, stirring often, until garlic is softened, 3–5 minutes. Add squash and cook, stirring, just until coated in onion mixture, about 1 minute. Add bundle and pour in stock; season with a bit more salt. Bring to a simmer, then reduce heat to medium-low and cook, stirring occasionally, until squash is tender, 20–25 minutes.Step 6Remove bundle and add coconut milk. Bring to a simmer; cook 5 minutes to let flavors meld. Purée soup with an immersion blender until smooth. (Or, purée in batches in a regular blender.) Season with more salt if needed.Step 7To serve, divide soup among bowls. Top with candied spiced nuts and drizzle with chile-nutmeg oil.How would you rate Pumpkin Soup With Spiced Nuts?Leave a ReviewTell us what you thinkReviews (218)Back to TopTriangleThis squash soup is delicious.  It was worth the effort and I would make it again.AnonymousDetroit MI12/19/2021Quest-ce que c'est?? How is the editor changing the recipe for this soupe de potiron & noix? Anonymousguess?11/6/2021Bro this is by far the wildest review section I’ve ever seen for a recipe. I accidentally bought 20 small pumpkins today though so I’ll be trying out this soup soon.TremuloHouston, Tx10/19/2021Sak sa?? You should never change the recipe to accommodate white people this is a disgrace\nTHIS IS NOT SOUP JOUMOUAnonymousMontreal9/17/2021Excellent (and thank you).\nI really loved this recipe, and will make it again.  Also, I had never heard of Soup Joumou nor knew anything about its origin. After reading the article and making the soup, I looked it up because I wanted to know more.  So, for everyone out there who is upset, there are a lot of positives here.  Because of the recipe, I (a white man) learned more about the Haitian culture and history.  I would encourage everyone to look at the positives and realize there are many variations to “traditional dishes.”  RyanAtlanta, GA1/17/2021Well well Marcus... how does it feel when the mob comes for you? Forget about all these racist commenters who thought you were a. white and b. born in the US. Forget that you were invited into a Haitians home who literally told you that everyone has their own take on this recipe. Forget you are an accomplished chef and have to listen to 200+ hacks pretend they know anything about cooking. If this was an SNL skit it would be hysterical. Haitians arguing about a soup the way New Yorkers argue about pizza. I hope no Haitian ever tries to pass of a classic French dish as their own. Can you imagine the outrage if they made a croque monsieur with cheddar instead of gruyere? Admit it now, that stuff with Rappaport was always just about caving to cancel and faux rage culture and you and everyone that survived the purge at BA thought you were immune. Nope. Remember it’s easier to tear something down than to actually build something up. Kudos to the handful of thoughtful commenters who even though disliked the recipe avoided the racist and rage trap. Not a good look for the Haitian community on here to be honest. Fake rage is about power1/15/2021This is a disgrace! Not an accurate representation of our culture and is disrespectful. This recipe is white-washed and should be removed!Miranda LNJ12/31/2020Should we all  tag Bon Appetit, come Jan 1st! #RealSoupJoumouJen Philly 12/23/2020This is pure sacrilege. Ou pa ta fè nou sa Makis! (Now how do you feel when you see me spell your name like that?)Haitian motherMiami, FL12/10/2020This is beyond a misrepresentation. It’s an entirely new recipe. The mention of Haiti and the celebration of its Independence Day needs to be removed from this article. Anonymous12/9/2020HE WAS TAUGHT BY HAITIANS ON HOW TO MAKE SOUP JOUMOU!!! LOOK AT THIS VIDEO>>> httpss://youtu.be/zF-01UlnCp8AnonymousMiami, Fl12/8/2020Independence Day is coming up and y’all should know this is not the soup that we drink to celebrate. It’s a tradition that’s important to us. It would’ve been nice to present this dish separate from anything related to joumou.\nAnonymous12/7/2020Disgusting on every level. Stop trying to white wash Haitian history. I cope somebody turns the person who made this into a cat.AnonymousNew York, NY12/7/2020How did we get here?  Where an artist can no longer use his gifts to interpret something he finds beautiful?  Imagine if we silenced Picasso because his interpretation of The Weeping Woman didn't fit into our view of a woman? Or if we silenced Monet because his Lillies weren't precise? Marcus clearly meant no disrespect. He was using his artistic expression to bring attention to a very important part of Haiti history.  shelly los Angeles, ca 12/7/2020This is a terrible way of depicting our nation. I shouldn't be able to search soup joumou and this pops up. AnonymousJacksonville, Fl12/6/2020Explore Bon AppétitSoupSoups and StewsSquashVegetablePumpkinCoconut MilkOther IngredientsStarterVeganVegetarianGluten-FreeDairy-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}