{"id": "68468c0d349423798841cfbb79a32432", "url": "https://www.bonappetit.com/recipe/classic-chickpea-hummus", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Classic Chickpea Hummus Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesClassic Chickpea HummusBy Claire SaffitzMarch 5, 20214.6(67)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThose canned chickpeas in the back of your cupboard could be doing so much more than just taking up space. Instead, use them in this simple no-fail hummus recipe. Chickpeas are whizzed in a food processor (shout-out to this one!) with the good stuff—tahini, garlic, lemon juice, olive oil, and spices. Thinned with just enough water to get it light yet creamy, it works as a versatile dip or condiment: This rich, tangy hummus is as great swooped around the edge of your grain bowl as it is smeared on crusty sourdough or stealing the limelight on your next snack platter.Serve as is or topped with any number of different things, including lamb or chicken, good olive oil and flaky sea salt, pine nuts and olives, paprika and chopped parsley, or a sprinkle of za’atar—a Middle Eastern spice blend that usually contains a mix of dried herbs, sumac, and sesame seeds (available at specialty stores or online). Got this hummus recipe down? Excellent. Here are four more ways to riff on it.Editor’s note: This recipe was originally published on February 16, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonChef's Knife$34.53 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketColander$11 At AmazonCutting Board$10 At IKEAShallow Serving Bowl$26.99 At AmazonLarge Basting Spoon$16.37 At AmazonIngredientsMakes about 2 cups115½-oz. can chickpeas1large lemon1garlic clove½cup tahini, well mixed¾tsp. (or more) kosher salt10cranks freshly ground black pepper¼tsp. ground cumin3Tbsp. extra-virgin olive oil, plus more for drizzlingZa’atar and/or sesame seeds (for serving)PreparationStep 1Start by prepping all of your ingredients: Drain 15½ oz. chickpeas in a strainer or colander and rinse thoroughly. Let drain again while you do the other prep.Step 2Cut 1 lemon in half, remove any visible seeds, and squeeze juice into a small bowl. You should have 3–4 Tbsp.Step 3Smash 1 garlic clove with the flat side of your knife on a cutting board and remove peel. Continue to mash with side of knife until a paste forms. (You can also grate garlic on a microplane if you have one—you're just looking for a fine paste.)Step 4Combine drained chickpeas, 3 Tbsp. lemon juice, garlic, ½ cup tahini, ¾ tsp. salt, 10 cracks pepper, ¼ tsp. cumin, and 2 Tbsp. water in a food processor.Step 5Process until smooth, about 1 minute.Step 6With the motor running, stream in 3 Tbsp. oil, then continue to process until hummus is very light and creamy, about 1 minute longer. Taste and season with more salt, if needed.Step 7Transfer hummus to a shallow bowl, top with za’atar and/or sesame seeds, and drizzle with more oil.→  Mastered this base recipe? Here are 4 ways to mix it up.Step 8Do Ahead: Hummus can be made 4 days ahead. Transfer to an airtight container and chill.How would you rate Classic Chickpea Hummus?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleI like this recipe but instead of water I use the juice from the drained chickpeas, it turns out soother and quite tasty.SallyMooresville, NC12/5/2021This is the closest one to my Lebanese Family Recipe. However, I do not know if you are aware that Chickpea is the name of the Hummus bean in English. So when you say Chickpeas Hummus, it is like saying Chickpeas Chickpeas, or Hummus Hummus...mixing 2 languages for the same name. Even in Arabic when we prepare this dish we call it Hummus Dip, because we have other dishes of Chickpeas. Avocados Hummus, means Avocados Chickpeas. Also Za’atar is Thyme in Arabic. And when Za’atar is mixed with Sumac, olive oil and salt, the mixture called Zeit & Za’atar  is used to make pies on the Pita bread mainly for breakfast as it is supposed to open ALL brain cells...a must on exam days...referred to as the breakfast of the Champions. Also the mixture is very tasty for dumping bread, specially cubes of Olive Bread. Hummus dip can be frozen. Defrost in refrigerator and when you are ready to use, add a little water or lemon, mix with a fork to smooth it again. You can use it to flavor all sorts of vegetables, sandwiches, cooked meat, chicken, fish, etc...Sahtein (Bon Appetit) Enjoy your Chickpeas Dip ...I  have a Hummus Dip Club for all my Neighbors and Friends.....NajwaBorn and Raised in Lebanon12/5/2021Use the leftover water from your chickpea can instead of plain water. The chickpea water has more flavor.HallyUtah12/5/2021It's labor intensive but the only way to get truly smooth hummus is to remove the skins of the chickpeas or use chickpea flour. With the skins on the peas, it's grainy, period. #SorryNotSorryMHouston, TX5/18/2021Love it.  I prefer a more tahini-heavy hummus so this is perfect for me.  Leagues better than store-bought stuff and honestly cheaper too. Luke SDenver, Colorado3/9/2021It is good.  Quick and nice texture.  I cut out the pepper but I don't need that flavor.  Also love your videos about making gourmet junk food.  They are very instructive about experimental cookery.  Washington State9/6/2020I really love this recipe, it’s amazing, and added a bit of paprika powder for some kick. However I found it to be rlly thick and I prefer smoother hummus so I added a couple more tablespoons of water and olive oil and it’s perfect. 10/10 would recommend!!Nora.WSweden5/26/2020I like lemony hummus so added the pulp and a little extra juice. Threw in some cayenne and a bit of super flaky sea salt too while I was at it. This recipe will definitely go into my digital recipe box. Absolutely delicious!AnonymousNY5/13/2020Tasty, simple! I think if I remake it I'll add a little more water to loosen it a bit. AnonymousSeattle5/3/2020this is my favorite hummus recipe when i need a quick and easy hummus. my only complaint is it often comes out way too salty. omit the salt during the initial food processing and just add to taste at the end. you'll be glad you did, trust meAnonymousanchorage5/1/2020Totally delicious and super simple to make. It usually comes out too thick for my taste (and admittedly I don't add that extra generous pour of oil when I serve it so that might be the reason). I usually end up adding 2-3 more tbsp of water at the end to make it creamy. AnonymousNew York4/30/2020Just like what I get at the store! Which is good because they ran out. Added cayenne pepper for a little kick. QuaraMNtineMinnesota3/19/2020Really delicious! AnonymousNEW YORK 1/17/2020Really delicious, easy to make. I was proclaimed \"so good at snacks\" by all at the gathering :)AnonymousColumbia, SC1/11/2020We added 1tsp each oregano, celery seed, paprika and red pepper flakes; doubled the garlic and lemon juice; added 1/4 kalamata olives and enjoyed with lots of olive oil on top to go from 3☆ to 4-5☆!Anonymous12/17/2019Explore Bon AppétitDipHummusChickpeaBeanVegetableTahiniCondiments, Sauces & PastesEasyQuickWeeknight MealsStarterVegetarianVeganGluten-FreeDairy-FreeSuper BowlLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-29", "author": ["Condé Nast", "Claire Saffitz"]}