{"id": "684a04c9f995ce68bf1d1c33c7b8b252", "url": "https://www.bonappetit.com/story/healthy-desserts", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Why Are We So Obsessed with Making Healthy Desserts? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy Are We So Obsessed with Making Healthy Desserts?And what are we really looking for in that pint of Halo Top?By Zan RomanoffApril 23, 2018FacebookTwitterEmailFacebookTwitterEmailDessert is in a weird place right now. On the one hand, our Instagram feeds love pictures of ice cream so much that someone built an entire museum for us to take them in. But, at the same time, sales of actual ice cream are slumping: Halo Top’s low-calorie cartons are outselling big-name brands at Wal-Mart, and Ben and Jerry’s recently introduced new vegan flavors to its roster.And it’s not just ice cream that’s earning its health halo while looking decadent. Thousands of Instagram bakers swear that we can stay on our paleo, Whole 30, or gluten-free diets without having to give up on dessert as long as we’re willing to put black beans in our brownies and substitute dates for caramel. Even Christina Tosi, mini-chain Milk Bar’s Queen of the Rainbow Sprinkle, High Priestess of Crack Pie, has gotten in on the action with SoulFuel, a “protein packed” gluten- and dairy-free cookie she helped create in collaboration with the indoor cycling studio SoulCycle.Wellness Instagrammers promising that carob taste like candy, and dessert chefs creating cookies that are good for your gut: It’s enough to make anyone ask: Why are we so obsessed with making dessert healthy? And why do we keep turning healthy foods into dessert?Milkbar's Soulfuel cookie\nPhoto by Chelsie Craig“All any dieting person really wants—and I am extrapolating from personal experience here—is to eat a whole container of something,” Heather Schwedel recently wrote for Slate in a piece about the rise of Halo Top. “Preferably that thing will taste good or at least not bad, but what’s crucial, in the end, is getting to eat all of it.” Halo Top and other “healthy desserts” swap out the pleasure of eating something delicious with the promise that you can eat gallons of it. One of Halo Top’s slogans, Schwedel points out, is no bowl, no regrets.The suggestion that we don’t have to worry about portion control is super enticing in a moment when people are embarrassed about dieting. Instead of counting points or calories, we talk vaguely about cleansing, resetting, and “plant-based” living.It’s undeniable that Healthyish is part of this universe. It’s a site that claims that “healthy should be delicious.” You can find recipes here for fudgy bliss balls, tahini brownies, and breakfast cookies. (Though a site by Bon Appétit would never pitch these recipes as replacements for the real thing. Have you tried BA’s brown butter and toffee chocolate chip cookie?!)The problem is with our expectations of ourselves and our desires. If we were only concerned about our health, we would eat vegetables; if we only wanted to enjoy ourselves, we’d eat pasta for breakfast, lunch, and dinner (just me?). Instead we seek a middle ground, which is often called wellness: the understanding that health is best achieved through a holistic suite of practices and habits, not singular, obsessive obedience.Which is a good, useful framework for us to have! Less useful, however, is the assumption that the coveted wellness we’re all searching for can be found within a pint of low-calorie ice cream, a gluten/dairy/soy/egg-free brownie, or a protein-laden cookie.The SoulFuel press release tells us that this protein-rich cookie will help us achieve the “balancing act of having it all.” But, as any feminist knows, “having it all” is a joke and a lie: There’s no “all” and nothing to be “had.” Health has to be calibrated and navigated day by day, decision by decision. No product, diet, or routine will ever let us off the hook. Not only is the notion of “having it all” impossible, it’s also damaging. It sets us up to blame ourselves for not achieving whatever peak state we’re told is out there. We end up feeling like failures for eating something “bad,” for not having self control. We deprive ourselves as punishment, and the cycle starts again.And, ironically, most of these healthy desserts just aren’t all that healthy. For all the protein it packs, SoulFuel also provides nearly a quarter of your recommended daily sugar intake (a fact that the packaging attempts to elide by setting its serving size at half a cookie). HaloTop allows you to eat a high volume of ice cream without consuming a huge number of calories, but that doesn’t make it particularly nutritious—which is notable because increasingly, it seems that quality of calories matters much more than their quantity. And either way, you’re still eating a several hundred calories’ worth of not-very-good ice cream every day.It’s heartening that we’ve started moving away from this idea that grueling workouts, steamed vegetables, and strict abstemiousness are the only avenues to health, but, in the process, we’ve moved to the opposite pole. We pretend that the process of pursuing health is one of constant pleasure and abundance: Ben and Jerry’s new low-cal ice cream line is called Moo-phoria, which is both a corny pun and a suggestion of intense, ecstatic happiness. High-protein ice cream line Enlightened explicitly equates physical health with spiritual attainment.Perhaps it makes sense, then, that Tosi made her name on treats that conjured nostalgia for childhood sugar binges, birthday cake truffles in all of their rainbow sprinkled glory, as well as that she’s turning to turmeric now. What we desire from her desserts is the same whether they’re healthy or not: We long for something that will short-circuit us to ease, and make sweetness taste simple again.It’s a powerful fantasy, and that’s part of why desserts like these sell so well. They represent a relationship to food that is uncomplicated and un-conflicted, optimized simultaneously for health and for pleasure.  We feel guilty about what we eat, and these products promise to erase that feeling for once and for all, to tame our desires: those inconvenient reminders of our untameable animal selves. But every pint of ice cream has a bottom, and every time we reach it, we have to ask: Was that satisfying? Did I get what I truly wanted?Explore Bon AppétitHealthyishCookieChristina TosiMomofuku Milk BarTrendsRead MorecookingBreakfast Cookies Are the Reason We're Getting Up In the MorningBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Zan Romanoff"]}