{"id": "68560f9de1f7ee40e658b69d05bfc145", "url": "https://www.bonappetit.com/recipe/apple-butter-spice-cake-with-cinnamon-crumble", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Apple Butter Spice Cake with Cinnamon Crumble Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApple Butter Spice Cake with Cinnamon CrumbleBy Claire SaffitzMarch 6, 20185.0(11)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintCake made with applesauce is good. Cake made with apple butter—which is basically just super-concentrated applesauce—is so, so much better. Moist and tender, with huge apple-y flavor, this simple spice cake is the ultimate bring-to-your-friend's-house baked good. If you really want your mind blown, serve the slices topped with more apple butter, a dollop of yogurt, and a dusting of cinnamon sugar.This recipe is presented to you by Samsung.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLoaf Pan$15 At AmazonParchment Paper$3 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonLarge Bowl$18 At AmazonElectric Mixer$40 At AmazonSpatula$12.99 At AmazonSmall Bowl$13 At AmazonForkCake Tester$3 At AmazonWire Rack$23 At BA MarketIngredients12 servings½cup (1 stick) plus 2 Tbsp. unsalted butter, room temperature2oz. dried apple rings1½cups all-purpose flour1¼tsp. baking powder½tsp. kosher salt¼tsp. baking soda2¼tsp. ground cinnamon, divided1cup plus ¼ cup sugar2large eggs, room temperature1cup apple butter½tsp. vanilla extractPreparationStep 1Preheat oven to 350°. Rub ½ Tbsp. room temperature butter all over bottom and sides of an 8.5x4.5\" loaf pan with your fingertips. Line pan with a piece of parchment, leaving an overhang on two longer sides. Butter parchment with another ½ Tbsp. butter; set aside.Step 2Chop 2 oz. apple rings into ½\" pieces; set aside.Step 3Whisk 1½ cups flour, 1¼ tsp. baking powder, ½ tsp. salt, ¼ tsp. baking soda, and 2 tsp. cinnamon in a large bowl.Step 4Using an electric mixer on high speed, beat 1 cup sugar and ½ cup butter in another large bowl until very pale and light, about 4 minutes.Step 5Add 2 eggs and beat on medium speed until mixture is very fluffy, about 1 minute.Step 6Add 1 cup apple butter and ½ tsp. vanilla and beat until combined.Step 7Add dry ingredients and beat on low speed until flour disappears and batter is thick and smooth. Using a spatula, fold batter a few times by hand, scraping bottom and sides of bowl.Step 8Fold chopped dried apple pieces into batter, then scrape into prepared pan and smooth top.Step 9Melt remaining 1 Tbsp. butter in a small bowl (if you don’t have a microwave, do this part in a small saucepan). Stir in remaining ¼ cup sugar and ¼ tsp. cinnamon with a fork until wet crumbs form.Step 10Sprinkle cinnamon-sugar crumbs evenly over top of batter. Bake cake until top is cracked and firm to the touch and a tester inserted into center comes out clean, 60–70 minutes.Step 11Let cool in pan 15 minutes, then cut around short sides and use parchment to lift out cake. Transfer to wire rack and let cool completely.Step 12Slice and serve.Step 13Do Ahead: Cake can be made 1 day ahead. Let cool completely, wrap with plastic, and store at room temperature.How would you rate Apple Butter Spice Cake with Cinnamon Crumble?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis was a fantastic addition to my family's Thanksgiving dessert lineup last year. I'd highly recommend them with the dried apples, although I've done it both ways and it was great. 10/10 Half Sour Saffitz!!Troy ScottAtlanta, GA2/3/2022Stellar recipe, finally something that's apple-y enough! Sometimes I make it without the crumble, and it's still great. AnonymousMichigan 5/21/2021Excellent. Very similar tasting to BA's best pumpkin bread. It was great served with yogurt as suggested.\n\n Some substitutions: I used gluten free flour with xanthan gum. I baked it in a 10 inch round springform pan and it took about 40 minutes that way. I also added a handful of chopped walnuts. \n\nI'll definitely make it again since I have apple butter and rings leftover.AnonymousWashington DC1/9/2021Absolutely delicious. I used apple chips in the recipe instead of the dried apple rings and used less than the recipe called for. Also I wasn't able to get the crumb topping to a crumb consistency, it was more of a glaze. But it was still really good. Anonymous4/24/2020This smelled so fragrant and winter-y in the oven, and the end result was incredible. Perfect crumb, great structure that was conducive to slicing, and absolutely heavenly flavor.AnonymousColumbia, SC1/11/2020Easy and tasty cake. Was a little worried the dried apple pieces would result in odd chewy bits within the cake, but they must have been hydrated a bit from the batter and didn't post a problem at all (I'll note that I even used very old dried apple pieces I had had hanging around in my cupboard).  Brought this cake over to a dinner party and the entire thing was consumed in one go, will def make again! AnonymousNew York, NY3/18/2019Explore Bon AppétitCakeDessertLoaf CakeAmericanAppleFruitFallNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Claire Saffitz"]}