{"id": "686801cb42602050bcd1ef412d7d1e90", "url": "https://www.bonappetit.com/story/grilled-cheese-is-best", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Grilled Cheese—Like, Literally Grilled—Is the Best Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGrilled Cheese—Like, Literally Grilled—Is the Best CheeseBut not just any cheese will do. Here are three to try.By Hilary CadiganJuly 27, 2021FacebookTwitterEmailPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailIf the idea of cheese cooked over an open fire sounds bizarre, I get it. It used to sound that way to me too. In my house growing up, grilled cheese meant two pieces of soggy whole wheat bread spread with margarine, stuffed with a piece of individually wrapped American cheese or two, and heated until melty (but not particularly crispy or delicious) in a nonstick skillet over the kitchen stove. (Sometimes we’d add a slice of tomato if we really wanted it to get extra soggy. These were not great sandwiches.)But personal tragedies aside, what we’re talking about here is cheese on the grill. As in, the grill you may or may not have in your yard right now, waiting patiently for its next round of hot dogs. And what we’re not talking about is American singles, or cheddar, Swiss, or Gouda. A good grilling cheese, you see, is one that will char when cooked but not ooze through the grate to oblivion. And if you’re vegetarian but not vegan, it can act as an appropriately indulgent alternative to meat at your next summer cookout.So I called up my very smart colleague, associate food editor Rachel Gurjar, for the lowdown. “Grillable cheeses have a high melting point,” she tells me. “They’ll get perfectly charred and smoky on the outside, while staying nice and creamy on the inside, making them the perfect vehicle for all kinds of flavors.” She suggests cooking these cheeses in slabs about 1½–2-inches thick on the medium-heat zone of the grill so they get warmed all the way through. About 3–4 minutes per side should do it. Here are three types to try.Paneer: This creamy nonaged Indian cheese is made from curdled cow’s milk or buffalo’s milk and doesn’t melt, so it holds up quite well on the grill. Use it as a medium for all kinds of marinades, wet or dry, and pair it with crunchy grilled veggies (exhibit A: Rachel’s Cheesy Charred Green Beans) for a very good side dish. Her favorite paneer brand is Sach, which she likes because it’s ethically sourced and extra rich.Manouri: Feta’s less salty little sister is literally a by-product of the more spotlight-hogging Greek cheese: It’s made from feta whey. Manouri has a smooth and silky texture but keeps its form when grilled, making it the perfect topper for summer salads. Or, for an extremely addictive appetizer, drizzle it with honey and serve it with seedy crackers, stone fruit, or a crusty slice of bread.Halloumi: Salty, semihard, and unripened, Cyprus’s most famous dairy export is made with a mix of goat’s milk and sheep’s milk, and its high melting point means no mess—just salty, creamy, chewy goodness. Try it on a toasted bun dressed up with your favorite burger toppings, à la this recipe for Seared Squash and Halloumi Burgers.Explore Bon AppétittechniquecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-27", "author": ["Condé Nast", "Hilary Cadigan"]}