{"id": "6875899713b2fdb0d6157ba52b40c920", "url": "https://www.bonappetit.com/story/whole-wheat-oat-waffles", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "How to Make Easy Waffles Your Whole Family Will Love, According Smitten Kitchen's Deb Perelman | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Swore I’d Never Make Waffles Again, Yet Here I Am Making WafflesAnd liking it.By Deb PerelmanApril 15, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.Waffles are my nemesis, right down to the irons, which were definitely invented by someone who doesn’t wash dishes.For years I refused to make them just to avoid the cleanup, and then I found a waffle iron that had nonstick removable(!) dishwasher-safe(!) plates, and I was so uplifted that I decided to include two waffle recipes in my last cookbook. But while testing those recipes, I remembered my other issue with waffles, which is that the irons tend to trap steam—the enemy of a crisp result. I ultimately got the recipes to work, but I swore off waffles again after I finished the book, this time forever.There are two small problems with my waffle ban, and their names are Jacob and Anna. I try to tell them that pancakes are basically the same thing, but they want the grid—pooled with syrup, ideally. And so I dragged out the waffle iron (it’s a $50 Hamilton Beach model if you’re interested), determined to create a recipe that could be our new standard: easy (one bowl, hand-mixed), makeable without advance planning (no, I do not want to make waffle batter the night before), whole grain (which offsets the inevitable puddles of syrup, right?), and crispy (it turns out whole grains are great at this too).Finally, I wanted them to have a neutral palate for the adults who prefer our breakfasts savory. Sugar-free waffles allow us all to choose our own breakfast adventure: My husband and I top them with eggs and bacon or sautéed vegetables and cheese, while the kids smother theirs with fruit and syrup. They’re so good and so simple, the impossible has happened: I now regularly volunteer to make waffles.Get the recipe:Whole Wheat–Oat WafflesCrispy, nutty whole-grain waffles that can go sweet or savory depending on your mood.View RecipeBuy it: Hamilton Beach Flip Belgian Waffle Maker, $50 at WalmartAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitWaffleMaple SyrupButterFlourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Deb Perelman"]}