{"id": "687bb407a19dce6178caceffb7e225d8", "url": "https://www.bonappetit.com/story/lazy-summer-meals", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "All the Easy Meals I Cook When I Don't Want to Cook Anything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat I Cook When I Don’t Want to Cook AnythingMy favorite lazy meals for when the motivation goes missing.By Sonia ChopraJuly 8, 2021FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Okay, I have to ask: Have you hit yet another cooking low point, or is it just me? The other day I went into the kitchen to make lunch, only to discover a fridge completely empty of anything but condiments. There wasn’t take-out rice or eggs or even a last little knuckle of parm. I ended up eating graham crackers right out of the sleeve, smeared with peanut butter like an after-school snack.It’s not that I’m sick of cooking, really! It’s just as I started eating out more, I just kind of…stopped planning as much as I used to. And maybe forgot to go grocery shopping once or twice. And yes, chose outdoor brunch over the farmers market. But I’m trying to get back on track. I’ve been scouring the BA archives for advice, tips, and recipes to help. There are so many old recipes that feel very new to me, and it’s been fun to scroll through them, bookmarking things for later use as I get back into the swing of cooking. In particular I’m gravitating toward sauces—these five are a great place to start—and marinated dishes, like this zucchini tossed in a vinaigrette and served over ricotta. Or quick recipes that use up all the veg in my fridge, like this ratatouille pasta (double the ratatouille and turn the leftovers into another meal), or that get better with age, as this make-ahead lentil salad does.Really, I’m just looking for ways to impart big flavor without a ton of time. I’ve gotten super into this ginger-scallion tofu scramble and this ginger-mustard barbecue sauce, both heavy on one of my favorite ingredients (ginger!), and I can’t wait to try this soy-ginger egg scramble, which BA’s Editorial Director Amanda Shapiro calls her “never-fail lazy dinner.”Below are a few of the other dishes I’ve been making as I try to ease back into cooking after an early summer filled with lazy, snacky meals and lots and lots of eating out. Please tell me what you’re eating these days too (seriously, I need the inspiration)—as always, I’m at sonia@bonappetit.com.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-08", "author": ["Condé Nast", "Sonia Chopra"]}