{"id": "688cfa3a9561bc1bf97dcacadea0e34a", "url": "https://www.bonappetit.com/recipe/summer-vegetable-cassoulet-with-crispy-gruyere", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Summer Vegetable Cassoulet With Crispy Gruyère Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSummer Vegetable Cassoulet With Crispy GruyèreBy Christian ReynosoAugust 16, 20214.8(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintClassic, meaty French cassoulet can take several shopping trips and days of preparation. But this summer-vegetable “cassoulet” requires only a spin through the produce section and a bit of free time. Instead of the traditional sausage and duck leg confit, this version skips meat altogether in favor of spiced eggplant, tomato, green beans, and big white beans cooked with plenty of extra-virgin olive oil, fresh herbs, and garlic. And rather than traditional breadcrumbs,  Gruyère, baked until golden and crisp, then crumbled over, adds texture, depth, and plenty of umami (plus they’re just plain fun). Vegetarians can skip the optional anchovy paste, but if you haven’t explored this ingredient, it’s incomparable for adding flavor. —Christian ReynosoAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron3-Qt. Baking Dish$17 At AmazonDutch Oven$80 At AmazonBox Grater$13 At AmazonSlotted Spoon$13 $10 At AmazonTongs$13 At AmazonIngredients4 servings1lb. globe or Japanese eggplants, peeled in alternating strips, cut into 2\" pieces1tsp. fennel seeds¼tsp. crushed red pepper flakes7Tbsp. extra-virgin olive oil, divided1tsp Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepper1lb. haricots verts or green beans, trimmed2oil-packed anchovy fillets (optional)4garlic cloves, thinly sliced¾cup dry white wine1Tbsp. tomato paste1pint cherry tomatoes115-oz. can butter or corona beans, rinsed2cups coarsely chopped parsley⅓cup coarsely chopped marjoram or oregano1Tbsp. thyme leaves6oz. Gruyère or Comté cheese, coarsely gratedPreparationStep 1Place racks in upper and lower thirds of oven and preheat to 425°. Toss eggplant, fennel seeds, red pepper flakes, 6 Tbsp. oil, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a 3-qt. or 13x9\" baking dish; season with black pepper. Roast on bottom rack, tossing halfway through, until golden and tender, 25–30 minutes. Let cool.Step 2Meanwhile, heat remaining 1 Tbsp. oil in a large Dutch oven or other heavy pot over medium-high. Add haricots verts, season with salt, and cook, tossing every minute or so, until they start to release moisture and steam, about 5 minutes. Add anchovies, garlic, wine, and tomato paste and cook, stirring with a wooden spoon or heatproof rubber spatula to break up paste, 1 minute. Add ¾ cup water, cover pot, and cook until haricots verts are crisp-tender, 5–7 minutes.Step 3Add cherry tomatoes and butter beans, re-cover pot, and cook until tomatoes start to burst, 5–7 minutes. Remove pot from heat, uncover, and stir in parsley, marjoram, and thyme.Step 4While the beans and tomatoes are cooking, spread Gruyère out on a parchment-lined baking sheet and bake on top rack until melted and almost done bubbling and golden, 8–10 minutes (check often). Let cool.Step 5Using a slotted spoon, scoop tomato and bean mixture over and around eggplant in baking dish, arranging so everything is nestled together but eggplant isn’t completely covered. Pour liquid left in pot over. Remove crispy Gruyère from parchment and crumble on top of cassoulet.How would you rate Summer Vegetable Cassoulet With Crispy Gruyère?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleAbsolutely delicious. I nervously made this for my French grandparents today and felt very relieved when they all said it tasted wonderful and asked me what the dish was called. I did not tell them it was a cassoulet because they are very traditional  and would no dout have protested that I was butchering a classic... but as long as you don't call it a cassoulet, its a great dish.LCSunshine9/22/2021My three criteria for awesome recipes: Amazing & interesting flavors, ingredients that are not complicated to source, and can be put together quickly. I made it as written and we loved it. Leftovers (what little we had) were possibly more delicious the next day. I'm about to make it again tonight, this time making several additions/ substitutions to clean out the refrigerator. Wish me luck!Magnolia MerSeattle, WA9/17/2021First, it’s as much a cassoulet as it is a güveç, or any classic dish named for the vessel it’s cooked in. Next, as for the vegetables, what about mushrooms, onions, okra, and whatever else works well with eggplant? The crispy gruyère is cutesy, but I prefer the breadcrumb/panko/grated cheese topping. The crispy gruyère would be nice on the side for people to add as they like.\n\nI’ve made cassoulet, and the only ingredients that are evocative of that classic dish are garlic, beans, and anchovies. Please consider the dish before you throw classic names around. As a vegetable casserole, however, it’s okay but I’d add onions, mushrooms, and okra at the very least.Hollis RamseyVero Beach, FL9/6/2021loved the spiced eggplant as a sausage nod. Also, I've never crisped up cheese in the oven like this before. Was fun to watch it go from shards to melted shards to crisp and golden. It's like a cheesy cracker. AnonymousSF, CA9/5/2021this is not a cassoulet. shame on youcavefishKCMO9/5/2021Healthy, yet unctuous. This recipe packs all my summer favorite vegetables in one delicious dish. So easy to make (a one pot wonder) with tons of flavors from the anchovies and the gruyere. Perfect to entertain since you'll have extra time to mingle and drink while it cooks.Simone CastorNew York, NY9/2/2021This recipe is incredible. I cannot believe that so much flavor could come from mere vegetables. Even better on day two!Tim TLos Angeles, CA9/2/2021I’m having seconds! Easy peasy and hearty with a refined edge. \nP.S. Did I just get a full serving of vegetables? Louise P.Boston, MA8/30/2021Delicious and easy, but appears fancy and complicated. Perfect for impressing guests or bringing to a party - I did the latter and it still tasted great at room temp. Creamy beans, silky eggplant, and crunchy cheese make a satisfying texture combo, and it's almost impossible to go wrong with an anchovy-garlic-tomato sauce element. Looking forward to making this again, maybe with bread or pasta as a main.AnonymousPortland, OR8/30/2021As a pescatarian, I absolutely love this recipe! It’s filling and super satisfying while also feeling balanced and healthful. A new favorite! Kimberly Joplin, MO8/30/2021I made this for my girlfriend and I yesterday. It was pretty bomb. I really liked the crispy gruyere cheese and glad I had leftovers to put in a salad today. Never made tradition cassoulet, but this one made me feel cheffy. Great weekend dinner. \n\nOne thing: wanted a touch more sauce, so I’ll probably try adding a little bit more liquid next time. Heath Kelley Los Angeles 8/30/2021Really good. However, I make traditional Cassoulet & I love the unctuous blending of all the tender, long-cooked ingredients. This is NOT it! I did not do the Gruyere topping, but opted for more bean-cooking liquid & a breadcrumb/cheese topping. I put it all together in the baking dish, mixed it, applied the topping & baked it until the crumbs were crusty. A great dish for my garden plethora of eggplant, tomatoes & green beans!LynnNeenah, WI8/29/2021We made this for my birthday and it was fabulous! Keep these great recipes coming. ShelleSt. Petersburg, FL 8/29/2021I'd like to understand why the whole dish isn't finished in the oven and made with fewer steps?  Perhaps the cheese could go on top of the vegetable raw, then broiled in top third of oven to get the crispy effect (instead of applying like frosting at the end.)  I ask because I like to do a lot of prep ahead of time, before guest/s arrive.   Now I realize I've painted myself into a corner with room temp eggplant and the haricots verts, cherry tomatoes, etc lukewarm in the pot. Also, since I had trouble getting the little tomatoes to pop, I overcooked the canned beans. I haven't tasted this yet -- sorry -- so no helpful advice about the finished product  from me. Just questions.  Did anyone modify the cooking methods here?  .  KeekWoodland Park, NJ8/27/2021I made this exactly as written. It's delicious! Next time I would use soaked dry beans instead of canned to avoid mushy beans. Add warm sour dough baguette too. CareyBay Area, California8/20/2021Explore Bon AppétitGreen BeanVegetableEggplantWhite BeanBeanHaricot VertVegetarianSummerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-16", "author": ["Condé Nast", "Christian Reynoso"]}