{"id": "689df2d4d77c0d0d6a7466c3ff98f4ce", "url": "https://www.bonappetit.com/story/what-is-bakuchiol", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "What Is Bakuchiol, Natural Skincare’s Answer to Retinol? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy We're All About Bakuchiol, Natural Skincare’s Answer to RetinolThe Ayurvedic ingredient could give you the anti-aging effects of retinol  without the red, flaky downsides.By Deanna PaiFebruary 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI was once in a meeting with a beauty brand when a publicist—one I know pretty well, to be fair—reached over and brushed a few flakes off my cheek.“Sorry,” she said. “I couldn’t help it.”I shrugged, replying, “I’ve been using retinol.”Everyone nodded. They got it: Errant flakes are just one unpleasant side effect of retinoids, a form of vitamin A that can otherwise do lots of good, like increase cell turnover, spur production of collagen and elastin, and fight acne when applied topically to skin.“Retinoids commonly come with uncomfortable side effects, including increased redness, dryness, and peeling of the skin,” says Y. Claire Chang, MD, a cosmetic dermatologist at Union Square Laser Dermatology. For those with sensitive skin or prone to eczema and rosacea, the risk is even higher. That’s why bakuchiol, a plant-derived ingredient and mainstay in Ayurvedic medicine, has recently caused the skincare obsessed and retinol naysayers to lose their collective minds. On its own, bakuchiol has an impressive resume. “It’s an antioxidant that protects the cell from oxidative stress by regulating the mitochondria,” says Dendy Engelman, MD, a dermatologist at Medical Dermatology & Cosmetic Surgery in New York City. (That oxidative stress, by the way, causes cell damage that leads to premature aging.) It also mimics vitamin E in its ability to heal and hydrate the skin.What makes bakuchiol so unique, though, is that research has found that it can provide the same anti-aging results as retinol—but without the annoying side effects. The theory is that bakuchiol activates a receptor in cells similar to those of retinol, explains Raja Sivamani, MD, a professor of dermatology at UC Davis who published a paper on it in the British Journal of Dermatology. Comparing the two ingredients, the study found the same results both in the reduction of wrinkles and improvement in hyperpigmentation. The only difference? The retinol group experienced more facial scaling and stinging.“Other studies have also reported improvement in lines and wrinkles, pigmentation, elasticity, and firmness with bakuchiol,” says Jennifer Chwalek, MD, a dermatologist at Union Square Laser Dermatology. That explains why bakuchiol has snagged a starring role in recent skincare formulas, like Biossance Squalane + Phyto Retinol Serum, which boasts impressive clinical results (like a 48-percent improvement in skin firmness), and OleHenriksen Transform PLUS Goodnight Glow Retin-ALT Sleeping Crème, which boosts its effects with a gentle blend of acids. It also makes quick work of crows’ feet in Alpyn PlantGenius Line-Filling Eye Balm, which might be the most genius place for it, seeing as retinoids are typically too harsh for the delicate eye area.Still, the research on it is relatively new—and a few derms I contacted didn’t think there’s enough data in human skin to celebrate just yet. But it’s definitely promising, especially if retinoids have been a no-go for you in the past. “Since bakuchiol seems to be less irritating than retinoid, it’s a good alternative for patients with sensitive skin or anyone who has experienced redness, burning, and scaling with topical retinoid,” Chwalek says.Plus, it eliminates the headache of trying to pair retinoids with other ingredients. “There are instances where you should avoid specific products when using a retinoid, such as exfoliators, toners, and benzoyl peroxide, as they can cause irritation,” she says. “However, due to bakuchiol’s natural composition, it’s safe to use with other products in your skincare regimen.”But its biggest advantage might be its overall compatibility—whether or not it’s stacking up to or replacing retinoids entirely. “Bakuchiol works as an anti-inflammatory and an antioxidant, so it’s ideal for those who suffer from dry or sensitive skin,” Engelman explains. “[And] its antibacterial properties also mean that it’s great for those with oily or acne-prone skin.”For all the similarities between bakuchiol and retinoids, the difference between the two—that lack of irritation—might make the former worth a shot. And maybe the best reason of all to try it: You won’t have to worry about your face peeling in public.Buy it: Biossance Squalane + Phyto-Retinol Serum, $78. Olehenriksen Goodnight Glow Retin-ALT Sleeping Crème, $55.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleThis Natural Deodorant Has a 16K Wait List, But Does It Work?By Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-11", "author": ["Condé Nast", "Deanna Pai"]}