{"id": "68b864695b13389bad2cfb316113af4e", "url": "https://www.bonappetit.com/story/taqueria-los-cocuyos-mexico-city", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "My Favorite Tacos in Mexico City Come Out of a Meat Jacuzzi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Favorite Tacos in Mexico City Come Out of a Meat JacuzziTaqueria Los Cocuyos is an unassuming taco stand in the heart of the city.By Rachel KartenJuly 17, 2019FacebookTwitterEmailPhoto by Caleb BennettFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.“You’ll know you’re there when you see a huge vat of bubbling meats.” This is how I instruct my friends—it’s my favorite direction to give—when they ask me where to eat in Mexico City. That direction is important. It’s too easy to walk by Taqueria Los Cocuyos, the unassuming taco stand on a never-not-busy street in the historic center of Mexico City. But then you see the giant meat jacuzzi, filled to the brim with everything from ojo (cow eyeball) to tripa (tripe), and locals huddled around the salsas. And you know you’re there.Each taco costs around $1, and you should 100 percent order more than you think you’ll want. During my last visit, I opted for the suadero (brisket), longaniza (sausage), and cachete (beef cheeks), all served on corn tortillas—and then went back for a second suadero because I am a smart human. Each piece of meat is pulled from the big metal pot and chopped on a fat-stained cutting board. While you can’t go wrong with any of the tacos, the suadero is The One for me—moist and fall-aparty and showered with cilantro and chopped onions. Yeah, I think it’s time for me to look up flights to Mexico City…Go there: Taqueria Los CocuyosExplore Bon AppétitHighly RecommendMexico CityTacoRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-17", "author": ["Condé Nast", "Rachel Karten"]}