{"id": "68c4239f61b78860f673728a8e464ea2", "url": "https://www.bonappetit.com/story/how-to-make-lemon-sugar", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "This Free Ingredient Makes Almost Every Baked Good Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Free Ingredient Makes Almost Every Baked Good BetterYou've probably got some in your fridge and don't even know it.By Alex DelanyMay 16, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailFor most folks, “essential oils” probably refer to the stuff included in face masks and lotions that make them cost a whole lot of money. You know, oils extracted from a rare tree root or some weed that only grows on one specific hill in Denmark. Something that is, by definition, not essential to our existence as human beings. But if you’re the type of person who gravitates more towards baked goods than moisturizer, we’ve got an actually essential oil for you, one that will make almost every baked good you can imagine better: lemon oil. And while that might sound exotic, you've probably got some in your fridge right now and don't even know it. Allow us to explain.Lemon oil is the aromatic stuff that lives in the peel (or \"zest\") of a lemon. Ever seen a bartender twist a citrus peel above a cocktail? That's because they're trying to release the oils—and if you look closely, you can even see the tiny droplets of oil fly through the air. The flavor you get from that lemon oil is intensely, complexly lemony, but doesn't have the same brash tartness that the juice of the fruit has. The best part? If you're already buying lemons to use for juice, all the gloriously fragrant lemon oil trapped in those peels is a freebie—you just have to figure out how to access it, and then use it to its full potential. And if there's one no-brainer way to do that, it's to make lemon sugar, and use that lemon sugar in just about any baked good you can think of. Here's how.The basic maneuver is to zest lemons—ideally with a Microplane or other sharp, fine-toothed grater—add the zest to sugar, and massage the sugar. That’s it. Two ingredients. Minimal work. As a general rule, we’ll keep the ratio of lemon zest to sugar at 1 Tbsp. lemon zest to every 1 cup sugar. You don’t want the lemon to overpower the sugar or change the texture too drastically. (That said, even a small amount of zest is worth using.) Once you zest about two lemons to get 2 Tbsp., dump it into 2 cups of sugar (these amounts can change based on whatever your recipe calls for or you want to have leftovers) and use your hands (washed and dried, of course) to massage the sugar and zest for a minute or so. This is where the oils really get released. Macerating the zest into the sugar draws all of those delicious oils out so that they are absorbed into the sugar, and the texture of the sugar will change, moving from sand-like to wet-sand-like. And there you have it folks: sweet, fragrant lemon sugar.Lemon sugar would slay in an easy upside down cake\nAlex LauSo what can you use it in? Short answer: basically everything. Longer, more useful answer: basically everything that makes sense with lemon. You can use this infused lemon sugar as a sub for regular sugar in whatever you’re baking, just as long as a bit if bright citrus goes well with the other flavors. If the cake, cookie, muffin, scone, or pastry you’re making involves fruit, you’re in the clear.Remember: This stuff is essentially free, and not exclusive to lemons, either. You can try this with everything from lime to grapefruit and get cool results, though the ratio of zest to sugar may vary from citrus to citrus. Every piece of citrus comes with oil, and since you're already paying for it, you may as well use it—just a little bonus that someone at the citrus factory threw in there for you. How nice. Make sure to write that nameless hero a letter. Or send a gift basket. Probably one without citrus in it—they've got that on lock.Scone time!Easy Blueberry Cream SconesThink of these scones as the easier, cooler cousin of the blueberry muffin.View RecipeExplore Bon AppétitBasicallyBakeDessertSugarLemonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Alex Delany"]}