{"id": "68c4ca6da92acde0c9e9b029c14ef284", "url": "https://www.bonappetit.com/story/why-we-love-garlic-powder-forever", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Why We Love Garlic Powder, Forever and Always | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy We Love Garlic Powder, Forever and AlwaysIt’s its OWN thing okay. This has nothing to do with the raw stuff!By Alex BeggsOctober 3, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmail“A feat of science!”“I wouldn’t be caught without it!”“Delightfully, consistently flat!”These are all rave—yes, the flat comment is a good thing—reviews of garlic powder from the Bon Appétit staff and test kitchen. We freaking love the stuff. Except Andy! (There’s always a contrarian amongst us. We’ll ignore him today.) What is it though? Dehydrated, pulverized garlic. Oh. Okay. Why would you use this instead of perfectly fresh actual garlic? Let me loop you in.RANCH DRESSING. CRISPY CHICKEN CUTLETS. POPCORN. EVERY DRY RUB. TACO SEASONING. BEEFY CHILI. GARLIC KNOTSSSSSS.These Instant Pot ribs use a dry rub with garlic powder and hot mustard powder. Nice.\nPhoto by Chelsie Craig, Food Styling by Kat Boytsova, Prop Styling by Emily EisenYou use garlic powder when raw garlic’s stickiness is an issue, like in the barbecue dry rub situation, and when you don’t want that overpowering raw garlic note. So in ranch dressing’s case, raw garlic can distract from the tangy buttermilk and chives, and then get even stronger the next day. HAHHHH. (That’s the sound of me breathing garlic breath FIRE in your FACE.) You need subtlety in your life. Well, at least sometimes!Garlic powder. So photogenic.\nRaw garlic brings a lot of spiciness and bite, which is lovable in its own right. So when associate editor Christina Chaey described g-powder as “flat,” she just meant that it delivers one flavor without that raw garlic heat and aftershock.There’s garlic powder in the dry rub for this oven-barbecued chicken. It’s awesome.\nPhoto by Caleb Adams“People talk sh*t about garlic powder because it’s not as ‘good’ as the ‘real’ thing,” Carla Lalli Music, food director and garlic powder fan, told me. “They shouldn’t think about it as a replacement, but rather its own ingredient.” It’s one of her 13 preferred spices in her upcoming cookbook, a plug for which I better get an acknowledgments page mention for.She also like granulated garlic—made with slightly bigger dried pieces—because it clumps less than the fine powder, and Carla apparently hates clumps. Who knew? She added that if you’re looking to add some oomph to your next steak, sprinkle a little garlic powder/granulated garlic on with your salt and pepper and await a taste bud explosion. Maybe not an explosion, okay, but it will add an umami note that captivates and delights.BA’s best fried chicken sandwich is dredged in a flour mixture with guest star garlic powder (along with onion powder, paprkia, cayenne).\nAlex LauSenior food editor Chris Morocco uses a pinch of garlic powder in hummus. 🆒Associate editor Christina Chaey grew up with it on Wonder Bread toasted with margarine, a.k.a “what I thought garlic bread was.”Contributor Sarah Jampel once made her own with a dehydrator and a mortar and pestle. She “likes to use it when you’re distributing across a landscape,” lol. Jampel, the Bob Ross of garlic powder.Something to keep in mind, though. Like all dried spices, garlic powder’s potency fades over time, so if you recently discovered your jar at the back of a cobwebby pantry, pitch it. Buy a fresh bottle. Then cue up the cutlets:Chicken Milanesa with Ranch SauceThis irresistible matchup of crispy and creamy releases more dopamine than a bag of Cheetos.View RecipeExplore Bon AppétitGarlicSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Alex Beggs"]}