{"id": "68c71c9190a5ce9408a0486c62a66dc9", "url": "https://www.bonappetit.com/story/black-owned-businesses", "year": 2020.0, "month": 7.0, "day": 1.0, "content": "Black Owned Businesses Are Finally Getting Widespread Support—Here’s How to Keep the Torch Ablaze. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBlack-Owned Businesses Are Finally Getting Widespread Support—Here’s How to Keep the Torch Ablaze.The time is now to gather all of your resources to propel Black businesses forward.By Shani HillianJuly 6, 2020FacebookTwitterEmailFacebookTwitterEmailWhen I initially saw my white peers flooding my timeline in support of Black-owned businesses three weeks ago, three major thoughts came rushing to my mind without warning. First, \"I hope this isn't temporary, reactionary hype.” Then a gentle whisper to myself: “It's about time our businesses are being placed in center stage and getting the recognition they deserve.\" And lastly, the thought that brought up so many emotions I had to shout it aloud: \"WHY NOW?!\"The unjust and untimely deaths of George Floyd, Breonna Taylor, and Ahmaud Arbery swiftly shifted this entire nation into action. Activists have been tirelessly working both on the ground and digitally to bring awareness to police brutality and racism, demanding immediate changes like defunding the police, hiring more Black professionals in leadership positions, and supporting Black-owned businesses.But why now? Is it guilt? Are you supporting Black-owned businesses because you genuinely care to see us thrive, or are you only supporting because you don't want to look racist? Do you feel pressured to support because your friends are telling you to, or was your company recently under fire for lacking visible diversity within their workplace? Did you attend a protest or digitally participate in the collective moment of sharing anti-racism resources online and realize that you could be doing more with your voice, your resources, and your privilege? If it’s the latter, I understand. I want you to know that as a Black small business owner myself, these questions are not asked with judgment, but rather a genuine interest in the answers. Why must it take a worldwide protest in response to Black death for you to finally see us and support Black-owned businesses when the opportunity has always been available?I've been an esthetician for 13 years, and spent seven of those years servicing a predominantly white clientele on the Upper East Side. I was forced to temporarily close the doors to my facial studio due to COVID-19 on March 13, and unfortunately, we haven't been able to open since. But I wanted to ensure my clients could get some kind of service to keep their skin healthy until we could safely meet again, so I sent a marketing email to all 300 of them, promoting private virtual skin consultations and gift cards if they wanted to support my business. From March 25–June 1, I received four gift card purchases and five virtual skincare consultations. Then, in a single weekend after the global protests and the widespread initiative to support Black-owned business began, I received a 20 percent increase in gift card purchases and 25 percent increase in requests for virtual skin consultations. By no means am I ungrateful for the support of my clients—I am. But after seven years of personal connection with a 70 percent white client base, it saddens me to think that not even a global pandemic could move them to support me, someone they’ve claimed for years to respect and hold so dear.Abena Boamah, the Chicago-based owner of natural skincare and wellness brand hanahana beauty, says her business has seen a 300 percent increase in orders over the past 3 weeks after being tagged in social media posts by Cosmopolitan, Well and Good, and Glamour Germany—plus Beyoncé's Black Parade Route business directory. “Although we’re grateful and excited for our new customers, it’s been extremely overwhelming,” says Boamah. “Since COVID-19 we’ve seen a steady increase each month, but June just took it to a whole different height, and it's honestly sad that Black death had to be the inspiration for white people to spend their dollars with Black-owned companies.”Nasrin Jean-Baptiste, a London-born fashion stylist and owner of the luxury handbag line Petit Kouraj, has also seen a flood of direct sales and wholesale requests. “This is an extremely busy time for Black-owned businesses and although it’s welcomed, I hope consumers only part with their hard-earned money because of the unique products I make that can not be found anywhere else—rather than because they think this is a temporary trend,” says Jean-Baptise. This level of widespread support for Black-owned businesses has just begun, but any business owner knows that longevity is the goal, and creating a large loyal fan base—like the kinds we’ve seen for white corporations all our lives—is vital.So, how can white consumers maintain their support of Black-owned businesses far beyond this current moment? Start by listening to the myriad reasons behind this movement, then truly commit to action, beyond just buying one face mask or lipgloss. Jean-Baptise suggests signing the 15 Percent Pledge, a movement spearheaded by Aurora James of the accessories brand Brother Vellies that urges retailers to dedicate 15 percent of their shelf space to Black-owned businesses as Black people make up nearly 15 percent of the American population.Boamah suggests white customers find ways to meaningfully engage with Black-owned brands. “Read more than just the shop page to ensure you authentically learn the process of each product being created in totality, not just witnessing the end result,” she says. Learning the history of a brand will allow you to get to know the founder on a deeper level and build a true connection. Take the time to learn about their mission and make it a commitment to support long-term.For small business owners without online shops like myself, the best way to support is to simply spread the word. Follow and share my page on social media, sign up for newsletters, educate yourself on what I do, and book a virtual skin consultation if you have the means. Remember, the goal is to create long-standing success for Black-owned businesses by shifting the narrative to one of inclusivity in every area of the world. Now that you are aware of Black-owned businesses, you hold a social responsibility to share them with your white friends, family members, and colleagues. The time is now to gather all of your resources to propel Black businesses forward—and then keep doing it, in the weeks and months and years ahead.Use your privilege to democratize resources by sharing grant information; contact your local representatives to help facilitate programs to support small Black-owned businesses that the community needs, especially in multifunctional roles. Remember that when you strengthen small businesses, you also strengthen the community. Schools are fully staffed, after school programs are funded, and greenhouses are built that support local Black farmers. Demand diversity in positions of power, from boardrooms to schools, so your fellow Black employees can walk into the workplace without being the only minority present. Hold big corporations and brands accountable for their inclusion.Utilize your social network to amplify Black voices and provide representational justice, and don't drop the ball on an opportunity to become an ally even in the most inopportune moments— like it once did for a close white friend of mine. Two years ago, she called me after a date with her partner, who is also white worked as a VP loan officer for one of the most well-known investment companies in New York City. It was a wonderful dinner, except for one drawback: Her partner very casually responded to the waiter’s mistake on the bill with a racial slur. She told me she felt awful, but she didn’t say anything because, \"we were out having a nice dinner and I didn't want to mess up the mood.\" Can you see why his position of professional power and his racist mindset directly contribute to the ongoing systemic oppression of Black people, like the vastly disproportionate rejection of loans for Black businesses? White allies need to speak out on behalf of unheard Black people even when it's uncomfortable to correct someone they love deeply — because that’s what true “allyship” is. When you act on your privilege by supporting Black-owned businesses, always remember: No act is too small when change is needed to progress a race most deserving of all its accolades.Explore Bon AppétitHealthyishessayRead MoreLifestyle7 Virtual Mental Health Resources Supporting Black People Right NowBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-06", "author": ["Condé Nast", "Shani Hillian"]}