{"id": "68dbfa85c388bebdd44071e3ef76daad", "url": "https://www.bonappetit.com/story/pasta-carbonara-common-mistakes", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "How to Make Perfect Carbonara: Mistakes to Avoid | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Perfect Carbonara: Mistakes to AvoidYou want perfect strands of pasta glossed with a rich, silky sauce—not noodles tossed with scrambled eggs. Here's how to get it right, every time.By Alex DelanyFebruary 6, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Molly BazFacebookTwitterEmailPasta carbonara is the ultimate there's-no-food-in-the-house dinner. No matter how bare your cupboard or unfortunately under-stocked your fridge, there's a good chance you've got a box of pasta, a few eggs, some cheese, and a bit of cured pork kicking around somewhere. But as with most magical dishes comprised of just a few pantry ingredients, it's all about technique—one wrong move, and your should-be-glossy sauce will turn lumpy and nasty. Fear not, though. Use a good recipe, avoid these common carbonara mistakes, and you're golden.Use Room Temperature EggsThis might seem nerdy, but paying attention to the temperature of your eggs will help get your sauce smooth and light. Before you start doing anything else, take your eggs out of the fridge and leave them out on the counter. Cold eggs can lead to clumps in your sauce, and we didn’t sign up for any clumps.Whisk Like You Mean ItYou’re using more egg yolks than whites here, which is what makes carbonara so rich and luxurious. But there’s still two eggs-worth of whites in there. Whisking your eggs so that the whites are completely incorporated into the yolks will give your sauce a more uniform texture. Think of scrambled eggs. You don't want streaks of egg white in a scramble, and you definitely don't want them in carbonara.Take It Off the HeatThis is where most people mess up their carbonara. You cannot mix the noodles and sauce over heat. Don’t. Do. It. The gentle, residual heat from the noodles is what sets the eggs to create that velvety sauce, not the heat from the pan. So while you'll obviously need to turn the heat under the pot off completely before you mix in the egg and cheese mixture, you also need to physically move the pot off of the burner—that metal retains a lot of heat, and will keep your cooking vessel hot long after the flame is gone. Ignore this step, and you’ll end up with scrambled eggs. And while we do love scrambled eggs, that’s not what we’re making here.Add Your Eggs Immediately (But Slowly)Speaking of adding the sauce to your noodles, you should do that right after you take your pot off of the heat. You want the noodles to be as hot as possible, to cook the eggs and set the sauce. But don’t pour it all in at once. You should add the sauce gradually, so it has a chance to thicken.Keep the Pasta MovingWhile pouring, make sure that the sauce is being distributed evenly, because you want every inch of pasta to be coated in that velvety sauce. When you add the mixture of egg and cheese with one hand, you should have tongs or a spoon ready for the quick-draw in the other. You’re the John Wayne of carbonara. This isn’t a spaghetti western though—we like bucatini best.Go forth, into the land of carbonara!Simple CarbonaraThe no-food-in-the-house dinner of our dreams.View RecipeExplore Bon AppétitBasicallyEggPastaCarbonaraCommon MistakesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-06", "author": ["Condé Nast", "Alex Delany"]}