{"id": "68f1abf80c7c02fdb2927469170308b2", "url": "https://www.bonappetit.com/recipe/orecchiette-with-spinach-and-rosemary-fried-chickpeas", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Orecchiette with Spinach and Rosemary Fried Chickpeas Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishOrecchiette with Spinach and Rosemary Fried Chickpeas1 RatingFacebookPinterestTwitterEmail2 - 4 servingsPrep Time: 10 minActive Time: 25 minA dairy-free, lighter than usual pasta dish that leans on Country Crock® Plant Butter with Olive Oil for creaminess and flavor. PrintIngredients8 oz dried orecchiette 15oz canned chickpeas, drained3 Tbsp Country Crock® Plant Butter with Olive Oil2 sprigs of rosemary5 oz spinach2 cloves of garlic¼ tsp crushed red pepper flakes1 lemon1 Tbsp parsley, choppedRecipe PreparationCook the pasta:Bring a medium pot of salted water to a boil. Add the pasta to the pot of boiling water and cook to al dente package. Reserve one cup of pasta water, then drain.Fry the rosemary:In a medium Dutch oven, heat 2 tablespoons of Country Crock® Plant Butter with Olive Oil on medium-high until bubbling.Add the rosemary sprigs and fry, flipping once, 3-4 minutes until crispy and fragrant. Transfer sprigs to a paper towel-lined plate, leaving the Country Crock® Plant Butter with Olive Oil in the pot.When cool enough to handle, strip the greens off the stem, allowing to crumble between your fingers, and set aside.Make the chickpeas and spinach:Add the chickpeas to the rosemary-scented Country Crock® Plant Butter. Cook on medium heat, stirring occasionally, 5-7 minutes, until slightly browned and crispy.Add the crushed red pepper flake, garlic and spinach and 1 Tbsp of pasta water. Cook for 1-2 minutes until the garlic is slightly softened and the spinach becomes wilted.Finish the pasta: To the pot of chickpeas and spinach, add the cooked pasta, lemon zest, 2 Tbsp Country Crock® Plant Butter and ¼ cup pasta water. Cook, stirring frequently, 1 to 2 minutes, or until the pasta is coated and creamy, adding 1 Tbsp of pasta water at a time if necessary to fully coat. Turn off the heat and stir in the crumbled rosemary, reserving a pinch for garnish. Season to taste.Serve your dish:Plate each serving of pasta and finish with the juice of one lemon wedge, the reserved rosemary, parsley, a lemon wedge on the side, and a pat of Country Crock® Plant Butter if desired  - (1/2) Tbsp.Recipe by Country Crock® Plant ButterReviews SectionReviewsWrite a review…Didn't realize this was a promotional recipe and not an actual BA recipe until I bought the ingredients. I didn't use \"plant butter\" lol. \n\nIt was well received, however the recipe was unclear and inconsistent. \n\nIt says 2 cloves of garlic and provides no further instruction as to whether they should be cooked whole/peeled, finely chopped, sliced, etc. I crushed them. \n\nThe ingredients list calls for 3 TBSP of butter, but the recipe ends up calling for 4 total TBSP. \n\nI added shredded asiago.a.goekler7491Denton, TX08/06/20GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2020-06-08", "author": ["Country Crock", "Plant Butter"]}