{"id": "68f2aab2a56ec0c2a5d86151d4c03b6d", "url": "https://www.bonappetit.com/recipe/spiced-pear-and-bourbon-sparkler", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "Spiced Pear and Bourbon Sparkler Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpiced Pear and Bourbon SparklerOctober 1, 20204.8(9)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintHolidays tend to involve some effervescent fun, and we are celebrating while sticking to our sugar-free ways throughout the season. We created this Spiced Pear and Bourbon cocktail that will be perfect for any holiday, celebration, or chilly Tuesday evening. The spiced pear syrup is the star of the show and starts with a high-quality pear juice simmered with ginger, cinnamon, and a hint of cloves.  As a sweetener for the syrup we like to use Swerve because it measures just like sugar, so it’s easy to use in any recipe. In this cocktail, we went for Brown Swerve to really help add a rich caramel flavor that marries perfectly with the pear and warm fall spices. The final cocktail only has six carbs per serving but is still bursting with flavor! We hope you like it! It’s Peary good.IngredientsSpiced Pear and Bourbon Sparkler1½ ounces Spiced Pear Simple Syrup1½ ounces Bourbon½ounces lemon juice1-2ounces ProseccoIceChilled Coupe GlassSpiced Pear Simple Syrup1cup pear juice (not from concentrate or 3 ripe pears blitzed in a blender with ¼ cup of water)2-inch nub of ginger2cinnamon sticks5cloves¼cup Brown SwervePreparationFirst start with the star of the show, the Spiced Pear Simple Syrup. In a pot combine 1 cup pear juice (not from concentrate or 3 ripe pears blitzed in a blender with 1/4 cups of water), a 2-inch nub of ginger peeled and sliced, 2 cinnamon sticks, and 5 cloves. Cover and let simmer over low heat for ten minutes. Take off the heat and add 1/4 cup lightly packed Brown Swerve. Stir until the Swerve is fully incorporated into the mixture. Let cool, and strain. You can make this in advance and store in the refrigerator for up to one week.For the cocktail, pour the Bourbon, Spiced Pear Simple Syrup, lemon juice (if using freshly squeezed make sure you strain the juice to avoid getting any seeds in your cocktail), and ice into a cocktail shaker and shake for 30 seconds or until the surface of the cocktail shaker is cool to the touch. Strain the drink over a chilled coupe glass, and top with the Prosecco of your choice.Recipe by Lisa Clark and Erika Radford of the BoozyKetonesWant more? Check out these other holiday recipes showcasing Swerve:Whiskey Sweet Potato PieSesame Oat Apple CrispHow would you rate Spiced Pear and Bourbon Sparkler?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleA sugar free simple syrup out of the blue - it’s almost as if you’re shilling Brown Swerve. Glad this was the first cocktail; I have zero interest in reading the other 36 at this point.AnonymousSan Francisco, CA11/25/2021This is clearly spon con but not labeled as such. Bon Appetit, where have your standards gone?!Anonymous11/18/2021What a tasty cocktail! I used fresh pears for the syrup since they are in season and simmered with a premade mix of mulling spices. I substituted regular brown sugar for Swerve since I am not tracking carbs. I would make this again as a batch cocktail for a party next year.AmandaDenton, TX12/20/2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-01", "author": ["Condé Nast"]}