{"id": "68fc2c645b03c3b1e4b22c132a4a7c7b", "url": "https://www.bonappetit.com/story/how-to-make-sticky-rice-thai", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "How to Make Sticky Rice, Thai Style | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy, Cook, and Serve Thai Sticky RiceEverything you need to know to get this Thai staple right.By Leela PunyaratabandhuAugust 3, 2021FacebookTwitterEmailPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailThai sticky rice can be intimidating to those who don’t cook and eat it routinely. Even some Thai people who grew up eating it feel apprehensive about making it at home. But once you know how to make sticky rice properly, you’re set for life. The only remedy, as the philosopher Nike says, is to just do it—and do it often enough that the task doesn’t give you anxiety any longer.For the best experience with Thai sticky rice (khao niao), three things are of utmost importance: getting the correct type of sticky rice, cooking it the right way, and serving and eating it the way it’s traditionally served and eaten.How to Pick Your RiceGetting the right type of rice is crucial. Unfortunately, in my experience writing about Thai food, I’ve noticed that this is where many people go wrong. When it comes to creating Thai recipes in the way that is true to tradition, this one initial misstep alone ensures a less-than-desirable outcome even though everything else downstream is done perfectly. Not all types of Asian “sweet” or “sticky” rice are the same, and I have not found a single variety that works well as a substitute for this particular one. Some may argue that all types of sticky rice are interchangeable, but try telling that to the Thai and Lao people who eat this rice as a staple.The confusion around the identity of this rice variety and the difficulty in telling it apart from the many other types of Asian rice are common and understandable. The terms “sticky rice,” “sweet rice,” and “glutinous rice”—the best attempt on the manufacturers’ part to describe it in English—are simply too broad and generic to be helpful. What do you do, then, when you stand in the rice aisle of an Asian store, overwhelmed by packages of rice that are all labeled as such?In the present time, most Thai and Lao sticky rice is imported from Thailand, so to be sure that you get the right type of rice, look for “sweet rice” or “glutinous rice” on the package, along with any kind of indication that this rice has been imported from Thailand, including the word ข้าวเหนียว. If you see the word “Sanpatong” on the package, that’s even better, as it means it’s the high-quality type named after San Pa Tong District in the Northern Thai province of Chiang Mai; this variety cooks up fluffy, tender, and fragrant, and it is much beloved in Thailand.When raw, the grains of this rice variety are of medium length and bright opaque white; when cooked, they turn off-white, somewhat translucent, and shiny. When properly prepared, the grains hold their shape but stick together due to the high level of amylopectin, one of the main types of starch molecules in rice grains with amylose being the other (the amount of amylose relative to amylopectin varies among the many different types of rice; longer-grain varieties have higher ratios of amylose to amylopectin, which explains why they don’t cook up as sticky as shorter-grain varietiesWhat’s the Deal With Purple/Black Sticky Rice?White sticky rice is by far the most common type of sticky rice sold and consumed in Thailand; when a Thai recipe calls for sticky rice, unless stated otherwise, white sticky rice is the move. However, another variety of sticky rice, khao niao dam (literally, “black sticky rice,” although the color is purplish-brown), is also a favorite among Thai people. In the past it was primarily reserved for sweet applications, but black sticky rice is now often served with savory dishes in place of the regular white sticky rice, mostly because black sticky rice is unpolished and, therefore, offers more health benefits.The downside to black sticky rice is the texture of the fiber-rich outer layer. To make it more palatable, I recommend you do what many people in Thailand do, which is to use a combination of black sticky rice and white sticky rice instead of using only black sticky rice. The ratio of two parts black sticky and one part white sticky rice is what I prefer. The end result is reddish-purple sticky rice that is tender yet nutty and chewy and behaves just like regular steamed white sticky rice.Choosing the right black sticky rice presents the same challenge as choosing the right white sticky rice, as there are many dark-colored Asian rice varieties in the market. The key is to look for tri-colored grains that are mainly black and dark reddish-brown with some dark beige sprinkled throughout. And, of course, make sure there’s something on the packaging that indicates Thai origin.How to Make Sticky RiceIf you’re going to cook sticky rice and serve it as the main starch for a meal, you need to cook the rice above rather than in boiling water. Traditionally, the rice is soaked for a few hours, drained, and deposited into a bamboo basket that looks kind of like a short, squat waffle cone. The basket is then placed atop a metal pot full of boiling water and covered. The steam rising from the boiling water underneath the rice cooks it. (Boiling the rice results in an entirely different texture, deemed undesirable for the purpose of creating steamed rice to eat with a meal.) If you don’t have this exact setup, you can approximate it really well using a fine-mesh sieve and a saucepan. Just be sure that the sieve is heatproof and can sit atop the opening of a saucepan while leaving about three inches between its lowest point and the water in the pan.How to Serve ItCooked sticky rice dries out and hardens very quickly when exposed to air. This is precisely why sticky rice isn’t spooned out of a pot onto each diner dinner plate the way long-grain rice usually is. Rather, it’s kept in a lidded communal container from which you take out a few bites’ worth at a time. Restaurant cooks make a large batch of sticky rice and keep the hot rice in a large cheesecloth-lined thermos for this reason. When it’s time to send a portion to diners, they put the rice in a small high-rimmed bamboo container called a katip, with a lid that extends nearly all the way to the bottom, forming two layers of tightly woven bamboo walls that keeps the rice warm and tender for the duration of a typical meal. Street food vendors likewise wrap a small portion in a banana leaf or a clear plastic bag to keep the rice from drying out.At home, always serve the rice warm, keep it in a bowl as thick, deep, and narrow as practical, and covered tightly with plastic wrap (and maybe a layer of kitchen towel for good measure). Take out only a small portion at a time and immediately re-cover the bowl.While a spoon and a fork are what the Thais usually use when they eat long-grain rice, the best utensil for sticky rice is your hand (with a fork being the second-best choice). The best thing about properly cooked Thai sticky rice is that its texture gets better when you pull off a bite’s worth of it and knead it lightly with the tips of your fingers before eating it plain along with a piece of grilled chicken, for example, or dipping it in a saucy and brothy food with your fingers—the way it’s done in Thailand and Laos. Do your best not to let the rice get too saturated with liquid as the moisture will break apart the stickiness that holds the grains together.How to Reheat Cooked Sticky RiceSometimes a meal gets long and sticky rice gets cold mid-meal despite every attempt to keep it warm. In this case, simply re-cover the bowl and pop it in the microwave. If the rice has also become a little dry, a very light sprinkling of water before it goes into the microwave works wonderfully.Sticky rice has the best texture when freshly cooked, but leftover rice can be refrigerated for up to two to three days in an airtight container. Reheat it in the microwave as detailed above.After three or four days, especially after being reheated and then chilled multiple times, the “glue” that holds the grain together will have lost most of its power. At this point, the grains separate easily and behave very similarly to cooked long-grain rice. This means whatever you usually do with leftover long-grain rice—using it to make fried rice, for example—can be done to leftover sticky rice.Get the recipe:Khao NiaoDelightfully soft yet chewy Thai sticky rice is traditionally prepared in a bamboo basket set over a metal pot of boiling water, but you can easily replicate the method at home with a saucepan and a fine-mesh sieve.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-03", "author": ["Condé Nast", "Leela Punyaratabandhu"]}