{"id": "691bc7f5171475a995e62d31cbf2d378", "url": "https://www.bonappetit.com/story/momofuku-ko-bar-design-well-crafted", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Well-Crafted Kitchen: Inside the New Momofuku Ko Bar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Well-Crafted Kitchen: Inside the New Momofuku Ko BarSo many secret surprises.By Kelly DobkinJune 5, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailDining at a Momofuku restaurant has traditionally required an element of sacrifice—chairs without backs, a menu without substitutions, and at the crown jewel of the empire, Momofuku Ko, forget choosing the date or time of night—you’re just lucky to get in at all. But what you get in return is more than worth it: innovative, genre-bending cuisine packed with flavor, and dishes you’ll remember long after folding up your napkin.The restaurant empire, founded by chef David Chang, has been exalted by critics and beloved by diners since Momofuku Noodle Bar began it all in NYC’s East Village in 2004. In the highly competitive NYC restaurant world, you don’t stand out by following the rules...and Chang never has.When it opened in 2008, Chang’s rebellious tasting menu concept, Momofuku Ko, also required a fair amount of compromise on the diner’s part.For one thing, you had to book your seats through an online system that was instantaneously inundated and nearly impossible to penetrate. You became very familiar with your laptop’s refresh button (and the limits of your own patience) in the process.Once you made it inside, you were dining in a small bar-like space, barely an arm’s length from the chefs who were preparing your food, right in front of you. It was refined, yet scrappy. The tasting menu was relatively affordable at $85 a head and the vibe was casual, complete with a heady rock & roll soundtrack.It’s become a bit easier to gain access to the Ko experience, after a relocation to a larger, swankier, address in 2014, although prices have increased.Photo by Heidi's BridgePhoto by Heidi's BridgeAt Ko’s upgraded space, the bar/open kitchen counter is in the center, with plenty of room to spare for the diner, and lined with artwork by David Choe. All eyes are still on the chefs who are working inside a U-shaped bar counter/open kitchen, surrounded with seats. This level of visibility is still relatively unique, although not rare, especially with the prevalence of omakase sushi spots all over the city.The dining room at Momofuku Ko.\nPhoto by Heidi's BridgeBut David Chang’s rebel ethos is softening a bit with age; he reopened Chelsea’s Momofuku Nishi last fall with more comfortable non-backless chairs, for example. And in 2015, he opened a low-priced, fast-casual concept called Fuku that even delivers, giving more diners the chance to try his food at their own convenience.At Ko, concessions have recently been made as well, some might say, with the recent reconcepting of a former office and storage area into a bar/test kitchen next door. Executive chef Sean Gray and GM Su Wong Ruiz designed it along with Richard Lewis Architects, the same firm behind NYC restaurants like Agern, Indian Accent and Via Carota.The revamped space offers much more flexibility for both the chefs and for diners. “Originally, this was going to be just a bar and lounge,” says Gray, “but we really needed a test kitchen so we decided to make it both.” Here you can walk in (beginning at 3:00 p.m.) and order drinks and dishes which rotate weekly (and sometimes daily).What Gray means by “test kitchen” is a place in which to try out new dishes (on diners) for the Ko main dining room menu—something of a nightly focus group if you will. Then, he can tweak and perfect them before they appear on the Ko tasting menu. Everything from a quadruple-fried chicken leg to a sourdough crepe (with or without caviar) to whatever Gray feels like playing with that day is fair game for guests who serve as his culinary guinea pigs.Secret storage underneath banquette seating in the bar.\nPhoto by Heidi's BridgeDiners at the bar seats also have front row access to the chefs—and all of their equipment. High-end items like a fancy German bread oven (the kind they use at “real bakeries like Tartine” according to Gray), two built-in induction burners and a Konro grill fueled by binchotan charcoal are juxtaposed with more everyday items like a basic rice cooker and a wine fridge that “cost less than $100 on Amazon,” according to Ruiz.There are no defined stations behind the bar counter. “The food at the bar is changing all the time,” according to Gray, “so it’s set up to be very fluid and not super structured.” The dish area for the bar is self-contained in an attached space for convenience. Gray, Ruiz, a line cook or whoever, will all take turns acting as dishwasher throughout the night.The objects that Ko chooses to display are carefully curated. In the main dining space, refrigerators accessible from both the kitchen and dining room showcase dry-aged steaks as well as plates and other kitchenware, neatly organized with presentation in mind. Peek-a-boo shelving runs in a U-shape above the open kitchen counter, high above the centerpiece of the action displaying select spices and dry goods. A stack of labeled spices neatly resides in the bar corner against the wall that abuts the bar room, often monochromatic in color scheme.Photo by Heidi's BridgeMinimalism presides in the new bar area (as it does throughout the Momofuku empire), which Gray and Ruiz say draws design inspiration from artists Donald Judd, Dan Flavin and the movie, Bladerunner. At the tables, you’ll find hidden drawers that pull out seatside to house cutlery, admittedly inspired by similar tables at Relae in Copenhagen, according to Ruiz. Pull open the leather banquette seat beneath you and you’ll find storage cabinets hiding underneath as well, laden with back issues of Lucky Peach magazine (among other things).Photo by Heidi's BridgePerhaps most striking in the new bar area are the library-style LED lights, made by California design company, Koncept, that swivel to the chef’s will. Low-back bar chairs are made by Token, who also provided the artwork for the test kitchen, and designed the tables and chairs in the dining room.The window that connects the bar to the dining room.\nPhoto by Heidi's BridgeMost fun is the window/panel in the wall between the dining room and bar, which opens and closes to connect the two spaces and pass drinks through. “When we were setting up the new space we asked ourselves, ‘how will we get drinks back and forth?” says Ruiz. This was their answer. Plus it adds a fun element of surprise for diners, who if they peer closely, can see through to the main dining room when the window opens.Despite all of the sleek, playful design and high-end equipment, the real theater at Ko is in watching the chefs. And the centerpiece is what’s happening on the plate, with new audiences now able to more easily peek their heads in and catch a glimpse of the show.Executive chef Sean Gray and GM Su Wong Ruiz\nPhoto by Heidi's BridgeExplore Bon AppétitMomofuku KoNew YorkRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Kelly Dobkin"]}