{"id": "6922dcff79b7835a3e7b3caec1dce4c6", "url": "https://www.bonappetit.com/story/calming-election-anxiety", "year": 2020.0, "month": 10.0, "day": 5.0, "content": "7 Anxiety Tips to Ease the Stress of Election Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle7 Tips for Calming Election Anxiety We Could All Use Right NowFit for Us, a new group of Black fitness and wellness experts, shares its strategies for easing the angst of election season.By Elyse InamineOctober 30, 2020FacebookTwitterEmailVonecia CarswellFacebookTwitterEmailFit for Us, the newly formed advocacy group of Black fitness professionals, is stacked with personal trainers and mental health experts, the kind of people who push you to do *one more* burpee, who crush you with positive, can-do vibes. But the day after the first 2020 presidential debate, even they were feeling the burden of this election season. “I was extremely confused and anxious when I woke up after the debates,” says Deja Riley Izydorczyk, the director of culture for Fit for Us. “I knew right away that I needed to meditate.” “We noticed people were exhausted, emotionally and physically,” adds Percell Dugger, one of the cofounders. “People in the group were so immediately defeated,” remembers cofounder Mary Pryor. “Seeing their fear and trauma, that raised my awareness so I reached out to Color of Change.”Pryor had worked with the racial justice and civil rights advocacy nonprofit in the past. She, along with Dugger, Riley Izydorczyk, and the rest of the Fit for Us team, saw an opportunity to make self-care a priority during this tumultuous election season. Last week, Fit for Us and Color of Change launched the Sanity Plan, a weekly changing lineup of online resources to use this election season, ranging from fitness classes and meditation sessions to guidelines on voting in the midst of COVID and town halls covering topics like psychotherapy and bringing mindfulness to the Black and brown community. It’s free, open to anyone (you can register here), and ongoing for the next couple weeks, possibly even beyond that. The idea is to give participants the mental, emotional, and physical tools to healthily process the ebb and flow of this election as well as integrate into their own lives in a practical and sustainable way.Deja Riley Izydorczyk connects with Percell Dugger for a virtual session.\nVonecia Carswell“It is so important for Black folks to take good care of ourselves and each other during this election season and beyond. Part of this is taking care of our political power—helping to get out the vote within our families and communities and even volunteering at polling places, if able,” says Rashad Robinson, the president of Color of Change. “Everyone has a role to play, and these fitness professionals are helping to take care of our people—fighting anxiety with exercise and protecting our peace with meditation. As experts in Black voter engagement, we saw this as a clear way to address health and wellness needs of our millions of members. In short, it was a perfect fit.”“We believe self-care isn’t something you do when it’s convenient, and we don’t think it should be rooted in privilege,” says Dugger. “We wanted to make sure it’s accessible to our community now, but also something that is evergreen. No matter who wins, people will experience stress and lack of mental health resources.”Below, members of Fit for Us share specific practices they’re using to navigate this election with wellness in mind. Introduce them into your own life, now and beyond the election.Courtesy of Mary PryorTry a CBD tincture.“People are just confounded by everything, from what’s happening in federal courts to voter suppression to these crazy lines to vote. We have to be aware while also being healthy in the process. For me, that is through plant medicine, which can be in the form of THC, herbs and tinctures, flower essence. CBD is really helpful for anxiety. I recommend this CBD tincture, CHILL TONIC from Tonic Vibes, for sleep support; the ashwagandha, lemon balm, and passionflower help with that too. It’s a unique time, and I think people will be leaning on plant medicine during this election and beyond.” –Mary Pryor, cofounder of Cannaclusive and cofounder and adviser of Fit for UsPractice affirming yourself.“Many people initially fear their own voice—there have been studies that people are more inclined to receive inner dialogue when they refer to themselves as ‘you’ versus ‘I’. So I created Forced to Flow, four minutes of mantras from me, a chick of color who sounds like your home girl. Right now, I suggest journaling after listening so these mantras aren’t just words but influences on your life. Say the mantra is ‘my peace is a weapon of mass construction.’ List 10 examples in your life where that affirmation has shown up. By doing this, you are gathering evidence of these words.” –Tracy G., wellness artist, podcast and radio host, and member of Fit for UsMove your body while listening to a special playlist.“Music has always been very therapeutic for me; it helps me navigate my emotions, thoughts, and movement in general. For the Sanity Plan, I’ve created three themed playlists—inspiration, reflect, and relaxation—so people can wear a mask, go outdoors, and take a walk or run while listening to these playlists. I want to encourage people to move, since being able to move is a privilege, as well as to share exercises that will actually be impactful for people during this election season.” –Percell Dugger, founder of GOODWRK and cofounder and president of Fit for UsCourtesy of Deja Riley IzydorczykStretch first thing in the morning.“I used to overcomplicate my stretches but now find myself doing something simple: focusing on individual parts of my body. I’ll start with a neck release, then roll out my shoulders, and take some chest openers. Then I move my torso and do a side bend. I’ll get into my lower body, doing some lower body circles or hip flexor stretches. Finally I focus on my legs, stretching my hamstrings and calves and rolling around my ankles. Stretching helps me build awareness of my body and sets me in the right direction for my day. I feel more flexible and malleable, especially when I head into stressful situations.” –Deja Riley Izydorczyk, creator of Deja Riley Athletics, host of PopSugar Fitness, and director of culture at Fit for UsMeditate when you’re in the bathroom, washing dishes, everywhere.“I suggest micro meditations. No four-hour session sitting on a mountaintop. That’s what people think meditation is, but when you have a job and a family, that’s too much. You only need a couple minutes to meditate, maybe it’s in the bathroom if that’s the only place you can be alone, or at the sink while you’re washing dishes. Wherever you are, focus on your breath, your sensations, what’s happening around you. Become silent. Say you’re washing dishes, become curious about what you’re doing. What is the sensation of water on your hand? How does the soap feel? What does it smell like? What is that piece of something you can’t get off the plate? How long does it take to get off? This is meditation. You’re not escaping your life for meditation, but integrating meditation into your life.” –Dr. Ally Hicks, Ph.D., mental health and relationship expert and member of Fit for UsSet intentional breaks.“I have a friend who is a Trump supporter. We share our differences, we don’t fight, we don’t argue. The way I’m able to do this is by understanding and loving myself, so I don’t need to react and can listen to the other person. I practice this kind of mindfulness at work by stepping away to a hiding spot. I just talk to myself, whether it’s through a whisper or a thought, reminding myself that I am loved, I am kind, and I am safe. I tell myself this three times. This is to give reassurance to myself. Then I try to find someone in my space, maybe it’s someone at the gym I manage, and I give them a wink or open the door for them. This helps me be in someone else’s awareness, not just stuck in my own world.” –William Robinson, general manager of Blink Fitness in Brooklyn and member of Fit for UsFocus on the immediate, rather than the long-term.“Running and meditating have both given shape to my days, when my sense of time and space has warped out of control. I strive for consistency and quality in what I do, rather than the high-water marks. I ask myself, Am I going to run today? Did I meditate this morning? If I didn’t meditate this morning, will I do it at night? It’s going back to the simplest acts, which can sound abstract but are very specific and real. Now I think about what I’m going to do today. For the election, we’ll be awaiting results, but the reality is we won’t know until some time after. Instead of getting caught up in that, I can focus on what I am doing on November 4, then November 5, and set intentions for each day.” –Knox Robinson, writer, coach, founder of Black Roses NYC, and adviser to Fit for UsExplore Bon AppétitHealthyishSelf CareInterviewsRead MoreLifestyleA 4-Step Breathing Exercise to Cope With Difficult EmotionsBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-30", "author": ["Condé Nast", "Elyse Inamine"]}