{"id": "69253178ace5e80ce05a23a4eebc2488", "url": "https://www.bonappetit.com/story/my-foster-mother-taught-me-to-cook", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Wonder Bread, Government Cheese, and the Comfort of My Foster Mom’s Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWonder Bread, Government Cheese, and the Comfort of My Foster Mom’s KitchenEsther wasn’t just teaching me about making food enjoyable, she was teaching me about survival.By Nicole JohnsonNovember 18, 2020FacebookTwitterEmailIllustration by Kezia GabriellaFacebookTwitterEmailMy mother was a drug addict. She ran off to California with a boyfriend when I was a baby. A few years later, she died in her apartment in Van Nuys of a drug overdose. My older brother and I were raised by my grandparents and our foster mother, Esther. Time was divided between the middle-class neighborhood just north of Boston where my grandparents lived and my foster mother’s apartment in a housing project just up the hill. It was in the time spent between those two homes that I learned the differences between the haves and the have-nots, and nowhere was this more apparent than in the kitchen.My grandparents had supper promptly at 6 p.m., after returning from the white-collar jobs that paid for the prime rib and scallops we had nearly every week. Gram was the secretary to the president of an aerospace company. My grandfather worked in exports and often flew to Egypt, one of the few events that could disrupt our rigidly scheduled dinners.We sat around the wooden dinner table and my brother and I didn’t speak unless spoken to. My grandparents chattered about their day as the radio buzzed with either easy listening hits of the ’70s or the ramblings of the local Christian station. The rules were simple and never questioned. There was no soda at the table. We asked to be excused. We cleared our plates on the way out of the kitchen. We ate what we were given and weren’t allowed to leave until we did. I spent many evenings watching Gram pay bills, punching calculator keys as the white tape crawled past my lima bean–filled plate. The food we ate was as organized and succinct as our dinner routine. Each one was balanced based on the FDA food pyramid recommendations, a meat, a starch, a vegetable, and a salad with the expensive Cracker Barrel cheese, which counted as a dairy. While I loved the food, it also bored me, and the routine made me anxious. I worried about finishing my food and about my table manners (or lack thereof).We had cheese at my foster mother’s house too. It was a large neon orange block provided by the government to welfare beneficiaries, food stamp recipients, and the elderly. It was always sent to my grandparent’s house, for my brother and me, but she’d lug the large cardboard box to Esther’s and hand it off as if it were a gift, a charitable donation to a woman who never wanted or asked for charity.We knew Gram didn’t approve of Esther’s kitchen: the factory green walls, the color of every other subsidized-income apartment around us; the fake brick flooring; and the Formica table and banged-up counters. But her disdain for the interior design of Esther’s kitchen was nothing compared to her feelings about what was inside my foster mother’s cupboards: white Wonder bread (my grandmother always bought wheat), sugary Kool-Aid (bad for our teeth, Gram complained), and meat in a can (“filled with sodium and just plain gross,” Gram’s words). Esther’s cupboards revealed the food insecurity she often lived with and the frugality that it necessitated. Of course, my grandmother never said a word to Esther. She knew that Esther was a single mother raising three kids while living on a limited budget.The writer and her foster mother, Esther, at a shopping mall in Malden, MA in 1976.\nPhoto courtesy of Nicole JohnsonWhat my grandmother didn’t know was that I liked meals at Esther’s more. Unlike my grandmother, who felt obliged to cook, Esther relished the time we spent mixing up ingredients in a large, chipped plaster bowl, putting meals together for her three biological children, myself, and my brother. She could create sustenance and comfort with very little.Sitting around a meal at Est’s house was never a formal affair. Supper’s location each night was dependent on our mood. It might take place around the kitchen table, or wedged against a counter by the sink filled with dishes, or in front of the television where we ate off imitation wood and brass television trays while watching Welcome Back, Kotter and The Brady Bunch. The dinnertime soundtrack was a melding of sitcom laugh tracks, television theme songs, and the chaotic laughter and chatter of five children, their mother, and a barking dog.While Gram showed me how to season a steak and prepare a baked potato, Esther taught me to cook. Learning to hard-boil eggs in a pot comforted me in a way my grandparents never could. She’d let me cut them with the egg slicer, splitting it into pieces to be gobbled up with mayonnaise and a dash of salt and pepper. She turned simple items into meals that fed our large, nontraditional family. And food was not just for eating—it could heal. When I ran in after playing on a rough-hewn seesaw, a splinter lodged deep in my pinkie, Esther used moistened white bread positioned under a band-aid to gently remove the trapped sliver of wood.Even after I left my childhood dinner table, I carried the lessons I learned in Esther’s kitchen. In my college dorm, I used her trick of adding spicy hot pepper juice to ramen noodles, often the only food I could afford. I’d fancy up the cheap oats I bought in bulk with butter, milk, and cinnamon. Her tricks for adding flair to simple foods made eating as a poor college kid not only bearable but enjoyable. They were a reminder of her, and they were a comfort, even more so after she died of a brain tumor just before I graduated.Even when I could afford to eat more expensive foods, I found myself falling back on the foods and recipes she shared with me: Thanksgiving stuffing with apple and sausage, hot dogs in pasta with jarred sauce and shredded cheese. There’ve been times when I’ve struggled to feed my own family of six, and Esther’s recipes helped me then too. My foster mother wasn’t just teaching me about making food enjoyable, she was teaching me about survival—how it doesn’t have to look as dire as it may be.Esther cooked the way she did in part because it was all she could afford to do, but it never seemed that way to me. It still doesn’t as I teach my kids, who never had the chance to meet her, my favorite recipe, the one I watched her prepare so many times on return trips home from college: scrambled eggs, frozen french fries, and white American cheese covered in ketchup and drizzled with hot pepper juice. I’m teaching my kids that even when things get difficult, food can offer comfort and joy. As I snap a picture of the dish and send it to my brother, I’m sure this is one of the most important lessons I’ve learned. I’m glad Esther was the one who taught it to me.Explore Bon AppétitHealthyishessayRead MorecultureMaking Amends With Lean CuisineBy Mariella RudiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-18", "author": ["Condé Nast", "Nicole Johnson"]}