{"id": "6942469e95f9539a7d6f058470c86e2d", "url": "https://www.bonappetit.com/story/the-bake-sale-is-now-radical", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "The Bake Sale Is Now Radical | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Bake Sale Is Now RadicalBye, fancy galas. Pastry chefs, writers, and others in the food industry are finding more accessible ways to fight the good fight and raise money and awareness for causes they believe in.By Elyse InamineAugust 16, 2018FacebookTwitterEmailPhoto by Danielle AdamsFacebookTwitterEmail“If you’re a chef in New York City, people ask all the time if you can donate something for an auction or cook for a gala,” says Natasha Pickowicz, the pastry chef behind Café Altro Paradiso and Flora Bar in New York City. “But for me, growing up in Southern California, I went to bake sales.”She remembers the homey presentations, the DIY baked goods, and the casual, convivial atmosphere. That seemed more appealing than the restaurant industry way of doing good, which has typically fallen in the fancy, fundraising gala territory. For chefs, that means lending your services (maybe cooking for the event or auctioning off a special dinner to the highest bidder) but not actually engaging with the cause. For guests, that means you probably need hefty funds to get a seat at the 7-course dinner. That’s not the case with bake sales.“There are no reservations. You don’t just sit there,” Pickowicz says. “It’s an opportunity for people to come together in a super casual way, to have a conversation, swap ideas, and get inspiration for the next thing.”When it came to figuring out how to give back after the 2016 election, last April, Pickowicz and the team at Matter House, the restaurant group behind Café Altro Paradiso and Flora Bar, planned a bake sale to raise funds for the Manhattan branch of Planned Parenthood. Pickowicz asked all of her pastry chef and cook friends to make about 50 pastries, show up at Café Altro Paradiso, and see how it goes. She announced the bake sale on Instagram, not expecting a line around the block. All the baked goods were gone within an hour, they had raised $8,000, and people were already asking about the next one. For round two this year, Pickowicz and her team quadrupled the amount of pastries made (they still sold out along with totes and booze, donated by Enlightenment Wines and Yola Mezcal) and raised $22,000 for Planned Parenthood.“The charm of this kind of event is that it’s hyper participatory and super low key,” Pickowicz says. “People want to help and show up.”Writer Dayna Evans (who also contributes to Bonappetit.com) has experienced this kind of response with the bake sales she’s held at Playground coffee shop in Brooklyn. For the first one, she baked bread out of a rented commercial kitchen and a local pie shop donated some desserts, which raised $5,000 for World Central Kitchen. At Evans’s most recent bake sale, Alison Roman, the cookbook author and former Bon Appétit editor contributed those famous chocolate chip-shortbread cookies, which sold out. In the end, they raised $10,800 for RAICES in Texas; the Young Center, an organization that helps unaccompanied immigrant children; and Make the Road New York, an immigration and working class reform organization.“I feel frustrated with the idea that bake sales are by design reactionary,” she says. “I’ve been toying with the idea of having a consistent bake sale once a month dedicated to one particular issue that’s been on the back burner or people aren’t aware of.” Keep an eye out for ongoing bake sales through her new Instagram account, @permanentbakesale.Beyond the exponential growth of the bake sales, what makes it worth it to Pickowicz is the way she can feed her community in a different way.“When you’re in a restaurant basement, it can be this myopic environment. You can’t see who you are making food for and you feel like you’re searching for that connection,” she says. “But with the bake sale, you can go out and meet so many wonderful people, some who haven’t even been to the restaurant but are interested in the cause and willing to donate $5.”The power of the bake sale is catching on: Chef Ryan Santos plans on adding a charitable component to the all-female pastry chef bake sales he’s been hosting at Please in Cincinnati. “These initial bake sales were a bit of an experiment, but next season we want to let the women choose a charity of her choice,” Santos says via email. “We are constantly striving to create a dialogue and expand opportunities for the underserved in our complex world of hospitality.”Pickowicz and Evans have also received emails from pastry chefs, cooks, and others across the country, asking how to pull of a bake sale at home. Luckily for them, it’s easy: pick your cause, get your industry friends to bake things, and sell them. The low cost ($1 cookie, $7 loaf of bread) and come-as-you-please flow naturally invites and empowers a new generation of activists. And we’re ready to line up.All fired up? Kick off your next fundraiser with these chocolate-toffee cookies.Explore Bon AppétitThe Hot 10Hot 10 2018Read MoreculturePlanned Parenthood’s Outgoing President Cecile Richards on Making Trouble—and PiesBy Hilary CadigancookingClaire Saffitz Makes All Your Favorite Baked GoodsBy Adam RapoportrestaurantsThe Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office LobbyBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Elyse Inamine"]}