{"id": "695224838443b3a481384a0e5d3d545e", "url": "https://www.bonappetit.com/story/less-sugar-baking", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "How Much Sugar Can You Reduce in Baking? I Baked These Chocolate Chip Cookies With Half the Sugar to Find Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Baked These Toffee Chocolate Chip Cookies With Half the Sugar and Loved ThemConventional wisdom says not to reduce the sugar in a recipe by more than one-third, but I decided to live dangerously.By Sarah JampelFebruary 4, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI am a frequent, faithful baker, and, for better or worse, I treat recipes as gospel. A yellow cake recipe tells me to add two cups of sugar and I pour... and pour... and pour until I reach 400 grams, wincing all the way.So learning that some of my friends deviate by simply omitting a fair amount of the sweet stuff when they bake left me both scandalized and intrigued. It was like that time in college when I found out all of my friends had fake IDs: Hey, you're not following the rules! But wait, that WORKS?I had always trusted that the particular amount of sugar was in there for, you know, good reason—and not just for the sweet taste. The more I learned about baking, the more I believed it. Sugar plays a role greater than sweetening, after all: It keeps baked goods tender (hygroscopic sugar attracts moisture, which makes it available to the flour and thereby contributes to a dessert’s soft, melting texture); it figures into proper spreading, browning, and aeration; and it extends shelf life. Why mess with chemistry when recipe developers have done the hard work work for me?Well, because, try as I might to bury my head in the sand, even I am painfully aware of the growing list of compelling reasons to limit sugar intake and susceptible to the possibilities of a new year. Cutting it out completely is, uh, just not gonna happen, but what would happen if I trimmed a little sugar here and there? How much could I reduce before things went haywire?Conventional wisdom told me not to dial back the sugar in a recipe by more than one-third (so, for every cup of sugar, you risk playing with fire if you venture below two-thirds cup), but I threw caution to the wind and went halfsies with Bon Appétit’s de facto best cookie, the Brown Butter and Toffee Chocolate Chip. I also made a batch according to the recipe so we could do a side-by-side test. This was science, after all.I brought them both to the office and asked my colleagues, in a blind test, to tell me which they preferred (and what they thought the difference was). First, and most interestingly, not even one person was able to identify the variable. No one said, “This one is much sweeter”—the differences ran deeper than that. And even though plenty of people preferred the full-sugar cookie, no one said the half-sugar cookie was bad. Had they never met the fully-loaded cookie, they may never have missed it.Which is not to say that the differences between the two cookies were small: Because the half-sugar cookie didn’t spread as much, it was more pleasing in appearance (fewer ripples), with a pillowy texture that verged on cakey. Most people said it was drier, and some found it a little salty. The darker, thinner full-sugar cookies were chewier in the middle, with lacy perimeters. They didn’t necessarily taste a whole lot sweeter but instead had a deeper, richer, more caramel-y flavor that was generally preferred.But the opinion wasn’t unanimous. Some tasters, myself included, favored the half-sugar cookie to its full-sugar counterpart for its toasted oat flavor. Full disclosure: Both batches had a ton of bittersweet chocolate and chocolate-covered toffee, which definitely helped to even the playing field. Lesson one: If you’re going to cut the sugar dramatically, make sure you have an element of distraction, be that a sweet add-in (if not chocolate, dried fruit) or a topping, glaze, or decoration.Fueled by the success of my first experiment in which not a soul complained about a cookie with the sugar slashed, I went on a half-sugar baking spree. In the same weekend, I made two batches of BA's best banana bread in muffin form and two simple yellow cakes studded with frozen raspberries from the depths of my freezer. I was on a half-sugar high.The results for the banana bread were as I would’ve expected:  The reduced-sugar banana muffins were airier, spongier, drier, and, somehow, taller than their sugared up siblings, which were darker, shinier, and squidgier, with a tighter, more tender crumb. In terms of flavor, the full-sugar versions were more loudly BANANA! The sugar had enhanced, not masked, the fruit’s flavor. The half-sugar muffins, on the other hand, were tasty but a little flat, like when a rich stew is missing a tablespoon of vinegar or a brownie could use a sprinkle of salt. I was also able to make a greater number of muffins from the full-sugar batch: That might seem like an obvious result—a larger amount of sugar equals a larger volume of batter equals more muffins—but I was surprised nonetheless.Could BA's best banana bread stand up to half the sugar?\nPhoto By Alex LauI tasted the two variations side by side with a friend who didn’t know that one was made with half the amount of sugar. He couldn’t pinpoint the difference between the two or give a definitive answer on which he preferred. He liked both! Lesson two: Sweet fruits and veg—I’m talking bananas, applesauce, sweet potato, dates—are your friend.But when it came to the yellow cake, the difference in quality was more apparent. Because there was significantly less batter to maneuver with the half-sugar cake, I had a hard time incorporating all the ingredients evenly. The half-sugar cake had spots of cooked egg white (not quite as gross as it sounds) and it was also about two-thirds the height of the full-sugar cake. It was squat and decidedly not sweet, with an egginess that reminded me of clafoutis and a mochi-like gumminess. It wouldn’t pass as a birthday cake, but I still found something strangely satisfying about it. The full sugar cake was a different beast: fluffy, light, sweet, classic.  Lesson three: When there isn’t much else to mask the lack of sugar—this cake was just flour, eggs, butter, sugar, and leaveners—its absence becomes much more obvious.As a reward for his duties, my friend went home with a large portion of the full-sugar cake—he opted out of the half-sugar one, which was okay with me: I ate it all week.All in all, the half-sugar desserts were much tastier than I had expected. Instead of being met with fire and brimstone, I was faced with baked goods that were a little drier and a little less flavorful. It didn’t seem like the end of the world. Now I’m not going to go totally nuts: Some recipes, like meringue, ice cream, and candy depend on sugar for their integrity, while others, like delicate cakes, suffer noticeably. But will I leave out some of the sugar the next time I’m making loaf cake, chunky cookies, or fruit crumble.As long as I don’t have the full-sugar version to make it look bad, I don’t think anyone will mind.Halve the sugar! Or not:Brown Butter and Toffee Chocolate Chip CookiesUsing chocolate wafers instead of chips is a cookie game-changer.View RecipeExplore Bon AppétitCookieSugarHealthyishRead MoreLifestyleI’m a Dietitian and I’m Here to Tell You You’re Not Going to Stop Eating SugarBy Dana NahaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Sarah Jampel"]}