{"id": "6960d0254ee9804d521cfd5a191e946e", "url": "https://www.bonappetit.com/recipe/tuna-salad-with-crispy-chickpeas", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Tuna Salad With Crispy Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueTuna Salad With Crispy ChickpeasBy Andy BaraghaniFebruary 9, 20214.7(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintTuna salad deserves more than to be dolloped on dressed greens for lunch. Some pan-fried chickpeas and the crunch from endive improve things tremendously.Ingredients2 Servings5Tbsp. extra-virgin olive oil, divided115-oz. can chickpeas, rinsed, patted dryKosher salt1small shallot, finely chopped2Tbsp. mayonnaise1Tbsp. Dijon mustard1Tbsp. red wine vinegarFreshly ground black pepper15-oz. can water-packed tuna, drained3red or other endive, halved crosswise, leaves separated½cup parsley leaves2Tbsp. (heaping) sliced pickled chiles½lemonPreparationStep 1Heat 3 Tbsp. oil in a large skillet over medium-high. Cook chickpeas, tossing occasionally, until crisp and golden brown, 6–8 minutes. Season with salt and let cool.Step 2Whisk shallot, mayonnaise, mustard, and vinegar in a large bowl; season dressing with salt and pepper. Mix in tuna, breaking up with a fork. Add chickpeas, endive, parsley, and pickled chiles. Finely grate zest from lemon over, then squeeze in juice. Pour in remaining 2 Tbsp. oil and toss to combine. Taste and season with more salt if needed.How would you rate Tuna Salad With Crispy Chickpeas?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleNice. Simple and the mustard gave the kick.HeikoGermany2/23/2022A great summer lunch! Shallot not necessary if not on hand. Leftovers go great on crackers the next day, and the dressing is good on anything!CharlotteLos Angeles, CA 7/9/2021This was a surprisingly awesome taste combination.  My husband practically licked out the bowl. The only change I made was to put in a medium-sized shallot that I sautéed first because neither of us can handle raw onions.  Terrific.TugHillNativeRoy, Utah5/31/2021So good! I make this like weekly. AnonymousBrooklyn, NY4/7/2021This is the best tuna salad I have ever had.  It is so easy to make and a great change from the usual boring tuna salad.AnonymousPA4/1/2021This was excellent! Used a variety of farmer market greens—butter head lettuce, green endive, and microgreens. Great, simple dinner.sbrooksh Takoma Park, MD3/16/2021Excellent — after some manipulation on my part. Great building blocks. Added sliced olives which were great as well as celery. Played quite a bit wth the dressing as it seemed a bit plain. Key was to also leave the tuna in biggish chunks. EssieDee Stamford ct3/16/2021I'm a massive fan of premium canned tuna just about every* way you can think of - classic tuna salad, stirred into hot pasta with olives and capers, Nicoise salad, the BA green goddess version - so I was excited to try this recipe.\n\nIt's superb! I had green endive so that's what I used, but that was better for me anyway as I often find red endive too bitter. I left out the pickled chiles because I didn't have them.\n\nMy only recommendation is to wait till the very end to stir in your tuna if you want it to stay in bigger chunks. I put it in halfway through as the recipe indicated and mine came out looking more like classic tuna salad heaped on greens with chickpeas. But I didn't mind at all from a taste/texture perspective, it was still fabulous.\n\nI'll absolutely make this again!\n\n*Not tuna casserole.KatieChattanooga, TN3/10/2021Ok, I’m impressed. I’m normally not a tuna girl, but this is so fresh, bright, savory, crunchy... it’s amazing. Just do yourself a favor and try it. I added avocado cause I had some leftover and it fit right in. Dang... I’m a tuna girl nowDallas, TX3/9/2021I didn't like endives before trying this, now I'm obsessed. I added some cumin to the chickpeas, complete game changer, this is definitely becoming a weekly lunchToasted NutsRomania3/9/2021What a great and simple recipe that lends itself to alterations. Just whipped this up on a whim during my lunch hour and made a few substitutions based on what I had. Subbed red onion for shallot, romaine leaves for endive, and dried oregano for parsley. Turned out so delicious and satiating. I really wish I had fresh herbs on hand (parsley, cilantro, etc.) and will definitely be making this again soon once I make a trip to the grocery.AnonymousColumbus, OH3/1/2021So easy, flavorful, and delicious. It is versatile to add your own spin on it too.  Love it, Andy.Katherine gChicago, IL2/27/2021Made this for a \"ladies who lunch\" birthday celebration, complete with champagne and it was a total hit!  Easy enough for every day, but elevated for any special occasion as well.DominiqueDenver, CO2/24/2021I can't believe how good this is for something so simple. I'm saving this one, definitely going to be a regular eat.Savannah B.Boise, ID2/24/2021Incredibly simple to make and incredibly flavorful. Truly one of the best renditions of tuna I've ever had. No question this will be added into the lunch mix. Anonymous2/22/2021Explore Bon AppétitSaladTunaFishSeafoodChickpeaBeanVegetableQuickEasyWeeknight MealsGluten-FreeHealthyishFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Andy Baraghani"]}