{"id": "69720ae33daa15ef970cb80765c0811f", "url": "https://www.bonappetit.com/recipe/hanger-steak-with-charred-scallion-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Hanger Steak with Charred Scallion Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueHanger Steak with Charred Scallion SauceBy Molly BazMay 22, 20184.7(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis sauce is an ode to the classic French dish of leeks in vinaigrette, swapping out the leeks for tender charred scallions. It acts as a bright, addictive condiment for this quick-cooking cut of steak. If you can’t find hanger steak, skirt steak works for this recipe—adjust cook time accordingly. The sauce also pairs well with roast chicken, pork chops...we could do this all day.Ingredients4 servings ½cup crushed or coarsely chopped walnuts1small garlic clove9Tbsp. extra-virgin olive oil, divided11½-lb. hanger steak, cut into 4 pieces, center membrane removedKosher salt, freshly ground pepper¾tsp. Aleppo-style pepper, plus more for serving12scallions5tsp. sherry vinegar or red wine vinegar1Tbsp. chopped cornichons1Tbsp. chopped drained capers1Tbsp. whole grain mustard¾tsp. chopped thymePinch of sugarFlaky sea saltPreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Transfer to a medium bowl. Finely grate garlic over warm walnuts and toss with 6 Tbsp. oil.Step 2Heat a large cast-iron skillet over medium-high. Season steaks with kosher salt and black pepper; sprinkle all over with Aleppo-style pepper. Rub with 2 Tbsp. oil and cook, turning occasionally, until deeply browned and an instant-read thermometer inserted into the thickest part registers 130° for medium-rare, 10–12 minutes. Transfer steaks to a cutting board.Step 3Wipe out skillet and reduce heat to medium. Place scallions and 1 Tbsp. oil in skillet, season with kosher salt, and cook, turning occasionally, until softened and deeply charred, about 4 minutes. Transfer to cutting board; trim and cut into 1\" pieces. Add to bowl with walnut mixture along with vinegar, cornichons, capers, mustard, thyme, and sugar and toss to combine; season with kosher salt and black pepper.Step 4Slice steak against the grain and sprinkle with sea salt. Serve with scallion sauce and more Aleppo-style pepper.Photo by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenHow would you rate Hanger Steak with Charred Scallion Sauce?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleHanger Steak, what Hanger Steak?   I  was excited to find Hanger Steak at the store,  and found this recipe.  I liked the idea of not marinating the steak and followed this recipe as written ,except for the use of Aleppo-style pepper,.  I couldn't find it.  So I used 1/2 tsp sweet Paprika and 1/4 tsp Cayenne Pepper.  I served  this with roasted potatoes. Everything about this dish is delicious. The sauce also on the potatoes... So, so , so good.  It is now in my recipe box.\n\nOkay, all that said... the Charred Scallion Sauce is definitely the star..  I have been obsessed.  So much so, I have made it on its own as part of a Charcuterie plate platter and have used leftover sauce to spice up snacks, including avocado toast..  Nothing like it!\n\nAnonymousSeattle, WA7/22/2021We didn't have walnuts last night, but we used hazelnuts instead. It was superb! The charred scallion sauce is really divine. I think we will keep this in regular rotation. katherinefromdcWashington, D.C.10/11/2020the charred scallion sauce was great!Anonymous7/28/2020I've made this recipe twice now and both times have LOVED the final product.  The charred scallion sauce is so delicious and really can be put on anything.  Last night I served it over a potato puree but any vegetable side would be perfect.  And the hanger steak is a delicious and underrated cut of meat.  Definitely something to keep in my arsenal of recipesAnonymousCalifornia5/29/2020Delicious! The crunch of the walnuts is wonderful and unexpected in this dish. The charred scallions is another fun touch. This has quickly become my boyfriends favorite meal I make. It’s simple yet impressive and super tasty!AnonymousCalifornia4/15/2020I have made this twice. Both times I have had friends raving about it. Simply this is one of the best recipes ever for just about anything. Haven't been able to make it exactly yet (missing capers and aleppo on respective attempts) but with a couple subs I have still managed to impress my flatmates. I took a couple pages out of Brad's book the second time I made it, because i subbed the aleppo actually for gochujang and decided to take it more eastern on a bed of rice with furikake,, and I loved it both ways. Having the video made this recipe super easy to understand and far more inspiring to cook, so id recommend doing so with more recipes. Thanks!Anonymousbristol1/12/2020My mom made this over the holiday at my request (I don't have the kitchen to deal with the smoke this creates) and it was phenomenal. She regularly switches up recipes, adjusting quantities of ingredients based on what's a better fit/taste, but she didn't touch this one at all. The only thing we had to change is cornichons as the store didn't have them (go figure) - we used dill pickle instead. Also, while the recipe says you can substitute the aleppo pepper with red pepper flakes, I wouldn't recommend it. The aleppo pepper is so key - it provides a warm heat as opposed to a fiery one. I feel like red pepper flakes would ruin the dish. All in all, I cannot wait to make this again!AnonymousChicago1/2/2020Oh my goodness, this sauce.  I made it for a group of friends and I caught one of my buddies in the kitchen spooning the leftover sauce into his face.\nI toasted the walnuts in the same cast iron pan that I used for the steak and scallions.  I also chopped up the scallions a lot once they came out of the pan, think slightly larger than relish. Didn’t have Aleppo pepper so I used cayenne. I also used bread and butter pickles because... we don’t have nice food stores where we live.  This is such a repeat.AnonymousHighland Falls, NY6/18/2019This was amazing. I used ny strip steaks instead of hanger and grilled the scallions (on a grill basket) and grilled the steaks as well. Served it with Ina garten’s grilled panzanella salad. This was easily one of my top ten favorite meals to cook at home. TX4/8/2019A bit on the salty side - maybe because of the cornichons and capers? It didn’t really do it for me. The steak also got a bit cold while waiting for the scallions to get charred.Anonymous2/20/2019Tried this last night... AMAZING. Wanted a little more spice on the steak so I swapped gochugaru for the aleppo and it worked brilliantly. Anonymoussan francisco1/26/2019I've made this about four times and I love it so much. Molly wasn't playing when she said that the scent of charred scallions makes you want to face-plant into it. The gherkins and the red wine vinegar give it an extraordinary bite. Honestly, even writing this review makes me want to make this again. I even featured this recipe on my cooking blog, Abby Cooks Stuff (abbycooksstuff.com). AnonymousSt.Charles, IL 1/7/2019I halved the recipe and used a strip steak and improvised a few other ingredients. Ground New Mexico Chile and pecans in place of walnuts and Aleppo pepper. It was really quick to make with flavors that are well balanced. I sliced the steak really thin and made it into a fresh pita sandwich. It lasted about 10 seconds. It’s definitely a weekday friendly recipe.AnonymousChicago10/31/2018This was a great recipe-I made it with a combination of skirt steak and hanger steak and it was delicious.  Wondering if the sauce could be made earlier in the day without losing flavor-did anyone try that?\nAnonymousNew york9/28/2018Doing a Whole30 this month, and this recipe was easily adaptable to make it compliant! YUM!AnonymousDallas, TX9/8/2018Explore Bon AppétitSteakBeefMeatScallionOnionVegetableWalnutNutEasyWeeknight MealsMainDairy-FreeGluten-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Molly Baz"]}