{"id": "6973b469ec166bf1156a681d8f34cdf4", "url": "https://www.bonappetit.com/recipe/pumpkin-hot-sauce", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Pumpkin Hot Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssuePumpkin Hot SauceBy Maricela VegaJanuary 12, 20214.3(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis spicy, velvety elixir works on everything from tamales to scrambled eggs, says Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora. The pumpkin holds tremendous meaning in Vega’s life as a spiritual reminder of Indigenous innovation and as a culinary staple. She uses as many varieties as she can find to produce an array of umami-rich pumpkin-based sauces. Mix in olive oil, vinegar, and honey to transform the hot sauce into vinaigrette, or simmer a cup with a can of coconut milk to start a curry-like sauce.IngredientsMakes about 3 cups12-lb. heirloom pumpkin or butternut squash6garlic cloves4oz. ginger, peeled, coarsely chopped¼cup apple cider vinegar¼cup fresh lime juice2Tbsp. fresh lemon juice2Tbsp. Allium Confit2tsp. Diamond Crystal or 1 tsp. Morton kosher salt2ají limo chiles or 1 small habanero chile, halvedPreparationStep 1Preheat oven to 425°. Place pumpkin on a large rimmed baking sheet and roast until tender (a paring knife should pierce flesh easily), about 1 hour. Let cool.Step 2Halve pumpkin through stem end; scoop out and discard seeds. Scoop 1½ cups flesh into a blender; reserve remaining pumpkin for another use. Add garlic, ginger, vinegar, lime juice, lemon juice, Allium Confit, salt, half of chiles, and ½ cup ice water and blend until very smooth and bright yellow. Taste and add remaining chile if you’d like a spicier sauce; season with more salt if needed.Step 3Do ahead: Hot sauce can be made 2 weeks ahead. Transfer to a jar; cover and chill.How would you rate Pumpkin Hot Sauce?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is far too ginger-forward for me, the pumpkin flavor is completely hidden.  I was really hoping it would taste like spicy pumpkin.  I have tried this on multiple foods and it just doesn't seem to pair well with anything to me.  JessicaPortland, OR12/22/2021So tasty and I love that I can keep the leftovers in the fridge for a couple weeks to make the most of it!AnonymousNew York3/9/2021Not for me. It's too gingery and, oddly, a bit cheesy? It also came out stringy, which I think is because I don't have a high-powered blender. I'll figure out something to do with it, but I wouldn't make it again.BrianNew York3/1/2021So. Freaking. Delicious. And gets better in the fridge overnight! Gonna keep this recipe forever. AmeliaArlington, MA1/27/2021Explore Bon AppétitCondimentSauceHot SaucePumpkinSquashVegetableButternut SquashEasyDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}