{"id": "6979e9c08c3e5af6c8f820943c5d67d6", "url": "https://www.bonappetit.com/story/sip-your-way-into-local-culture-at-andaz-bars-across-the-world", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Sip Your Way Into Local Culture at Andaz Bars Across the World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredSip Your Way Into Local Culture at Andaz Bars Across the WorldWhen exploring the authentic flavor of a city, start at the Andaz hotel bar.By Andaz Hotels and ResortsMay 31, 2019FacebookTwitterEmailPhotos by Andaz HotelsFacebookTwitterEmailThe moment you set foot at your Andaz destination, all five senses are awakened to the local culture, from the artwork that peppers thoughtfully designed interiors to the scent of seasonal spa treatments, right down to the smallest ingredients on the menu. But there’s one entry point at every Andaz hotel and resort—a host of sorts—designed to help you uncover all there is to see and do in your newly immersed city: the hotel bar. The unique and highly curated bar atmospheres at Andaz hotels and resorts, a concept by Hyatt, pique curiosity, offering a literal taste of what’s to come. From Savannah to Singapore, here are a few bars that will elevate your next trip from the first sip to the final bite.ContentThis content can also be viewed on the site it originates from.22 Square Bar mixologist prepares a cocktail at Andaz Savannah\nThe Soul of the City Starts at Andaz SavannahThe spirit of this coastal Georgia city echoes throughout Andaz Savannah, starting with 22 Square Bar. Upon arrival, guests are offered an ice-cold Georgia-brewed beer, like the Southbound Scattered Sun Belgian Wit or a Service Rally Point Pilsner. Inside the bar, an expert mixologist will be crafting seasonal cocktails using local spirits. Be sure to try the hotel’s signature drink, Going Down Proper, made with rye, orgeat, lemon, underberg; or with just a little direction, they’d be happy to show you some of that Southern hospitality and whip up a special bartender’s choice cocktail. Here, the art of the cocktail is as important as the taste itself, so sit back and enjoy the show.Andaz Savannah is located in the heart of the historic district, which means roaming the area attractions with a to-go cocktail is a must. Pop into City Market, which hosts everything from modern stores to farmers markets, art galleries, and restaurants. You may even catch the soulful sounds of live music filling the air. If water adventures are your thing, then hop a riverboat cruise for brunch, dinner, or one of their murder mystery cruises to learn about this antebellum city’s haunted past.View from Twisted Oak Winery, Napa ValleyA Wine-Country Dream Come True at Andaz NapaAt Mercantile Social in Andaz Napa, expect seasonal, farm-fresh foods like brisket meatballs, hand-crafted cocktails featuring local spirits, and some of the best boutique wines in Napa Valley. Andaz Napa has an exclusive partnership with John Anthony Family of Wines, providing you with a privately chauffeured Escalade and a host sommelier for the day to fulfill your every wine-tour wish.You’ll stop by Twisted Oak Winery, which overlooks the entire Napa Valley from the foothills of Mount Veeder, and taste a selection of FARM Napa Valley by John Anthony Cabernet Sauvignon. At the estate’s Church Vineyard, an iconic property built in 1886, sample Sauvignon Blanc in the rolling hills of Los Carneros with a picnic lunch from Thomas Keller’s Bouchon Bistro. Finish the day listening to a live concert at the JaM Cellars wine and music studio, then dine at the tasting room of Tarla Mediterranean Bar + Grill. Reservations are required for the $500 per person experience. Between the majestic views and the stellar wine portfolio, it’s one of the most idyllic ways to experience Napa.Mr. Stork at Andaz SingaporeRelax Among the Tropics at Andaz SingaporeAt Andaz Singapore, Mr. Stork is a calming retreat from the high-energy bustle of Singapore. Situated on the 39th floor with a 360-degree, unobstructed view of the city, this tropical-inspired rooftop bar houses 10 teepee huts set amid lush landscaping and cobbled paving that’s perfect for lounging—plus, an observatory corner is the optimal spot to soak up the view. If you prefer to kick off your shoes and relax, settle into one of the teepee huts and order a botanical cocktail.Inspired by the lush gardens within Mr. Stork, the menu offers a wealth of fruity and floral cocktails made from fresh fruits and garden herbs such as ginger, thyme, basil, mint, rhubarb, and lemon. Opt for a signature drink, like the Rhubarb, a fizzy and refreshing concoction of fresh rhubarb purée, strawberry, lemon juice, sparkling wine, and a shot of vodka; or try Ruby, a citrusy drink served in an elephant mug, made with lemon, ginger, fresh mint, and vermouth. For something even more unique, order a Ceylon Arrack, a traditional Sri Lankan spirit distilled from the sap of the coconut flower and aged in Sri Lankan oak casks, or try Andaz Pale Ale, a hyper-local brew on tap, created as a special collaboration with local microbrewery RedDot BrewHouse, exclusive to Andaz Singapore.Sotavento Cocktail at Andaz Mayakoba Resort Riviera MayaMelt the World Away at Andaz Mayakoba Resort Riviera MayaAt Andaz Mayakoba Resort Riviera Maya’s beachside Sotavento, which means “where the wind takes you,” you’ll feel as though you’ve been swept away to a storybook scene, surrounded by spectacular views of the Caribbean Sea. Drenched in sun at every corner, this tropical bar and restaurant is dotted with canopies under which you can enjoy everything from freshly grilled lobster tail and spicy oysters to steak tartare with prosciutto.The bar is inspired by a shipwreck that washed up on the Mayakoba shore, infusing the space with the feeling that, in Riviera Maya, unexpected treasures lie at every turn. Of course, no beachside adventure is complete without an all-star lineup of bright, fresh, and fruity cocktails. With the ocean breeze in your hair and the sun at your shoulders, enjoy their signature namesake cocktail, made of Aperol, Ron Blanco white rum, Angostura bitters, limón amarillo, oleo-saccharum, and calabaza syrup.M’Uniqo at Andaz Munich Schwabinger TorRelish Regional Flavors at Andaz Munich Schwabinger TorHigh design meets even higher elevations at M’Uniqo, the bar at Andaz Munich Schwabinger Tor, where the menu draws inspiration from areas neighboring the Bavarian capital, such as the Alps and Italy. At Munich’s highest bar and rooftop terrace, you can expect a Venetian-style concept, featuring cicchetti, or small snacks, and antipasti for the food. Be it a pizzette with artichokes, olives, fennel, and rosemary, or a small plate of crispy sardines, polenta, saffron, and lemon, regional favorites abound on this eclectic menu.From the wine list, savor a red from Tuscany or enjoy a Grüner Veltliner from nearby Austria. If cocktails are your beverage of choice, choose one of their many unique creations like the Horse’s Neck, with rye, organic ginger ale, lemon, and bitters––or you could level up on local libations. The bar’s mixologist Chris Schmidt-Sanchez infuses vermouths with local herbal ingredients to ripen and take on different fragrances, creating an immersive cocktail experience like nowhere else.No matter where you choose to explore next, there’s an Andaz destination to take your taste buds on an authentic, local adventure. Discover locations around the world at andaz.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-31", "author": ["Condé Nast", "Andaz Hotels"]}