{"id": "698731418363a544278b0143085aa305", "url": "https://www.bonappetit.com/story/covid-mask-lanyards", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Anyone Who Is Eating in Restaurants Right Now Needs a Mask Lanyard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAnyone Who Is Eating in Restaurants Right Now Needs a Mask LanyardYour napkin is not a mask.By Maddy Sweitzer-LammeMay 11, 2021FacebookTwitterEmailPhoto by Isa Zapata, styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Of all the awkward choreographies we’ve learned in the past year, my least favorite by far is the unwieldy dance of fumbling for my face mask whenever I see a server approaching my table. Even though in Philadelphia, where I live, it’s not a requirement to be masked when interacting with servers, to me it’s a matter of simple human decency. Being in close proximity to many, many people is their livelihood, and if I’m going to eat out, showing my respect for restaurant workers’ health and well-being is a no-brainer (as is tipping heavily).To mask up quickly, there are a few moves that have emerged: First, there’s the Chinstrap, wherein the mask gently cups the bottom of the wearer’s face, like some sort of misguided facial hair. There’s also the Ear Hang, wherein the mask is unhooked from one ear and dangles from the other. The Lap Grab involves the diner retrieving the mask and quickly putting it on at the first sign of a server. Reaction time inevitably slows as the wine flows. Worst of all is the Napkin Bandit, where the unmasked diner panics and covers their face with their napkin—a napkin that a back waiter will later have to clear.All of these moves are cumbersome and mildly embarrassing. As an alternative, I’ve started using mask lanyards, which have quickly become my number one pandemic accessory. A mask lanyard is a simple gadget—just a cord that clips onto the loops of a mask so that it dangles around your neck when you slip it off. Think Croakies, but for your mask. My favorite mask, this adjustable canvas number from Tom Bihn, has a built-in lanyard, but for any of my other masks, I just attach one of these sleek chains from the Etsy shop Sun Stori. Sun Stori’s founder, nine-year-old Tori Taylor, also makes customizable beaded lanyards that allow you to broadcast sentiments like “VACCINES R SAFE” or “NO CHINSTRAPS.”Slinging a mask around my neck is far more efficient than sticking one in my pocket or digging around in my purse in a panic when I arrive at the grocery store and realize I didn’t grab one from the hook by the door. As an added bonus, a chain or beaded mask lanyard adds a little glamour to my otherwise sweatshirt-heavy wardrobe. The compliments I receive alone make it worth the price of admission. They’re so cute, in fact, that I’ve noticed members of my household stealing my lanyards for their own use. I recommend ordering extras.With my lanyard dangling around my neck, I’ve eliminated the terrible mask choreography that I’ve hated for as long as I can remember (or since March 2020, which is the same thing). Even now that I’m vaccinated, I anticipate that I’ll be popping my mask on and off during a restaurant meal for a while longer. During a time of ever-changing safety guidelines and patchwork vaccination rollouts, it’s never felt more important to indicate to servers I understand that hospitality is a two-way street—and if I can do that with a little sparkly accessorizing, all the better.Photo by Isa Zapata, styling by Nicole LouiePersonalized Mask Lanyards$10 at EtsyExplore Bon AppétitShoppingHighly RecommendCoronavirusRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-11", "author": ["Condé Nast", "Maddy Sweitzer-Lamme"]}