{"id": "698d9399944680033f52b04c85ac3eaf", "url": "https://www.bonappetit.com/recipe/crispy-rice-cakes-with-halloumi-cheese-and-gochujang-brown-butter", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Crispy Rice Cakes With Halloumi Cheese and Gochujang Brown Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Rice Cakes With Halloumi Cheese and Gochujang Brown ButterBy Susan KimDecember 10, 20214.7(31)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThis crispy-salty-spicy rice cake dish frequently makes an appearance on the menu at chef Susan Kim’s Korean food pop-up, Doshi. She blisters Korean rice cakes, or tteok, until they’re toasty and crisp with chewy insides, then pairs them with seared, melty Halloumi cheese. The combination of nutty brown butter and spicy-sweet gochujang will have you dragging your rice cakes across the plate to mop up every last bit of sauce. You can find prepackaged Korean rice cakes in the refrigerated section at any Korean market or well-stocked Asian grocer. You might find they come in all shapes and sizes, from long cylinders to thin ovals. Any shape will work in this recipe, but it’s especially delicious prepared with rice cakes that come in 2\"–3\"-long cylinders, which excel at achieving a crispy exterior while staying chewy and soft on the inside. If you have any brown-butter-gochujang sauce left over, spoon it over fried eggs and yogurt the next morning—one of Kim’s favorite breakfasts.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonSlotted Spoon$13 $10 At AmazonSmall Saucepan$155 At AmazonWhisk$10 At AmazonIngredients4 servings12oz. Korean rice cakes, preferably cylindrical (about 50)2large eggs4Tbsp. unsalted butter1large garlic clove, finely grated2Tbsp. gochujang (Korean hot pepper paste)1Tbsp. gochugaru (coarse Korean red pepper powder) or other mild red pepper flakes1Tbsp. unseasoned rice vinegar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt4cups mature arugula, leaves torn if large, divided3Tbsp. vegetable oil4oz. Halloumi cheese, cut into ½\"-thick planks (about the same size as rice cakes)PreparationStep 1Soak rice cakes in a medium bowl of cool water at least 1 hour and up to 12 hours. Drain and pat dry with a kitchen towel; set aside.Step 2Using a slotted spoon, carefully lower eggs one at a time into a small saucepan of boiling water. Cook, adjusting heat to maintain a gentle boil as needed, 6½ minutes. Transfer eggs to a bowl of ice water and let sit until just slightly warm, about 2 minutes. Peel eggs, cut in half, and set aside.Step 3Cook butter in a small saucepan over medium heat, occasionally swirling pan, until butter foams then browns, 3–5 minutes. Remove from heat and immediately whisk in garlic, gochujang, gochugaru, vinegar, salt, and 2 Tbsp. water. Reduce heat to low and keep sauce warm.Step 4Arrange about 3 cups arugula on a platter or large plate.Step 5Heat oil in a large skillet over medium-high. Cook rice cakes in a single layer, undisturbed, pressing down occasionally with a spatula to ensure they are making good contact with pan, until golden brown and crisp, about 5 minutes. Turn over and cook until golden brown on the other side, about 5 minutes. Transfer rice cakes to platter with arugula; reserve skillet.Step 6Reduce heat to medium and cook Halloumi cheese in reserved skillet until deep golden brown, about 30 seconds per side. (It’s okay if some pieces break apart.)Step 7Arrange cheese on platter with arugula and rice cakes. Top with remaining arugula and reserved jammy eggs. Spoon warm sauce over.How would you rate Crispy Rice Cakes With Halloumi Cheese and Gochujang Brown Butter?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis recipe is absolutely incredible and comes together pretty quickly. The contrast between the crispy rice cakes, squeaky halloumi, and fresh greens is a perfect harmony. My favorite part is the sauce. I’m so obsessed with it that I now scale it up and put it on just about everything.  Anonymous3/6/2022This was incredible. Soaked the rice cakes for one hour and they were excellent once fried. Nothing left on anyone's dinner plates. Cannot wait to make this again.ashMaryland2/27/2022I'm assuming this recipe uses dried rice cakes, but it doesn't specify. The cylindrical ones also come frozen, in which case I'd assume they don't need soaking....That might be a good detail to add to this recipe for clarity. AnonymousMissoula MT2/4/2022One of my standard breakfasts is arugula topped with soft boiled eggs and gochujang, so this dish was certainly up my alley. I used half of the package of rice cakes and that gave me a good ratio of salty, crispy/chewy, green, etc. I'm excited to make this again. AnonymousPNW1/6/2022Very tasty! Not sure how many people this is intended to serve, we guessed 2 as there are 2 eggs -- however we found this to be a lot of food for just 2 people (specifically the amount of rice cakes). We tossed the rice cakes in the dressing prior to mixing it with the greens and it was excellent.\n\nWould definitely make again -- though, 1/2 the amount of rice cakes, and add some more vegetables :PAnonymousNew York, NY12/21/2021After soaking rice cakes for a few hours, the frying left them tough and inedible.  The halloumi which I’ve made before did not come out meaty/chewy and the sauce didn’t tie the dish together. Didn’t work for me AnonymousSanta Monica CA12/20/2021Explore Bon AppétitDinnerMainKoreanEast AsianAsianHalloumiCheeseKorean Rice CakeNoodlePasta & NoodlesArugulaLeafy GreensVegetableFryVegetarianNut-FreeGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-10", "author": ["Condé Nast", "Susan Kim"]}