{"id": "699adb99035080e75dba7ef9e7d81e1d", "url": "https://www.bonappetit.com/recipe/vegetarian-enchiladas", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Vegetarian Enchiladas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian EnchiladasBy Sarah JampelMay 17, 20194.9(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintGiving the tortillas a dip in hot oil not only makes them pliable (they won’t tear apart as you roll them up), but it also improves their flavor and texture (read: they won’t disintegrate into mush). This is especially important if you’re using slightly dry or very thin tortillas. If you’re using fresh, high-quality tortillas, you can skip the fry: Just warm up each one in a dry skillet.Ingredients4–6 servingsCharred Salsa Verde1½lb. tomatillos, husks removed, rinsed1medium onion, peeled, cut into 8 wedges6–8large poblano chiles (about 1½ lb. total)2serrano chiles6garlic cloves, unpeeled3Tbsp. extra-virgin olive oil, divided1tsp. kosher salt, plus more1cup cilantro leaves with tender stems½tsp. ground cuminFilling and Assembly1medium onion2Tbsp. plus ⅔ cup extra-virgin olive oil½tsp. ground cumin2garlic cloves, finely chopped1bunch curly kale (about 9 oz.), stems removed, leaves finely choppedKosher salt115.5-oz. can pinto beans, drained, rinsed4oz. coarsely grated Monterey Jack cheese (about 1 cup), divided125\"–6\" corn tortillas2oz. coarsely grated Cotija (about ½ cup)Cilantro leaves, lime wedges, sliced avocado, and hot sauce (for serving)PreparationCharred Salsa VerdeStep 1Place a rack in top third of oven; heat broiler. Place tomatillos, onion, poblano chiles, serrano chiles, and garlic on a foil-lined rimmed baking sheet (it’s okay to pack them close together). Drizzle with 2 Tbsp. oil, season with salt, and toss to combine.Step 2Broil vegetables, rotating pan and turning chiles halfway through, until charred and blistered all over, 13–18 minutes. Watch closely, as broilers vary wildly, and widely, in intensity.Step 3Transfer poblano chiles to a small bowl. Cover with a towel or plastic wrap and let sit 5 minutes. Peel off skin with paper towels (don’t worry about getting every last bit). Remove stems and seeds, then finely chop 3 chiles; set those aside for assembly.Step 4Transfer remaining vegetables to a blender, removing stems from serranos and squeezing garlic out of skins. Add cilantro, cumin, 1 tsp. salt, ¼ cup water, and remaining 1 Tbsp. oil. Blend until a smooth, homogenous sauce forms; you should have about 5 cups. (If your blender is small, work in batches.) Season with salt.Step 5Do Ahead: Salsa verde can be made 3 days ahead. Transfer to an airtight container and chill. If it thickens, add 1 tsp. water at a time until you have a thinner, pourable consistency.Filling and AssemblyStep 6Preheat oven to 350°. Finely chop half of onion. Cut the other half into thin half-moons and set aside for serving.Step 7Heat 2 Tbsp. oil in a large skillet over medium. Add cumin and cook, stirring, until toasty and fragrant, about 30 seconds. Add finely chopped onion and garlic and cook, stirring frequently, until softened, 3–4 minutes.Step 8Add kale, stir to coat in oil, and season with salt. Reduce heat to low and stir in ½ cup water. Cover pan and cook until kale is wilted and tender, 8–10 minutes. Uncover and continue to cook, stirring frequently, until water is evaporated, about 1 minute. Add beans and reserved chopped poblano chiles and cook, stirring occasionally, until heated through, 2–3 minutes. Transfer to a large bowl and let cool slightly. Add ¼ cup salsa verde and ½ cup Monterey Jack cheese and stir to combine. Season with salt; set filling aside.Step 9Wipe out skillet. Heat remaining ⅔ cup oil in skillet over medium-high until hot. Working one at a time, fry tortilla, turning once and reducing heat if oil sputters, until puffed and slightly browned, about 10 seconds per side. Transfer to a paper towel–lined baking sheet or plate and repeat with remaining tortillas.Step 10Spread ½ cup salsa verde in a 13x9\" baking dish. Pour some salsa verde into a shallow bowl or pie plate. Working one at a time, dip tortilla into salsa verde in bowl to coat both sides. Transfer to a plate, then place a heaping ¼ cup filling into the center. Roll up and place seam side down in baking dish. Repeat until you’ve used all 12 tortillas (it’s fine to arrange them very tightly in the pan). Pour remaining salsa verde over.Step 11Cover pan with foil and bake enchiladas 15 minutes. Uncover pan, sprinkle Cotija and remaining ½ cup Monterey Jack cheese over, and continue to bake until cheese is melted and sauce is bubbling, 12–14 minutes.Step 12Serve enchiladas topped with cilantro and reserved sliced onion, with lime wedges, avocado, and hot sauce alongside.How would you rate Vegetarian Enchiladas?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleSo delicious did not miss the meat at all. Used Rancho Gordo beans instead of canned.. incredible. TrinaTorrance, CA3/2/2022I've been making this the last 2 years and love it- never fails! Sometimes when I'm wicked lazy and can't find tomatillos, I use a store-bought enchilada sauce or salsa verde and broil a few poblanos in the oven for the filling. This recipe is so fool-proof and I love it as leftovers. Had to share the joy!EricaSan Francisco5/13/2021Really yummy and easy to follow instructions! I definitely skipped making the salsa (it was Monday night, after all), and used a bottle of Herdez Salsa Verde. Otherwise, every other step was followed exactly, and I got dinner on the table in about an hour! So yummy and delicious!Darlisa A.Los Angeles, CA4/27/2021I've made this a number of times and love how it sneaks in the kale and still tastes like a splurge. The technique provided works spot on. You might want to make extra salsa because it's damn delicious (and will go well with chips!).Laura BNashville, TN2/1/2021Sauce was a bit too bright for my taste, but overall pretty good!Anonymous12/30/2020This was my second time making this dish. First time I cheated and bought two bottles of charred salsa verde. The enchiladas turned out  really delicious and had some serious heat. Second time around, I decided to make the salsa verde sauce-I was in the kitchen for a really long time as this dish is indeed very time consuming. Overall, a very tasty dish and don’t skimp on frying the tortillas!! AnonymousManhattan, NYC6/12/2020I try not to be \"that commenter\" with 1000 substitutions, but I found this recipe to be a great blueprint that I modified to work with what I had on hand. Hopefully these modifications help inspire someone else who wants to make this delicious recipe but doesn't have everything that's called for.\n- For the salsa, I had about 3.5 cups frozen salsa verde leftover from making J. Kenji López-Alt's No-Waste Carnitas with Salsa Verde, so I just used that, and the amount seemed sufficient. This salsa has pork drippings in it, so this dish was veg-forward but not vegetarian.\n- Instead of kale, I blanched an equal amount of red chard from my garden and skipped the steaming/softening step.\n- For the beans, I cooked some dry Rancho Gordo yellow eye beans with an onion that I had softened in bacon drippings.\n- I didn't have poblano peppers, so I used a clamshell of padróns and broiled them for the filling (didn't peel them, though).\n- I didn't have cotija, so I used some queso fresco which surprisingly shredded quite nicely.\n\nAll this is to say that, as a formula for making very delicious enchiladas, this recipe is a success. I have always failed at making enchiladas in the past, and the method of frying the tortillas before dipping in salsa was very helpful - I only ripped one!AnonymousOakland, CA5/26/2020I've made this twice and would be happy if I could eat it everyday for the rest of my life. However, if you are looking for a simple enchilada recipe, this is not it. Just know what you are getting yourself into. It's a bit time consuming. I suggest making the salsa ahead of time. Also is a good way to sneak kale into a dinner! Anonymous5/26/2020Absolutely delicious! Takes a lot of time to make but also makes a large amount so it fed our family of two for a week!Anonymous750675/16/2020These were AWESOME. Pre-prepped the sauce and it came together pretty quickly for dinner. Def serve with sour creamAnonymousDenver5/8/2020Make the sauce ahead of time and make extra, this recipe takes a while to make! Great flavors but sauce was a little too bright for my taste (maybe my tomatillos were not ripe?) Reserved some sauce and blended with avocado and sour cream for a mild avocado crema to top enchiladas. Also added pickled red onions on top, since I had some already.AnonymousDallas5/6/2020I made these last night and they were the BEST!  I usually don't fry up my tortillas, but I feel like this really helped them not get mushy. My mom used to do this, but I tended to skip the step, I won't do that again.  The sauce was wonderful, I even had about two cups leftover, I have plans for it.  I have been cooking my way through on appetite during this COVID season, and it was another recipe that did not disappoint.  Definetly making this again!tostoCorpus Christi, Texas5/6/2020Only complaint is that for the amount of time (and dishes - yikes!) spent on the recipe the salsa is the real stand-out flavor. The enchilada filling added bulk to the dish, but little else. Not to minimize the salsa, however; it was punchy, fabulous, and something I was proud to make. AnonymousALABAMA5/6/2020Great recipe, I really enjoyed the sauce!haleyyoungBoulder, co5/4/2020Love Christina's recipes and her writing. Stellar all around!kimberozCanberra Australia5/2/2020Explore Bon AppétitCasseroleMexicanLatin AmericanPoblano ChileChileVegetableSerrano ChileTomatilloKaleLeafy GreensMonterey JackCheeseCotijaPinto BeanBeanMainNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Sarah Jampel"]}