{"id": "69a346c7892c2a01cbafc35930e44af5", "url": "https://www.bonappetit.com/story/gajar-ka-halwa-diwali-dessert", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Gajar Halwa: The Diwali Dessert That’s Better Than All Other Fall Desserts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Sweet Carrot Diwali Dessert I’ll Take Over Pumpkin Spice This FallGajar ka halwa is a simple Indian dessert of grated carrots stewed down into a pudding with sugar, cardamom, and milk. I swear it’s better than carrot cake.By Priya KrishnaNovember 7, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.For lots of people, fall means apple pie and pumpkin spice everything. For myself and Floyd and Barkha Cardoz, who own Bombay Bread Bar in New York, it means gajar ka halwa.Gajar ka halwa (gajar means “carrot” in Hindi, “halwa” is the name of the porridge-like texture) is a simple Indian dessert of grated carrots stewed down into a pudding with sugar, cardamom, and milk. Because carrots are an autumnal vegetable, the dish is typically made in the latter months of the year, and it is one of the best-known sweets associated with Diwali, the Hindu festival of lights, which happens to be today. Happy Diwali!Barkha grew up in Bhopal, north of Mumbai, where you can get what Floyd calls “halwa carrots,” a varietal known for their deeply red color and sweet flavor without bitterness. Through the fall and winter months, there was always carrot halwa in Barkha’s house.I didn’t grow up in Bhopal. In Texas, our carrots were so-so, but my family ate gajar ka halwa every time fall rolled around. The night before Diwali, my mom could be found standing over the stove, carefully stirring the milk in a big pot to prevent it from curdling, crushing cardamom pods in her mortar and pestle, and folding in the carrots. Every so often she’d taste them to see if they’d attained that signature halwa velvetiness. After we’d finish doing the Diwali prayers as a family, we’d each house at least two bowls of mom’s gajar ka halwa, still warm and redolent of cardamom and coziness. It was a rare, special treat.Gajar ka halwa, I firmly believe, is the perfect fall dessert. It is fragrant and rich, but you can eat bowls and bowls of the stuff. I love the way the warm milk coats my tongue, and how the carrots become luscious, giving off a slight taste of earth amidst all the sweetness. There are other types of halwa—made with semolina or mung beans—but gajar ka halwa is the most iconic. “It’s like looking at carrot cake in a whole different light,” Floyd says. “This is much more interesting and exciting.”Perhaps most important, gajar ka halwa is straightforward to make. Can you stir? You can make gajar ka halwa. The whole dish happens in one pot, there are very few ingredients involved, and if you’re really feeling lazy, you can even buy your carrots pre-grated. (But…come on. Grate your own carrots, people.)Now that the Cardozes lives in New Jersey and can’t access those supernatural carrots from Bhopal, Barkha has come up with a few tricks for making her recipe extra special. She’ll add saffron to boost the color of the carrots, as well as nuts at two different points: while the carrots are stewing, so they get a little soft, and right on top of the finished halwa, for crunch. She also incorporates dried fruits, which provide tartness and color.Barkha eats her gajar ka halwa with roti, a wheat-based Indian bread. “The savory roti intensifies the sweetness of the halwa,” she explains. “It is heaven.” Sometimes, her mother would whip up some cream and drizzle it on top. Floyd says he’ll have his with vanilla ice cream. He also plans to serve it at Bombay Bread Bar this whole week (the dish pictured above), as a nod to Barkha, who is in India for Diwali.I’m a gajar ka halwa purist. I take mine straight—no nuts or fruits or anything. I like being able to taste the pure carrot-y flavor. Give me a scoop of hot halwa in one of my late grandmother’s stainless steel bowls (their small size is ideal for a single serving, and they keep the halwa warm), with the classic Hindu hymn “Om Jai Jagdish Hare” playing off of YouTube on my dad’s ancient grey Dell laptop. Tonight, I’m back in Dallas on Diwali night, unearthing our tattered copy of the Bhagavad Gita, which for years has been wrapped in an old checkered shirt from my dad’s childhood. I’m lighting diyas (lamps) with my mom to take around and bless every room of the house, including the bathroom, where my dad would loudly pray for “good shits” every year. I’m a happy camper.Here’s how to make Barkha’s gajar ka halwa:In a large, deep pot on medium heat, melt 8 tablespoons of ghee (or a stick of unsalted butter), and add 2 crushed cardamom pods and 4 cups of grated carrots (about 10-12 carrots). Cook, stirring constantly, for 12-14 minutes, until the carrots have wilted, and their liquid has evaporated.Add a half gallon of full-fat milk to the pot, plus a cup of heavy cream, and (optionally, if you want a deeper color) 8 strands of saffron that have been soaked in a little water. Let cook, stirring occasionally, on medium heat until most all of the liquid has cooked down, about 20-25 minutes.Add a handful of raisins and/or roughly chopped nuts (almonds, cashews, and pistachios all work great) if you’d like, reduce the heat to low and cook, stirring constantly, until the milk has completely been absorbed by the carrots, and the carrots have become soft and velvety, 5-7 more minutes.Add ¾ cup to 1 cup of granulated sugar, and on low heat, stir constantly for about 10-13 more minutes, until the sugar has completely dissolved.Garnish with more roughly chopped nuts, if you’d like.Explore Bon AppétitIndianishDiwaliCarrotDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Priya Krishna"]}