{"id": "69baecaf776d2f46aa7fdcb91becdad2", "url": "https://www.bonappetit.com/recipe/fried-bread-panzanella-with-ricotta-and-herbs", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Fried-Bread Panzanella with Ricotta and Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueFried-Bread Panzanella with Ricotta and HerbsBy Drifters Wife, Portland, MEAugust 14, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Elizabeth CecilEmailPinterestPrintEmailPinterestPrintDrifters Wife Chef Ben Jackson amps up traditional panzanella by frying thick slices of bread in olive oil on only one side, achieving a magical combination of crisp and soft that soaks up all the tomato juices without getting soggy. Drifters Wife in Portland, ME, is our No. 9 Best New Restaurant 2018.Ingredients4 servings 6oz. fresh ricotta, preferably sheep’s milk6Tbsp. extra-virgin olive oil, divided, plus more for drizzlingFlaky sea saltFreshly ground black pepper2large heirloom tomatoes, cut into 1½\" pieces½small shallot, finely chopped½small garlic clove, finely grated½cup basil leaves¼cup parsley leaves with tender stems1Tbsp. red wine vinegar21\"-thick slices sourdough breadPreparationStep 1Mix ricotta and 2 Tbsp. oil in a small bowl; season with salt and pepper.Step 2Toss tomatoes, shallot, garlic, basil, parsley, and vinegar in a medium bowl; season with salt. Heat 4 Tbsp. oil in a skillet large enough to fit bread in a single layer over medium. Fry bread until deep golden brown on one side, about 4 minutes. Transfer to a cutting board, sprinkle fried side with salt, and cut into 1½\" pieces. Toss into tomato mixture.Step 3Spread ricotta mixture over plates and top with salad; drizzle with more oil.How would you rate Fried-Bread Panzanella with Ricotta and Herbs?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe perfect use for peak summer tomatoes! Made this for dinner last night and it was great. I mixed the ricotta in instead of spooning it onto the plate and putting the salad on top, which was good. I don't think I'll be able to have panzanella without fried bread from now on. So good. AnonymousBerkeley, CA8/5/2019Hi! I made this and it was delicious but I omitted the parsley bc A: I don’t think it would add/mix well with other flavors and B: based on the photo there’s clearly no parsley in this. The photo looks like chives. Can you clarify for me so I make it right the next time? Thanks! AnonymousLos Angeles 10/17/2018Explore Bon AppétitSaladItalianEuropeanRicottaCheeseTomatoVegetableBasilHerbs & SpicesShallotSummerEasyQuickSideVegetarianNut-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Drifters Wife", "Portland"]}