{"id": "69c007b819cbb6b09e8d4d1df28bfa37", "url": "https://www.bonappetit.com/story/oven-barbecued-chicken-no-grill-required", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Oven-Barbecued Chicken? It's Not Only Possible—It's DELICIOUS | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSticky, Fall-Apart Oven-Barbecued Chicken—No Grill RequiredThese oven-barbecued chicken thighs are saucy, ultra-tender, and you 100% don't need a backyard to make them.By Christina ChaeyAugust 14, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailI've had very little desire to use my under-the-oven broiler drawer, which is how over the years it has become the single scariest place in my apartment. But when I saw this brand-new recipe for Oven-Barbecued Chicken, I knew I had to face my fears. Because, you know, there's only one person who can convince me it's worth unleashing my oven's most fiery flames on my non-air-conditioned kitchen in the middle of August: Claire Saffitz, senior food editor and the genius mind behind the latest Basically recipe. And when she says turn on the broiler, I turn on the broiler.Like any good disciple of the Bon Appétit Test Kitchen, I've been exclusively searing chicken thighs in a skillet on the stove for literally as long as I've been cooking chicken thighs (something I did not do before I started working here, TBH). However, Claire's recipe skips the stove entirely. Instead, the thighs and drumsticks get all fall-apart tender in a 350°F oven, then get finished with a few painted-on layers of barbecue sauce and quick blasts under the broiler until they're sticky and deeply burnished and charred in spots, just like if they came off a grill.Would you look at THAT???\nPhoto by Caleb AdamsClaire also tackles the problem I have with a lot of barbecue chicken recipes, which is that once you get past the initial flavor punch of the sauce itself, the chicken can be kinda...meh. Enter the stupid-simple spice rub that coats these chicken thighs before they initially go in the oven. It's nothing more than salt, brown sugar, cumin, pepper, paprika, and garlic powder mixed together, it never goes bad (so you should make a bunch at once!), and you hardly need me to tell you that it would also be excellent on a pork shoulder or a skirt steak. And then there are those onions! The thinly sliced onions that roast underneath the spiced chicken thighs are juicy, sweet, caramelized, and make me wonder why I'd never thought to roast large batches of onions in the oven before.You're pretty much good to serve this chicken in a pile of those glorious onions and some steamed rice or roast potatoes. I have a penchant for extra-ness, so I opted to take things a notch further by turning the thighs into fat barbecue chicken sandwiches. I let the chicken cool slightly, then shredded the meat and mixed it with all of the onions and a bit more of the vinegar-barbecue sauce. I served this with buns, pickles, pickled pepperoncinis, and a quick shredded cabbage salad tossed with herbs, lime juice, and salt. We devoured them, but the leftover chicken we dug into with our hands after the sandwiches had gone were, in my opinion, the best part of the meal.Get the recipe:Oven-Barbecued ChickenNo backyard? No problem. All the sticky-sweet goodness of barbecued chicken without having to leave the house.View RecipeExplore Bon AppétitChickenBarbecueBasicallyRead MorecookingThe Skirt Steak Recipe I Can Cook Even on My Old, Cheap Gas GrillBy Carey PoliscookingThis Salmon Niçoise Salad Is a Weeknight Dinner Party DunkBy Sarah JampelcookingThis Is How I'm Cooking Chicken Thighs From Now OnBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Christina Chaey"]}