{"id": "69cf0f8333a78f40989e95a82c021ae2", "url": "https://www.bonappetit.com/story/angie-mar-butcher-and-beast", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Angie Mar’s Cookbook 'Butcher and Beast' Is a Giant Middle Finger to All Other Cookbooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAngie Mar’s Cookbook Is a Giant Middle Finger to All Other CookbooksCleavage, taxidermy, and dangling cigarettes. ‘Butcher and Beast’ is the cookbook that refuses to tone it down. By Alex BeggsOctober 21, 2019FacebookTwitterEmailPhoto by Johnny MillerFacebookTwitterEmailIt’s all fun and games until the taxidermied skunk’s leg breaks. Well, “Patricia glued it back on,” Angie Mar told me. That would be the New York chef’s assistant, Patricia Howard, who sourced a menagerie of previously living props for Mar’s new not-exactly-a-cookbook, Butcher and Beast. On page 117 Mar descends the steps of her subterranean West Village restaurant, the Beatrice Inn, wearing a fur coat and Louboutins, bottle of Champagne in one hand, beady-eyed skunk on a leash in the other. The message is: None of us is going to make it out of here alive, pour the Champagne.Skunk alert. \nPhoto by Johnny MillerButcher and Beast feels more like an art-photo-fashion kind of book than one to actually cook from. The recipes seem to sigh on the page, You really gonna make that? Bone marrow crème brûlée, really? There’s cleavage galore, dangling cigarettes, and a lotta leg. The photos are nocturnal Polaroids by the photographer Johnny Miller; every shot seems snapped from a blowout New Year’s bash. Taxidermy drops in among the freshly shot deer and tied-up squabs headed to the oven.“Am I wrong,” I asked Mar, “or is this book a giant ‘fuck you’ to every other cookbook?”“You’re absolutely not wrong.”“Is it sexist of me to say something about the cleavage?”“No! Food should be sexy. Food is sensual. It’s not about just what we taste. What does it look like when it comes out, who are the people eating it, sitting around the dinner table, the lighting, music, smells in the air.”To illustrate the recipe for wild boar tagliatelle, Mar borrowed a boar’s head from Pat LaFrieda, where it lives on the wall in his office.\nPhoto by Johnny MillerMar was supposed to write a cookbook on Sunday entertaining, big roasts and all that, and then six years went by. Wholesome Sunday dinner wasn’t reflective of her real life, which was spent in the restaurant late into the night, and also included cigarettes, champagne, and stilettos.“Our book will not look like every other book,” she remembers thinking. “It won’t be this sugar-coated version of how things are. This restaurant isn’t sugar-coated. It’s not for the faint of heart. It’s wild, it’s New York, it’s old New York—the New York that’s dying right now,” she said. It would be provocative and unapologetic. You can imagine how that went over with the book’s editor. “We fought a lot of battles to get it published,” Mar said. She was willing to give back her advance and take the book elsewhere, but she in the end, didn’t have to.There was a food stylist (norm for a cookbook) and a clothes stylist (not the norm). Annebet Duvall pulled Chanel, Zimmerman, and wham-bam jewelry that came with a security guard who watched over days of photo shoots. Without the designer dress-up, “it wouldn’t have been such a true representation of how we live here, what dinner is like around our tables,” Mar said. In one shot in a walk-in fridge with a tuxedoed Pat LaFrieda (famed New York butcher and Mar’s meat mentor), she wears a “very Jessica Rabbit” black, slinky Alexandre Vauthier evening gown (pictured below). On the cover she’s posed in the Bea’s kitchen in a fluffy ostrich feather Oscar de la Renta bustier with silk pants. The most memorable look, second to skunk, is a poofy hot pink vintage Stella McCartney dress she wears in front of a platter of oxtail and escargot bourguignon (see it up top). “There’s escargot,” said Mar, “so we needed to channel Julia Roberts in Pretty Woman.” Obviously!Milk-braised pork shoulder from Butcher and Beast.\nPhoto by Johnny MillerThe recipes—extravagant, meaty dishes from the restaurant—are introduced with historical and personal backstories. Marie Callender’s pot pies get a shout-out. King Louis XIV shows up. She lets the opulent food luxuriate in its truth: “This dish is a baller move” (the marrow crème brûlée). “I like to serve it claw-on for maximum visual shock” (poulet petite fille). The food is shot haphazard, demolished, mid-mouth. Each recipe sets a scene and you’re an extra in the background, peering in. I’m not sure the point is to even try to recreate this at home.At some point I asked her about...veganism. She recently told The Cut that she doesn’t understand it. “My attitude is polarizing, I’ve never shied away from it,” she said. “Somebody once told me if everybody loved me I’d be mediocre. If 50 percent of people love you, 50 percent hate you, you know you’re doing something right.”Maybe I got too hung up on the overall sexiness. It’s just such a relief, really. I’m writing this in elastic-waist pants and clunky clogs. I’ve eased myself into a world where food is casual and comfortable and I’ve lost my sight of the sequins and glamour, and staying up past 11 p.m. Flipping through Butcher and Beast is a voyeuristic peek into that concurrent universe. Everyone is so cool and diamond-drenched and collagen-glowy. It makes me want to drink more madeira. Spend more time in the dark.“Look. I was never going to do light, bright photography in that southern Cali style,” Mar told me. “I’m New York to the core.”Cover photo by Johnny MillerBuy it: Butcher and Beast by Angie Mar with Jamie Feldmar, $36 on AmazonGet the Recipe for Mar’s Prime Rib Roast:Rosemary-Crusted Prime Rib RoastThe trick to a roast a crisp crust? Cranking up the heat just before the roast is done.View RecipeExplore Bon AppétitCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-21", "author": ["Condé Nast", "Alex Beggs"]}