{"id": "69d465606d0b680a73a56a2a4c855528", "url": "https://www.bonappetit.com/story/hidden-gem-hamptons", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "At This Kaleidoscopic Shop in the Hamptons, Summer Last All Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAt This Kaleidoscopic Shop in the Hamptons, Summer Lasts All YearSisters Tanya Willock and Temidra Willock-Morsch pull from their art school backgrounds and Antiguan heritage at Hidden Gem in Southampton, New York.By Hilary CadiganJuly 9, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Tanya Willock and Temidra Willock-Morsch have known they wanted to run their own store together since kindergarten. As kids they didn’t just dabble in lemonade stands; they ran a full-on sidewalk bakery selling homemade cupcakes and cookies. They started tie-dying at age three, learned how to knit and weave from their grandmother as teenagers, and both went on to study art in college: Temidra with a focus in fashion and textiles and Tanya in fine art and photography. “Out of college we both went into our respective fields but had a hard time finding space to showcase our work,” says Temidra. “So we thought, why not open our own shop?” And Hidden Gem was born, right in their beachside hometown of Southampton, New York.That was March 2019, a year before It All Went Down, but the sisters say that running a housewares business (especially one with an increasingly robust ecomm market) proved pandemic-proof. In fact, the stay-at-home orders increased sales. “People being at home more meant they were caring more about what was in their homes, and who was making the items,” says Temidra. The bright colors and patterns you’ll find at Hidden Gem—many of them inspired by the sisters’ Antiguan heritage—feel like the perfect antidote to a long, bleak year-and-a-half of quarantine. “The Hamptons has a very specific look but we wanted to break that mold and introduce something new,” says Temidra. “The best compliment we get from people is, ‘Oh, I wanna live here!’ They step inside our world, and they get it.”Read on for some of the sisters’ favorite items in the shop.Linen ApronTemidra uses her fashion and textiles training to make these linen aprons, which are designed to flow like a dress. “My mom would host monthly dinner parties in her backyard, but she’d still be cooking as the guests were arriving, coming in and out of the house in a dirty apron,” she says. These aprons are for mom—and anyone who wants to look stylish in the kitchen, even with a spill or two. Photograph by Isa ZapataLinen Apron$85 at Hidden GemBent CandlesTanya hand-dips these paraffin candles in an array of bright hues, then bends them into various shapes, so no two are exactly alike. “If you’re hesitant about adding color and patterns to your space, this is a nice, subtle place to start,” she says. Photograph by Isa ZapataBent Candles$28 at Hidden Gem – Set of 2Evil Eye Dinner Plate“Growing up, we always had little trinkets and bracelets with the evil eye symbol,” says Temidra. “It’s for protection from evil spirits and bad energy.” Honeymooning in Western Greece in 2017, she fell in love with the work of a local ceramicist who incorporated the evil eye into his electric blue dishware. It took some convincing, but eventually she was able to set up a direct pipeline to Hidden Gem—the only place you’ll find these items in the U.S. Photograph by Isa ZapataEvil Eye Dinner Plate$125 at Hidden GemBone Spice PotThe sisters source many of their products from a small community of artisans in Nairobi, Kenya. “Somehow they found us on Instagram and messaged us during the pandemic,” says Temidra. “We use these little pots to hold my dad’s special seasoning concoctions at family dinners.”Bone Spice Pot$32 at Hidden GemFringe Coasters“Our mom weaves but she wasn’t going to weave coasters for us. She was like, ‘I have enough on my plate!’” says Temidra. Instead, the shop sources these colorful coasters from the same community of Kenyan artisans that produce their bowls and spice pots. “We’ve tried bringing muted, neutral colors into the shop but the products just sit there. When people come to Hidden Gem, they’re specifically coming for colors and prints, which is great because that's what we love and what we do best. Validation!” Photograph by Isa ZapataFringe Coasters$48 at Hidden Gem – Set of 4Hand-Dyed Tea TowelsTanya’s hand-dying technique traces back to Antigua, where people make brightly colored costumes for Carnival using a sophisticated free-form tie-dye technique with powdered dyes over ice. It’s messier than the American version of tie-dying, but Tanya says the unique patterns and colors are worth it. “We like to use these tea towels for just about anything: oversized placemats, gift wrap, or hey, wear one as a shirt!”Photograph by Isa ZapataHand-Dyed Tea Towels$24 at Hidden Gem12” Sisal BowlThe sisters give the Kenyan artisan group a general color scheme to work with, but otherwise complete creative freedom on the patterns and color combinations of these hand-woven sisal bowls. “This one’s meant to be a fruit bowl, but it’s almost like a woven sculpture,” says Temidra. “We like incorporating them as part of a gallery wall to add texture and dimension, especially for people who have kids or are renting out their space, so they don’t have to worry about someone knocking a glass piece off the wall and breaking it.”Photograph by Isa Zapata12” Sisal Bowl$60 at Hidden GemMulti Color PlacematsTemidra makes these one-of-a-kind placemats out of hemp fabric handspun by Hmong artisans in Thailand. “When I'm designing, I'm attracted to texture and color first—I’ll pick out a cool fabric and figure out what to do with it later,” she says. “What I love about this one is the really cool pleating.”Photograph by Isa ZapataMulti Color Placemats$40 at Hidden Gem – Set of 2Resin Charcuterie BoardsThe sisters have become known in the Hamptons for the wood-and-resin surfboards they design and decorate as wall art. These charcuterie boards are a functional tabletop version, made with mahogany cut and sanded by their brother, Jari Willock. Pouring the mixture of resin and ink is a complicated chemical process that can be dangerous if not done correctly. “Usually, we have minimal control over how the colors flow and blend, but sometimes Tanya uses a hairdryer to control the pattern and create a bubbly, foam-like effect that resembles a bird’s eye view of the ocean.” Sailboat cleats are affixed as handles to build on the nautical theme. Photograph by Isa ZapataResin Charcuterie Boards$145 at Hidden GemWood Bottle StopperThese quirky wine corks are made from olive wood in Tunisia. “What attracted us to them is that they’re fruit-shaped,” says Temidra. “I love items with some illusion to them, where it takes people a minute to understand what they are. Like, oh wait, that’s a pear!”Photograph by Isa ZapataWood Bottle Stopper$18 at Hidden GemExplore Bon AppétitCultureShoppingShop TourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-09", "author": ["Condé Nast", "Hilary Cadigan"]}