{"id": "69d6f6bf1f6b50234f99cbffab2c91d3", "url": "https://www.bonappetit.com/story/make-ahead-ice-water-salad", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "The Ice Water Salad Is the Make-Ahead Salad of Your Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIce Water Salad Is the Make-Ahead Dish of Your Dinner Party DreamsKeep your crunchy veg in an ice bath for hours and never frantically assemble a salad before dinner again.By Alex BeggsMarch 21, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailYou know how some people don’t mind being surveilled and have given over all of their secrets for the sake of a digital personal assistant who can keep track of your grocery list, turn off the living room lights, and cue up the best of Steely Dan? Instead of...that...the only thing I can agree to do for the sake of life efficiency is Make Things Ahead.But salad? Made ahead? Isn’t it supposed to be crisp, freshly dressed frantically in the kitchen while the guests bang their forks on the table, and tossed tableside to the sound of screams and shrieks? NOT ANYMORE, FRIENDS.Opens the door to a bowl of fennel salad with human legs. Meet Ice Water Salad. This is from the brain of Basically editor Amiel Stanek (legs added by me). When Amiel throws a dinner party, he thinly slices all kinds of hearty veg—fennel, radishes, turnips, carrots, whatever—and then sends them back to the fridge in a salad spinner full of ice water. This keeps the vegetables crunchy and fresh, and if you make the dressing ahead (which you WILL), all you need to do before serving is spin the veg and remember where you put the dressing.Molly Baz took Amiel’s method and developed an all-purpose Ice Water Salad recipe with an awesome bagna cauda dressing, toasted walnuts, and shaved parm. Crunch on crunch on cheese.  I made it on a weeknight (with some crispy chicken thighs!), but it’s the perfect setup to your next dinner party. The dressing was so good I dipped crackers in the leftovers, anchovy oil dripping down my wrist. AND you can make this salad with any, and I mean ANY, hearty veg. CAULIFLOWER, even. Wow wowow. The idea is a cold and crunchy, healthy raw salad that can hold up to crowds, unintended dinner delays, and romaine recalls. This is the No Wilt Zone. Save your arugula for the summer time!Ice Water Salad comes together in 6 steps:Cut the veg. Thin, with a mandoline, but not paper thin because we want  CRUNCH. More like a nickel. Then toss into your salad spinner. (A bowl works too! Instead of spinning it later, you can strain and pat dry with towels). Add ice water. I planned to serve it 6 hours later, so into the fridge it went.Make the bagna cauda dressing in two moves. Smash five ‘chovies with garlic into a paste, then cook the paste in olive oil in a saucepan until the garlic’s golden. Cool and jar for later.Toast some nuts. Then chop them for later. I used, gasp, already roasted hazelnuts because I happened to have some.Shave some parm. I did this ahead, and wrapped the shavings in paper towel, then stashed in the fridge in a plastic bag to keep them from drying out. You could also shave the cheese right before serving, but that’s not Make Ahead Lifestyle enough for moi.Mix it all up. Before serving, dry off the vegetables, dress, go to parm town, and finish with some s & p, as Molly would say.And while Molly wouldn’t recommend it, I confess I ate the fully dressed leftovers for lunch the next day and the fennel was still crispy, if a little oil-soaked. (I was happy.) Now hit the ice.Get the recipe:Ice Water SaladA stunning salad that's as crunchy and refreshing as it gets—plus, you can make it up to six hours in advance.View RecipeExplore Bon AppétitFennelSaladAnchovyEntertainingCooking TipsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Alex Beggs"]}