{"id": "69e1046849ab9d2cd11f7da5b6c4fb3c", "url": "https://www.bonappetit.com/recipe/spiced-tomato-braised-fish", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Spiced-Tomato-Braised Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueSpiced-Tomato-Braised FishBy Rachel GurjarAugust 10, 20214.8(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintSince fish cooks relatively quickly, the challenge is packing it with lots of flavor without overcooking it. Here we slip fillets into a tomato bath infused with Indian spices such as cumin and garam masala. The result: sublimely flaky fish that’s anything but bland. Mild-flavored whitefish like cod, haddock, and halibut are the perfect complement to the fragrant spices in the tomato purée. But you can swap in any other protein that feels like it could use some help in the flavor department, such as chicken breasts or tofu.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonLarge Nonstick Skillet$50 At AmazonFish Spatula$14 At AmazonIngredients4 Servings2lb. skinless cod, haddock, or halibut, cut into 3\" pieces1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus more4Tbsp. extra-virgin olive oil, divided1onion, finely chopped3garlic cloves, finely chopped13\" cinnamon stick1Tbsp. garam masala1tsp. cumin seeds½tsp. freshly ground black pepper, plus more128-oz. can tomato purée1tsp. sugar4slices sourdough breadPreparationStep 1Season fish with some salt. Heat 2 Tbsp. oil in a medium Dutch oven over medium. Cook onion and garlic, stirring occasionally, until softened, about 5 minutes. Add cinnamon stick, garam masala, cumin seeds, and ½ tsp. pepper; cook, stirring occasionally, until fragrant, about 3 minutes. Stir in tomato purée, sugar, remaining 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, and ½ cup water. Increase heat to medium-high; bring to a simmer. Reduce heat to medium, carefully add fish, and cook until fish is flaky but still firm, 8–12 minutes. Remove from heat; season with more pepper.Step 2Meanwhile, heat 1 Tbsp. oil in a large nonstick skillet over medium-low. Add 2 bread slices; cook until golden brown and crisp underneath, about 5 minutes. Transfer to a plate. Repeat with remaining 1 Tbsp. oil and 2 bread slices.Step 3Serve braised fish with fried bread.Photo by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioHow would you rate Spiced-Tomato-Braised Fish?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleAbsolutely delicious! I thought I had garam masala and didn't so I substituted curry powder (and a little more cinnamon to help) and it still turned out incredibly tasty! Amazing over toasted garlic bread and I'm sure would also be awesome over rice or even potatoes. Delish!amyamyHouston, TX2/15/2022Outstanding ― delicious, fantastically fast, and I made it with roasted potatoes instead of fried bread.  KSWPBaltimore, MD1/24/2022This recipe is yummy yummy!  One night we had it with the crusty bread - try adding some slices of garlic to the oil prior to frying the bread; next night served with sautéed mashed potatoes (leftover).  Definitely our new favorite!  Thanks BA!AnonymousChicago1/24/2022My favorite way to make this is to sub the white fish for salmon w/skin on and cook the same way. Up the quantities of spices, and this is one of my best comfort dishes.Sarah SamynathanSan Francisco, CA1/3/2022I thought that this recipe was easy and delicious, I used a premade pasta sauce and tweaked all of the spices to suit my tastes and really liked it.:) I've mads it with many different types of white fish as well as chicken and all were goods. I make the sauce first, add some water to dilute a little more and then cook the protein in the sauce.Wendy BurtonBoquete, Panama12/2/2021This recipe is fabulous.  Instead of the bread, I served it over Spanish yellow rice.  I also used tomatoes from my garden and let the sauce simmer, with the spices, for 2-3 hours.AnonymousSpokane, WA11/8/2021Average.  I made it as written, and it really did need more flavoring - either increase the amounts of spices or I liked the idea of using harissa, as another reviewer noted.  Also, the puree was pretty thick; it still cooked the fish but as I was eating it and putting it on the toast, it unappetizingly thick, so I'd recommend either thinning it more or using crushed tomatoes as another poster did.  AnonymousGig Harbor, WA10/27/2021Amazing! Produces a lot of sauce though. You could probably get away with removing half of it before introducing your fish and freezing that to make another time. That would make this recipe shockingly... somehow... easier than it already is. Five stars.CatherineHoboken, NJ10/3/2021very average. needs some spice or greensJyotichicago9/3/2021Really delicious and flavorful recipe which I will definitely add to my favorite dinners list! This was also very easy to make and play with. I used Tutto Rossi crushed tomatoes with basil in place of tomato purée and added 2 tsp of harissa paste for some extra heat, which added a nice pop here. Served over basmati to lean into the Indian flair in the recipe and was so delicious!!AnonymousPhiladelphia, PA9/1/2021Delicious Miss SilToronto, Canada8/30/2021I added mussels to the mix and it was good but overall took away from the fish. Separately it would have been a good idea but not with the fish. Jay JartiganHaverford PA8/26/2021Explore Bon AppétitCodFishSeafoodHalibutHaddockCanned TomatoTomatoVegetableCinnamonHerbs & SpicesTofuOther IngredientsChicken BreastChickenPoultryQuickEasyWeeknight MealsMainDairy-FreeNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Rachel Gurjar"]}