{"id": "69f302d12ee281ced18b398caf7db4a5", "url": "https://www.bonappetit.com/story/phone-etiquette-rules", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Phone Etiquette Rules The World Needs Right Now  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Dinner, Put Down Your Goddamn Phone (Yes, You)Something has got to change in the way we bring phones to the dinner table.By Mari UyeharaMarch 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailListen, people. We’re in crisis times here. We’ve become a nation of blithering blue-lit automatons who can barely peel our eyeballs off our shiny screen objects to acknowledge another human person within our breathing space.Dinnertime—you know, the ritual of human-to-human bonding since time immemorial—has warped into an American tableau of disfunction and disconnection, with entire families tinkering on their phones instead of engaging with the people right there in front of them. And the same goes for friend dates.We’ve all been there. You’ve gone back and forth and back and forth to set a date. You get to the restaurant, sit down, and your friend asks you a question about LIFE. But before you can get halfway through your first sentence, she’s checking her phone for extremely urgent updates such as a new like on the 5746th Instagram of her pug. Or maybe you are that friend, texting and tweeting while an array of small plates go cold. We’ve all been there too.We clearly need help with this phones-at-dinner thing. So, I called up manners experts Amy Alkon, whose most recent book is Unf*ckology: A Field Guide to Living with Guts and Confidence, and Nancy Mitchell, author of Etiquette Rules! A Field Guide to Modern Manners. Here are the new rules for dinner etiquette in the age of smartphones.The First Step is Admitting You Have a Problem“Our phones are designed to be electronic drugs,” says Alkon, whose advice stems from evidence-based social science. “They trigger an intermittent reinforcement response.” According to Alkon, in a study with rats and cocaine, the rats that reliably got cocaine every time they pressed on a lever, stopped pressing the lever, while rats that only got cocaine intermittently would press the lever all the time. When we get the occasional Instagram like or Twitter retweet, that’s intermittent reinforcement and it makes us want to check our phones all the time. So, your first step is admitting that you—like a rat with an unreliable cocaine lever 🤷🏻—are addicted to dumb social-media feedback.These waffles need your respect. Put the phone down!\nBrian FinkeStart with a Plan, ManIt’s hard to wing fighting off temptation in the moment, especially later in the day when our will power is depleted. “Think ahead of time how to minimize the use of your phone,” says Mitchell. “Take the calls you need to take, visit the websites, and send the texts before you get to the restaurant.” If there is some rare reason for which you can’t wait a full hour or two to check your phone, then do it on your way to the bathroom or let your friends know the pressing reason and do it quickly after finishing your mains.Out of Sight, Out of Mind“Putting your phone on the table advertises that the virtual world is more interesting than the people at the table,” says Mitchell. If you put your phone in a bag or a jacket pocket, you won’t automatically reach for it anytime it buzzes, flashes, or rings. Alkon puts her phone on airplane mode anytime she goes out to dinner. Unless you’re a cardiac surgeon or fireman, which, let’s be real, most of us aren’t, yours should be on silent at least. And if you’re a parent, who needs it near “just in case!,” then turn off all the notifications for your apps—the latest Twitter alert isn’t an update from your babysitter and shouldn’t be treated as one.Dudes, your faces are glowing.\nAlex LauDon’t Kill the Vibe“These restaurants work very hard to set up an environment,” Alkon notes. “Don’t give someone epilepsy with repeated flashes.” This is an important point, for camera flashes as well as general screen brightness. The other night, I was waiting in a packed entryway of a busy restaurant getting partially blinded by some guy’s phone with the brightness cranked up to burning-surface-of-the-sun levels. What was this man’s vital reason for exposing half the restaurant to this obnoxious glare? He was writing a comment on Facebook. Remember, when you’re in a dark, ambient restaurant checking your phone, everyone else around you is forced to check it too.Be in the Now, My Dudes“All these people are talking about mindfulness meditation, but you don’t have to lay on the floor for an hour,” says Alkon. “We can choose to have lives that are connected and engaged and in the moment.” That means paying attention to what people at the table are saying instead of mouthing “just one minute” while you check your phone for the zillionth time. “It’s mean and unkind,” says Alkon, to make your friends feel ignored.Take the photo of your porridge at Sqirl—then put it away!\nMichael Graydon & Nikole HerriottBut What About Food Photos?Right about now, many of you might be asking, but what about Instagramming? Isn’t that what we all do? Sure, take your phone out when a dish comes around, take your photo, and then put it away. You can edit and post it in the Uber ride home. Done and done. You don’t need to tweet, text, or compulsively check your phone through the meal to see how many likes you’ve racked up. And it also doesn’t hurt, once in awhile, to go completely Instagram-free for a meal and enjoy your damn food while it’s still hot.And Hey, Meet a Stranger, They Don’t Bite“We’ve cut ourselves off from spontaneous encounters,” says Mitchell. “People are losing the ability to make small talk and basic communication skills are suffering.” It used to be that people would talk to strangers at the bar or in line, but now many people are too busy swiping left and right on virtual potential that they’re missing the real-world opportunities right in front of them. It’s still possible!We’re pretty sure she’s telling him to put the phone down here.\nAlex LauWhat About Your Friends?Okay, so what if you have perfect phone habits, while your unwashed friends turn group dinners into silent retreats back into the virtual reality cult. There are a few different approaches to take. You can go with the ‘ol “phones stacking” challenge, in which everyone puts their phone in a neat little pile on the table and the first person to reach for his or hers has to pay the bill. You can also try, as Mitchell suggests, to broach the subject before sitting down by telling everyone that you’re going phone-free for the meal and would appreciate if they’d do the same. This also goes for dinner parties: Be the change you want to see in the world and announce that you, a hero, are leaving your phone in your coat pocket.How to Handle That One Friend Perpetually Glued to the ScreenAnd what about that one friend who is always scrolling Instagram and tweeting observations about life’s hilarious little quirks as if a Seinfeld-like break depends on it? Whatever you do, don’t shame someone in the moment. Alkon says this triggers the same chemical response as fight or flight mode and people can get defensive. Instead take your friends aside at another time and let them know about how you feel when they’re staring at their always-available electronic devices instead of making the most of your QT together.The TakeawayWhat this all comes down to is being mindful of your phone use. “The basics of etiquette is thinking about how your behavior impacts other people,” says Mitchell. And it’s also thinking about how your phone compulsion affects you. At the end of the day, no one gives awards speeches or death-bed farewells about their social-media followers, so let’s keep it that way. Put your damn phone down and just eat with your real-world friends. Your notifications about your pug Instagrams and incredibly on-point Twitter gifs will be waiting for you when you’re done.For your next (phones-free) dinner party:Explore Bon AppétitRestaurants + TravelInstagramPhotographyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-05", "author": ["Condé Nast", "Mari Uyehara"]}