{"id": "69f3d6da3c37ecf0302b8f2a3d7fa33e", "url": "https://www.bonappetit.com/city-guides/washington-dc/venue/maxwell-park", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Maxwell Park Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginwashington dcMaxwell ParkThe wine bar that strikes the perfect balance between quirky and classy.FacebookPinterestTwitterEmailCourtesy of Maxwell ParkGO HERE: for a glass of wine you might have trouble hunting down elsewhere in D.C. Owner Brent Kroll (along with his partners, somms Niki Lang and Daniel Runnerstorm) curate a far-reaching list, which includes a different theme every month (i.e. anything but Pinot Grigio in the summer, Friendsgiving wines in November, mountain-grown \"slope\" wines in January). Sounds a bit hokey, but it's not.ORDER THE: half pours or half bottles to try as many wines as possible. You don't have to be subjected to Wrath of the 5-Ounce Pour. Here, you've got options.THE VIBE IS: cozy neighborhood wine bar that hits just the right amount of cool. But it has all the familiar wine bar suspects: a charcuterie board, roasted nuts, and burrata, among other seasonal food options.THE NITTY-GRITTY: Open at 5 p.m. every day until midnight (Friday and Saturday until 1 a.m.). Show up early and you might get a free pour of sweet vermouth.Courtesy of Maxwell ParkExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-01-30", "author": ["Bon Appétit"]}