{"id": "69fa986a4c68037c16ae5e2bab320263", "url": "https://www.bonappetit.com/story/royal-wedding-cake-recipe", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "A Royal Wedding Cake Recipe In Honor of Harry and Meghan (and Cake) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHold On to Your Fascinators, We Made an Unofficial Royal Wedding Cake RecipePrince Harry and Meghan Markle are getting married, which seemed like a good reason to bake a lemon and elderflower cake with raspberry filling and buttercream frosting.By Alex BeggsMay 15, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Claire Saffitz, Prop Styling by Emily EisenFacebookTwitterEmailIt’s like my entire life has been leading up to this royal wedding. Oh wait, that’s what I said about the last one. I love the royals! And the corgis, the fascinator hats, the gossip columns, the big houses, the Range Rovers, the sold-out dresses, the ancient and outdated traditions, all of it! So I couldn’t be more elated to share this definitely unofficial royal wedding cake, three tiers and 12 layers of lemon-elderflower cake with raspberry filling, made for the occasion of Prince Harry and Meghan Markle’s wedding by Bon Appétit’s own Claire Saffitz.We only knew a few things about the real cake, which is in the hands of Violet Bakery’s Claire Ptak. Per Kensington Palace: “Prince Harry and Ms. Markle have asked Claire to create a lemon elderflower cake that will incorporate the bright flavours of spring. It will be covered with buttercream and decorated with fresh flowers.”Photo by Chelsie Craig, Food Styling by Claire Saffitz, Prop Styling by Emily EisenBA’s Claire took cues from Ptak’s style, a natural-edged buttercream frosting that has a homemade but woke-up-like- this beauty (the trick: use a bench scraper to apply). The sponge inside is soaked with St.-Germain elderflower liqueur and lemon juice, which gives it a fragrant, bright taste. All in all, the St.-Germain is very subtle (it doesn’t taste “boozy”). We recommend using the leftover liqueur in a Champagne cocktail.Photo by Chelsie Craig, Food Styling by Claire Saffitz, Prop Styling by Emily EisenWe have instructions for a dramatic tiered version, if you’re going full Mrs. Patmore for this royal wedding. (If so, see you bright and early Saturday morning!) You can make the cake layers ahead and freeze them, and then assemble and frost it later. The base recipe makes two 10” cakes, which is more manageable than building a tiered cake, but still 4 total layers, because we’re not messing around, this is CAKE. Either way, you should probably eat it for breakfast, wearing something feathery on your head, while bidding furiously online for a commemorative mug—something, anything!—to remember this special moment. And it will be a special moment, if the cake signifies anything.In the history of royal wedding cakes, as with royal everything, things have been stiff. The cake, per British custom dating back to pre-refrigeration days, is usually a dense, brick fruitcake that can be made months ahead. The frosting and decorations (royal seals and family insignia in marzipan) budge as little as the Queen’s Guard. They do. Not. Budge.Exhibit A, the towering cake from Prince Charles and the late Princess Diana’s 1981 wedding:Photo by David Levenson/Getty ImagesFun fact: In 2015, a (frozen) slice of this fruitcake sold for $1,375 at auction, and another one is on the auction block in June.Exhibit B, the 8-tiered fruitcake from Prince William and Kate Middleton’s 2011 wedding:Photo by John Stillwell/PA Images via Getty ImagesFun fact: Per the cake’s baker, Fiona Cairns, they cut the cake and served it for breakfast before the wedding, which is why we don’t get to revel in wedding photos of royals awkwardly slicing cake together. And, uh, it “matured” for two months before the wedding. Again: fruitcake. The top tier of the cake was saved and served to lucky guests at Prince George’s christening in 2013.Which is why we’re more excited than usual for Prince Harry and Meghan Markle’s cake—an actual cake cake! Something fresh, actually delicious, and perishable. A reminder that some occasions are best celebrated in the moment, not decades later by the highest bidder. I still hope, however, that they eat it for breakfast.Get the recipe for BA’s royal wedding cake:Lemon and Raspberry Wedding Cake with Vanilla ButtercreamA beautiful spring wedding cake inspired by the upcoming royal wedding.View RecipeExplore Bon AppétitTrends + NewsCakeWeddingDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Alex Beggs"]}