{"id": "69fbecaa6bdd144c650afcbe33804ae7", "url": "https://www.bonappetit.com/story/how-mayonnaise-got-its-groove-back", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "How Healthy Mayonnaise Became a Thing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Mayonnaise Got Its Groove BackWhen I left Russia, I had to disavow my love for mayo. Now the condiment is cool again, and I'm coming clean.By Flora TsapovskyMay 15, 2018FacebookTwitterEmailFacebookTwitterEmailAsk any Russian what her favorite dish is, and chances are it contains mayonnaise. The dinner table I grew up with as a child in Moscow was often white; not the tablecloth, but the food itself, slathered with and doused in the creamy, gooey substance. Exposed to the condiment in the Communist-era '60s, Russians are obsessed with mayo to this day. Olivier salad, a mayo-heavy mixture of cubed potato, carrots and bologna, is the star of the show; ‘French-style’ meat (thin steaks covered in mayo and onions, then baked) is another celebrated dish. My absolute favorite is Herring Under a Fur Coat, a glorious guilty pleasure consisting of herring, potatoes, beets and occasionally hard-boiled eggs, arranged in mayo-soaked layers. BBQ? Soak it in mayo for extra softness. A bowl of party dip? Unimaginable without mayo, just like life itself.Upon immigrating to Israel in 1991, I was surprised to find mayo smeared with negativity. In a country where the sun shines brightly all year long and winter means light rain rather than knee-high snow, no one desired mayo’s heavy hand. For me, the condiment became synonymous with Russian immigrants—a symbol of our otherness. Cholesterol, one of the health buzzwords at the time, did nothing for mayo’s reputation either. My family, striving to adopt a healthier, local lifestyle, abandoned heavier dishes in favor of Israel’s bountiful produce. As a kid desperate to fit in, I didn’t speak of mayo. At times, the condiment would make an appearance at fellow Russians’ house parties, and the encounter was always thrilling and lined with a thin layer of guilt.Fast forward 15 years to my Bay Area living room, where I was watching an episode from season 4 of New Girl: The ever-charming Nick is making his signature Bolognese sauce, a proud smile on his face. “Doesn’t the name ‘Bolognese’ come from 'mayonnaise’?” he says, adding mayo to the repulsive creation. I watched and cry-laughed; having moved to the U.S two years prior, I was just starting to realize that the American relationship with the controversial stuff of my youth is light and affectionate. Mayo is cool, sort of. It’s okay to like it, it’s a little excessive to hate on it, and ultimately, it is what it is: a mere condiment.But recently mayonnaise is back on a pedestal. Made trendily vegan in San Francisco by Just Mayo and artisanally in NYC by Sir Kensington's, and served alongside start-up-world foods like plant-based shrimp and the Impossible Burger, the simple condiment has—against all odds—become a health food. Even Gwyneth Paltrow has embraced Vegenaise because even she knows that fat is essential to making things taste damn delicious. Others, like Bonnie Frumkin Morales, whose wonderful and trendy Kachka: A Return to Russian Cooking is sticky with mayo on my shelf, are still beholden to the egg-based original. Either way, vegan and sexy or eggy and unapologetic, on a hamburger or in a deviled egg, mayonnaise is back in my life, and what a smooth, soft comeback it's been.Explore Bon AppétitHealthyishMayonnaiseTrendsRead Morecooking5 Healthy Store-Bought Sauces that Make Weeknight Cooking WAY ChillGallery5 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Flora Tsapovsky"]}