{"id": "69fb233fe983dd68fcc14ac8e90a0231", "url": "https://www.bonappetit.com/recipe/blueberry-lime-and-cashew-smoothies", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Blueberry Smoothies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueBlueberry, Lime, and Cashew SmoothiesBy Chris MoroccoMay 22, 20184.2(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrintWhen you’re trying to make the most of your mornings, keep breakfast quick but filling with this frothy fruit-and-nut-filled smoothie recipe. Save your beautiful farmers’ market berries for dessert and use the frozen stuff here instead.Ingredients4 servings2Medjool dates, pitted2cups coconut water1cup cashews1cup fresh or frozen blueberries⅓cup plain whole-milk Greek yogurt1Tbsp. fresh lime juiceLarge pinch of kosher saltPreparationPurée dates, coconut water, cashews, blueberries, yogurt, lime juice, salt, and 2 cups ice in a blender until smooth.How would you rate Blueberry, Lime, and Cashew Smoothies?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis smoothie is horrible \nNo taste and the aftertaste of coconut water And lime makes me gag Julie HLos Angeles 4/21/2021I love this smoothie! The lime really makes a difference. Soaking the cashews overnight helps to blend them more smoothly.Kiran12/15/2020Oh my goodness! This was by far one of the best smoothies that I've had. I am a big blueberry and cashew fan, so it was perfect for me. Prep time was super fast and it's a healthy smoothie. Can't ask for more than that! Thanks for the recipe .Showtime813Florida10/13/2020This was good but very cashew forward.  Next time we'll try using only half the cashews\n\nWe have been cooking and eating recipes from the Bon Appetit healthyish menu for the past year.  This is our first foray into smoothies. devin_walaArizona6/30/2020Explore Bon AppétitCold DrinkDrinks AllSmoothieBlueberryBerryFruitCashewNutYogurtOther IngredientsEasyQuickDrinksGluten-FreeNonalcoholicHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}