{"id": "6a0f77bd827574c5fbd185daa1d83590", "url": "https://www.bonappetit.com/story/nothing-in-the-fridge-hot-suppa", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "When There's Nothing in the Fridge, We Go to Hot Suppa in Portland | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen There's Nothing in the Fridge, We Go to Hot SuppaMaine is for lobsters and chowder...but also catfish tacos and pulled-pork mac and cheese.By Kate ChristensenJune 6, 2018FacebookTwitterEmailPhoto by Greta RybusFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.When my husband and I woke up on our first morning back after spending a winter away from our home in Portland, Maine, we were hungry. Our plane had landed at almost midnight, and there was nothing in the fridge; breakfast at Hot Suppa was the obvious answer. So we rolled out of bed and headed down the street in our pajamas. Okay, so not actually in our pajamas, but we could have—that’s the beauty of a neighborhood restaurant.Hot Suppa is a New Orleans–style eatery known locally for its excellent food, homey atmosphere, $1 happy hour oysters, and strong cocktails—our favorite of these being the After Glow, an exciting elixir of tequila, passion fruit juice, and hot chili peppers. There’s a tray of hot sauces and condiments on every table, including a bottle of pickled hot peppers. True to its name, it’s not pretentious: It’s housed in a storefront with plate-glass windows with an unimpeded view of the 7-Eleven across the street, plain wooden booths and tables, old exposed brick, walls hung with local art, and high ceilings with a large fan.Hot Suppa is where we go when we get back from a long trip.\nPhoto by Greta RybusIt also happens to be two short blocks from our house. It’s where we go when we feel blue, raw, in need of cheer, but it’s also a place to toast a minor victory or meet good friends for a drink and a bite. Hot Suppa isn't a special-occasion place—it’s a regular place, the place we come back to. Local, familiar, and low-key, it feels like an extension of home.A little dazed from the disorientation of jetlag and reentry, we hunkered down in a booth and ordered from the friendly waitress: corned beef hash with cornbread and Maine maple sweet tea for me, eggs Benedict and coffee for Brendan. It was a cold, still-wintry early March morning, but it was warm and cozy in here, the windows steamy, the room full of a soft hubbub of voices and music.“God, it’s good to be home,” I said, chowing down. My corned beef hash was superb, not too salty, crisp, pressed on a griddle, two over-easy egg yolks seeping into it. The food there is reliably good, whether it’s catfish tacos or shrimp and grits or pulled-pork mac and cheese or Creole meatloaf. I love the Louisiana-Maine connection, which makes instinctive sense to me despite the geographical distance between them: lobsters and crawfish, Acadian and Cajun. The word suppa works in both Downeast and Louisiana accents, and spicy Southern food warms the chilled New England soul.Full and happy, we paid our bill and headed back to our house. It was time to unpack, buy groceries, sort through our Everest of unopened accumulated mail. And we were ready, we had the mojo to face it all, because Hot Suppa had welcomed us home.Kate Christensen is the author of The Last Cruise.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Kate Christensen"]}