{"id": "6a12655b47f14b264bd620861e196ac1", "url": "https://www.bonappetit.com/story/can-you-charge-for-potluck", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Is It Ever Okay... To Charge People at a Potluck? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay... To Charge People at a Potluck?And more etiquette questions that are crucial this Thanksgiving week—but really for all time.By Alex BeggsNovember 18, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appetit’s etiquette column. Have a question? Email staff.bonappetit@gmail.com.“Recently, a friend hosted a potluck. I baked a dessert and a side. But then afterward, a friend of the host texted, ‘Hey, we divided the cost of [the host’s] groceries so everyone owes $10.’ Wait, what? I thought the point of bringing food was to pitch in to the meal, while other guests showed up with six-packs or nothing. How do I avoid this in the future?” —Kate R.THIS IS CRAZY. This friendship is OVER. If someone financially needs to charge you for groceries, and knows their deadbeat friends aren’t going to bring anything or are terrible cooks, fine, there are circumstances where this makes sense (college?). But you have to put that front and center in the invite text/email/Facebook thing/Paperless Post. Otherwise WTF. Kate, you and I bitched about this so I know you already paid this cheapass, but I wish you’d reamed out your friend like “lol no, I made freaking homemade mac and cheese! That’s KINDA HARD. It takes time and bechamel! Pay ME for my CHEESE BUDGET. It’s VERY LARGE.”“If you make Friendsgiving, or any dinner for friends, is there any non-douchey way to hint you’d love some help with the dishes? Or do you just have to know that’s part of the job, even if you don’t have a dishwasher and the sink overfloweth and you’re high-key stressed?” —Sarah W.So many people asked me this! Just DEMAND HELP. What are you afraid of, someone saying no, they just got a manicure? (I’ve said this. But to family! I needed gloves!) Some people weren’t raised right. They don’t offer to do dishes and might sneeze in your cloth napkins and sample all of your sleeping meds, but that doesn’t mean they’re anti-dishes. They’re just waiting to be drafted. Here’s the script: “HEY BUTTHEADS, SOMEONE COME IN HERE AND DRY THESE DISHES WHILE I WASH.” I find that “buttheads” really eases the tension. Sometimes at the table, I’ll start stacking people’s dishes, but I won’t stand up and take them to the sink—that’s key. Instead, I’m sending CLUES. Then others might start stacking plates on their end of the table, then someone might even stand up and bring them to the sink. At this point I’ll call out, “Let me know if you need gloves!” and that’s my extremely effective passive-aggressive way to get people to do dishes for me. Alt: burst into tears and run into the pantry and slam the door and refuse to come out until all the dishes are DONEZO.Snack BreakSwiss Chard–Tahini DipIf you love hummus or baba ganoush, this dairy-free dip will become a new favorite.View RecipeI know this dip looks like baby poop under a microscope but I’ve made it twice in the past month and it’s so creamy good, without ...any... cream. Make it! Then check your teeth after, there are definitely flecks of chard right in front, yep, right there, no, to the right. You got it. Worth it tho.“Is it okay to serve food with bones in it for a dinner party...?” —Chiara S.I mean, are you adding bones into foods that they didn’t originally come from? Because that’s twisted and cool as heck. I’m picturing a quiche with a huge tomahawk bone sticking up from the center like the sword in the stone. Yes to bones. On your plate, in your hair, ground up and baked into your bread.Glazed shallots. You got this, Bex.\nPhoto by Chelsie Craig, Food Styling by Dana Bonagura“I’m responsible for the Thanksgiving sides this year. I would like to make them in advance, and since I’m somewhat lazy, are there any sides that will make me look great in front of my family that won’t force a complete mental breakdown?” —Rebecca P.I dunno Rebecca, do you like canned green beans? You want lazy AND impressive, but that’s a fine line to tip-toe. Thanksgiving is the time to go all out. Slow down, get fancy, try a little harder than usual. You get what you put out into the world. (I heard a yoga teacher say that once, but I think she was talking about the flow of oxygen and carbon dioxide as we breathe in and out. Hard to say.) So to impress your parents and make them forget about your “in flux” state of employment, your lack of a 401K or “property,” I’d say these glazed shallots are the move. You toss them in a pan with some herbs and chile, butter and vinegar, and then they roast for a half hour—AND you can make them ahead and microwave before dinner. But that’s not enough food. These roasted carrots with a sweet-spicy sauce of harissa and maple syrup are super easy, and then your parents will be all, “what’s harissa? Can I get it at Kroger? Now what do I do with it?” And you can pretend you know. Oh, and even if you don’t make the glaze for these roasted brussels sprouts, this recipe technique gets them super crispy and delightful for people who grew up traumatized by TV-dinner mushy brussels.Not an ad for Tecate. Or is it?\nAlex Lau“Is it appropriate to tell people exactly what to bring to a dinner party (like, ‘natural wine only,’ ‘cheap beer only,’ ‘this specific salad recipe,’ etc.) The answer to this is obviously yes but I still feel like it would make a good column.” —Emma W.Thanks for editorializing that question, Emma who may or may not work at Bon Appétit. I’m a bossy lady and agree with you, but “natural wine only” is TOO FAR. Do like our colleague Emily Schultz and tell your friends which wine stores you like so that they go there, hopefully. But asking for “natural wine” is just too pretentious, like “only wear socks with a high-thread count,” or “only bring plus ones I haven’t already slept with.” Some party details are out of your control. Things I’ve asked guests to bring: Bounty paper towels, select-a-size. Vanilla ice cream. Negra Modelo (NOT Especial). Six limes. That book they borrowed three years ago and never read, clearly. Sometimes they accommodate, sometimes not. It’s always worth a try!Meet the Boulevardier—your winter Negroni.\nPhoto by Emily Schultz“Is there an easy drink I can make with three ingredients that will replace a Negroni? I need a change.” —Greg L.BOULEVARDIER, DUDE. Or just make the negroni with Cynar instead of Campari. Or try my favorite cocktail in the world, the Adonis: 2 parts sherry, 1 part sweet vermouth (also known as SWEET V), and a dash of orange bitters. Stir and serve up, with an orange peel if you have it, lemon if you’re roughing it. That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and betoo specific. I want the juicy details!Love,\nAlexExplore Bon AppétitThanksgivingEtiquetteholiday2018Is It Ever OkayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-18", "author": ["Condé Nast", "Alex Beggs"]}