{"id": "6a22caa963b9d19c542fa1e2ae0ade36", "url": "https://www.bonappetit.com/story/time-for-soy-pork-chops", "year": 2021.0, "month": 7.0, "day": 5.0, "content": "An Easy Weeknight Grilling Strategy for Lazy Cooks (Me) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAn Easy Weeknight Grilling Strategy for Lazy Cooks (Me)Editor in chief Dawn Davis is all about quick recipes with big payoff.By Dawn DavisJuly 29, 2021FacebookTwitterEmailPeden + MunkFacebookTwitterEmailWelcome to You’ve Got Time for This, a column where Bon Appétit’s editor in chief Dawn Davis highlights recipes from our archives that are delicious and accessible and work every time.I wouldn’t call myself a lazy cook. There are days, midweek, when I feel inspired to make a multiple-course meal even as I’ve stacks of stories or manuscripts to edit. Like the time, out of the blue, I just had to make a fruit tart to accompany BA’s labor intensive but absolutely delicious Italian Wedding Soup. Dinner gets pushed back at least 90 minutes but no one seems to mind when the promise of what’s to come perfumes the air.But as August looms on the horizon and the back-to-school emails begin to pile up and the Olympians distract me with their grace and athleticism, the lazy cook in me rules the day. It’s at these times that I really want what this column promises: quick recipes with big payoff. And that’s where this five ingredient (minus salt and oil) main course comes into play. With jalapeños, a medley of herbs, brown sugar, soy sauce and rice vinegar, this grilled pork chop recipe draws from regions of the world I love to explore: Mexico, the Mediterranean (if you choose herbs such as basil or parsley), and Asia. I roast half the jalapeños and leave the others raw so that there is a variety of textures, and I use whatever herbs are in my fridge.The recipe calls for rice vinegar, which according to Christina Chaey, a senior food editor, delivers “a gentler hit of acid that has none of the sharp edges of, say, red wine or white distilled vinegar.” The brown sugar is a counter to the soy and also “helps the thinner pork chops get great color and char before they have a chance to overcook,” says Chris Morocco, our test kitchen director.The last time I made this, I served it with another recipe that rewards the occasionally indolent: Brad Leone’s red miso-y potatoes. Red miso is a great pantry item as it lasts and lasts if refrigerated and is to potatoes what salted butter is to good bread.Even in the summer, where the distractions are aplenty, you’ve got time for this.Explore Bon AppétitCultureYou’ve Got Time for ThisGrillPorkEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-29", "author": ["Condé Nast", "Dawn Davis"]}