{"id": "6a31574ad02dd11f7d7fe2392877b91a", "url": "https://www.bonappetit.com/story/shampoo-bar", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "This Shampoo Bar Saved My Thick, Dry Hair | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Low-Waste Shampoo Bar Saved My Thick, Dry HairIt's been keeping my hair under control for the past five years.By Christa GuerraSeptember 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I have a lot of hair, and it's really thick, so it’s naturally always dry. One day, Kristen, the boutique hairdresser I’m finally going steady with, suggested I avoid shampoos with sulfates. She picked up a small block wrapped in paper from a little display and began demonstrating how to rub it on my head in circular motions. I was super confused.A few years ago, I wouldn't even dream of buying a hair product that wasn't in a fancy shimmering tube with a 15-syllable scent description. But I was shocked to be sold shampoo at a salon for less than $60, so I walked out with three J.R. Liggett Coconut & Argan Oil shampoo bars—one for me and one for each of my friends who also have challenging hair issues. Five years later, this shampoo bar is still keeping my hair under control.These bars have just five ingredients—saponified olive oil, coconut oil, castor oil, sunflower oil, and argan oil—so it takes a second to get used to the fact that you won’t get that perfectly silky smoothness when using it. I like to drench my hair, lather up the bar in my hands, then rub it all over my scalp. (The bar develops a curved shape over time, which makes this much easier.) After rinsing, my hair feels super clean but not dried out. And the plastic-free experience is, of course, a plus. If only they made a conditioner to match. —Christa Guerra, art directorBuy it: J.R. Liggett Shampoo Bar, $6.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingNatural BeautyRead MoreLifestyleThis Coconut Oil Floss Turned Me Into a Daily FlosserBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-27", "author": ["Condé Nast", "Christa Guerra"]}