{"id": "6a48fdd0f31bd1d015a507101a9c3e61", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/el-huequito", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "El Huequito  Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityEl HuequitoTextbook-perfect tacos al pastor you can’t stop, won’t stop eatingFacebookPinterestTwitterEmailPhoto by Matt Taylor-GrossGO: for the no-frills grande dame of tacos al pastor, shaved off a rotating spit and eaten standing on the sidewalk. That’s the El Huequito way.ORDER THE: tacos al pastor, of course! This place claims to be the first to serve the dish and has been doing so since 1959. It’s a Mexican take on Middle Eastern shawarma—but with pork instead of lamb, tortilla instead of pita, and a spicy adobo rub—and you shouldn’t leave Mexico City without eating at least three. Be sure to add a dollop of herby-spicy green salsa on top. And grab plenty of napkins.THE VIBE IS: literally the sidewalk. El Huequito has several sit-down locations dotted around the city, but the original—a closet-sized food stall near Mercado San Juan in the Centro Histórico with a skinny high-topped table out front—is the best.PRACTICAL STUFF: Check the website for specific locations and hours.—Hilary CadiganWE ALSO LOVEBarra ViejaSuper fresh seafood tostadas, tacos, and ceviches on a roving food truckRosetta / Panadería RosettaAn Italian restaurant and sister bakery that are so good, you might forget about tacos for an hourEl TurixTextbook *cochinita pibil* in a scrappy taquería in the heart of Mexico City’s Beverly HillsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Hilary Cadigan"]}