{"id": "6a4f7bd738712eaa128b9d54c984fff7", "url": "https://www.bonappetit.com/story/steamed-artichokes", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "What Did Artichokes Ever Do to You? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Did Artichokes Ever Do to You?Americans hate artichokes, and I hate that.By Carla Lalli MusicApril 11, 2019FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I have fought about a lot of foods with my boss, Adam Rapoport, including but not limited to bone-in chicken legs, anchovies, and sherry vinegar. But nothing gets him fired up like the mere mention of artichokes.“Artichokes!” he’ll yell. “Americans hate artichokes, Music. Get that through your skull!”I try again. “They have thorns,” he’ll yell, “no one wants to deal with thorns when they’re hungry, Music!”I suggest he make the recipe for pasta with artichokes from my book. “Music,” he’ll yell, “what is it with you and artichokes!?! They’re not that good, and they’re not worth the trouble. Deal with it.”Want this letter before it hits the website? Sign up for our newsletter!I don’t agree, which is why I keep getting yelled at. Growing up, we had steamed artichokes for dinner a lot, and no one ever complained about thorns. It’s not that we were danger-averse, it’s just that when you steam them whole, they’re easier to prep than a baked potato. All you have to do is cut off the very bottom of the stem (leaving the stalk intact), then use a serrated knife to cut off the top quarter of the crown, exposing the layers of leaves inside. Then they languish in a steamer basket until a paring knife slips effortlessly into the base, and if you pull off a leaf, the meaty bit at the bottom should be sweet and tender.Sure, Carla's not telling you need to braise artichokes, but you could.\nEva KolenkoWe ate them with a bowl of Hellman’s mayonnaise for dipping, but once in a while we’d switch it up and have melted butter that I liked to season with lots of black pepper. Our recipe ups the ante with garlic, which is even better.Artichokes are unusual and exciting! They’re special, and spring is their season, so you’re going to be seeing them in the grocery store these days. They’re thistles, and yes, they do have thorns, but humans have mustered the courage to eat them for thousands of years. The ancient Greeks ate them—but you’re too busy? I’m not telling you to core them and scoop out the chokes and cut them into tender nubbins and do an elaborate vegetable butchery on them. I’m not telling you to grill them, or fry them, or braise them. Those methods are great, but they’re all a little much, which might be part of why Adam kicked me out of his office all those times. But I do think you’re phoning it in on life, and your dinner, if you can’t muster the energy to steam them and douse them in garlic butter. Seriously: Live a little.Get the recipe:Steamed Artichokes with Garlic ButterAll you need are your hands, some friends, and permission to get a little messy.View RecipeExplore Bon AppétitCarla NewsletterArtichokeRead MorecookingYou Probably Have Way Too Many Spices in Your Spice DrawerBy Carla Lalli MusiccookingMy Broccoli Delight Recipe Won’t Be Censored Any LongerBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-11", "author": ["Condé Nast", "Carla Lalli Music"]}