{"id": "6a609e1174eb0ce311acaf367c861822", "url": "https://www.bonappetit.com/story/a-seasonal-mix-up", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "A Seasonal Mix-Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Seasonal Mix-UpAutumnal recipe recommendations and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroSeptember 26, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Emily EisenFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,We’ve had a string of summer-ish days in New York, which has put me firmly back into denial about fall. But while I may be biking around Brooklyn in shorts like it’s August, my work brain is off in Futureland. It’s thinking about next weekend’s trip to Portland for Roux and a few other soon-to-be-announced events, a fun editorial package we’re planning for November, the January 2020 Feel Good Food Plan, the annual Healthyish issue of Bon Appétit, and some even longer-term and more secret plans (!).It feels great—and important—to be thinking this far out, but it does make time speed up in a way that's disconcerting. Sometimes, in the middle of a meeting or phone call, I have to check my Google calendar just to remember what month we’re in right now.And this month is a great one to be in! This week, I’ve been trying to ground myself in late September by buying farmers’ market apples, watching my dog pee on piles of leaves, and planning upstate escapes. And, of course, by cooking seasonally appropriate things. Last night, after a day that I described to a friend as “like getting to that level of Tetris where everything is coming down way too fast,” I closed my computer, cut up a kabocha squash, tossed it in honey, red pepper flakes, olive oil, and salt, and roasted it until it was soft and caramelized. I cooked a pot of farro and tossed it with walnuts, feta, and red wine vinegar, then I spooned the squash over the farro salad and ate it outside because it was still 70 degrees at 8:30 p.m.It was a seasonal mix-up, but it felt just right.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterSquashessayRead MoreLifestyleThree Months, 200 Meals, and a LOT of Time on the RoadBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-26", "author": ["Condé Nast", "Amanda Shapiro"]}