{"id": "6a65c4de19aa5535eeb35283e6b4c29d", "url": "https://www.bonappetit.com/story/boiled-cider", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Boiled Cider Is the One-Ingredient DIY Food Gift You Should (Actually) Make This Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe One-Ingredient DIY Food Gift You Should (Actually) Make This YearEnough with the granola, already! Say it with boiled cider.By Amiel StanekNovember 22, 2019FacebookTwitterEmailPhoto by Emma Fishman, food styling by Pearl JonesFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.I’m going to be real with you: I think that most DIY holiday food gifts are bunk. It’s so much cheaper, they say. WRONG! We live in late capitalism, people: The ingredients to make the thing in a small batch are almost always going to be cost more than buying a thing made by someone else in a huge batch. But it tastes so much better, they say. WRONG! Honestly, unless you have spent years and years perfecting your recipe for granola, or hot sauce, or practicing toasting and grinding and blending your own spices, it ain’t going to be better than the thing you can buy at the store. But, but, it’s the thought that counts, they say. WRONG AGAIN! Last time I checked, my pantry is full of stuff I actually like to eat, and there’s no room for Good Intentions. Sorry, but it’s true!!If you’re sensing that, based on the headline for this story, there’s a “but” coming, you are correct. Most DIY holiday food gifts are bunk. But a handful are truly awesome. And boiled cider is one of them.What is boiled cider you ask? You may know it by one of its other names—boiled syrup, apple cider syrup, apple molasses—but chances are that, unless you’ve spent a lot of time in rural New England, you might never have tried this lusty elixir. As the name might imply, it is comprised quite simply of one ingredient—sweet apple cider—that has been boiled for hours and hours to evaporate off a significant amount of water and reduce it to a sticky, amber-colored syrup. It looks a lot like its maple sap–derived cousin, but flavor-wise is in a league all its own. Ethereally sweet-tart, bright and caramel-rich at the same time, it tastes like the fruitiest honey, or the ooze from the middle of the best apple pie. IMHO, nothing embodies the heady slide from autumn to winter quite like a jar of the stuff—which is just one of the many reasons it makes such an exceptional, seasonal homemade gift.Boiled cider. It’s what’s for breakfast—and many, many other occasions.\nPhoto by Emma Fishman, food styling by Pearl JonesAnother reason? In giving it, you’re introducing to the receiver a new and novel ingredient—but not the obscure, pretentious kind that requires extensive Googling to figure out how to use. This is the kind that is explicitly and intuitively useful. Cider syrup can be deployed in pretty much the same way that any liquid sweetener like honey, maple, or agave can be. It’s deliciously unexpected on its own, drizzled liberally over butter-slathered pancakes, waffles, or French toast, and makes weekday oatmeal taste like a weekend orchard romp. When used in place of simple syrup, it makes for an incredible cocktail ingredient, a simple switcheroo that can slyly bestow a sense of time and place upon an otherwise unremarkable whiskey sour or hot toddy. (Not bad as a Dry January seltzer additive, either!) And it’s a real workhorse in the kitchen, too: It slaps when used to balance a vinaigrette, or sweeten baked goods, or glaze vegetables, or marinate meat. The list, it goes on.And it couldn’t be easier to make. All you need is plenty of apple cider and plenty of time. I say “plenty” of cider because you end up reducing whatever quantity you start with to between a quarter and a sixth of its original volume (I like to do at least 2 gallons at a time, which will yield around 8 cups of syrup). I say “plenty” of time because, well, it’s going to take you the better part of a day, one that should ideally be spent binge-watching TV on the couch while your creation bubbles away on the stove.To do the damn thing, break out your largest stockpot and fill it with good, fresh apple cider—the less processed the better—leaving at least a few inches at the top so it doesn’t bubble over. Stand a chopstick or wooden skewer straight up in the pot, remove it, and use a knife to make a little notch to indicate how far up the cider goes. Then, make another little notch halfway between the first and the bottom of the stick, another one halfway between that notch and the bottom, and another between that notch and the bottom. (This measuring stick is a low-tech way of tracking your progress.) Bring the cider up to a boil, then reduce the heat to medium-low, and let the thing bubble away, uncovered, stirring occasionally, until it has been reduced to the ¼ mark, which will take anywhere from three to six hours depending on your stove and the pot you’re using. At this point, you can continue to reduce it further if you like—you can go all the way down to that last ⅛ mark—but I prefer a boiled cider that has a viscosity closer to maple syrup rather than honey, so I tend to let it go a bit more and split the difference. (Just don’t go past that last mark, as you run the risk of scorching the syrup and making it bitter.) You can strain your finished syrup through a cheesecloth-lined fine mesh strainer if you want (I normally don’t), and then funnel it into small jars or bottles for distributing.Congratulations, you’ve spent the afternoon making a LOT of something VERY SMALL! And your house smells COOL! And you have GIFTS for your FRIENDS! But not just any gift: One they will use, one they will be sad to finish, one they will remember. One that isn’t an attempt to show off your culinary prowess, or how much money you have to spend, but rather how much of the one resource that actually means anything you’re willing to devote to them: time. And if that isn’t a good gift, I don’t know what is.Explore Bon AppétitNot So FastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-22", "author": ["Condé Nast", "Amiel Stanek"]}