{"id": "6a7d1085061a09c67315784655199415", "url": "https://www.bonappetit.com/recipe/sheet-pan-potato-hash-with-fixins", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Sheet-Pan Potato Hash With Fixins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueSheet-Pan Potato Hash With FixinsBy Chris MoroccoAugust 13, 20194.5(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThese shingled sheet-pan taters are somewhere between french fries and potato chips (and heaven). The key to achieving the remarkably crispy-meets-creamy texture is to use russets. Their natural starch and low moisture content make them ideal for roasting at high temperatures. To get them crisp and golden, they’ll need a little TLC: Use a big bowl when you’re tossing them with the oil and then really get in there with your hands to make sure every slice is well coated.Ingredients4 servings2½lb. russet potatoes (about 4), scrubbed, very thinly sliced¼cup plus 2 Tbsp. extra-virgin olive oilKosher salt4large eggs8oz. hot-smoked fish (such as salmon, whitefish, or trout)½cup crème fraîche or sour creamTrout or salmon roe, chopped dill, and thinly sliced red onion (for serving)PreparationStep 1Place a rack in upper third of oven; preheat to 425°. Toss potatoes in a large bowl with ¼ cup oil (using a bowl will help get the slices well coated, which means they’ll get super crisp in the oven). Season generously with salt.Step 2Transfer potatoes to a rimmed baking sheet and spread out into an even layer (it’s fine to have them piled on top of each other; just keep them even). Roast, undisturbed, until browned and very crisp (top and bottom), 40–50 minutes. Let cool 5 minutes.Step 3Heat remaining 2 Tbsp. oil in a large nonstick skillet over medium-high. Crack eggs into pan and fry, spooning oil over whites, until set, about 3 minutes.Step 4Divide potatoes among plates and top each with an egg, some smoked fish, and crème fraîche. Spoon roe over and scatter some dill and onion on top.How would you rate Sheet-Pan Potato Hash With Fixins?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI tried this recipe 4x in different variations of how I placed the potatoes on the pan and nothing ever worked so I’m real curious how people were successful John SmithVancouver BC5/8/2021I sliced on a mandolin you are not specific other than “super thin” and these were that. I cooked them at 425 for 45 minutes (you specify 40-50, so I met you half way, each end was burned AF. I also rotated the pan 180 degrees half way through. I’m confident my oven is at the right temperature.\nI will try again I was hoping to make this for Mother’s Day. Perhaps 40 minutes cook will be better. John SmithVancouver BC5/7/2021How do you keep the potatoes from turning pink? I was afraid putting them in water would make them too wet to brown according to the recipe.  Mine turned pink, and then this unappetizing grey color once cooked.  They tasted pretty good though!AnonymousBerkeley, ca12/27/2019I have feelings for this recipe. I'm a little bit in love. This is the easiest, yet the most addicting thing to come out of my oven and I could probably eat an entire sheet pan of these and still feel okay about myself. NOM NOM NOMAnonymousDenver, CO11/19/2019I made this for dinner tonight and it was awesome. The flavors are so well balanced and everything blends deliciously. I couldn't find any roe (small town in northern NM) so I used some capers. My husband, 14 year old son, and 4 year old son all cleared their plates! VnesscarLos Alamos, New Mexico 11/2/2019So great!  This was the most successful BA recipe I’ve made in several issues.  Absolutely delicious!  It was a family-pleaser too.\nAnonymousMatthews NC9/15/2019Explore Bon AppétitPotatoVegetableEggTroutFishSeafoodSalmonRusset PotatoQuickEasySheet-Pan DinnersWeeknight MealsMainGluten-FreeNut-FreeRoastBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Chris Morocco"]}