{"id": "6a89949b2d6f530f919c97575a20f03b", "url": "https://www.bonappetit.com/recipe/short-rib-carne-asada-tacos", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Short Rib Tacos With Cilantro-Lime Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShort Rib Tacos With Cilantro-Lime SlawBy Sohla El-WayllySeptember 3, 20204.5(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich EmailPinterestPrintEmailPinterestPrint“Short ribs aren’t just for braising,” says contributing food editor Sohla El-Waylly. “Boneless short ribs in particular can be grilled like steak. Be sure to cook them to medium doneness, just long enough to render fat and tenderize, without letting them overcook or toughen. A 20-minute rest is ideal for keeping them juicy.” In this recipe the meat is basted with a mixture inspired by salsa negra, a deeply flavored bittersweet salsa made from fried morita chiles and piloncillo. Instead, Sohla created a quick pantry salsa by blending canned chipotle chiles in adobo with brown sugar, charred garlic, and vinegar to provide similar smoky, sweet, and bitter flavors. Use up any leftover chipotles in adobo in vegetarian chili or chicken tinga tostadas. The simple cilantro-lime slaw adds cool crunch against the rich meat and chipotle heat. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Bowl$18 At AmazonSmall Skillet$40 At AmazonBlender$32 At AmazonSmall Bowl$13 At AmazonTongs$13 At AmazonCast Iron Skillet$30 At AmazonBrush$7.99 At AmazonIngredients4 servings½medium head of cabbage3½tsp. Diamond Crystal or 2 tsp. (heaping) Morton kosher salt, divided5garlic cloves, unpeeled2–3canned chipotle chiles in adobo, plus 1 Tbsp. adobo sauce⅓cup (packed) dark brown sugar2Tbsp. distilled white vinegar½tsp. freshly ground black pepper1½lb. boneless beef short ribs, preferably 1\" thickVegetable oil1large red onion1lime1avocado10–14small tortillas1cup (lightly packed) cilantro leaves with tender stemsPreparationStep 1Cut ½ medium head of cabbage in half lengthwise and remove core; discard. Slice cabbage crosswise into very thin strips (as thin as you can). Transfer to a large bowl and sprinkle with ½ tsp. Diamond Crystal or ¼ tsp. (heaping) Morton kosher salt. Massage gently with your hands to work in salt and soften cabbage a bit. Set aside.Photo and Food Styling by Emma FishmanStep 2Toast 5 unpeeled garlic cloves in a dry small skillet over medium-high heat, until skins are deeply charred on both sides, 5–7 minutes. Let cool a few minutes and peel garlic. Place in blender along with 2–3 canned chipotle chiles in adobo (add 3 if spicy is your thing) and 1 Tbsp. adobo sauce, ⅓ cup (packed) dark brown sugar, 2 Tbsp. distilled white vinegar, 1 tsp. Diamond Crystal or ½ tsp. (heaping) Morton kosher salt, ½ tsp. freshly ground black pepper, and ½ cup water. Blend until smooth. Transfer salsa to a small bowl.Photo and Food Styling by Emma FishmanStep 3Prepare a grill for medium heat. Clean and oil grate. Season 1½ lb. boneless beef short ribs, preferably 1\" thick, with remaining 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt; drizzle evenly with vegetable oil. Grill, rotating every minute or so, until exterior is deeply browned and crisp and an instant-read thermometer inserted into the thickest part registers 120°, 7–12 minutes, depending on the thickness of your ribs. Brush ribs with salsa and continue to grill, turning every minute or less, until shiny, glazed, and thermometer registers 130°, about 3 minutes. Transfer to a cutting board and let rest 20 minutes.Photo and Food Styling by Emma FishmanStep 4If you don’t have a grill: Heat 2 Tbsp. vegetable oil in a large cast-iron skillet over medium-high. Season 1½ lb. boneless beef short ribs, preferably 1\" thick, with remaining 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt (no need to rub with oil) and cook, turning every minute or so, until exterior is deeply browned and crisp and an instant-read thermometer inserted into the thickest part registers 125°, 5–10 minutes, depending on the thickness of your ribs. Brush with salsa and continue to cook until glaze has darkened in color, about 15 seconds per side. Repeat process with another layer of salsa. Transfer to a cutting board and let rest 20 minutes.Step 5While the meat is resting, prepare the garnishes. Cut 1 large red onion in half through the root end and remove skin. Slice halves through root end into ½\"-thick wedges (this will keep layers together while grilling). Grill onion wedges until charred (or cook in the same skillet—no need to clean), about 2 minutes per side. Trim root so layers easily separate and arrange on a platter. Cut 1 lime in half and squeeze juice into cabbage. Add 1 cup (lightly packed) cilantro leaves with tender stems to slaw and toss to combine. Slice 1 avocado and arrange on a small plate. Char 10–14 tortillas on grill or toast in a dry skillet, about 15 seconds per side. Wrap in a kitchen towel to keep warm .Photo and Food Styling by Emma FishmanPhoto and Food Styling by Emma FishmanStep 6If short ribs are very thick, slice horizontally through the middle of the sides into 2 thinner pieces, then slice against the grain ¼\" thick. Rotate slices 90° and chop crosswise into ¼\" pieces. Arrange on platter next to onion and serve with cabbage slaw, avocado, tortillas, and remaining salsa for making tacos.Photo by Emma Fishman, Food Styling by Rebecca JurkevichStep 7Do ahead: Cabbage can be salted 1 day ahead; cover and chill. Salsa can be made 1 week ahead; cover and chill.How would you rate Short Rib Tacos With Cilantro-Lime Slaw?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleLove this recipe!!! I don’t have a grill & cooked via stove time. It came out perfect & not chewy at all. Ate in a crunchy shell! Marinade was delicious and yielded way more than needed so I used it throughout the week to make a compound butter, on chicken breast, & tomorrow on ground meat for burritos. \n\nVery quick, simple, & flavor reminds me of taco night at home growing up! HanLong Island, New York3/23/2022Great recipe! The salsa is a little sweet on it's own, in the future I would make less and only use the salsa to brush the steak while cooking. Ben B.Seattle, WA12/17/2021My sauce is really watery.  What did I do wrong?MJClarkston, MI1/16/2021Very good, almost excellent. aud308bahamas9/28/2020I made the short ribs with an old BA recipe-citrus braised-over the weekend. Pulled them out of the freezer. Re-warmed and then followed this recipe For tacos. Perfect. AnonymousBoynton Beach Fl9/16/2020This was one of the best dinner party meals I have ever made - simple but unexpected, pretty easy to execute, and absolutely delicious. I want to eat this every day. Definitely serves 4 - with a salad on the side, 4 adults were fed with no leftovers - so if you want to make it for a larger group be sure to scale up. Saving this forever - thank you, Sohla!TurboTatsDenver, CO9/7/2020This was amazing!  Make it, don't wait!  I used bone in, because that's all the store had.  The sauce is heavenly and spicy.... I put it on the ribs and wrapped in foil and put on the grill for about 1 1/2 hours.  OMG.  The sauce is so flavorful.  Yes, to the question about using a colander for the cabbage, mine was watery.  I used paper towels to soak a bit of the moisture up.  The slaw is simple and refreshing over the meat.  And I homemade tortillas..... Finished it all with a squeeze of lime!  YUM!AnonymousBainbridge Island, WA9/6/2020This was amazing, that sauce is so addicting. I used Korean short ribs because thats all my grocery store had and they still turned out great. The slaw has a great crunch and the creamy avocado with the grilled onion had great contrast when eating it all together. The slaw was not watery and held its crunch for the person below who was asking. For one person it was great and could easily do a lot of it ahead of time and serve it for a crowd!EKJM1212Chicago, IL9/6/2020I have not made this yet but I will this weekend. A question for anyone who has made it: does the cabbage get too wet in the bowl? Should I do the salting in a colander?probinsonphd966Wayne, NJ9/4/2020Explore Bon AppétitTacoMexicanLatin AmericanShort RibBeefMeatChipotleChileVegetableCilantroHerbs & SpicesCabbageLeafy GreensSummerMainGluten-FreeDairy-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Sohla El-Waylly"]}