{"id": "6a8a4a5d14570b4b22f5d19c21f513f3", "url": "https://www.bonappetit.com/story/chicken-thigh-biryani-journey", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "The Journey of Bon Appétit’s Chicken Biryani | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Journey of Bon Appétit’s Chicken BiryaniA family recipe, re-developed.By Adam RapoportOctober 29, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoytsovaFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When you work in the Bon Appétit Test Kitchen, you’re not only expected to keep up on what’s happening in food right this minute, you’re expected to bring a piece of home with you to the office.Over the years, Rick Martinez has graced us with dad’s refried beans, Gaby Melian schooled us in the ways of empanada-making, and Carla Lalli Music lobbied and lectured me on the magnificence that is the Feast of the Seven Fishes (eventually I saw the light and gave her the go ahead).Want this letter before it hits the website? Sign up for our newsletter!Sohla El-Waylly, the newest member of the test kitchen team, figured she would bring one of her childhood favorites to BA: her mom’s biryani. And that’s when things got complicated.In order to make the dish as home cook–friendly as possible, Sohla decided to switch from her mom’s preferred lamb biryani to chicken. But then the assertive spices in the original—mace, cubeb pepper, et al.—overpowered the chicken thighs. Sohla was stumped.And it was at this point that Chris Morocco stepped in and suggested that she not try to replicate the dish she grew up with, but create something new, which is very much in the spirit of what we do here at BA, day in and day out.Photo by Adam Rapoport“After Chris gave me that push, I felt confident to freestyle,” Sohla says. “I went with a basic korma vibe for my chicken marinade because it’s simple and everyone likes it. And while my mom’s biryani always has potatoes, I was juggling too many balls trying to perfectly par-cook both potatoes and rice for one dish. This omission allowed me to zero in on the rice—the most important part of any biryani.”The result is a relatively simplified biryani that isn’t long on ingredients, but still homes in on technique, allowing the home cook to achieve fluffy, fragrant basmati, deeply tender chicken, and just enough spices, caramelized onions, and ghee-toasted nuts to introduce irresistible flair.The recipe development process opened Sohla’s eyes. “The main thing I’ve taken away from breaking down biryani and really thinking about it is that it’s all about the rice,” she says. “Once you understand how to parboil rice, anything can be biryani. Steam rice over any saucy base—chicken Tikka masala biryani, chicken adobo biryani, beef stroganoff biryani, randang curry biryani, goulash biryani…”But if you want to make lamb biryani, you might have to DM Sohla’s mom.Get the recipe:Chicken BiryaniThis satisfying rice dish can often be an elaborate, ambitious affair, but our version simplifies the process without sacrificing any complexity of flavor.View RecipeExplore Bon AppétitAdam NewsletterChickenRiceRead MorecookingNot My Amu’s Chicken Thigh BiryaniBy Sohla El-WayllycookingIt’s Lamb Chops and Greek Salad for DinnerBy Adam RapoportcookingSteak and Potatoes Night in AmericaBy Adam RapoportcookingBroccoli Bolognese Is an Anywhere, Anytime PastaBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-29", "author": ["Condé Nast", "Adam Rapoport"]}