{"id": "6a8fce008d78774261d8372dd2a51c3e", "url": "https://www.bonappetit.com/story/digby-stridiron", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "For Digby Stridiron, All Roads Lead Back to the Virgin Islands | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFor Digby Stridiron, All Roads Lead Back to the Virgin Islands“The most diverse culture in the world is my West Indian culture. Hands down.”By Korsha WilsonAugust 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt’s a warm June night at the James Beard House in New York City and chef Digby Stridiron is playing soca music in the compact subterranean kitchen as cooks move around him putting final touches on a caviar dish with ackee, saltfish, and roti. This is a sold-out dinner celebrating the West Indian Chefs Alliance, showcasing some of the best chefs of the Caribbean.Stridiron is saying hello to guests, giving hugs to people he remembers from last year’s dinner. Someone says “nice outfit” as she passes him on her way to the courtyard. While the other chefs in the kitchen are wearing white chef coats, starched, pressed, and embroidered with their names, Stridiron is wearing a dark blue mechanic’s shirt with a U.S. Virgin Islands flag patch—a golden eagle with outstretched wings—on the left breast pocket.On the surface Stridiron looks the same as he did last year around this time, when he hosted the first W.I.C.A. dinner, save for the patch and a few more tattoos. But the past year has brought challenges and clarity that changed him and the way that he thinks about himself as a chef and a man; he’s more committed than ever to honoring Caribbean cuisine.“Thanks,” he says to her over the crowd, cracking a smile. “I’m over that traditional way of doing things.”The day before the dinner, Stridiron surveyed the shelves at Essex Street Market in Manhattan, in camo shorts and a T-shirt, bleary-eyed from making a 12-hour drive from Charleston, South Carolina, where he picked up a heritage-breed pig from Holy City Hogs, a small heritage pork producer based in South Carolina. This last-minute shopping trip is for citrus and herbs to make the rum cocktails served at the dinner. “We’re serving rum drinks with each course,” he says excitedly. “The Japanese are proud of their sake and serve it with their food, so why not serve rum?”Digby Stridiron, 35, is from St. Croix in the U.S. Virgin Islands, a territory of the United States. He ran the kitchen at Balter, a fine-dining restaurant, on the island until 2017 and was the U.S. Virgin Islands’ culinary ambassador, traveling the world promoting the islands and their cuisine.Last year he started work as the opening chef at a Charleston restaurant that would serve Caribbean-inspired dishes with local Southern ingredients. He had high hopes for the project: “I was constantly trying to refine my food,” he says. That meant taking sorrel—a tart drink made from Caribbean hibiscus—reducing it and adding sugar to make it more “familiar” and modern for diners. He made mofongo, the humble dish of crushed fried plantains, as smooth and creamy as possible instead of the rough mash typically found on the island. Stridiron had looked to places like Noma as a culinary weathervane of how his cooking should be, as if he had to “‘French’ things up” or mimic a European standard of dining and cuisine in order to be taken seriously.Just as hype for the restaurant was building in September 2017, Hurricane Maria ripped through the region, destroying homes, downing power lines, and killing dozens of people. Stridiron, who was born and raised on the island and still has family there, felt helpless. “Me being up here when that storm was happening, I couldn’t focus, I wasn’t able to do anything. It killed me. I went gray over this.” Less than two months later his grandmother passed away and he started to rethink his career priorities. “Losing my grandmother was one of the moments that showed me that you have to make decisions that are right, and if it’s not right for you then it’s not meant for you.” A few months later, in March of 2018, Stridiron was fired from the Charleston project without warning before it opened. “It was embarrassing,” he says.He went back to the Caribbean, traveling to Jamaica to try authentic jerk, to Trinidad to try doubles, to Barbados to try cou-cou and flying fish. “The most diverse culture in the world is my West Indian culture. Hands down,” he says. He no longer cared about awards or “refining” his dishes. “I took off my chef jacket, and you don’t have to call me a chef if you don’t want to,” he says. “Besides Jose [Enrique of Puerto Rico], there’s not much award recognition in the Caribbean, and it makes Caribbean chefs feel like they have to make our food something different, something more European, and it’s like, no, what we’re doing is already beautiful.”“It hasn’t been the easiest year for Digby,” says Asha Gomez, chef-owner of Third Space, a culinary event studio in Atlanta. She and Stridiron met four years ago in Italy and have stayed close friends ever since. “I call Digby a crazy diamond,” she says with a smile when talking about Stridiron’s move from St. Croix to Charleston and his travels around the Caribbean. “The last year has probably been the most important of his life because it’s defined and shaped what he wants to do.”Stridiron cooking at the James Beard House in June.\nPhoto by Eric VitaleIn May, a call took Digby back to St. Croix. Sommer Sibilly-Brown, founder of the Virgin Islands Good Food Coalition, asked him to cook for a dinner raising funds for four Crucian middle and high school children to travel to Barbados to learn about the food systems there as part of the Farm to School Initiative. Since he didn’t have to work at a restaurant at the time, he said yes. “I was scared.” Stridiron hadn’t seen the island since the storms. “When we flew in, there were a lot of blue roofs,” he remembers. Seeing the damaged homes still covered in tarps made him realize what he wanted to do next and where he needed to be. “When I think about the greatest moments of my career, they’re all when I’m back in St. Croix. I realized that everything I had been doing for the past year was about me, it wasn’t about my community. I was being selfish.”“It was challenging to do that dinner,” Sibilly-Brown remembers. “After the hurricane it was really hard to source local ingredients but Digby always said, ‘don’t worry about it.’” A day before the event, the venue lost water and Sibilly-Brown had no choice but to reschedule the event for a later date causing 50% of the reservations to cancel. “Everything that could have broken his spirit, he took it in stride,” she remembers. “He kept saying to me, ‘little by little’ and that’s how we make change.”Stridiron recently signed the lease on a space in St. Croix and aims to open his new restaurant, Braata, at the end of 2018. Braata will be the rum bar of his dreams, serving dishes rooted in traditional Caribbean ingredients and highlighting the influence of both African slaves who were brought to the island and the Taino people, or indigenous native Caribbeans. He is designing the space himself and creating a menu that will be 100% Caribbean. “If I want to make something with cassareep (a thick syrup made with cassava), I want you to taste the cassareep.” Indigenous tropical fruits like sugar apples and traditional pepper pots will also be a part of Braata’s menu. “This is our food. We don’t need to replicate someone else’s food. Our food is already great.” And he’s not interested in awards. “If me being in Virgin Islands means there’s not enough people to eat my food to nominate me for an award, then guess what? I’m still fucking golden.”Now the chef is traveling between St. Croix, other Caribbean islands, and cities in the U.S., collaborating on pop-up events and making plans for his restaurant. “Digby finding his way back to the island is really full circle,” Gomez says. “He lives and breathes that place, and he’s so proud of the food and the culture.”“Personally, I’m happy that I’m going to have a warrior next to me, someone who loves this island as much as I do,” says Sibilly-Brown, who hosts events in the U.S. Virgin Islands to promote local foodways and farmers. “It helps young Virgin Islanders see that they can do it too.”“I accepted myself,” Stridiron says. “I’m not looking for anyone to say ‘Digby, you’re good’ or ‘Digby, your food is beautiful’ or ‘we see you’, I want my people to see me everyday.” It took a year of travelling but it feels good to be home, he says. “Before I’m a chef, I’m a Virgin Islander.”Korsha Wilson is a writer and the host of the podcast A Hungry Society. She lives in New Jersey.Explore Bon AppétitChefsCaribbean/Central AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-06", "author": ["Condé Nast", "Korsha Wilson"]}