{"id": "6aa7d7cc968b31f3ea8c2390b3e7ca23", "url": "https://www.bonappetit.com/story/enoki-mushrooms", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Enoki Mushrooms Are the Fungi You Should Be Cooking With | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Should Be Cooking with Enoki Mushrooms, the Easiest Fungi to LoveWe can't get enough of these long-stemmed, delicate 'shrooms.By Christina ChaeyMarch 2, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailGiant hot pots were family-dinner mainstays in my house when I was growing up. We'd grab a few of our biggest platters and pile them with thinly sliced meats, sliced savoy cabbage, scallion batons, and—my favorite—big bunches of snowy enoki mushrooms. As far as I was concerned, there were never enough of these delicate, long-stemmed 'shrooms to go around. \"You'll turn into a mushroom,\" my mother would say as she watched me single them out of the savory hot-pot broth and slurp them up as if they were noodles.My love for enokis has remained alive well into my adulthood, and I've now figured out how to slip them into lots of dishes beyond the hot pot. Enokis are unique among their mushroom peers because they're super mild in flavor; not at all like meaty oyster mushrooms or earthy shiitakes. It's almost as if their virtue lies in their ability to taste like nothing, which is how I feel (very lovingly) about tofu. They have a crunchy snap when raw, but I prefer them cooked, when they become something akin to an al dente vermicelli noodle, in a good way.Happily, restaurant chefs are also experimenting with enokis. At Geist in Copenhagen, pristine stems go Scandi with a sake and egg yolk sauce; at Contra in NYC, they're currently sautéed until golden and mixed with chopped crab atop a ladleful of savory mushroom broth with a petite buckwheat crepe.\"They're very sweet and clean and unlike any other mushroom,\" says Claire Welle, the chef at Otway in Brooklyn. \"When cooked, they make you salivate.\"Welle made enokis the main event in a dish at Otway this past fall, served with black truffle purée and pickled chestnuts. She treated her 'shrooms like steak, keeping the root ends mostly intact and searing them in a hot cast iron pan with thyme, garlic, and olive oil, finishing everything off with a little butter; I can't wait try out this technique on the next bunch I get my hands on.If, at this point, you've been convinced to bring enokis into your own kitchen, you're in luck: they're easier to find than ever. I used to only see them at Asian supermarkets, but, these days, I'm spotting them everywhere from Whole Foods to my corner grocery. I usually find them near the packaged, pre-sliced mushrooms—they often come in plastic packages with 4-5 bunches in each, which is plenty for a week's worth of experimenting. I take off the plastic and store them in my fridge in the same package they came in, mostly out of laziness (they do just fine for a few days this way). The one thing you want to avoid is exposing them to water of any kind, which will cause them to get slimy real quick.Want more ideas for how to use up a pack of enokis? Here are four to start: Wilt a handful of stems in a bowl of Black Barley with Mushroom Broth; quickly sauté them with sliced garlic and finish off with a splash of soy sauce and mirin; go enoki-crazy with our Sesame Arctic Char Donabe; bulk up a quickie weeknight ramen or homemade miso soup by adding a bunch or two of mushrooms to the broth in place of some or all of the noodles. The world is your mushroom.Explore Bon AppétitMushroomHealthyishRead MorecookingThese Are the Types of Mushrooms You Need to Know AboutBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-02", "author": ["Condé Nast", "Christina Chaey"]}