{"id": "6add633f36e0608e8d8de790125818a7", "url": "https://www.bonappetit.com/recipe/quick-cooked-kale", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Quick-Cooked Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueQuick-Cooked KaleBy Sohui KimFebruary 14, 20194.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintThis method of quickly cooking and then lightly dressing greens is borrowed from a popular Korean banchan. Try it with spinach, Swiss chard, or mustard greens as a quick weeknight side dish.Ingredients4 servings1large bunch purple or any other type of kale1Tbsp. grapeseed or extra-virgin olive oil2garlic cloves, finely chopped1Tbsp. perilla (sesame leaf) oil or toasted sesame oil1Tbsp. white or regular soy sauceKosher salt (optional)PreparationTrim woody ends from kale stems. Remove ribs and stems from leaves and thinly slice crosswise. Coarsely chop leaves; keep separate from stems. Heat grapeseed oil in a large skillet over medium. Cook stems, tossing occasionally, just until crisp-tender, about 3 minutes. Add leaves a handful at a time, tossing and letting wilt slightly before adding more; cook until all of the leaves are wilted, about 2 minutes. Add garlic, perilla oil, and soy sauce and cook, tossing often, until leaves are soft, about 3 minutes. Season with salt if needed.How would you rate Quick-Cooked Kale?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI wasn't a big fan of this recipe. I tried Swiss chard instead of the kale and it released a lot of liquid after cooking and then again when I reheated it. Not really wow-ed by the flavours, but I may try something similar next time. Jessm91Canada3/15/2019Have already redone it with kale or green leaf lettuce...or both together, if you really want more than three servingsAnonymousBuffalo, NY3/4/2019Explore Bon AppétitKoreanEast AsianAsianKaleLeafy GreensVegetableMustard GreensSpinachSwiss ChardQuickEasyWeeknight MealsSideDairy-FreeVegetarianVeganHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}