{"id": "6ae9aa578deebaa771e6cf0cc3a324fb", "url": "https://www.bonappetit.com/story/the-best-cobb-salad", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Amanda Shapiro on the Best Cobb Salad, CBD All Day, and My New Favorite Spritz | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Best Cobb Salad, CBD All Day, and My New Favorite SpritzAmanda Shaprio on the recipes she turns to when it's hot, humid, and her A/C is still broken.By Amanda ShapiroJuly 27, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.If July in NYC were a hashtag,It would be #swamplife. And my hair is NOT having it. Also on the subject of my hair, this illustration really sums it up: \"One would think it would be the other way around but unfortunately one would be wrong.\"When it's this hot and humid, and my A/C is still broken, certain recipes just call to me, like this Tropi-Cobb Salad, which I argue is even better than the traditional Cobb (the G.O.A.T. salad, don't @ me). It requires minimal stovetop time and delivers hits of crunchy, cool, sweet, and acidic. It's like air conditioning for your insides, or that's what I told myself as I went back for thirds.I also made this grilled salmon, and the lemon-sesame sauce was a revelation: Diced whole lemon (peel and all!) + shallot + honey + sesame + olive oil = YES, and beautiful too because we expect nothing less from Andy Baraghani, am I right?A month or so ago, BA editorial assistant Jesse Sparks asked if he could drink a bunch of juice shots for a week and write about the journey. I don't think either of us were expecting it to go the way it did. From Jesse: I had to avoid contact with people who sit along my path to the bathroom (because yes, I am going to the bathroom again. And yes, I did just go. And yes, I will be back.) Jesse, Healthyish salutes you and thanks you for your service. From the looks of it, you're back to solid food.Yesterday I went on internet TV to convince a couple of very nice men that CBD—which is showing up in everything from coffee to cocktails to, uh, pet food?—doesn't get you high. Who wants a Healthyish CBD recipe or two? Let me know what you think it should be: healthyish@condenast.comLastly, I Endorse:Making Aperol and Campari Spritzes with kombucha instead of sparkling wine. I've been using Mombucha's strawberry tonic, which adds cold-pressed strawberry and lemon juices to the kombucha base.Overhead photos of women eating in bathrooms and beds.Eating alone.Give Me Your Hand by Megan Abbott. Whenever Abbott comes out with a new book, I want to call in sick and glue my eyeballs to the page until I'm done. This one, about two women in a research lab, is FIRE. Excuse me, I feel a cough coming on.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyish NewsletterHealthyishKombuchaTrendsRead MorecultureHow to Beat a Hangover, Chicago-StyleBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-27", "author": ["Condé Nast", "Amanda Shapiro"]}