{"id": "6aeb8bada7e76a5453d3f290a64cf7bb", "url": "https://www.bonappetit.com/story/painkiller-cocktail-gladys-brooklyn", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "When It’s Too Hot to Think, I Need a Painkiller | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen It’s Too Hot to Think, I Need a PainkillerThe classic tiki drink from Glady’s in Brooklyn cools me right down—no beach required.By Alex BeggsJune 3, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are a lot of ways to cool down in the armpit days of summer. Personal face fans. Ice cubes tucked into bra bands. Whatever that big box is in my bedroom window. But the best way, in my opinion, is by drinking a Painkiller.It’s capitalized because it’s a patented drink by Pusser’s Rum, but I’ve only had the one made by Shannon Mustipher at Glady’s in Brooklyn. Her version follows Pusser’s recipe but omits the orange juice: 2 oz. Pusser’s rum (it must to be a real Painkiller, but don’t make me explain what Navy rum is, it’s too hot to think), 4 oz. pineapple juice, and 2 oz. cream of coconut. Shake all of that and serve over ice with freshly grated nutmeg on top and a wedge of orange to garnish.That is to say, a Painkiller tastes like the beach. (Which is fitting! It’s the official drink of the British Virgin Islands, originating at the famous Soggy Dollar Bar.) It’s creamy and tropical like a pina colada without the fuss of being frozen, with more acidic tang from the fruit juices. The rum, which has some deep molasses and baking spice notes, chills in the background so nearly undetectable you will want to order a third and get some sort of navy rum–themed tattoo on a boardwalk somewhere.I asked Mustipher why the drink is so perfect and she broke it down like the cocktail genius she is (check out her new book, Tiki: Modern Tropical Cocktails, for a sailor’s treasure trove of recipes): “The rum is kind of like having carbs, and the coconut cream is fat, and then you have sugar. And that’s why a cheeseburger is really popular, because the receptors in your brain respond very positively to the combination of those three elements.”And what about the name? “If you have any problems before you start having that cocktail, you won’t have problems after you finish it.”Go there: Glady’sExplore Bon AppétitHighly RecommendCocktailRumCoconut CreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-03", "author": ["Condé Nast", "Alex Beggs"]}