{"id": "6aee1a11e8f314a20ca4f9e412409524", "url": "https://www.bonappetit.com/story/nycs-most-exclusive-italian-restaurant", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Everything You Ever Wanted to Know About Rao's, NYC's Most Exclusive Italian Restaurant...But Couldn't Get in to Ask | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEverything You Ever Wanted to Know About NYC's Most Exclusive Italian Restaurant...But Couldn't Get in to AskThe hardest reservation in New York is Rao’s, a one-room red sauce joint in East Harlem. Co-owner Frank Pellegrino Jr. gives us a peek through the hallowed red door.By Aliza AbarbanelApril 16, 2019FacebookTwitterEmailPhoto by JONATHAN BECKERFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Getting a seat at Rao’s is like buying a time-share. Since 1896 the tiny Italian-American restaurant has been serving up family-style lemon chicken and seafood salad beneath strings of Christmas lights on a corner in East Harlem. But after New York Times food critic Mimi Sheraton gave it a three-star review in 1977, Rao’s enacted a notoriously strict reservation system to preserve its devout community of regulars. Now table assignments are made in weekly, monthly, or annual increments, and only a rare few get inside. Forget being somebody—you need to know somebody to get past co-owner Frank Pellegrino Jr. (His father, Frank Pellegrino Sr., was nicknamed Frankie No for his stalwart ability to turn away celebrities and regular folks alike.) After decades of gossip about what exactly goes on inside those red doors, we sat down with Frank Jr. to set the record straight.Rao's opened on this corner in East Harlem in 1896 (no, that's not a typo).\nPhoto by JOHNNY MILLER/Courtesy of Rao'sJust getting a table at Rao’s is tough enough. How does someone manage to get their photo on the wall?Regulars will bring in someone who is notable and then it’s a matter of, “Hey, send me a picture, sign it, and I’ll put it up on the wall.” People don’t bring in photos as much as they used to, but they do send me electronic photos, and I print them out. We pay homage to the people up on the wall: We very rarely take down anyone’s photo.Let’s talk menu. Are all of the “family” recipes really from your family?That’s one of the most beautiful things about the restaurant. Every dish is a family recipe that has been passed on from generation to generation, including the sauce that we sell in the markets. They all come from my Grandmother Paulina, Aunt Anna, and Uncle Vincent, and are recipes that were brought over from Italy. My dad and my aunt collaborated together on pretty much all the staple dishes, and now my chef Dino [Gatto] is involved. The recipes themselves evolve but their origins remain tried and true.Speaking of the Rao’s jarred sauces, do you ever use them in the restaurant to save time?We always make the sauce at the restaurant fresh, but I can assure you it’s the same recipe. Of course it’s scaled different, but the mechanics are all the same. That recipe came from my great-grandmother, my aunt Anna, and my dad, and it changes over time. It’s that same human touch—I’ll use the structure of the recipe but put a dash more salt or this much less oregano—and it becomes a rhythm, a routine, second nature.These saucy meatballs, made from a mix of veal, beef, and pork, are just as iconic as Rao's red doors.\nPhoto by JOHNNY MILLER/Courtesy of Rao'sHas the menu evolved?You have to be sensitive to what’s going on in the marketplace and the palates of our guests. Scungilli [sea snails cut into pieces] isn’t a big hit and I’m happy about that because it’s a big pain in the bottom to clean scungilli and put it in our seafood salad. But when I was younger, working as a waiter, if I didn’t put scungilli in the seafood salad I would have cut my hands off.How much parm do you go through in a week?In Las Vegas alone (we opened there in 2006) we go through probably a wheel and a half to two wheels every ten days. It’s about 84 pounds a wheel. I go through probably a wheel of parm a month in Los Angeles (opened in 2013), and in New York, almost the same. Of course we use other kinds of cheese too, like Locatelli and Pecorino Romano.Who gets to pick the music in the restaurant?We have a jukebox in every restaurant with a wonderful selection of music. Now the younger generation—which is me (and which is not so young anymore)—has expanded the spectrum. I have to honestly say that my favorite jukebox right now is the one in L.A. It’s just dynamite. It covers everything: the Eagles, the Beatles, the Stones.What about the one at the original NYC location?Back in the day our jukebox was one of the most notable jukeboxes in the city of New York. It was all Motown, doo-wop, Sinatra, Rat Pack stuff, a lot of the classics, and programmed by a dear friend of my father’s. That jukebox was the catalyst for two albums that my dad created; the first was called An Evening at Rao’s, and it was part and parcel of our first cookbook launch in the ’90s. It’s comprised of 17 songs, one of which my father performs. It’s called “The Ham (Le Cabotin).”Settle a debate: What’s the difference between gravy and sauce?Gravy is made with meat, like Sunday gravy. We actually do it in L.A. every Sunday, and it's a smashing success—you have braciole, sausage, meatballs, short ribs that are braised for hours...an abbondanza of food. We do it occasionally as a special in New York and Vegas, but the feeding capacity in the restaurant in Vegas is close to 400 people so I’d have to build a separate facility to do it regularly.Aliza Abarbanel is an assistant editor at Bon Appétit.Explore Bon AppétitRestaurantsNew York CityItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Aliza Abarbanel"]}