{"id": "6aef2110b16804c602ce317ba896b6f7", "url": "https://www.bonappetit.com/story/steak-knives-roland-lannier", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Are the Best Steak Knives I’ve Ever Owned | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Insanely Expensive Steak Knives Are the Best I’ve Ever OwnedThey’re chic, they're practical, they’re a cut above the rest.By Andy BaraghaniDecember 11, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI live in a New York City apartment, which means I don’t have a lot of space, which in turn means everything I buy needs to be utilitarian. Whether it’s a slotted spoon or chef’s knife, it needs to be the best, most functional version of itself. If it aesthetically stands out, that adds another layer. Ideally, it’s a combo of both. Part of the way I find tools like this is by paying attention when I eat out at restaurants. I’m that diner who inspects every glass, plate, and piece of cutlery.When I saw these Tableware’s Not Dead steak knives from maker Roland Lannier at NYC’s Contra, I knew I had to have them. For so long, restaurants have been serving their steaks with serrated knives, which actually rip through the meat. These straight-edge blades (yes, the more curved side is actually the dull side) make a clean slice, not a ragged tear. It feels just like slicing through a stick of butter.The perfect balance of beauty and utility.\nPhoto by Alex LauTheir slick shape is modern yet classic, and the handles come in different materials, from wood to bamboo, and more. Each set is different and unique. Sure they cost a pretty penny, but it’s about investment here. These are knives I'll never need throw away. This year, I’ll be gifting them to my friends in need of some oomph in the tableware department. Then they’ll be ready to host a dinner party that will pass any picky guests’ inspections. Myself, of course, included.Buy it: Tableware's Not Dead steak knives, $400 for set of four at eatingtools.comYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools (and Skor bars!!!) for holiday cookies. More details here.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitGift Guidesholiday2018KnivesToolsShoppingRead MorecultureThe Cookbook Gift Guide That Covers EVERYONE You KnowGallery12 SlidesBy Alex Beggsculture13 Tasteful Gifts Under $50Gallery13 SlidesBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Andy Baraghani"]}