{"id": "6af39ce3a74c1f8886d895c8f7a2d075", "url": "https://www.bonappetit.com/story/green-coconut-chutney", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "I Always Keep Coconut In My Freezer For This Green Chutney | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Always Keep Coconut in My Freezer for This Green ChutneyTangy and herbaceous, it’s as good on sourdough toast as it is with a fresh dosa.By Ananya Kumar-BanerjeeJuly 21, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Kat BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I owe my love of coconut chutney to one person: my chithi pati (maternal grandmother’s sister). The first time I had her coconut chutney, alongside dosa, was when I studied abroad in India a few years ago. It was a sultry October day and I walked into my chithi pati’s apartment in Mumbai. She asked if I was hungry. “No, Vimala chithi, I’m okay.” Silently, she trod off into the kitchen and began cooking anyway.Before the COVID lockdowns, I used to just go home for real South Indian food. But with travel restrictions, I’ve been trying to re-create that same food in my apartment. I’ve made this coconut chutney—a Tamil speciality and, for me, a gift from my Vimala chithi pati who lives across the ocean—more than a dozen times.Coconut chutney comes in white and green varieties. In order to make white chutney, you usually need fresh coconut, but considering the constraints of living in New England and being enrolled in school, I find the green version, made with frozen grated coconut, to be much more attainable. (Since white coconut chutney relies on the coconut for the entirety of its flavor, on the other hand, it’s important to have the freshest coconut meat available—frozen doesn’t cut it.) Traditionally, chutneys are made using a mortar and pestle, but for my purposes, a food processor or blender suffices.To make it, start by washing 1 bunch cilantro, chopping the leaves and tender stems, and discarding the bottom few inches of the stems which tend to be tougher. Add cilantro to a food processor or blender along with 4–5 small green chiles (or “hari mirchi”) and a squeeze of lemon or lime juice to smooth out the mixture. Once green chile seeds have been visibly broken up, add about ½ cup frozen grated coconut, thawed, along with 1 teaspoon kosher salt and 2–3 tablespoons whole-milk yogurt (preferably desi yogurt, which is more sour than other types of yogurt). Taste the mixture: It should be salty and sour. Add approximately 1 teaspoon tamarind concentrate (this gives the chutney its characteristic sourness) and blend until smooth, adding more coconut and tamarind to taste. Eat immediately or transfer to an airtight container—it will last for about 1 week in the fridge.I like to eat my green chutney on sourdough toast with fresh ricotta, on crackers as an afternoon snack, or alongside instant dosas (I use the MTR instant mix). To be honest though, I’ll be counting down the days until I can see my chithi pati again. There really is nothing like fresh green coconut chutney alongside a homemade dosa, especially when it comes from someone who loves you.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-21", "author": ["Condé Nast", "Ananya Kumar-Banerjee"]}