{"id": "6b0644e12c459afb7d1472628b9c6d76", "url": "https://www.bonappetit.com/recipe/mortadella-appetizer", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Mortadella Appetizer Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueMortadella MomentsBy Andy BaraghaniNovember 20, 20183.4(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis party-ready dish hits all the right notes—bready, fatty, pickle-y—in a single bite-sized portion, delivering maximum satisfaction with the least amount of friction.Ingredients8 servings18x8\" piece of focacciaMayonnaise (for spreading)2lb. very thinly sliced mortadella16peperoncini, halved or quartered if very largePreparationHolding a bread knife parallel to a cutting board, slice focaccia in half. Spread cut sides with mayonnaise and cut each half into 2\" squares. Working one at a time, drape mortadella onto squares, top with peperoncini, and secure with skewers.How would you rate Mortadella Moments?Leave a ReviewTell us what you thinkExplore Bon AppétitChileVegetableMortadellaCured MeatMeatEasyQuickStarterSnackNut-FreeDairy-FreeNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}