{"id": "6b0746d3861ed18c8bb15b71df3cd36d", "url": "https://www.bonappetit.com/story/cicely-tyson-purple-dinner-party", "year": 2021.0, "month": 1.0, "day": 5.0, "content": "Cicely Tyson on the Star-Studded, Very Purple Dinner Party of Her Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCicely Tyson on the Star-Studded, Very Purple Dinner Party of Her DreamsThe groundbreaking actress died yesterday at 96. We talked to her for our March issue about her new memoir and her perfect menu.By Dawn DavisJanuary 29, 2021FacebookTwitterEmailIllustration by Joana AvillezFacebookTwitterEmailEditor's note: Award-winning actress Cicely Tyson died January 28, 2021, at the age of 96. This interview, which was done in December 2020, will be published in our upcoming March issue. We’re running it online today in light of Tyson’s passing.Welcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.When does an icon know she’s truly made it? For Cicely Tyson, who’s earned two Emmys—for The Autobiography of Miss Jane Pittman, which made her the first African American woman to win for Best Actress—a Tony, and the Presidential Medal of Freedom, that day has yet to arrive. “Even at 96 I am still arriving,” she explains in her new memoir, Just As I Am, which the New York Times calls “a balm for the afflicted.”In the book, the interplay between civil rights activism and the arts is explored. So too is food. Before she married Miles Davis, the famed musician courted her with meals. “He’d invite me over anytime there was cooking. First of all, that man loved to eat. Second, he did not like to be alone. His house bustled with folks coming in and out, the smell of oxtails mixing with the sound of laughter.” Since Tyson is ready to reflect, we asked her a few questions for our inaugural Dream Dinner Party column. In the book you describe casual dinner parties thrown by Maya Angelou almost as if she always had a pot of something on the stove. But in your memoir you never cook; you’re busy working! If you were to throw a great dinner party—I know we all miss gathering—would you have someone cook for you?My friends B Michael and his partner Mark-Anthony Edwards are terrific hosts. Mark-Anthony would cook and B would dress an elegant table.What dish must be served?The main course is one of my favorites: roast duck, served with roasted heirloom carrots, fingerlings lyonnaise, and black cherry port au jus. We’ll end with a black cherry clafoutis along with vanilla sorbet.If you could invite anyone, dead or alive, who would it be?I’m lucky enough to have many friends whose stamp on history is public:Valerie Simpson-Ashford, singer-songwriter of Ashford & SimpsonLenny Kravitz, singer- songwriter, also my godsonDr. E. Faye Williams, national president, National Congress of Black Women, Inc.Diahann Carroll, an actress and close friend. In the book I describe her as “swelegant.”Miles Davis, jazz trumpeter, ex-husband, my dream guestB Michael, my couturier, one of the greatsMark-Anthony Edwards, CEO and cofounder, B Michael GlobalFaye Wattleton, a dear friend. She had a big impact on the pro-choice movement and the world of reproductive health, and is now the cofounder and director at quantum computing company EeroQ.Tyler Perry, close friend, father to one of my godsons, and founder of Tyler Perry Studios, home to the Cicely Tyson SoundstageIs it casual or dressy?It’s dressy and the guests are invited to wear purple.What subject must be discussed?Each guest would be invited to share one thing about themself that no one else knows.Buy her memoir, Just As I Am, published by HarperCollins in January, on Amazon or Bookshop.Explore Bon AppétitDream Dinner PartyCelebritiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-29", "author": ["Condé Nast", "Dawn Davis"]}