{"id": "6b0ec798d592dea98b9062eba8eeff48", "url": "https://www.bonappetit.com/recipe/camarones-con-relajo", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Camarones con Relajo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueCamarones con RelajoSeptember 22, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintThe glory of head-on shrimp is sucking all the sweet, briny juices out of their heads, so try to seek out shrimp that are both shell-on and head-on for the full experience. If that’s not an option, shell-on shrimp will also do the trick. Eat them shells and all to take advantage of their crispy yet tender texture. This recipe from chef Anthony Salguero of Popoca in Oakland is inspired by a dish he ate at La Cocina Central in San Salvador.Ingredients4 Servings1lb. extra-jumbo shell-on shrimp, preferably head-on2Tbsp. Relajo1tsp. Diamond Crystal or ½ tsp. Morton kosher salt4Tbsp. extra-virgin olive oil, divided6garlic cloves, thinly sliced2Tbsp. sour cream3limes, halved1cup coarsely chopped cilantroFlaky sea saltPreparationStep 1Using kitchen scissors and working one at a time, cut through shrimp shells along the length of their backs just deep enough into flesh to expose the vein; remove. Pat shrimp dry.Step 2Toss shrimp with Relajo, kosher salt, and 1 Tbsp. oil in a medium bowl. Heat remaining 3 Tbsp. oil in a large skillet over medium-high. Cook shrimp in a single layer, undisturbed, until crisp and browned underneath, about 2 minutes. Turn over and cook until crisp on the other side, about 1 minute. Immediately add garlic and cook, shaking pan often, until garlic is just golden, about 1 minute.Step 3Remove pan from heat and stir sour cream and 2 Tbsp. water into shrimp (it will look split). Squeeze in juice from limes and add cilantro. Transfer to a platter; sprinkle with sea salt.How would you rate Camarones con Relajo?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI have made this recipe about a dozen times.  It is always delicious and can be prepared quickly, once you have assembled the Relajo spices.  I keep a jar of the pre-made Relajo spices in my spice cabinet and can literally make this fabulous dish in minutes.JuliaPortland, OR8/14/2021Explore Bon AppétitSalvadoranCentral AmericanLatin AmericanShrimpShellfishSeafoodEasyQuickMainStarterGluten-FreeKetoSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}