{"id": "6b11be5af87f1bfc1e87a499040389ed", "url": "https://www.bonappetit.com/recipe/spiced-pecans", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Spiced Pecans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueSpiced PecansBy Maricela VegaJanuary 12, 20214.6(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, Food Styling by Sue Li, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintPecans are a favorite Southern source of protein for Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora. Growing up, she would eat them straight-up raw or lightly toasted, but this is her go-to preparation now: sweet, salty, and coated with freshly ground spices. Eat them by the fistful or sprinkle them liberally on salads or grilled veggies for deep flavor and crunch.IngredientsMakes about 4 cups1tsp. fennel seeds1tsp. ground coriander1tsp. freshly ground black pepper1tsp. paprika5garlic cloves, finely grated4cups raw pecan halves1Tbsp. grapeseed oil1Tbsp. honey, preferably local2tsp. Diamond Crystal or 1 tsp. Morton kosher saltSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Preheat oven to 350°. Grind fennel seeds in a spice mill or with a mortar and pestle. Transfer to a medium bowl and mix in coriander, pepper, and paprika. Add garlic, pecans, oil, honey, and salt to spice mixture and toss to coat.Step 2Spread out pecan mixture on a parchment-lined baking sheet. Bake, rotating baking sheet and stirring pecans halfway through, until golden brown and toasted all the way through, 13–15 minutes. Let cool.Step 3Do ahead: Nuts can be made 1 week ahead. Store airtight at room temperature.How would you rate Spiced Pecans?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleReally delicious recipe. I would heavily advise mixing wet ingredients first, then adding spices, and finally adding the pecans for an even distribution of ingredients over the nuts, rather than in the order printed. Jack HUnited Kingdom2/17/2021Explore Bon AppétitPecanNutEasyQuickStarterSnackGluten-FreeDairy-FreeVegetarianVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}