{"id": "6b152d43acdce6f85220cd9d9307551d", "url": "https://www.bonappetit.com/story/why-we-love-gigante-beans", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Why We Love Gigante Beans, the Creamiest, Most Satisfying Legume Around | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy We Love Gigante Beans, the Creamiest, Most Satisfying Legume AroundWe like big beans and we cannot lie.By Aliza AbarbanelJanuary 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIf Jack and the Beanstalk were a true story and not a cautionary fairytale, I am confident that the titular beanstalk would have sprouted from a handful of gigante beans.  As their name suggests, these beans are big. And, we'll be honest, it's this bean's substantial size that's made it an undisputed Healthyish favorite—marinated big beans are a major part of the Feel Good Food Plan’s prodigious lunchtime meal prep, and the show-stopping star ingredient of a recent brothy bean stew. So, beyond the obvious aesthetic impact, why are these beans so beloved, and, just as importantly, where can you get them?“They announce themselves in a different way,” says senior food editor Chris Morocco. “In a salad they work differently than smaller beans because they hold their shape and are really creamy inside.” That sturdiness makes big beans ideal for meal prep and a hearty addition to soups and stews. “For the brothy beans and farro, I really wanted to showcase big beans with little contrasting sprinkles of farro,” says senior food editor Andy Baraghani. “Because these beans are flatter and wider, they really draw the eye.”Proper gigante beans can be tricky to track down, but Amazon is a great resource for dried gigantes. Butter beans and corona beans are also excellent, inexpensive substitutions. Goya butter beans are available at many grocery stores (and Amazon) and have an extremely similar shape and texture. Our test kitchen is also fond of Rancho Gordo’s dried royal corona beans, which can be ordered online. Their size might translate into longer cook times than smaller varieties of dried beans, but you can toss them in a pressure cooker for tender, creamy beans in under an hour. And for more tips on dealing with dried beans, refer to this handy bean primer. Now, start tracking down some big beans! A whole new world of legumes awaits.Make some brothy big beans:Brothy Beans and Farro with Eggs and MushroomsStirring a raw egg yolk into each bowl at the end adds silkiness, heft, and protein.View RecipeExplore Bon AppétitHealthyishBeanRead MorecookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Aliza Abarbanel"]}