{"id": "6b1e97cb9daac6d6cf22d40de8a0fd48", "url": "https://www.bonappetit.com/recipe/green-goddess-salad", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "Anything-Goes Green Goddess Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAnything-Goes Green Goddess SaladBy Molly BazMay 31, 20204.8(46)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Molly Baz EmailPinterestPrintEmailPinterestPrintThis pick-your-own-protein salad is all about the green goddess dressing, an herby, punchy, creamy green sauce that originated in San Francisco in the 1920s. It's just as delicious as it is versatile: You can use any combo of tender herbs (cilantro, mint, basil, parsley, dill, tarragon, chives), cultured dairy (yogurt, sour cream, buttermilk, labneh, crème fraîche), and acid (lemon juice, lime juice, unseasoned rice vinegar, apple cider vinegar) you'd like, which means you're never more than a whiz away from a batch. Mix it into shredded poached and chilled chicken breasts, high-quality canned tuna, chickpeas, or boiled-and-chopped eggs. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonPlatter$29 At AmazonIngredients2-4 servings3(heaping) cups tender herbs (such as dill, parsely, cilantro, basil, mint, tarragon, and/or chives½cup mayonnaise½cup plain whole-milk yogurt, sour cream, buttermilk, crème fraîche, or labneh (Lebanese strained yogurt)2Tbsp. extra-virgin olive oil1Tbsp. drained capers1garlic cloveKosher salt2lemons, dividedFreshly ground black pepper2chilled cooked medium skinless, boneless chicken breasts (about 1 lb.), one 15-oz. can chickpeas, 8 boiled eggs, or three 5-oz. cans oil-packed tuna2celery stalks1ripe avocado1head Bibb, butter, romaine, or iceberg lettucePotato chips (for serving)PreparationStep 1Combine 3 (heaping) cups tender herbs (such as dill, parsely, cilantro, basil, mint, tarragon, and/or chives), ½ cup mayonnaise,  ½ cup plain whole-milk yogurt (or sour cream, buttermilk, crème fraîche, or labneh), 2 Tbsp. extra-virgin olive oil, 1 Tbsp. drained capers, 1 garlic clove, and a big pinch of kosher salt in a blender.Photo by Molly BazStep 2Finely grate zest of 1 lemon into blender. Cut lemon in half and squeeze in juice through your hand or a fine-mesh sieve to catch the seeds. Blend on high until bright green, and speckled with small pieces of herbs. Taste dressing and season with freshly ground black pepper and more salt as needed.Step 3If using 2 chilled cooked medium skinless, boneless chicken breasts (about 1 lb.), slice against the grain 1\" thick. Tear each slice into bite-size pieces. If using one 15-oz. can chickpeas, drain and rinse well. If using 8 boiled eggs, peel and cut into bite-size pieces. If using three 5-oz. cans oil-packed tuna, drain and flake with a fork into bite-size pieces. Place protein of choice in a medium bowl.Step 4Add ¼ cup dressing to protein and mix well to combine. Place remaining dressing in a small bowl and set aside for serving.(This is tuna!)\nPhoto by Molly BazStep 5Remove any leaves attached to 2 celery stalks. Thinly slice stalks on a diagonal and mix into salad. Season with salt and pepper. Top with any celery leaves.Step 6Cut 1 ripe avocado in half. Remove pit, scoop flesh out of skin, and cut into ½\"-thick wedges.Step 7Separate leaves of 1 head Bibb, butter, romaine, or iceberg lettuce. Wash and dry leaves thoroughly.Step 8To serve, place bowl of salad and reserved dressing on a platter and arrange lettuce, avocado wedges, and a big pile of potato chips around. Slice remaining 1 lemon into wedges. Drizzle a bit of juice over avocado. Arrange lemon wedges on platter. Season avocado with some salt and a crank or two of pepper.Photo and Food Styling by Molly BazHow would you rate Anything-Goes Green Goddess Salad?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThe reviews on this recipe are so fun, and I loved it. The dressing is so fresh and flavorful and the dish is super easy. I served with salt and vinegar chips, as recommended, and scooped the salad up with the chips. My only complaint is that I used buttermilk as the dairy and found the dressing to be lacking heft. Next time I will use greek yogurt as recommended.nilssonsBoston, MA3/14/2022Yummy with the option of Greek Yogurt! Adjust garlic and amount of capers according to taste. AnonymousBoulder CO1/4/2022Anchvies..paste or little fishies......AliceAlbuquerque, NM11/9/2021Good lord this recipe. I have loved so so SO many recipes over the years for BA, but like..this one is my favorite. I love this so much I just about make it every week. I LOVE how quick, flavorful, and easy this is. Like you literally cannot go wrong. Herbs, dairy, acid. The formula is virtually unbreakable. My ~preferred~ version of this is using either plain kefir or whole milk Greek yogurt as the dairy, a whole, fresh lemon for acid, and the combo of herbs that are my fave are parsley, dill and basil (sometimes chives if I have them). I dream about this salad dressing. I wake up and crave it. The best way to eat either either with canned tuna or I usually cook chicken breasts in my crockpot and then used the shredded meat. I used romaine lettuce for the lettuce cups, as I prefer to I eat it that way rather than actually use it as a salad dressing, although that is great too!! But I will DIE on the hill that this needs to be served with salt and vinegar chips. Like please PLEASE take your extra dressing and use it as a chip dip. Please. For me. It’s so worth it. \n\nI know Bon Appetit likes to compile the readers best recipes and I want everyone to know this is mine. This is the best recipe out here. And I have made and loved several others multiple times (pork Sambal noodles, BAs best chocolate chip cookies, etc) and this is still my top one. Taylor Y. Des Moines, IA10/13/2021Wowza!!!  Flavor bomb!!!  Love the flexibility.  I sought out this recipe as a way to use a boatload of not exactly crisp tarragon.  I was afraid it would knock over every other flavor.  No need to worry!  It is smashing!  I doubled the garlic (who can blame me?), threw in what was laying around in the fridge (chives, a few bits of parsley, and a fistful of past-it basil).  All those herbs plus the dairy and mayo managed to balance out with what I thought would be an overwhelming dose of tarragon.  I eyeballed the mayo, dairy, and oil, and I only had so much lemon, about 1 tbsp, because why dirty measuring spoons?  This approach is fun, but I think I erred on the oil/dairy balance.  While I ate my salad, the dressing looked like it wanted to break, or was maybe starting to do it.  I might have been too light on the mayo, or not emulsified it enough.  Betty Rubble0173010/13/2021Using only what I had in the kitchen , cilantro, parsley, chives, dill, Mayo, sour cream, garlic, capers, preserved lemon, olive oil\nAwesome! Added a little water to thin out.\nNext time I want to try tarragon parsley shallot .\nThis is a seriously excellent “go to” dressing!\nBe creative & enjoy!AnonymousSaint Michael MD.8/29/2021Made this during quarantine watching Molly's live video; it was so deliciouuuus!\nI made mine with Tuna, mayo, sour cream, parsley and cilantro. Definitely making it again. Yannin2/4/2021WOW. This dressing though. Going to find any and all excuses to use it as much as I can. 10/10Raquelle New York1/21/2021So so so good! I come back to this recipe often. Love the dressing, love the crunch from the celery and chips, love that it is forgiving (have made without chicken, have made with many different herbs/ratio of herbs.) Like many other in the comments, usually just make as a salad or keep the romaine leaf how to use as a lettuce wrap or just dip the chips in the dip :)AnonymousSan Diego, CA12/10/2020dream salad and of course the dressing is to die for. I threw the dressing in a bowl with romaine, diced avocado and salt & vinegar chips and was licking the bowl at the end.\nperfect WFH lunch for one or many. New York10/30/2020dream salad and of course the dressing is to die for. I threw the dressing in a bowl with romaine, diced avocado and salt & vinegar chips and was licking the bowl at the end.\nperfect WFH lunch for one or many. New York10/30/2020yum! used cilantro, basil, mint, and scallion and cut down on the oil/dairy.Anonymous9/11/2020I LOVE this dressing!! Used chives, parsley, and cilantro because it’s what I had on hand. Just made it for the second week in a row. Personally wasn’t a fan of the serving suggestions but found it delicious with chicken a tortilla wrap or just over a salad. AnonymousVictoria, BC7/27/2020This dressing is killer. Personally, the food styling made no sense to me so I just mixed it all up as a regular salad and it was fine that way. Salt & vinegar chips on the side or crumbled on top take it to the next level for sure. AnonymousSaint Paul, MN7/1/2020This may be a dumb question, but how are you meant to eat this salad? Are you supposed to mix it all together, or eat it more like a veggie/snack platter? The deconstructed component threw me off, so I ate mine as a bed of lettuce with toppings all thrown together.  I used hard boiled eggs and while it was fine, I think I'd go a different route with the protein next time. I'm super excited to mix and match different ingredients to find my fav combo because this dressing is wonderful! I love how simple and riffable this recipe is.AnonymousAustin, TX6/30/2020Explore Bon AppétitSaladAmericanChickenPoultryChicken BreastAvocadoVegetableLettuceLeafy GreensButtermilkOther IngredientsYogurtEasyMainGluten-FreeNut-FreeKetoLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-31", "author": ["Condé Nast", "Molly Baz"]}