{"id": "6b33a48f9c3062a92fe606ea6bc36dda", "url": "https://www.bonappetit.com/recipe/red-snapper-shrimp-ceviche", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Red Snapper and Shrimp Ceviche with Avocado Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueRed Snapper and Shrimp Ceviche with AvocadoBy Commander’s Palace, New Orleans, LAFebruary 9, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintTaste the ceviche after you have let it sit 20 minutes. We like our ceviche just done but you can go a few minutes under or over depending on your preference. This recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings1medium shallot, very thinly sliced into rounds⅓cup (or more) fresh lime juice¼cup fresh orange juice1tsp. crushed red pepper flakes8oz. best-quality skinless, boneless red snapper fillet, cut into ½\" pieces8oz. rock shrimp, halved lengthwise, or small shrimp, peeled, deveined,  cut into ½\" piecesKosher salt2avocados, chopped1mango, chopped114-oz. can hearts of palm, drained, sliced crosswise6canned piquillo peppers or roasted red peppers from a jar, finely chopped1½cups torn mixed tender herbs (such as basil and/or cilantro)2Tbsp. extra-virgin olive oilPreparationStep 1Combine shallot, lime juice, orange juice, and red pepper flakes in a large bowl. Add red snapper and shrimp, season with salt, and toss gently to combine. Let sit, tossing occasionally, until fish firms up slightly, 20–25 minutes.Step 2Add avocados, mango, hearts of palm, piquillo peppers, herbs, and oil to ceviche and toss to coat. Taste and season with more salt and/or lime juice if desired.How would you rate Red Snapper and Shrimp Ceviche with Avocado?Leave a ReviewTell us what you thinkExplore Bon AppétitCevicheSnapperFishSeafoodShrimpShellfishLimeCitrusFruitAvocadoVegetableQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeRawPickle and PreserveDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}