{"id": "6b558cf32b9b31252c1bd4fb6c520311", "url": "https://www.bonappetit.com/recipe/pomegranate-glazed-chicken-with-buttery-pine-nuts", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Pomegranate-Glazed Chicken with Buttery Pine Nuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssuePomegranate-Glazed Chicken with Buttery Pine NutsBy Andy BaraghaniJanuary 9, 20184.4(7)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThe yogurt in the marinade, along with the honey and pomegranate molasses in the glaze, will give the chicken lots of color. Go with it. The very dark charred parts are extra tasty.Ingredients4 servings4garlic cloves, finely grated¼cup plain whole-milk yogurt (not Greek)⅓cup plus 2 tablespoons pomegranate molasses4tablespoons honey, divided2tablespoons Diamond Crystal or 3½ teaspoons Morton kosher salt, plus more13½–4-pound chicken, backbone removed, halvedExtra-virgin olive oil (for drizzling)2tablespoons unsalted butter¼cup pine nuts or blanched slivered almonds1½cups pomegranate juice, room temperature1lime, halvedPreparationStep 1Combine garlic, yogurt, ⅓ cup pomegranate molasses, 2 Tbsp. honey, and 2 Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt in a large resealable plastic bag. Place chicken in bag and seal, pressing out any air; turn to coat. Chill, turning occasionally, at least 12 hours and up to 2 days.Step 2Let chicken sit at room temperature 1 hour before cooking.Step 3Place a rack in top position of oven; preheat to 450°. Stir remaining 2 Tbsp. pomegranate molasses and remaining 2 Tbsp. honey in a small bowl.Step 4Drizzle enough oil to barely coat the bottom of a large heavy skillet, preferably cast iron, that can hold both chicken halves (or you can roast chicken on a foil-lined rimmed baking sheet). Remove chicken from marinade, letting excess drip back into bag, and place in skillet, skin side up. Pat chicken dry with paper towels; season lightly with salt. Brush or spoon pomegranate molasses mixture evenly over skin.Step 5Roast chicken until skin is lacquered and deep mahogany over most of surface and juices run clear when thigh meat is pierced with a knife, 25–30 minutes. Transfer to a cutting board and let rest 15 minutes.Step 6Meanwhile, melt butter in a small skillet over medium-low heat. Cook pine nuts, tossing often, until golden and mixture smells nutty (don’t let the butter burn), about 3 minutes. Scrape buttery pine nuts into a small bowl and season with salt.Step 7Pour pomegranate juice into a large bowl or shallow platter and squeeze in lime. Season with a large pinch of salt and stir to dissolve. Add chicken to bowl (or divide between 2 shallow bowls) and spoon buttery pine nuts over to serve.How would you rate Pomegranate-Glazed Chicken with Buttery Pine Nuts?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is delicious! I baked a 6lb chicken at 450 in 45 minutes. LENSTOLETHESUNSHINEPhilomath,Oregon8/12/2020So easy and so flavourful!AnonymousToronto11/9/2019This was delicious!  The chicken was so moist and flavorful.  Will definitely make this again. Marie SauterNY8/4/2019Explore Bon AppétitMiddle EasternPomegranateFruitChickenPoultryPine NutNutYogurtOther IngredientsEasyMainGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}