{"id": "6b5b1b7bb54322449dee8381cdf9cdeb", "url": "https://www.bonappetit.com/recipe/red-chile-chicken", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Red Chile Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRed Chile ChickenBy Rick MartinezJanuary 16, 20195.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis spicy-sweet chicken, originally developed for our Chile-Chicken Nachos, transforms a rotisserie bird into a versatile filling for enchiladas, tacos, burritos, and more.Ingredients4 servings2Tbsp. extra-virgin olive oil½medium red onion, chopped2garlic cloves, chopped1Tbsp. achiote paste or tomato paste8ancho chiles, stemmed, seeded1chipotle chile in adobo, chopped (or 1 Tbsp. adobo sauce to keep things mild)3cups low-sodium chicken stock1tsp. ground cumin2tsp. kosher salt, plus more1rotisserie chicken, meat pulled from bones and shreddedPreparationStep 1Heat oil in a large saucepan over medium-high until shimmering. Cook garlic and half of onion, stirring occasionally, until tender and beginning to brown, 6–8 minutes. Stir in achiote paste and cook, stirring occasionally, until brick red, about 1 minute. Add ancho chiles, chipotle chile, stock, cumin, and 2 tsp. salt and bring to a boil. Cover, remove from heat, and let sit until chiles are very soft, about 30 minutes.Step 2Transfer chile mixture to a blender and purée until smooth. Return to saucepan, stir in chicken, and bring to a simmer over medium-low heat; season with salt.How would you rate Red Chile Chicken?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleStep 1 says to use half the onions. When do we use the other half?DavidEugene, OR11/14/2020Question - Should I use fresh Ancho Chiles or Dried? AnonymousScottsdale, AZ6/11/2020This is so good and simple to make– I used it as a filling for tacos with corn tortillas and homemade salsa and everyone loved it! New York, NY5/4/2020Love how this video and how it demonstrates all the ways to make chicken!!! Genevieve.G.GuerreroPhoenix, AZ 1/6/2020Explore Bon AppétitChipotleChileVegetableAncho ChileChickenPoultryEasyMainNut-FreeDairy-FreeGluten-FreeKetoSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Rick Martinez"]}