{"id": "6b5e9fc0426704e9b17684f359a7a0ce", "url": "https://www.bonappetit.com/story/angie-mar-and-audi-light-a-fire-to-empower-women-in-the-hospitality-industry", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Angie Mar and Audi Light a Fire to Empower Women | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAngie Mar and Audi Light a Fire to Empower Women in the Hospitality IndustryBy Audi Q3October 25, 2019FacebookTwitterEmailFacebookTwitterEmailThis video is part of a four-part series with Audi Q3, Bon Appétit, and Condé Nast Traveler highlighting Audi's elevation of female servers, managers, chefs, and owners in the hospitality industry.In August 2019, Audi invited guests to a progressive culinary experience hosted by New York chef Angie Mar. They were handed the keys to the all-new Audi Q3 for anyone that wanted to experience a next-level automobile. The four-day pop-up event was held not only to celebrate progressive experiences, but the women servers, managers, chefs and owners of the hospitality industry.Earlier this year Audi launched PROOF, the Audi Culinary Dinner series, a multi-city showcase of women chefs and graduates of the James Beard Foundation. Women’s Entrepreneurial Leadership (WEL) Program. Developed with Babson College and Audi, WEL invites up to 20 women to a five-day entrepreneurship and leadership training program. The curriculum covers strategy, finance, and development, all with an eye on work-life balance. In addition, participants are taught how to cut down barriers to equity, inclusivity, and growth in their careers.The goal's simple but critical: balance gender disparities in the hospitality industry.\"The scholarship program Audi's rolling out will be important,\" says Mar, owner and head chef of The Beatrice Inn Manhattan. \"You don't forget where you come from. You don't forget who put you there. You don't forget to pay it forward to the people who are going to follow in your footsteps.\"Audi helped Mar arrive at PROOF in style. As a \"city girl\" she loved the Q3's sleek interior and quattro all-wheel drive. A comfortable driving experience also meant Mar could turn her attention to the critical details of preparing the evening's meal.Audi launched PROOF believing the low number of women in the hospitality industry are simply unacceptable.Women represent less than twenty percent of chefs and head cooks in the U.S.; only six percent of the head chef positions at the top 15 restaurant groups in the U.S. are held by women.Flanked by WEL fellows Sandra Cordero of Gasolina Cafe in Los Angeles and Ping Ho of Marrow and The Royce in Detroit, the night featured Mar's signature style of big cuts of meat, rich sauces, and fire. Among other delicious courses, guests feasted on roast duck flambé with cherry jus and 160-day whiskey aged beef with prawn butter and marrow blistered blackberries.\"I want people to eat food that is so good it just messes with their brain,\" Mar says of her cooking philosophy. But she's quick to point out that success doesn't happen without outside help providing the resources to be creative. She says she could only be where she is now, \"if I was cooking with abandon.\"\"If I can change the way people view a dining experience,\" she says, \"then I've done my job right.\"Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-08", "author": ["Condé Nast"]}