{"id": "6b5e520845e27758d1b0bac5b55fbce7", "url": "https://www.bonappetit.com/story/stumptown-cold-brew-coffee-concentrate", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "I Gave Up My French Press for Stumptown Cold Brew Concentrate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Gave Up My French Press for This Coffee ConcentrateSince finding this bottled cold brew, I’m never trying (or failing) to make my own coffee again.By Kate FenoglioMarch 18, 2021FacebookTwitterEmailPhoto courtesy Stumptown Coffee RoastersFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I can successfully bake a chocolate soufflé but I can’t manage to make a successful cup of coffee in my own home. Even when I follow all of the extremely specific rules—like getting the water to the exact right temperature; using good, fresh beans; weighing and grinding them each morning; pre-wetting the filter; doing essentially anything Chris Morocco tells me to—somehow it still goes terribly wrong. Even when I tried to make cold brew concentrate overnight in the fridge (which is apparently easy), it ended up tasting like what I imagine the bottom of a shoe tastes like.I used to get around the problem by buying coffee on my commute to work every morning. Yes, it was expensive, but the real cincher is that I no longer have a commute. Instead of finding the silver lining and using this opportunity to finally learn to brew a decent cup, I’ve turned to Stumptown Cold Brew Concentrate. The concentrate is a larger-format, longer-lasting version of their single-serving premade cold brews.Because it’s double the strength of their normal cold brew, I can easily get 6–7 glasses per bottle, meaning it lasts all week in my fridge. Depending on the morning, I’ll either pour it straight over ice and speed through a NYT’s crossword in 20 minutes, or dilute it with water or milk. It's smooth, strong, and rich—and I literally can’t screw it up. It's also perfect for cocktails and baking projects where I want a strong kick of coffee.I no longer have a reason to attempt to make coffee at home, no matter how “foolproof” someone’s technique. So if anyone wants my French press, pour-over, AeroPress or Nespresso machine, I’ll trade them all for a jug of cold brew concentrate.Stumptown Cold Brew Concentrate$12 $11 at Vons$14 at InstacartExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-18", "author": ["Condé Nast", "Kate Fenoglio"]}