{"id": "6b63f9b5baa34620fa345332970f340f", "url": "https://www.bonappetit.com/story/the-riddler-nyc-joan", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Go to The Riddler in New York. Get Your Wine Glass Filled to the Brim. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsGo to The Riddler. Get Your Wine Glass Filled to the Brim.The “Joan” is an off-menu inside joke, and the best wine deal in town. By Alex BeggsDecember 23, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The standard restaurant wine pour is five ounces. It puddles in the bottom of the glass like yesterday’s rainfall. It costs close to as much as the entire bottle retails for. This is a widely accepted truth.But is it enough?Most of the time, sure! But in an amber-glowing Champagne bar in New York City, you can have much, much more.At The Riddler, which has a new location in the West Village (the original is in SF), you can order a “Joan,” off-menu. You can choose bubbles, white, or red. The bottles vary from day to day, but there’s no such thing as bad wine at this place. The waiter will pour the wine into your glass, and pour, and pour, and pour...until the surface tension of the wine vibrates slightly. Any more and it would overflow. Laugh, lean forward, and sip.The Joan is a caricature. An inside joke about a “fun-time suburban mom” from the childhood of owner Jen Pelka’s friend—perhaps you know a version of Joan. She showed up to the kids’ soccer game with a flask of cheap white wine. “We have so many guests who tell us that their aunt is named Joan, and that she drinks her wines Joan-style,” said Pelka.But here the Joan takes the cliché about “mom wine” to a hyperbolic and satirical place, like that Amy Schumer sketch with the gigantic wine glass. (At a restaurant funded solely by female investors, you might see it as another level of the bar’s implicit feminism.) But it’s also a GREAT DEAL. $16 for two and a half glasses of wine!When I stopped in for oysters and a (very good, BTW) burger recently, I had the red Joan, a juicy Chilean pinot noir. (People don’t usually bother to even ask what the wine is, though, it’s more about the spectacle.) The sight of my 100 percent full glass inspired my jealous and thrifty dinner mate to order the Joan bubbles, which were big popping bubbles of cava—the perfect companion to the cheesy burger. “There’s a two-Joan maximum, FYI,” warned the waiter. Joan is more than half a bottle of wine. Makes sense.This is a bar where caviar comes with Lay’s potato chips, where you can have pristine crudo before a burger and fries, and wash it down with obscure expensive Champagne or a pony of High Life. The atmosphere is light-hearted and fun and keeps the whole “Champagne bar” thing from getting too stuffy, which is Pelka’s mission. There’s a ginormous bottle of Krug in the bathroom behind emergency glass. Don’t think too hard about it—order a Joan.Go there: The RiddlerExplore Bon AppétitHighly RecommendWineNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-23", "author": ["Condé Nast", "Alex Beggs"]}