{"id": "6b67863a51310b9358042247441ffdf9", "url": "https://www.bonappetit.com/story/angela-dimayuga-anthony-bourdain", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Chef Angela Dimayuga on Her Last Conversation with Anthony Bourdain | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Angela Dimayuga on Her Last Conversation with Anthony Bourdain“He wanted to be my mentor. He said that I could call him at 2 a.m. and he’d answer.”By Angela DimayugaJune 11, 2018FacebookTwitterEmailCourtesy of Angela DimayugaFacebookTwitterEmailWe are deeply saddened that Anthony Bourdain has died of apparent suicide at age 61. Below, chef Angela Dimayuga, formerly of Mission Chinese Food and currently the creative director of food and culture for the Standard International hotel group, recalls the impact Bourdain had on her own career and approach to food.If you are having thoughts of suicide, please call the National Suicide Prevention Lifeline, at 1-800-273-talk (8255), or the Suicide Crisis Line, at 1-800-784-2433, or text 741741.I first met Anthony Bourdain in 2015. We’d just opened the new location of Mission Chinese Food, a 130-seat version of our previous 40-seat restaurant. Tony came within the first few months of us opening. He was always a supporter of the food at the restaurant, and this time, with my expanded new and technique-driven menu he continued to be pleased. The space was my baby—I got involved in design and more. After he had his first meal there, I gave him the grand tour. I had put so much time and attention into the details, and I was floored when he commented that he loved the pink awning I designed, and that he enjoyed my musical choices of generic spa music, like Police covers, in our bathrooms. We took a selfie in the bathroom from a selfie stick someone left at the restaurant to commemorate the evening. I couldn’t believe it. I felt like he got me and told him that. He said that, indeed, he did get me. Years later, I told him how important that first meeting was for me. “I love it,” he said. “Consider me a steadfast supporter and advocate for everything that you do.”As an immigrant child, validity from elders is hugely important to me. It took until I was a critically acclaimed chef to feel confident coming out to my parents. With Tony, I felt validated from the start. As my career grew, he continued to advocate for me. In an interview with Richie Nakano in ChefsFeed, he said, “If you were to appoint an official ambassador, somebody with the juice, the trust, the confidence to open a place serving Filipino food, I think she would be a good advocate.” I read this one night during service and grew flush. I took a break from expediting to steal a moment to collect myself in the service hallway to let it sink in. I thought about how he wanted me to push forward with this talent. I talked to Danny Bowien, the owner of Mission Chinese, about exploring my heritage cuisine as a standalone concept, but over time it became clear that it wasn't going to happen at the brand. I filed my ideas away for the future.A couple years later, for the first time in the 11 years I had been living in NYC, I could afford to fly both of my parents out from California to visit. I brought them out for a special offsite event that Mission Chinese was hosting, at which they would have the opportunity to meet Tony. To my surprise, when my Dad was introduced to Tony, he grew humble. It was the first time I’d ever seen him starstruck. He asked Tony if he could hug him, to which Tony obliged. Tony told my parents that they had a spectacular daughter, and that they should be proud. My dad said “You’re my hero. Thank you for visiting our cousin’s restaurant in Pampanga. Thank you supporting my family’s business, and our country. Thank you for being an ambassador to the world.” (Our cousin owns a restaurant called Everybody’s Café, which Tony visited in No Reservations in 2008.) I couldn’t believe my Dad asked this complete stranger for a hug. He was in tears.Tony continued to support me in small ways to show he was watching and supporting. He called me his hero on Instagram when I responded to an IvankaTrump.com editorial request. He consistently stood up from his dinner table to greet me (which I always thought was too much), and we had a kind of rapport: He let me tease him. After I left my job at Mission last year, I spent a lot more time traveling and didn't see him as often.But, just two weeks ago, we had sushi at Blue Ribbon, across from his place on the Upper West Side. We talked about filmmakers and cinematographers we liked in common: Gus Van Sant, Darren Aronofsky. I just about fell over when we talked about both loving Christopher Doyle’s cinematic work in In The Mood For Love, and how the opening credits for Gasper Noe’s Enter The Void is worth the trip to seeing it in theaters. We talked about places I’d never been that I wanted to see—Greece, Croatia, Portugal, San Sebastian—and places he thought I needed to visit: back to the Philippines, to Berlin to party, to Africa. He said, “You’re going to get people you meet there to teach you more important things than they would teach me because you’re you.” One of my favorite things he said that night was that his show Parts Unknown was a political show masked as travel television. I shared with him that art is important to me because art is inherently political. And, to me, food is an expression of art, and so cooking can and should be a political act too.We talked about my new position at The Standard, and he said, “That’s a perfect job for you, and suits you. They are lucky to have you. It will be a place you can grow your vision.” He had noticed all the collaborative work I had been doing, and he said that my work with artists was especially intriguing to him. He told me that my intersectional approach to work and craft was necessary to the food industry, and that what I’m doing for the future of the food world is important. I felt so seen: I knew he was keeping on eye on me, but I never thought he was looking this closely. Then he offered to become my mentor. He said there weren’t many people he’d be happy to pick up a call from at any hour of the day, but that I could call him at 2 a.m. and he’d answer.I tried to contain my excitement as I agreed. I had so few mentors in my life that earnestly and genuinely wanted to support me and see me succeed. For the first time, it made sense that a straight, white, male chef could mentor me, let alone be a bonafide accomplice to my pursuits. It was meaningful that he was 61—nearly double my age with so much more experience. I was ready. This was the last time Tony and I spoke. When we said goodbye that evening he said, “You’re going to do amazing things.”I came home that night feeling transformed. I had an instinct, an excited stirring in my belly that told me that something important was happening and my life was about to change drastically. I was excited for our intertwined futures.I wish I’d had some reason in those next two weeks to have called in the middle of the night and heard his voice one more time. Instead I lost my mentor without ever talking to him again. We all lost him. I’ll remember our last conversation forever, but I’ll have to let his light guide me another way.Explore Bon Appétitangela dimayugaAnthony BourdainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast", "Angela Dimayuga"]}