{"id": "6b6c30b9914d56645387b77db6cba05b", "url": "https://www.bonappetit.com/story/our-place-pan", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Our Place Makes An All-in-One Pan I Use for Every Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAn All-in-One Pan I Use for Every MealThe nonstick pan contains two kinds of steamers, an acacia wood spatula, and a pair of extra-large cooking chopsticks.By Ali FrancisJanuary 24, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here! All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Before I was gifted the 10,000 Abilities 万能 Always Pan, I’d been cooking everything that required a sear, sauté, shallow fry, or scramble in a humongous pseudo wok procured from my local dollar store. I’d just lost most of my kitchen to a breakup and I guess I felt like single people didn’t get to have nice things.Then, just like that, a replacement kitchen arrived in a box. Really, it was a limited edition version of the Always Pan from direct-to-consumer cookware brand Our Place. Made to mark Lunar New Year, which starts tomorrow, the set includes a nonstick cast aluminum pan and lid, a bamboo and a stainless steel steamer, an acacia wood spatula, and a pair of extra-large cooking chopsticks to use like tongs. It all nests together like a beautiful Russian doll of cooking essentials—a win for cabinet space and kitchen cuteness.Our Place surveyed Chinese-Americans on how they celebrate, cook, and serve food during Lunar New Year to design each component of the set, which features splashes of dusty red for good luck. I also like that it was made in one of China’s few women-owned, third-generation factories in Yongkang, Zhejiang, which the brand says was selected for its quality craftsmanship and fair working conditions.Now you can find me frying chili eggs, sautéing shiitakes, steaming chicken, and then kicking back while the pan cleans up after itself. Okay, so you still need soap and water. But if you cleverly steam your veggies after sautéing, the water bubbling away under the steamer basket will simultaneously power wash the pan beneath. Bliss!Now, if only it could go ahead and buy my groceries too.Buy it: Always Pan, $145The 10,000 Abilities 万能 Always Pan is limited-edition and now sold out, but the core Always Pan is still available for purchase. Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-24", "author": ["Condé Nast", "Ali Francis"]}