{"id": "6b6ef130617a5dad2d5b552eceaf0648", "url": "https://www.bonappetit.com/story/healthyish-newsletter-10102018", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "The Healthyish Newsletter: One of the Toughest Stories We've Ever Run | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOne of the Toughest Stories We've Ever RunHealthyish editor Amanda Shapiro reflects on Fatima Ali's powerful post.By Amanda ShapiroOctober 11, 2018FacebookTwitterEmailAlaina SullivanFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last January, senior staff writer Alex Beggs sent me this Q+A with Top Chef contestant Fatima Ali. Reading it, I was curious how undergoing cancer treatment affected her relationship with food and cooking, so I DMed Fatima on Instagram asking if she wanted to write something for Healthyish. Three days later, I opened my inbox to find a beautiful, raw, and unsentimental essay about how cancer changed the way she cooked. I know the first lines from memory: \"If I lie absolutely still, the room stops spinning, and my stomach doesn't wretch.\"We emailed back and forth about small edits. Sometimes I'd hear from her in a day; other times a month would pass, but Fatima would always come back with an apology—she'd been in treatment, or recovering from treatment, or in the hospital with the flu—and a more polished draft. In May, we published her first essay about how cancer changed the way she cooks.A lot of people read and shared the story, and Fatima wrote to tell me about all the love she was getting on Instagram and beyond. I was happy to hear it, and we were all optimistic that the last rounds of chemotherapy would kick her cancer to the curb forever. I looked forward to following Fatima's career and eating at her dream restaurant, the one where \"the kebabs melt against your tongue and the cocktails are just sweet enough to calm the burn.\"A few weeks ago, Fatima emailed me to ask if I was interested in another essay. She told me that her cancer was back. She wanted to write about what it felt like to go from a healthy 28-year-old chef on one of the biggest cooking shows in the world—someone who exercised diligently, drank responsibly, and ate well—to a cancer patient being told that she had just a 10 percent chance of living through the year.Of course I said yes, and her essay came in within the week. This time, our back-and-forth edits went quickly. I could sense Fatima's urgency in getting it out into the world. This second essay is one of the most powerful stories I've run on Healthyish since we launched almost two years ago, and it has resonated widely since it was published yesterday. I'm grateful to Fatima for writing it and awed by her ability to put words to what she's experiencing right now.Working with Fatima has reminded me that there are infinite stories to be told beyond the pitches that land in my inbox every day. There are more people out there with experiences to share.In her second essay, Fatima writes, \"When we think we have all the time in the world to live, we forget to indulge in the experiences of living. When that choice is yanked away from us, that’s when we scramble to feel.\" This isn't a new idea, but it really hit home for me this week, when I'm feeling fatigued by the depressing news cycle and the constant hamster wheel of assigning, editing, and posting that comes with running a media site. Working on these posts with Fatima has forced me to slow down, to think harder about the words on the page, and to honor the writer behind them.It's a small thing, but I'm grateful.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterChefsRead MoreLifestyleI'm a Chef With Terminal Cancer. This Is What I'm Doing with the Time I Have LeftBy  Fatima AliRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Amanda Shapiro"]}