{"id": "6b8517ec7f80f3055ca570360cd34c84", "url": "https://www.bonappetit.com/story/caramelized-leek-tart", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "This Caramelized Leek Tart Is the Easiest, Most Stunning Dish You Will Make This Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Caramelized Leek Tart Is the Easiest, Most Stunning Dish You Will Make This SpringIt’s so pretty, you almost won’t want to eat it.By Emma WartzmanMay 6, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailIt’s that time of the year when people freak out over all the spring things: the sugar snap and English peas, fava beans, asparagus...I even once watched two people get into an actual fight about the last $6 bunch of ramps at the farmers market. But the lowly leek? When’s the last time anyone lost their shit over them? Well this spring veg is also peaking right now, and you’d be wise to make good use of them with this brand new Upside-Down Caramelized Leek Tart.The dish is a savory tarte tatin inspired by the flavors of classic leeks in vinaigrette. “It’s one of my very favorite ways to eat leeks,” says senior associate food editor Molly Baz, who developed the recipe. For those of you who have yet to discover the magic that is alliums roasted in bracingly acidic vinegar until golden and soft, get on it. But it gets better, because this recipe also employs (store bought!) flaky, buttery puff pastry, which makes it over-the-top delicious, visually stunning, and really freakin’ easy.Have a slice. Or two.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesYou start by par-roasting your cleaned, trimmed leeks in the oven to get them part of the way cooked. “From there, it all happens in one pan, building from the bottom up,” says Molly. Simply simmer some white wine (or red or sherry) vinegar in a cast iron skillet. Then add a couple of tablespoons of butter, thyme leaves, and a teaspoon of sugar, just to coax along the caramelization. After this has cooled a bit, you lay down the roasted leeks in neat rows, keeping in mind that however they’re organized on the bottom of your pan is how they will look on the top of your tart. “You don’t have to be crazy about it,” Molly says of the arrangement. “If there’s a gap, just cut a little piece of leek and fill it in.” Brush the rounded side of the leeks with some mustard for a slightly spicy bite and sprinkle some grated parm over the top, which adds “a fatty-salty vibe without turning it into an actually cheesy tart.”The puff gets rolled out until it’s wide enough to cover the circumference of your pan and trimmed into a circle. I actually laid my dough on top of the pan and then imperfectly snipped off the corners with kitchen scissors. You tuck the sides underneath anyway, so it doesn’t need to be exact. The pastry will, well, puff and surround your leeks once you slide it all into the oven.Forty minutes later, all you have to do is flip it over onto a plate, which sounds harder than it is. “Make sure you have a surface that is larger than your pan,” says Molly, “and do it in one, swift, confident movement. If any leeks stick to the bottom of the pan, it’s not a big deal. Just peel them off and lay them back on top of the tart. No one will ever know.”What they will know is that you just served them a truly springy, visually impressive, melt-in-your mouth buttery-and-bright-all-at-the-same-time tart. They might even freak out about it.Get the recipe:Upside-Down Caramelized Leek TartYes, this is an impressive-looking, deliciously savory tart, and no, it’s not at all difficult to make.View RecipeExplore Bon AppétitSpringTartLeekRead MoreSpring MinestroneLifestyleThis Recipe Wants You to Know That Meatballs Are Totally Appropriate for SpringBy Amanda ShapirocultureThe Springy Spring Salad I’m Making This WeekendBy Alex BeggsLifestyleThis Turmeric Yogurt Dip Is a Great Excuse to Load Up on Spring ProduceBy Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-06", "author": ["Condé Nast", "Emma Wartzman"]}