{"id": "6b8706873b18c46c23ec5e4f5b884b77", "url": "https://www.bonappetit.com/story/biscotti-feud", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Still Thinking About Stanley Tucci’s Negroni | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStill Thinking About Stanley Tucci’s NegroniShould this classic drink ever be shaken? Let’s ask an expert.By Alex BeggsApril 25, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Shake it“Stop what you’re doing,” I was told, “and watch Stanley Tucci making cocktails.” I put down the French murder mystery I was reading (the investigator sleeps in, drives slow, and has a pet toad named Bufo), and glued my eyes to the Tooch’s biceps as he shook a Negroni and poured it into a delicate, expensive-looking coupe glass. “Doesn’t sound like enough ice,” noted Christina Chaey. I wonder what other details I missed. “He pronounced Milanese beautifully,” pointed out drinks columnist Al Culliton, “and he’s using the best gin and vermouth money can buy: Plymouth and Carpano Antica.” There was some hubbub on the Internet about shaking a negroni, which is usually stirred because it is an all-spirit cocktail and shaking dilutes the booze, Al told me, adding: “That said, he’s shaking much more gently than I would, so maybe it's not so bad?”Ah, the gentle shake.Want this letter before it hits the website? Sign up for our newsletter!CrowdsourcingOn the theme of...drinking... I asked our beloved Test Kitchen editors what their isolation cocktail has been this week (alcohol optional):Molly Baz has been mixing up “YUMMY JOOS,” “a cocktail I invented two weeks ago and simply cannot shake.” Well, actually it is shaken. It’s an unmeasured combination of mezcal, Aperol, lemon juice, simple syrup, and a pinch of salt. Shake, serve on the rocks with a salted rim.Rick Martinez makes a sleepytime soda that’s half chamomile, half hibiscus tea, with agave and a splash of Topo Chico—over ice.Chris Morocco’s having a large glass of red wine.Priya Krishna is on the Topo train too: “My mom made a pretty amazing lemonade with Meyer lemon juice, sugar, salt (salt!!), ice, and Topo Chico.”Claire Saffitz hasn’t been boozing that much, but when she does, she’s having “a Lillet over ice with a very big wedge of lemon.” Classy, Claire!Brad Leone didn’t reply to my email. But then again, he’s not really “an email guy.”Andy Baraghani prefers a glass of tequila with a fat ice cube.Sohla El-Waylly is “really into this lavender booch that I'll even pour into a glass over ice like a fancy person—tastes like spring.”Christina Chaey just opened a bottle of BORDIGA VERMOUTH BIANCO, ALL-CAPS HERS, which she drinks “in a rocks glass with a big ice cube, splash o’ sody water, and lemon twist. Delightful.”Carla Lalli Music “crushed several margaritas last night,” she confessed, and has been enjoying “quite a few Cynar spritzes—1.5 oz cynar, 1/2 oz red vermouth, lots of ice, top with club soda.”Ted CavanaughMy drink of the weekAfter I made BA’s Best Chocolate Chip Cookies, I had leftover egg whites, which meant I could make one of my favorite cocktails ever, the Rattlesnake. It’s frothy and lemony. Make it! What else ya gonna do.Read more: This Cocktail Is Called the Rattlesnake, and That’s Reason Enough to Make ItPhoto by Alexandra AyersIn other newsPUZZLES.What I can’t wrap my mind aroundThe last restaurant meal I had before sheltering-in-place was at Charlie Bird in New York. I squinted at the bill sideways, but I knew it was worth it. I ran into Carla there, actually. We HUGGED and it felt so wrong. I’m having trouble conceiving of a world without these neighborhood restaurants. Please don’t tell me they’ll all be replaced with Ruth’s Chris steak houses. Gabrielle Hamilton’s recent piece in the Times magazine about closing her restaurant Prune reads like a heartbreaking, dreaded epilogue to Blood, Bones, and Butter. The chapter I never wanted to read.We’ve been trying to boost awareness and raise funds for restaurant workers in need right now—a Sisyphean task, it can feel like—by showing chefs cooking at home on Bon Appétit’s Instagram Stories. This week, Eric Sze of 886 made scallion pancakes (watch it here) that he then turned into a scallion pancake BREAKFAST BURRITO. With a side of white wine. Need! Want! It was mesmerizing, sizzling fun. Over 100 donations came in, Eric said—a week’s worth of pay for his staff.I ordered a 6-pack of somm-favorite wine (ships nationwide, phewph) from Parcelle, which donates profits to ROAR. Here are even more ways you can show restaurants love right now. Hopefully the actual dang GOVERNMENT will do the bulk of the work needed to save them, though.Unnecessary TikTok of the weekDid I just watch asparagus get sorted by size?Unnecessary food meme of the weekUnnecessary food feud of the weekA question was thrown into the void by Chaey: “Does anyone have a favorite biscotti recipe?” Meryl Rothstein did the work-from-home equivalent of interrupting: “Does anyone LIKE biscotti?” How could she!? I love dipping an almond biscotti into my coffee, letting it dissolve into soft pebbles I’ll forget about until they try and choke me on the last sip. I need that kind of beverage excitement! Sohla’s with me–loves it. Chaey “loves a hard cookie.” “ONLY with espresso or coffee,” said Andy. “I’ll just leave this here,” Carla said, uploading a Google doc with her new mocha hazelnut biscotti recipe (wait for that cookbook!). Both Chaey and Sohla turned around and baked it: “It was molto delizioso,” said Chaey. Cristina Martinez needed that recipe, she’d been on a two-day quest for a good biscotti recipe (gotta have something to quest about these days). Chris Morocco came in with a take as neutral as Switzerland: “It’s the antithesis of what I normally like in a cookie: it’s all one texture. Yet a good one, crisp, nutty, sweet and toasty, is pretty glorious.” Then the cranks showed up. “I DON’T LIKE IT,” Rachel Karten shouted. “They’re barely cookies!” complained MacKenzie Fegan. “It’s just stale bread,” huffed Hilary Cadigan. “Wouldn’t you rather eat a cookie that doesn't depend on being dunked?” posed Meryl. “I prefer mandel bread?” said Sarah Jampel.Explore Bon AppétitBeggs NewsletterRead MorecultureI’ll Always Love Campari, But This American Aperitivo Is My New One and OnlyBy Alex DelanycookingWhy I'm Still Having Happy Hour, Even At a DistanceBy Al CullitoncookingThis 4-Ingredient Amaro Spritz Is Your Ultimate Pre-Dinner DrinkBy Alex DelanycookingThis Cocktail Is Called the Rattlesnake, and That’s Reason Enough to Make ItBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-25", "author": ["Condé Nast", "Alex Beggs"]}