{"id": "6b8bc04099ab2a1f0682d281982ca9e6", "url": "https://www.bonappetit.com/city-guides/montreal/venue/schwartzs", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Schwartz’s Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealSchwartz’sA must-visit sandwich institution still slinging smoked meat in the PlateauFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for a taste of Montreal’s best smoked meat sandwich. Schwartz’s has a cult following for a reason.ORDER THE: smoked meat sandwich, duh. It’s Canada’s answer to pastrami: the meat is piled high, slicked with deli mustard and nothing else, and served on untoasted rye. It’s out of this world. Order a side of pickles and coleslaw to balance out all that meaty richness and call it a day. Sure, there are other items on the menu, but 95 percent of the people here are getting the sandwich (in other words, skip the poutine).WORD TO THE WISE: The lines are INSANE, wrapping around the block even when it’s minus-10 degrees outside. Your best bet is to go off-hours between the lunch and dinner rush, or order a sandwich to-go from the adjacent take-out shop. The food will taste the same, but you won’t get the full experience.THE VIBE: is old-school, a turn-and-burn deli counter. It’s been around since 1928 and the decor hasn’t changed since (menus plastered on the walls, paper placemats).PRACTICAL STUFF: Open every day: Sunday to Thursday 8 a.m. to 12:30 a.m., Friday 8 a.m. to 1:30 a.m., and Saturday 8 a.m. to 2:30 a.m.—Molly BazPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVERotisserie RomadosThe Plateau’s mouthwatering Portuguese piri-piri chicken (and egg tarts!)L’ExpressWhen you want the French bistro classics, you go to this Plateau institutionPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Carey Polis"]}