{"id": "6b91ed693be34475c40bdc8c1e291f14", "url": "https://www.bonappetit.com/story/lunch-ideas-for-tired-cooks", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Excellent Lunch Recipes For Tired Cooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAny Other Tired Cooks Need Some Serious Lunch Inspiration?My boxed cracker habit just isn't cutting it anymore.By Christina ChaeyFebruary 28, 2021FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.When I started working on our “What’s for Lunch?” feature in the March issue of the magazine, I was in a dark place foodwise. Gone were the days when rolling out and cooking fresh flatbreads seemed like a cute and fun and novel thing to do in the middle of the workday (yes, I know, who was I?!). I had transitioned to the “shoving plain crackers into my mouth sometime between the hours of 11 a.m. and 3 p.m.” phase of quar-cooking. Opening anything (a can of tuna, a bag of rice, the fridge) seemed like too much work.But it wasn’t just the physical routine of cooking that was exhausting me. It was the sheer fact of having to think about what I was going to shop for and cook, long before I reached for a mixing bowl or turned on the stove. I would buy a head of broccoli, rack my brain for something interesting to do with it, come up with no ideas that appealed, then finally give up and devolve into my cracker spiral again.But working on the recipes, strategies, and tips in this feature inspired something of a cooking renaissance. I’ve made Hetty McKinnon’s Peanut Noodles With Cucumbers multiple times, cleaning out several mostly empty jars of nut butter in my pantry in the process. I’ve been dreaming of Basically editor Sarah Jampel’s Broccoli Melts, which remind me of Stouffer’s French bread pizza in an extremely good way. I want to make each and every one of these sandwiches. My roommate, who’s even more over the whole cooking thing than I am these days, just made Test Kitchen director Chris Morocco’s Soy and Scallion Tofu Bowl and declared it one of the best things she’d made in months.Sometimes all you need to re-spark the desire to cook is someone else’s idea, and when you work at a food magazine, there’s never a shortage of those. I hope you check out the recipes and tips from the BA folks and contributors who worked on this lunch story, whether in print or online. And I hope their ideas will help restore a little joy to your next meal.Here's What I'm Making for Lunch This Week:Photo by Laura Murray, food styling by Susie TheodorouSoy and Scallion Tofu BowlPeanut Butter Noodles With CucumbersGreen Curry Lentil SoupChickpea Pancakes With Greens and CheeseLunch Nachos With Spiced CauliflowerBroccoli MeltsExplore Bon AppétitHealthyishWhat's Chaey Cooking?LunchessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-28", "author": ["Condé Nast", "Christina Chaey"]}