{"id": "6b9302455162e91565317b13f411ba99", "url": "https://www.bonappetit.com/story/diane-guerrero", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Diane Guerrero on Why She Won't Fake an Accent and the Colombian Dishes She Craves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDiane Guerrero on Why She Won't Fake an Accent and the Colombian Dishes She CravesThe ‘Orange Is the New Black’ actress on how she’s helping women tell their stories on her podcast and the foods that comfort her in tough times.By Alyse WhitneyJuly 16, 2018FacebookTwitterEmailPhoto by Emma Fishman,  Styling by Sophie Lopez, Wearing Giambattista Valli by Nova OctoFacebookTwitterEmailDiane Guerrero finally knows her worth. The Orange Is the New Black actress took many years to embrace her Colombian heritage and tell the story of her parents’ deportation in her first memoir, In the Country We Love, but once she got started, she was full steam ahead. She adapted the book for a younger audience to help kids in immigrant families in My Family Divided (in stores July 17th), and, earlier this year, she teamed up with Reese Witherspoon to host How It Is, a podcast that invites women to tell their stories in their own words. Topics have included combating sexism in Silicon Valley, dealing with PTSD, and empowering female farmers, with guests like Gabrielle Union, Ellen Pao, and Lena Waithe.Recently Guerrero and I sat down for coffee, arepas, and aromáticas (Colombian infused water in flavors like pineapple–ginger and strawberry–basil ) in front of a huge living plant wall at Devócion in Williamsburg, Brooklyn. She discussed stories she wants to tell, experiences that molded her, and the Colombian dishes she turns to for comfort.Photo by Emma FishmanHow It Is is such a powerful podcast. What made you passionate about helping these women tell their stories, in their own words?When we explored the #MeToo movement and Time’s Up, I realized that I never took the time to think about the troubles I experienced as a woman. For so long, I was consumed by my family’s immigration status, growing up poor, and dealing with racism, and I found it hard to put myself with those [feminist] movements. I learned so much listening to other women’s stories and recalled all the microaggressions I’ve dealt with. How many times was I abused? Was I violated? It was like a normal thing that a man would talk down to me, and totally normal for someone to say something completely sexist and me laugh it off. Now I know that’s not right. And I know my worth.What kind of stories do you want to tell next?I want to cover different women of color and the facets of their lives growing up. I also want to explore more stories from the disabled community and their experiences. We are all together in this fight. Next season, we will also focus on worth and value, whether it’s the value of money, your self-worth, or the value of working together.Time’s Up was integral in that. What has been your experience with the fight for equal pay?I have a lot of wonderful people looking out for me. There’s no way for me to tell who’s getting paid more but I know what my worth is. I’m always looking out to see that I’m not being cut short. Even in the work that I do—not taking certain roles that aren’t exploring the full character’s potential, or that will set my community back. I am conscious of the community that I’m representing and don’t play into stereotypes.Have you ever been asked to do an accent?I used to go to auditions all the time and people were like, “Can you try it with an accent now?” I would because that’s the way I thought things were and I had to accept that. But doing all of these shows, working on the shows like Orange is the New Black, Jane the Virgin, and Superior Donuts, I know how hard I work. I won’t accept that anymore. I’ll say, “I’m sorry, I don’t think this character would have an accent so I’m not gonna have one. Why don’t you ask me to do a British accent?” They feel like an audience can’t handle looking at me, a brown woman, with no accent and being from America.In your books, you talked about being bullied as a kid being for not being “Latina enough,” with Dominican and Puerto Rican girls making fun of you for being Colombian. Has your perception of yourself changed since then?Oh my god, absolutely. I feel enough in every aspect of my life. Believe me, there are days I’m not always feeling this confident. There are some days that I have to remind myself, and I have to give myself affirmations, and I have to go to yoga or do something nice for myself. I get nervous about putting myself out there, but I want to encourage others to use their voices too.When did you feel like you embraced your culture and felt confident in who you are?When I shared my story [in memoir In the Country We Love]. It’s taken a long time for me to accept myself for who I am, my story, my parents’ deportation story and our struggle. I always thought if I talked about it and gave it any energy that I would be defined by it.When you seek comfort, are there any Colombian dishes that you make?I love making dishes that my mother used to make. I’ll make the easier ones, like rice and beans with plantains, or her amazing red beet salad with carrots, cilantro, a little tomato, and lemon vinaigrette. I’ll do kale and beans for a healthier, cleaner twist, but still make room for baked plantains with cheese inside, or Colombian empanadas with shredded beef and potato that my dad would make. I also love dipping Cuajada Fresca [a fresh cheese curd] into coffee, chocolate, or Aguapanela, a sugar cane drink with lemon or lime.Is there a signature recipe from your family?When we would go to the beach, my parents wouldn’t want to spend a lot of money on the expensive snacks. So my dad would make a big ass pot of spaghetti with sausage and red sauce, and bring that, plantains, and rice. They just wanted to feed a lot of people, and it was so cheap. So we’d all have spaghetti on the beach—it was hilarious.Is there anything else that connects you with your family, even when you’re thousands of miles away?Before I cook, I always have to put on music that parents listened to while cooking. I remember waking up in the morning and seeing my dad making breakfast with music and cutting up the tomato and singing to it and just handling food with such care. So when I cook, I put on salsa, vallenato, cumbia, or anything that reminds me of Colombia.And sometimes I will purposefully forget a recipe so I can call my mom and have her walk me through it. Next I want to learn to make sancocho, a Colombian soup. It’s usually oxtail but you can make it with pork or chicken too, and it has plantains, potatoes, and all kinds of herbs and spices that I need to have my mom teach me over the phone.Explore Bon AppétitCelebritiesHealthyishInterviewsRead Moreculture'Insecure' Star Yvonne Orji Knows What She Wants Out of Life and BreakfastBy Tahirah Hairstonculture'Battle of the Sexes' Star Natalie Morales Is Queer, Vegetarian, Cuban, and ProudBy Alyse WhitneyLifestyleZoe Lister-Jones on Hiring an All-Women Film Crew and Being a ‘Bone Brothatarian’By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-13", "author": ["Condé Nast", "Alyse Whitney"]}