{"id": "6b97f059a66c5f04a592244acc51e350", "url": "https://www.bonappetit.com/story/marinated-artichokes", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Dress Up Marinated Artichokes For a Super Easy Party App | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Zhuzh Up Jarred Artichokes (And Also How to Spell Zhuzh)An appetizer so simple, you can focus on roasting the chicken.By Emily SchultzDecember 19, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I get second-hand stress when I see someone planning too much for a party. When they excitedly tell me their menu, I’m anticipating all of the places where they might fail. When they show me their game-plan I’m thinking about the time they could shave off by preparing something this way instead of that. It’s not that I’m a glass-half-empty kind of gal, it’s that I’m a realist. Some may say it’s how my astrology chart lines up—my rising and moon signs are in Virgo, a notorious type-A planner—but I just think it’s because I know what won’t work from personal experience.Appetizers are the first dinner party element that cause me to break out in stress-hives. How I see it, if you’re hosting a dinner party, the focus is on dinner. You should have a few light bites for people to graze on as the Geminis mosey in, fashionably late, but they should be simple to throw together and involve no oil-stained cookbooks or recipes from websites like these (sorry!). Enter: marinated artichokes. Bathing already-delicious things—meaty Castelvetrano olives, salty feta, or tender canned artichokes—in oil, vinegar, and spices is smart because you’re taking already good products and making them even better. There is little room to fail and few ingredients required.Here’s how I do it:Take a jar of artichokes–the ones you’ll probably find in the pasta sauce section of the grocery store in a clear jar sitting in oil–and add them to a bowl without the mystery oils they’ve been sitting in. Cover them with fresh olive oil and a few splashes of vinegar—I like Sherry here, but red or white wine will work too—and add a clove or two of crushed garlic. Sprinkle in salt, freshly ground black pepper, and smoked Spanish paprika. If you decide to make these the morning of your party—which is what you should do since you’ll be carving the roast chicken or dressing the salad later in the day—you can leave them covered on your counter until you’re ready to serve. At that point, put the artichokes out in a shallow bowl alongside crusty bread, a pile of beautiful veggies, and that aioli you made the day before. Then call your appetizer spread done.Phew, that was so easy wasn’t it?! And yes, I’m available for dinner party menu consultations—just pay me back in marinated artichokes.Explore Bon AppétitIt's That SimpleappetizerEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-19", "author": ["Condé Nast", "Emily Schultz"]}