{"id": "6ba7818c7b4ab849a69301bbbc2d0b75", "url": "https://www.bonappetit.com/recipe/cacio-e-pepe-rosti", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Cacio e Pepe Rösti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueCacio e Pepe RöstiBy Christina ChaeyOctober 19, 20214.1(37)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrint“When it comes to potatoes, more is more in my family. A few Thanksgivings ago, not one but two potato dishes appeared on our table—no one batted an eye, and it’s been that way ever since. Mashed potatoes always RSVP to the party, but this year I’m serving this little Cacio e Pepe Rösti alongside it. I like that you can cut it into elegant wedges—a small slice of civility on a plate otherwise occupied by blobs and scoops. Other pros: The potatoes can be boiled the night before, and all of the cooking takes place on the stovetop, meaning you’re not competing for coveted oven space.” —Christina Chaey, senior food editorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronGIR Mini Flip Spatula$11 At Bon Appétit MarketBox Grater$13 At AmazonBenriner Mandoline Slicer$80 At AmazonVegetable Peeler$10 At AmazonColander$11 At AmazonIngredients6 - 8 Servings3lb. russet potatoes (about 12 medium), peeled1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more2oz. Parmesan, finely grated, plus more for serving2tsp. freshly ground black pepper, plus more4Tbsp. extra-virgin olive oil, dividedPreparationStep 1Place potatoes in a large pot and pour in water to cover by 2\"; season generously with salt. Bring to a boil over medium-high heat, then reduce heat and simmer gently until potatoes are tender on the outside but still very firm in the center, 8–10 minutes. Drain potatoes; transfer to a rimmed baking sheet and chill until cool, at least 1 hour. (Fully cooling the potatoes prevents them from getting gummy.)Step 2Grate potatoes on the large holes of a box grater or with a food processor fitted with the grater attachment. (Alternatively, you can use a mandoline fitted with a julienne slicer to create ₁⁄₁₆\" matchsticks.) Transfer grated potatoes to a large bowl and toss with 2 oz. grated Parmesan, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and 2 tsp. pepper.Step 3Heat 3 Tbsp. oil in a medium nonstick skillet over medium. Add potato mixture (it will seem like a lot at first) and, using a heatproof rubber spatula, spread out in an even layer, pressing down on to ensure potatoes make good contact with pan. Cook, occasionally pressing down on potatoes and running spatula around edges and bottom of pan to prevent sticking, until underside is evenly golden brown and crisp, 7–9 minutes. Remove from heat.Step 4Set a large plate upside down over pan. In one swift and confident motion, flip pan and plate to invert rösti onto plate. Set pan back over medium heat, add remaining 1 Tbsp. oil, and carefully slide in rösti, crispy side up. Using spatula, tuck edges into pan to create a neat disk. Cook until second side is golden brown, 5–7 minutes. Run spatula around edges of rösti and give pan a shake until you can feel rösti freely move around in pan. Carefully slide rösti onto a platter and top with more Parmesan and pepper. Slice into wedges to serve.Do ahead: Potatoes can be boiled 1 day ahead. Let cool; cover and chill. Rösti (without additional cheese) can be made 3 hours ahead; store uncovered at room temperature. Reheat in a 300° oven 10 minutes before serving.How would you rate Cacio e Pepe Rösti?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleAbsolutely stellar, I can't get over how delicious this was. I followed the recipe closely, giving 3 large russets a boil first, then stuck them in the fridge to chill for an hour. Riced them using the grater disk on my food processor and mixed the salt and pepper into the cheese before folding it into the potatoes. I used my largest non-stick skillet and good olive oil, fried them for 9 minutes, then flipped them onto a huge flat pot lid, added more oil, slid them back into the skillet, and cooked for another 7 minutes. Absolute perfection, we cannot stop talking about how good it was. I can hardly wait to make this again!Diane R.Henderson, NV12/15/2021Absolutely delicious. Definitely use a non stick skillet. I did a test batch with my well seasoned cast iron and it didn't work out so well. They transported and crisped back up in the oven at 300 for 10 minutes just fine.  Michelle AIndianapolis, IN11/24/2021Ok, so here's the problem. Bon appetit is promoting this dish as an alternative to mashed potatoes to transport to another location for Thanksgiving. This potato dish, and as I said before I never met a potato I didn't like, will never travel well. The crispiness will be lost forever, think reheating french fries. Mushy blah. Put them damn mashed taters in a crock pot or casserole dish that can be rewarmed and proudly walk into your host's house with a Thanksgiving staple sure to please everyone!.\nSorry Jessie, but you don't know taters!\nScottColumbus11/17/2021I used 2 large russets and cut them into 3 pieces each to cook more evenly.  It filled the medium skillet about 1 inch deep. I wasn’t thrilled with the cook and flavor of the potatoes in the middle. The top and bottom were browned and tasty, but the middle was more grainy and undercooked.  It wasn’t worth the effort.  I’d rather have hash browns. SharonSan Ramon, california11/14/2021The traditional cheese for Cacio e pepe, A Roman dish is percorino romano, not parmigiano.  The pecorino gives it a bit more of a kick. But, a very nice recipe.\npacepuleoMilano Italy11/9/2021Did not so much crisp to the cast iron surface as it burnt on. Not enough oil? Potatoes not cool enough? I may try again but worry this may be another BA recipe with lots of active & passive prep time but little reward. CambroWestport, WA 11/7/2021@ Scott from Columbus: haha, it's a Swiss-German dish! Very popular all across Switzerland, really; but yes, quite similar to hash browns. I guess every culture needs a grated potato dish! EmilieZurich11/7/2021Is it just me, or is this just hash browns with a fancy name? Don't get me wrong, I love hash browns, I never met a potato I didn't like, and yes I'll be making this, probably tonightScottColumbus11/7/2021Delicious and simple! Having a few-ingredient recipe like this is a gift for anyone with allergies that also loves creative food. I’ve made this twice now and although the first time the potatoes stuck to my cast iron (on both sides!) I was not deterred. We ended up finishing it in the oven to get an even browning. A week later I tried again and it was perfect. Chilling the potatoes over night made a huge difference in their texture going into the pan and using almost twice the amount of oil both times prevented sticking. While this isn’t really a recipe you can leave on the stove without checking, it is quick to cook and relatively easy with the right tools. Would recommend to anyone!AshMonroe, WA11/6/2021Very disappointing.  Will not make again, will make a mashed potato casserole instead, good flavor, less work.PaulineNorthern California11/6/2021This was a disaster. Potatoes stuck to bottom of skillet and never browned uniformly. Very disappointing.\nLynneMorgantown wv11/1/2021Just make it with frozen hashbowns heated up in the microwave for 2 minutes. Followed this recipe and ended up with a more mashed potato that was fried. Overall tasted great!!!B house homecookedPortland, OR10/31/2021Cacio e pepe means \"cheese and pepper\".\nRösti or rööschti (Alemannic German: [ˈrøːʃti]) is a Swiss dish consisting mainly of potatoes, in the style of a fritter.\n\nseems that the name fits...JoannaCorvallis, OR10/27/2021made this yesterday morning, was delicious! @Benjamin why would there need to be an explanation when it's clearly not made with pasta and is also called rosti lmaoM.Vancouver, BC10/24/2021Considering that practically all cooks assume cacio e pepe is a pasta dish, a brief explanation for BA's decision to swap out the main ingredient would have been welcome.Benjamin P. PilkingtonParis 6e10/22/2021Explore Bon AppétitSideThanksgivingRusset PotatoPotatoVegetableParmesanCheeseVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Christina Chaey"]}