{"id": "6ba93fa08f60bcde80fc59dd202a85b6", "url": "https://www.bonappetit.com/story/how-to-be-a-kitchen-clean-freak", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Tips on How to Keep a Kitchen Clean From the BA Test Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe BA Test Kitchen Wants to Help You Clean Up Your MessTrade secrets on clean kitchens from clean freaks.By Elaheh NozariOctober 26, 2018FacebookTwitterEmailIllustrations by Simon LandreinFacebookTwitterEmailIt’s Get Organized week! Over the next few days, we'll be highlighting the products and methods we use in, out, and around the kitchen to get our lives together.I aspire to be the type of person who cooks with reckless abandon and maintains a glistening, clutter-free kitchen at the same time. (I mean, have you seen a Nancy Meyers movie?) I'm neat and tidy, but I'm somehow unable to bring my cleanliness to my cooking routine. Let's just say I very much leave my mark—like the time I made a friend's birthday cake, got red food dye all over my white kitchen tiles, and showed up to her party with bright red feet. So, I got Gaby Melian, Bon Appétit's new Test Kitchen Manager, to tell me everything she knows about being a clean freak in the kitchen. Here's what I learned:Set up your mise en placeIt turns out that doing a mise en place isn't just for cooking videos and professional chefs. The French term for “everything in its place” is about having all the ingredients and tools a given task calls for ready before you start. The next time you make cookies, don’t just have your eggs and butter splayed out on the counter. Gaby recommends measuring out the flour, sugar, baking powder, etc. before you start to have your workspace totally organized—and so you’re not running back and forth between your pantry and your counter leaving a trail of dry ingredients as you go.Clean as you goHere's a pop quiz: It’s Sunday night and you have friends coming over for a casual dinner of spaghetti and meatballs. A) Do you make everything in one full swoop and wait to wash all your pots and pans after your guests leave? B) Or, do you do the dishes in increments: once while the tomato sauce is simmering, again while the meatballs are cooking in the sauce, and once more while the pasta water is boiling? If you’re one of those people with a perpetually clean kitchen, you already know what the answer is. It’s called cleaning as you go, and it’ll drastically cut down on post-dinner clean-up time.Don't create a pile in the sinkThis rule is a corollary to the above, because “cleaning” does not mean putting all the dishes in the sink and washing them “later.” What you might think is a tidy stack of dishes, all nested together like cute little Matryoshka dolls, is actually a total nightmare waiting to happen: Not only are you dirtying an already dirty dish with other dirty dishes’ dirt, but you’re letting all that crud get extra crusty by leaving them huddled together. Wash them! Dry them! Put them away!Illustrations by Simon LandreinOnly keep the essentials on the counterNeat cooks store their pantry ingredients behind closed doors. Keeping jars of flour and sugar on the counter might make your kitchen feel like Meryl Streep's in It’s Complicated, but if you’re not baking every day, put them away. Gaby suggests keeping only things you reach for daily on the counter, like olive oil, salt, and pepper.Strategize how you use your cutting boardTo avoid washing your cutting board multiple times during prep, strategize what to cut—and when. Get animal protein out of the way first; once you’ve prepped all the raw, greasy stuff, wash the cutting board with soap and hot water, then use it for everything else.Don't leave the kitchen while you're cookingCooking is all about multi-tasking, but only with things that are related to the task at hand (like cleaning!). With that in mind, don’t leave the kitchen to watch a show or change your laundry because chances are, that’s the exact moment your tomato sauce will burst out of the pot and make a mess all over the stove. Gaby's parting words: \"Trust me, I’ve seen it!\"One last cleaning tip before you go:Explore Bon AppétitCleaningGet OrganizedRead MorecultureThe Dishrack That Makes Your Life Look Less Messy Than It Really IsBy Alyse WhitneycultureStop Being Gross and Learn How to Clean Your KitchenBy Jolie KerrRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-26", "author": ["Condé Nast", "Elaheh Nozari"]}