{"id": "6bbc81c5a17715747249fa6dc157f224", "url": "https://www.bonappetit.com/recipe/fattoush", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Fattoush  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2012 IssueFattoushBy Mario Haddad of the Lebanese Academy of GastronomyPhotography by Marcus NilssonSeptember 3, 20213.7(77)Read ReviewsTriangleEmailPinterestPrintMarcus NilssonEmailPinterestPrintEmailPinterestPrintFattoush, a salad made in Lebanese, Syrian, and Palestinian kitchens, is an ideal way to use up day-old pita. Here, it’s drizzled in olive oil and toasted, which helps keep it crunchy once the salad is dressed. While this fattoush recipe can be made year round, it is best in summer when tomatoes are at their peak, and their sweetness is offset by the tang of pomegranate molasses. If you don’t already have this Middle Eastern pantry essential, look for bottles made without added sugar like this one from Lebanese brand Mymouné, and use the leftovers for Pomegranate-Glazed Chicken with Buttery Pine Nuts or Lamb Shanks with Pomegranate and Walnuts.Editor’s note: This recipe was originally published on April 16, 2012.Ingredients6 to 8 ServingsDressing4teaspoons ground sumac, soaked in 4 teaspoons warm water for 15 minutes3tablespoons (or more) fresh lemon juice2tablespoons (or more) pomegranate molasses2small garlic cloves, minced2teaspoons (or more) white wine vinegar1/2 teaspoon dried mint3/4 cup extra-virgin olive oilKosher saltSalad28-inch-diameter pita breads, halved, toasted until golden brown, broken into bite-size pieces1/4 cup extra-virgin olive oilKosher salt3medium ripe tomatoes, chopped, or 4 cups cherry tomatoes, halved1pound Persian cucumbers, or one 1-pound English hothouse cucumber, quartered lengthwise, thinly sliced crosswise6scallions, thinly sliced2Little Gem or baby romaine lettuces, or 1 small head romaine lettuce, trimmed, cut crosswise into 3/4-inch strips2cups (loosely packed) flat-leaf parsley leaves2cups purslane leaves or additional 3/4-inch-strips romaine lettuce1cup fresh mint leavesGround sumac (optional)PreparationDressingStep 1Combine sumac with soaking liquid, 3 Tbsp. lemon juice, 2 Tbsp. pomegranate molasses, garlic, 2 tsp. vinegar, and dried mint in a small bowl. Gradually add oil, whisking constantly, until well blended. Season with salt; add more lemon juice, pomegranate molasses, and vinegar to taste, if desired.SaladStep 2Place pita pieces in a medium bowl; pour oil over and toss to coat. Season pita to taste with salt.Step 3Mix tomatoes and next 6 ingredients in a large bowl. Add ¾ of dressing; toss to coat, adding more dressing by tablespoonfuls as needed. Season with salt. Add pita; toss once. Sprinkle sumac over, if desired.Nutrition Per Serving7 servings 1 serving contains: Calories (kcal) 310 Fat (g) 26 Saturated Fat (g) 4 Cholesterol (mg) 0 Carbohydrates (g) 19 Dietary Fiber (g) 3 Total Sugars (g) 4 Protein (g) 4 Sodium (mg) 230How would you rate Fattoush?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI hate reviews complaining about the ingredients required for an authentic recipe. If you don't have them, don't make a fattoush.\nLoved this recipe. It transported me back to my childhood and grandmother's kitchen. The sumac and dried mint are essential. DawnYpsilanti, MI10/24/2021Was going to make it but am all out of dried sumac, pomagranite molasses amd dried mint!  NOTAnonymous10/5/2021Great salad, loved the sumac.brushjlSolon, ohio8/31/2019Loved this; would make again.AnonymousSf5/21/2019Explore Bon AppétitSaladMiddle EasternCherry TomatoTomatoVegetableCucumberRomaineLettuceLeafy GreensMintHerbs & SpicesParsleyEasyWeeknight MealsQuickOne-Pot MealsSideVegetarianVeganNut-FreeDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2012-04-17", "author": ["Condé Nast", "Mario Haddad Of The Lebanese Academy Of Gastronomy", "Marcus Nilsson"]}