{"id": "6bd7616234b6869acb9330c75a0cc91a", "url": "https://www.bonappetit.com/recipe/preserved-lemon-tea-cake", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Preserved-Lemon Tea Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssuePreserved-Lemon Tea CakeBy Zaynab IssaFebruary 8, 20224.5(23)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintTo make the lemon-iest lemon cake, work smarter not harder. Instead of upping the amount of fresh fruit, seek out a more intense initial product. Preserved lemons, when puréed into paste and incorporated into the simple batter, bring a powerful citrus flavor and subtle brininess that zest and juice alone could never achieve. Olive oil reinforces the fruity savoriness and works with the sour cream to keep this loaf plush and moist for days. (And before you worry, even though preserved lemons are salt-cured, the final product does not taste salty.)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonLoaf Pan$15 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonSilicone Spatula$13 At BA MarketWire Cooling Rack$17 At Bon Appétit MarketSmall Offset Spatula$6 At AmazonIngredientsMakes one 8½x4½\" loaf½cup extra-virgin olive oil, plus more for parchment1preserved lemon (about 55 g)1½cups (188 g) all purpose flour2tsp. baking powder½tsp. ground turmeric3large eggs1cup plus 2 Tbsp. (225 g) granulated sugar½cup sour cream1Tbsp. finely grated lemon zest3Tbsp. fresh lemon juice¾cup (83 g) powdered sugar1Tbsp. whole milkFlaky sea saltPreparationStep 1Place a rack in middle of oven; preheat to 350°. Line an 8½x4½\" loaf pan, preferably metal, with parchment paper, leaving generous overhang on the long sides, and brush with oil. Cut preserved lemon into quarters; remove any seeds. Transfer to a small food processor and process to form a paste (you can also do this with a mortar and pestle or simply chop and smash with your knife).Step 2Whisk flour, baking powder, and turmeric in a medium bowl to combine. Beat eggs, granulated sugar, and remaining ½ cup oil in the bowl of a stand mixer fitted with the paddle attachment on medium speed until smooth and incorporated, about 1 minute. Add sour cream and mix to combine. Add preserved-lemon paste, lemon zest, and lemon juice and mix to combine. Reduce speed to low, add dry ingredients, and mix until just combined, about 15 seconds. (Batter can also be mixed together in a large bowl with a whisk.) Scrape batter into prepared pan and smooth top.Step 3Bake cake until top is golden brown and a tester inserted into the center comes out clean, 50–60 minutes. Transfer pan to a wire rack and let cake cool 15 minutes. Run a knife around sides of pan to loosen and, using parchment paper overhang, lift cake out of pan and onto rack. Peel away parchment paper and discard. Let cake cool completely.Step 4Meanwhile, whisk powdered sugar and milk in a medium bowl until smooth.Step 5Transfer cake to a platter or large plate. Using a rubber spatula to help guide glaze, spoon glaze over cake, letting it drip down the sides (you should have a fairly thick coating). Sprinkle sea salt over glaze and let cake sit until glaze is set, about 30 minutes.Do ahead: Cake can be made 3 days ahead. Store airtight at room temperature.How would you rate Preserved-Lemon Tea Cake?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleIts also insanely easy to preserve your own lemons yall!!! Just pack them babies in sugar after quartering them and let them sit u refrigerated for a bit! NBD!!!!\nWhen life gives ya lemons. Portland oregon 3/12/2022I've just left  review  (5 stars)- but wanted to say that most preserved lemon recipes call for 5-10% salt. I used a locally-made organic preserved lemon product only 2% sea salt and it was perfect. Might be a good idea to check (or taste) the preserved lemon first  - if salt is the dominant taste best to give it a rinse. SusanWellington New Zealand3/11/2022A great cake/loaf  was delicious even without the icing.  I had to sub in yoghurt for sour cream but I doubt if that made a difference to the outcome.  A lovely moist cake with a great crunchy crust - and the colour is divine. The result  was so glamorous - I almost didn't want to admit how easy this was to make.  This will definitely be my party trick - once we start having parties again.SusanWellington New Zealand3/11/2022For the cook seeking preserved lemons, I've found them at well-stocked grocers, as well as World Market, and Amzn. (The jars are pretty small, generally.) I hope that helps. Happy cooking and baking!Allison O.PNW3/5/2022I want to try this, but I am stumped at the thought of getting my hands on preserved lemons.  Should I expect this in my local mega grocery store?  Any recommendations for a brand?  I've seen Paula Wolfert's recipe for making them, but they involve at least a month's wait.  I'd like to make this cake today!  TIA.Betty Rubble01730Bedford, MA3/3/2022This is a beautiful, beautiful cake, with its a lovely crunchy brown slightly caramelized crust, and lovely yellow inside. The taste is rich, tart, and delicious. 10 out 5 stars from me (if I could)! AnonymousSaskatchewan3/1/2022I’d love to make this recipe and would really love it if you could include more detailed instructions on preserving the lemon and steps on using. Or a video on this recipe. Thanks much!!Jeanine Lindhorst Upstate NY2/28/2022For the cook who said it was too salty, you need to rinse the preserved lemon to remove excess salt. Then use to cook AnonymousCalifornia 2/27/2022Any recommendations on how to make this recipe vegan?AnonymousNew York, NY2/27/2022Loved it\nBeautiful taste and textureJidu MosesBrisbane Australia2/27/2022Literally one of the worst things I have ever eaten.  So salty it was inedible.  Maybe it was the brand of preserved lemon, but man it is bad bad bad.  I took one bite and threw the whole cake out.PaulSeattle, WA 2/24/2022This is quite good even with the non-dairy replacements I had to make (almond yogurt for the sour cream and almond milk in the icing). The texture is fine and the flavor is pleasing. To reduce making more dirty dishes, I just put all of the wet ingredients into the food processor instead of a mixer. then poured the wet into the bowl with the dry ingredients. Perhaps this is why the top cracked a bit, but the icing covered it up nicely. NellAustin TX2/11/2022Explore Bon AppétitDessertCakeLoaf CakeNut-FreeBakingTurmericHerbs & SpicesLemonCitrusFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Zaynab Issa"]}