{"id": "6be258d19cf05107792e66be1b971b7c", "url": "https://www.bonappetit.com/recipe/grilled-pork-spareribs-with-gochujang-barbecue-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Pork Ribs with Gochujang Barbecue Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Pork Ribs with Gochujang Barbecue SauceBy Chris MoroccoMay 22, 20185.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThese grilled pork ribs are all about the sauce. This stir-together gochujang situation has everything you want—heat, sweetness, and palate-gripping acid—but with extra tang. Try this glaze on: Boneless chicken thighs, pork shoulder steaks, or skirt steak.Ingredients4 servings⅔cup apple cider vinegar½cup (packed) dark brown sugar6Tbsp. gochujang (Korean hot pepper paste)¼cup adobo (from 1 can chipotle chiles in adobo)2racks St. Louis–style pork spareribs (about 4 lb.)Kosher salt, freshly ground pepperVegetable oil (for grill)PreparationStep 1Place a rack in middle of oven and preheat to 350°. Whisk vinegar, brown sugar, gochujang, and adobo in a medium bowl until sugar is dissolved. Transfer half of sauce to a small bowl and set aside for serving.Step 2Season ribs all over with salt and pepper. Place each rack on a double layer of foil and wrap up. Set on a rimmed baking sheet; bake until very tender but not falling apart, 2½–3 hours. Let cool.Step 3Prepare a grill for medium-high heat; oil grate. Grill ribs, turning several times and beginning to baste with remaining sauce as soon as ribs begin to brown, until charred and coated with a thick layer of glaze and heated through, 8–10 minutes. Transfer ribs to a cutting board and cut between bones into individual ribs. Serve with reserved sauce alongside.How would you rate Grilled Pork Ribs with Gochujang Barbecue Sauce?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is my go to rib recipes. I have made it many times and it is always delicious. To Anonymous in Phoenix:  Half the sauce is set aside for serving and the other half is used to baste the ribs after the initial 2-3 hour cook time. But I'm sure they still came out great !  AnonymousBoston7/24/2019putting together this recipe for this evening's meal. ... The recipe does not indicate what to do with the 1/2 of the sauce that is NOT put aside for serving. Made the assumption that is should be placed on the ribs after seasoning with salt and pepper. Hopefully this is the correct assumption.AnonymousPhoenix7/10/2019THESE ARE SO GOOD. I liberally seasoned before wrapping which I think was helpful. I only did one rack and it was done at 2hr 15m. With no grill, I used my broiler and the foil packets as bowls for the BBQ. Served with mashed potatoes and celery. Fantastic recipe.AnonymousMadison, WI6/25/2019More of a question, when using the adobo are you just going for the sauce or does the 1/4 cup include chilies as well?Anonymous11/25/2018Explore Bon AppétitRibsKoreanEast AsianAsianPork RibPorkMeatEasyMainDairy-FreeNut-FreeRoastSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}