{"id": "6be8c38e52b9db00fd634a9f8b87cdab", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/che-fico", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Che Fico Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoChe FicoThe breezy, stylish Italian restaurant that’s been an instant hit in NoPaFacebookPinterestTwitterEmailPhoto by Alex LauGO: to experience how fine-dining alums David Nayfeld and Angela Pinkerton take on rustic Italian food (pizza! crostata!) at 2018 Hot 10 winner Che Fico.ORDER THE: indulgent spaghetti with lobster pomodoro; chopped salad; any of the pizzas, which come with a thatched roof of shaved cheese on the crust; and all of Pinkerton’s desserts, from the luxurious chocolate budino to the perfectly balanced citrus tart. For more of Pinkerton’s genius, check out the downstairs space, her diner-esque Theorita.THE VIBE IS: laid-back and warm, despite the constant crowds. You don’t need to flag down a bartender at the two-people-deep bar; they’ll find you. And once inside the converted auto garage, you’ll spy families and groups of friends all out for a big night, sharing pizzas, pastas, and stories.PRACTICAL STUFF: Open Tuesday to Thursday, 5:30 p.m. to 11 p.m., and Friday and Saturday, 5:30 p.m. to midnight.Photo by Alex LauPhoto by Alex LauPhoto by Alex LauWE ALSO LOVEZuni CaféThe iconic Hayes Valley bistro that's world-famous for a reasonThe ProgressThe husband-and-wife team behind State Bird Provisions reimagines the family-style dinner party in San Francisco.Tartine ManufactoryThe megabakery-slash-wine-bar-slash-ice-cream-shop-slash-restaurantExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-11-12", "author": ["Elyse Inamine"]}