{"id": "6c0de13899737f99b4285e2cdc197d7f", "url": "https://www.bonappetit.com/recipe/twice-roasted-squash-with-vanilla-maple-and-chile", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Twice-Roasted Squash With Vanilla, Maple, and Chile Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueTwice-Roasted Squash With Vanilla, Maple, and ChileBy Kendra VaculinOctober 19, 20214.5(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrintThe undisputed worst part of roasting squash is laboriously hacking apart a rock-hard gourd. Skip that entire process by roasting a kabocha squash whole, then tearing the cooked flesh into pieces to roast again under a fragrant and slightly spicy glaze. The result is tender squash with a sticky-sweet sheen in boats of crispy skin. If you want to work ahead, roast the whole squash a day before you need it and store it in your refrigerator; before serving, simply tear the squash, drizzle it with glaze, and pop it back into the oven for the final roast.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketLarge Basting Spoon$16.37 At AmazonSmall Saucepan$155 At AmazonIngredients8 Servings22½–3½-lb. kabocha squash2–3Fresno chiles, thinly sliced½cup pure maple syrup1Tbsp. vanilla extractKosher salt⅓cup extra-virgin olive oil3Tbsp. toasted sesame seedsPreparationStep 1Preheat oven to 425°. Poke each squash a few times with a sharp knife, then place on a foil-lined rimmed baking sheet. Roast until a fork easily pierces through skin, about 1 hour. Let sit until cool enough to handle, then cut each squash in half. Scoop out and discard seeds. Tear squash into large pieces and arrange, flesh side up, on same baking sheet.Step 2Increase oven temperature to 450°. Bring chiles, maple syrup, vanilla, and a big pinch of salt to a boil in a small saucepan; reduce heat and simmer until thickened, 8–10 minutes. Remove from heat and stir in oil.Step 3Generously season squash with salt, then spoon maple syrup mixture over each piece. Roast squash until darkened slightly and jammy in spots, 20–25 minutes.Step 4Transfer squash to a platter and sprinkle sesame seeds over.Do ahead: Squash can be roasted 1 day ahead. Let cool. Wrap in foil (leave whole) and chill.How would you rate Twice-Roasted Squash With Vanilla, Maple, and Chile?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI really like the flavors and the simplicity of this recipe.  However, my squash dried out so badly.  Rather than being soft, it broke apart in dried up chunks.    I wish I could see all the reviews to determine if others had this issue and what they did.LynnSOshkosh, WI2/1/2022I took Angela's advice and didn’t cook it as long on the first bake which worked well.I thought the recipe called for too much vanilla. I wonder if you could use Trader Joe's chili oil and just add the maple syrup. I did think the sweet and spicy flavors worked well with the squash.SueDenver 1/19/2022Flavors were really good,  but I found that the squash cooked much faster than the time listed in the recipe.  This meant my squash got really soft and it was impossible to tear the squash apart and have it sit upright to roast again as instructed. It also meant the skins were too soft to separate, but not really that great to eat with the super soft flesh and it ended up looking like kind of a mess. I would try this recipe again, but I would reduce the initial roasting time. Angela SkradeMinneapolis, MN 12/5/2021Perfection! Tasty balance of sticky sweet and spice. Texture of this particular squash is velvety and not stringy or chalky. Laura EspositoNashville 11/26/2021Can’t access other reviewsJanBellingham, WA11/23/2021Explore Bon AppétitKabocha SquashSquashVegetableVanillaHerbs & SpicesMapleChileSideFallThanksgivingEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Kendra Vaculin"]}