{"id": "6c22c56110dfdf19d4c4e43b930255ca", "url": "https://www.bonappetit.com/recipe/shrimp-hot-chicken-style-with-grits-croutons", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Shrimp Hot Chicken-Style with Grits Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueShrimp Hot Chicken-Style with Grits CroutonsBy Todd RichardsMay 22, 2018EmailPinterestPrintShrimp hot chicken-style with grits croutonsPhoto by Greg DuPree, Food Styling by Margaret Monroe Dickey, Prop Styling by Mindi ShapiroEmailPinterestPrintEmailPinterestPrintTodd Richards, who developed this recipe for his new cookbook Soul, says, “One thing that I really wanted to do was progress the idea of shrimp and grits, but still make it familiar enough where a person could see the origin of the dish. In food culture right now, everyone is looking for spice and flavors. This really speaks to both. It’s an interesting combination using a classic Southern dish of shrimp and grits and pairing it with hot chicken.” Read an interview with Richards about the recipe and more, here.Ingredients4 servingsGrits Croutons1Tbsp. plus 1 tsp. kosher salt2cups uncooked stone-ground grits4oz. aged cheddar, shredded (about 1 cup)½cup heavy cream3Tbsp. unsalted butter1½tsp. coarsely ground black pepper, divided¼cup blended olive oil1cup plain yellow cornmeal1tsp. granulated onionShrimp and Assembly2Tbsp. plus 4 tsp. blended olive oil1small onion, finely chopped (about 1 cup)¼cup dry white wine2cups heavy cream¼cup hot sauce, such as Tabasco1Tbsp. cayenne pepper2tsp. finely grated lemon zest1tsp. kosher salt1tsp. chili powder1tsp. granulated garlic1tsp. paprika½tsp. coarsely ground black pepper¼tsp. fennel seeds20unpeeled colossal raw shrimp (about 1½ lb.), deveined¼cup chopped parsley2Tbsp. salted butterPreparationGrits CroutonsStep 1Bring 1 Tbsp. salt and 8 cups water to a boil in a medium stockpot over medium heat. Add grits and stir with a wooden spoon or spatula to ensure grits don’t stick to bottom of pot. Cover, reduce heat to medium-low, and simmer, stirring occasionally, 30 minutes.Step 2Uncover and cook, stirring often, until very thick, about 15 minutes. Remove from heat and let rest 5 minutes. Fold in cheese, cream, butter, and ½ tsp. pepper. Let rest 5 minutes before using. Chill 2 cups grits until firm to make croutons; reserve remaining grits for another use.Step 3Cut chilled grits into 1\" squares. Heat oil in a large sauté pan over medium.Step 4Combine cornmeal, granulated onion, and remaining 1 tsp. salt and 1 tsp. pepper in a shallow dish. Dredge cubes in cornmeal mixture.Step 5Working in batches, fry cubes until crispy on all sides, 6–8 minutes. (If grits are very cold, frying will take 8–10 minutes.) Drain croutons on a plate lined with paper towels.Shrimp and AssemblyStep 6Heat 2 Tbsp. oil in a medium saucepan over medium-high. Cook onion, stirring, until softened, about 2 minutes.Step 7Add wine and cook, stirring, until reduced by half, 1–2 minutes. Add cream, hot sauce, cayenne, lemon zest, salt, chili powder, granulated garlic, paprika, black pepper, and fennel seeds and stir to combine.Step 8Peel shrimp and remove heads, then add shells and heads to pan. Bring to a simmer and cook, stirring occasionally, until reduced by half (to about 2½ cups), 10–15 minutes. Remove from heat. Pluck out and discard shrimp heads and shells.Step 9Transfer mixture to a blender. Remove center of blender lid to allow steam to escape and to prevent overflowing. Process until smooth, about 30 seconds. (You should have about 2 cups.)Step 10Heat remaining 4 tsp. oil in a large skillet over medium-high. Arrange shrimp in skillet in a single layer, being careful not to overcrowd pan. Sear on 1 side for 2 minutes. Turn and cover with sauce. Cover pot, remove from heat, and let rest until shrimp is cooked through, about 4 minutes. Stir in parsley and butter.Step 11Arrange grits croutons on a platter. Top with shrimp and sauce.How would you rate Shrimp Hot Chicken-Style with Grits Croutons?Leave a ReviewTell us what you thinkExplore Bon AppétitSouthernAmericanShrimpShellfishSeafoodGritsRice & GrainsCornmealFlourEasyMainGluten-FreeNut-FreeKwanzaaLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Todd Richards"]}