{"id": "6c35d6f5f4190fdd37ee7d1cd5972e7d", "url": "https://www.bonappetit.com/story/hawa-hassan-the-hot-sauce-boss-that-goes-with-her-gut", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Hawa Hassan: The Hot Sauce Boss that Goes with Her Gut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHawa Hassan: The Hot Sauce Boss that Goes with Her Gut“Cooking a meal is how I say I love you.”By KeVitaJune 15, 2019FacebookTwitterEmailFacebookTwitterEmailWhile food is now her love language, that wasn’t always the case with the Somali model-turned-entrepreneur Hawa Hassan. “I always looked at cooking as a chore, but when I moved into the space of food, I started to see cooking as a joy and a safe space for other people.”Hassan was born in Somalia, and during the country’s civil war, she escaped to a refugee camp in Kenya with her mother and four siblings. At the age of 7, she moved to Seattle alone and stayed with a family friend. It would be 15 long years before she would see her family again. During her last year of high school, she went on a casting call with a friend. It was Hassan who was asked to be a model, a path that ultimately was not her core destiny. “When I was modeling, I was not in charge of the narrative,” she explains. While modeling may seem like a dream to some, Hassan wanted to harness her narrative. “Very early on, I knew it was not a sustainable career and I wanted to be in control of my story.”In 2014, she started Basbaas, a line of hot sauces and chutneys. “The last time I modeled was in April of 2015 and that’s right when we launched—I haven’t looked back.” Hassan’s line of all-natural, locally sourced, gluten-free, and vegan products are inspired by a central theme: early life in Somalia, and specifically being raised on the Indian Ocean. “Warm spices like cardamom, coriander, ginger, cinnamon, and cloves do it for me.” All flavors that pair well with her go-to: Pineapple Peach KeVita Master Brew Kombucha.Basbaas comes from the Somali term for chili but is built upon a richer history. Inspired by heirloom recipes of the region, the products, smoky tamarind date sauce, and a spicy coconut cilantro chutney, are the only kind of Somali hot sauces and chutneys available in the United States. “I knew it was something that no one else was doing and I could start the conversation from an authentic space. I didn’t want to take over the people’s tables; I wanted to be at the table.” She imagines that her product will one day be like some of the once-unknown sauces that are now as common as ketchup. She references growing up in the 90s when the now-popular chili sauce would only be available at Asian restaurants. “I want a corner of the table and then move into the center and then on to the plate.”Hassan calls herself the ShEO of her company. Being a female in the New York City food industry has given the woman-led business an incredible sense of community. She says that the chefs, book writers, and restaurant owners in this space have each other’s interests at heart and empower one another, noting: “I call them my food sisters.” Her advice to those who need the motivation to try something new, in the food industry or otherwise? Ask, “What do you know for sure?” Hassan says that when she was modeling, she was depleted and confused. She questioned, “Do I want to be 40 years old and not in charge, not know how much money was coming in, and still at the mercy of someone else?” She says that if you wholeheartedly believe in what you do, you won’t entertain the pursuit of unfulfilling things. “If someone needs motivating, ask them ‘what do you know for sure’ and if their answer doesn’t align with their goals or ideals, then they should run.”Right now, it seems that Hassan is running towards her destiny as she sips her Pineapple Peach KeVita Master Brew Kombucha and reflects fondly on a memory from 2014. She spent a month at her mother’s home in Oslo, and every evening that June her mom would invite people from work, neighbors, and family over for dinner. “My sisters and I would be cooking for three or four hours and then we’d all sit in a circle eating together.” Perhaps it was this moment that motivated her to find success in the world of food.As a true authority on the condiments of Africa, Basbaas has four new products in the works, and Hassan is soon releasing a cookbook. For this ShEO, the possibilities are endless—and it all starts with trying something new, exploring the unknown, and a little bit of spice.The information in this article is the opinion of the author(s) and in no way reflects the policies or positions of KeVita. This is not intended to be a substitute for professional medical or nutrition advice.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-15", "author": ["Condé Nast"]}