{"id": "6c4319c6dab24542169228a75f145c1a", "url": "https://www.bonappetit.com/recipe/phanaeng-curry-beef-skewers", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Phanaeng-Curry Beef Skewers With Grilled Pumpkin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPhanaeng-Curry Beef Skewers With Grilled PumpkinBy Leela PunyaratabandhuSeptember 4, 20203.9(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food styling by rebecca jurkevichEmailPinterestPrintEmailPinterestPrint“One reason phanaeng curry is one of the most beloved in Thailand is that, when traditionally made, it’s thicker and more concentrated (with more flavor, not more heat) than most other curries,” writes Leela Punyaratabandhu in Flavors of the Southeast Asian Grill: Classic Recipes for Seafood and Meats Cooked Over Charcoal. “Like those other curries, phanaeng is served in a bowl with rice—which is why my entire extended family was amazed when a caterer at my grandfather’s 72nd birthday party threaded phanaeng marinated beef and large cubes of pumpkin onto skewers and grilled them. We loved it so much, we reverse-engineered it, and have made it at every family reunion ever since.You can serve the skewers with cooked jasmine rice; just season the sauce with a heavier hand. Be sure to use a well-marbled, quick-cooking cut of beef, such as rib eye or sirloin steak, and a dense, low-moisture pumpkin or winter squash—kabocha, Buttercup, Musquée de Provence (aka Fairy Tale pumpkin), and Potimarron squash (aka Red Kuri) are my absolute favorites, but common butternut squash works. Look for Nittaya or Mae Ploy brand phanaeng (also spelled panang) curry paste sold in tubs.” Reprinted with permission from ‘Flavors of the Southeast Asian Grill: Classic Recipes for Seafood and Meats Cooked Over Charcoal’ by Leela Punyaratabandhu. Copyright © 2020 shesimmers.com. Published by Ten Speed Press, an imprint of Penguin Random House.IngredientsBeef2tablespoons packed phanaeng curry paste (see headnote) or red curry paste2heaping tablespoons unsweetened natural creamy peanut butter2tablespoons packed grated palm sugar or granulated coconut sugar, or 1 tablespoon packed light brown sugar¾cup unsweetened full-fat coconut milk1teaspoon salt2pounds well-marbled rib-eye steaks or sirloin steak or tips, cut against the grain into bite-size pieces about 1⁄4 inch thickPumpkin8cups ice-cold water2pounds dense, low-moisture pumpkin or winter squash (see headnote), peeled, seeded, and cut into 1-inch cubes¼teaspoon saltSauce2tablespoons coconut oil2tablespoons packed phanaeng curry paste or red curry paste1½cups unsweetened full-fat coconut milk1tablespoon packed grated palm sugar or granulated coconut sugar, or 2 teaspoons packed light brown sugar2teaspoons fish sauce½cup coconut oil, melted, for brushing½cup unsalted roasted peanuts, coarsely chopped, for garnish4–6fresh red bird’s eye chiles, or 2 larger hot red chiles, thinly sliced, for garnish5–6makrut lime leaves, deveined and cut into whisker-thin strips, or 1⁄2 cup fresh Thai basil leaves, for garnishPreparationStep 1To prep the beef: In a large bowl, stir together the curry paste, peanut butter, sugar, coconut milk, and salt, mixing well. Add the beef and stir to coat evenly. Cover and refrigerate for 2 hours.Step 2Soak twelve 12-inch bamboo skewers in water to cover for 1 to 2 hours.Step 3To prep the pumpkin: About 15 minutes before the beef is done marinating, fill a 4-quart saucepan half full with water and bring to a boil. Pour the ice-cold water into a large bowl and put the bowl into the sink. Add the pumpkin cubes to the boiling water and blanch for 1 minute. Using a fine-mesh skimmer, quickly transfer the pumpkin to the cold water to stop the cooking. Drain the pumpkin, pat dry, and transfer to a medium bowl. Add the salt and mix gently but thoroughly; set aside.Step 4Divide the beef into twelve equal portions; do the same with the pumpkin. Working with one portion of beef and one of pumpkin, alternately thread them onto a soaked skewer. Push the beef and pumpkin snugly against one another to form a compact bundle toward the tip end of the skewer, leaving the blunt end bare to use as a handle. Repeat with the remaining meat and pumpkin portions and skewers.Step 5Prepare a medium-high fire (400° to 450°F) in a charcoal grill using the two-zone method. Alternatively, light a full chimney of charcoal, and when the coals are ready, spread them out on the bottom of a hibachi for cooking over a medium fire (350° to 375°F).Step 6While waiting for the grill to heat, make the sauce: In a 1-quart saucepan, combine the oil and curry paste over medium-high heat. When the oil has melted, stir until fragrant, about 1 minute. Add the coconut milk and sugar and simmer for 3 minutes, stirring often. Add the fish sauce, then taste and adjust the seasoning with more fish sauce if needed. Keep warm.Step 7When the coals are covered with white ash and the grate is hot, place the skewers in the middle of the grill halfway between the hot side and the hold side. Cook uncovered, brushing with the oil and flipping and turning the skewers as needed to cook evenly, until both the beef and the pumpkin are lightly charred, 10 to 12 minutes.Step 8Transfer the skewers to a large platter. Drizzle the warm sauce over them and sprinkle with the peanuts first, followed by the chiles, and then the lime leaves. If using basil leaves, tear them into small pieces at the last minute. Serve immediately.How would you rate Phanaeng-Curry Beef Skewers With Grilled Pumpkin?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI tried it, but did not like it.JuliGermany2/5/2021The is recipe, served with rice, was a HUGE HIT at my house.  Thankfully we saw the notes from prior reviewers and knew to blanche the squash for longer - closer to 3.5-4 mins- because we had no issues.  SO SO GOOD. Can't wait to make it again!  AleshaChicago11/25/2020We loved this dish! We used pre-cubed butternut squash from the store that ran a little smaller, and blanched a little longer, maybe 1.5 minutes.  Came out perfect. Marinated for 4 hours just because we had the time, and served over jasmine rice.  Gorgeous, tasty, and filling! Thanks for a great meal!AnonymousFalls Church, VA9/17/2020Really tasty. Thanks to the last review we blanched our veg (butternut squash) for quite a bit longer than a minute. I thought the sauce was going to be too salty but the squash helped (we also served with rice and that basil)daylebagcanada9/17/2020The sauce for this recipe is delicious and I will definitely make it again. Unfortunately the method is flawed and unless you enjoy charred but otherwise raw pumpkin/squash you’ll find yourself wishing you had blanched it substantially longer than the 1 minute called for in the recipe.  Anonymous9/14/2020Explore Bon AppétitSkewerThaiSoutheast AsianAsianBeefMeatPumpkinSquashVegetableCoconut MilkOther IngredientsSummerFallMainGluten-FreeDairy-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-04", "author": ["Condé Nast", "Leela Punyaratabandhu"]}