{"id": "6c4683f355233cf25669d4fe009f0600", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/el-hidalguense", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "El Hidalguense Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityEl HidalguenseAll the lamb barbacoa your body can handle... Friday to Sunday only.FacebookPinterestTwitterEmailPhoto by Jennifer Cole GO: to feast on some barbacoa (a.k.a. slow-cooked lamb tacos). Barbacoa is a specialty of the central Mexican state of Hidalgo, hence the name of El Hidalguense.BESIDES THE BARBACOA, ORDER THE: queso asado. Think broiled cheese meets refried beans. It's heaven.THE VIBE IS: lively and crowded. Everyone is happy to be there and happy to be eating... lots of tacos.PRACTICAL STUFF: El Hidalguense is only open from Friday to Sunday, so expect a wait if you're going at prime eating times.—Carey PolisWE ALSO LOVEBarra ViejaSuper fresh seafood tostadas, tacos, and ceviches on a roving food truckEl TurixTextbook *cochinita pibil* in a scrappy taquería in the heart of Mexico City’s Beverly HillsTostadas CoyoacánNot just Instagram-worthy but incredibly tasty, tooExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Bon Appétit Carey Polis"]}