{"id": "6c4955330e24b9b73a74addf74dcf686", "url": "https://www.bonappetit.com/story/jonathan-gold-dead", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Jonathan Gold, Los Angeles Times Restaurant Critic, Dead at 57 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJonathan Gold, Los Angeles Times Restaurant Critic, Dead at 57Jonathan Gold has died of pancreatic cancer after getting diagnosed with the disease earlier in July.By Bon AppétitJuly 21, 2018FacebookTwitterEmailCourtesy Sundance SelectsFacebookTwitterEmailLos Angeles Times restaurant critic Jonathan Gold has died at age 57 of pancreatic cancer. Gold was widely heralded as one of the leading and most respected voices in food criticism, and his annual 101 Best Restaurants list was a testament to the amazing amount of ground he covered.Gold received the Pulitzer Prize in 2007 for his work at LA Weekly—he is the only food critic who has received the prestigious award. In 2016, Gold was the subject of the documentary film City of Gold which offered a glimpse into Gold's world as a restaurant critic. He has written over 1000 reviews since the 1980s, focusing on the incredible variety of cuisines available in and around Los Angeles.Here, the food community shares many heartfelt remembrances:Former Gourmet editor and LA Times (and New York Times) critic Ruth Reichl:Twitter contentThis content can also be viewed on the site it originates from.The New Yorker food correspondent Helen Rosner:Twitter contentThis content can also be viewed on the site it originates from.Splendid Table host and Clarkson Potter editor Francis Lam:Twitter contentThis content can also be viewed on the site it originates from.LA Times deputy managing editor Kimi Yoshino:Twitter contentThis content can also be viewed on the site it originates from.Former Lucky Peach editor Peter Meehan:Twitter contentThis content can also be viewed on the site it originates from.Eater New York senior food critic (and former Village Voice critic) Robert Sietsema:Twitter contentThis content can also be viewed on the site it originates from.Chef Tom Colicchio:Twitter contentThis content can also be viewed on the site it originates from.Food writer Charlotte Druckman:Twitter contentThis content can also be viewed on the site it originates from.Writer Rachel Syme:Twitter contentThis content can also be viewed on the site it originates from.Actor Ike Barinholtz:Twitter contentThis content can also be viewed on the site it originates from.KCRW Good Food host Evan Kleiman:Twitter contentThis content can also be viewed on the site it originates from.Chef Rene Redzepi of Noma:Twitter contentThis content can also be viewed on the site it originates from.See more: Jonathan Gold Is the Reason I Write About Food, Jonathan Gold Was the Food Writer Who Made Us Love Food WritingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-22", "author": ["Condé Nast", "Bon Appétit"]}