{"id": "6c4c74c039188365d7d9165c6cf694db", "url": "https://www.bonappetit.com/recipe/bolinho-de-arroz-with-molho-verde", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Bolinho de Arroz With Molho Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueBolinho de Arroz With Molho VerdeBy Erminia ApolinarioJanuary 4, 20224.3(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranEmailPinterestPrintEmailPinterestPrintChef Erminia Apolinario grew up eating bolinho de arroz, bite-size rice balls stuffed with cheese (along with anything else you want, like chicken or bacon) and deep-fried. Here the popular Brazilian treat is served with molho verde, a punchy herb-forward sauce, for a perfect snack that, according to Apolinario, can be improved only by serving alongside a cold beer.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonDutch Oven$80 At AmazonDeep-Fry Thermometer$29 $16 At AmazonSpider$6 At AmazonIngredients4–6 servingsMolho verde2scallions, coarsely chopped2garlic cloves, crushed1½cups (lightly packed) parsley leaves with tender stems1cup cold whole milk1Tbsp. plus 1½ tsp. fresh lime juice1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1tsp. sugar1½tsp. vegetable oilRice Balls1cup jasmine rice1large egg¼cup all-purpose flour3Tbsp. chilled whole milk2Tbsp. finely chopped onion1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1½tsp. finely chopped garlic1½tsp. finely chopped peeled ginger1½tsp. finely chopped rosemary4oz. sharp cheddar, cut into ½\" piecesVegetable oil (for frying; 6–8 cups)Special equipmentA deep-fry thermometerPreparationMolho verdeStep 1Purée scallions, garlic, parsley, milk, lime juice, salt, and sugar in a blender until smooth. Add oil and blend until sauce thickens slightly. Transfer to a small bowl.Do Ahead: Molho verde can be made 3 days ahead. Cover and chill.Rice BallsStep 2Rinse rice in a fine-mesh sieve under cold running water until water runs clear; drain well. Bring rice and 2 cups water to a boil in a small saucepan. Reduce heat to low, cover pan, and cook until rice is tender and liquid is absorbed, 15–20 minutes. Remove from heat, uncover, and let cool.Step 3Mix rice, egg, flour, milk, onion, salt, garlic, ginger, and rosemary in a medium bowl until well combined. Scoop out 2 heaping tablespoonfuls of rice mixture and roll into a ball with your hands, then flatten into a 3\"-diameter patty. Using your thumb, make a shallow indentation in the center of patty; place a piece of cheddar inside. Pinch rice mixture together to encase cheese; roll into a smooth ball. Transfer rice ball to a plate; repeat with remaining rice mixture (you should have about 12 rice balls).Step 4Fit a medium Dutch oven or other heavy pot with thermometer. Pour in oil to come 3\" up sides. Heat over medium-high until thermometer registers 350°.Step 5Working in 2 batches, carefully lower rice balls into oil with a slotted spoon or spider. Fry, turning often, until golden brown, about 4 minutes. Transfer to paper towels to drain.Step 6Serve hot with molho verde alongside.How would you rate Bolinho de Arroz With Molho Verde?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMade this with a friend and we were pleasantly surprised because we were unsure about the sauce. When you test the sauce in its own, it’s nothing special, but pairs great with the ginger and rosemary. It was our first time making anything like this and the directions were accurate except we decided to do a double batch of the rice balls because the one cup of whole milk yielded way more sauce than needed. So if you do the one batch, one could get away with doing a half cup of milk. EliseNew Hampshire1/16/2022Explore Bon AppétitDinnerStarterSnackVegetarianNut-FreeBrazilianSouth AmericanLatin AmericanRiceRice & GrainsCheddarCheeseDeep-fryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Erminia Apolinario"]}