{"id": "6c63b83083b1879b6e6f113b6130cd74", "url": "https://www.bonappetit.com/recipe/purple-sticky-rice", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Purple Sticky Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssuePurple Sticky RiceBy Yia VangApril 14, 20203.8(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintSticky rice is a cornerstone of the Hmong kitchen. The recipe comes from chef Yia Vang at Union Hmong Kitchen in Minneapolis. Use it as a utensil—grab a small handful, pick up a little meat with it, and dip in hot sauce for the perfect bite.Ingredients4 servings1cup glutinous sweet rice3Tbsp. black ricespecial Equipment2layers of cheeseclothPreparationStep 1Place both rices in a colander and rinse several times under cold running water until water runs clear. Drain well. Transfer to a medium bowl; pour in cold water to cover by 2\". Cover and chill 12 hours.Step 2Line a metal steamer basket with cheesecloth (you need enough to wrap around rice). Pour water into a medium pot to come 2\" up sides, then set basket inside. Drain rice and place inside basket; bring cheesecloth up and over rice to cover. Set pot over medium heat. Cover and steam rice until tender, 20–25 minutes.How would you rate Purple Sticky Rice?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleIt was good but turned out a bit dry, but that didn't really matter because it paired great with the Butterflied chicken  lukeensSeattle6/10/2020Typo in the ratios has been fixed, and can now confirm that this recipe makes a beautiful bowl of rice!MaxElliottoronto4/23/2020Just read recipe in the magazine and was concerned that the ratio of rice was wrong. Seems like that may be the case. Other recipes call for 1:1:1 ratio of black, glutinous and regular jasmine rice or something similar. MI4/21/2020Only a low rating because BA has the ratios of rice backward, must be in a typo. Same issue in the magazine edition as well. Should be 1 Cup sweet rice, 3 tbsp Black Glutinous rice. AnonymousChicago4/21/2020This looks great! Looking at the photo and magazine article, it seems like there is more sweet rice than black rice. Should the recipe call for 1 cup of sweet rice and 3 tbps. of black rice?Las Vegas Nevada 4/21/2020This looks great! Can’t wait to make it. But looking at the photo, it seems there is more sweet rice than black rice. Is the ratio of black rice to sweet rice that the recipe calls for correct? It seems like the recipe should call for 1 cup sweet rice and 3 Tbps. of black rice....AnonymousLas Vegas Nevada 4/21/2020Explore Bon AppétitAsianRiceRice & GrainsEasySideVeganVegetarianGluten-FreeDairy-FreeNut-FreeSteamLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Yia Vang"]}