{"id": "6c642b7ade91ebc40ab000965386d038", "url": "https://www.bonappetit.com/story/never-fail-ham-and-cheese-waffles", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "These Ham and Cheese Waffles Wake Me Up Inside (Yes, Like the Song) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Ham and Cheese Waffles Wake Me Up Inside (Yes, Like the Song)They saaaaaave me.By Alyse WhitneyApril 27, 2018FacebookTwitterEmailRomulo YanesFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the ham and cheese waffles recipe that associate web editor Alyse Whitney just couldn't live without.Hello! Please hit play on Evanesence's song “Bring Me to Life” while reading this story for full effect.Okay, now that you are rocking out to this 2003 GRAMMY-AWARD-WINNING hit song, you’ll understand the references to my favorite Bon Appétit throwback brunch recipe: ham and cheese waffles. These waffles wake me up inside when I can’t wake up on a Saturday morning. They saaaave me from the nothing I’ve become after a long work week. When it feels like I’ve been sleeping a thousand years, they open my eyes to everything.That was a fun use of song lyrics, but I need you to take me seriously when I say this is one of the best breakfasts, brunches, or brinners I’ve ever made. The exterior is extra crispy from melted cheddar cheese, and the inside is fluffy and airy. It's like eating a breakfast sandwich in waffle form! If you put a fried egg on it, it’s Croque-Madame-ish...without the fussy béchamel. The recipe uses three bowls, which is an unfortunate amount of dishes, but it's worth it. One is used to whip egg whites—I use my trusted KitchenAid hand mixer so I don’t sprain my wrist from whisking forever—another is for mixing wet ingredients, and the last is for combining dry ingredients. The secret ingredient is soda water, which helps the batter rise, but I’ve made them with regular water in a pinch and they turned out okay. What you shouldn’t skimp on is the aggressive-seeming amount of melted butter. The two sticks are divided amongst 12 servings, so trust in the recipe—that works out to about a half tablespoon of butter per waffle. The calculations on the recipe are for two small square waffles per person, but with my standard circular Belgian-style waffle maker, I can do at least eight. (For what it's worth, I am coveting the “Cadillac of waffle makers,” an All-Clad square version.)Buy me a fancy waffle maker and I will love you forever.\nPhoto by Alex LauThere’s one other little trick to making perfect ham and cheese waffles: sprinkling the ham and shredded cheddar over each waffle rather than mixing it into the bowl of batter. (Highly recommend Cabot Seriously Sharp for your cheese!) The first time I made them, I didn’t follow this step and had unevenly dispersed pockets of ham and cheese—some waffles without any fillings in an entire quadrant of the waffle! For shame! Having the cheese making contact with the waffle iron makes it like a cheddar frico around the edges, aka the breakfast grilled cheese of your dreams. Just make sure to butter or oil your waffle iron so it doesn’t stick.I have one little secret though: Sometimes I use store-bought waffle mix when I’m lazy and/or drank too much the night before but still need to satisfy the craving. I doctor up boxed mix—I grew up in a Hungry Jack family, so usually that—with an egg, a few tablespoons of melted butter, and a smattering of scallions or chives (those go on regardless of if it’s boxed or homemade waffle mix). With all the flavor from the ham and cheese, I can barely tell the difference, and neither can my friends and family. Everyone I’ve made this for has asked for the recipe midway through their first few bites. A little more butter and syrup on top brings a sweet and salty hit that will wake you up inside, enough to dance to a throwback playlist of 2003 emo songs. I suggest listening to Fall Out Boy's \"Saturday\" next, because with ham and cheese waffles, these open doors are indeed open-ended. This is your new Saturday routine.Get the recipe:Ham-and-Cheese WafflesView RecipeExplore Bon AppétitBreakfastBrunchHamCheeseCheddarBasicallyNever FailWaffleWeekend BrunchRead Morerecipes109 Brunch Recipes Because Leisurely Mornings Are the Best MorningsGallery100 SlidesBy Bon AppétitcookingThis Is the Cadillac of Waffle MakersBy Ashley MasoncultureThis Tater Tot Waffle Is a Work of ArtBy Alex DelanyrecipesThe Essential Waffle CollectionGallery12 SlidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-27", "author": ["Condé Nast", "Alyse Whitney"]}