{"id": "6c778c25051323b791349401a76f26f4", "url": "https://www.bonappetit.com/story/healthyish-cookbook-talk", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "A Q+A with Lindsay Maitland Hunt, Author of the 'Healthyish' Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Didn't Write the 'Healthyish' Cookbook, But We Kinda Wish We DidWe talked with the actual writer, Lindsay Maitland Hunt, about all things healthyish... cookies included!By Aliza AbarbanelJanuary 18, 2018FacebookTwitterEmailPhoto by Linda Pugliese.FacebookTwitterEmailThe Feel Good Food Plan still has us riding high on healthyish vibes, and we're not the only ones. This month, one of our favorite recipe developers and Instagrammers Lindsay Maitland Hunt writes about the joy of cooking satisfying, real foods in a book with a name we can get behind:  Healthyish: A Cookbook with Seriously Satisfying, Truly Simple, Good-For-You (but not too Good-For-You) Recipes for Real Life. (No, we're not involved, but, yes, we would LOVE to write a cookbook of our own someday.) We called up Maitland Hunt to chat about the many meanings of \"healthyish,\" modern meat eating, and an extra special, single-serving peanut butter cookie that's poised to rival the most Instagrammed cookie of all time.First, I think we need to talk about the name. What drew you to \"healthyish\"?Flash back to September 2015, I decided to write a book. Like any book, I started out asking, 'What is the way that I cook?' I have a background coming from Real Simple,  I also at the time was working at Buzzfeed. I freelanced everywhere, Food Network, Country Living, Refinery 29, but my style came down to uncomplicated recipes. It’s funny, I said simple a lot, but just because it’s uncomplicated doesn’t mean it’s not complex, which is something Healthyish [this website] and I have in common. This is exactly how I cook. I am always trying to eat better, to try and get more grains in my diet and vegetables, and that word was just a natural catch-all.What's the difference between recipes for \"real life\" and recipes you make once and never touch again?I feel like there are cookbooks that you open and there’s so much that inspires you but that ends up feel daunting. Of course, I’m a professional cook, but sometimes I open a cookbook that I love and I’m like, I can’t actually spend the whole weekend babysitting a yeasted loaf. I have stuff going on. The main aspects of Healthyish are: better for you, not too restrictive, and not over the top. Maybe you’re exhausted at the end of a long day and you don’t necessarily have that much time to cook—or maybe you do have time but you don’t want to do a lot of dishes. Those were all things I had in mind and even when I was developing recipes. If something felt too complicated, I just cut it. The point is that some days you have it in you to make a seeded whole wheat banana loaf for the week but some days it’s just everything you can do to get to work on time. The recipes run the gamut.The Healthyish cookbook\nThe book has a lot of guidelines, the basic elements of a smoothie or grain bowl. Is that another way of teaching people how to adapt recipes for their daily life?Yes! I remember starting out as a recipe developer and even when I was testing recipes in the beginning of my career, we’d get online comments like “loved the soup but I used vegetable stock instead of chicken stock, I don’t eat salt so I didn’t use that and I don’t like cinnamon so I didn’t do this.\" I think I fought against that for a long period of time—I know, I’m the recipe developer!— and then I decided instead, why don’t I get along and encourage people to make their recipes their own? That’s the point, right? The next step would be making people feel like they can cook dinner out of their refrigerator without a recipe.Tell me about some of your stand-out recipes in the book. I was very intrigued by the single-serving peanut butter cookie.That cookie is doing its work! It’s so funny. I love that cookie, I completely OD-ed on it when I was developing it because I had to make iteration after iteration to get it totally right. It's one serving, so you don't really have a lot of wiggle room. I would say the loaded baked potato and cauliflower soup is also a favorite, and the one-pot spicy and creamy chicken pasta. Another favorite would be the seeded whole wheat banana bread, and the truly delicious energy bites. I think that came out of me wanting to find answers to something else ended up being my favorites because it was like solving a problem, which I love.What was the problem you were solving with the banana bread?I know that everyone has an opinion about banana bread. I love banana bread, it probably was the first thing I ever baked other than chocolate chip cookies, but I don’t like when you touch banana bread and your hands are all oily because it’s just so dense and high in fat. This recipe was about still getting a really intense banana flavor but having it feel more like a bread than a cake. It has a ton of seeds in it and, especially if I am going to eat something baked, I do like to have it be whole grain or have seeds, because happy digestion equals happy life.I see that you often use smaller serving sizes of meat. What’s the goal there?There's a version of this book that probably could have been entirely vegetarian but again, these are recipes for real life and the reality is many people still are eating meat. My hope is to say, of course you can eat the meat, but I’m going to bring up buying it from the right sources and try to get to smaller portion sizes. At the end of the day, I explain “healthyish” as a gateway to a different type of eating, whatever that may be for you: trying to be vegetarian or vegan, or making better purchasing choices. It’s not like you can’t have steak, but not only is it better for the planet to have less meat, but it’s cheaper, frankly.I noticed the special diets index in the back of the book. What does it mean to write a “Healthyish” cookbook in a time when so many people do have individualized diets?First of all, thank you for noticing the special diets index, because I am really excited about that section. Everyone can be healthyish, that’s the bottom line. One of the things that’s so strange about the age of the internet and hits and metrics and success all being tied to eyeballs on a page is that it’s siloed these “different ways of living” to act as though there’s not one straight-up common denominator. The reality is, thinking back encouraging people to be flexible cooks, I think that if you’re making a lifestyle change you can still use these recipes. That’s what I want people to feel, that there is something for everyone. Even if you go down to being vegan and gluten free, there’s something like 30-40 recipes in the book that still hit both of those.You have this really engaged audience on Instagram—and now this book. What are your thoughts on how people are looking to cook and eat right now?That’s a really interesting question. I wonder if you guys have encountered this too, but so much of the response I get is ‘Oh my god, this is the way I eat.’All the time!It’s so funny because this is not something brand new. The idea of moderation and balance has been around for so long; I think it’s a return from extremes. We’ve compared it to the new farm-to-table—it’s hard to point to where it comes from, it just was where the tide was flowing. I make it easy for people, and I think they appreciate it because, like we talked about, everyone feels time-strapped, money-strapped, maybe overwhelmed by the kitchen. For me, and I think for you guys too, healthy is the middle 65% of how we eat, and how I think most people eat. We all have more restrictive times, we all have more indulgent times, and I think this book is the story of eating day-to-day.Buy Healthyish: A Cookbook with Seriously Satisfying, Truly Simple, Good-For-You (but not too Good-For-You) Recipes for Real LifeMake some extra seedy banana bread:Seeded Whole-Wheat Banana BreadFor when you want a slice that tips to the side of mostly wholesome. View RecipeExplore Bon AppétitHealthyishBooksInterviewsRead MoreLifestyleGwyneth Paltrow's Former Chef Swears by These SuperfoodsBy Amber RoseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Aliza Abarbanel"]}