{"id": "6c7d046f6a008d132ff32d4e221d0a56", "url": "https://www.bonappetit.com/recipe/banh-xeo-vietnamese-crepes", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Banh Xeo (Vietnamese Crepes) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueShrimp and Sugar Snap Pea Bánh Xèo (Vietnamese Sizzling Rice Crepes)By Andrea NguyenSeptember 2, 20214.5(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Molly BazEmailPinterestPrintEmailPinterestPrintSizzling rice crepes, called bánh xèo (“baan say-ow”) are a southern Vietnamese favorite. Made from rice batter tinted yellow by turmeric, the crepes typically contain pork, shrimp, straw mushrooms, and bean sprouts, which offer a refreshing crunch. Eaten fresh from the sizzling pan, they’re snipped with scissors, wrapped up in lettuce leaves, and plunged into nước chấm (“nook chum”) a dip made with fish sauce, chiles, lime, garlic, and sugar.After eating at a spot in Ho Chi Minh City that offered more than a dozen variations on the crepe, cookbook author Andrea Ngyuen got creative with her filling in this bánh xèo recipe. Feel free to play around with the mix-ins: Sub half of the sugar snap peas with thickly sliced crimini, shiitake, or oyster mushrooms (use 2–3 medium ones with stems). She also tweaked the batter so it’s easily made from standard grocery store ingredients. Make sure to seek out coarser stone-ground white rice flour (not finely ground Thai rice flour), which will yield the appropriate batter consistency.The technique for forming the crepes can take some practice, but as Nguyen points out: “Making these crepes is akin to making pancakes: adjust as you go. Also be patient.” She offers more helpful tips in her complete guide.Bánh xèo and its accompaniments can be served as a complete meal, but if you like to balance the richness with a salad, try this one with tomatoes, fish sauce, and peanuts from New York’s celebrated pop-up Ha’s Dac Biet.Editor’s note: This recipe was originally published on May 25, 2020.IngredientsMakes 6Batter¾cup plus 1 Tbsp. (120 g) stone-ground white rice flour (such as Bob’s Red Mill)1Tbsp. cornstarch½tsp. kosher salt¼tsp. (heaping) ground turmeric⅓cup unsweetened coconut milkDipping Sauce1–2serrano chiles, thinly sliced1garlic clove, finely chopped3Tbsp. (or more) fish sauce3Tbsp. (or more) fresh lime juice2Tbsp. (or more) sugar or 3 Tbsp. pure maple syrupCrepes and Assembly1lb. large or extra-large shrimp, peeled, deveined, halved crosswise¼medium head of red cabbage, core removed, thinly sliced1small yellow or red onion, thinly sliced8oz. sugar snap peas, strings removed, trimmed8–10Tbsp. vegetable oil, dividedKosher salt1large head of tender lettuce (such as butter or red or green leaf), leaves separated1large handful mint or basil leaves1large handful cilantro leaves with tender stemsPreparationBatterStep 1Whisk rice flour, cornstarch, salt, and turmeric in a medium bowl to combine. Whisk in 1½ cups of the hottest water from your tap (aim for about 120°) followed by coconut milk. Let batter sit, uncovered, until thickened to the consistency of half-and-half (it will be slightly gritty from the flour), 30–45 minutes. If batter is too thick, whisk in about 1 Tbsp. water to get it to the right consistency.Step 2Do ahead: Batter can be made 2 days ahead. Cover and chill. Bring to room temperature and whisk well before using.Dipping sauceStep 3Whisk chiles (use 1 or 2 depending on how hot your chiles are and your own preference for heat), garlic, fish sauce, lime juice, sugar, and ½ cup warm water in a small bowl until sugar is dissolved. Taste and add more fish sauce, lime juice, and/or sugar as needed until sauce tastes balanced—not bitter or too tart.Step 4Do ahead: Sauce can be made 8 hours ahead. Store tightly covered at room temperature.Crepes and assemblyStep 5Place shrimp, cabbage, onion, and sugar snap peas in individual bowls and set near stovetop along with oil, some salt, and batter.Step 6Arrange lettuce and herbs on 1–2 plates. Divide sauce among a few small bowls for dipping. Set aside for serving.Step 7Preheat oven to warm. Set a wire rack inside a rimmed baking sheet; set aside. Heat 1 Tbsp. oil in a medium nonstick or cast-iron skillet over medium-high until very hot and shimmering. Add a small handful of shrimp, onion, and sugar snap peas to skillet (you’re going to make 6 crepes total, so eyeball it accordingly); season with salt. Cook, stirring once or twice, until shrimp are mostly opaque, about 30 seconds. Separate mixture to create 2 semicircles on each side of pan (this makes folding the finished crepe easier!).Step 8Stir batter vigorously with a ladle until there is no drag or sludge. Measure out ⅓ cup batter and pour into pan, distributing around filling. Carefully swirl skillet so batter coats the bottom without disturbing the filling; batter should set around filling and form a round. It will sizzle and sputter! If needed, quickly add more batter to fill in empty spots.Step 9Pile one sixth of cabbage on 1 side of pan, reduce heat slightly, and cover with a lid. Cook until softened slightly, about 1 minute. Uncover and drizzle 1–2 tsp. more oil around the crepe’s rim to encourage crisping. Reduce heat and cook until golden brown around the edges (they should lift off the pan a bit) and entire crepe is mostly crisp, about 3 minutes longer.Step 10Slide a spatula under one side and fold crepe over (no big deal if it breaks in the center). Slide finished crepe onto prepared rack and place in oven to keep warm while you make the remaining crepes. Pro tip: If the batter didn’t sizzle and bubble upon contact, the skillet isn’t hot enough. If it did bubble but was hard to swirl around, reduce the heat or thin out the batter with water, or do both. Making these crepes is akin to making pancakes: adjust as you go. Also be patient.Step 11Stir batter vigorously again and repeat process to make 5 more crepes. If at any time the batter feels too thick, add water by the teaspoonful to thin out. And if you have 2 medium skillets, use both to speed things up. Crepes are best eaten soon after frying.Step 12Serve crepes with lettuce and herbs and dipping sauce alongside. Use kitchen scissors to cut crepes into manageable pieces at the table. To eat, place a piece of crepe on a lettuce leaf (tear it to roughly the size of your palm if needed), then top with some herbs. Fold into a bundle, dip into sauce, and enjoy.How would you rate Shrimp and Sugar Snap Pea Bánh Xèo (Vietnamese Sizzling Rice Crepes)?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis was the most fun thing I have made in a really long time. Yes, it's lots of ingredients and steps, but if you have the time, it's so worth it. I followed the recipe pretty closely and it was absolutely delicious. I added a bit more oil when frying the crepes to get max browning and crunch. Don't be intimidated - make these! SashaJersey City, NJ1/18/2022I am generally an Andrea Nguyen fan, but this recipe really missed the mark for me. The texture was off putting and the crepe itself lacked flavor. I think we will stick with spring rolls next time.Mandy ShueLos Angeles, CA1/5/2022Oh my goddess!!!  Are you kidding me right now?  What is this heaven in my mouth and why is my husband asking me to marry him again?  How have I never tasted this before!  A-maz-ing.  I followed the directions exactly and included all the options: mint, basil, and sliced shiitakes.  This recipe is now one of the stars of our home rotation.  I'm trying ALL of Andrea Nguyen's recipes.  Thanks NYT!ShannonThe Wilds of Colorado1/6/2021This were insanely delicious, I just poured the crepe batter first and then added the fillings before folding it over and it worked fine. I want to put the dipping sauce on everything.\n\nI did have to add quite a bit of extra rice flour to get to \"half and half\" consistently so maybe add the water gradually to see how much you need. I also cannot imagine doing this in even the most well-seasoned cast iron pan, seems like it would glue itself to the surface. Just use nonstickSan Francisco9/10/2020I've had an abundance of sugar snap peas growing in my garden so I was looking for recipes to use them and stumbled across this dish. I had never actually had Bánh Xèo but wanted to give it a try. I had all the ingredients on hand except for the cornstarch. I had Xanthan Gum and used that because after not enough research on google I saw that it could be used as a substitute. I would not recommend this substitute. No matter how much I stirred and added water, the batter was gelatinous. I decided to continue on anyway. I had to really smear/stretch the batter in the pan with the back of a wooden spoon to get it to become thin, but it crisped up nicely and held the filling really well. I love the textures in this dish. My crepe was crispy in most places and some areas were softer, which I didn't mind. The cabbage, peas, and onions added great texture as well. The sauce took me back to my time in Southeast Asia. It was so simple to put together and really brightens the dish. I used Bibb Lettuce and it was perfect for holding the crepe and sauce. I omitted the shrimp because I wasn't really feeling it and I used lots and lots of fresh cilantro. I will absolutely make this dish again with cornstarch and not xanthan gum. Thanks for the awesome recipe!AnonymousIndianapolis, IN.6/30/2020This is so delicious!  I added some matchsticks of shiitakes, and otherwise kept the recipe the same.  I’ve cooked it twice already and I’m beginning to get the hang of getting them crispy.  It takes patience!  Also, the brand of coconut milk also seems to make a big difference.  This time, I used Thai Kitchen, which is much creamier than whatever I used last time.AnonymousNYC6/19/2020Didn't have cabbage so skipped that step and just cooked the crepes uncovered. They were still fantastic and crispy, although I see how the cabbage would add another layer of texture, which is what makes these so fun to eat. Ate them all standing over the sink and it was the perfect hot-summer meal because the crepes cook so quickly.christinachaeyBrooklyn, NY6/3/2020Explore Bon AppétitAsianSoutheast AsianVietnameseRice FlourFlourShrimpShellfishSeafoodSugar Snap PeaPeaVegetableSpringMainGluten-FreeDairy-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-25", "author": ["Condé Nast", "Andrea Nguyen"]}