{"id": "6c88db28a1030e01369c66d99cd1bc50", "url": "https://www.bonappetit.com/story/where-we-go-from-here", "year": 2020.0, "month": 6.0, "day": 2.0, "content": "A Long-Overdue Apology, and Where We Go From Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Long-Overdue Apology, and Where We Go From HereBy The Bon Appétit and Epicurious StaffsJune 10, 2020FacebookTwitterEmailFacebookTwitterEmailWe, the staffs of Bon Appétit and Epicurious, want to address our readers, contributors, and peers in light of Adam Rapoport’s resignation as editor in chief. The deeply offensive photo circulating of Adam is horrific on its own, but also speaks to the much broader and longstanding impact of racism at these brands.We have been complicit with a culture we don’t agree with and are committed to change. Our mastheads have been far too white for far too long. As a result, the recipes, stories, and people we’ve highlighted have too often come from a white-centric viewpoint. At times we have treated non-white stories as “not newsworthy” or “trendy.” Other times we have appropriated, co-opted, and Columbused them. While we’ve hired more people of color, we have continued to tokenize many BIPOC staffers and contributors in our videos and on our pages. Many new BIPOC hires have been in entry-level positions with little power, and we will be looking to accelerate their career advancement and pay. Black staffers have been saddled with contributing racial education to our staffs and appearing in editorial and promotional photo shoots to make our brands seem more diverse. We haven’t properly learned from or taken ownership of our mistakes. But things are going to change.We have been seriously discussing what change can look like at BA and Epi and what we need to do to make it an inclusive, just, and equitable place. To start, that means prioritizing people of color for the editor in chief candidate pool, implementing anti-racism training for our staff, and resolving any pay inequities that are found across all departments. It means dismantling the toxic, top-down culture that has hurt many members of our staff both past and present and supporting Condé Nast’s internal investigation to hold individual offenders accountable.Furthermore, it is our editorial mission to better acknowledge, honor, and amplify BIPOC voices. We will seek and hire more freelancers of color across all platforms and invest in those relationships for the long run. Our coverage will center, rather than patronize, the contributions of marginalized people. We will do the work of building trust with our BIPOC contributors and launch multiple columns written by BIPOC on print and digital platforms. We will overhaul our recipe development process to address issues of ownership and appropriation. We will audit previously published articles and recipes to ensure proper crediting and contextualization. We will also create research protocols to vet the subjects of our coverage; there will be zero tolerance for racism, sexism, homophobia, or harassment in any form.This is just the start. We want to be transparent, accountable, and active as we begin to dismantle racism at our brands.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-10", "author": ["Condé Nast", "The Bon Appétit", "Epicurious Staffs"]}