{"id": "6c8c245c0838c75973c3b02f30574d9f", "url": "https://www.bonappetit.com/story/never-fail-peanut-butter-blondie-recipe", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Blondie Recipe Converted a Raving Brownie Devotee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Peanut Butter Blondie Recipe Converted a Brownie DevoteeI had always been in Camp Brownie. But these peanut butter blondies are the truth.By Emma WartzmanSeptember 28, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I used to be naive. I used to think that no blondie recipe could ever hold a candle to a brownie, full stop. It’s not that I would refuse a blondie if someone handed me one (I’m not a monster), but if I ever felt like making a dessert in bar form, it would be brownies every time.That is, until I met this particular blondie recipe, which involves a ton of peanut butter and is therefore obviously superior, especially with the addition of chocolate chips. (Okay, those are not in the recipe, but I swapped them in for the roasted peanuts because everyone knows that peanut butter and chocolate go together like rainy days and sweatpants.)This blondie recipe calls for no fancy tools or equipment or ingredients, and is so simple that even a novice baker should have no problem putting it together. Here's how it goes. After buttering and flouring a baking dish, I melted some butter on the stove and then let it cool. While the butter was melting, I whisked together my dry ingredients—flour, baking powder, and salt. That happened so quickly that I still had some time to kill before the butter got to room temperature, so I went ahead and prepped my wet ingredients, measuring out eggs, vanilla, peanut butter, and brown sugar. When the butter was cool enough to work with—you don’t want it to be too hot or it will cook the eggs—I added the wet ingredients straight into the pan with the butter and whisked my heart out, followed by the dry ingredients, more whisking, and then those chocolate chips.That peanut butter is mouth-watering just to look at.\nPhoto by Alex LauAt this point, I poured the batter into my prepared pan, using a spatula to smooth things out. But that's not all! Claire Saffitz, who developed the recipe and is a genius when it comes to all things sweet, adds one extra step that ensures ultimate gooeyness. A combination of more melted butter, more peanut butter, and more sugar get poured over the top, which half combines with the batter to create a soft, peanut buttery layer in the finished blondies. It’s an extra step, but one that is fully worth it.If you make these at home, a scoop of vanilla ice cream over the top is enough to make them dinner party-worthy. But I packed mine up in a container and brought some over to a friend’s apartment, and then brought the remainder to work the next day, and got rave reviews pretty much as soon as I opened the Tupperware. I don’t think anyone missed the ice cream.Get the recipe:Peanut Butter BlondiesOoey, gooey, peanut butter-y perfection.View RecipeExplore Bon AppétitPeanut ButterDessertBasicallyNever FailRead MorecookingThis Easy Sheet Cake Recipe Doesn't Seem Like It Should Work, but It's IncredibleBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Emma Wartzman"]}