{"id": "6c99f21f8fe99b90a1a7e60fe3ccaff1", "url": "https://www.bonappetit.com/story/hybrid-grapes", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "You’ve Never Heard of Hybrid Grapes, And They’re Everything You Want to Be Drinking Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou’ve Never Heard of Hybrid Grapes, And They’re Everything You Want to Be Drinking Right NowIt’s about time the industry’s much maligned crossbred species get its due.By Marissa A. RossDecember 12, 2018FacebookTwitterEmailPhoto by Marissa RossFacebookTwitterEmailPark the Prius because today’s hottest hybrids aren’t for driving. They’re for drinking. After a week spent neck-deep in hybrid grapes during a recent trip to Vermont, I’m now convinced that these long-ignored fruits are responsible for some of the most exciting wines in America, if not the world.I’m talking bottles of La Crescent that crackled with the acidity of a dozen grapefruits and sang like Annette Funicello’s “Pineapple Princess”—the grape should have the world’s best Rieslings shaking in their boots. I tried Frontenac Noirs that gave me goose bumps, tasting like spiced cranberries rolled up and smoked in violets, and Marquettes that left my insides as fuzzy as my favorite sweater. Discovering these unsung grapes—add Baco Noir and St. Croix to that list too—inspired the same feeling as coming across a new wine region: exciting to explore and delightful to drink. Get yourself a bottle from Barnard, Vermont, winemaker La Garagista and you’ll see.But wait. If they’re so damn good, why haven’t you heard of them until now? Well, that’s because hybrid grapes are the black sheep of the vine. Disparaged. Maligned. Tied up and gagged in the basement. The industry at-large would rather you didn’t know about them. And that’s exactly why I’m here to proselytize for them, champion them, and declare that we should all be drinking a whole lot more of them.But first, how they—and their unfair reputation—came to be.In the late 19th century, phylloxera, an insect that attacks grapevine roots, destroyed most of Vitis vinifera—the OG winemaking grape species—in a very black plague–like fashion. But no one wanted to stop drinking wine, so in the early 20th century, humans did what they always do and found a way to keep producing it: by crossing two or more different grape species (typically Vitis vinifera and Vitis labrusca, in case you, you know, care) to create hybrid grapes.The genetic diversification made the plants not only more resistant to phylloxera, but also more impervious to fungal diseases (like powder mold) and more tolerant of cold climates. When they debuted in the early 1900s, they were a hit across the chilly climes of New England and the Midwest. Europe, on the other hand, used them for like a minute before deciding hybrids weren’t bougie enough. France even went so far as to ban hybrid grapes for commercial wines in 1934, and in 1955 the country made it illegal to sell wines made with them. Austria allows the use of hybrid grapes today, but they’re relegated to the lowest ranking appellation classification.TL;DR: Hybrid grapes are the mutts of the wine world, and for decades the wine industry has basically been the American Kennel Club, shunning them and the wines they produce for not being purebred. Their critics claim the fruits do not demonstrate the depth or subtleties of Vitis vinifera and that their wines are “foxy”—and not in the 1970s funk kind of way. In wine jargon, foxy describes juice that smells and/or tastes like musky Welch’s grape juice, which is not a good vibe. (Vitis labrusca is also known as the fox grape, which gives you an idea of where the disdainful descriptor came from.)And yes, while I was out there in Vermont, I did run into Brianna—a polarizing hybrid grape that probably incited the whole species’ negative reputation in the first place: Brianna can be “foxy” as hell. But out of the dozens of wines I tried in five days, I had only one bottle of Brianna that was truly gross. To me that says, “Hey, maybe we shouldn’t discriminate against an entire genre of wines that are perfectly delicious and disease resistant because of a few bad Briannas.” We all had a few bad Briannas our graduating year of high school; that doesn’t mean our entire class was worthless!Here’s the thing: Today’s wine drinkers forego the “rules” of the old guard. We embrace experimentation, and we’re not afraid of grapes we’ve never heard of. We actively seek out new experiences in bottles of wine, and we want everything that hybrid wines represent. So, it’s up to us to spread the word and give these wines a seat at the table. Let’s start looking for them, asking for them, and purchasing them. There is no supply without demand.Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Marissa A. Ross"]}