{"id": "6c9a02cfdfeb8366129821edeab7e56b", "url": "https://www.bonappetit.com/story/french-onion-beef-noodle-soup", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "French Onion…Beef Noodle Soup? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFrench Onion…Beef Noodle Soup?There’s a special satisfaction in taking the star ingredient of a dish you could take or leave and shoehorning it into one you already adore with a passion.By Amiel StanekMarch 5, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by Yekaterina BoystovaFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.It’s a thing that happens to me every so often: Unrelated food words pop into my head and just kind of stick there. I don’t always know what to do with these free-associative portmanteaus. Sometimes I can just ignore them and they evanesce back into the ether. Sometimes they make immediate sense and just need to be cooked into reality, as was the case with Pretzel Focaccia. And sometimes they linger for months or even years without ever making total sense—until one day, suddenly, they do. Which is exactly what happened with French Onion Beef Noodle Soup.Two distinct experiences on the same chilly day a few months back connected the dots. First, some friends and I took a drive up to Albany, where we ate rich, steaming bowls of Taiwanese-style beef noodle soup at the aptly named Taiwan Noodle. To me, this category of noodle soups represents Peak Soup, as good as it gets: A clear, complex broth loaded with aromatics; chewy, slurpable noodles; chunks of tender meat, and a bit of veg for textural contrast. I could eat soups like these every day and never get tired of them.Later that same afternoon, I found myself at a pretty unremarkable new bar with those same friends, not hungry at all but studying the menu nonetheless. Nestled in among the pub grub offerings was French onion soup. I’ve never really understood why people are so gaga for French onion soup. Don’t get me wrong: I admire the simple grandeur of a soup in which piles of sweet, slow-simmered onions provide the lion’s share of the flavor. But it’s always seemed like a weird thing to eat as an appetizer. Crowned with too much melted cheese (also not my thing, but a story for another time), it simultaneously feels too filling to begin a meal and not nourishing enough to be one itself. Why does all that gloppy cheese have to get in the way of those sweet, silky onions? I thought to myself. Why can’t it just revel in its own glorious broth, like the beef noodle soup I enjoyed earlier?French Onion...Beef Noodle Soup!The whole thing came together a few days later. I started by making a pared-down version of a broth for Taiwanese beef noodle soup, simmering hunks of short rib with scallion whites, ginger, garlic, and soy sauce along with a host of bright spices until the meat was just yielding and the liquid was incredibly savory. While that was cooking, I sizzled a Dutch oven full of sliced onions until I was left with a puddle of golden allium goodness. (Needless to say, my whole house smelled amazing.) Then I married the contents of the two pots to create a rich, beefy, sweet-salty soup base that tasted every bit of the mashup name that inspired it. All that was left to do was cook some fresh ramen noodles (though I’ve since also made it with the dried version, and even spaghetti in a pinch), divide them amongst wide, deep bowls, and ladle that brothy goodness over the top. A few slivered scallions to finish, and the deal was sealed.As we slurped and sipped, I couldn’t help feeling like I was getting away with something, having my cake and eating it too: taking my favorite part of a dish I could take or leave and shoehorning it into one I adore with a passion. The fact that this unexpected portmanteau also managed to fill our bellies, and produce enough leftovers to feed us for many chilly nights to come, made it all the more enjoyable. And that carries its own special kind of satisfaction.Get the recipe:French Onion Beef Noodle SoupThis super-savory dish draws inspiration from Taiwanese beef noodle soup, then gilds the lily with a Dutch oven’s worth of sweet, slow-simmered onions.View RecipeExplore Bon AppétitSoupNot So FastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-05", "author": ["Condé Nast", "Amiel Stanek"]}