{"id": "6ca3a4e257af47613d2c79cc08058cf0", "url": "https://www.bonappetit.com/recipe/french-ish-onion-soup", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "French Onion Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrench-ish Onion SoupBy Chris MoroccoFebruary 21, 20193.5(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintOnions, garlic, oil, wine, and salt are all it takes to make a rich vegan broth that still evokes the classic version. And we just couldn’t resist toasting some sharp cheese on bread to drop into the bowls.Ingredients4 servings2lb. onions (7–8 small ones), very thinly sliced3Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt6garlic cloves, sliced½cup dry white wine4thick slices sourdough bread2oz. sharp cheddar cheese, shreddedSliced chives and finely ground black pepper (for serving)PreparationStep 1Toss onion and 3 Tbsp. oil in a large heavy pot to coat; season with salt. Cook over medium heat, stirring and scraping bottom of pot frequently, until onion softens, about 10 minutes. Reduce heat to low and add garlic. Cook, stirring and scraping pot’s surface occasionally, until onions are the color of browned butter (don’t worry if they stick in places; a few drops of water and a wooden spoon will release any sticky bits), 20–30 minutes longer. Add wine and cook, stirring and scraping up any browned bits, until wine is evaporated, about 3 minutes. Add 6 cups water and bring to a simmer. Season with salt and continue to simmer until flavors meld and soup tastes rich, 10–15 minutes.Step 2Meanwhile, preheat oven to 450°. Place bread on a rimmed baking sheet and drizzle with oil. Toast until lightly charred around the edges, about 10 minutes. Top with cheese and continue to toast until cheese is melted, about 5 minutes.Step 3Divide soup among bowls. Place cheesy toast on top. Sprinkle with chives and season with pepper.How would you rate French-ish Onion Soup?Leave a ReviewTell us what you thinkReviews (36)Back to TopTriangleI didn’t make this recipe but 6 cups of water appears to be way too much. To speed up the caramelizing you can add salt and cover for 5minutes on medium-low heat. The onions sweat —then remove the cover and continue to sauté till brown. Deglaze with the wine and then I would only add 3 cups of water first. To give the soup a little body you can remove some  of the onions and water and purée them with a hand blender. Then add it back into the pot and adjust the seasoning and water as desired. \nWhen I make soup I use the hand blender method to purée some of the veggies to thicken the soup without having to add flour or other thickening ingredients. It works like a charm. Soupergirl San Jose CA 11/11/2021Vegan Broth is such a bad idea for french onion soup.It is almost an insult to this creation. We have to admit that some plates are just not meant to go vegan.....JohnHallandale, Fl. 5/27/2021I think these reviews are unfairly negative. I will say that I chose to save my onion and garlic skins and make  \"broth\" instead of plain water using my scraps, instead of throwing that flavor away. It adds a rich allium flavor and deep color to the water. I used more like 4-5 cups liquid, not 6. I agree that caramelizing the onions took way longer than the prescribed 20 minutes. It took me more like an hour and a half to get my onions a nice dark brown color, but I chatted away on the phone while doing it so I didn't mind. I was also probably on a lower heat than necessary because I was worried about getting crunchy onions which I didn't want in my soup. I added no extra ingredients and mine came out rich and delicious because time = flavor. Give this recipe a chance if you are just using what you have on hand to make a nice warming soup, instead of running to the store for special ingredients!AnonymousColorado4/17/2021This is just awful, shame on bon appetit for wasting people’s time and money. Hot onion water is right...Maddie 1/5/2021First of all, why would you use water?? Most of us know there is little to no value in water when it comes to flavor. My first thought is to use (at the very least) chicken stock. Better yet. use your leftover beef scraps and bones to make your own beef stock. If that isn't feasible, PLEASE use a good bone broth or a decent beef stock. Doing that should at least remedy part of the commenters issues.20SailorOregon1/4/2021Thank you so much community. My first attempt at French Onion Soup will be not be this recipe. No offense to Bon Appetit, every recipe I’ve attempted so far I’ve been more than happy with the results, but I do love French Onion Soup....and maybe I’d be better off👌 AnonymousTyler Texas1/1/2021If you want onion water, this is your recipe. I let the onions cook for almost 3 times as long as suggested and the soup still didn't come out to be anything more than soggy onions. AnonymousPortland, OR12/26/2020What are everyone's thoughts on making the broth a bit thicker and richer? Although I make a very good variation of this recipe, the broth comes out too watery. We recently had some French onion at a restaurant, and it was so awesome, it tasted like my soup came out of a can. I normally use a bit of flour to thicken my sauces, but I find it also takes away some of the richness.Tracey12/21/2020In the spirit of community, I too will leave a comment with the adjustments I made to this recipe.\nWe used the recommended amount of onions and garlic, but added in a dash (a loose fistful) of sugar per other French onion soup recipes.  Stuck to the half cup of wine.  Drank the rest. :) \nWe added two globs (very brief pours) of soy sauce- one in the beginning, and one later to taste.  Great recommendation, gang!\nInstead of using 6 cups of water, we used 2 cups of vegetable broth and 2 cups of chicken broth.  It was what we had in the pantry. Beef broth would have been richer, but this version turned out great!\nThe times are wack. Just use the visual indicators.  You know what caramelized onions look like.  You know what soup looks like when you want to eat it.\n\nThe mozzarella on the bread was good!\nEmily Emily TWashington, DC12/16/2020There's no way one can follow this recipe to a T as written and yield anything than onion water. I have been cooking this for three hours now (well over the allotted time frame in the recipe) and am still only working with horrible onion water. Definitely don't recommend if this is your first time working with this much onion or just .. at all. Everyone in the comments who came out with a good soup looks to have improvised extensively which is very indicative of how this recipe will go for you. It's a bummer, but this recipe is not the one.T.R.San Francisco, CA12/15/2020Not nearly enough browning time to look like the picture. I also agree that adding a spring of thyme makes it taste more like classic French onion. This recipe followed as is results in Golden onion soup, which is delicious, but definitely not the one pictured. JennyNYC11/29/2020I doubled the amount of onions, put an extra cup of water, 3 extra garlic cloves, added 2 tbsps soy sauce and a small sprig of thyme. I added the extra garlic, soy and thyme for added flavour as I had read the previous comments. It was still a light onion soup and was a bit lacklustre than I would have liked. It is very important to caramelise those onions until they are a dark brown colour otherwise you will get little flavour. \n\nIt was nicely paired with the cheesy toasts though. This combo really made it. RebeccajeanSydney, Australia6/1/2020It was a gloomy day and totally was soup kind of day. Since in quarantine I did not want to go out to the store so I was so happy to see I could make this soup from what I had at home! I halved the recipe and it was a perfect amount for 1 person. I loved this recipe as it was simple and delicious. For the broth, I used a mix of chicken and vegetable stock and reduced it down with dried oregano, bay leaves, and garlic. Yes, it does take time to cook the onions to a nice dark color but it is possible & worth the wait! I highly recommend if you want a simplified version of french onion soup.  Loved it! polinachavezCalifornia 4/10/2020This recipe was super delicious. Like others said, the onions take almost triple the time to get that burnt butter colour. My onions were on the larger side so I added an extra litre of water (4cups), a bunch of salt and a bouquet garni bag for extra flavour.  katmattMelbourne, Australia4/3/2020I really enjoyed this recipe! I did it on a meal prep day so I was able to just let it go in the background while I made everything else. I love that I don’t have to dig through cheese and bread to get the broth and onions, plus being able to dip the cheese bread was fun and tasty. I will definitely make this again!AnonymousAsheville, NC1/19/2020Explore Bon AppétitSoupSoups and StewsOnionVegetableCheddarCheeseMainStarterNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Chris Morocco"]}