{"id": "6ca90499268c97845dace32664974ba8", "url": "https://www.bonappetit.com/story/vintage-pyrex-online", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Where to Find Vintage Pyrex on the Internet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Etsy Stores for Hunting Vintage PyrexFull sets! Obscure patterns! I did the late night scrolling so you don’t have to.By Alex BeggsMarch 7, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailSure, you could track down estate sales in your area and hit up the garage sale circuit every weekend. That’s one way to collect vintage Pyrex. But then there’s the internet. Global! At your fingertips! Seems faster after midnight! Whether you’re trying to complete a set of Autumn Harvest Wheat mixing bowls passed down from your great aunt or you’re hunting for something funky and rare, I scoured Etsy for the best shops selling vintage Pyrex. (Admittedly it’s not as much fun—or cheap—as when I ran into a mom in a Michigan antique barn training her daughter to look out for specific patterns, but I discovered a few European designs that I’d never run into stateside thanks to the global reach of Etsy. Cool!) If anyone spots a Willow in the wild, let me know. Happy shopping!The Best: PyrexPotpourriOne of the most charming things about Etsy is when you remember this is a user-run online flea market and not a shiny corporate retailer. So when the photos are bad, you forgive. The photos on PyrexPotpourri are dark and at odd angles, all taken on someone’s Denton, Texas, dining room table. But this collection is vast. There are sets of Colonial Mist mixing bowls, yes, but also my favorite: refrigerator boxes with glass tops (I use them for cat treats and household miscellany). There are Pyrex coffee mugs, classic casseroles, and retro divided baking dishes I wouldn’t know what to do with—but now I kind of want. OMG Forest Fancies. Each listing has tons of photos, tons of helpful information about the pattern, the production year and locale, and wear markings. I appreciate the honesty. A small con: the shop mixes other brands in with the Pyrex, which can be confusing.The Reliable: OverTheYearsFindsWhile this collection is smaller, around 60-70 pieces, there’s a good variety and quality merch. No blurry business here. Everything is photographed straight-on, which feels like you’re having a confrontation with a casserole. Intense! I want this set of cheery Flirtation mugs. And this carafe!The Solid Standby: SnowyCreekDesignsA condensed collection of Americana Pyrex patterns in complete sets, like Gooseberry, Butterprint Amish, and Spring Blossom. This Rhode Island shop also sells a lot of vintage linens, which pop up in the Pyrex listings. Subtle! This is also where you’ll find basic solid primary color sets—not exactly the stuff people get tattooed on their bodies, but it’ll never go out of style. Also: DOTSSSS!Do you need an entire Amish Butterprint Cinderella mixing bowl set? I say yes.\nPhoto by Chelsie CraigThe Prolific: PyrexKitchenThis Massachusetts-based store has even worse photos, some are hilariously blurry, and all were apparently taken during the dead of night. However, that’s when I shop on Etsy so I’m okay with it. There are hundreds of errant mixing bowls and casseroles here if you’re replacing a one-off. It’s the junk store you need to hunt to find treasure in. I love orange spots! You know what would make a great wedding present? This sunflower set.The Prolific, Part II: VioletsEmporiumStoreIf PyrexKitchen takes their photos at midnight, Violets Emporium is using a budget boudoir backsplash for their Pyrex listings. I’m seeing red! The overwhelming, unorganized collection, based in the U.K., includes some cool British Pyrex designs like Briarwood (love!), and includes the lids in a lot of listings, which is rarer than it seems. A browser’s paradise. Ooo peaches!The Avid Collector: GoodVibesVintageShopAnother passionate Pyrex seller with nearly 100 pieces. Daisy lids make me smile.The Obscure: OnmykitchentableYou know it’s a good shop when they’ve organized their inventory to have an entire tab dedicated to vintage Pyrex. This French store takes photos in clear, natural light, albeit at odd angles and with a bunny figurine for scale. There are some obscure patterns (the lobster!!) including a lot of European designs you don’t run into in the U.S. very often (Tulipa!). The downside, obviously, is the cost of shipping internationally, and many dishes don’t come with their corresponding lids.The Real Fan: PyrexPartyPixieIn no particular order, I know that PyrexPartyPixie likes three things: Vintage Pyrex, macarons, and bread. They appear in her well-lit listings for casserole dishes—with the occasional quail egg (on theme with the impressive complete set of Fowl Play pattern!)—keeping things interesting. It’s an eclectic collection, mostly casseroles, (another lobster!) with the occasional party-ready warming stand. Ships from the U.K.For Mugs: VintageDecorAddictThis collector has a handful of nice teacup sets, like Spice of Life. And a one-off of the milk glass Honeydew Summer Impressions. You think I’m making the pattern names up at this point, but I’m not.The Far Flung: ThatRetroPieceWe’re in Australia, where Pyrex was produced by other companies, resulting in some trippy and beautiful patterns unlike what we grew up with, like Black Rose. Fun to peruse! The pastel background color blocks feel like the set of children’s show—playful! In my late night Etsy shopping cart: This poppy cake dish.The Scandi: RosieFleurThis Amsterdam-based shop typically has around 50-60 Pyrex listings (mostly European designs) at a time, all photographed beautifully. Instead of a glass here, a plate there, Rosie Fleur collects sets, so scrolling feels like shopping in a well-curated boutique. Plus there are tons of funky patterns I’d never seen before, like Arcopal Lotus, not technically Americana Pyrex but similar in material/sturdiness and fun. Love these blocky florals. Explore!Other shops to check outWildHuckleberryVtgClassicRetroGemsGenevaGraceCoPyrexPleasOtherworldVintageBarbsVintageStore DataModel====And while you’re on Etsy, don’t forget your Pyrex pattern t-shirt, Pyrex pattern posters, and Pyrex wall decals.Etsy is NOT EASY to search all the time. Do you have a BIG Pyrex collection and want me to add your store to the list? Let me know! staff.bonappetit@gmail.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingPyrexToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-05", "author": ["Condé Nast", "Alex Beggs"]}