{"id": "6cab528de7cb0584e7984a935857f844", "url": "https://www.bonappetit.com/story/ina-garten-guest-editor", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "A Letter from Our Guest Editor, Ina Garten | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Letter from Our Guest Editor, Ina GartenThe Barefoot Contessa’s No. 1 rule, and what to expect from her guest editing week on bonappetit.comBy Ina GartenOctober 29, 2018FacebookTwitterEmailPhoto by Quentin BaconFacebookTwitterEmailIf there’s one person nearly every staffer at Bon Appétit—from a twentysomething editorial assistant to our fortysomething editor-in-chief—wishes we could have on speed dial, it’s Ina Garten. In a dream world, we'd move into her East Hampton home and have roast chicken with her and Jeffrey every night. Instead, we invited the Barefoot Contessa into our house, as our first-ever guest editor. This week, she's taking over bonappetit.com to show us around her pantry, share recipes from her new cookbook Cook Like a Pro, and offer the kind of cooking advice that only Ina can. She'll be joined by celebrity fans who've penned odes to their favorite Ina recipes, and she'll cook side by side with our Test Kitchen editors. Below, hear from Ina herself on what to expect this week and the reasons why she said “yes” to us in the first place. \n Cooking is hard. I want to make it easier by teaching people the correct way to do things. If you have the right tools, like a perfectly sharpened knife, you can do anything—from slicing tomatoes to making chocolate-pecan scones—and do it calmly and with confidence.I learned to cook from reading cookbooks by Julia Child, Jacques Pepin, and The New York Times’ Craig Claiborne and Pierre Franey; now I want to pass that experience on to you at home, whether you’re a beginner or an expert in the kitchen. I’m still not expecting anyone to make demi-glace or cassoulet, which takes all day—order those in a restaurant. What I want people to understand is that they can take ordinary recipes like roasted carrots and give them a twist. Add orange juice, orange zest, and cut them in long diagonals, and you’ve got something really special.ContentThis content can also be viewed on the site it originates from.These small tweaks are my “pro tips,” which can be found in almost every recipe in Cook Like a Pro, and I’ll be sharing more during my guest-editing week at Bon Appétit.This week—and just like in my books and on my TV show—I hope to answer questions that people have about cooking at home, but may never have thought to ask: What to keep in the pantry, how to arrange food on platters for parties, and why shortcuts can make dishes easier to tackle, but just as impressive to share. Take Baked Alaska: You don’t have to make your own vanilla ice cream if someone else does it better, and Häagen-Dazs does. It takes one intimidating step out of the process.I’m a longtime reader of BA, and I think the style of cooking in the magazine is consistent with mine: great food for home cooks. And like BA’s food editors, I test recipes over and over again with my assistants Barbara and Lidey, so that you can nail it the first time you make it. And as long as you follow the instructions, and make the recipe from start to finish, the dishes will come out exactly as I made them in my kitchen.In making all 11 of my cookbooks, I’ve only had one rule: It has to be delicious and easy enough that I want to make it again—and right away. The easier a recipe is to make, the more likely that is to happen. After all, before you host a party, you just have to first please an audience of one. It's my goal to help you do that.Explore Bon AppétitIna GartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-29", "author": ["Condé Nast", "Ina Garten"]}