{"id": "6cb33790d3a25292e87198d840c1048e", "url": "https://www.bonappetit.com/story/covering-restaurants-during-a-pandemic", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "What I Learned Covering Restaurants During the Pandemic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat I Learned Covering Restaurants During the PandemicRestaurants are broken, but hospitality isn’t.By Elyse InamineSeptember 30, 2020FacebookTwitterEmailA temporary, leafy dining booth set up on a street in San Francisco, after patios opened on July 15 for the first time in three months. Photo by David Paul Morris/BloombergFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.It began with a text. “In light of coronavirus, what have you been experiencing at Mister Jiu’s in the last day/today?” I sent this to Brandon Jew, the chef and owner of Mister Jiu’s in San Francisco, on March 10 at 1:05 p.m. He replied, “Reservations and walk-ins have been down. Downtown Chinatown generally has had a lot less foot traffic in the past week.” I asked a few follow-up questions, incorporated them into our interview over text, and turned in my copy to publish the next day. It became the first entry in Restaurant Diaries, a series we launched to chronicle what was happening in the restaurant world as the virus took hold of the U.S. It went live the day the World Health Organization declared COVID-19 a global pandemic and a week before restaurants across the country were forced to close to quell its spread.Soon after, Restaurant Diaries became my life. Texts with Brandon turned into weekly hour-long phone calls, and I began interviewing more people, from farmers market managers to bakers-turned-nonprofit-directors to private chefs. By mid-April, I was editing the series, assigning entries to staff and freelancers around the world, and becoming intimately familiar with different corners of the restaurant industry and their particular struggles. As Bon Appétit’s digital restaurant editor, I was already aware of how the restaurant industry operated—the good, the bad—but this period really highlighted the “bad.” I saw longstanding wounds torn open, not only by the pandemic, but also by the racial justice movement that quickly followed. And as I read through each person’s story of triumph, anxiety, hope, despair, and determination, I learned, in raw and glaring ways, just how broken the restaurant industry is.Pre-COVID, I viewed restaurants as the crux of an ecosystem of farms, fishmongers, laundry shops, wine distributors, and more; after all, they employed 15.6 million people. Still I understood that even the most successful restaurants operated on thin, thin margins, a fact obscured by packed rooms and four-star reviews. Now, seven months into the pandemic, those margins have never been clearer, and the restaurant workers I talk to are fighting to help this interconnected and fragile industry survive.In all my years of covering restaurants, there was always a divide between the front-of-house customer-facing staff and back-of-house cooks, porters, and dishwashers who oftentimes were undocumented. But now I’ve seen this gap grow, not just over who gets tips but who has a job when businesses need to furlough, and who customers respect by wearing a mask while their tables are being cleared or served.On top of all this, saying their names—George Floyd, Breonna Taylor, Tony McDade, David McAtee, too many others—galvanized many restaurants to talk about race in ways they never have before. Earlier this summer I scrolled through a lot of black squares posted by chefs and restaurant accounts on social media. I watched how this one seemingly innocuous act pulled down the curtain for so many restaurants—like Fat Rice in Chicago. It revealed the pernicious whiteness of this industry and its ripple effects: racism, microaggressions, fear, and trauma. And it’s led me, and other editors/writers, chefs, and restaurateurs, to soberly examine our privilege, bias, and power, and attempt to talk about it.These last few months have changed the way I eat, write, and think about the industry I’ve built my career on covering. I’ve learned that, in the end, restaurants are about hospitality, both cultivated inside the restaurant and radiated outward into the community. In recent years, I’ve been obsessed with the new and trendy when it comes to restaurants, and I know I’m not alone. (Look no further than BA’s annual Best New Restaurants list.) Food media fuels this hype and restaurants survive on it, but too often it flattens them, lauding only the genius, the auteur, the chef and ignoring the rest of the furiously moving parts in the machine. In Los Angeles, the controversy around Sqirl is like a parable for contemporary restaurants, hitting on gentrification, unacknowledged labor of people of color, and the fall of the restaurant machine symbolized by a tub of jam covered in gray fuzz.Before COVID, I heard time and time again how restaurants were experiencing a golden age while also examining a toxic culture of sexual harassment and abuse. I’ve since realized we’ve finally reached a breaking point. Restaurants were going into overdrive, pushing the limits of what they could be: an empire, a social media lure, an award winner, PR-polished profile bait, a movement starter. It’s taken a virus and an industry-wide rumble of reckonings to begin to dismantle all that.The stories I’m hearing now are heart-wrenching but also kind of purifying. By loudly exposing these enduring sins, we’ve opened up an opportunity for massive change. Restaurant owners are truly caring for their communities, like Alma Cocina Latina owner Irena Stein, who is using her restaurant to feed food-insecure communities in Baltimore. They’re reevaluating hierarchies and recentering around employees, like owner Andrew Dana and chef Daniela Moreira who refused to furlough their staff at Call Your Mother Deli in Washington, D.C., and dipped into their savings instead, and chef Reem Assil, who is working toward making Reem’s, her restaurants in Oakland and San Francisco, a co-op to give her employees more agency and buy-in. This time has encouraged restaurant workers to speak up against racial injustice, like nutritionist Rasheeda McCallum, who started Black Chef Movement, a network of Black chefs across the country banding together to feed protestors. It’s caused chefs and restaurant operators like Chris Shepherd, Sam Kass, and Naomi Pomeroy to advocate for a more sustainable industry as part of the Independent Restaurant Coalition. The industry may be broken, but the people in it are working harder than ever to make it better because it finally seems like they can.These last few months have changed the way I eat, write, and think about the industry I’ve built my career on covering. I’ve learned that, in the end, restaurants are about hospitality, both cultivated inside the restaurant and radiated outward into the community. And this hospitality extends to us—our role as diners can never be the same. This year’s election, racial reckoning, and global pandemic have called on us to protect what matters most in our lives, and that includes restaurants. For too long we’ve treated restaurants like a service. We’ve bought into a fantasy that restaurants are simply products and that we are consumers rather than recognizing all the humans who are making the product work. We are part of the hurt in the restaurant industry, but we can also be part of the change. We have opportunities not only to save the restaurants we’ve grown to love and rely on but also to recalibrate them to be more sustainable and enjoyable for all. Though I anxiously await what this winter will bring, I feel somewhat hopeful for the future. The healing has begun.Explore Bon AppétitRestaurantsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-30", "author": ["Condé Nast", "Elyse Inamine"]}