{"id": "6cd1664326cd91a989d04c93a98c5c46", "url": "https://www.bonappetit.com/story/heads-of-the-table-michael-carter-chef", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "How I Went From Prison Cook to Pizza Chef at One of Philly’s Best New Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow I Went From Prison Cook to Pizza Chef at One of Philly’s Best New RestaurantsAt Down North Pizza in Philadelphia, all the employees are formerly incarcerated, including executive chef Michael Carter. This is his story.By Michael Carter, as told to Elyse InamineSeptember 14, 2021FacebookTwitterEmailExecutive chef Michael Carter inside the Down North Pizza kitchen in PhiladelphiaPhoto by Isa ZapataFacebookTwitterEmailThis story is part of Heads of the Table, our celebration of 12 restaurants, people, and organizations that led the industry through the pandemic and beyond. Meet all the winners here.Cooking was something I was passionate about because I was passionate about eating. It’s a family thing. On my mother’s side we had these big family reunions. We’d go to New Haven, Baltimore, Philly, or Norfolk, Virginia—that’s where my relatives migrated to from the South. We’d have these yearly gatherings, and whenever it was in Philly, I was eager to be involved. We’d figure out who would cook what, who was getting the permit for where we’d cook outdoors. Cooking was in me. I was registered to go to a restaurant school, but it didn’t work out initially because I was locked up from ages 16 to 19.I ended up at the New Jersey Training School for Boys, a juvenile detention facility, for armed robbery and home invasion. A big part of my experience being there was feeding myself and others. The food was subpar. In the juvenile system you go to school for half the day and work the other half. But once you have enough credits, you don’t have to go to school anymore. So I was always in the kitchen. I was cooking all day, presenting meals to everyone. I made little sandwiches composed of ingredients that convicts don’t usually get, like chicken breast, because they’re reserved for correctional officers. Usually we’d get generic chicken patties. So when no one was looking, I’d take some fried chicken breast, lettuce, and tomato. We called them swags.When I came home I wanted to keep cooking. So I signed up for restaurant school and got my first cooking job, working for a guy named Charles Casmirri who had a catering contract with PECO, a Philadelphia energy company. My mom worked for PECO, and she told this guy I was interested in cooking. So he hired me. It was fast-paced short-order cooking. Guys working on the electrical lines in the city wanted breakfast fast. I loved it.Since I was 14 years old, I was in survival mode, doing whatever I needed to get what I needed. I was out in the streets making it happen. But cooking with Charles, I learned that cooking was something that I could do for the rest of my life. I watched him cook a roast pork loin, salad, green beans, and mashed potatoes, something that cost $150 that he turned into a $600 invoice. I was like, I can do this. I came from an environment that was business-oriented. The street economy is all about making money. Here I saw a way out.I actually felt comfortable in the kitchen too. Before I worked for Charles, I had a job at Walmart. But I felt like I had to hide being myself. People like me feel disqualified. But in the back of the house, it’s either undocumented workers or guys like me. We’re like the Bad News Bears. As long as we get it done, no one cares about our past.I was with Charles for four months until I caught a case and was sent to prison for seven and a half years for aggravated assault with a deadly weapon. I only got released because they closed my jail. More money was needed to build two new jails, so mine was shut down. I just counted my blessings, but I understood that politics brought me home.As soon as I was released, my parole officer said, “Go to school or get a job.” I said, “School, here I come.” I was at the Art Institute’s culinary school. The crazy thing about school is technology. I was locked up for six generations of iPhones. I had a black Razr. One chef at school, Maria Campbell, had to teach me how to attach stuff to an email. But overall I loved school. It taught me the science behind cooking—how to emulsify, how to break down meat, how to deglaze. I was understanding on a whole ’nother level.Then things got derailed. My friend was driving us to the club—a white guy and a black guy in a BMW. We got pulled over for a tail light, and the cops illegally searched the car and found an unregistered gun. Since I’m an ex-offender, I was the guy. For the next 27 months, I sat in jail, without due process. I paid a lawyer $15,000. The arresting officer was shot in the line of duty in another case; he survived but had some injuries. Multiple judges wouldn’t throw out the case until this cop showed up. So every two months I had to come back and forth to court, shackled with a little black box that went over the handcuffs to prevent movement for eight hours. You can barely scratch your nose.When I came home I said I’m done with the street. That was the hardest bid of my life. That $15,000 was money I had been saving for a food truck. And a month after I was locked up, my daughter was born. I missed the first two years of her life. On top of that, the Art Institute closed. But those 27 months turned me into the person I am today. It put things in perspective, how short life can be and how much of my life I have given to the system. I am 35 years old, and I have spent 12 years in the penitentiary.I ended up at Down North Pizza in August 2020 because chef Kurt Evans brought me in as executive chef. He and I worked at Booker’s, a Southern-inspired restaurant in West Philly. He and Muhammad [Abdul-Hadi], the owner, thought I was the ideal candidate. And I was. Down North Pizza is about dope food, Detroit-style square pizza that’s nostalgic and reminds people of Pizza Fridays as a kid. But it’s also about training, hiring, and housing people like me. No one gives you a crash course in returning to society. It’s hard to find a job, because of your track record, and housing, since landlords want to know your previous residence and it’s not good if that was the state. But Down North Pizza is helping people like me move on and become productive citizens. A lot of guys come in through word of mouth. We help them find housing and we also have apartments above the restaurant, one of which I’m currently living in. I train everyone so they can do culinary math, make mother sauces, and operate a kitchen—things that are assumed in restaurant kitchens are actually explained here.The mission of Down North Pizza is to educate people about recidivism and how it’s the symptom of a rigged system. There are so many ways you can be returned to prison for what’s called “technical violations.” Examples of these are possessing marijuana, missing an appointment with your parole officer, not paying supervision fees. We have to carry around a yellow card in Philly you have to show when you register for a halfway house. It’s like a slave badge [metal tags enslaved people wore to identify the type of work they were allowed to do]. So now I’m speaking out about what is going on in the carceral system. It’s the third largest employer in the country, and it’s keeping people in jail. So many communities are affected by it, and a lot of people don’t know how it’s a business.At this point in my career, I can get a job anywhere in the city. Down North Pizza has given me a voice. It’s allowed me to talk to people—news reporters, customers, anyone—about the carceral system. During the last election we had a lot of judges come in. They’re the gatekeepers of justice, and I was able to explain what it was like to live in the system.Working here has given me the opportunity to develop my first menu. I can get into my cheese and pepperoni and come up with a sauce. I can make things like my own take on Hawaiian pizza. It’s really freeing. It’s allowed me to empower my guys in the kitchen. The other day my guy came in with the idea for a lamb sausage pizza with lemon ricotta and za’atar. We worked on it together, and I gave him credit for it on the menu. Chefs need to give their cooks their due. It’s another kind of justice.What I’m trying to do at Down North Pizza is create a place for our guys to be free, to be who they are. To have a good ol’ time. Sometimes we dance on the line. We know that not everyone will get us, but not everyone comes from where we come from.Make Michael Carter's Hawaiian pizza riff:Hawaiian Pizza With Barbecue Sauce and Beef BaconFor anyone who has ever thought they hate Hawaiian pizza: This pie is for you.View RecipeMore Stories from Heads of the Table:Introducing Heads of the Table, the trailblazing, community-building, future-making leaders changing the restaurant industry for good.Why Farm Club in Traverse City, Michigan, is the least pretentious farm-to-table restaurant you'll ever visit.When COVID brought NYC restaurants to a halt, Send Chinatown Love helped Ruth Li’s restaurant survive.Restaurants are still struggling, but chef Edward Lee is optimistic about what’s to come.During the pandemic, Francesca Hong went from chef to politician—and she’s not done fighting for food workers.Explore Bon AppétitRestaurantsFirst PersonHeads of the TableFuture of RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Michael Carter", "As Told To Elyse Inamine"]}