{"id": "6cd339955ac092b7d69c056dd1c3532d", "url": "https://www.bonappetit.com/story/vegetarian-chopped-liver", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Vegetarian Chopped Liver for Passover and All Year Round | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Love Chopped Liver—and This Vegetarian Version Is Even BetterLong live “veg liv.”By Leah KoenigMarch 26, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I love chopped liver, the creamy, umami-rich chicken liver (originally goose) pâté that’s a beloved icon of Ashkenazi Jewish cooking. I love swiping a piece of challah through it or blanketing a crisp sheet of matzo under a downy layer on Passover. I love how making chopped liver is an act of thrift: a waste-not dish made by Jewish grandmothers from a less desirable part of the chicken, long before nose-to-tail cooking started trending. Still, however fond I am of chopped liver, I love vegetarian chopped liver even more.I understand how meat-free chopped liver might sound blasphemous, like mayonnaise on a pastrami sandwich. But the spread, also called mock liver, holds a legitimate place in the Jewish American dining canon. In the mid-20th century, it was a fixture on the menus of New York City’s many “dairy restaurants,” which were the meat-free cousins to delicatessens. Since the kosher laws forbid mixing milk and meat on the same plate or at the same meal, people flocked to the deli for their corned beef and pastrami fix, and to dairy restaurants—most famously Ratner’s on the Lower East Side—for farmer’s cheese blintzes, potato latkes and pierogi topped with sour cream, and ruby borscht turned pink with cream.Old-school versions of vegetarian chopped liver were typically made from canned green peas or string beans smashed with plenty of fried onions and mushrooms, or sometimes eggplant, into a creamy, taupe-colored spread. Some recipes included walnuts, hard-boiled eggs, or crushed crackers for heft. As far as photogenic dishes go, it wasn’t exactly a looker. But it was, and continues to be, deeply desirable.More contemporary versions of vegetarian chopped liver tend to use fresher ingredients but follow the same ingredient-layering approach to mimic the unctuous texture and savory-sweet flavor of the original. As a Jewish cookbook author, I have developed several recipes for “veg liv” (as my husband and I lovingly call it) over the years using kidney beans and lentils as a base. But my favorite iteration is a Passover-friendly, cashew-based version that skips the legumes altogether. (Strictly observant Ashkenazi Jews avoid them during the weeklong holiday.)Here's how to make it:Start by soaking 1 cup raw cashews in enough cold water to cover for at least 30 minutes (or up to 2 hours). Meanwhile, hard boil 3 eggs, peel and quarter them, and set aside until needed.Heat ¼ cup neutral vegetable oil (like grapeseed or safflower) in a large frying pan set over medium heat and saute 1 finely chopped large onion in the oil until softened and lightly browned, 8–10 minutes. Add 1 lb. stemmed and finely chopped crimini mushrooms and cook down until they are browned, about 10 minutes. Stir in 1 Tbsp. light brown sugar and ¾ tsp. kosher salt, then remove the pan from the heat and let the mixture cool slightly.Drain the cashews and add to a high-powered blender or food processor along with ¼ cup water, the onion and mushroom mixture (use a rubber spatula to scrape all the flavorful oil from the frying pan into the blender), the hard-boiled eggs, 1 tsp. sweet paprika, ½ tsp. onion powder, and ½ tsp. freshly ground black pepper. Blend or pulse until creamy, with a little texture remaining. Taste the mixture and add a little more salt if you like.The naturally creamy texture of blended cashews melds with the pile of browned onions and mushrooms into a decadent spread that I crave during Passover and year-round. Does it taste exactly like real chopped chicken liver? No, of course not. It’s better.Leah Koenig is a cookbook author and writer based in New York City.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-26", "author": ["Condé Nast", "Leah Koenig"]}