{"id": "6cd8551e6d7cdde9d2eb0ab9c434787c", "url": "https://www.bonappetit.com/recipe/parsnip-skordalia", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Parsnip Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueParsnip SkordaliaBy Cortney BurnsJanuary 8, 20194.7(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis riff on the Greek classic swaps out potatoes for parsnips, which gives the dip a touch of sweetness that pairs well with the feta and chiles. It'll make you forget about hummus.Ingredients4 servings3medium parsnips (about 1 lb.), trimmed, scrubbed3Tbsp. blanched hazelnuts1cup dill fronds½cup grapeseed or avocado oil2serrano chiles, finely chopped1garlic clove, crushed¾cup crumbled feta⅓cup fresh lemon juice¼cup extra-virgin olive oilPreparationStep 1Preheat oven to 350°. Place parsnips in an 8x8\" baking dish or medium ovenproof skillet. Cover tightly with foil or a lid and bake until very soft and mashable (like a baked potato), 45–60 minutes. Let cool, then coarsely chop.Step 2Meanwhile, toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 7–10 minutes. Let cool, then coarsely chop.Step 3Blend dill and grapeseed oil in a blender until smooth. Transfer to a small bowl.Step 4Purée chiles, garlic, feta, and lemon juice in a food processor until smooth. Add parsnips and pulse until mixture looks mostly smooth. With motor running, stream in olive oil and process until mixture is extremely smooth and aerated. Transfer dip to a serving bowl; top with hazelnuts and drizzle with dill oil.Step 5Do Ahead: Dip (without hazelnuts and dill oil) can be made 3 days ahead. Cover and chill.How would you rate Parsnip Skordalia?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI only used half a chili and it was still very spicy. Not sure how you could use two full ones.Anonymous3/9/2022Tripled the garlic. Skipped the chiles and hazelnuts. So yummy!!!! Used it for dipping carrots, radishes, bell pepperMadelineChicago3/6/2022This was the perfect afternoon snack to hold two of us over until dinner. I cut the recipe in 1/2 and didn't have any nuts to top this dip and it was a HIT.  I served it with cherry tomatoes, carrots, cucumbers and celery. This dip is packed with both sweet and savory flavor, and a beautifully smooth texture. The best part....We put this in the fridge for a midnight snack :)\n\nAlso, I boiled my parsnips on medium for 15(ish) minutes to speed the process. I love to freeze parsnip juice/water for the next time I make bone broth.cookin4fourChicago5/10/2020Excellent with or without the hazelnut topping. Great with pita or with meat for dipping. I tripled the garlic - 1 clove is barely there. The dip has wonderful balance with the sweetness from the parsnips, the savoriness of the feta, and the spice from the chiles. Have made this several times. Especially good on hot days, served chilled.SrAsparagusOakland, CA11/15/2019Absolutely delicious and easy to make!AnonymousNYC1/19/2019Explore Bon AppétitDipGreekEuropeanParsnipVegetableHazelnutNutSerrano ChileChileFetaCheeseWinterStarterVegetarianGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Cortney Burns"]}