{"id": "6cdeee76c2928f8813ed3b46bf239f38", "url": "https://www.bonappetit.com/recipe/vitamin-c-superfruit-salad", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Vitamin C Superfruit Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVitamin C Superfruit SaladBy Andy BaraghaniMarch 7, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintFeeling under the weather? This superfruit salad will give you the jolt of vitamins you need to get back on the path of recovery.Ingredients4 servings11½\" piece ginger, peeled, finely grated⅓cup carrot juice2Tbsp. fresh lime juice¼tsp. ground turmericA pinch of kosher salt2½lb. mixed citrus, such as oranges, blood oranges, and/or grapefruit1mango, peeled, cut into 1½\" irregular pieces2kiwis, peeled, cut into 1\" piecesCrushed red pepper flakes (for serving)Flaky sea saltExtra-virgin olive oil (for drizzling)PreparationStep 1Mix ginger, carrot juice, lime juice, turmeric, and kosher salt in a small bowl.Step 2Using a paring knife, remove peel and white pith from citrus, being careful not to remove too much of the flesh. Slice citrus however you want; you can slice into ¼\"-thick rounds or cut into 1\" pieces, and they don’t even need to be an exact shape or size.Step 3Spoon half of carrot dressing in a shallow bowl. Arrange citrus, mango, and kiwis in bowl, then spoon remaining dressing over. Top with red pepper flakes and sea salt, then drizzle with oil.How would you rate Vitamin C Superfruit Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI made this twice, ate the whole thing by myself each time, and I haven’t gotten sick. 10/10AslockeNashville, TN4/8/2019Explore Bon AppétitSaladOrangeCitrusFruitBlood OrangeGrapefruitKiwiMangoStone FruitWinterQuickEasySideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Andy Baraghani"]}