{"id": "6cf5e0e4098bbad438b0b2c721a42f23", "url": "https://www.bonappetit.com/story/top-kitchen-accessories-2020", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "The 15 Kitchen Accessories We Loved That You Loved in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Kitchen Accessories We Loved That You Loved in 2020From comfy kitchen clogs to sourdough supplies, here are the things you couldn’t get enough of.By MacKenzie Chung FeganDecember 21, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Does anyone else find those Spotify year-end roundups kind of embarrassing? Like, who wants to be confronted with the number of times they listened to that earwormy Bieber and Chance the Rapper song or to know that their most-streamed album was not some obscure banger but “Relaxing Whale Calls for Stress Relief Vol. 3”? It shows us an image of ourselves that’s a little too crisp.This list is sort of like that. Throughout 2020 we shared with you some of the kitchen accessories, appliances, and tools we loved the most. The things you loved most? It wasn’t the festive cake stand-slash-punch bowl or the set of lovely French steak knives—it was jigsaw puzzles and steel wool. Yeah, 2020 was like that. Here’s to a brighter 2021.Küchenprofi Tweezer TongsIn January we ran this piece about the only tongs you’ll ever need, but in August contributor Sohla El-Waylly shook things up by coming out hard in favor of tweezer tongs. In the battle of the tongs, the readers have spoken! Sohla’s sturdy 12-inch tweezers were a runaway hit, proving there’s no right or wrong tong.Küchenprofi 12-Inch Stainless Steel Tweezer Tongs$13 $12 at Amazon$20 at WayfairOxo Baker's Dusting WandAccording to a wild guess I’m making, the average BA reader made 29 loaves of bread this year. We gave the people what they wanted, and in October we surveyed our panel of bread experts about the tools they use to turn out perfect loaves each time. Out of all their recommendations, from bannetons to serrated knives, there was one product you loved the most—and it was something of a wild card. Claire Saffitz swears by this dusting wand to keep her loaves and work surfaces well-floured. “It offers a ton of control, so I don’t have flour flying everywhere,” she says. It’s also perfect for sprinkling powdered sugar and ground spices like cinnamon exactly where you want and nowhere you don’t.Oxo Baker’s Dusting Wand$10 at OXO$15 at AmazonOur Place Always PanHealthyish writer Ali Francis raved about the limited-edition Always Pan that Our Place released for Lunar New Year, which featured a bonus bamboo steamer and a cherry red finish. Even though that special release came and went, the classic nonstick Always Pan with its nesting wooden spatula and drop-in metal steamer basket was a BA reader favorite throughout 2020.Photo by Emma FishmanAlways Pan$145 at Our PlaceFive Two Bamboo Cutting Board I crack open the cookbooks on special occasions, but usually if I’m looking up a recipe it’s on my phone. Maybe you can relate because you seemed to share former staffer Emma Wartzman’s passion for this bamboo cutting board. It has a notch to keep your phone upright, so you can easily consult a recipe, catch up on your stories, or FaceTime with Emma’s mom while you cook.Laura MurrayFive Two Bamboo Cutting Board$59 at Food52Material reBoard Cutting BoardPerhaps you heeded our advice that you actually need two cutting boards—a big wooden one for almost everything and a sterilizable plastic one for raw meat and seafood—because you also fell for these cutting boards made from recycled plastic and renewable sugarcane. Since we originally featured them in Healthyish, Material has launched two new colors benefitting nonprofits Heart of Dinner and Drive Change. Fifty percent of the proceeds from the pale peach To Pó-Po with Love and the emerald green Reimagine Justice reBoards will be split between the two organizations.Material reBoard Cutting Board$35 at MaterialFat Daddio’s Round Cake PanMaybe it was because of this groovy cheesecake cake from Sohla or this multilayered sweet potato cake from Baltimore baker Amanda Mack, but y’all baked a lot of cakes this year. Or at least you bought a lot of cake pans—specifically this Fat Daddio’s round cake pan, which Basically proclaimed best-in-class.Photo by Laura MurrayFat Daddio's Round Cake Pan, 9 x 3 Inch$14 at AmazonCalzuro ClogsI have a closet full of non-sensible shoes, and although sometimes I like to put on my pink pony hair mules and clomp around just for the hell of it, for the most part I’ve been wearing comfy slip-ons for the past nine months. Staff writer Alex Beggs couldn’t have known she was recommending the ideal COVID house shoe back in February when she wrote about these cushy Italian plastic clogs, but in doing so she has cemented her reputation as the oracle of Bon Appétit. Don’t sleep on the pink tie-dye pair.Calzuro Clogs$104 at AmazonBreville Smart OvenBaker Yossy Arefi landed on our Best Holiday Cookbooks list with her casual-cool book of Snacking Cakes, and I was shocked to learn that many of the recipes she tested for her book were baked in this powerhouse of a countertop oven. The Breville Smart Oven was good news for renters with crappy ovens when we featured it back in April, and it’s even better news now that it’s on deep sale.Breville Smart Oven Pro$525 $280 at Sur La Table$280 at Bloomingdales'sPiecework Forbidden Fruit PuzzleYou did puzzles. Lots of puzzles. You were especially enthusiastic about this sunny, tropical, fruity offering from Piecework that we shouted out back in April.Photo by Emma FishmanPiecework Forbidden Fruit Puzzle$36 at Piecework$36 at VerishopHomax Steel WoolThis most fave of the favorite kitchen accessories was a no-brainer. A pack of 12 pads of steel wool is $4, and you bought it because Carla said so.Laura MurraySteel Wool, 12 Pads$6 at AmazonBaker of Seville Bread LameHealthyish assistant editor Aliza Abarbanel began baking sourdough before COVID hit New York, but by July she had reached new levels of commitment to her craft. No longer satisfied with using a kitchen knife to score her boules, she bought a lame—and she convinced you to buy one too.Emma FishmanBaker of Seville Bread Lame$20 at EtsyEmile Henry Fruit BowlIn March and April the BA recipe that consistently drew the most traffic was this one for four perfect baked potatoes. (Step one: Identify which appliance in your kitchen is the oven.) Whether a first-time home cook or seasoned pro in need of a refresher, you figured out what to do with all those potatoes but not where to keep them—until August, when Healthyish published this piece about a ceramic storage bowl for your root veggies and fruit.Photo by Rocky Luten/Food52Emile Henry Ceramic Storage Bowl$140 at Food52Graf Lantz Merino Wool CoastersYou know how merino wool is the perfect winter base layer because it wicks moisture away from your body, keeping you both warm and dry? These coasters are like that, plus they come in so many good color combos with names like Bauhaus and Palm Springs. Your coffee table thanks you.4-Pack of Merino Wool Felt Coasters$24 at Graf LantzFellow Corvo Electric KettleI saved a lot of money on fancy coffee shop pour-overs this year. Maybe you did too since many of you snapped up this sleek matte black electric kettle from Fellow.Fellow Corvo EKG Electric Kettle$149 at Amazon$149 at FellowAarke CarbonatorDirector of editorial operations Cristina Martinez knew that buying bottles of sparkling water that had been shipped from remote mountain springs wasn’t exactly eco-friendly. But she also didn’t want to settle for a bulky countertop soda machine made of plastic. You apparently felt the same way because you loved the Scandi-chic Aarke Carbonator—available in stainless steel, matte black, mod white, or 100 percent pure gold (not quite, but if you’re giving this as a late holiday gift, no one needs to know).Carbonator II, Matte Black$220 at Williams Sonoma$219 at VerishopExplore Bon AppétitproductShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-21", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}