{"id": "6cf8729ff8ce4f119828ed70e24fe301", "url": "https://www.bonappetit.com/story/hot-honey-butter-recipe", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "This Hot Honey Butter Recipe Will Upgrade Your Cornbread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHot Honey Butter Is the Answer, Whatever the QuestionIt belongs on cornbread—but dream big.By Alex DelanyJanuary 26, 2018FacebookTwitterEmailBobbi LinFacebookTwitterEmailButter is amazing. We all know that. I don’t need to dive into the handwritten, three-hour lecture on the merits of butter that I keep in my pocket at all times. It’s one of those ingredients (or foods, depending on your lifestyle) that is and always will be perfect. Essential. Simple. Beautiful. Salted. Unsalted. But lilies were made to be gilded, which is why hot honey butter exists. We’re looking at the trifecta of flavor: Sweetness. Fat. Heat. This combination (with the addition of some salt) is the reason a spicy salami pizza drizzled with honey is so damn good. Or why a platter of honey barbecue wings get devoured instantly.It’s everything your taste buds crave, and it plays a very important role in our 2018 Super Bowl menu of classic beef chili with skillet cornbread. Traditional Southern cornbread isn't sweet and muffiny. There's no sugar added, and there's no flour, only course-ground cornmeal. It's sturdy and dry, so when this hot honey butter is slathered all over it (before being dunked in chili, the flavor wheel is complete.The best thing about this little miracle (I sound like the cooing parent of a newborn) is that it only takes four ingredients and 132 seconds (a rough approximation) to make. Take 1 stick of room-temperature butter, and chop it into smaller pieces. Throw those in a bowl, and add 3 Tbsp. honey, 1 Tbsp. hot sauce and a generous pinch of kosher salt. Then, you whisk the hell out of it, until it becomes on smooth, creamy piece of art. Blammo. Done.You can personalize this condiment too. While we like Frank’s as an all-purpose hot sauce, you can substitute whatever sauce strikes your fancy. Just make sure that you use a hot sauce focusing on flavor, not heat. We don’t want our butter to burn holes in whatever we choose to put it on.Eyes on that chili? Get the full Super Bowl menu here.\nPhoto by Bobbi LinAnd that’s the final question. What do we put it on? How about that cornbread you’re going to eat with your chili? Or some fresh biscuits? Maybe a slice of hearty sourdough from your local bakery? Hell, you could even melt it and use it to coat some wings, before blasting them under the broiler. It’s up to you. The ball is in your court, or...uh…the butter is on your knife? You get it. Spread the love.Get the recipe:Hot Honey ButterThis hot honey butter is only 3 ingredients—and heaven on cornbread.View RecipeExplore Bon AppétitSuper BowlButterCornbreadRead MorecookingThese Homemade Pretzel Bites Are Better Than the Mall'sBy Alyse Whitneytest-kitchenYour 2018 Super Bowl Menu: Chili, Cornbread, and Hot Honey ButterBy Alex Delanyculture50 Super Bowl Favorites That You Need at Your PartyGallery50 SlidesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Alex Delany"]}