{"id": "6d0b3ad72395648dc5a8357942ae3ab1", "url": "https://www.bonappetit.com/story/cbd-cocktails", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "How Drinking CBD Cocktails Really Makes You Feel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Drinking CBD Cocktails Really Makes You FeelHere's what they did to me, anyway.By Kelly DobkinJune 22, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhen it comes to drinking and drugs, I’ve always been a bit of a lightweight. So when I heard that CBD cocktails were “a thing,” despite knowing that CBD wouldn’t actually get me high, I was a little spooked by the prospect of combining a weed-derived substance with booze, mostly for fear of some kind of overbaked result. Would I get totally lit and need to take a nap at the bar, or would I be really calm and focused but also social and fun?A non-psychoactive chemical found in both cannabis and hemp plants, CBD (cannabidiol) acts as an anti-inflammatory and sedative, without the trippy effects of THC. While popular for years in health circles, it’s recently become the wellness ingredient du jour, appearing in coffee drinks and plant-based dinners. But CBD is more than just this year’s turmeric latte—numerous studies have suggested that it could have serious medical benefits for dozens of chronic conditions. So what happens when you pair this miracle antioxidant with an arguably inflammatory substance like alcohol? And, more importantly, why would you?At Bar Belly on the Lower East Side, customers can elect to add a spritz of CBD oil to any cocktail for $2. At New York’s Narcbar, the sidewalk-facing restaurant/bar within The Standard East Village, you can order a $14 Matcha Haze, made with gin, mezcal, matcha, lemon, egg white and CBD oil sprayed on top in the design of a cannabis leaf. “Guests were requesting CBD and wanted to add it to just about everything—juice, tea, coffee, cocktails,” said Regional Beverage Director, Ashley Santoro. The .05mg of CBD that sat atop a frothy egg white float gave me a pretty decent buzz, counteracted somewhat by the lift I got from the matcha syrup.Narcbar's Matcha Haze, made with gin, mezcal, matcha, lemon, egg white and CBD oil sprayed on top\nPhoto by Alex LauA chic new underground cocktail bar in Chinatown, Peachy’s, plays with herbs and supplements like astragalus, spirulina, and chlorella in cocktails. Co-owner Eddy Buckingham plans to add drops of a CBD tincture called Daily Dose to their cocktail, the $18 Jade Fizz (like a gin fizz, but with bok choy extract and moringa powder). This one hit me a bit harder—there was a heaviness but not a headiness. It’s the first wave of sedation you get from being stoned without that “delay effect”—there’s no real disruption of your own spatial awareness. I felt buzzed from the alcohol, but the CBD added a grounding quality; I felt ultra-calm in the best way.To the delight of stoners everywhere, we are hard-wired to crave cannabis products. “We all have endocannabinoid receptors in our bodies already, and cannabinoids [a class of chemicals found in CBD and other cannabis products] also occur naturally in substances like breast milk,” said Cannabis guru and advocate Sailene Ossman (who once ran a famous no-name delivery service in LA). She believes that CBD helps return balance to the body, regulating inflammation, soothing anxiety and more. Ossman, who is firmly anti-alcohol, has never combined CBD with booze, but frequently serves it in mocktails (she often hosts parties and events using cannabis products). “It’s more placebo effect with CBD than anything, I think.”In the concentrations and concoctions it’s being mixed with, CBD is likely having very little medicinal effect, but it could be just enough to cut the wave of anxiety you can often get immediately after downing a cocktail (dehydration can trigger anxiety-like symptoms). Kathleen Schaffer, owner and creative director of an LA-based events company who has played with CBD in different recipes said, “Scientifically speaking, the bioavailability in ingesting CBD is pretty low. Using it intravenously or under the tongue is most effective for now, depending on the tincture concentration.”After my mini CBD bar crawl, the next day I awoke with a pretty strong case of munchies (the hole-in-the-stomach kind I used to get after bong hits in college), but other than that, not much of a hangover to speak of (no throbbing head, no dry mouth). Was it all in my head? The CBD had done very little to alter my state of mind, but I definitely felt different than I typically do after a night of moderate drinking. It seemed to ease the edges of my usual hangover, and I felt a little less dehydrated, a little more grounded. I’d had nothing to fear and only good vibes to gain from mixing my booze with a dash of green.Explore Bon AppétitHealthyishCannabisTrendsRead MoreLifestyleCBD Coffee Is the Wellness World's New Favorite DrinkBy Melissa MalamutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Kelly Dobkin"]}