{"id": "6d17c8036584a8c94890fc6ebdaf5941", "url": "https://www.bonappetit.com/recipe/jalapeno-popper-gougeres", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Jalapeño Popper Gougères Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJalapeño Popper GougèresThese light and eggy cheese puffs are channeling your favorite bar snack.By Sarah JampelMay 2, 20214.6(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintChoux pastry is a marvel: It comes together in a matter of minutes and is the basis of cream puffs, profiteroles, éclairs, croquembouche, French crullers, and the airy, cheesy, eggy delights called gougères. Here the gougères are flavored with cheddar and pickled jalapeños as a nod to jalapeño poppers (shout-out to contributor Aliza Abarbanel for the idea!). You can use any color cheddar you like, but orange will give you the most dramatic look. A word on the method: While an electric mixer makes the job easier, you can definitely do this whole process by hand if you have the arm strength (and patience)—you’ll need to beat vigorously after each egg. An electric mixer, though, is likely to get you a more dramatic rise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketBox Grater$13 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonSmall Bowl$13 At AmazonMedium Saucepan$39 At AmazonWooden Spoon$6 At AmazonElectric Mixer$40 At AmazonMedium #40 Cookie Scoop$16 At AmazonIngredientsMakes 26–306½oz. sharp cheddar, preferably orange½cup sliced pickled jalapeños1cup (125 g) all-purpose flour½cup (1 stick) unsalted butter½cup whole milk1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼tsp. freshly ground black pepper5large eggs, room temperaturePreparationStep 1Preheat oven to 425°. Line 2 baking sheets with parchment paper or silicone baking mats. Once you turn on the stove, the dough comes together fast—so get prepared: Grate 6½ oz. sharp cheddar, preferably orange, on the large holes of a box grater. Set 2 Tbsp. aside for sprinkling over gougères later (you should have about 1½ cups left). Finely chop ½ cup sliced pickled jalapeños on a cutting board. Place 1 cup (125 g) all-purpose flour in a small bowl.  Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Cut ½ cup (1 stick) unsalted butter into tablespoon-size pieces. Transfer to a medium saucepan and add ½ cup whole milk, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, ¼ tsp. freshly ground black pepper, and ½ cup water.Step 3Bring to a simmer over medium-high heat. Reduce heat to medium-low, add flour all at once, then stir vigorously with a wooden spoon until mixture balls up and no spots of dry flour remain, about 30 seconds. Continue to stir with gusto, smacking the dough along the sides and bottom of the saucepan (you’re looking to dry it out without it taking on any color), 3 minutes. You’ll see a film develop on the bottom of the saucepan that will mostly be reabsorbed as you keep stirring. Let cool slightly, 1–2 minutes.Step 4Continuing with your wooden spoon or switching to an electric mixer, add 4 room-temperature large eggs, one at a time, beating after each addition until fully incorporated (about 30 seconds). Don’t worry if the mixture looks curdled or broken. Separate yolk from remaining 1 room-temperature large egg over a small bowl to catch egg white. Reserve yolk for another use; add egg white to pan and beat until mixture comes together into a smooth, glossy, shiny, and thick batter, 1–2 minutes. Add cheese and jalapeños and stir or beat just until evenly distributed.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Using a 1½ Tbsp. (#40) cookie scoop or a (heaping) tablespoon, portion scoops of batter onto prepared baking sheets, spacing 1\" apart. Sprinkle a little of the reserved grated cheese over each gougère.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Place in oven and immediately reduce oven temperature to 375°. Bake until super puffy and golden brown all over, 22–28 minutes. Serve warm or at room temperature.Do ahead: Gougères are best the day they’re made but can be made 1 day ahead. Store airtight at room temperature. Reheat in a 350° oven until crisp, 5–7 minutes. Gougères can be formed 1 week ahead. Arrange on baking sheets, ½\" apart, and freeze until solid. Transfer to a resealable freezer bag or freezer-safe airtight container and keep frozen. Arrange on baking sheets as directed and let sit at room temperature while oven preheats. Top with cheese and bake as directed.How would you rate Jalapeño Popper Gougères?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleVery good!   Delicious!   They came out perfect.   For those that say 4veggs was too much or their dough was wet, you did not cook your dough enough.   When cooking your dough, you need to dry it out enough where it looks like crumbles.   Take it off the heat and keep on stirring  to let some heat out.  Then add your eggs one at a time and mix thoroughly.    Diane DeFelice. Chef DNew York 3/20/2022These come together pretty easily and are delicious! I followed the recipe exactly and they came out perfect. They are light and savory and fluffy and spicy!  A couple tips: Be sure to fully incorporate each egg…I switched to a hand mixer for this part and it helped immensely. Don’t pull them too early from the oven. Be sure they are golden brown across the domes, otherwise I think they would collapse once pulled from the oven. The only thing I may try for next time is adding more cheese, because I love things cheesy. :) A great appetizer!! LindseySeattle, WA2/13/2022Made most of the batch without the jalapeños for my guests and those turned out exactly as pictured. The one with jalapeños puffed in the oven but immediately sank after being pulled out. I’m thinking that It could have been the extra moisture. Won’t stop me from trying to improve on these for the next time. LisaMD1/12/2022Makes me a hero in the kitchen. This is one of my new favorite recipes. They are easy to put together. I’ve served these frequently with high praise from guests each time. Joan King Salado, Texas 1/7/2022I had really wet dough, next time I'll try only two eggs like the previous poster.AnonymousAtlanta12/12/2021I've tried this twice and I also get the really wet dough  Next time I'll try only two eggs like the previous poster.  I should have stopped when I saw that the dough was getting too wet but I still put all of the eggs in.Anonymous12/12/2021Bust.  dough was very wet and when I put on cookie sheet, they looked like pancakes.  Did not rise.  Still tasted good, but more like cheddar cookies than popover.  I've looked at other popover recipes and only 2 eggs are called for.DeannaCalifornia12/3/2021Fantastic recipe. Everyone loved it. As far as saving all your recipes in one spot try the paprika app. That’s where I keep all the wonderful bon appetite recipesCarmel, IN11/12/2021Made these for a brunch yesterday and they were a hit!\nI don’t mind a little heat so I may add a few more jalapeños next time, but this recipe is great!!!Charles B.E.Los Angeles, CA6/21/2021I am making this right now, but I just wanted to point out how helpful it is to have the ingredient portions listed again in the steps. It drives me crazy when I need to scroll up and down or flip pages back and forth to follow a recipe. I don't have enough ramekins to do everything mise en place.\n\nPlease urge others to do the same! I'm not sure if BA has some sort of style guide for their editors.SeanBoston6/1/2021Yes, I'd like to be able to save recipes on this site, too!AnonymousFort Worth5/24/2021can anyone tell me if there is a way to save all the recipes I like in a box on this site?\nAngeOntario5/10/2021These were so delicious. I loved that I could scoop them as I've only piped once and I need to work on that skill. I made the dough yesterday and froze it because I wanted to bake them fresh today. They came out perfectly. Just wonderful flavor and texture. Definitely will be making these again!!LTSan Leandro CA5/9/2021Where is the PRINT icon?\nSusan GainenSaint Paul MN5/6/2021I did try piping them! I found the scooper yielded much better results, but please feel free to pipe to your heart's desire :) Sarah Jampel5/6/2021Explore Bon AppétitPastriesJalapeñoChileVegetableCheddarCheeseStarterNut-FreeVegetarianSimmerBakingDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-02", "author": ["Condé Nast", "Sarah Jampel"]}