{"id": "6d25169b35695e480b2513eed4dfcb5f", "url": "https://www.bonappetit.com/story/what-is-bulgur", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "What Is Bulgur, the Cracked Wheat That Cooks in 10 Minutes? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBulgur Is the Whole Grain for Busy PeopleWhole grains in a fraction of the time.By Antara SinhaNovember 2, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In the wide and varied world of hearty, healthy whole grains, bulgur deserves all of the love. Especially common in Middle Eastern cooking and cuisines (think of your favorites like tabbouleh or kisir), it’s versatile, tasty, and—the real selling point for stressed and time-crunched cooks—ridiculously fast to whip up. Just think, it takes 10 minutes to make bulgur compared to an hour-plus for brown rice. “It’s one of the original convenience foods,” says Abra Berens, author of the grains-and-beans-focused cookbook Grist.Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes$35 $30 at AmazonWhat is bulgur?Bulgur is made from cracked whole grain wheat berries that are partially cooked and then dried. This process is the key to bulgur’s convenience—because the cracked wheat berries are fully cooked (much like instant rice!), all you have to do is rehydrate them. How do you prepare bulgur?To prepare bulgur, simply soak it in an equal amount of boiling water for 10 minutes, then fluff it up with a fork. If you’re really in a rush, you can boil it like pasta, and if you want to be especially hands-off, soak it overnight. From there, it’s a mildly nutty, chewy, textural blank canvas for any and all seasonings, dressings, and accompaniments.How do you serve bulgur?Dress bulgur as you would any other grain. In Berens’s Crispy Salmon with Bulgur, it gets tossed in fresh dill and topped with a speedy mustard-shallot dressing to accompany fish and thinly sliced fennel. It’s a meal as fitting for a weeknight dinner table as it would be for a dinner party. Mix bulgur with your favorite vinaigrette or sauce or just a super simple mix of lemon juice, olive oil, salt, and pepper. Add it to homemade veggie burgers or employ it as a binder in meatballs and kebabs like kibbeh. You could also eat it entirely plain, swapping it in as a speedier option for rice, quinoa, or farro to accompany everything from lunch-friendly salads to slow-simmered curries to quick stir-fries.Look for bulgur at Middle Eastern or South Asian grocery stores, bulk stores, health stores, or online, often sold in fine, medium, and coarse varieties. They’re all delicious and easy to prepare—just know that the coarser varieties may need to soak longer in hot water. Once you’re stocked up, you’re ready to make bulgur your go-to grain for just about everything.Get the recipe:Crispy Salmon With BulgurA simple meal of crispy-skinned salmon and fast-cooking bulgur gets a special boost thanks to a creamy mustard dressing.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-02", "author": ["Condé Nast", "Antara Sinha"]}