{"id": "6d2f0a0722c9ad0379b565082316fa7a", "url": "https://www.bonappetit.com/story/biggest-little-farm-documentary", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "The Biggest Little Farm is the New Back-to-Nature Documentary I Never Knew I Needed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture‘The Biggest Little Farm’ is the New Back-to-Nature Documentary I Never Knew I NeededMolly and John Chester left city life behind to start a farm. But that’s only the beginning of their story.By Hilary CadiganMay 10, 2019FacebookTwitterEmailPhoto Courtesy of NeonFacebookTwitterEmailIt all began with a dog named Todd, who barked so much the neighbors complained. A lot. The landlord took action and Molly and John Chester were given a choice: the dog or the apartment.They chose the dog.Thus kicks off one of the most delightful and heart-wrenching (and then delightful again, and then heart-wrenching again) films I’ve seen all year: The Biggest Little Farm, an unexpected stunner of a documentary premiering May 10 across America. The film details the lives of two people who decide to actually do the thing we all dream of doing as we hide in our office toilet stalls scrolling through Instagram (that’s not just me...right?): Leave it all behind and go live on a farm.In 2011, spurred by the loss of their apartment, the Chesters quit their respective jobs in L.A. (she a chef; he a filmmaker), bought 200 acres of barren Ventura County land, and threw everything they had into starting not just a farm but one that functioned in perfect harmony with nature. What does that mean? If you want to get scientific about it, google “biomimicry” and “regenerative soil methods”; if you want to just visualize layman-style, think Garden of Eden: 76 varietals of fruit trees, 30-plus beehives, a restored pond home to dozens of wild bird species, and an Old McDonald-level collection of livestock including pigs, cows, chickens, and sheep.But the story of how the Chesters got from there to here is not just one of those everything’s-perfect tales that captures all the good stuff and leaves the rest out. It’s an honest portrait, painstakingly built over a span of eight years. It watches like a high-stakes drama, interspersing lush panoramas and gratuitous baby animal footage (see the clip below for a taste) with moments of seemingly insurmountable hardship, from murderous coyotes to California wildfires.“I think I came in with the naivety that if you’re leaning forward and giving something your all, it's just going to go your way,” Molly told me over the phone after an early screening. “I had to learn that weathering the storm is part of the process.”John agreed. “We learned that our good intent doesn't necessarily protect us from doing harm, or from failure. But the most important thing is that we had the courage to try something. And then when it failed, rather than letting embarrassment force us into a very quick solution, we sat back and tried to really understand and observe why the failure happened, and where the opportunities within the ecosystem lie.”You'll have to watch the film to learn of the epic love story between Emma the pig and Greasy the rooster.\nPhoto Courtesy of NeonThis is the message that plays out over and over throughout the film: A problem arises, such as wild coyotes attacking the chickens, and then that problem turns into a solution to another problem. The coyotes also like to eat the gophers that are destroying the fruit trees. (Free pest control!) What unfolds—slowly, if you’re paying attention—is a powerful message about the way our planet functions: All the solutions to our problems are already here; we just need to take a step back and let nature lead the way.“Eventually you realize the ecosystem of our planet is truly a self-regulating immune system,” John  said. “Our question was, why can't the same thing happen on a farm?”As somehow who’s spent the past decade or so convinced that our planet and everything on it is headed toward fiery doom, The Biggest Little Farm felt like an unexpected shot of hope straight to the heart. John and Molly’s story inspires not because of its idealism, but because of how it documents real solutions to real problems, both big and small.“The local food economy is the only thing that will pull us out of this,” said John of climate change, which is never directly mentioned in the film though it hovers, omnipresent, above everything. “When we started this farm people told us, ‘You're not going to feed the world with this kind of food.’ And we were like, ‘We're not trying to feed the world, we're just trying to feed our community.’ Big changes start with little revolutions.”The Biggest Little Farm is out in theaters today, May 10. Visit biggestlittlefarmmovie.com for showtimes and more information, and watch a clip below.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-10", "author": ["Condé Nast", "Hilary Cadigan"]}