{"id": "6d4e6c495bf62d08243a65bb821faa2b", "url": "https://www.bonappetit.com/story/lunch-rut-sandwiches", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "7 Sandwiches to Save You from Your Lunch Rut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese 7 Sandwiches Will Save You From Your Lunch RutA few of our favorite home cooks, authors, and chefs share their go-to sandwich combos for busy weekdays.By Christina ChaeyFebruary 17, 2021FacebookTwitterEmailPhoto by Laura Murray, food styling by Susie TheodorouFacebookTwitterEmailIf you had asked me What’s for lunch? sometime in the very recent past, my answer would never have been a homemade sandwich. The simplest versions always felt lackluster, and the ones I craved—the Court Street Grocers–level creations—would require half a day to prepare the dozen or so fancy sub-components. Plus, they never tasted as good as the ones I could buy. It just never felt worth it.But once I started asking that same question of the home cooks, authors, and chefs I admire most, I had to reconsider. For them, the answer is simple: Nothing beats a sandwich.After hearing them out and learning about their various tips and tricks, I realized I had been overthinking the whole “sandwich” thing. Sometimes, all it takes to make an old-faithful classic feel novel again is to add just one new ingredient, as the cookbook author Jessica Battilana does by adding sauerkraut to her family’s favorite jambon beurre. Other times, it’s all about using the best-quality ingredients you can find, as with the chef Meherwan Irani’s truly transcendent-sounding “fancy tuna” sandwich.Now I’m a homemade sandwich convert, and I think you could be, too. Here are seven ideas to inspire you the next time lunchtime strikes (a.k.a. tomorrow).Photo by Laura Murray, food styling by Susie TheodorouAvo-CheddarWhat’s in it: Lightly toasted whole grain bread + mashed avocado + sliced cheddar +pickled red onions + shredded kale dressed with lemon juice and olive oilSan Francisco Chronicle cooking columnist Christian Reynoso describes his favorite weekday sandwich as “more of a philosophy” than one that requires a set ingredient list. It almost always has mashed seasoned avocado, some kind of cheese, and dressed greens, but everything else is up for interpretation: the pickled onions might be cucumbers instead, or there might be some sliced tomato in there. As long as it answers the question, “What vegetables do I have on hand?” it belongs in this sandwich.Photo by Laura Murray, food styling by Susie TheodorouFancy TunaWhat’s in it: Seeded sourdough + oil-packed tuna + mayo + olive oil + onion + pickles + pickled jalapeños + freshly cracked black pepperYes, this stellar-sounding tuna sandwich from chef Meherwan Irani of Chai Pani and Spicewalla in Asheville comes with some...specific criteria; but it’s ultimately simple to put together. Irani’s key ingredients: “The BEST tuna” (he likes brands like Ortiz, Wild Planet, Bela, and Tonnino), “the BEST olive oil” (he opts for Greek here), “the BEST mayo” (for Irani that’s “Hellmann’s, duh”), and “the BEST pickles” (The Backyard Food Company's Czech Sweet & Sour Heirloom Pickle). Sense a theme here? Make sure your bread is lightly toasted and your onions/pickles/jalapeños are diced so you get some in every bite. And whatever you do, don’t skimp on the freshly cracked pepper.Photo by Laura Murray, food styling by Susie TheodorouFeta and CucumberWhat’s in it: Ciabatta + crumbled feta mixed with olive oil and red pepper flakes + sliced cucumbers + torn mint leavesCookbook author Yasmin Fahr eats this sandwich all the time (and we mean all the time—it counts as breakfast or dinner, too) and especially enjoys it as an open-face situation. “I always have feta (preferably Bulgarian) in the fridge and frozen sliced bread in the freezer, so I can eat a basic version of this no matter what else I have on hand,” Fahr says. It requires minimal prep work as-is, but can easily be jazzed up with additional toppings such as a fried egg, mixed fresh herbs, or sliced tomatoes.Photo by Laura Murray, food styling by Susie TheodorouJambon Beurre with KrautWhat’s in it: Baguette + sliced rosemary ham + good butter + sauerkrautOne of cookbook author Jessica Battilana’s go-to sandwiches is a French-style jambon beurre with ham (rosemary ham is her favorite), good butter, and a twist: a bit of sauerkraut. With pre-sliced ham and a jar of kraut in the fridge, putting this together becomes a five-minute affair.Photo by Laura Murray, food styling by Susie TheodorouMozzarella and Milk Bread Grilled CheeseWhat’s in it: Thickly sliced milk bread + butter + mayo + shredded mozzarellaThe New York Times Cooking writer Eric Kim says this comforting, monochromatic sandwich gives him mozzarella in carrozza vibes and “feels like nursery food.” Because shredded mozzarella can be quite bland, you can really taste all the other flavors at play here from the butter, mayo, and milk bread.Photo by Laura Murray, food styling by Susie TheodorouEgg and Hot PeppersWhat’s in it: Toasted whole wheat English muffin + fried egg + sliced white deli cheddar + butter + chopped hot peppers + raw white onionThis breakfast-leaning sandwich is an ode to the Italian condiment NYC pastry chef Natasha Pickowicz goes through a jar of per week: IASA’s hot chopped peppers in olive oil. “I stir it into mayo, spoon over noodle soup, drizzle on avocado, and melt into every pasta sauce base,” she says. A big spoonful of the slightly ferment-y, not-too-spicy peppers adds instant complexity to a simple egg and cheese.Photo by Laura Murray, food styling by Susie TheodorouTurkey and SpinachWhat’s in it: Squishy Italian roll + sliced turkey + Hellmann’s mayo + baby spinachCookbook author and BA video host Samantha Seneviratne says “I don’t think this sandwich is going to win any contests,” but that’s precisely why it’s so appealing as a quick-lunch hit: it’s not overthinking itself. The most important thing here is the bread: “It has to be super soft but also chewy—the Brooklyn delis around me always have something perfect—and the sesame flavor ties it all together.” As for the spinach? “That’s just so I feel like I crammed a veggie in there,” she says. Relatable.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-17", "author": ["Condé Nast", "Christina Chaey"]}