{"id": "6d53778e5e8daa68aaedbe595d4bc734", "url": "https://www.bonappetit.com/story/the-camel-trek", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "The Camel Trek: In Search of an Unexpected Delicacy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Camel Trek: In Search of an Unexpected DelicacyAfter Anissa Helou tried a camel meatball in Syria, she had to find it again.By Anissa HelouMay 4, 2018FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailIn all the years that I lived in Beirut, I never saw anyone sell or eat camel meat, nor did I ever see any camels: Lebanon has no desert. Then, one day in the late ’90s, I was walking through the Midan quarter in Damascus, Syria, researching a book on street food, and I came nose to nose, as it were, with a furry camel’s head hanging outside a butcher shop.The store was a hole-in-the-wall kind of place, with a charcoal grill at the back and a rickety table and chairs in front, a typical setup in Syria, so that the owner can grill meat to order for customers who want to have a quick bite. The burly mustachioed butcher had his bloody apron tied tightly over his paunch and was standing in the doorway, inadvertently blocking my way in. I asked him why he had such a grisly camel’s head, with its long neck still dripping blood, hanging outside. He explained that it was to show that he specialized in camel meat and to demonstrate the meat’s freshness; the camel was clearly slaughtered that day.I had to try some; it was too much of a novelty to pass up. I asked the butcher to grill me his tenderest cut, but he suggested I have kabab, otherwise the meat would be too tough. I was puzzled: In Lebanon, kabab means pieces of meat threaded onto skewers, which was what I thought I was asking for. But in Syria, kabab means meatballs or minced meat, also wrapped around skewers. I nodded in agreement, and he sliced a few pieces from the shoulder of the hanging carcass to put through his grimy meat grinder. Since the meat would be cooked, I didn’t let this lack of hygiene worry me too much. The butcher then seasoned the meat with salt and the typical Syrian seven-spice mixture (cinnamon, allspice, cumin, and so on) and dexterously wrapped it around a couple of skewers. He placed these on his grill, and once the kabab had charred, he slipped them off the skewers and onto pita bread, serving them alongside a platter of raw onion, tomato slices, and a few sprigs of fresh mint.Illustration by George WylesolThe grilled meat was not unlike beef. It was a touch drier and possibly gamier but exciting all the same since it was my first taste of what many Arabs regard as a delicacy. Even if this was not a gastronomic revelation, I became curious about camel meat, wanting to taste it wherever I could find it. More than a decade later I was in a catering kitchen owned and run by Umm Said, a formidable female cook in Al Ain, a tiny hilly Emirate in the United Arab Emirates, where I was shooting a TV series on Emirati cuisine. That day Umm Said’s chefs were preparing a whole baby camel for a family reunion party. They had separated the beast into joints, which were marinating in a wonderfully fragrant combination of spices that included saffron, cardamom, garlic, rose water, and b’zar, an Arabian blend of more than half a dozen spices. They then arranged the joints in a huge pot, positioning the camel hump in the center, put the pot over a large gas fire, and piled glowing embers on the lid to heat the pot from above and below.The hump was the prize of the feast, not so much for the fat but for the two fillets nestled underneath it. The chefs let me sneak a taste before the hump and the rest of the camel meat were assembled over a huge platter of steaming rice. That morsel tasted way better than the camel kabab I had in Syria: tender, with the subtle taste of the amazing marinade.But it wasn’t until a few years later, on a research trip to Saudi Arabia, that I had my favorite taste of camel, in the opulent dining room of the family hosting me. As in Syria, the medium was kabab, but here the ground meat was mixed with millet, then fried. The millet grains puffed up and became crunchy in the hot oil, providing a crisp contrast to the soft meat; tahini and tamarind dipping sauces added a juicy touch.I often re-create that recipe at home but with beef given how elusive camel meat is in the West. Every so often I add fresh herbs to the tahini sauce to freshen it and turn it a brilliant green or Kashmiri pepper to give it a gentle kick and turn it a vivid red. Having started with a rather mediocre taste of Syrian camel kabab, I’ve come a long way.Get the recipe for Meatballs with Tahini SauceMeatballs with Tahini SauceThe meatballs are rolled in millet and then fried for a delicious, crunchy texture.View RecipeAnissa Helou is the author of nine books, including Feast: Food of the Islamic World, out this month.Explore Bon AppétitTravelMeatballRead MorecultureOur Highly Subjective But Very Smart Guide to TravelingGallery21 SlidesBy Bon AppétitcultureThe Accidental ApprenticeBy Jason HammelcultureA Story of a Young Romance, a Bowl of Bar Peanuts, and a Plastic Bottle of WhiskeyBy Rumaan AlamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Anissa Helou"]}