{"id": "6d5c708997eeaadb3aa8c8365dace58d", "url": "https://www.bonappetit.com/story/where-to-buy-spices-online", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "13 Best Spice Stores Online - Bon Appétit's Recommendations | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Online Spice Stores for Everything from to Annatto Seed to Za’atarWhere you buy your spices is just as important as how you use them.By MacKenzie Chung FeganMarch 25, 2022FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As Sting’s uncle says in Dune (the David Lynch one, kiddos, keep up), “He who controls the spice controls the universe.” Back here on Earth, the sentiment is not far off. For centuries, trade routes have been carved, fortunes made, and people subjugated all for spice—nutmeg and black pepper, saffron and cardamom, paprika and cinnamon.That fraught history means it’s worth taking a second to pause the next time you find yourself re-upping on coriander. Flavor is certainly one reason to take care with where you source your spices. Depending on the type and whether they’re whole or ground, spices can lose their potency as quickly as six months. A jar of ground cumin could conceivably have been sitting on a grocery store shelf for several months, its valuable volatile oils evaporating all the while. Your supermarket cinnamon is also likely to be cassia cinnamon instead of Ceylon cinnamon—which isn’t bad, just...less good—and if you’re not thoroughly scrutinizing labels, you could wind up with artificial vanilla flavoring instead of pure vanilla extract.Jump Ahead to Our FavoritesSpice SourcersSpice BlendersSpice ShopsBut knowing where your spices come from is important for other reasons as well. Most spices still reach your kitchen in much the same way they did when the Dutch East India Company was operating in the 17th century—they were grown or foraged by someone in a country close to the equator, and they have passed through multiple hands before reaching their final destination. Because there are so many brokers, traders, processors, and other middlemen, those supply chains generally lack transparency. And with spice being a catchall term encompassing scores of different crops grown in scores of different countries, each individual supply chain comes with its own challenges. Are the foragers making a living wage? Have the spices been adulterated by middlemen? Is climate change forcing farmers off their land?Spice, glorious spice!\nPhoto by Laura Murray, Food Styling by Kat BoytsovaYour best bet is to buy from a company with the shortest supply chain possible—ideally, one that sources spices straight from their origins and sells them directly to you. By cultivating personal relationships with their farmers and foragers, these companies not only ensure that their customers are getting flavorful, fresh, high-quality spices, but also that their suppliers are being paid fairly. For spice growers, many of whom live in some of the poorest countries in the world, a trusted partnership with an ethical importer can mean a pathway to economic security.Below we’ve rounded up some of the best spice stores online—from companies that source directly from farmers to artisan blenders who concoct complex spice mixes to shops where you can compare Kampot and Tellicherry peppercorns. Just like with coffee, we recommend buying whole spices and then grinding them at home for maximum freshness and flavor, but many of these sources will sell you ground spices as well, should you prefer.Spice SourcersDiaspora Co.Mumbai-born, California-based Sana Javeri Kadri works directly with Indian and Sri Lankan smallholder farmers to source heirloom, single-origin turmeric, chiles, cardamom, pepper, and more. Our editors love this company not only for its selection of spices (try the chai masala), but also for its commitment to ethical and transparent supply chains.Diaspora Co.Shop NowBurlap & BarrelLike Diaspora Co., Burlap & Barrel cofounders Ethan Frisch and Ori Zohar source their heirloom spices—including senior editor Sarah Jampel’s favorite cinnamon—from smallholder farms and farmer cooperatives. By cutting out the middleman, Frisch and Zohar ensure that farmers earn a higher price for their product. Burlap & Barrel’s direct relationships with suppliers means that farmers can focus on quality rather than quantity and know that they have a partner who will reward their efforts.Photo courtesy Burlap & BarrelBurlap & BarrelShop NowHeray SpiceIn 2013, Mohammad Salehi sought asylum in the United States after his tenure as a translator for the U.S. Army made it unsafe for him to remain in Afghanistan. He founded Heray Spice because he wanted people “to know that there’s more to my country than war.” His company sources saffron from farming families in Herat Province, where Salehi grew up, and donates a portion of its profits to local educational charities.Heray SpiceShop NowSpicewallaJames Beard–nominated chef Meherwan Irani sells both carefully curated individual spices and culinary spice sets, including a Kitchen Essentials pack of 18 spices beloved by contributing editor Amanda Shapiro. It makes a great gift for recent grads, novice home cooks, and anyone just setting up their first kitchen.SpicewallaShop NowFrontier Co-opThis member-owned co-op headquartered in Iowa was founded in 1976, and its spices—as well as its 100% organic line, Simply Organic—are a good grocery store option. Frontier Co-op introduced the first Fair Trade Certified spices in the United States in 2009, and its Well Earth program supports spice growers and foragers by providing multiyear contracts and capital for new agricultural equipment.Frontier Co-opShop NowSpice BlendersNew York ShukBest known for its signature harissa, New York Shuk creates spice blends that reflect founders Leetal and Ron Arazi’s Middle Eastern heritage. Their rust-colored shawarma blend is excellent on both meats and veggies, and their kafe hawaij—a warming blend of cardamom, cinnamon, clove, and ginger meant to be added to coffee—has the flavor profile, in New York Shuk’s words, of Middle Eastern pumpkin spice.Leetal AraziNew York ShukShop NowLoisaIf you’re looking for organic sazón and adobo blends free of artificial colorings or additives, look no further than this NYC brand, which sells Latin spices in addition to jarred sofrito. So good that even your grandma might switch over from G*ya.Photo by Isa Zapata, Food Styling by Pearl JonesLoisaShop NowSpice Tree OrganicsEgyptian Americans Doaa Elkady and Freda Nokaly source their organic spices from reputable suppliers—including Burlap & Barrel—and then toast, grind, and mix them into evocative blends like ras el hanout and buharat.Spice Tree OrganicsShop NowZ&ZThis family-owned D.C. company sells single-origin sumac and sea salt, but we’re here for its signature za’atar, which is made with wild thyme sourced from Palestinian farmers in the West Bank. Serve it with man’oushe and olive oil.Photo by Isa Zapata, food styling by Micah MortonZ&ZShop NowSpice ShopsThe Spice HouseRuth and Bill Penzey Sr. opened the Spice House in 1957, a time when garlic was still considered “exotic” by much of America. (As you’ll see, many of the best spice stores online can trace their lineage to the Penzeys, in some way or another.) Their daughter Patty ran the business until 2018, when it was purchased by business partners with backgrounds in finance and tech. If you’re looking to buy spices online without stopping at Heray Spice for saffron, Diaspora Co. for turmeric, and Burlap & Barrel for cinnamon, the Spice House’s huge selection of everything from lavender to Mexican oregano should have you covered.The Spice HouseShop Now at The Spice HousePenzeys SpicesBill Penzey Jr. followed in his parents’ footsteps and started his mail-order spice business in 1986. He now has 49 retail locations and is nearly as famous for his progressive politics as he is for his seasoning blends and Vietnamese cinnamon. Penzey Spices’ customizable, deeply groovy gift boxes are perfect for Deadhead dads and Gen Z grads alike.Penzeys SpicesShop NowOaktown Spice ShopWith three locations in the East Bay, Oaktown sources its wares from hundreds of importers and offers everything from amchur powder to single-origin wild asafetida powder. Spices are ground and seasoning blends are mixed in-house. John Beaver, who owns the shop with his wife, Erica Perez, cut his teeth under Bill Penzey Sr. at the Spice House.Oaktown Spice ShopShop NowCurio Spice CoCurio Spice Co sources many of the spices it sells—from Japanese sansho pepper to Ethiopian besobela—directly from small farms. Claire Cheney, Curio’s founder, places special emphasis on supporting other female-owned businesses and cooperatives that contribute to the economic empowerment of women.Curio Spice CoShop NowStock up and get cooking:Explore Bon AppétitSpiceShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-22", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}