{"id": "6d6455b94e70c51604e8d5ebc5394a88", "url": "https://www.bonappetit.com/story/skura-style-sponge", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "The Skura Style Sponge Is The Only Sponge The BA Test Kitchen Uses | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Has a Favorite Sponge—and It Never SmellsMeet the magic, odorless wonder.By Gaby Melian February 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I take cleaning very seriously. As Test Kitchen manager, it’s part of the job, but it’s also my personal passion (I’m such a clean freak, I’ll wipe down a stove while it’s still hot). So, believe me when I tell you that Skura Style makes the absolute best sponges out there.We go through sponges way quicker than people normally do at home. Sure we use them a lot more, but it’s also because our windows don’t open, which means we have no fresh air coming through the kitchen. Our sponges absorb EVERYTHING going on in the room. If you leave a regular old sponge sitting out over the weekend here, it’ll be dry, crinkly, and smell like sh*t by Monday. We have to throw them out every week. (Trust me, I’ve tried salvaging them by soaking them in Clorox bleach, boiling them, or putting them in the microwave. It never works.)The Skura sponges, on the other hand, last way longer. And, better yet, they never smell. That’s because the super absorbant base—made of patented polyurethane foam instead of cellulose—includes an antimicrobial agent that prevents the growth of mildew, mold, and odor-causing bacteria. The sponge’s firm texture made me really skeptical at first. But as soon as you wet it, it becomes gentle and pliable enough for anything, even curvy wine glasses.You can get your hands on them two ways: Individual packs when you need them, or for situations like ours, a subscription to four-packs, delivered to your door every month or every other month. You know when to move on to a new sponge when the Skura Style logo emblazoned on the scrubby side side completely disappears. If it weren’t for that, I’d probably still be using the same one that started this obsession. And I wouldn’t even be mad about it.Photo by Ted \\+ Chelsea CavanaughSkura Style Sponges$15 at AmazonExplore Bon AppétitShoppingTest KitchenStaff PicksCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-08", "author": ["Condé Nast"]}