{"id": "6d721656ff9d547afa89d78355dd46c0", "url": "https://www.bonappetit.com/story/halo-halo-sarvida", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "The Halo-Halo at Philadelphia’s Sarvida Is 5 Layers of Perfection | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Halo-Halo at Philadelphia’s Sarvida Is 5 Layers of PerfectionYears of eating the Filipino dessert primed chef Lou Boquila to make this spectacular version.By Amanda ShapiroJuly 18, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.Halo-halo is the only dessert option at Sarvida, Lou Boquila‘s newest Filipino restaurant in Philly, but it was all that our table for six needed. The cup of multi-layered goodness delivers an entire dessert menu worth of textures and flavors: custardy, chewy, icy, milky, creamy, and starchy-sweet. The best way to eat halo-halo, Boquila says, is to mix everything together, but I called him up and asked him to break it down for me, one delicious layer at a time.The IceShaved ice makes halo-halo a summer staple. “It’s hot and humid for most of the year in the Philippines,” says Boquila, who lived there until he was eight. “So the ice is there to cool you off.” It also balances out the sweetness of the dish.The MilkTraditionally, the shaved ice gets drizzled with sweetened condensed milk, but Boquila adds evaporated milk in a 50/50 ratio to ease up on the sugar.The FlanMost Filipino flan is dense, but Boquila takes more of a crème brûlée approach, with fewer egg yolks. He bakes the flan right into the cup for a creamy base. “Back home you’ll get a small square of flan in halo-halo,” he says, “but I wanted to make sure everyone got a taste.”The UbeThe crowning touch is a scoop of roasted, puréed ube—a sweet, starchy potato. “This is everyone’s favorite part,” Boquila says, but he warns guests not to eat it straight off the top. “You have to stir it all together to make sure you get a little bit of everything in each bite.”The Add-Ins“In the Philippines, they’ll throw anything in there— cereal, crispy rice, toasted coconut. Here we make almost everything in house,” Boquila says. His mix includes sugar-macerated jackfruit and adzuki beans poached in brown sugar, star anise, and cardamom. The only store- bought ingredients are coconut jelly and palm nuts.Explore Bon AppétitDessertDish DecodedRestaurantsPhiladelphiaRead MorecultureI Instagram-Stalked This Croissant, So I Found Out How It’s MadeBy Rachel KartenrestaurantsTurkey Tails Are The Most Delicious Thing You Didn’t Even Know You Could EatBy Elyse InaminerestaurantsThe 5 Elements of a Flawless HighballBy Elyse Inamine and Robert SimonsoncultureThis Dive Bar Is Turning Out the Best Burger in OaklandBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-18", "author": ["Condé Nast", "Amanda Shapiro", "Robert Simonson"]}