{"id": "6d87bceb66c3e94e6efc1e797a8d99b7", "url": "https://www.bonappetit.com/story/spam-musubi", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "How to Make Spam Musubi, The All-Occassion, All-Seasons Snack in Hawaii | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSpam Musubi is My Little Packet of Sunshiny HappinessSoy-slicked luncheon meat with sticky white rice and crisp nori. What could be better?By Elyse InamineMarch 12, 2020FacebookTwitterEmailFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.Welcome to the tail-end of winter. It’s that specific point in the season when the magic of snow has worn off and my fridge is full of cabbage and turnips that I can’t bring myself to turn into a mushy braise for tonight's dinner. It’s bleak. But then I remember: Hope lies in my pantry. After digging through packets of instant ramen and Costco bags of dried fruit, I find my stash of the ingredient that is always in season and always delightful: SPAM.Say what you will of Spam, but you cannot deny that it tastes pretty good. And it reaches peak deliciousness when fried up in its own mystery meat fat and soy sauce, layered with hot white rice and furikake (Japan’s savory sprinkles), and wrapped up in earthy, crackly nori (Japanese dried seaweed). This, my friends, is Spam musubi, Hawaii’s all-occasion, all-season snack. And this is what I’m eating tonight.In Hawaii, where my dad grew up and much of my extended family still lives, Spam musubi is everywhere. It’s on regular rotation at any family gathering, from New Year’s day parties to football games. My mom, who is not from Hawaii, eventually added Spam musubi to her own repertoire, making it for my elementary school class parties and any gathering we had in the Inamine household. When I moved to New York, she sent me along with a Spam musubi press—people in Hawaii do not joke around—so I could live that Spam musubi lifestyle even thousands of miles away from the homeland. Now it’s become the antidote to my winter cooking blues, an absolute unit of carbs and calories that’s unabashedly salty and fatty and joy-filled. And here’s how it can become yours, too.Start by cooking about 2 cups of short-grain white rice (here’s how). While that’s going on, open up one can of low-sodium Spam and shimmy it out of the container—but don’t toss the packaging just yet. Now slice the meat into 6–8 rectangular pieces, depending on how thick you want your Spam (I prefer mine thinner). Throw the Spam slices into a hot nonstick pan, frying and flipping until each side has patches of golden-brown deliciousness. Then turn off the heat and add a splash of soy sauce, letting the sugars in the sauce caramelize and cling to the Spam in a thick glaze (if the sauce starts to look burnt and smell toasty, just dump everything onto a plate). Set the Spam aside and start tearing nori sheets so they’re about the width of the can (usually it works to just rip the sheets in half).Once the rice is cooked and slightly cooled and the Spam container rinsed, it’s time to assemble. Take one torn sheet of nori and place 2–3 tablespoons of rice in the center (you can adjust your Spam-to-rice ratio; I like mine even). Smash down on the rice with the bottom side of can so the rice is flat and Spam-container-shaped, then sprinkle some furikake (I like this brand since it’s less fishy and adds another dimension of nori flavor) and place one slice of Spam on top. Add a little more furikake and 2–3 more tablespoons of rice, then gently smash the rice with the can so the surface is even. Fold both sides of the nori over the final rice layer and seal the edges with water. Congrats: You’ve made your first Spam musubi! Repeat this process with the remaining Spam slices, then either eat as little logs or cut them into thirds and finish with a little more furikake on the cut sides, like my mom does.I bet that before you’ve even finished your musubi, you’ll be browsing the web for a press of your own that will serve you all through the rest of winter (and beyond).Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-12", "author": ["Condé Nast", "Elyse Inamine"]}