{"id": "6d88f7bee5eddce9aadff4119ea66066", "url": "https://www.bonappetit.com/story/manuka-honey", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Activist Manuka Honey Is the Superfood Sweetener We're Obsessed With Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleActivist Manuka Honey Is the Superfood Sweetener We're Obsessed With Right NowWhat exactly is mānuka honey, and why is it so expensive?By Aliza AbarbanelAugust 10, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhen Brad Leone has a new obsession, we pay attention. Our test kitchen manager has his own Fermentation Station™, not to mention a hit Youtube series and a dizzying amount of overall food knowledge. So when he started waxing poetic about Activist mānuka honey, whose brightly patterned jars we’ve been spotting on the shelves of our favorite wellness shops for months, we sat up and listened.But first we had to figure out: What exactly is mānuka honey? And why does it cost five times the price of the bear-shaped stuff? (See: This 2015 episode of Broad City, where Abbi goes to the Gowanus Whole Foods while under anesthesia and spends over $1,000 on a shopping spree that prominently features mānuka honey.)Mānuka honey comes from New Zealand, where bees pollinate the native Mānuka bush. The plant has been a cornerstone of Maori medicine for centuries, and honey made from its nectar is thought to have a wide range of benefits like immune and digestive support along with skin-healing properties. It has a grittier texture than other types of honey, a deep golden hue, and a strongly floral, sometimes bitter taste. While research is still limited, mānuka honey’s healing properties are thought to come from its high levels of an antibacterial compound called methylglyoxal.  “All honey has methylglyoxal, but mānuka honey has extremely high levels of it, which is what makes it such a beautiful product,” says Luke Harwood, who co-owns Activist with his wife, Gabrielle Mirkin. “It’s amazing for immune support, digestive support, topical breakouts, and more.\"Today mānuka honey can be found everywhere from luxe skincare brands to the shelves of Trader Joe's. This highly saturated market, paired with an incomplete regulatory system, has resulted in a lot of bad honey on the market. Activist aims to fix that. Harwood and Mirkin, both native New Zealanders, pride themselves on their small, sustainable business that prioritizes potency and transparency.Feeling burned out from high-stress careers in fashion and magazine editorial, the couple saw an opportunity to focus on mānuka after some friends set up hives on their property in New Zealand. \"We wanted to create a product that is direct from Mother Nature,\" says Harwood. \"I saw an opportunity for mānuka to be elevated and educated about on a global scale.\"Mānuka honey is easy to find these days, but the potency can vary wildly. Most products verify their effectiveness through one of two scales: UMF (Unique Manuka Factor) and MGO, which measures milligrams of methylglyoxal per kilograms. Activist currently offers three levels of honey: 850+ MGO, 300+ MGO, and 100+ MGO. “The  850+ MGO is my medicine, I even give it to my two-year-old,” Leone says. “The lower grade, more everyday ones make me feel like Winnie the Pooh—they’re golden, more mellow in flavor, and just one of the best honeys I’ve ever had.”Of course the difference between an \"everyday\" mānuka honey and \"medicine\" comes down to price. And yes, that high price tag is perhaps mānuka honey's best-known trait. Activist's top-shef, 850+ MGO honey is $75 a jar, and other brands go even higher. The cost is a reflection of rarity, since this honey can only be made when the mānuka bush flowers for a few short weeks between spring and early summer. The window is brief—anywhere from two to six weeks depending on the year—and attempting to prolong the harvest period can introduce other nectar and subsequently diminish potency.But luckily you don't need to eat much to reap mānuka's benefits (even though you might want to). Harwood says just a teaspoon or two a day is enough. Stir it into smoothies, drizzle it onto granola, or slather it on your skin. Feel free to experiment: In the BA test kitchen, Leone is fond of stirring it into everything from vinaigrettes to sun tea. Just keep in mind that mānuka honey is raw, so it’s best kept below a temperature of 100°F. And if you just go ahead and eat it straight from the jar, well, that's pretty sweet too.Explore Bon AppétitHealthyishNew ZealandhoneyShoppingTrendsRead MoreLifestyleOn the Hunt For Fermented HoneyBy Ashley MasonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-10", "author": ["Condé Nast", "Aliza Abarbanel"]}