{"id": "6d9b924ed4cce0edc25974beda0ad546", "url": "https://www.bonappetit.com/story/cook-with-coconut-water", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Coconut Water is an Essential Vietnamese Ingredients for Sauces, Stir-Fries, Braises, and Dressings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAnything Water Can Do, Coconut Water Can Do BetterA staple of the Vietnamese pantry, I use it in desserts, curries, stews, braises, dressings, and sauces.By Giao ChauDecember 3, 2020FacebookTwitterEmailFacebookTwitterEmailLong before coconut water was a trendy sports drink, I adored it. During the annual summer trip to visit my grandmother, I gulped the refreshing liquid straight from the green husk my uncle had broken open with a machete just seconds earlier. My favorite lunch was tender chicken simmered in a sweet and garlicky coconut water reduction. The natural electrolytes and antioxidant properties—those were just fringe benefits.My grandmother lives on the outskirts of Bến Tre, a city that plays a primary role in cementing Vietnam’s position as the third-largest exporter of coconuts in the world. Like other farmers in the region, generations of my family have depended on these lanky palm trees for our livelihood. Their leaves put a roof over our heads; their trunks are transformed into bridges that connect narrow canals. All parts of the tree, from young to mature, from fresh to dry, are treasured.On the dining table, the empty husk becomes an organic cooking vessel and a serving bowl for rice. The white flesh can be eaten as is or grated and extracted into coconut milk to enrich xôi (steamed sweet rice with an assortment of toppings), curries, and a myriad of pastries and desserts. Coconut water may be the most versatile component of all, used not only as a thirst quencher but also as a staple in the Vietnamese pantry.The natural sweet and savory notes of coconut water allow us to use less refined sugar, particularly in a cooking technique called kho, an umbrella term that encompasses both stews and braises in which a protein is simmered until tender in fish or soy sauce, sugar, water, and aromatics. Coconut water is also the braising liquid for pork and hard-boiled eggs in thịt kho trứng, a traditional dish shared during Tết, the Vietnamese celebration of the Lunar New Year. When coconut water is used in place of water in nước chấm, the quintessential fish sauce dressing for spring rolls and vermicelli bowls, less sugar is needed. And when my aunt makes her “roti” chicken (which, despite its name, is similar to pan-roasted chicken), she deglazes the pan with coconut water to make a sticky caramel sauce. As wine isn’t a common ingredient in Vietnamese cuisine, coconut water plays the role of flavor enhancer.Now that I’m halfway across the world from Bến Tre, I rely on packaged coconut water, which is easier to come across and more budget-friendly than the fresh kind. It was a discovery I made, with some initial skepticism when living in Singapore as a penny-pinching student trying to make thịt kho trứng. Spending $4 on a cup of fresh coconut water for cooking wasn’t a very prudent financial decision. While packaged coconut water doesn’t have that crisp and delicate undertone as the fresh stuff, my favorite brands—UFC Refresh and Chaokoh—are mildly sweet, slightly tangy, and pretty close to what I had back in Vietnam. (Both of them source their coconuts from Thailand.)When you’re shopping, look for brands with no added flavors and sugar and avoid those made from concentrate. I also prefer the carton packaging as canned beverages sometimes have an unpleasant metallic taste.Basking in the convenience of packaged coconut water, I have become more liberal with its use. Most often, I treat it like wine when making braises or stews for a Vietnamese spin. The final dish will be more mellow in flavor and lighter in color. If I don’t have chicken broth on hand, I’ll replicate that meaty sweetness by mixing 1 part coconut water to 2 parts water. When making stir-fries or any other recipe that call for adding rice vinegar or mirin to a sauce, like this braised tofu or this chicken stir-fry, I replace it with coconut water instead. Try sneaking coconut water in the poaching liquid for chicken breasts (after that, strain the liquid and store it in the fridge for a handy simple stock). You can do the same with skin-on prawns to make tôm hấp dừa (which literally translates to “coconut-poached prawns”), a Vietnamese snack that goes very well with an ice-cold beer.Apply the motto “Anything that plain old water does, coconut water can do it better!” to your nước chấm. Just remember to warm the coconut water first so the sugar can dissolve faster. If you have a sweet tooth and feel inclined to make pandan jelly with it, I will gladly approve. Just remember: Always taste your coconut water before using it in place of water so you can adjust the amount of sugar needed. Not all brands have the same sweetness level, depending on the types and maturity of the coconuts.With its flavor so mild and unobtrusive, you may not even pick up coconut water when it’s in a dish. But when it’s not, you’ll definitely know that something is missing.Giao Chau is a writer based in Toronto. When she's not cooking or writing, she's giggling at cat videos.Explore Bon AppétitCoconut WaterRead MoreVietnamese Turmeric Fish Summer RollscookingChè Ba Màu Is Pure Bliss in Summer’s Sticky HeatBy Sovi WellonsSpicy Braised TofuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-03", "author": ["Condé Nast", "Giao Chau"]}