{"id": "6da318e68d877d4c66d9851319fec1e0", "url": "https://www.bonappetit.com/story/chinese-sausage-a-love-story", "year": 2020.0, "month": 7.0, "day": 5.0, "content": "Chinese Sausage - What It Is and How to Use It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll You Salty-Sweet Fans, Chinese Sausage is For YouAs someone who refuses to plan meals (…sorry), lap cheong is my lifesaver.By Helen QuJuly 30, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.All of my best memories with family center around food: getting up early with my parents on a brisk October morning to catch a street vendor selling jianbing, my dad’s favorite breakfast growing up; drinking tea with aunts and uncles while eating our body weight in lychee; lingering at the dinner table, bellies full from a meal by the best chef in town—my mom.After moving away from my North Carolina home, recreating the flavors of my family’s cooking has helped me keep them close. I’ve found that nothing beats lap cheong (the Cantonese name for Chinese sausage) for a quick fix when nostalgia hits, reminding me of the fried rice my mom makes whenever I visit.Add Chinese sausage please!\nChinese sausage dates back to the period of Northern and Southern Dynasties (~300–500 AD). An almanac from the period describes a unique starch-free sausage-filling-technique that was developed to preserve meat and is still followed to this day. Southern families traditionally made a supply of sausages in preparation for the new year, and many still consider homemade sausages a New Year’s dinner staple.Chinese sausage is a broad umbrella category encompassing many types of sausage, both air-cured and smoked, from all parts of China as well as Vietnam and Thailand. It can be made from fresh pork, pork fat, livers, and, sometimes, chicken, and tends to be as sweet as it is savory, with a rich, dense, emulsified texture. According to Baidu, Chinese sausage falls into two big categories: a sweet variety from the Canton region, often preserved with soy sauce, salt, and sugar, and a spicy one, made with chili, from Sichuan. Since the sweet kind is by far the most prevalent in Chinese supermarkets in the U.S., I normally compensate by adding plenty of spicy ingredients.In terms of brand preference, my local Chinese supermarket carries Kam Yen Jan, and I’ve been happy with the pork-and-chicken variety. The kind made with only pork is more authentic, but those made with both pork and chicken have a lower fat content. In general, look for a dried sausage with a marbled pink-and-white exterior in the refrigerated section.This version is made with pork and chicken.\nI drop a few slices of Chinese sausage into any dish that could use a rich salty-sweet punch. It goes with everything and lasts forever in the fridge, making it a true lifesaver for me and my stubborn inability to plan meals ahead of time. It can be steamed or crisped in a pan, then eaten alone or added to congee, stir-fries, and soups.The possibilities are endless, but here are some ideas to get started with:Fried Rice with Chinese SausageBeat 2–3 eggs and scramble in hot oil until runny but almost cooked through. Scrape into a bowl and set aside. Add 2 cups cooked rice and fry until fluffy, adding water a spoonful at a time if needed (note: you might not have to do this if the rice is fresh, but I like to use leftovers!). Add 2 Chinese sausages, sliced, the cooked eggs, and 1 scallion, sliced, and continue to fry 1–2 minutes, until sausages are cooked through. Season with salt to taste and garnish with more sliced scallion.Cabbage and Chinese Sausage Stir-Fry (a.k.a. Dad’s Specialty)Halve a green cabbage and roughly chop the leaves into squares (you could substitute with Napa or any other kind, but this is just how my dad makes it). Fry the cabbage with 2 Chinese sausages, sliced, and soy sauce to taste in hot oil until the cabbage has wilted and the sausage is cooked through.Indomie with Chinese SausageFry an egg and a sausage, sliced, on separate sides of a pan while boiling Indomie instant noodles, my favorite brand of stir-fry noodles. When I’m feeling fancy, I add shrimp and spinach to the pan. After draining, put the noodles in a bowl and mix with flavoring packets. Add the fried egg and sausage and garnish with sliced scallions. (If you’re making noodles in broth, feel free to drop the egg and sliced sausage in to boil as the noodles cook.)Kam Yen Jan Lap-Xuong Sausage (Pack of 3)$19 at AmazonHelen Qu is an astrophysics grad student who loves cooking, baking, and trying new recipes in her free time.Explore Bon AppétitChineseSausageRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-30", "author": ["Condé Nast", "Helen Qu"]}