{"id": "6daa53edfdbebc907a16e66049f73805", "url": "https://www.bonappetit.com/recipe/creamy-lemon-zucchini-pasta", "year": 2020.0, "month": 8.0, "day": 5.0, "content": "Creamy Lemon Zucchini Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy Lemon Zucchini PastaBy Sarah JampelAugust 30, 20204.6(141)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintWith the help of the large holes on a box grater, zucchini transforms into a pile of soft shreds. Cook it down with olive oil, onion, and garlic and it becomes a creamy, caramelized mush that’s great to spread on toast (like in the recipe this one was inspired by, Jennie Cook’s Zucchini Butter), stir into scrambled eggs, or turn into pasta sauce with the assistance of cream and lemon juice. You’ll be amazed by how many zucchini cook down into this one dish—a very good thing when you’re staring down a pile of this prolific summer star.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonDutch Oven$80 At AmazonLarge Bowl$18 At AmazonMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonMeasuring Spoons$10 At Bon Appétit MarketCutting Board$10 At IKEABox Grater$13 At AmazonTongs$13 At AmazonWooden Spoon$6 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients4 Servings2lb. zucchini or summer squash (4–6)1large shallot or ½ small onion4large garlic cloves3Tbsp. extra-virgin olive oil¼tsp. crushed red pepper flakes2tsp. Diamond Crystal or 1¼ tsp. Morton kosher saltFreshly ground black pepper12oz. spaghetti, linguine, bucatini, or other long pasta1lemon½oz. Parmesan, plus more for serving½cup (lightly packed) basil or mint leaves½cup heavy creamPreparationStep 1Bring a large pot of water to a boil and salt heavily.Step 2Meanwhile, place a clean kitchen towel in a large bowl (or on a large cutting board). Trim 2 lb. zucchini or summer squash (4–6), then grate on the large holes of a box grater directly into towel. Peel 1 large shallot and grate on the large holes of grater into towel. Peel 4 large garlic cloves and grate on the small holes of grater into towel.Step 3Gather ends of towel together, then squeeze over bowl (or the sink) with all your might to extract water from the zucchini. Squeeze until it’s hard to get out any more liquid. You should have extracted about ⅔ cup zucchini liquid, just FYI; discard.Step 4Heat 3 Tbsp. extra-virgin olive oil in a medium Dutch oven or very large skillet over medium-high. Add ¼ tsp. crushed red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Add zucchini mixture (unwrap the balled-up towel over the pot for easiest transfer) and 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt and stir to coat. Season generously with freshly ground black pepper. Cook, stirring occasionally, until zucchini mixture is jammy, thick, and starting to stick to bottom of pot, 15–20 minutes.Step 5When the zucchini has been cooking 5–10 minutes, add 12 oz. spaghetti, linguine, bucatini, or other long pasta to pot of boiling water and cook until al dente. Scoop out 2 cups pasta cooking liquid and set aside.Step 6Meanwhile, juice 1 lemon into a small bowl. Grate ½ oz. Parmesan on the small holes of grater (you should have about ¼ cup; you can also use ¼ cup pre-grated Parmesan). Very coarsely tear or chop ½ cup (lightly packed) basil or mint leaves.Step 7Using tongs, transfer pasta to pot with zucchini—it’s okay if some water clings to it. Reduce heat to medium-low, add ½ cup pasta cooking liquid and ½ cup heavy cream, and stir to combine. Add cheese, pour another ½ cup pasta cooking liquid over top, and cook, stirring vigorously with tongs or a wooden spoon and add more pasta cooking liquid if needed, until a creamy sauce that coats pasta forms, 2–3 minutes.Step 8Remove pasta from heat and stir in 2 Tbsp. lemon juice. Taste and season with more salt and black pepper and add more lemon juice (you may want to add an additional 1 Tbsp.). Stir in most of the herbs.Step 9Serve pasta topped with more grated Parmesan and remaining herbs.How would you rate Creamy Lemon Zucchini Pasta?Leave a ReviewTell us what you thinkReviews (56)Back to TopTriangleExcellent, even using a parsimonious amount of cream.Adding one or two tablespoons of sourmash bourbon & pine nuts (step number 8) really expands the texture &  flavorfullness.SocrackerSouth3/14/2022Phenomenal dish, after making the original I made a vegan version and it was still amazing (albeit not quite as good) but, shout out to trader Joes for the dairy free parmesan and silk for the dairy free heavy cream.TamgentFarmerModesto, CA2/22/2022Hard not to gush about this one.  So perfect.  Like other reviewers I didn’t add cream but I did start with a little bacon and had this with spaghettini and fresh basil and a splash of peas.  It was sooooooo goooood! Bookmarked for future.  What a great way to use up zucchini’s!MarnieErin, ON1/5/2022I have made this so many times.. I never add the cream.. I like cream, I just don’t think this pasta needs it..The lemon really kicks it up. If I have basil I add a little. If I have pine nuts, I toast them and add them.. a tlittle bit of prosciutto might be good also…one of my favorite simple recipesKaty Los Cabos1/3/2022Love this!! Definitely add the extra lemon juice. I tried this with fettuccine, and then the second time made it with ditalini instead and loved it that way. The sauce clings much better to the smaller pasta shape, definitely prefer that myself. But the sauce is excellent! A new favorite for my family. BethDenver, CO12/30/2021Fantastic recipe, simple and fresh. I used pecorino instead of parmesan and gluten free pasta, and also added the zest of one lemon. Delicious and easy to throw together on a week night. ElleToronto11/25/2021I made this for dinner last night for the first time and it was a hit. The recipe was very simple and easy to follow. Everyone liked it and asked for seconds. I did not change anything on the recipe and would definitely make this againDeviToronto, Canada10/6/2021Another stellar pasta recipe! Again, easy to follow and delicious. We will be making this again and again. Thank you!AnnStratford, Ont9/28/2021Love this recipe! I've made it a couple times now. The first time I made it, I didn't have any parmesan, and honestly I liked it better that way! The next time I made it, I cranked up the red pepper flakes a bit and added half the parmesan. Five stars, totally recommend trying it!Anonymous9/20/2021We had zucchinis going bad in the fridge so I found this recipe for a last minute meal idea... the Italian I was cooking for couldn't advise me as he was on the phone...\n\nSHOCK AND HORROR: LEMON AND CREAM ARE A NO NO. WHERE DID YOU FIND THIS RECIPE!? IT'S AMERICAN!? \n\nI managed to add the lemon which was fine... we negotiated but I poured one spoon of the cream in before he gasped in disbelief. \n\nALSO N.B. I didn't pay much attention to the fact the pot should have been boiling with huge bubbles and lots of water before adding pasta... If you're cooking for an Italian this is a must otherwise they will look at you like you've done something atrocious. \n\nREGARDLESS... It was delicious.\n\nLeanings: \n1. Pot MUST be FULL of bubbling boiling well salted water before adding pasta. \n2. This dish could be just as good without cream and lemon (even without or with much less Parmigiano for that matter). \n3. Not so much Basil is needed. \n\nSummary: Italian is all about simplicity, it can be very good without all the additions. Madre Mia Aotearoa 9/15/2021FYI: I got great results with this without draining and squeezing the grated zucchini and without adding cream. A splash of pasta water + a smidge of butter makes for a lovely, light sauce. Lemon zest and juice are indispensable. I enjoyed this with mint.EricaMontreal8/20/2021Absolutely delish!  I added a bit extra lemon.  Also, why one should grate onion and garlic instead of just finely chopping is beyond comprehension.  Other than that, a super yummy dish; my carnivore boyfriend didn't even complain about the lack of meat in his dinner.  Having said that, the adjustability of this dish is def one 9f the big pluses.  I can see myself trying grilled shrimp on top next time.Lisa A.Richmond BC8/3/2021I made this last night, I skipped out on the pepper because I'm the only one who likes the kick, and used basil. I served it topped with italian grilled chicken. It was pretty good!AndreaOklahoma7/30/2021This was so delicious!!! So flavorful and fresh! I love the slight kick from the pepper as well, one of the best ways to eat up zucchini! And it wasn't hard to do! Look forward to trying with different cheeses and herbs.DebbieBridgeport, CT7/9/2021Absolutely delicious, goes great with squid rings but is super satisfying on its own. Works well with every cheese I've tried, and substituting dill as the herb took it to the next level.AnonymousToronto6/29/2021Explore Bon AppétitPastaItalianEuropeanZucchiniSquashVegetableSummer SquashSpaghettiPasta & NoodlesSummerEasyMainNut-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-30", "author": ["Condé Nast", "Sarah Jampel"]}