{"id": "6db862111613be6315c73c4a61ef0285", "url": "https://www.bonappetit.com/recipe/miso-tahini-noodles-with-asparagus-and-tofu", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Miso-Tahini Noodles with Asparagus and Tofu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMiso-Tahini Noodles with Asparagus and TofuBy Rachel YangMay 10, 20183.6(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy Baraghani, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis one-pot noodle bowl recipe features fresh asparagus, cucumbers, and herbs, with an easy, umami-packed blender sauce to tie it all together. This recipe from Rachel Yang of Joule in Seattle is part of Healthyish Superpowered, a dinner series honoring female activists and chefs across the country, in partnership with Caviar.Ingredients4 servings⅓cup raw cashews12\" piece ginger, peeled, thinly sliced1garlic clove, crushed⅓cup low-sodium soy sauce¼cup mirin (Japanese rice wine)¼cup tahini¼cup unseasoned rice vinegar1Tbsp. mellow white miso112-oz. package firm tofu, drained1lb. asparagus (about 1 bunch), trimmed, sliced 2\" thick on a diagonal12oz. fresh egg noodles, preferably lo mein3scallions, thinly sliced on a bias2medium Persian cucumbers, halved lengthwise, thinly sliced on a diagonal1½cup torn mixed tender herbs, such as basil, mint, and/or cilantroKosher saltPreparationStep 1Preheat oven to 350°. Toast cashews on a rimmed baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool, then coarsely chop and set aside.Step 2Meanwhile, blend ginger, garlic, soy sauce, mirin, tahini, vinegar, and miso in a blender until smooth. Transfer to a large bowl.Step 3Cut tofu into ½\"-thick strips, then into squares. Pat dry with paper towels. Add tofu to bowl and gently toss to coat.Step 4Cook asparagus in a large pot of boiling water until bright green and tender, about 3 minutes. Using a slotted spoon, transfer asparagus to a bowl of ice water to cool; pat dry. Reserve pot with water.Step 5Bring reserved pot of water back to a boil and cook noodles according to package directions. Drain and rinse under cold water to cool slightly.Step 6Add asparagus, noodles, scallions, cucumbers, and herbs to bowl. Season with salt and toss to coat.Step 7Divide noodles among bowls. Top with reserved cashews.How would you rate Miso-Tahini Noodles with Asparagus and Tofu?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis recipe is fantastic! I wanted to heat up the tofu, but decided to make as written. It came out great, and was actually refreshing with uncooked tofu. AnonymousLos Angeles, CA10/5/2021Not bad. I get a bit tired of the use of garlic and ginger in a lot of Asian recipes. I like the sauce even simpler - just great tahini and artisanal soy sauce and a dab of red miso all mixed and thinned with ice water. Maybe a squeeze of lime. Could just be me but simple flavors can ring truer and not be as muddy.  EssieDee Stamford ct12/3/2020As another review points out, this recipe kind of falls off at the end and doesn’t tell you what to do with the tofu. \n\nHere’s what I did (and it turned out great!) - I marinated the tofu in the sauce for about 10 minutes, then put it on a parchment paper-lined sheet pan, and put it in the oven (which was already on 350°F for the cashews) for about 12 minutes, flipping it halfway through. Just long enough to get it a little browned and crispy on the outside. Once the bowls were assembled, I tossed the tofu on top along with an additional drizzle of the sauce. \n\nThis recipe is very flavorful and I think the sauce would work nicely with shrimp or even possibly some kind of nice fish fillet.jreyes1905Texas5/27/2020I have made this recipe twice and both times we loved it.  Even my husband who is not a fan of tofu enjoyed it.  The first time I did not have cucumbers, so I substituted some raw zucchini.  The second time I did not have raw cashews and did not miss them.  Also, I had extra firm tofu so I let it marinate a few minutes longer.  I did not put the asparagus on ice water, I just set them aside when done.  This is certainly a dish that I will serve for guests who don't eat meat.  Leftovers are a great lunch.\nJoanneRRMississauga, ON5/7/2020This recipe is a great base of ingredients and seasonings to improvise with. I've made sesame noodles in the past that have oil and peanut butter in them, and I like the tahini and mirin better--it's lighter and a slightly more creamy flavor. I didn't have tofu so I put a soft boiled egg on top. 10/10!!gillian211191405/2/2020Does the tofu now get cooked?Anonymous12/5/2019Explore Bon AppétitMisoCondiments, Sauces & PastesTahiniAsparagusVegetableTofuOther IngredientsEgg NoodleNoodlePasta & NoodlesSpringMainVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Rachel Yang"]}