{"id": "6dc01762f2575d10141fd23749cef67b", "url": "https://www.bonappetit.com/story/dont-drink-wine-when-sad", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "What Wine Should You Drink When You're Sad? The Answer Is: None.  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePlease Don’t Drink Wine When You’re SadWay too many people ask me what wine to drink when they’re feeling sad. Don’t ever, ever do this.By Marissa A. RossJune 11, 2018FacebookTwitterEmailIllustrations by George WylesolFacebookTwitterEmailIf you are having thoughts of suicide, please call the National Suicide Prevention Lifeline, at 1-800-273-talk (8255), or the Suicide Crisis Line, at 1-800-784-2433, or text 741741.I didn’t wake up to my alarm last Friday. I thought it was my alarm as I swam my arms under the pillows, trying to find my phone that wouldn’t stop buzzing. Instead it was texts from concerned friends. I had no idea what they were talking about, and I literally thought to myself, “Jesus Christ, who died?!” By now, we all know that it was Anthony Bourdain.It was a hard day. It’s still hard. Like so many others across all industries and continents, Bourdain was one of my greatest heroes. He made me believe that I could pursue a life and career in wine that could benefit the community, consumers, and the world, while still being true to myself.It was hard for another reason too. The texts from friends were followed by messages from strangers, all asking the same deeply concerning question. It’s one of the most popular questions I've gotten since the 2016 election from readers and publications alike: “What wine should you drink when you’re sad?”My answer is always the same: None.No one likes this response. It’s not nearly as quirky or comical as they want from a woman whose whole life seems to be drinking wine and having fun (I promise you, there’s a lot more to it than that). But it’s the response that deserves to be heard and never is. The only reason I seem like I’m always drinking wine and having fun is because one of the few rules I live by is that I never, ever drink when I am sad.Admittedly sometimes I’ll be drinking and then I get sad, but that’s because alcohol is a depressant: It’s only going to make you feel sadder. And while I am all for a good cathartic cry, you shouldn’t do it with alcohol. You should do it with a therapist, loved ones, or your favorite Pixar movie.Not only is alcohol a depressant, but pouring a drink to escape emotion is a bad habit, one that has been glamorized by everyone from Charles Bukowski to the cast of Sex & the City to today’s top 40 music. It's a habit that's so easy to fall into and so hard to get out of. I’ve watched alcoholism destroy people I love. It always starts as a drink to deal with something until it becomes drinking to deal with everything.Wine is joyful. It is one of the most joyful things on this Earth. It’s like food and music and sex and art, incredible delights that we can indulge and devour and find immeasurable pleasure in. But if you drink wine because you’re sad, you start to associate it with those feelings. It strips wine of its ability to take you to places you’ve never been, to remind you of memories you love, or to be present in the place and memories you are creating as you drink the wine right then.That’s why we love wine, right? Because it is transportive and delicious and it brings people together. And it should always be associated with these things.So please don’t drink wine when you’re sad. Drink because you’re happy. Drink because you’re in love—with someone, or many, or the world, or the city, or the meal, or yourself, or art, or that cute dog that walked by and licked your knee. Drink wine because it’s a beautiful day or because you’re stoked on your new project or you’re just feeling good. Drink to celebrate life, not to deal with loss.Explore Bon AppétitWineAnthony BourdainHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast", "Marissa A. Ross"]}