{"id": "6dc74105903a03e343dd08c8f9bdfabb", "url": "https://www.bonappetit.com/story/make-ahead-baked-oatmeal", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Baked Oatmeal Is the Absolute Perfect Thing to Eat on Thanksgiving Morning | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMake-Ahead Baked Oatmeal Is the Absolute Perfect Thing to Eat on Thanksgiving MorningIt's a breakfast that will fuel your entire crew until the main event.By Anna StockwellNovember 12, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Kat BoytsovaFacebookTwitterEmailCall me crazy, but I believe that breakfast is the most important thing you eat on Thanksgiving. Without it, my holiday—and the holiday of everyone around me—will not go well. (Once, when I was too busy to eat, I found myself crying over mashed potatoes that wouldn’t get smooth.) So I’ve learned to eat a proper breakfast on Turkey Day, and to coerce my whole family and house full of visiting friends to do so too. And I haven’t found a more perfect Thanksgiving-Day breakfast than this baked oatmeal.Just look at those pecans.\nPhoto by Alex Lau, Styling by Anna StockwellIn case you’re unfamiliar, baked oatmeal is the denser cousin of stovetop oatmeal. You make it by stirring rolled oats into a mixture of eggs and milk and any other mix-ins and seasonings you like and baking it until the edges are caramelized and brown and the oats have absorbed all the liquid. It’s somewhere between a very soft, chewy granola bar and a bowl of porridge, and it’s excellent eaten with a dollop of fruit compote and another dollop of yogurt (or milk or cream). It’s filling but not gut-busting and easy on the belly.Because I’m usually already using pecans elsewhere in my Thanksgiving menu, I like to put some in my baked oatmeal along with cinnamon, cardamom, almonds, and pumpkin seeds. I sweeten the mixture with just a touch of honey and, because I like my baked oatmeal creamy, I use whole milk and melted butter as the liquid base. You don’t need dairy in your baked oatmeal though—you can use any kind of milk, from oat to almond to coconut, and melted coconut oil works just as well as butter as long as you don’t mind the flavor it imparts.The best time to prepare baked oatmeal is the night before you want to eat it, or even two nights if you’re really on top of things. You can bake it off, let it cool, and stash it in the fridge until the morning of the big day, then pop it into a 350° oven for about 20 minutes while you bustle around making coffee and chopping vegetables for stuffing. While the oatmeal is baking, you’ll want to simmer pieces of peeled apple with cranberries and cinnamon until it cooks down into a fancy applesauce (you can make this ahead too and reheat it the morning of). Keep the compote warm on the stove, put out some yogurt, milk, or cream and a stack of bowls and spoons, and breakfast for your whole crew is done. Just don’t forget to eat some yourself.Get the recipe:Baked Oatmeal with Warm Cranberry-Apple SauceThis baked oatmeal is the make-ahead breakfast your holiday plans need.View RecipeExplore Bon AppétitHealthyishOatmealBreakfastThanksgivingPecanRead MoreLifestyleThis Vegan Creamed Spinach Recipe Will Fool ALL the Dairy Lovers at the TableBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-12", "author": ["Condé Nast", "Anna Stockwell"]}