{"id": "6dd077663f027b8d15df05a5aca9fa34", "url": "https://www.bonappetit.com/story/mil-restaurant-peru", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Where Potatoes Pass From the Ice to the Sun | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhere Potatoes Pass From the Ice to the SunNext to one of Peru’s most astounding Incan ruins, perched 12,000 feet high in the Andes mountains, is a restaurant called Mil. I planned an entire trip around eating lunch there.By Alex BeggsApril 30, 2019FacebookTwitterEmailPhoto by Gustavo VivancoFacebookTwitterEmailFirst, you know nothing. There are 4,000 types of potatoes in Peru, and you’ll never eat them all. You’ll mistake an alpaca for a llama. You’ll read a 500-page book about the Incas and still feel clueless. You can pack so tightly, so deliberately, for every meal and hike and that rainy trek to Machu Picchu, and forget underwear. You might speak high school Spanish, but do you speak Quechua? If you keep in mind how little you know, you can begin to understand Mil, the ambitious restaurant-slash-food-lab from Virgilio Martínez, Pia León, and Malena Martínez, 12,000 feet up in the clouds of the Andes mountains. You also have to get there.Android Roy loves the The Red Hot Chili Peppers. We’re listening to Californication as we drive to Mil, a 90-minute journey from where I’m staying in Cusco. The jams are blasting from a ’90s playlist that Roy has open on his Android attached to the A/C vent. (Android Roy is the name of his in-car WiFi, and it becomes his and my inside joke.) Roy has kind eyes and an unfortunate soul patch–goatee combo, but I can’t fault a man for that. We bond over the universal language of rock. (“Te gusta Oasis?” “Me gusta.”) When Nirvana comes on, Roy confirms the death of Kurt Cobain by using his finger gun to blow his brains out. The car slows when we get stuck behind a Rico Pollo truck advertising frozen chicken nuggets and spewing black smoke.Virgilio Martínez\nPhoto by Jake LindemanOver my weeklong trip to the Sacred Valley of Peru, Roy takes me to all the sights because I’m too anxious to drive, especially on these twisting narrow roads. We go to the Maras salt mines, to the ruins at Ollantaytambo, to the textile town of Chinchero, where a jaded weaver at a tourist market smashes a beetle in her palm, mixes its guts with lime juice, and smears this vibrant red lip stain haphazardly on her lips. And we drive twice from Cusco to Mil. I’ve never planned an entire vacation around one restaurant. It feels, because it is, extravagant. I’m not “used to [dining] in restaurants with Michelin stars,” as one TripAdvisor review for Mil reads, nor have I “been to over 20 of the top 50 restaurants in the world,” as another reads. I’m on assignment, chasing a tip from an ex-coworker who had one of the best meals of her life at Mil, amid restaurant-industry chatter that this place would surely make the list of Latin America’s 50 Best Restaurants in 2019.Roy and I pass women selling bushels of quinoa and oblong Andean tomatoes. We pass the construction site of a controversial airport that could transform the remote area. Mostly we pass by hundreds of dogs. The Sacred Valley is overrun with mangy strays who wait by cafés for stale empanadas. Roy does not approve but tells me the politicians say they’re doing something about it. I ponder what that means as the air outside gets thinner.Roy drops me off in the gravelly parking lot at Mil. I spot Virgilio Martínez in the yard, standing casually in what happens to be exactly where a cinematographer would pose him for the opening shot of a movie: at the breathtaking (not an altitude joke) overlook onto the ruins of Moray, a stadium of concentric circles that stack upward. These are Inca terraces—shelves built into a mountainside—that most archaeologists theorize Incan priests and scientists used to study crops in different conditions. I don’t want to desecrate it with adjectives, but the sight of it makes me feel utterly inconsequential. Virgilio watches me take it in with an expression of pride and bemusement. He’s wearing skinny black jeans and a T-shirt with a cherry blossom print on the pocket, picked up in a Japanese airport. He shrugs. Some things are inconsequential.Virgilio—the g in his name is pronounced with a heat that could fog up a bus window—is famous for his Lima restaurant Central, where each dish represents one of the country’s diverse ecosystems, the menu arranged in ascending altitude. Virgilio was born in Lima, but no story of his life is complete without mentioning his early career as a semipro skateboarder, which ended in broken bones/dreams. He left Lima for Le Cordon Bleu in Ottawa and took his first kitchen job flipping crepes and shucking oysters, which, to young Virgilio, was as thrilling as a half-pipe. From the late ’90s through the early 2000s, he worked the line in fine-dining joints around the world, including Lutèce in New York, Can Fabes in Spain. At home in Peru, terrorism raged in the mountains; a majority of the people killed were farmers.A cactus-and-oca-root dessert\nPhoto by Gustavo VivancoAfter feeling frustrated cooking Peruvian food in Spain, where he couldn’t easily source his country’s ingredients, Virgilio came back. He traveled to every corner of Peru, home to nearly 100 microclimates (e.g., the sunny side of a mountain versus the shadow of an Inca terrace). Central opened in 2008 with a menu that Virgilio later realized was all over the place, overinfluenced by his travels, his ambition. He cut out the dishes that felt plucked from France or Singapore. Now everything that touches your lips comes from Peru, even if you kiss the table.Central hit No. 4 on the World’s 50 Best List in 2015. In 2016, Netflix called. In an episode of Chef ’s Table, Virgilio stars as the poetic and patriotic forager, an obsessive (which he is), hunched over beads of algae he’s eager to experiment with. During the filming he’d just begun plans for Mil, which opened in February 2018. The restaurant would follow Central’s Peruvian ethos, focusing on the food of the Andes, grown on a farm on the property with the collaboration of the two neighboring communities: Kacllaraccay and Mullaka’s Misminay. Sixty percent of Mil’s space would be dedicated to Mater Iniciativa, the restaurant group’s research arm.Because it takes diners, and staff, more than an hour’s drive to get to Mil, the restaurant serves only lunch, for up to 35 people. Every meal begins with a tour of the Mater Iniciativa offices. There’s a display table with a handful of varieties of local corn, each a different color and kernel size. We meet the “potato whisperer,” Manuel Choqque, who shows us a gradation of purple potatoes that increase in nutrients as their hue deepens. Manuel is currently performing plant sex moves that will merge a tomato and a potato (!!how!!). Then we walk through the open-air courtyard, past the bathrooms where I’ll wash my hands with coins of coffee soap, and into the dining room.The first time I visit Mil, lunch is a collaboration with three other Latin American chefs, something to do with Belmond hotels. It draws a crowd of chef-worshipping international-food-influencer types (cough, World’s 50 Best voters). Instead of sitting down at the table, one diner roams the place taking 900 photos, while a dude in shorts sketches and then paints every dish at the table. The energy is high and schmoozy. Virgilio chews coca leaves in the side of his mouth and zooms around checking on diners, staff, the guest chefs; he walks with a forward tilt, as if still on a skateboard.Resident pup Oca Lucia patrols the window\nPhoto by Jake LindemanBut when I return the next day, there’s a quiet, monastic feeling in the dining room. One wall displays a yarn hanging; there’s a fireplace full of twigs. Futuristic spa music plays, but it soaks into the background. Wide windows look out onto the mountains, while an interior glass wall lines the inner courtyard. I can turn my head and see a fluffy white dog named Oca Lucia napping in a sunny windowsill on one side of the building and gray rain clouds forming behind the mountains on the other.The service staff flank the walls like chaperones. Water is refilled an inch at a time. When you step out to use the bathroom, napkins are folded and positioned to drape off the table’s edge. If there’s a draft, a woolen blanket is brought for your shoulders. It takes all my willpower not to sigh, laugh, or die in my seat when a flea-size cube of red chile is tweezed off the table in front of me.There are eight altitude-climbing courses, known as “moments.” Each re-creates an ecosystem in the Andes, where there are intense freezing winds, blistering sun, and soil-drenching rain. The overriding character of the food—and the people—of the Andes is resilience. Which leads me to the first “moment”: Preservación.A coca pancake filled with fava beans\nPhoto by Jake Lindeman“We’re beginnin’ with chuño,” introduces one of the servers, Jessica, whose North Carolina accent intertwangs with her fluent, fluttering Spanish. (Jessica visited Peru when she was younger and fell in love with it, adopted it as her home. She also teaches the Mil team English, which might mean they’ll all end up speaking with a deep Southern accent.) When I was decoding the menu later with the glossary in the Central cookbook, I read that chuño can translate from Quechua as “potatoes passed from ice to the sun”—a reference to the process of naturally freeze-drying potatoes outside until they turn into prehistoric-looking white rocks. Chuño is the ultimate storage crop: They can last up to 15 years. Preservación is an upward-sloping snackscape: spongy green coca bread (coca is the herb that kept me from altitude sickness but also yes, what cocaine is made from) filled with fava bean purée, tie-dye-pink elderberry butter, sachatomate uchucuta (chile sauce), two mochi-like cubes of caramelized corn cakes, and two airy chuño chips. If I were to write a master’s thesis on it, I’d say: The contrast of this ancient potato against the straight-from-out-that-window fava bean was a comment on time, on fortitude versus fragility. But yeah, the chips were so good.While the chuño has held on for all of these years, other Peruvian “products”—the Mater team’s term for crops—aren’t so hardy. A small group of biologists, botanists, and anthropologists at Mater catalog indigenous Peruvian products, documenting the culinary use and cultural context of every herb and tuber. They work with farmers to revive those at risk of extinction and aim to introduce as many as possible to a wider audience. So far they’ve recorded more than 300 ingredients, at least 285 of which are on the menu at Virgilio’s restaurants.Malena Martínez\nPhoto by Jake LindemanVirgilio’s sister Malena oversees Mater, as well as the management of his restaurants (three in Lima including a cocktail bar, plus Mil). While Virgilio was skateboarding, Malena went to medical school in California. When I meet her in Lima, the outline of 30 Peruvian ingredients for an upcoming book is listed in marker on one of the glass walls in her office. Staffers keep popping in to ask her questions. Malena has all the answers. “She’s the library—or the bible,” one of the cooks later tells me.It’s clear that Malena’s levelheaded leadership amid Virgilio’s buzzy hyperactivity is what keeps these restaurants—and Virgilio himself—from combusting. She is organized, cautious; meanwhile, he admits, “Sometimes I go blind into places.” He told me the two have meetings every 40 minutes, maybe just to talk about life. When the servers can identify every edible flower petal on the plate, it’s Malena, the fount of knowledge, behind them. But when food conferences want to talk about Mater, they invite Virgilio. “She doesn’t receive the credit,” he told me, “because people prefer to see a chef. I feel uncomfortable with that.”It arrives at the table, a beautiful rock. It’s a Mil version of the huatia, an earthen oven usually saved for harvest celebrations. Traditionally, whatever is cooking inside (potatoes and fava beans, let’s say) gets buried in the soil it grew in. The stones collapse around them, creating a natural pressure cooker. At Mil, a single carved stone is the oven, and inside are two tiny potatoes, served with two sauces: a vibrant, acidic tomato-chile uchucuta and a green, grassy herbal chincho dip. Two potatoes. Out of 4,000.The dining room at Mil.\nPhoto by Jake LindemanThe twin-brother chefs Luis and Carlos Valderrama carry out Virgilio’s visions at Mil when he’s in Lima. Virgilio lives above Central with his wife, Pia León—the chef of the slightly more casual Kjolle, which is also in the building—and their son, Cristóbal. After years of working at Central, the twins can translate Virgilio’s cravings for new dishes, ideas that fly into his brain like snippets of last night’s dream. They do a hilarious impression of him: “I’m thinking about jelly. Maybe, in a natural way. Think about a way to give me this texture, okay?” “Perfect, chef!”Luis and Carlos explore Andean ingredients as they come into season with the help of Santiago Pillco, one of the leaders of the local communities, who oversees the work on the farm. Santiago wears a Mater Iniciativa vest and a tan hat. I met him outside on my first day at Mil. “How did you hear of me?” he asked me. “Some guy named Virgilio mentioned you,” I said. “Who’s Virgilio?” Santiago giggled. Pure grandpa stuff. Virgilio is “like a brother,” he said. “I want to share how I work with [the chefs at Mil] and then share the knowledge of those ingredients with the world,” he said. “If we weren’t sharing, we’re losing our identity.” He gestured toward the mountain behind us, where his wife, Seferina, was in the fields with a botanical researcher.Some of those 4,000 potato varieties\nPhoto by Gustavo VivancoIt wasn’t always this rosy utopia. Before Mil, the space was once used to raise vicuñas, a relative of the llama (“They all died or something,” per Virgilio). A restaurant group bought it, but nothing ever took hold. It was rented out for parties. Rich people came and went and made a lot of noise, fueling distrust in the communities. “I’m considered a white guy here,” Virgilio says. “These people have been cheated for years. Their identity, their value— everything was trying to be erased.” He’s referring to terrorism but also to the rise of industrialized food, which cut the demand for kiwicha and other crops we’d stamp “heirloom.”Anthropologist Francesco D’Angelo, left, and community leader Santiago Pillco in the fields outside Mil\nPhoto by Jake LindemanTo strengthen the connection with its neighbors, Mater hired a Peruvian anthropologist, Francesco D’Angelo. Francesco is 27, with waist-length dreads and a grad student’s bright-eyed idealism. He’s hyper and excitable like Virgilio but more social and outgoing, whereas Virgilio can get lost inside his own head. Francesco spent nine months getting to know everyone, how their society functions. He can point to distant fields and tell you whose farm is whose and what they’re growing. One of the most important things they learned about the Andean people, Malena told me, was that “the hierarchy is not well-defined, but they understand that they are all valuable, and that each person has a function.” That horizontal structure dictated how Mater organized Mil, where the farmers work on a rotary system, taking turns in the fields, and earn 50 percent of the harvest.Andean cheese in Diversidad de Maiz (Diversity of Corn)\nPhoto by Jake LindemanAround an hour in to this $165 eight-course lunch, we reach the halfway point of the menu: Diversidad de Maiz. It’s an homage to the farmers’ midday meal: a few bites of grilled, squeaky, Halloumi-like Andean cheese; a bowl of big bursting-sweet corn kernels; green herb sauce; and pink, yellow, and purple corn chips to scoop everything up with. Every bite, every kernel, is bonkers. I wonder if my fellow diners, including a couple with their faces painted for some reason, are writing their TripAdvisor reviews and Instagram captions in their heads yet. I wonder what the people who grow this chullpi (yellow corn) think of this dish. Francesco laughs when he remembers how Virgilio cooked the Mil menu for the communities before the restaurant opened, and only half would try the lamb tartare (raw meat, are you crazy?) or the frozen dessert (too cold!). But Nery Amau, one of the service staff whose parents own a farm nearby, tells me Diversidad de Maiz is her favorite dish.There are other dishes I won’t swoon over in such detail but that I’ll never forget. Shreddy pork belly. Dense tarwi (bean flour) bread that looks like a small cake but is as heavy as a paperweight in my hand. A crispy salad with green caviar bubbles of cushuro, an algae found in high-altitude lakes or ponds, flavorless but fascinating. A supremely fresh lamb tartare in which I can taste every muscle bead. That’s followed by a shot of mata cuy, which means “kill the guinea pig” and is a botanical-infused sugarcane liquor to settle the stomach after a meaty meal. After lunch I have the best hot chocolate of my life. The silky liquid against the craggy stoneware mug is a textural mindf*#%.Inside the chocolate lab at Mil\nPhoto by Jake LindemanOn my way out, I exit through Mater’s offices and pick up a few Mil chocolate bars from the store. The staff is boxing everything up for two weeks of vacation, during which a group of them will go to Quillabamba, a town north of Cusco, to learn more about cacao. Others will travel to the jungle of Puerto Maldonado, where Virgilio is plotting his next restaurant. No one will sit still. Except maybe me. I immediately fall asleep in the back seat during our commute to Cusco. Mercifully, Roy turns down the Nickelback.My last two days in the Sacred Valley, I climb the steep and marvelous ruins of Ollantaytambo, once an Incan emperor’s estate, and visit Machu Picchu in the pouring rain. I think about that Yale guy who “discovered” it even though there were farmers living there the whole time. As with the site at Moray, no one knows exactly what Machu Picchu was. They dust the fossils and x-ray old bones. The consensus is that Machu Picchu served as a luxury resort town for the royals and the richie rich (the higher you are to the sun, the higher to the gods), until something suddenly drove them away. A drought? The intricate feat of stonework was abandoned. A tourist in a tube top takes a selfie in the low-hanging clouds, and I wonder what the hell happened here. I’d like to know, just a little bit more.Explore Bon AppétitRestaurantsTravelPeruvianRead MorecultureStop Telling Me To Travel Like a Local, Okay?By Mari UyeharacultureEating My Way Through Atlanta, I Learned It’s Much More Than Black and WhiteBy Rembert BrowneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-30", "author": ["Condé Nast", "Alex Beggs"]}