{"id": "6dda9d663d9a05f135f0e91601fff99b", "url": "https://www.bonappetit.com/story/my-grandmothers-rule-for-love", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "My Grandmother’s Very Specific Meat-Related Rule for Finding Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Grandmother’s Very Specific Meat-Related Rule for Finding LoveFeminism expressed in the medium she knew best: food.By Cynthia R. GreenleeFebruary 14, 2018FacebookTwitterEmailIllustration by Grace LeeFacebookTwitterEmailGrandma Daniels did not believe in that dusty, sexist adage about the stomach being the expressway to a man’s affections. She wasn’t concerned with the male appetite. And it showed in her one unbreakable rule of courtship.Sitting at her linoleum-top table, she laid down the law to me as I ate another piece of her seven-layer chocolate cake. She slowly peeled an orange—her answer to an apple a day—and patted her mouth daintily with a napkin.“When you go to a man’s house to meet his family for the first time, if they don’t give you two pieces of meat, you get up and leave,” she said firmly. She punctuated with pursed lips and a nod, her gray hair bun dipping in affirmation to her own statement.If only one piece of meat was offered, say, a measly chicken wing, I was to decamp immediately and remove that man from the romantic running. Gizzards or neckbone absolutely didn’t count, even if you loved those pieces; it needed to be two pieces good enough to serve to the pastor on Sunday. And Grandma Daniels, raised though she was in a poor remote South Carolina town, coveted lobster and a juicy morsel of duck.She had earned those prime pieces. My grandmother was the “mother” of the family’s African-Methodist Episcopal church just down the road, a position that required decades of diplomacy over potluck fundraisers and Sunday school disputes. She schooled me in the subtle arts of Southern etiquette, how to “be Jesus” to other people, including eating someone’s inedible food with nary a complaint.So to hear this no-negotiation dating tip from my calm, reasonable grandmother, whom local lore said never uttered a cuss word in her 96 years on earth, was surprising. In my mind, I wondered if her proclamation was a geriatric slip of the tongue or the hubris of the elderly, who say what they want because they’ve outlived almost everyone else. This was not the Southern etiquette I knew.Born in 1917 in northeast South Carolina, Grandma Daniels was born into a rural African-American family that had only two children, she and a brother. As the beloved daughter in a small household, she never wanted for attention. Or meat. When she was a young girl, Grandma used to do Sunday visits—sometimes church business, sometimes courting—with her preacher father. If there was a meat problem, she’d give him the signal. He would go outside and hitch the horse and buggy.Grandma Daniels’ “two pieces of meat” rule was a pragmatic reflection of her rural farm upbringing where scarcity and hunger could be one week of scorching sun or rain away. After all, one didn’t want to marry into a family that couldn't feed itself anymore than one wanted to marry into a family that wouldn’t extend the kind of hospitality that allowed guests to eat their fill.Marriage was not just a happy union; it was a merging of families and futures. And she didn’t want any woman (and her children) who had gone hungry to stay hungry, or any woman who had had ample food to lose it. A full larder—in her mind, a smokehouse, fields of produce, grapevines, cows for milk, chickens and hogs—was a prerequisite for the marital contract. To this day, my mother says with pride, “We never lacked for meat.”But first and foremost, whether baking her Saltine-crust macaroni and cheese or her collards with that hunk of hamhock, food was Grandma’s love language. My grandmother was a housewife, seamstress extraordinaire, mother to six and aunt to many, and the administrator of our family farm. She kept the books, soothed children, and cooked huge breakfasts—often filling literal metal buckets with fried chicken—for the laborers who tended the tobacco, corn, and wheat. That tall chocolate cake was always waiting for me, when I arrived to visit. And there would be a Titanic-size slice wrapped in aluminum foil when I left to go home.I felt Grandma’s position acutely when I got engaged. I should have employed her romance litmus test myself. My prospective mother-in-law barely offered me a glass of room-temperature water whenever I entered her home. I was low on the totem pole. I told myself that she was trying to make me feel at home by giving me free rein in her refrigerator, but I knew better. She was telling me there was no room for me at the family table. My grandmother would have seen the warning signs and probably steered me away.The two-pieces-of-meat rule was my grandmother’s personal feminism expressed in the medium she knew best: food. It was a radical declaration of self-esteem. She would forge her own terms of being in a new family. I imagined that Beyoncé would have made a similar demand had she lived in horse-and-buggy times.Grandma Daniels rejected the idea that women should get less of anything: whether education, respect, or protein. She would not pretend she had a preference for salad or lighter fare. There would be no skimping on her plate. Her appetite and preferences mattered. I remember her meat demands whenever someone says I’m too much. Because before anyone said the catchphrase, “Know Your Worth,” she knew that she was worth a seat at the table, a full plate, and then some. She would cook, but she would also be served.Explore Bon AppétitValentines DayRead MorecookingMy Grandmother's Pineapple Dainties—a Recipe from the Past That Still Holds UpBy Ali RosencultureHow My Grandmother Taught Me the Rules of Baking and LivingBy Jocelyn Delk AdamscookingRecreating Grandma Minnie's Mountains of Italian Christmas CookiesBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Cynthia R. Greenlee"]}