{"id": "6dddbf7fd27869efa0c28104e5bf9c11", "url": "https://www.bonappetit.com/story/best-chicken-dredge", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "I Had to Eat A LOT of Fried Chicken, but I Finally Found the Best Fried Chicken Dredge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Fried Chicken That Stays Crispy, Reach for Rice FlourI had to eat a lot of popcorn chicken, but I finally found the perfect dredge.By Asha LoupyFebruary 10, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Some people go to Super Bowl parties for the game (or the halftime show), but me, I go for the food. The right game day spread can be magical—a wonderland of queso-doused nachos, slow cookers full of party meatballs, the obligatory veggie platter, dips galore, and, the pièce de résistance of football food: popcorn chicken.On any other day, I’m a wing girl, but on game day, give me the sauciest, glossiest, crispy popcorn chicken because the last thing I want is a plateful of bones. The one catch? When popcorn chicken is over-breaded, it can lose any semblance of crispiness and be straight up gloopy after only 20 minutes on a buffet. It doesn’t even keep its crisp until halftime.When developing my Harissa-Honey Popcorn Chicken, my goal was not only to achieve that elusive crispy-gone-just-barely-soggy bite, but also to fry up a snack that could withstand a couple hours of feasting (because, whew, football games are long). The key to popcorn chicken built for game day is a thin, shatteringly crisp outer coating that doesn’t overpower the chicken but that provides enough stability to be sauced. This breading is built in two steps: (1) the marinade, and (2) the dredge.First up, the marinadeThe marinade, which also doubles as a batter here (that’s right, it goes straight into the dredge), imparts flavor and tenderizes the meat from the inside out. The three main marinade components are buttermilk, egg, and cornstarch—the buttermilk aids in juicy tenderness, while the egg and cornstarch start to build the foundation for that final crispy exterior.From there, the flavorings are up to you. For me, harissa and lemon are best mates in the kitchen, so my marinade is bolstered by finely chopped preserved lemon, lemon zest, and garlic. But as long as you keep the buttermilk, egg, and cornstarch, you can go with your favorite hot sauce plus garlic and some finely chopped tender herbs, or with lime zest and ginger.And now the most important part: the dredgeWhen developing this recipe, all-purpose flour seemed like a natural choice. It makes the dreamiest buttermilk fried chicken, after all. My first test—breaded in all-purpose flour—was delicious hot and freshly sauced, but as it sat out, the sauce and the breading melded together into a tasty but soggy bite an hour later. Seasoned all-purpose flour is still king when enjoying fried chicken unadorned, but the addition of sauce and time nixed it from the running for reigning popcorn chicken champion. So, if not all-purpose flour, then what?For the second test, I drew inspiration from a few of my other favorite styles of fried chicken: Hawaiian mochiko chicken, Korean fried chicken, and Taiwanese popcorn chicken, all heralded for their ultra-crispiness thanks to a coating of sweet rice flour, rice flour, or starches like tapioca, potato, and cornstarch. I didn’t have any of the sweet rice flour classically used for mochiko chicken on hand, but I did have white rice flour, which is often used for Korean fried chicken. Along with a hearty dose of cornstarch, the rice flour became the base of my breading.Bob's Red Mill White Rice Flour$10 at AmazonBecause rice flour doesn’t absorb as much oil as all-purpose during the frying process (if you’re frying at the right temperature, of course!), it results in a less greasy final texture. The cornstarch works to keep things light and airy, and it’s fine enough to nestle into every nook and cranny without getting thick or gloppy. The cornstarch also absorbs some of the moisture from the marinade (a task that’s harder for just rice flour alone), creating those sought-after craggy bits when fried. This mix coated the chicken pieces juuust right and fried up to crispity, crunchity, ASMR perfection. Immediately after being sauced, these nuggets were already more crunchy than the all-purpose flour, but would they fall victim to the dreaded sogginess factor? Lo and behold, two hours later, the popcorn chicken still retained an audible crunch. Dredge match winner: Rice flour and cornstarch!Before we bid adieu, let’s talk sauce real quickIs there such a thing as oversaucing? Yes! Keeping that ethereal bite is all about balance. Just like the breading, you’re aiming for a thin, flavor-packed layer of sauce on the outside of each piece of popcorn chicken (sogginess, be gone!). If you are someone who likes things extra saucy, make twice the sauce and serve half on the side for drizzling à la minute. Sure, that sauce may be on the bench for now, but it’s ready and eager to get in the game when the coach (that’s you) calls.It’s go timeHarissa-Honey Popcorn ChickenSaucy and glossy. Sweet, spicy, and sticky. Shatteringly crisp. And probably more exciting than the halftime show.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-10", "author": ["Condé Nast", "Asha Loupy"]}