{"id": "6de198ec86918c89b14a45eaca550d65", "url": "https://www.bonappetit.com/story/eating-for-endometriosis", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Eating For My Endometriosis When Answers Are Scarce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLearning to Eat for My Endometriosis When Answers Are ScarceI was prepared to face the reality of cutting out anything—alcohol, sugars, dairy, pasta—to stop the pain. By Kirsten SlyterNovember 11, 2019FacebookTwitterEmailIllustration by Bárbara MalagoliFacebookTwitterEmailSome days at work, my endometriosis won’t let me sit still. As I research and write, I stretch my tight hips and hamstrings in a pigeon pose at my standing desk, trying not to draw too much attention to myself. The pain in my pelvis is like a monster eating at my insides. It’s a pain I can usually work through with some naproxen and my trusty heating pad. Pain like this was the first kind of endo pain—shorthand for endometriosis—I experienced. The kind a heating pad could handle.Aside from the gnawing pain, sometimes my ovaries feel like they might explode. Earlier this year, I had a seven-centimeter ovarian cyst that slowly hemorrhaged, releasing blood into my pelvic cavity. I woke up at 3:00 a.m. one night with my entire middle on fire, a burning that left me throwing up in my stairwell. Even with multiple doses of dilaudid and morphine in me I ended up crying in the emergency room and calling my mom. This wasn’t totally unexpected. Cysts are commonly associated with endo. And since I changed my diet, the visits to the ER have decreased, as has the pain. I think about that, and the pain, every time I pick up a fork.Endometriosis is the growth of endometrial tissue outside the uterus, where it can’t be shed. Some women have little endometrial tissue but lots of pain, while others with a lot of endo tissue and lesions live life relatively pain-free. Some conceive easily, some don’t. Or can’t. Even a hysterectomy—total removal of the uterus and sometimes the cervix—isn’t a cure. It’s an unpredictable disease. Bodies are fickle.After two surgeries in less than two years, I’d do anything to keep the endo from growing back.It was in June of 2018 that I saw a dietician at my OBGYN’s office. She was the first clinician I’d seen in years who wanted to do something about the pain rather than just cut it out of me. I wrote down what I ate on a day-to-day, week-to-week basis while in the waiting room. I was excited, giddy almost. I wanted to do something proactive about the aching and cramping, something more than just making doctor’s appointments and picking up prescriptions. I mentally steeled myself for bad news, prepared to face the reality of cutting some foods out—alcohol, sugars, dairy, pasta in any form.As I sat down in the cushioned chair next to the OBGYN’s desk, I silently chanted to myself, You can live without wine. You can live without bread. No wine, no bread, no wine, no bread.But she didn’t tell me to take out anything from my diet, only add. To experiment with lentil pasta, zoodles, drink more green tea, eat more mushrooms and avocados. Foods full of good fats and estrogen that can balance out the immune system and hormones, she said.After two surgeries in less than two years, I’d do anything to keep the endo from growing back.I would try almost anything rather than wonder what if; wonder if I could save myself a surgery, avoid a few doctor’s appointments, dodge a few medical bills, and maybe, eventually have a baby. But all these things are secondary to just ditching the grinding pain.During my junior year of college, I ate a lot of avocados. I ate them in a sweet potato hash with chicken sausage, kale, and goat cheese—all my favorite things in one bowl. I added avocado slices I bought from Trader Joes under a sign that said, “AVOCADOS. GREAT FOR PARTIES!”I thought that was funny, especially since I wasn’t hosting parties. I attended a conservative college. I lived on a street called Lydia Drive in an apartment with five girls and one bathroom. I shared a room and a bunk bed with Emilee. While I made my sweet potato hash for dinners, she stuffed peppers. We worked out nearly every morning together, going for runs and doing “Tone it Up” workouts on YouTube. We did our makeup and hair at tiny desks at 6:45 a.m., put on our shoes and coats at 7:15 and left to walk to class at 7:17, together.We were both struggling. When we cooked together in the crowded, dishwasher-less kitchen, we discussed how she hadn’t had her period in over six months. No, she wasn’t pregnant. But she was worried.She visited OBGYNs, underwent numerous tests, and bought expensive supplements. Still nothing. I didn’t know what to tell her.I ended up bleeding for a solid six months that year. In February, in that one-bathroom apartment, I began having pelvic pain every day, all day. It was a heaviness that would not let me sit still in class for more than thirty minutes, would not let me sleep. Sick days spent resting did nothing to alleviate the pain.“It’s a urinary tract infection,” the urgent care doctor told me at first. Ten days of antibiotics.Two weeks later, “A kidney infection.” More antibiotics.After two months, a family physician less than one block from my apartment correctly diagnosed the gnawing pain—endometriosis, the growth of endometrial tissue outside the uterus where it can’t be shed. The ultrasound revealed several fibroids in my uterus—muscly, benign tumors leaning on sensitive nerves.Though most women with regular periods develop one or two functional cysts throughout their cycle, they generally go away without any pain. But ones formed from endometrial tissue, endometrioma cysts, filled with blood, can cause more complications if they rupture or hemorrhage.Later, at home, I prepared my sweet potato hash. I grabbed an avocado. I split the leathery skin with a sharp knife. It was a beautiful avocado, not too soft, not too hard. But inside it was rotten.  Avocados are fickle. They say that the key to choosing an avocado is not to be deceived by the pretty exterior and instead check under the stem. If it peels away to reveal a spring-green, then the avocado is ripe.The family doctor prescribed me meloxicam and I took it each morning, like an old person with arthritis. I was young, but I was in pain every day. Pain every day—that’s what I told the boys I went on dates with. I wasn’t sure how much to tell them.I often feel trapped in my own body—when it won’t let me go out with friends, sit down for more than 30 minutes, or sleep.I remember my second date with Marcus, junior year. We went out to eat close to the state university.  I had fish tacos. As we walked out of the restaurant door, he asked me how many children I wanted. This was a ridiculous question for a second date, of course. I hadn’t told him about the endo yet, about the possibility that I might have just one ovary after the surgery in two months. One, or zero. I was only twenty, with three semesters left in college. “I don’t know. I haven’t really thought about that,” I told him as we weaved through high-tops. Around us, people ate french fries.“What?!” he said, surprised. He already knew how many children he wanted. Four.I laughed.Though Emilee got married and moved away, I know she still deals with erratic periods and infertility, and as far as I know, she doesn’t have doesn’t have a definite diagnosis to help her find solutions.It’s hard to be 20 or 22 or 24, when your body is just starting to do all the normal, life-giving things it’s supposed to, only to realize it might not work for you. I often feel trapped in my own body—when it won’t let me go out with friends, sit down for more than 30 minutes, or sleep.I tried to grow an avocado tree from the seed once. The white roots sprouted after a few days of letting the seed sit in a glass of water on my windowsill, but that’s as far as it got. Maybe it wasn’t getting enough sun.Avocados are a flowering plant, originating from the warmth of central Mexico. One avocado seed is enough to grow an entire avocado tree with just water, a jug, and a few toothpicks. I know people who have made it work, who have grown a tree from a seed in the windowsill. Under the right circumstances it doesn’t take much at all.Since that visit to the OBGYN’s dietician I’ve learned a lot about anti-inflammatory diets, and the Mediterranean diet (a type of anti-inflammatory diet), and the impact they can have for those with a variety of diseases and conditions, including endometriosis.Eating more leafy greens, healthy fats, and whole grains have been widely recommended to reduce the inflammation associated with chronic conditions that cause increased pain, low-energy, and even irritability. Sugar, on the other hand, has the opposite effect of leafy greens for inflammation.In January of 2019 I committed to 21 days of no sugar, no alcohol, little meat, and a veggie-heavy diet alongside several other women I connected with through social media.During the 21 days, I ate a lot of fish and drank a lot of kombucha. I had no sugar (but I did have a little caffeine). It was a tough 21 days, especially when attending a wedding on the second day, but it was worth it. I truly felt better. My pain was less frequent and more manageable, and I was finally convinced that diet could affect my endometriosis symptoms.I’m not quite as strict since the end of January. I am always on the hunt for new leafy greens, and mushrooms are always in my cart. I limit my pasta at home and mostly eat brown rice pasta when I do. But pasta is my favorite food, so sometimes I splurge. Every time I choose ingredients for a dish, every time I enter a restaurant and pick up the menu, I search for the least offensive foods—the ones that will heal, not hurt.Other women I know with endometriosis swear by quitting dairy or gluten, and though I limit my dairy, sugar is still my worst enemy. Reducing it has had the greatest impact. A square of 80-percent dark chocolate after lunch won’t hurt me, but a few churros con chocolate in a small cafe in Malaga, Spain definitely did, and one sleepless night of grinding pain was not worth it.Will my diet completely stop ovarian cysts and endometrial tissue from growing? Will it eventually stop the pain? I don’t know. I’ve heard endometriosis called a “disease of theories.” Right now, there’s simply not enough research or resources to really, factually know what provides relief, much less a cure.It’s very hard to tell how endometriosis and fibroids will affect fertility until it actually matters. Ovaries—the small, five-centimeter organs that release the egg to the uterus—are integral to the process.Big ovarian cysts, like my seven-centimeter one, are notably heavier than the average one to five-centimeter ovary, putting it at risk for ovarian torsion—the twisting that is possibly lethal to the ovary. Ovary torsion requires emergency surgery to preserve the ovary, and if necessary, remove it.My mom lost one ovary, not to a monster cyst, but to endo itself. When she was 36, she underwent her first surgery for endometriosis, after years of extremely painful periods during which she would stay in bed for hours, throw up, and become delirious.During surgery, the doctor removed her right ovary. It was simply too tangled up in the endometrial tissue, ravaged from years of undiagnosed and untreated endometriosis.It takes an average of six to ten years to be diagnosed with endometriosis, though often longer for younger patients and more severe cases. I was one of the lucky ones. I was diagnosed early. And though my first surgery was not thorough, I still have most of my original parts.A woman can still get pregnant with just one ovary, but there aren't any sure statistics out there on the likelihood. I won’t truly know until I try.And my mom didn’t know either. Marrying at age 39, with one ovary, doctors told her it would take months to conceive, but she got pregnant with me on their honeymoon.Sometimes when near-strangers ask if I want babies and I feel awkward, I remember that I’m a one-ovary, honeymoon, endo baby.So I keep reading the latest studies, I continue to schedule and drive to physical therapy twice a month. I keep hoping, keep talking to the doctors that listen, keep filling up my pillbox, keep plugging in the heating pad, keep eating avocados, keep trying to grow my own avocado tree. I keep calling my mom, my grandma; keep wondering what I can grow with a seed from the ovaries I may not be able to keep.Explore Bon AppétitHealthyishessayRead MoreLifestyleAdult Acne Wrecked My Self-Esteem. Here’s How I Dealt.By Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-11", "author": ["Condé Nast", "Kirsten Slyter"]}