{"id": "6de1fe99e37ed460091adea90c5d98bb", "url": "https://www.bonappetit.com/story/my-favorite-healthy-restaurants", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "My Favorite Healthy Restaurants Are Bars | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Favorite Healthy Restaurants Are BarsRestaurant recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroFebruary 21, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,All my favorite healthyish restaurants are bars. I realized this the other day when Adam Rapoport came over to tease me about my standing desk, as he does, then asked what the best healthyish restaurants were these days. I thought about it pretty hard. I remembered the grilled mushrooms I had recently at Via Carota, that plate of braised, falling-apart chicories at King. But these restaurants, as wonderful as they are, aren’t healthyish to the core (don’t ask me why—it’s a feeling, not a science!).Then I thought about the achoïade at June, the natural wine bar that opened in Brooklyn in 2016. It’s an overflowing platter of radishes, boiled potatoes, little gem lettuce, roasted carrots, and other seasonal things served around a bowl of anchovy-laced dip, and it’s perfect alongside a glass of whatever unfiltered wine they pour me. And I thought about the melt-in-your-mouth roasted squash with burrata at lounge-y, vibe-y Bar Beau in Williamsburg, and also their kale salad (yes, I’m endorsing a kale salad) studded with pomegranates and coated in miso-tahini dressing. And I thought about the playful, non-alcoholic elixirs at Reception Bar, which take up a full half of the menu—not to mention their kabocha jook, a rice-based porridge that tastes as hearty as my morning bowl of oatmeal.Are healthyish bars a trend or just where I happen to be finding myself these days? Is the whole natural wine thing to blame? Healthyish food pairs well with healthyish wine, after all (Just look at Cellar Door Provisions in Chicago, whose staff convinced a famed natural-wine-bar owner to move there from California and open a shop next door.) Or maybe it’s all the creative, actually satisfying non-alcoholic options we have to choose from now.Whatever the reason, I’m spending more time at bars than I have since I was 22—but with fewer hangovers this time around. I go for the food, the vibes, and for how I feel when I’m there, sipping a sparkling buckwheat tonic (okay, fine, it’s a boulevardier) and snacking on a platter of perfectly prepared crudité. Honestly I can’t imagine a better way to eat right now.Another good thing to eat right now.\nPhoto by Alex Lau, Food Styling by Susie TheodorouNew on Healthyish and BeyondCellar Door Provisions is the ethical, hyperactively seasonal, ego-free, technically flawless restaurant that's positive it could be better. Winter is terrible, but I’m grateful for Butternut Squash Parmesan and Japanese Breakfast (the person, not the food). Everyone should have a house bowl. There’s finally a dedicated yerba mate bar in NYC.I’m also reading The Collected Schizophrenias by Esmé Weijun Wang, Bryan Washington on falling in love with soondubu jjigae, how the Oscars gift bags are full of weed, and myths about women and monogamy (spoiler: it’s hard for us too).Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleHex Your Ex Then Bake a CakeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Amanda Shapiro"]}