{"id": "6df96632802ecb1ab0a267ec1a127869", "url": "https://www.bonappetit.com/recipe/eggplant-with-cashew-butter-and-pickled-peppers", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Roasted Eggplant with Cashew Butter  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueEggplant with Cashew Butter and Pickled PeppersBy Drifters Wife, Portland, MEAugust 14, 20184.9(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Elizabeth CecilEmailPinterestPrintEmailPinterestPrintFairy tale eggplants are sweet, creamy, and never too seedy. They get simply roasted here, then served over a creamy cashew sauce that’s brightened with lime juice. Make this cashew butter once, and you’ll want to use it on roasted vegetables year-round. This recipe is from Drifters Wife in Portland, ME, our No. 9 Best New Restaurant 2018.Ingredients4 servings Pickled Peppers1cup distilled white vinegar¼cup sugar1Tbsp. kosher salt3mini bell peppers, seeds and ribs removed, thinly sliced crosswise3mixed chiles (such as serrano, Fresno, and/or jalapeño), thinly sliced crosswiseCashew Butter1medium shallot, thinly sliced2garlic cloves, smashed1cup cashews⅓cup extra-virgin olive oil⅓cup vegetable oil1tsp. sugar1tsp. kosher salt2Tbsp. fresh lime juice1tsp. fish sauceEggplant and Assembly3–6Tbsp. vegetable oil2lb. eggplants, preferably fairy tale, cut into 1½\"-thick wedges, halved if smallKosher salt1medium shallot, finely chopped2Tbsp. fresh lime juice¼cup basil leaves¼cup cilantro leaves with tender stems1Tbsp. thinly sliced chivesPreparationPickled PeppersStep 1Bring vinegar, sugar, and salt to a simmer in a small saucepan over medium-high heat, whisking to dissolve sugar and salt.Step 2Combine bell peppers and chiles in a medium heatproof bowl or container. Pour hot pickling liquid over and let cool.Step 3Do Ahead: Pickles can be made 1 week ahead. Cover and chill.Cashew ButterStep 4Cook shallot, garlic, cashews, olive oil, and vegetable oil in a small saucepan over medium-low heat, stirring often, until cashews are golden brown and shallots are deep golden brown, 8–10 minutes. Strain through a fine-mesh sieve into a small bowl; save oil for another use. Transfer cashew mixture to a medium bowl. Add sugar and salt and toss to combine. Let cool.Step 5Blend cashew mixture, lime juice, fish sauce, and ½ cup water in a blender until very smooth and pourable (it should be about the thickness of tahini).Eggplant and AssemblyStep 6Preheat oven to 450°. Heat a dry large cast-iron skillet over medium-high. Pour 3 Tbsp. oil into pan and swirl to coat. As soon as it begins to smoke, carefully add eggplants, cut side down, puzzling together to fit into a single layer. (Work in 2 batches if needed, adding another 3 Tbsp. oil to skillet between batches.) Cook, undisturbed, until cut sides are golden brown, 4–5 minutes.Note: When it comes to eggplants, we generally find the smaller the fruit (yes, it’s a fruit!), the better the flavor and texture. And of all the miniature varieties cropping up at the farmers’ market right now, we’re especially digging fairy tale eggplants. They’re palm-size and streaked with purple and white. Unlike large globe eggplants, which can sport tough skins and mealy, seedy insides when cooked, fairy tales are ideal for roasting or confiting whole until tender and creamy.Photo by Chelsie Craig, food styling by Judy ManciniStep 7Transfer skillet to oven (if working in 2 batches, return first batch of eggplants to skillet). Roast until eggplants are tender, about 4 minutes; season with salt. Add shallot and lime juice and toss well.Step 8Spread ½ cup cashew butter on a platter. Arrange eggplants on top. Scatter basil, cilantro, chives, and 1 Tbsp. drained pickled peppers over.How would you rate Eggplant with Cashew Butter and Pickled Peppers?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis was sublime. I can see using the cashew butter and pickled peppers on many other veggies.\nK. MullenAlexandria, VA11/22/2021This Turned out great for me, I think it works best if you have a high powered blender like a vitamix or a Blentec... all the ratios were fine for me and I saved the oil in a jar of leftover sundried tomato oil for future use. IN LOVE with this cashew butter, I think i'll do something with tofu and veggies with it. I only had a lb of the eggplant so I have a lot leftover. Definitely worth a try!VcpwaltersPhiladelphia8/24/2019This dish is in absolutely must to make. Served it as an appetizer for a dinner party we had at home and it was a total crowd pleaser. Looks great on the plate and the flavors are perfect. caitlin57Napa, CA11/20/2018This was simply amazing. My guest said it was the best meal he had ever had. I would not change anything!ODawnaOttawa, ON CANADA11/5/2018Great recipe. Made it as called for and it was a hit with my best buds at dinner. Have alread been asked when am I making more? Good with lots of vegetables, chicken and fish.Used the same oil for cockong the egg plants.fishhunter99Atascadero Ca9/17/2018As the other commenter noted, the ratios were a bit off for me too. I also had way too much shallot oil while the cashew butter came out really lumpy. Otherwise, this makes a delicious combination.AnonymousNew Haven, CT9/11/2018This is delightful. I love the various textures. The tart peppers balance the creamy cashew butter. The fresh herbs are a nice touch. I needed about a cup of water to get the right texture of the cashew butter. I added some of the strained oil to the cashew butter. In the future, I will probably use less oil to brown the cashews and shallots and I may toss the eggplant in oil and roast it in the oven on convection roast. kathytsYardley, PA9/9/2018Explore Bon AppétitAmericanTurkishMiddle EasternEggplantVegetableBell PepperCashewNutChileBasilHerbs & SpicesSideMainVeganVegetarianDairy-FreeGluten-FreeHealthyishRoastSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Drifters Wife", "Portland"]}