{"id": "6dfea6c3add30e8f98eadcf87072dddf", "url": "https://www.bonappetit.com/recipe/party-ready-pork-roast", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Pork Roast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesParty-Ready Pork RoastBy Molly BazDecember 12, 20184.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintInstead of using one larger bone-in pork loin roast, this recipe calls for two smaller ones. This allows for more exposed surface areas, which decreases cooking time and develops a delicious golden brown crust. If you can’t find a roast with the chine bone attached (but always ask! At a store like Whole Foods it might not be available in the case, but you can ask the butcher to please cut it for you), a frenched roast will also work. We prefer the bone in to help retain the meat’s moisture, but the recipe can be made without it.Ingredients8–10 servings23-lb. bone-in pork loin roasts with chine bone attached, fat trimmed to ¼\" thick1Tbsp. black peppercorns1Tbsp. fennel seeds2tsp. crushed red pepper flakes1tsp. ground cinnamon3Tbsp. Diamond Crystal or 5¼ tsp. Morton kosher salt, plus more½cup (1 stick) unsalted butter3heads of garlic, cut in half crosswise, divided6large sprigs thyme, divided5medium leeks, tough outer layer removed, white and light green parts only, rinsed, cut crosswise into 1\"-thick rounds3lb. small Yukon Gold potatoes¾cup extra-virgin olive oil2bunches Tuscan kale, ribs removed, leaves torn into large pieces2Tbsp. apple cider vinegarFlaky sea saltSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Lightly score fat cap of each roast in a 1\" crosshatch pattern, being careful not to slice into meat.Step 2Toast peppercorns and fennel seeds in a small dry skillet over medium heat, shaking pan occasionally, until fragrant and just beginning to smoke, about 4 minutes. Transfer to spice mill or mortar and pestle. Let cool slightly. Add red pepper flakes and cinnamon and finely grind.Step 3Using a skewer or paring knife, poke several holes into meat on all sides (this will help the seasoning penetrate; don’t be afraid to puncture the meat deeply). Season roasts with 3 Tbsp. Diamond Crystal or 5¼ tsp. Morton kosher salt, then rub ground spice mixture all over. Wrap tightly in plastic wrap and chill at least 8 hours.Step 4Unwrap roast and let sit at room temperature 1 hour before cooking.Step 5Place a rack in lower third of oven; preheat to 275°. Cook butter, one half head of garlic, and 1 thyme sprig in a small saucepan over medium-low heat, stirring often, until bubbling and fragrant but not browned, 5–6 minutes. Remove from heat and cover to keep butter warm.Step 6Toss leeks, potatoes, oil, and remaining garlic heads and 5 thyme sprigs in a large roasting pan; season with kosher salt. Place pork on top of vegetables and brush all over with some garlic butter. Roast, basting with garlic butter every 30 minutes or so and stirring vegetables, until an instant-read thermometer inserted into center of pork registers 120°, 75–105 minutes. Transfer pork to a cutting board. Tent pork with foil. Let rest at least 45 minutes or up to 3 hours.Step 7Check potatoes for doneness; they should give no resistance when poked with a fork (this will vary depending on the size of your potatoes). If they’re still firm, you'll need to cook them longer, along with the leeks and everything else in the roasting pan. Increase oven temperature to 500°. Cover pan with foil and roast until potatoes are tender and garlic is golden, 20–30 minutes longer (start checking after 10 minutes).Step 8If resting pork for the maximum 3 hours, turn off oven and remove foil from roasting pan. After meat has rested, preheat oven to 500°, add kale and vinegar to roasting pan, and toss to coat. Arrange pork on top of vegetables and roast until pork is deeply golden brown and an instant-read thermometer inserted into center registers 130°, 10–20 minutes (or possibly longer if you’ve rested your pork the full 3 hours). Let everything rest in pan 15–20 minutes.Step 9Transfer pork to a cutting board. Using tongs, transfer vegetables to a large platter, reserving pan juices. Carve meat off bones, then slice crosswise ½\" thick. Arrange over vegetables. Spoon reserved juices from pan over meat (there’s a ton of flavor in them that shouldn’t be left behind!). Season with sea salt.Step 10Do Ahead: Pork can be seasoned 2 days ahead. Keep chilled.How would you rate Party-Ready Pork Roast?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleFirst made this two years ago, a half recipe for my family of four with leftovers. It’s yummy! BUT the original recipe had carrots. What happened to the carrots? This is very weird. BRING BACK THE CARROTS 🥕 JessHeaven12/24/2020Truly a hit.  Made this for New Year's Eve potluck.  I meant to put the thermometer to 120F so the slow roast would stop cooking when it was ready, but then actually set it to 170F, so it went a little longer.  I then let it rest for an hour before we brought it to the party, where my husband cut it and it was delicious.   Then the next day I simply mixed the fresh kale into the potato/leek .mixture, covered it with the leftover pork and we had a delicious home cooked New Year's dinner with no work at all.  If people don't like to clean the leek, they could use a bulb of fennel and julienne that.Trees WhitbeckConnecticut1/3/2019This was perfect for our family celebration. I followed the instructions exactly using a french cut roast (two at 3ibs each) and it came out perfectly! It was packed with flavor - loved the fennel. We will definitely make this again. Thanks!Anonymous12/25/2018Portland:  Learn to train your taste buds. I hated cilantro the first few times I tried it. I just kept eating it and soon grew to love it. The same will happen to you with fennel. Humans are all born to reject unfamiliar flavors and textures. Babies all hate olives and other pickled foods, but the vast majority love those things before they turn 10. If you convince yourself that you hate this or that taste, you'll miss out on many foods that you will grow to love. Give it a try. Once is not enough. It took me several months to get over my dislike for cilantro. I wish BA would do a study of this phenomenon and report on it. Sometimes it's just a psychological barrier. Brains? Tongue? Tripe? \"Rocky Mountain\" Oysters? Raw clams/oysters? Eye balls? When I was young, I was force-fed liver until I got to love it. AnonymousCT12/16/2018Anonymous in Portland:  Are you sure you hate fennel seed?  Do you hate sausage - many varieties, especially italian sausage, have fennel.  In this recipe, I think fennel is pretty important.\nAnonymous in Brooklyn:  I've frequently subbed baneless and don't have problems with pork drying out.  There's so much moisture in this that it's practically a braise and you're protecting yourself by using a meat thermometer in the first roasting.\nI won't rate this recipe because I haven't made it yet but it sounds scrumptious and I WILL be trying it.nbspNew Mexico12/15/2018Would it be a big loss to omit the fennel? I hate anything licorice flavored, but don't want to tamp down the spice level or flavor. Any suggested substitutes?AnonymousPortland, OR12/14/2018what if you can only find boneless pork loin? how would you adjust the cooking?AnonymousBrooklyn, NY12/13/2018Explore Bon AppétitPotatoVegetableKaleLeafy GreensPork Rib RoastPorkMeatYukon Gold PotatoMainGluten-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Molly Baz"]}