{"id": "6e0613faa49ebc19259a09a69cd604e6", "url": "https://www.bonappetit.com/story/theres-more-to-chile-flakes-than-crushed-red-pepper", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "There’s More to Chile Flakes Than Crushed Red Pepper | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere’s More to Chile Flakes Than Crushed Red PepperMake room in your pantry for a chile collection.By Rebecca GaoDecember 15, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailYou’ve probably seen your fair share of crushed red pepper flakes: at your local pizza place, sprinkled on top of chicken parm, and even in your own pantry. But nowadays, other varieties of chile flakes are widely available. And that makes sense, considering there are so many varieties of peppers that can be dried and pulverized to make flakes. With so many types, it can be confusing to figure out what kind your dish requires, especially if you’re new to the chile flake game.“I'd never experienced [red] pepper flakes growing up in India,” says Meherwan Irani, the founder of Spicewalla, a spice brand based in Asheville, North Carolina. “Ninety-nine percent of the time we use either whole chiles or ground chile powder, and there are [innumerable] varietals of red chiles. But in many other cultures, chile flakes [as opposed to whole chiles] are quite common.”Of course, it would be impossible to talk about every single chile flake out there—there are countless varieties, each with their own flavor profile and preferred applications. The chile flakes’ flavor profile comes from how the chile peppers are grown and prepared.Some chiles, like your pizza parlor red pepper flakes, bring heat. Others, like the Korean staple gochugaru, offer a sweeter flavor. Since not all chile flakes are interchangeable, don’t substitute willy-nilly. Understanding broad flavor categories (i.e., fruity, smoky, hot, sweet, mild) can help you choose the perfect chile for the dish you have in mind; plus, knowing what category of chile you need (as in, sweet as opposed to hot) means that you’re more prepared to make a good substitution. There’s nothing worse than expecting a sweet and fruity dish, only to have it be way spicier than you expected. Try tasting your chile flakes on their own before adding them to get an idea of flavor and heat.Here are a few types of chile flakes to incorporate into your own cooking:Gochugaru is a Korean seedless chile pepper that’s been dried in the sun. According to food writer Eric Kim, gochugaru has a very powerful and sweet flavor. “They’ve got this mellowness,” he says. “They’re not very spicy, but they add this real fruitiness and so much flavor to a dish—not just heat.”Photo by Laura MurrayAside from being foundational in Korean cuisine, gochugaru’s fruity flavor profile lends itself well to salad dressing, which is one of Kim’s favorite ways to use it. “I do a dressing of fish sauce, sesame oil, sugar, [raw] gochugaru, and some garlic and ginger,” he says. “It’s not spicy and adds a lovely third note to whatever it is you’re cooking.”Another popular chile flake is Aleppo-style pepper, which “turns up the heat modestly but has some fruitiness and some earthiness to it,” says Irani. Aleppo-style peppers are a star at SOS Chefs, a shop in New York City that sells gourmet spices, oils, and other ingredients. “Because it’s so crunchy [rather than] powdery, it’s something you can use differently than a chile powder and it has a lot of flavor,” says Atef Boulaabi, the owner. Aleppo-style pepper is smoky and fruity, with cumin-like undertones.Photo by Alex Lau, Styling by Emily EisenAccording to Irani, “They’re named after the eponymous city in Syria, and as you can guess, they’re popular in Middle Eastern cuisines, from hummus to kebabs. But they’re also fantastic in tagines and braised chicken and on roasted vegetables.”For those looking to add a bit more heat to their dish, guajillo flakes are a delicious option. “They have an earthy, grounding flavor,” says Jocelyn Ramirez, founder of Todo Verde, a plant-based food business in L.A., and author of La Vida Verde. “They give you just enough heat to remind you that you’re eating chiles without being overpowering.”And there are countless other chile flakes not named in this article, like Fresnos, chipotle, cayenne, piri-piri, maras, Urfa biber, and so many more. There’s a whole world of chiles flakes out there, ready for you to experiment with.One last thing to keep in mind: The flavor you get from a particular chile flake also greatly depends on how you prepare them. “Especially if you’ve got a pepper with a lot of flavor and a lot of nuance, [how the chile flakes taste] depends on how you use them—like if you sweat them [in fat] or if you just add them in the end,” Boulaabi says. “It changes the whole perspective of your pepper.”Next time you’re thinking of cooking with chile flakes, investigate what they taste like, their origins, and how to reap the most flavor. That little bit of research will save you from the big glass of milk you’ll need if you accidentally substitute crushed red pepper flakes for gochugaru the next time you’re making dakgalbi.Speaking of dakgalbi:DakgalbiThe beloved Korean stir-fried chicken dish dakgalbi is spicy, sweet, aromatic, and comforting—and it comes together in a few easy steps and one pan.View RecipeRebecca Gao is a Toronto-based journalist interested in climate, food, and late-aughts teen movies. In her spare time, she can be found baking (or at least trying to). Her writing can be found in Chatelaine, FLARE, VICE, Reader’s Digest, and more.Explore Bon AppétitChileSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-15", "author": ["Condé Nast", "Rebecca Gao"]}