{"id": "6e089bd2db04d6ad1f65d0501d263bc7", "url": "https://www.bonappetit.com/story/never-fail-spiced-lamb-burgers", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Spiced Lamb Burgers Are My Crispy, Fatty Summer Ritual | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to My Summer Body? Lamb Fat and Pita BreadThese spiced lamb burgers have become my summer ritual.By Carey PolisJune 1, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Have you noticed that people are a little less afraid of fat these days? All of a sudden, avocado is \"good fat,\" putting ghee in your morning coffee is a thing, and people are adding collagen supplements to just about anything they can (okay okay, I know collagen and fat are not exactly the same, but I'm counting it). So while the expression \"fat is flavor\" is nothing new, it just seems a little more... acceptable now.So if there was ever a time to sell the world on my beloved Spiced Lamb Burgers, and all the glorious fat and flavor they contain, it's now. I've been making this recipe every summer for the past five years—it's become a ritual at our apartment, a flattened meat patty tucked inside a crispy pita to welcome warmer weather. (Stay with me.)These are not lamb burgers in a traditional sense. You mix ground lamb with an aromatic combination of parsley, chopped onion, cumin, coriander, cinnamon, salt, and pepper, and then you stuff said (raw!) meat mixture inside pita pockets. Why? Because when you throw the oil-upped pita on the grill (the recipe says to oil the grate, follow your own journey), the lamb fat renders inside the pita. Instead of dripping onto the coals and causing flare ups, it magically absorbs into the bread. This entire recipe hinges on that fat. It creates a rich, meaty, succulent interior—yeah, I said \"succulent,\" deal with it—while the soaked outside of the pita goes crispy in the heat. Eureka: FAT IS FLAVOR!Those lamb burgers would not suck with some grilled scallions on the side.\nAndrew KnowltonThis happens to also be one of the easiest and fastest grilling recipes we have. Ten minutes prep, ten minutes on the grill. Serve with lots of plain yogurt on the side. We've made them on a Tuesday. We've made them for friends. We've made extras and kept them in the freezer. (For, you know, emergencies.) It's just not summer until these burgers have been eaten.Maybe your summer body involves fruit smoothies and sprouts from the farmers' market. But my summer body is all about lamb, pita bread, and a whole lot of glorious, delicious fat.Get the recipe:Spiced Lamb BurgerView RecipeExplore Bon AppétitNever FailLambBurgersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-01", "author": ["Condé Nast", "Carey Polis"]}