{"id": "6e2b706c25c6abfb4facb716f13bdcc6", "url": "https://www.bonappetit.com/story/restaurant-etiquette-is-it-ever-okay", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Is It Ever Okay…to Ask the Restaurant to Turn Down the Music? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Ask the Restaurant to Turn Down the Music?Solicited but questionable advice for your next dinner out. By Alex BeggsOctober 14, 2019FacebookTwitterEmailA scene from Loser Takes All. 1956 Photo by Mondadori via Getty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can I refuse the first table offered to me by a host or hostess? I’m talking 6 p.m. on a Wednesday when there are plenty of tables available. —Ill-seated StephI think you answered your own question there, Steph. Some restaurants plan tables to a T—and when I was an editor’s assistant I would request certain tables when I made reservations. (The one by the fireplace at The Lamb’s Club, thanks!) However, it’s not what you say but how you say it. Do you sneer and insult the manager, who is also a celebrated local artist, when you ask for “something farther away from the hideous portrait of nude George Costanza”? Have a fantastic time, jerk! Or do you ask so kindly, so warmly, you sound like you’re inviting the host over for dinner yourself? I think you can see the pattern here: BE NICE TO PEOPLE.Photo by Igor BastidasOften a waiter will ask if you want anchovies on your Caesar salad, but recently, a restaurant ended up charging me for them (without warning). In this scenario, can you ask for a charge to be taken off the bill? —Negotiable NadeenI once heard a story about a rich and powerful man who had this mind-bending superpower: he could convince any waiter to take entire dishes off the bill that he deemed not very good. He’d hand over his credit card and look them in the eye and say, “and go ahead and take that pork chop off the bill—I won’t be paying for that.” Can you imagine having that kind of nerve? I think about that a lot, about being a man. Annnyyway. Informing the server all innocently that you had no idea the anchovies on a Caesar salad would be extra, is fine. Come on, the salad is SUPPOSED to have anchovies. They’d better be free! And if the server stands by the surcharge? Well, I hope the $2 won’t keep you up at night. Global warming should!When getting out of your seat in a crowded restaurant where the tables are tightly packed, is it better to face your neighbor or to have your butt toward their table? —Michael’s on the MoveLet’s be real: This depends on the size of your butt and where the wine glasses are placed on their table. You can do the math. I personally like to present my ass toward strangers to enhance their meal. It reminds me of when Winnie the Pooh got stuck in Rabbit’s tree and Rabbit puts a frame around his ass and sets a table under it complete with flaming candelabra. Plus, my own friends have seen my butt plenty of times, it wouldn’t be a new or engaging experience for them.Snack Break!This marinated manchego is like having a restaurant appetizer, but at home. Which means you can absolutely take the last bite instead of conceding it to your dining companion, who is a well-worn body pillow!Marinated ManchegoThe only thing more crowd-pleasing than cheese is marinated cheese.View RecipePhoto by Igor BastidasIs it ever okay to send a dish back simply because I didn’t like it? —Not-Into-It IgorNo—that’s how dining out (or going to the movies, or picking a college major) works. You’re paying for something that is hopefully good but might not be. These are the ONLY situations in which you can send back a dish:The pork chop is rare.There’s a piece of plastic in the ravioli.There are cashews in the salad, and you noted earlier that you are allergic.A black crow flies out of the pot pie.You’re Gordon Ramsay.Photo by Igor BastidasIs it ever okay to order something off the menu, like a banana? —Potassium-Deficient PattiIs banana the code word that gets you into the restaurant’s cool new produce-and-bondage-themed underground freakeasy (freaky-speakeasy)? If so: Yes. If not: No way, Patti!!!!Photo by Igor BastidasCan I take home the basket of complimentary bread or what? —Carbo-loading CameronDefinitely. Leave the actual basket behind, please and thanks.Is it ever okay to blow your nose at the table? —Runny RomeoOnly if you’re in the stages of the cold where it’s runny and quiet, but not honky-holorky-flecka-flunka—you know, the sound of a thick and muffly avalanche of boogers. That requires STAYING HOME. Also for goodness sake, bring Kleenex or a hankie and don’t you dare use a CLOTH NAPKIN.Photo by Igor BastidasIs it okay to let kids watch an iPad at the table? —Judgy JaneIt’s sort of sad/sign of the times/yadda yadda. But parents hate when people tell them what to do, so as long as the kid has headphones in and isn’t flinging peas in my general direction, she can watch The Wire for all I care.Photo by Igor BastidasHow can you ask the restaurant to turn down the music without being That Person? —Jamming JosieScript: “This is soooo embarrassing to ask and I feel like such a loooooser, but would it be possible to turn the music down a SMIDGE?” You MUST say the word SMIDGE in this scenario or it will never work.I want to pour my own wine at a fancy restaurant. Is that so wrong? —Controlling ClaraFine, spill little trails of red wine on the white tablecloth, pour more for yourself than for Steven—I see how it is. If serving your own vino is such a priority for you that you had to write me a letter about it, when the wine is corked and the server sets the bottle down after Pour No. 1, say, “Thank you so much; we’ll pour it from here! Some of us are going to drink less than others tonight.” And then glare at Steven menacingly. He’s done nothing to deserve this.That’s all for now, but if you have petty etiquette questions, recipe requests, or just want to tell me you think I’m unfunny and WRONG, so wrong, about everything, please email staff.bonappetit@gmail.com.Love, AlexExplore Bon AppétitEtiquetteIs It Ever OkayRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-14", "author": ["Condé Nast", "Alex Beggs"]}