{"id": "6e3a0c3a041a9493ec280d5eb994c231", "url": "https://www.bonappetit.com/story/why-roast-two-chickens", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "The Magical Trick That Makes Every Roast Chicken Twice as Nice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Magical Trick That Makes Every Roast Chicken Twice as NiceMake two. Thank me later.By Carla Lalli MusicOctober 24, 2019FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Last week in the Bon Appétit Test Kitchen, my dear colleague Molly Baz sure was tooting her own horn. Which, let’s be honest, she is wont to do, but she was particularly animated on this mid-week morning, and she wanted the world to know about it. Her bragging rights? Well, she’d scored quite a dinner victory the night before by roasting not one, but two chickens. She hadn’t hosted a party, it was just dinner for her and the Mister, and Molly needed us all to know why double-roasting is The Way.“If you’re not roasting two birds, you’re missing out on one of life’s easiest and most delicious meal prep opportunities,” she exclaimed. “Has anyone ever been mad about leftover roast chicken?!”I wasn’t about to disagree with her—I had certainly never been mad at leftover roast chicken. And while I didn’t want to upstage her, I needed her to know that I have been a double-roast-chicken practitioner for years. This is called camaraderie.“Yes!” I yelled (it seemed the most logical response). “First of all, one chicken is barely enough for four people, especially when one of them plays JV soccer,” I said. I live with my husband and two sons, so I should know.“One chicken is barely enough for two people,” Molly declared. She lives with her husband and her dog, Tuna, who may or may not be getting chicken scraps.“One chicken feeds three people, basically,” I concluded.“Yes!” she yelled. It’s great working in a place where people support each other, I thought.Want this letter before it hits the website? Sign up for our newsletter!Winner winner, here’s Molly’s double chicken dinner.\n“You’re literally going through the same amount of work to roast two chickens,” Molly went on, now thinking strategically. “It takes the same amount of time, they fit on the same rimmed baking sheet—just buy two and double your dinner payoff!” She was yelling again.“It’s the only way,” I added. “People who aren’t doing this are really missing out.” I felt a little sad for those people.Sunday rolled around. It was rainy and grey, the kind of day when you want to just park something in the oven and take a nap before dinner. I bought two chickens, then came home and set the oven temperature to 325°. I placed the chickens on a large rimmed baking sheet and seasoned them with a mixture of salt, crushed fennel seeds, dried oregano, chopped rosemary, smoked paprika, and freshly ground pepper. I had leftover thyme, so I divided the sprigs between both cavities. Then I took stock of our root vegetable situation and added thickly sliced onion rings, Honeynut squash wedges, and a halved head of garlic to the baking sheet. I seasoned the veggies with salt and pepper and drizzled olive oil over everything. Satisfied, I slid the pan into the oven and set a timer for 2½ hours (this is a slight variation on my Faux-tisserie Chicken recipe). I knew from experience that this would yield chickens with a shreddable, pull-apart texture and deeply browned vegetables seasoned with all the schmaltzy drippings. I wondered if this was how Molly did her chickens, or if she went with a high-heat method. Either way, I knew we were winning.The dinner was a hit—my family of four ate an entire chicken plus the drumsticks from chicken No, 2, the remains of which were wrapped and refrigerated. On Monday night, we warmed up the leftovers and I put mayo and hot sauce on the table for seasoning our chicken pieces. I chopped up the rest of the roasted vegetables and tossed them into a big arugula salad.“Leftovers!” I yelled at my family when we sat down for chicken dinner redux. Reader, no one was mad.Explore Bon AppétitCarla Newsletterroast chickenRead MorecookingCrispy Skin Isn't the End Game of Roast ChickenBy Molly BazcookingMy Fridge Is Full of Fat, What About Yours?By Carla Lalli MusicLifestyleThis Recipe Changed the Way I Feel About Restaurant ChickenBy Amanda GabrielecookingA Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad BreathBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-24", "author": ["Condé Nast", "Carla Lalli Music"]}