{"id": "6e56e1ee63fd49a6f66d8269878c549a", "url": "https://www.bonappetit.com/recipe/chicken-enchiladas-verdes", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Chicken Enchiladas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Enchiladas VerdesBy Rick MartinezPhotography by Alex LauSeptember 13, 20213.3(126)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIn a rush to get dinner on the table, you might be tempted to skip frying tortillas before assembling your chicken enchiladas. But this is a crucial step. Lightly frying the corn tortillas helps keep them from tearing as you roll them up and turning to mush as you bake them. This recipe saves you time elsewhere with an assist from rotisserie chicken.Variations on enchiladas are nearly endless. This vegetarian recipe stuffs the tortillas with kale, beans, and Monterey Jack cheese. If you prefer pork, there are Pork Enchiladas Rojas smothered in a red sauce made with guajillo, ancho, and morita chiles. And beef fans can try these Tex-Mex-Style Enchiladas with pico de gallo.Editor’s note: This recipe was originally published on September 1, 2015.Ingredients4  ServingsGreen Sauce2tablespoons olive oil½onion, halved1poblano chile, halved2pounds tomatillos (about 20 medium), husks removed, rinsed2serrano chiles, chopped3garlic cloves, smashed1cup homemade chicken stock or low-sodium chicken broth½cup cilantro leaves with tender stems, chopped1tablespoon fresh lime juiceKosher saltEnchiladas and Assembly½rotisserie chicken, skin removed, meat shredded½teaspoon ground coriander¼teaspoon ground chile de árbol or red pepper flakesKosher salt1cup vegetable oil86-inch corn tortillas10ounces Cotija cheese, finely grated, plus more for serving½cup crème fraîche1tablespoon milk½red onion, thinly slicedPreparationGreen SauceStep 1Preheat oven to 425°. Drizzle olive oil over onion, poblano chile, and tomatillos on a rimmed baking sheet and roast until vegetables are soft and browned, 35–40 minutes. Let cool slightly, then slip off and discard poblano skin. Transfer onion mixture and any accumulated juices to a blender. Add serrano chiles, garlic, chicken stock, cilantro, and lime juice and purée until smooth. Transfer to a large bowl, then season green sauce with salt.Enchiladas and AssemblyStep 2Preheat oven to 425°. Toss chicken with coriander, chile de árbol, and ½ cup green sauce in a large bowl; season with salt.Step 3Heat vegetable oil in a medium skillet over medium-high until oil bubbles immediately when edge of tortilla touches the surface. Working one at a time, fry tortilla, turning once, until just starting to brown and crisp, about 10 seconds per side. Transfer tortilla to paper towels to drain. Repeat with remaining tortillas.Step 4Dip both sides of each tortilla in green sauce just to coat, then transfer to a rimmed baking sheet. Spread 1 cup green sauce lengthwise down the center of a 13x9\" baking dish. Working one at a time, spread ¼ cup chicken mixture down the center of tortilla and fold one side over filling, then continue to roll enchilada onto itself. Place seam side down in prepared baking dish as you go (enchiladas should be nestled right up against each other). Top with 10 oz. cheese and remaining green sauce. Bake until sauce is bubbling and cheese is beginning to brown, 20–25 minutes. Let sit 10 minutes.Step 5Meanwhile, combine crème fraîche and milk; season with salt.Step 6Serve enchiladas topped with cheese, a drizzle of crema, and sliced onion.How would you rate Chicken Enchiladas Verdes?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThank you AnonymousKenya1/14/2022Loved the sauce. Did not fry the tortilla shells, however, did warm them up slightly and then dipped each side quickly into the sauce before filling and rolling each enchilada. Result was somewhat healthier enchiladas. Lipstick LibrarianNorth Vancouver, BC11/7/2021We ended up doubling a couple of things in this recipe and it turned out great! We used less tomatillos and it still ended up being enough sauce. I would recommend going heavy on the spices (serrano/coriander/garlic/salt-we used smoked maldon salt). The only thing I would add to this next time is queso on top with the cojito and the remaining sauce. The cojito is delicious but when it’s baked it can get a little too dry. We’ll definitely be making this again very soon! Yevannashville, tn2/11/2021Obsessed!! Thank you Rick ❤️AnonymousDallas, TX9/15/2020Ew! Poured the sauce down the drain and made tacos instead. Way too tart, way too spicy. Not my jam at all. I’ve made pork verde before and it was excellent so not sure what the problem was here, but it’s a no for me, dawg. alohalifeNew Braunfels TX6/10/2020With the number of modifications we had to make to this recipe in our quarantined kitchen, it had absolutely no right to still be as good as it was, which was extremely. It might be magic? You can swap the cheese, you can swap the chile varietals, but you probably can’t mess this up. AnonymousFort Collins, CO6/9/2020I couldn’t find Cojita Cheese so I substituted 2 oz crumbled feta and 8 oz shredded “Mexican blend” cheese.  Based on another review I reduced the temp when roasting the veggies to 400. No burning at all but I had a LOT of liquid in the pan so I left out most of the chicken broth. (I wanted a fairly thick sauce.)  I loved the flavors and will make it again, however I will change to flour tortillas since my husband doesn’t care for corn tortillas. AnonymousNew Orleans 6/5/2020Not to be that person who changed 17 things and made an entirely different recipe BUT we shredded the entire rotisserie chicken and doubled the tortillas (somehow was able to use the original amount of salsa verde tho, it makes a lot), used cotija + cheddar, and it was amazing. We grilled the tomatillos, etc for the sauce instead of charring them in the oven. Will definitely be making again. Thanks Rick! alexbeggsBon Appétit 5/26/2020Delish.  Actually, I followed the recipe as is and it worked out fine.  Sooooo tasty.Anonymous4/24/2020This was really good. The only thing I would change is maybe using a different cheese. Cotija doesn’t melt very well.Anonymous3/29/2020Flavors were good, but if I followed the roasting and baking temperatures given in this recipe, I would've burned the house down. The tomatillos/peppers charred and burned the juices to a crisp. I had to cut the temperature down on the enchiladas to keep them from completely burning as well.AnonymousDenver11/12/2019In the past, every single recipe I have made has been very good.  This is the first one that disappointed.  After all the working of making the sauce, and the baking time, I had really high hopes.  I suggest more salt than you think it needs and more spices in general.  It turned out bland, and mushy.  AnonymousMichigan8/6/2019Explore Bon AppétitCasseroleMexicanLatin AmericanChickenPoultryCotijaCheeseTomatilloVegetablePoblano ChileChileSerrano ChileMainNut-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-09-01", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}