{"id": "6e622b5e2d2c3f14433218617e4ec0a2", "url": "https://www.bonappetit.com/recipe/grilled-pork-shoulder-steaks-with-relish", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Grilled Pork Shoulder Steaks With Green Pepper Relish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGrilled Pork Shoulder Steaks With Green Pepper RelishBy Leela PunyaratabandhuJuly 6, 20214.8(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintCookbook author Leela Punyaratabandhu describes this central Thai-style grilled pork as “simple but sublime.” There’s not much to it, and yet it’s packed with flavor, thanks to the holy trinity of Thai aromatic paste (garlic, cilantro roots, and white peppercorns) at the heart of this dish. If you can find it, cilantro sold with its hairy white roots still attached will add tons of herbaceous flavor to the super savory marinade. If you have access to a Korean market, you can usually find beautifully marbled pork shoulder steaks already cut into the ideal thickness, which makes this dish even simpler to prepare. The lime- and fish sauce-spiked pepper relish is a milder and streamlined take on nam phrik num, a spicy Northern Thai staple meant to showcase green peppers and chiles. Warm Khao Niao (Thai sticky rice) on the side is a must. Serve this alongside the rest of Leela’s summer menu with Cantaloupe with Spicy Bacon-Cashew Crumble, Cucumber, Tomato, and Green Bean Salad, Grilled Scallops with Peach Sweet Chili Sauce, and Lime-Lemongrass Slushies. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonCharcoal Grill$98 $82 At AmazonInstant-Read Thermometer$35 At ThermoworksHeat Resistant Leather Gloves$22 At AmazonTongs$13 At AmazonIngredients4 - 6 ServingsPork3lb. boneless pork shoulder (Boston butt), fat cap trimmed to ¼\" if needed, sliced crosswise ½\" thick6large garlic cloves¼cup oyster sauce3Tbsp. finely chopped cilantro rootsor stems2Tbsp. fish sauce (such as Megachef, Squid, or Three Crabs)2Tbsp. light soy sauce or soy sauce2tsp. white or black peppercornsRelish and assembly5large fresh banana peppers, Anaheim chiles, or Cubanelle peppers (about 1¼ lb.)2jalapeños1small shallot, thinly sliced¼cup fresh lime juice2Tbsp. coarsely chopped cilantro2Tbsp. Thai fish sauce (such as Megachef, Squid, or Three Crabs)2tsp. light brown sugarKhao Niao (for serving; see recipe)PreparationPorkStep 1Prick pork steaks all over with a fork. Place in a large bowl or resealable plastic bag.Step 2Purée garlic, oyster sauce, cilantro roots, fish sauce, light soy sauce, and white peppercorns in a blender or food processor until smooth. Pour marinade over pork and turn to coat. Cover and chill at least 4 hours and up to 6 hours.Relish and assemblyStep 3Prepare a grill for 2-zone heat (for a charcoal grill, bank two thirds of coals on 1 side of grill and scatter remaining coals on other side; for a gas grill, set 1 burner to high heat and the remaining burners to medium-low). Place peppers and jalapeños on hotter side of grill and grill, turning occasionally, until charred and blistered all over and starting to collapse, 12–16 minutes. Transfer to a medium bowl, cover, and let sit at least 10 minutes.Step 4Meanwhile, grill pork on hotter side of grill, moving to cooler side as needed to control flare-ups, until deeply browned on both sides and an instant-read thermometer inserted into the thickest part of pork registers 145°, about 3 minutes per side. Transfer to a platter and let rest 5–10 minutes.Step 5Scrape skins from peppers and jalapeños, then remove stems, ribs, and seeds. Slice into long ¼\"-thick strips and return to bowl. Add shallot, lime juice, cilantro, fish sauce, and brown sugar; mix well.Step 6Slice steaks against the grain ½\" thick. Arrange on a platter and serve with relish and khao niao.How would you rate Grilled Pork Shoulder Steaks With Green Pepper Relish?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleMade this tonight and my husband and son raved and begged me to put it in our dinner rotation. VictoriaChicago 9/25/2021Perfect simmer dish. It was so easy to prepare everything ahead for a dinner party. Was delicious. Didn’t have fish sauce so used tamari and worchisher. Everyone raved. wendy bSouthern California 8/4/2021Not sure what I did wrong here but this came out so so so salty it was almost inedible. Actually I do know what I must have done wrong - I didn’t have oyster sauce so upped the fish sauce (3 crabs) and soy sauce (lighter Kim lan).  So consider yourself warned.  Shoulda-followed-instructionsBrooklyn8/4/2021I would dice the peppers up more but other than that it’s amazing. Kh7/18/2021I would dice the peppers up more for the relish but other than that this was amazing. Kariera7/18/2021Explore Bon AppétitThaiSoutheast AsianAsianPork ShoulderPorkMeatAnaheim ChileChileVegetableJalapeñoLimeCitrusFruitSummerMainDairy-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}