{"id": "6e69d25fd4c25b9a09a64e53da0f0eb9", "url": "https://www.bonappetit.com/story/best-espresso-machines", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "The Best Espresso Machines for Beginners, Semi-Pro Home Baristas, and Everyone in Between | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Espresso Machines for Beginners, Coffee Nerds, and Everyone in BetweenA good espresso machine is an investment. But how much do you spend at the coffee shop every year?By Lauren JosephFebruary 24, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’ve historically been a gear gal, nerding out over the best espresso machines and high-tech rice cookers and sous vide machines. But four months into culinary school, I’ve found my tastes have taken a more austere turn, and I've been completely won over by the no-frills equipment of a teaching kitchen. The single exception to this: that espresso machine. It’s possible to make a good—great!—cup of coffee with plenty of humble at-home brewing processes. But for espresso drinkers like me, the Breville Bambino Plus Espresso Maker is worth the cost and the extra time each morning, and it’s my pick for the best espresso machine on the market.I love all the shiny clunkiness of my beloved Breville espresso machine. The satisfying click of the portafilter, the roar of the steam wand. I love the piping hot double shot of espresso each morning, complete with a foamy, golden crema—and most of all, the weekend cappuccino, topped with a little cloud of frothed oat milk. That fantastically delicious morning coffee is all possible because the Bambino is small enough to slip between the sink and the stove in even the teeniest apartment kitchens, like mine.Yes, there’s plenty of easier ways to brew coffee at home, and making great espresso is an expensive, time-consuming process with a learning curve. But if you’re regularly ducking out for americanos or macchiatos and your gear-loving self is itching to commit to a home espresso machine, join me in adoring the Breville Bambino Plus—the best espresso machine at its price point in my book. Or check out the other espresso machine recommendations below that cover a variety of price points and levels of ease.Photograph by Isa ZapataBreville Bambino Plus Espresso Machine$500 at Amazon$500 at Sur La Table$500 at Food52What’s so great about the Breville Bambino Plus?This is a goldilocks machine. The Breville Bambino Plus is semi-automatic, which means it’s not fully manual or fully automatic—it’s just right. The machine uses a pump to get the pressure right in your shot, making it easy enough for beginners. About half an hour of manual-reading (or video-watching, for my fellow manual-averse people) and a few practice shots will have you on your way to coffee shop-quality espresso. After playing around to figure out the right grind size, each shot I pulled was rich and flavorful, and I found that the machine had very few quirks.It’s also speedy. One of the biggest reasons an espresso machine takes dedication each morning is the timing of all the little steps. Some machines need to be constantly refilled—luckily, this one has a roomy water reservoir. Others take ages for the heating mechanism to switch from espresso making to steaming milk—not the Bambino Plus, with its ThermoJet heater. Even though it has a cost-and-space saving single boiler, it’s ready to pull a shot about three seconds after you turn it on, and it starts steaming milk in the same amount of time. If you prefer milky espresso drinks like lattes, you can even set the steam wand to an automatic setting and skip that extra minute of foamy fiddling.With the Bambino Plus, brewing espresso is hard to mess up, so it’s safe for houseguests and roommates. The steam wand auto purges the last drops of milk lest someone in your household “forget” to clean it. The drip tray even has a handy light up feature, reminding you when it’s time to empty it. And like the other Breville tools we love, it’s sturdily made. (Plus, it has a 2-year warranty.)One note—this one doesn’t come with a built-in grinder, which is a plus for those with limited counter space. (Expect to make way for something slightly smaller than a stand mixer.) Which means you probably want to invest in a conical burr grinder to go with it since freshly ground coffee beats pre-ground any day of the week—but you already knew that.Courtesy of BaratzaBaratza Virtuoso Coffee Grinder$250 at Williams Sonoma$250 at AmazonMy countertop is enormous. Gimme the option that comes with the grinder.The Breville Barista Touch is the semi-automatic pick for spacious suburban kitchens. It’s five inches wider and three inches longer than the Bambino and includes a conical burr grinder, along with a hot water wand. At first glance, you might think that touch screens are a bit like...cheating? But unlike similarly sized Breville models, the Barista Touch really does boast all the ease of the Bambino, with the same foolproof milk frother and quick heating transition from espresso to steam wand.Breville Barista Touch Espresso Machine$1,000 at Amazon$1,000 at Bed Bath & Beyond$1,000 at Food52What about the best old school espresso machines?If you're in the market for a classic commercial machine at a home-cook price point, go for an Italian machine like the Rancilio Silvia. (For a competitor option, check out BA's review of the Gaggia Classic Pro.) “Rancilio specialized in commercial machines, and this type of machine was made as a sample to send as a gift to their distributors,” explains Suyog Mody, co-founder of Boston-based coffee subscription company Driftaway. “It ended up becoming so popular that they decided to release it on the consumer market.” The Silvia still boasts commercial construction, so expect it to last and last. Mody loves that it’s low-profile and quieter than most home machines—and that the customer support is helpful as you begin to tinker with the parts and upgrade or replace them over time. (Great espresso machines are like classic cars; you can customize and update certain parts instead of getting a whole new one.)Like the Bambino, investing in a good conical burr grinder to go alongside the Rancilio Silvia is key. Also like the Bambino, there are two filter baskets included, one for single shots and one for double. The price difference here really comes down to longevity—this is a commercial-grade machine with stainless steel, brass, and copper parts that are all easily replaceable or upgradable. It’s a bit more finicky than the Breville (some people find the lack of a PID system, which regulates pressure and temperature, annoying) but, this could easily be a ten or fifteen year machine with a little care.Rancilio Silvia Espresso Machine$830 at AmazonWhat if I’m a pro looking for La Marzocco quality at home?Laura Perry, co-founder of Luna Coffee (another one of my favorite coffee subscription picks) recommends the Decent DE1. “It’s not cheap, but the Decent DE1 is awesome for a few reasons,” she says. “It’s got incredible temperature control at the grouphead (a rarity for home machines), and there’s a tablet to graph and deploy shot profiles.” Take all the information that built-in coffee iPad gives you and go check out the Decent Espresso chat room, “which [provides] lots of support as you embark on your espresso nerd quest,” says Perry. This is a pro pick with a pro price: the Decent DE1 Pro, the latest model of the machine that Perry loves (and employs at Luna Coffee HQ), is $3,399.Decent DE1Pro$3,399 at Decent EspressoWhat if I’m looking for something to do most of the heavy lifting itself?My first espresso maker was a super-automatic Jura—and to be honest, it made such consistently good espresso that it outperformed the Bambino for the first few weeks, while I was still learning the ropes. A fully automatic coffee machine measures and grinds the beans and pulls the shot. Some machines also froth milk. All you need to do is fill the water tank and replenish the coffee beans and the Jura will make you the coffee drink of your choice at the push of a button. It's about as involved as popping in a Nespresso pod—there is no grinding beans or tamping down a portafilter involved. There's nothing wrong with that, and if you prefer the ease of an automatic espresso machine and can stand the price, I do recommend the Jura. But it is less FUN.JURA Automatic Espresso Machine$3,999 at Sur La TableMore highly-caffeinated content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeThese Are the Best Drip Coffee Makers, According to a Highly Caffeinated BA StafferBA Reviews: Is the Gaggia Classic Pro Espresso Machine Worth It?My Le Creuset French Press Symbolizes Everything I Love About AdulthoodExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-24", "author": ["Condé Nast", "Lauren Joseph"]}