{"id": "6e857e5e68a6720a36b7c758df48e5a8", "url": "https://www.bonappetit.com/recipe/spanakorizo", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Spanakorizo (Spinach Rice) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpanakorizo (Spinach Rice)By Sarah JampelFebruary 22, 20224.6(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintThere’s no one way to make the classic Greek dish spanakorizo, but all versions include rice, spinach or other dark leafy greens (by name, they must!), dill, and lemon. While many recipes call for first wilting fresh spinach, adding rice, and then cooking the two together, using frozen chopped spinach presents a couple of distinct advantages: One, it’s easier (no washing and drying leaves) and two, it lets you rein in the moisture level so you don’t end up with a soggy final product. (Be sure to squeeze that thawed spinach realllly well to expel excess water.)Feel free to switch up your alliums—use an onion or a couple of leeks in place of the scallions, or add in some garlic for good measure—and to halve the dill. (As written, this recipe is for dill lovers ONLY.) To make this a meal, try it topped with crumbled feta, a poached or soft-cooked egg, tomato-cucumber salad, seared fish, and/or fried shallots.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At AmazonMedium Saucepan$39 At AmazonMesh Sieve$13 At AmazonKitchen Towels$22 At AmazonIngredients4 servings1lemon3Tbsp. extra-virgin olive oil, divided8scallions, thinly sliced1cup basmati rice, rinsed, drained well1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1bunch dill, tough stems trimmed, finely chopped, divided110-oz. package frozen chopped spinachFreshly ground black pepperPreparationStep 1Remove zest from 1 lemon in wide strips with a vegetable peeler or paring knife. Slice lemon in half; set aside.Step 2Heat 2 Tbsp. extra-virgin olive oil in a medium heavy-bottomed saucepan over medium. Add lemon zest and 8 scallions, thinly sliced, and cook, stirring often, until scallions are bright green and beginning to soften, about 2 minutes. Add 1 cup basmati rice, rinsed, drained well, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and half of 1 bunch dill, tough stems trimmed, finely chopped, and cook, stirring, until rice is coated in oil, about 30 seconds. Pour in 1¼ cups plus 2 Tbsp. water and bring to a boil. Reduce heat to low, cover pan, and simmer until rice is nearly tender and water is absorbed, 13–15 minutes.Step 3Meanwhile, place one 10-oz. package frozen spinach in a fine-mesh sieve set over a medium bowl and pour in boiling water to cover. Let sit until thawed, 5–10 minutes. Drain well and transfer to a clean kitchen towel; squeeze hard to expel as much excess moisture as possible. Transfer spinach to a cutting board and run through a couple times with a chef’s knife to finely chop.Step 4Remove pan from heat, uncover, and top rice with spinach. Re-cover and let sit 10 minutes to allow spinach to steam. Using a fork, fluff rice and incorporate spinach. Stir in remaining half of dill and juice from 1 reserved lemon half. Season with freshly ground black pepper.Step 5Transfer rice to a bowl and drizzle remaining 1 Tbsp. extra-virgin olive oil over.How would you rate Spanakorizo (Spinach Rice)?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was very good.  I added feta, substituted leek for some of the scallion, put a poached egg on top and served with sauteed trout.  I'd like to see a bit more flavor - I didn't add all the dill.  Will add more dill.  And will look for more spices or other herbs to enhance flavor.WendyCamden, ME3/11/2022Great weeknight recipe! Added feta at the end and topped it off with a fried egg. Perfect meal. JaneDurham, NC3/8/2022Yum, came out great, pretty similar to what I know from my family. Regarding a previous person’s review- my yiayia DOES make hers with scallions as that’s how she was taught, and now all aunts use frozen spinach in theirs. All of them born and raised in Greece so I’m content with this recipe’s technique and ingredients!TimNew York, NY3/2/2022As someone who has been making spanakorizo for more than sixty years and who learned how to make from others who had been making it fifty years before that, I can recognize this dish but would not call it authentic, no matter if there are many ways to make it.  (1) Greeks use onions, not scallions.  (2) I have never had lemon peel cooked in it, and lemon is always squeezed on it after it is presented to the table.  (3) Frozen spinach, when there are endless bags of wonderful washed spinach in any supermarket (baby or large).\nI hav no objections to changing recipes, but just do not call it what it is not.PanayiNew Haven, CT3/1/2022Explore Bon AppétitRiceRice & GrainsSideDinnerVegetarianVeganSimmerGluten-FreeDairy-FreeNut-FreeEasyDillHerbs & SpicesSpinachLeafy GreensVegetableGreekEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-22", "author": ["Condé Nast", "Sarah Jampel"]}