{"id": "6e8a7d9529301fdf7dfdeb16c6bd4f58", "url": "https://www.bonappetit.com/story/first-time-matzo-ball-soup", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "I’m Making Matzo Ball Soup for the First Time in My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Making Matzo Ball Soup for the First Time in My LifeThe key to success, or so I’m told, is to not get too clever.By Adam RapoportApril 7, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Passover begins on Wednesday at sundown, and were this any other year, my mom would’ve set her Seder table a week ago. And about three months prior to that she would’ve emailed my brother, sister, and me, making sure we had the holiday marked on our calendars. And then she would’ve assigned who’s making what. Dessert is always up for grabs (I highly recommend this chocolate macaroon cake), as is the cocktail-hour chopped chicken liver (the secret: lots of caramelized onion and hard-boiled eggs, and a liberal hand with the seasoning.)What none of us ever get asked to bring is the matzo ball soup. That’s Maxine’s turf. I just turned 50-years-old, and I’m a pretty decent cook, and I have never made matzo ball soup in my life; I’ve never had the chance.The key to success, as my mom will tell you—or, as will Molly Baz, who developed BA’s Best Matzo Ball Soup recipe—is to not get too clever. This is not a dish that needs futzing with.Want this letter before it hits the website? Sign up for our newsletter!Watch me and Molly Baz make BA’s Best in the Test Kitchen\nIt starts with a rich, flavorful broth. Molly likes to kick start the process by roasting six pounds of chicken wings, imbuing the liquid with a deep, amber flavor. Both Maxine and Molly endorse a generous amount of fresh dill, one of those herbs that seems to announce the arrival of spring.Then there is the matzo balls themselves—not too big, not too small, maybe the size of a billiard ball. As I learned while riding shotgun in Molly’s matzo ball soup video, how long you boil the balls in well-salted water determines their texture. Too short of boil and they’ll be dense, like undercooked pasta. So take one out as it nears its cooking time and cut into it, just as you would a steak. It’s the only way to know if it needs more time in the pot. Optimally it should hold its shape, but still be tender—almost fluffy—throughout.Of course, this year, I won’t be seeing Maxine for Passover—at least in person. She’ll be in her apartment in New York, staying safe. Around 7 p.m., just as she’s sitting down to her nightly Dewar’s on the rocks, we’ll be sure to FaceTime her (for an 85-year-old, she’s pretty deft with her iPhone.) And I’ll be sure to share with her my matzo ball soup. As I type this letter, I’ve got a pot of fragrant, golden broth burbling away on the stove. I can smell it three rooms over. It might have taken Maxine 50 years, but she taught me well.Get the recipe:BA's Best Matzo Ball SoupThis recipe serves eight people generously (with two balls each) but could easily stretch to serve 16 smaller appetizer-sized portions.View RecipeFind more Passover recipes right here:1 / 73ChevronChevronMamaleh’s BrisketView RecipeExplore Bon AppétitAdam NewsletterMatzoPassoverRead MorecookingI Thought I Knew How to Make Perfect Matzo Balls, And Then I Tried TheseBy Emily SchultzcookingThe Most Opinionated Editors Came Together to Make BA’s Best Matzo Ball SoupBy Emily SchultzcookingChocolate Macaroon Cake Is the Ultimate Passover DessertBy Alex Delany and Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-07", "author": ["Condé Nast", "Adam Rapoport", "Claire Saffitz"]}