{"id": "6ea7e810245f99597b4e22075fcc9004", "url": "https://www.bonappetit.com/story/bantam-bread-dirt-bombs", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "If a Muffin and a Doughnut Fell in Love, This Would Be Their Baby | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIf a Muffin and a Doughnut Fell in Love, This Would Be Their BabyThe Dirt Bomb at Bantam Bread is a cinnamon sugar-dusted bundle of joy.By Meryl RothsteinAugust 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Picture your ideal doughnut. Or actually, don’t. Picture my ideal doughnut. It’s a cake version, dense but not too dense. There is a clear delineation between the almost crunchy crust and the tender, lightly-spiced interior. It’s tossed in cinnamon sugar, so it’s sweet but not overpowered by some gloopy glaze.That perfectly describes the Dirt Bomb from Bantam Bread in Bantam, Connecticut, except—plot twist!—my ideal doughnut is actually shaped like a muffin. I don’t know why exactly, but I do know that means there’s plenty of the moist nutmeg-flecked insides to go around. This is the breakfast I look forward to every time I visit my parents, the treat I share with friends when they come too, the thing those same friends ask for on return visits.It’s just one of the many wonderful offerings at Bantam Bread, which has been making excellent breads since before it became very cool to make excellent breads (try the sunflower-flax!). And though I really hope you’ll make a trip, if you can’t, I have good news: They shared their recipe with us, which means that my ideal doughnut-ish thing can now be your ideal doughnut-ish thing, no matter where you live.Go there: Bantam BreadExplore Bon AppétitHighly RecommendDoughnutConnecticutRead MorerestaurantsI’ll Take Granny Rye Over Bread Bro Sourdough Any DayBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-06", "author": ["Condé Nast", "Meryl Rothstein"]}