{"id": "6eb57deeb29e082f01cf4e3861e648a3", "url": "https://www.bonappetit.com/recipe/japanese-milk-bread", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Milk Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueMilk BreadBy Alessandra GordonJune 1, 20193.8(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintSoft as clouds, white as snow, Japanese milk bread is the tender everyday loaf we want to bake right now. The precision required is an excellent excuse to buy a scale, but if you still want to measure out by volume, make sure to spoon the flour into the measuring cups and level off all ingredients—accuracy matters here. Using pain de mie pans creates a taller loaf with a crispier crust, but regular loaf pans will work as well. We streamlined the traditional spiraled dough shaping technique for ease, but a step-by-step tutorial on a more advanced method can be found here.IngredientsMakes two 9x5\" loaves2¼-oz. envelopes dry yeast (about 4½ tsp.)720g (5⅓ cups) bread flour34g (3 Tbsp.) sugar14g (1 Tbsp. plus 2½ tsp. Diamond Crystal or 1 Tbsp. Morton) kosher salt34g (2 Tbsp. plus 1½ tsp.) unsalted butter, room temperature, plus more for bowlPreparationStep 1Place a rack in middle of oven; preheat to 400°. Whisk yeast and ½ cup warm water (about 90°) in a small bowl. Let sit until foamy, about 5 minutes.Step 2Mix flour, sugar, and salt in the bowl of a stand mixer fitted with the dough hook on lowest speed. With the motor running, gradually add yeast mixture and 1½ cups warm water (90°). Increase speed to the next level and mix until dough firms up into a mass around the hook (it should still be sticking to the bottom of the bowl), 8–10 minutes. Increase speed to the next level; add 34 g butter in 3 additions, mixing 30 seconds after each. Mix until dough tightens and is smooth and elastic, 12–14 minutes.Step 3Slap dough onto a surface with force (reserve bowl), then immediately pull some of the dough up and fold it over itself. Repeat slapping-and-folding process 2 more times, then form dough into a ball. Butter reserved bowl and place dough inside. Cover tightly with plastic wrap and drape a kitchen towel over to keep warm. Let rise near oven (a warm, draft-free spot is ideal) until nearly doubled in size (dough should spring back slowly when you poke it), 30–45 minutes (time will vary depending on the warmth of your kitchen, but be careful not to overproof). Punch down dough, divide in half, and shape each into a ball. (Find the advanced shaping tutorial here.)Step 4Liberally butter two 9x5x5\" pain de mie pans and lids or 9x5\" loaf pans. Using your hands, flatten 1 ball of dough into a 9x6\" rectangle. Starting with a long end, roll up like a jelly roll into a tube. Place in a prepared pan, nudging to fit snugly. Repeat with remaining dough.Step 5Cover pans with plastic wrap; return to warm spot. Let sit until dough is ½\" from top of pan (don’t let it rise higher or dough will deflate when you slide on the lids), 30–45 minutes. Remove plastic wrap; place lids on pans if using pain de mie. Bake bread until deep golden brown, 35–40 minutes. Turn out onto a wire rack and let cool before slicing.How would you rate Milk Bread?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis is not in any sense milk bread... No tangzhong, no milk? It's identical to another sandwich loaf that I like, so good recipe, but this is just an enriched sandwich bread. NickIndiana10/23/2021This is a good, solid loaf of white bread.  It's not milk bread, there is no milk.  It's definitely not Japanese milk bread because there is n tangzhong.   JeziBardstown10/14/2021I wonder if Bon Appetit would consider changing the name of this recipe to Shokupan as Ayako & Family collaborators originally intended?C N Los Angeles3/26/2021DON'T start pre-heating the oven in the beginning as the recipe says; there's around two hours of making the dough and resting before you begin to cook it.  My oven is awesome and heats up fast, I give it about 30 minutes to fully heat the oven.\nThe bread is good, white bread.  I used milk in place of all the water.cheflo2Seattle7/18/202010/10 would make again. Easy, great flavour, and authentic, without the added step of tangzhong.  I make this by hand and the kneading isn’t difficult at all. Makes great, fast sandwich bread with a chewy toothsome crust.  Also great as hamburger buns.  Easy to make, you won’t even miss the milk.\n\nDon’t listen to the haters who gave this a poor rating without making it.  They’re fools. Try it for yourself. Smyotur6/4/2020I've been looking for a white sandwich bread which is soft yet \"tight\" enough to hold together as a sandwich.  This is fabulous!!!  I followed the directions exactly, including kneading 8 min then adding butter and kneading another 12 minutes.  Dough was rather sticky and soft when I slapped it on the counter, so I sprayed the counter with cooking spray to keep it from sticking. while forming the dough I lightly floured the counter.  I highly recommend this recipe1anwylerNew Orleans, LA5/11/2020I don't have bread flour, what if I use all purpose flour instead ?? If yes how much of gluten to add ?nehamakIndia4/20/2020I made it following this recipe and it was very good! Right this minute I am trying it with milk instead of water and a stick of butter. Wish me luck!AnonymousNew York baby4/6/2020I've never made bread before and it turned out great! Revathi MandavaNairobi, Kenya3/30/2020On the mixing step, is it 8-10 minutes, then another 12-14, so potentially 24 minutes of mixing, or is it 8-10, then add the butter and continue the clock, so the total mixing time is 12-14?Anonymous3/26/2020This worked really well for me! Followed all the instructions and the bread came out so soft. It also makes really great toast. I used dough conditioner in this. I can't wait to make again!AnonymousEl Paso, TX3/10/2020Also, I don't preheat the oven until about 20 minutes before I bake the bread. No reason to have it heating for both rises (about 1.5 hours)!cheflo2Seattle1/15/2020I made this twice and it was good.  The third time I made it I added one egg yolk and about 25 grams of dry milk powder and it was REALLY good!  I'll make it that way from now on. \nI usually make half of the recipe in a loaf pan and half into rolls.  This time I brushed the rolls lightly with an egg & cream wash and sprinkled with large flaky salt.cheflo2Seattle1/15/2020I was more surprised that this recipe doesn’t have a tangzhong than milk. But I don’t care, it’s delicious. It’s sturdy enough to be a sandwich bread (going to try with konbi’s pork katsu in this month’s issue.) The bread is wonderfully moist and flavorful and is super easy to make. \n\nI am still on the hunt for mils bread recipe this is more akin to the Asian bakery variety. When I look at their ingredients there are three listings for “dough conditioner” so I’m not even sure it can be made in a home kitchen. Maybe Claire can figure it out. :)AnonymousLos Angeles10/12/2019Came out great! I made it with my Ankarsrum mixer using the roller. I also used instant yeast instead of dry yeast, so I skipped the foaming step and just went straight to the mixing (all 2 cups of water at once). \n\nIgnore the low-star reviews from people who haven't the recipe and/or don't like the name.\n\nIn reply to anonymous (09/07/19) - yes, you certainly can knead it by hand, it will just take longer than the quoted times in the recipe. I'd suggest watching some of the videos that King Arthur Flour has on the subject. AnonymousDelaware, US9/29/2019Explore Bon AppétitBreadJapaneseEast AsianAsianBread FlourFlourYeastOther IngredientsSnackNut-FreeBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Alessandra Gordon"]}