{"id": "6ebc515bdb5bbd766f3d2c129e1bdfa2", "url": "https://www.bonappetit.com/recipe/curry-goat", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Curry Goat Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueCurry GoatBy Peter and Jeanine PrimeSeptember 22, 20204.1(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Rey LopezEmailPinterestPrintEmailPinterestPrintThis fall-off-the-bone marinated and slow-cooked goat is just one of many dishes that show up in Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast. The main flavor of this dish is owed to Trinidad and Tobago’s Chief Hot & Spicy curry powder, made specifically for duck and goat. It’s stronger and hotter than your typical Madras curry powder, so it stands up to the assertive flavor of meat. You can purchase it online or doctor up Madras curry powder to use in its place: Combine 3 Tbsp. Madras curry powder, 1 Tbsp. ground coriander powder, 2 tsp. ground fennel seeds, and 1 tsp. freshly ground black pepper. Serve the Curry Goat alongside Fruit Chow, Aloo and Chana, Tomato Choka, and the main event: the flaky Buss Up Shut Paratha Roti.Ingredients4 - 6 Servingsgoat3lb. cubed bone-in goat or lamb stew meatJuice of 2 limes1cup Green Seasoning½cup finely chopped garlic¼cup vegetable oil2Tbsp. Chief Hot & Spicy Duck/Goat Curry Powder1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1tsp. freshly ground black pepperassembly2Tbsp. vegetable oil3Tbsp. Chief Hot & Spicy Duck/Goat Curry Powder2tsp. ground cumin1medium onion, finely chopped3garlic cloves, finely chopped2Scotch bonnet or habanero chiles, \t1 finely chopped, 1 whole½cup Green SeasoningJuice of 1 limeKosher saltSliced chives (for serving)PreparationGoatStep 1Using your hands, toss goat, lime juice, Green Seasoning, garlic, oil, curry powder, salt, and pepper in a medium bowl to coat meat. Cover bowl and let sit at room temperature at least 2 hours, or chill up to 12 hours (go the full time if you can).AssemblyStep 2Heat oil in a large Dutch oven or other heavy pot over medium-high. Add curry powder and cumin and cook, stirring constantly, until fragrant and slightly darkened in color, about 30 seconds. Working in 2 batches, add goat and marinade and cook, turning occasionally, until outside is lightly cooked but not browned and marinade darkens in color, about 2 minutes per side. Transfer goat to a plate.Step 3Combine onion, garlic, chopped chile, and Green Seasoning in same pot and cook, stirring and scraping up any browned bits stuck to bottom of pot, about 1 minute, then continue to cook, stirring occasionally, until onion is softened and translucent, about 5 minutes longer. Return goat to pot along with any remaining marinade. Add remaining whole chile and reduce heat to medium-low. Gently stir to combine, cover, and cook until meat begins to simmer in the marinade and release some of its juices, about 10 minutes. Uncover and stir.Step 4Partially cover pot and continue to simmer, stirring gently every 10 minutes or so, until liquid evaporates, then add just enough water to scrape up browned bits stuck to pot; repeat process of simmering and adding water until meat is falling from the bone and curry is thick and deeply colored, 2–3 hours total. Mix in lime juice and season with salt. Top with chives just before serving.How it all comes togetherStep 5Use the silky shreds of roti to scoop up all the various curries, chows and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Curry Goat?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI'm so grateful to see a recipe posted for those of us BA readers who live on Caribbean islands with nary a Trader Joe's or a Whole Foods in sight.  All the ingredients for this recipe were in my cupboard (Chief curry powder!), growing in my yard (culantro!  broad leaf thyme! Scotch bonnet peppers!), or available in my grocery store (goat in abundance!).  The recipe came out great - even better since I planned ahead and spaced it over three days, making the Green Sauce on Day 1, marinating the goat on Day 2, and cooking the goat (I used the Instant Pot) and making/assembling the roti on Day 3.  Thumbs up all around the table.AnonymousU.S. Virgin Islands10/13/2021AV8R, I live in Oregon - sometimes Costco has frozen goat! It's also often available from farmers' markets. I suspect it's also available in Asian markets since it's frequently on the menu in Vietnamese restaurants.CKPortland, OR9/10/2021GOAT.\nREALLY.\nI live in coastal Alabama.\nI have have about as much chance of finding goat here as I have in finding a pearl in an oyster.\nNo...the pearl odds are actually more likely.\nBut you guys ARE entertaining.\nGoat.\nIt's right there at the Winn-Dixie next to the ostrich cutlets.AV8Rcoastal Alabama9/10/2021In light of the previous review — the article intro specifically mentions how you can create the curry powder at home.Anonymous6/7/2021Don't like that they are asking for pre made seasoning (Chief Hot & Spicy Duck/Goat Curry Powder), not easily available to international audiences.Anonymous9/26/2020Explore Bon AppétitCurryTrinidadianCaribbeanGoatMeatLambMainDairy-FreeGluten-FreeNut-FreeKetoBraiseKwanzaaJuneteenthDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Peter", "Jeanine Prime"]}