{"id": "6ec801f25db49c17fd4775cec07d05c0", "url": "https://www.bonappetit.com/story/olivier-lemasson", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Olivier Lemasson's Wine Changed My Life, and A New Vintage Is ut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Wine That Changed My Life Has a New Vintage, and I Can't Stop Thinking About ItI wouldn’t be here as I am today if it wasn’t for Olivier Lemasson’s “R-13” and all the “R”s that have come since.By Marissa A. RossSeptember 27, 2019FacebookTwitterEmailIllustrations by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.Everyone has that one wine. Saying it changed your life might be a bit much; maybe it was just your first Chenin Blanc after a life of Chardonnay or a glass that excited you in a way you thought only the brush of a crush’s hand could. Perhaps it was both. But it affected you like no other wine had before, forever altering how you experienced wine from that point on. Mine was Olivier Lemasson’s “R-13,” and it did in fact change my life.It was fall of 2014, back when wine was a hobby I couldn’t afford. I stopped at Domaine LA after work, asking for something under $20, like I always did. At the shop, $19 felt like a splurge but at home that night, that bottle of “R-13” was worth a million to me. The red blend of Grolleau, Gamay and Côt (the fancy French word for Malbec) from the Loire Valley was a thrilling bait and switch that smelled like wet Redwoods in a barnyard, covered by flowering star jasmine. And it tasted like the dusty, brambly blackberries bursting with juice I used to pick in Mariposa—sprinkled in sea-salt—with acidity that zipped quicker than jeans in a lover’s bedroom. Puzzling and blood-pumping, I must have drunk a case of it; every bottle a juicy rabbit hole that pushed me to pay undivided attention to each note yet inevitably drink it for pure pleasure. It was the wine that made me obsessed with France, the wine that made me understand Brettanomyces, and the wine that made me dedicate myself to natural wine.The next year I went searching for my beloved “R-13” only to find out there was never going to be another “R-13.” While I knew the “R” was for Rouge, to signify an ever-changing blend, I hadn’t put together that the “13” was for the vintage. Undeterred, I bought six bottles of the “R-14.” It was good. The “R-15” was too ripe and chocolatey for me, a reflection of the heat that plagued the 2015 vintage across most of France. I liked the “R-16” and “R-17” but still, they weren’t the same.I understood the influence and importance of vintage well by now and had come to accept that there would never be another wine like Olivier Lemasson’s “R-13.” My thoughts echoed the last scene of Chinatown: “Forget it Ross, this is Natural Wine.”Then Oliver Lemasson’s “R-18” hit the shelves this year. The “R-18” is a blend of Grolleau and Côt and glimmers like a ruby in the sun. It smells like ripe cherries and tart plums ground with a limestone mortar and pestle and seasoned with white pepper. It’s light bodied with the same spicy yet mineral-driven red fruit from the nose, but with a heavy wave of raspberries, splashes of strawberry, and chewy notes of blackcurrant with tannins that linger softly like a fond, old memory. That memory was of my dearest “R-13.”I wouldn’t be here as I am today if it wasn’t for Olivier Lemasson’s “R-13” and all the “R”s that have come since.And I can’t say why. They’re different blends, different tasting notes. The “R-13” was Bretty, the “R-18” is well-balanced. But I bought at least a case of the “R-18,” and each bottle took me back to those moments before I ever thought about wine as a career, when I wrote about bottles simply because I loved to, when I wasn’t an author or a wine editor or a verified Instagram and a commodity in the wine industry and a pawn in their politics. It’s an energy, a feeling, a knowingness I discovered in a glass that changed the trajectory of my life forever, and five years later has been reignited and reaffirmed by the same winemaker in a different wine. I wouldn’t be here as I am today if it wasn’t for Olivier Lemasson’s “R-13” and all the “R”s that have come since.So, dear reader with that one wine, you may have loved but you have not lost. Every vintage will be different, whether it’s because of the weather, the specific grapes used or maybe the winemaker changed up their vinification process. But you owe it to yourself, as well as that one wine and its winemaker, to stick with it. Different vintages allow you to contrast, to compare, to learn and to be truly surprised. And appreciative, when that one wine that changed your life comes back in a new glass to remind you exactly why it did.Explore Bon AppétitHealthyishUnfiltered essayRead MoreLifestyleIf You Try One Greek Wine This Fall, Make It ThisBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-27", "author": ["Condé Nast", "Marissa A. Ross"]}