{"id": "6ee7f57aa4b1bd097d3efe2dfaba643e", "url": "https://www.bonappetit.com/story/aurias-sambal", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "This Jarred Sambal Changed Our Grain Bowls For Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Jarred Sauce Changed Our Grain Bowls For GoodThis lime leaf sambal is lip-numbingly spicy but full of complex umami flavor.By Chris MoroccoMay 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!When it comes to store-bought sauces, it takes a lot to impress me. Many spicy condiments blend into fiery sameness, and even the ones that don't hold back on heat often offer little flavor aside from burn. Yet occasionally, a condiment comes along that's like a black hole, compressing physics-defying amounts of flavor in a tiny package. Such is the case with Auria's Kitchen sambal sauces. I recommend beginning with the lime leaf sambal, which combines the mellow fire of green chili peppers with the sweet florality of makrut lime leaves. It is stellar as a marinade, the base for a stir-fry sauce, or just eaten as-is.Auria's hot chili sambal is a big leap up in terms of heat and flavor-density. The lip-numbing chili flavor is scorchingly hot, but shrimp paste creates an umami-rich intensity. (Auria swears by caramelizing the shrimp pastes, which mellows its intensity while keeping its depth.) Still, even to me, this sauce is HOT. But I can't stop eating it, and a spoonful dabbed on the side of a stir-fry or rice bowl is enough to flavor everything it touches on the plate. — Chris Morocco, senior food editorBuy it: Auria's Malaysian Kitchen Lime Leaf Sambal, $11.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingSambal OelekCondiment/SpreadRead MoreLifestyleThese Linen Napkins Make Me Feel Way Fancier Than I AmBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-27", "author": ["Condé Nast", "Chris Morocco"]}