{"id": "6ef65464faf2ef830499ab8cf6fa9e95", "url": "https://www.bonappetit.com/story/angie-mar-loves-ina-garten-shrimp-scampi", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Chef Angie Mar Learned Everything About Shrimp Scampi from Ina Garten | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Angie Mar Learned Everything About Shrimp Scampi from Ina GartenThe chef-owner of The Beatrice Inn spent her teen years making this her after-school special.By Angie MarOctober 31, 2018FacebookTwitterEmailFacebookTwitterEmailIn honor of Ina Garten's guest editing week, we asked chefs and celebrity fans to share their favorite Barefoot Contessa recipes as part of our series “How Easy Is That?” Below, Angie Mar, chef-owner of The Beatrice Inn in New York City, recounts making shrimp scampi for her family when she was 15. \n I come from a very large family of food lovers and restaurateurs, so food is something I’ve always been interested in. I’ve loved Ina since I was a teenager, and gravitated toward watching Barefoot Contessa because her style of cooking very much reflects how a lot of the women in my family approach it. Unlike a lot of semi-homemade BS cooking shows, she actually cooks real food for her friends and Jeffrey. So I watched her, and then I did the same for my family.When I was 15, I saw her make linguine with shrimp scampi, so I scribbled down the ingredients, went to the store, and just cooked it. I have always been an instinctual cook, so I don’t think I followed the recipe to a T, but picking up tips, like not fully draining your pasta water, were hugely valuable to me. I was tasked with making after-school meals for me and my two younger brothers, and this was always a highly requested recipe. It was easy and quick to make, and we all fell in love with it. We’d often sit on the sofa and eat it while watching Ina on TV and doing—or not doing—our homework.It was also a source of inspiration for future meals. I often made other versions of this dish, adding clams or squid into it, or whatever the market had that looked good. That’s something fantastic about a tried-and-true recipe—it’s always there for you to rely on, even if you change some of the components.I connect with Ina because we both relish our time in the kitchen and focus on using simple ingredients—while making sure they are the best ingredients possible. At the end of the day, no matter how complicated our recipes are at The Beatrice Inn, when I go home, that’s how I like to cook. I live in New York and have a small kitchen, so I want things that will be super easy and won’t require a lot of cleanup, but I don’t mind taking the time to make something delicious.Although I haven’t made this particular recipe in a very long time, I am writing a cookbook right now and there’s a langoustine and spaghetti that very much stems from all of that after-school cooking of Ina’s recipe: an homage to the same shrimp scampi that I made when I was 15.—As told to Alyse Whitney Ina Garten’s Linguine with Shrimp ScampiFrom Barefoot Contessa Family StyleServes 6I wrote this recipe for my column in Martha Stewart Living magazine called “Entertaining Is Fun.” Except for the shrimp, you probably have most of the ingredients around the house and when you’re late from work, it’s a quick meal to pull together for dinner. Buy peeled and deveined shrimp and it’s even faster!Vegetable oilKosher salt1½ pounds linguine6 tablespoons (3/4 stick) unsalted butter5 tablespoons good olive oil3 tablespoons minced garlic (9 cloves)2 pounds large shrimp (about 32 shrimp), peeled and deveined½ teaspoon freshly ground black pepper¾ cup chopped fresh parsleyGrated zest of 1 lemon½ cup freshly squeezed lemon juice (4 lemons)½ lemon, thinly sliced in half-rounds¼ teaspoon hot red pepper flakesDrizzle some oil in a large pot of boiling salted water, add 1 tablespoon of salt and the linguine, and cook for 7 to 10 minutes, or according to the directions on the package.Meanwhile, in another large (12-inch), heavy-bottomed pan, melt the butter and olive oil over medium-low heat. Add the garlic. Sauté for 1 minute. Be careful, the garlic burns easily! Add the shrimp, 1 tablespoon of salt, and the pepper and sauté until the shrimp have just turned pink, about 5 minutes, stirring often. Remove from the heat, add the parsley, lemon zest, lemon juice, lemon slices, and red pepper flakes. Toss to combine.When the pasta is done, drain the cooked linguine and then put it back in the pot. Immediately add the shrimp and sauce, toss well, and serve.Recipe reprinted from Barefoot Contessa Family Style: Easy Ideas and Recipes That Make Everyone Feel Like Family. Copyright © 2002 by Ina Garten. Photographs copyright © 2002 Maura McEvoy. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Explore Bon AppétitIna GartenShrimpPastaHow Easy Is That?CelebritiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Angie Mar"]}