{"id": "6ef770a526196b3c7582f6920fbdbc16", "url": "https://www.bonappetit.com/story/the-perfect-bar", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "The Perfect Bar Literally Tastes Like Reese's Peanut Butter Cups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Protein Bar Literally Tastes Like Reese’s Peanut Butter CupsAnd somehow, it contains vegetables too.By Nikki CampoDecember 23, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. Such as the Perfect Bar.In fourth grade, I made a giant 3D replica of my favorite candy: Reese’s Peanut Butter Cups. I can’t remember the point of the assignment, but I’ll never forget bursting through the classroom door with my huge Styrofoam and poster board creation. Back then, I believed no more perfect marriage of peanut butter and chocolate existed than Reese’s.Today, I realize something even better exists. The Perfect Bar’s name carries not one single shred of irony. The refrigerated bar comes in 12 flavors (some seasonal), but I only need one: Dark Chocolate Chip Peanut Butter with Sea Salt. The peanut butter is smooth and creamy, the texture that of thick cookie dough. Tiny chocolate chip clusters cling to the surface. Although the bars keep at room temperature for three days, I like them chilled. Lately, I’ve added them to my morning routine: I get up at 5 a.m. I make coffee, fill my water bottle, and grab a bar from the fridge. Even without eating anything else for breakfast, I’m full and happy for hours, thanks to 15 grams of protein.Each bar also contains 20 superfoods, but who cares when they’re so mind-bendingly delicious. The bars are healthy, but that can be your little secret if you want. Not only are they certified organic, Non-GMO Project Verified, gluten-free, and kosher, but they also contain a powdered blend of, ahem: flaxseed, rose hip, tomato, alfalfa, celery, kelp, dulse, carrot, orange, apple, and spinach. It’s vitamin- and mineral-dense and, amazingly, all these veggies are tasteless. So when you buy the bar, just deduct it from your vegetable budget.So how can the bar taste better than a Reese’s while featuring vegetables? Leigh Keith, the cofounder and co-CEO of Perfect Snacks, explained to me that her dad, Bud Keith, a health-conscious hippie, perfected this recipe when he, his wife, and their first six children lived in a motorhome (and later, a bus). Among the family secrets to perfect texture: freshly ground nut butter. “If you try to use premade peanut butter that’s been sitting in a drum for months and months, it’s just not the same,” Leigh says. The protein comes from egg and milk rather than whey, and honey provides just the right sweetness.Starting at age 10, Leigh made and sold bars to friends using her dad’s recipe. When Bud’s health deteriorated, Leigh, then 19, and her brother Bill, committed to providing for their family. The plan? Get serious about making and selling Perfect Bars. Their company launched in 2005, and for years, before they partnered with Mondelēz International in 2019, their production line consisted of family members, rolling pins, and a KitchenAid mixer. “We leveraged our life savings to buy a candy wrapper machine off of eBay,” Leigh says. Dark Chocolate Peanut Butter Perfect Bars may not be candy, but I wonder what my 10-year-old self, schlepping her giant cardboard Reese’s to class, would have said if I told her one day, she’d love a protein bar even more. She probably would have called my bluff, but she would have been so very, very wrong.Dark Chocolate Chip Peanut Butter Perfect Bar$3 at Target$20 at Amazon (10-pack)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-23", "author": ["Condé Nast", "Nikki Campo"]}