{"id": "6f0e56019e74fd518b8840dcb099656e", "url": "https://www.bonappetit.com/story/brownie-mary", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Brownie Mary Is the Reason You Can Get Medical Marijuana Today | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBrownie Mary Is the Reason You Can Get Medical Marijuana TodayAt the height of the HIV/AIDS crisis, she baked nearly 600 brownies a day.By  Madison MargolinApril 29, 2019FacebookTwitterEmailPhoto by Scott SommerdorfFacebookTwitterEmailThis story is part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Check out this story in their spring issue, and click here to read more about how to make cannabis delicious.Brownie Mary stood at the center of 5,000 people at a rally in front of San Francisco City Hall with her short, curly gray hair, her granny specs, and a sweater vest covered in pins. It was August 25, 1992, about a month after her third arrest—this time at the home of a cannabis grower about two hours up the coast in Cazadero. The 69-year-old activist was mixing cannabis into brownie batter when law enforcement busted in and charged her with possession. Released on bail, Mary garnered international media attention as the Sonoma County district attorney tried to charge her with two marijuana possession felonies.\"If the narcs think I'm gonna stop baking brownies for my kids with AIDS, they can go fuck themselves in Macy's window,\" she cried out, her fists up in the air.\"God, it was beautiful, and so cool,\" recalled Clint Werner, gay activist, author, and friend of Mary's.Born Mary Jane Rathbun in Chicago in 1922, Brownie Mary was cut from the cloth of \"tough, traditional, blue-collar, working-class lefties,\" says Werner. She spent most of her childhood in Minneapolis, where she went to Catholic school. She moved out of her parents’ house as a teenager, finding waitressing work and getting involved in social activism. She fought for abortion rights and miners' rights to form unions before making her pilgrimage to the mecca of civil disobedience, San Francisco, during World War II.In San Francisco, Mary married and had a daughter, Peggy, but the marriage didn’t last. By the 1960s, Mary was single and involved in the counterculture, anti-war movement. In 1974, she shared a joint with her new friend Dennis Peron, one of the godfathers of medical marijuana, at Cafe Flore in the Castro. Soon after, she joined the ranks of revolutionaries who would go on to pioneer cannabis law reform.Mary kept a job as a waitress at IHOP for 25 years while running a side hustle selling pot brownies. \"She was above ground; [her weed] was for everyone,\" says John Entwistle, Peron’s husband and co-author of Proposition 215, which made California the first state to legalize medical marijuana in 1996. \"'I'm Brownie Mary; buy my brownies.' The kids loved it.\" But she got busted twice within a two-year span, and, after her second arrest in December 1982, she took her brownie business underground.\"The judge said, 'You have to stop the Brownie Mary shtick. It's over. If you do it again, we'll send you to jail,'\" Entwistle explains. Mary was able to do community service in lieu of prison time, and she ended up at the Shanti Project, a nonprofit supporting those in the emerging AIDS crisis. Her early work in the community impacted by AIDS sparked a passion that would drive Mary for the rest of her life.By 1984, she was a volunteer in the AIDS ward at the San Francisco General Hospital and baking nearly 600 brownies a day—but only for those who needed them. Cannabis was especially helpful for AIDS patients with wasting syndrome, increasing their appetite, slowing their high-speed metabolic weight loss, and easing their suffering.The early days of the AIDS epidemic were the most difficult. The disease was so controversial that nobody would even admit that it was real. “A lot of people who were unlikely heroes stepped up, and Mary was one of them,\" Entwistle says. \"She became one of the first people to put her hands on the epidemic, [having] instinctively figured out that pot would be a good thing for these guys.\"Mary never made much money from her brownie sales beyond covering the cost of ingredients. Entwistle describes her as “down to earth, very humble, but in a non-assuming way.\" She lived in public housing not far from Haight-Ashbury and the Castro. Friends would joke, \"What are you gonna do with that money? Get a new perm?\"Mary lost her daughter in the early ’70s to an auto accident. She adopted the many runaway kids of San Francisco as her own. And although she always identified as straight, she liked to assimilate into the San Francisco gay scene, drinking and smoking cigarettes well into her 70s. According to Entwistle, Peron's favorite line was \"Pass that old lady the joint!\"After her arrest in Cazadero in 1992, Mary testified to the San Francisco Board of Supervisors about the medical benefits of marijuana, leading to a Board resolution to make medicinal cannabis possession the \"lowest priority\" in arrests and prosecution. On the day of the City Hall rally, the Board declared August 25th to be \"Brownie Mary Day\" in recognition of her work at the San Francisco General Hospital.That same year, Mary helped Peron and Entwistle open the San Francisco Cannabis Buyers Club, initially as a ploy to get the cops to bust them so they could set a precedent in court. \"We set up Brownie Mary's Cafe in the basement of Dennis's house,\" Entwistle recounts. \"We went through the motions of physically selling pot to these people, we took money, put pot on a scale, weighed it out, and allowed media to film it with folks consuming it in the room. But [the police] wouldn't bust us is what happened.\" And so the real Buyers Club was born, filling what was a desperate need in San Francisco.Prop 215 passed in 1996, less than a decade after Brownie Mary’s testimony. Two years later, Washington, Oregon, Alaska, and Nevada passed their own medical marijuana initiatives. Today, medical marijuana is legal in 33 states, and ten have legalized it for adult use. \"It wasn't the hippies per se, it wasn't the standard establishment marijuana movement players, but it was the gay people who legalized pot in California because of the AIDS epidemic,\" says Entwistle. \"That's been forgotten to some extent.\"And Mary was right there at the center of that scene, the \"loving broodmother to HIV patients,\" as Werner describes. Following Prop 215, Mary's health suffered. She struggled with osteoarthritis, chronic obstructive pulmonary disease, and colon cancer. She, of course, used medical marijuana to treat her pain.In 1999, she passed away from a heart attack at the age of 76. A week later, 300 people gathered in the Castro for a candlelight vigil to honor her life. Mary's friend and district attorney Terence Hallinan, who was in attendance, remembers her as \"the Florence Nightingale of the medical marijuana movement.\"Today, her legacy lives on in extra-oily pot brownies, Entwistle says (the fat is where the cannabis compounds reside). \"We loved to ask her, 'What's the recipe?' and she always made Betty Crocker jokes,\" he says. \"She once explained it to me: When you're buying boxes of brownies, look at how much oil the recipe calls for, and go for the one that uses the most oil. But the mystery—the recipe for her brownies—goes to her grave.\"Explore Bon AppétitHealthyishWomen in CannabisCannabisessayRead MoreLifestyle4 Classic Cannabis Cookbooks We Can’t Believe ExistGallery4 SlidesBy Anja CharbonneauRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Madison Margolin"]}