{"id": "6f15b49d79550be66496e4af4bb9e03d", "url": "https://www.bonappetit.com/story/jia-tolentino-writing-pasta", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Marijuana Edibles and Pounds of Pasta: Jia Tolentino on Writing and Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMarijuana Edibles and Pounds (and Pounds) of Pasta: Jia Tolentino on Writing and CookingHow holing up in a series of remote Airbnbs to work on her book reminded her why she writes in the first place.By Jia TolentinoMarch 20, 2020FacebookTwitterEmailIllustrations by Clay HicksonFacebookTwitterEmailAbout two and a half years ago, I decided it would be a good idea to write a book on the side of my full-time job as a writer (or as I prefer to say, blogger) for the New Yorker.In retrospect, I should have planned to take some time off work, but in defense of my own stupidity—a good subtitle for a book, come to think of it—I can only say that, like any other millennial who lacks the weighted blanket of family money, I understand the world I came of age in as a sort of Luigi’s Mansion of institutional collapse and economic precariousness. Even now I feel fairly certain that if I ever stop working for more than 45 minutes I’ll lose my health insurance, bring a curse upon my loved ones, get into an exciting freak accident, and then die.But after about a month of trying to activate my book muscles when I was—to use a rather old-fashioned phrase—“done with work for the day,” I realized that my attempts to demarcate one project from another were (at best) not working and (if I’m being real) terribly sad. Techniques such as “washing my face at 4 p.m.” and “changing from day sweatpants into night sweatpants” radiated desperation and unconvincing performance. It was like putting a checkout divider between a wedge of aged Gouda and a bottle of Clorox when the cashier at the grocery store definitely knows I’m going to ingest both of them later that night.And so I concluded, as many have before me, that the solution involved getting out of the city. Such was the genesis of the only real writing ritual that I’ve ever developed: taking the Metro-North to Poughkeepsie on a Thursday afternoon, renting a car near the train station, picking up groceries, driving to the cheapest place I could find on Airbnb with a wood stove and a kitchen, and spending the next four days subsisting on a healthy variety of marijuana edibles and a strong third to half-pound of pasta per meal.I’m not kidding when I say this routine made me feel like Gwyneth Paltrow. To me it was a secret pinnacle of spiritual, emotional, and physical wellness. It was a cross between a boot camp and a slacker’s vacation. It was hiking in the sunlight and muttering “whoa” after 12 minutes of staring at embers and grinding black pepper out of a stranger’s sky-blue ceramic pepper mill into a shimmering lake of olive oil inside an unfamiliar dented pan.In my favorite of all these tiny backyard guesthouses, the lights were warm and low in the kitchen; the table was just big enough for two red placemats and a candle; there were old pennants hanging on the walls and owls hooting in the yard. I grated myself a soft snow pile of Pecorino, shook it over a swirled nest of spaghetti, and served myself a huge bowl of sharp, indulgent cacio e pepe. I slurped, splattering sauce on Anna Karenina, which was open to the part where Oblonsky was ordering roast beef and oysters, and remembered how I could avalanche myself with pleasure if I tried.These weekends, which I took at the beginning of each month, were the full expression of all the compulsions within me that are unshareable by definition: to be lavishly alone; to eat in priestly silence; to stay up late reading; to think in the morning and write all night. Each trip was similar—the train, the car, the work, the pasta—but each thing was a little different every time.Illustration by Clay HicksonOnce in October, it was raining, and I got a splinter walking barefoot across the rough wood floor. I started a fire in the early afternoon, and made spaghetti carbonara my favorite way, slipping a molehill of garlic into the eggs. I chopped Parmesan with a knife because I couldn’t find a grater, crisped bacon in quantities I would’ve had to explain had anyone else been present, and finished the whole pot in a day and a half.A few months later, in January, it was bluebird skies and frosty. I was staying at an impersonal, spooky rental property in the hills around Minnewaska State Park, reading chemical analyses of the MDMA molecule, and trying not to get freaked out by the lack of phone service. It was a relief to focus my attention on something right in front of me: celery and carrots, browning to caramel for a white wine Bolognese.Without these trips I’d never have finished my book, mainly because I would have lost my grip on the reason I wanted to write it in the first place. Underneath the structural conditions that I spend my professional life both objecting and yielding to, writing is fundamentally a matter of pleasure for me. More than that, it’s a comfort. It is the self-perpetuating solace of discovering, over and over, that you don’t need much—you hardly need any equipment, you can get it done in strange places—to be satisfied, or even, occasionally, thrilled.Of course, the same goes for making and eating pasta. And on these weekends, the two became parallel acts for me. I grated parm with a highlighter in my mouth; I inhaled rigatoni the way I was working—until it was too much, but the good kind of too much, and it was time to go to bed.There are many ways, too, in which making pasta is a far better pastime than writing. Every time I “get my materials together” for a piece, I seem to end up spending two hours on the Wikipedia page for Smilodons, which, as we all know, are the most famous prehistoric saber-toothed cats, reaching up to 880 pounds in their largest iteration. But I can get in and out of a Hannaford supermarket with everything I need for sausage-and-broccoli orecchiette in six minutes flat.Every time I sit down to write something, I understand that the likely outcome is that it’s going to be awful. Conversely, after you’ve made a pasta once, you’ll probably get better at it. Unlike with writing, pasta will only ever be more precisely like what you wanted it to be. When you’ve spent all day wading through the swamp of your own inadequacies, there’s no absolution like spaghetti dripping in pepper and cheese. And it was the spaghetti that reminded me, before the writing did, that the way we do things matters. If we cook the way we want to, we eat the way we want to. If something is absorbing to produce, it will be absorbing to consume. And even if you don’t end up with anything you ever want to share with other people, you’ll still have made something—and this is all you can hope for—for yourself.Jia Tolentino is a staff writer at the New Yorker and the author of the essay collection Trick Mirror. She lives in Brooklyn.Explore Bon AppétitPastaFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-20", "author": ["Condé Nast", "Jia Tolentino"]}