{"id": "6f1518c4bb84e5d1b0acb962b5d4d730", "url": "https://www.bonappetit.com/recipe/saag-paneer-but-with-feta", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Saag Paneer, But With Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueSaag Paneer, But With FetaBy Priya KrishnaMarch 19, 20194.3(131)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintThis riff on the classic dish swaps paneer out for salty chunks of feta. And while feta and spinach is an iconic combination, mozzarella or even tofu cubes are also great here. Do seek out the umami-charged asafetida at an Indian grocer or online—just a pinch of this pungent powder makes all the other spices come alive.Recipe adapted with permission from Indian-ish by Priya Krishna with Ritu Krishna (Houghton Mifflin Harcourt). Copyright © 2019. Ingredients4 servings¼cup plus 2 Tbsp. ghee or extra-virgin olive oil2Tbsp. coriander seeds¼tsp. ground cardamom1small onion, chopped1garlic clove, finely chopped11½\" piece ginger, peeled, chopped1lb. baby spinach (about 12 cups)1small Indian green chile or serrano chile, coarsely chopped1½tsp. fresh lime juiceKosher salt6oz. feta, cut into 1\" pieces1tsp. cumin seeds¼tsp. asafetida (optional)¼tsp. red chili powderRoti or rice (for serving)PreparationStep 1Heat ¼ cup ghee in a large skillet over medium. Cook coriander seeds and cardamom, stirring constantly, until starting to brown, about 2 minutes. Add onion and cook, stirring occasionally, until translucent and slightly browned, about 5 minutes. Mix in garlic and ginger and cook, stirring, 1 minute. Add spinach by the handful, letting it wilt slightly after each addition before adding more. Cook until all of the spinach is just wilted, about 3 minutes. Remove pan from heat and add chile and lime juice; season with salt. Let cool 5 minutes.Step 2Transfer spinach mixture to a blender (reserve skillet) and blend until a coarse paste forms, about 1 minute. Return spinach mixture to pan and set over low heat. Stir in ½ cup water, then gently fold in feta, being careful not to break up. Cook until feta is slightly softened and has absorbed some of the sauce, 5–7 minutes.Step 3Meanwhile, heat remaining 2 Tbsp. ghee in a small saucepan over medium-high, 1 minute. Add cumin seeds. As soon as cumin seeds start to pop, sputter, and brown, remove from heat, 1 minute tops. Immediately add asafetida, if using, and chili powder. Pour ghee mixture over spinach mixture. Serve with roti or rice.Step 4Do Ahead: Spinach mixture (without spiced ghee mixture) can be made 1 day ahead. Let cool; cover and chill.How would you rate Saag Paneer, But With Feta?Leave a ReviewTell us what you thinkReviews (81)Back to TopTrianglePaneer is so easy to make and would be great here. You could even have a combination of feta and paneer.Adobe Bluealpharetta ga3/18/2022I love this recipe - I make it all the time. Note, the red chile powder is cayenne. I also recommend leaving the seeds in the Serrano pepper. The heat is so delicious with the feta. And make sure you use a quality food processor. Anonymous12/7/2021I've made this dish multiple times because I absolutely CRAVE it on a regular basis. I need to get in the habit of doubling or tripling it because I never have enough left over. I love adding a variety of greens, including a mix of sweet spinach and bitter greens like radish tops, mustards, and all the bolting Asian greens I perpetually have in my garden. This dish is really special when you use a high quality feta. My favorite is Valbreso, the French sheep milk brand. Also, next time I'm going to try adding less salt and subbing leftover feta brine for some of the water. LGPortland, OR12/3/2021I had every intention of doing this by the book, but wound up with two small changes that were fantastic. 1) I was a little short on spinach, so I chiffon added some de-stemmed kale and threw it in. It added some extra texture to the spinach. 2) Toward the end of the recipe, I was about to add the feta, but my feta looked spoiled. So I tossed it out and cubed some halloumi. I fried the halloumi with the ghee/cumin and then mixed it into the puréed spinach-kale mix. Halloumi was fantastic. As with feta, it is salty, but it holds up better in the spinach mix. This is now my go-to saag not-quite-paneer recipe. Thank you, Priya!NokNokLisbon, PT11/18/2021This recipe is so amazing. I made it true to the instructions for the first time and loved it as it. Dish is super well rounded with the spices and lime juice.\nAlso I find an immersion blender is way easier than the food processor, just add the water before hand to get it going. AnonymousMontreal11/16/2021I am so baffled by the whole coriander seeds!  Whole seeds did not break down hardly at all during the blending process, granted I used a cusinart and not a blender, but even if I broke out the vitamix in order to pulverize the seeds I think the spinach would be too smooth.  The whole seeds just ruin the dish, they are so bitter, I've been trying to pick them out but it's a disaster.  AnonymousNew York, NY11/7/2021An all-time favorite!SummerChicago9/8/2021This recipe is amazingly versatile.   Going with the title of Priya's cookbook, I use Indian-ish spices when I don't have all the ingredients, and I  find that this works even better with lacinato kale, which I had in abundance from my garden.  The onion is essential, however.  Onion-ish won't do.     The pungency of the cheese makes a difference.  I actually made this with paneer once and was disappointed!  The Greek sheep milk feta from Costco is my go-to.   For those who say this is bland -- I would check the freshness of your spices!   JoeColorado, USA5/9/2021Loved this recipe. You must use more garlic, salt and pepper than the recipe states. I used a Pablano pepper and recipe was still wonderful. Would love to experiment with dairy-free feta cheese... SarahMontauk, NY3/12/2021I love this recipe! I’ve been looking for a good Saag Paneer and the variation with feta is delicious. Kids like it too! Chantal Edmonton, Alberta 2/23/2021I tried making this without ghee and coriander. From the other comments, it seems that those are the ingredients that really pack the flavor. So if you want to make this, make sure you have either or both of those! It was pretty bland without. TaraNew York, NY2/19/2021Absolutely delicious recipe. I added mustard seeds after cooking the coriander seeds for 2 mins as well. Coriander seeds take longer to cook. I also subbed the pepper for chopped pickled jalapeño since I had that on hand. The only thing I'd recommend is that you make it as soon as you can!! KatarinaDenver, CO1/21/2021Found the flavour really underwhelming and the texture extremely smooth. I had to add more garlic and spice to liven it up a bit. Cant say I’ll be making it again.Anonymous1/6/2021I find it odd that BA removed Priya's name from this recipe. For anyone curious, this delicious recipe was developed by Priya Krishna and it comes from her book Indian-ish.Anonymous1/3/2021I've made this 2 or 3 times in the past few months and I'm back checking the ingredients while I make my grocery list because I'm been craving it again. Perfectly creamy, warm, tangy, flavorful. Everything I want as the weather gets colder.MarenSt. Louis, MO11/18/2020Explore Bon AppétitIndianSouth AsianAsianSpinachLeafy GreensVegetableFetaCheeseMainSideVegetarianGluten-FreeNut-FreeKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Priya Krishna"]}