{"id": "6f162761dd94c4cbd73316b9df0f5698", "url": "https://www.bonappetit.com/story/red-velvet-cupcake-murder", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "The Hannah Swensen Mysteries Are Books For Crime Fans With a Sweet Tooth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingLove Baking? Love Murder Mysteries? This Is the Very Specific Book for YouIt was the baker in the library with the candlestick.By Tyneisha LewisJanuary 31, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. Up next, the ‘Hannah Swensen Mysteries.’For me nothing is better in winter weather than a cozy mystery book. My favorite series is the Hannah Swensen Mysteries by Joanne Fluke, which follows a baker and amateur sleuth who runs the Cookie Jar bakery and solves crimes in the fictional town of Lake Eden, Minnesota.The first book in the series I read was Red Velvet Cupcake Murder. I was at a bookstore when the cupcake-adorned cover caught my attention from the shelves. The story begins with the grand reopening of the Albion Hotel, which Hannah caters with her famous red velvet cupcakes. But the event takes a dramatic turn as a guest is found dead and Hannah is the prime suspect when the police discover the victim ate a red velvet cupcake with tranquilizers baked into it. To clear her name and find out who really committed the crime, Hannah begins her own investigation. Meanwhile, she’s caught in a love triangle between Norman, a dentist, and Mike, a detective on the police force. The theme of red velvet cupcakes drew me in, but the charm of everything—the setting, characters, and story—kept me reading.But the cream-cheese-frosted crimes don’t end there! Each book in the series offers a different mystery centered around a different dessert. From cookies to cakes to muffins, there’s one for every sweet tooth. In addition to Red Velvet Cupcake Murder, I’m a fan of Strawberry Shortcake Murder, Chocolate Chip Cookie Murder, and, mmm, Blackberry Pie Murder. Each of these mysteries also includes recipes for Hannah’s baked goods for readers to try out for themselves. Red Velvet Cupcake Murder, for instance, features recipes such as Red Velvet Surprise Cupcakes, Tickled Pink Lemonade Cookies, and Double Whammy Lemon Cake.The series boasts dozens of titles; Fluke’s first Hannah Swensen book was Chocolate Chip Cookie Murder, published in 2000, and the latest, Caramel Pecan Roll Murder, will be released in February. Fluke’s fans call her “the queen of culinary capers”—and her stories have shown me just how cozy mysteries can be when food is at the heart of them.Photograph by Isa ZapataRed Velvet Cupcake Murder$8 at Kensington Books$8 at AmazonExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-31", "author": ["Condé Nast", "Tyneisha Lewis"]}