{"id": "6f163e2b88f8071a6170d53d2d9a7386", "url": "https://www.bonappetit.com/recipe/bas-best-matzo-ball-soup", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "BA's Best Matzo Ball Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA's Best Matzo Ball SoupBy Molly BazApril 8, 20194.5(47)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis recipe serves eight people generously (with two balls each) but could easily stretch to serve 16 smaller appetizer-size portions. We ordered the steps so that you could make the stock and matzo balls simultaneously, but if you prefer to break up the work, you can make the balls a couple of days ahead (see Do Ahead for more details).Ingredients8 servingsMatzo dough6large eggs½cup melted schmaltz (chicken fat) or vegetable oil6Tbsp. low-sodium chicken broth or water3Tbsp. chopped dill1½tsp. kosher salt¾tsp. freshly ground black pepper1½cups matzo mealSoup and assembly4chicken legs (thigh and drumstick; about 3 lb.)1½tsp. plus 3 Tbsp. kosher salt; plus more6lb. chicken wings2medium onions, peeled, halved2celery stalks, cut into 2\" pieces1medium parsnip, peeled, cut into 2\" pieces3medium carrots, peeled, 1 cut into 2\" pieces, 2 thinly sliced1bunch parsley1Tbsp. black peppercornsChopped dill (for serving)Freshly ground black pepperPreparationMatzo doughStep 1Whisk eggs in a medium bowl until no streaks remain. Add schmaltz, broth, dill, salt, and pepper and whisk vigorously to combine. Add matzo meal and whisk until incorported. Cover and chill dough at least 35 minutes (this is essential as it gives the matzo meal time to hydrate).Step 2Do ahead: Dough can be made 2 days ahead. Keep chilled.SoupStep 3While the matzo dough is chilling, place a rack in top third of oven; preheat to 450°. Place chicken legs on a rimmed baking sheet or a large plate and sprinkle with 1½ tsp. salt; let sit at room temperature until ready to use. Spread chicken wings out on another rimmed baking sheet and roast until golden brown, 45–55 minutes.Step 4Transfer wings and any accumulated juices on baking sheet to a large pot. Add onions, celery, parsnip, chopped carrot, parsley, peppercorns, and 4 quarts water. Bring to a simmer and cook, adjusting heat as needed to maintain simmer, until stock is slightly reduced, 40–50 minutes. Add chicken legs and simmer until legs are very tender, another 40–50 minutes.Step 5While the chicken legs cook, bring 3 qt. water to a boil in a medium pot. Add 3 Tbsp. salt. Using damp hands, divide matzo mixture into 16 pieces and roll each into about 1½”-diameter ball. It’s okay to really work the dough into balls; it won’t get dense—trust us, we tried! Using a slotted spoon, carefully lower matzo balls into pot. Reduce heat to low, cover pot, and simmer gently, checking occasionally and adjusting heat if boiling too rapidly, until balls are puffed and light in color, 30–40 minutes. Don’t remove them sooner than this; they will be dense in the middle if undercooked. Remove from heat and let sit while you finish the soup.Step 6Transfer chicken legs to a plate and let sit until cool enough to handle.Step 7Meanwhile, strain stock through a fine-mesh sieve into a medium pot; discard solids.Step 8Remove meat from legs; discard skin and bones. Tear meat into bite-size pieces and return to stock. Add remaining thinly sliced carrots. Return stock to a simmer and cook until carrots are just tender, about 4 minutes. Taste and season soup with more salt if needed.Step 9Using a slotted spoon, place 2 matzo balls in each bowl. Ladle soup over. Garnish with chopped dill and a few grinds of pepper.Step 10Do ahead: Matzo balls can be boiled 2 days ahead. Transfer to an airtight container along with 2–3 Tbsp. cooking liquid and chill. To reheat, gently lower balls into soup and cook over medium-low until heated through, about 10 minutes.How would you rate *BA*'s Best Matzo Ball Soup?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleThis is such a wonderful recipe! I have made stock from a leftover carcass and then followed this recipe with the made in advance stock. It works beautifully to drop the matzo balls right into the stock to cook them. In addition to the carrots in the soup, I like to add a little diced celery and onion. Highly recommend!MeredithArlington, VA11/28/2021My father, a self-proclaimed matzo ball soup connoisseur and notorious complainer, said, \"The matzo balls are really soft\" and nothing else. That's some high praise, in all seriousness! They were indeed light, fluffy, and flavorful. With such a tepid review from my dad (which is his version of high praise), I'd make this recipe again.JMKCA10/31/2021I waited until the summer temp dropped to 72 Degrees so I could make soup! These matzo balls did not disappoint! They were light and flavorful. I pulsed matzos into meal, used duck fat and adjusted the salt level to my broth sodium levels and they were a summer soup sensation! I can’t wait for fall so I can work this into meal rotations.Amanda IColumbus Ohio8/2/2021I could not find Matzoh Meal, so I just pulsed some plain Matzoh in my food processor. It was maybe not quite fine enough, because when I mixed it with the eggs, oil, and broth it became a soupy mixture. In a panic I added plain bread crumbs, and it sort of thickened, but not at all the texture I was expecting. Made it exactly as written except for home blended meal. A.m. Brooklyn5/5/2021A labor of love!  The broth is so good. So so so so good. My matzo balls took twice as long to cook according to her fineness in the video.  The first time I made it, the matzo balls were too salty, so I cut the salt in the cooking liquid by half and they were perfect.  This is the soup my (not handy in the kitchen) grandmother dreamed of from her childhood but never could recreate.  I’m sad she’s gone and I can’t serve this to her.  She would love it! Brittney LeeArkansas3/27/2021Wow, what an incredible dish! It's certainly a \"project\" to make homemade stock, but it is truly worth it at the end. The depth of flavor was excellent and the way the entire dish comes together is really something special. I made the recipe exactly as written and really enjoyed the final product. It is a larger quantity of dill though, so if you're not a fan cut it back a bit. Also, if you don't have any schmaltz on hand, I'd recommend making the stock beforehand, chilling it, and then skimming the schmaltz off the top and using that in the matzo balls for that deep chicken-y flavor. 10/10 will be making again!GarrickHanover, New Hampshire4/13/2020I just used a whole chicken in my stock and put it right in the pot, no roasting or anything. The stock came out phenomenal. We don't have any fresh dill and the grocery store was totally out so I added a teaspoon of dried dill to the stock as I was cooking the second batch of carrots in it, and garnished with lots of fresh parsley from the garden. Also added some celery after straining it--I know it may not be traditional but my mom likes a lot of vegetables in her soup. I will definitely return to this recipe for making chicken stock. The matzo balls were a little bit dense but I also tried to halve the recipe as eight servings sounded like a lot for just my mom and me! So I may have goofed up the proportions when I did that.amber419Los Angeles4/13/2020Without a doubt, the best that I’ve ever had or made. Matzo balls could not be easier, and light as a cloud, dispelling the old yenta’s tales about seltzer, baking powder etc. The only change that I made was I used goose fat instead of schmaltz. They were perfection. AnonymousSeattle4/11/2020This is hands down the best matzo ball soup I have ever tasted, and I've had a gradnmothers Matzo ball soup. I reduced the dill by half, and only had 4 lbs of chicken wings, which did make a very flavorful broth. [The wing meat is infused with the vegetable flavors and is delicious but dry, so I am going to make chicken salad from it.]\nI was worried about the Matzo balls as there was no selzer, but they came out the most tender and light of any I have tasted. I skimmed the smaltz and used olive oil to complete the 1/2 cup. I also used the hot broth to deglaze the roasting pan so I could get all that roasted goodness [the bits stuck on the pan] back into the broth. \nThis will definitely be the family Matzo ball soup standard from now on. Thank you!Mika Chandra4/11/2020I shortcut this recipe a bit and used purchased, low-sodium chicken broth instead of buying 6 lbs. of chicken wings to make my own! Added the veg and seasonings from there, and it came out beautifully. I found the matzo balls to be a bit denser than recipes I've made in the past, but I did make a measuring error initially so perhaps it's a fluke. I also strongly recommend Adam's suggestion from the video to slice the leftover balls up and pan fry them (in butter or oil, as your adherence to Kosher law dictates).AnonymousMaryland4/9/2020Just made this exactly as written and it was perfect. No need for baking powder or club soda in the balls, they float and have great texture. Maybe cut back on the dill a bit if you aren't a super fan.AnonymousLas Vegas4/8/2020It certainly doesn’t look in the video like they are using 6 pounds of chicken wings.Anonymoustoronto, Canada 4/6/2020This turned out great! I’ve never had homemade matzo ball soup, only the deli stuff, and this was much improved. The dill in the tester ball was a little strong, but after finishing a bowl, all the flavors really do come together nicely. Forgot to salt my chicken legs beforehand, so I had to do quite a bit of seasoning at the end, but final result was great. Thanks Molly!AnonymousPortland, OR4/5/2020Matzo Ball Soup is total comfort food for me and an appropriate weekday project when one is social distancing/working from home. Sadly, I have no Jewish grandmother and thus, no family recipe for matzo ball soup, but I think this recipe is a winner. I made the matzo balls with schmaltz skimmed from the top of my broth and cooled, allowed the mix to rest for about 45 minutes, scooped (packed) using my 1 1/2 TBS cookie scoop, and every single one was a floater. Would absolutely make again. Thanks Molly!s.m.wyatt105348Lafayette, IN4/2/2020This from-scratch broth is SO GOOD.  Literally, it's life giving - so rich and flavorful.  Per ELLEN GABRIEL's review, I made my own schmaltz from the chicken skin, and it was easy and a tasty addition to the matzo balls.  Watching the video for this recipe, they suggest 1 tbs. of salt per qt. of water to boil the matzo balls.  This was too much, and I would keep it to a 1/2 tbs. of salt per quart or even less.  We added one more carrot and a little bit of celery... delish!!!KassyMinnesota3/29/2020Explore Bon AppétitSoupSoups and StewsJewishChickenPoultryMatzoOther IngredientsMainStarterNut-FreeDairy-FreeHanukkahRosh HashanahPassoverLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Molly Baz"]}