{"id": "6f398d91a8a102065d2282c77d027ee7", "url": "https://www.bonappetit.com/story/passion-for-food-is-taken-to-new-heights-in-singapore", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Passion for Food is Taken to New Heights in Singapore | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredPassion for Food is Taken to New Heights in SingaporeBy CNT EditorsPhotography by Linda PuglieseFebruary 12, 2018FacebookTwitterEmailPhoto by Linda PuglieseFacebookTwitterEmailThe passion for food in Singapore is palpable, making it one of the world’s most dynamic, tasty, and downright entertaining culinary cities of the moment. It is a place with an undying devotion that honors the flavors of its diverse heritage but also continues to drum up innovators who are passionate about bringing their unique take on culinary traditions, which in turn attracts and inspires food admirers from across the globe. The city is filled with creatives who are constantly evolving, reinventing, and reimagining their craft. They are the inventive bartenders making killer drinks, the constellation of talented young chefs doing creative riffs on classic flavors to attract a new generation of clientele, and the locals who are obsessed with the next great meal. Singapore might just be the biggest epicurean magnet that brings locals and visitors together to explore their love for food.Here’s a hit list of culinary experiences that are sure to ignite (and perhaps even explode) your passion for food.Chef Willin Low- Wild Rocket\nWild Rocket: Many have called chef Willin Low a vanguard of “modern Singaporean” food, but to him labels are less important than making his food taste damn good. One of his guiding principles? “When in doubt, just add cheese,” he says over lunch at his cozy jewel box of a restaurant atop Mount Emily, a hilltop neighborhood a short drive from downtown. A one-time lawyer, chef Low left his old life behind to follow his passion more than a decade ago. To judge by his Thai salad with frozen coconut dressing or his prawn and escargot dumplings, it was the right call.Coconut Club\nThe Coconut Club: Singapore’s filled with hawker centres, outdoor food courts selling cheap-but-delicious classics like prawn noodles and nasi lemak, one of the region’s signature dishes. It’s a platter of coconut-scented rice surrounded by sides like fried chicken, cucumbers, peanuts, and often fried anchovies. But its ubiquity has, according to the co-founders of The Coconut Club, led to mediocrity, something they’re trying to reverse by sourcing top-quality ingredients and honing their technique to create the most remarkably flavorful version of the classic you’ll find anywhere. The only downside to a meal here? They don’t take reservations.Hawker Centre\nHawker Centres: Speaking of Singapore’s signature food halls, they’re a must for any visitor. Open from early morning to late, they’re de facto town squares for locals from all walks of life, and each vendor tends to specialize in a particular dish or handful of dishes, whether it’s dumplings, noodles, fresh-squeezed juices, nasi lemak, or something else entirely. A few rules to know: First, nobody supplies free napkins, so buy your own packet for a few cents from vendors; usually there’s a coffee stall selling them for a quarter. Next, save yourself a seat. Locals have no qualms about reserving a place by dropping a napkin packet, a workplace badge, or even a cell phone at a seat to claim it for their own. Finally, take your pick of the stalls, but be prepared to ferry your own food to your table—and bus your own tray when you’re done.Native\nNative: It’s not just food. This city is in the midst of a mixology revolution with creative cocktail bars popping up all over the place. One of the most visionary is Native, where the focus is on unsung Asian spirits. \"We're working close to home,” says founder and head bartender Vijay Mudaliar, with ingredients like Indian whiskeys, Indonesian Arak, or Thai ants—yes, ants—that can provide a citrus-y backbone to drinks. (Turns out, the critters are packed with ascorbic acid that works just like lemon juice in a cocktail.) But while they sound gimmicky, creations like the Sensei from the Block and the Invisible Man pack real punch, with an added benefit, says Mudaliar. “We have no straws, no citrus, no coasters,” he says, “meaning we create less than 50 grams of waste a month.” That’s less than the weight of a typical cell phone!Atlas\nAtlas: Before you even mention the cocktails, you have to talk about the room. This could be one of the world’s most ambitiously filigreed bars, set in the grand lobby of an Art Deco skyscraper. There’s a towering bar, stocked with the world’s largest selection of gins, and a deep reserve of Champagnes. In other words, you don’t have to be celebrating something to come here, but you probably will be by the time you leave. The drinks, by the way, precisely stirred and expertly poured by white-jacketed barmen and women, are as delicious as the setting.National Kitchen by Violet Oon\nNational Kitchen by Violet Oon: Chef Oon is a national treasure, so it’s fitting that her newest restaurant is inside the National Gallery. She’s spent decades gathering traditional recipes for dishes like Pie Tee (thin and crispy pastry shells filled with a spicy and sweet mixture of vegetables topped with prawns) and Hae Bee Hiam (dried shrimp paste) sandwiches. They’re served in a gorgeous room, with colorful tiles, bistro-style mirrors, crystal chandeliers, dark wood paneling, black leather banquettes, and slowly spinning rattan fans. (Picture the fanciest house you’d ever dare to imagine, then turn up the color saturation by 20 percent.) While high tea is a favorite—as are long, lingering lunches—it’s also perfect for cocktail hour. Oon’s drinks are no joke, including a contemporary version of the classic Singapore Sling, made here with just enough cherry brandy to sweeten the mix without overpowering things with sugar.Chef Damian D'Silva - Folklore\nFolklore: \"Everyone can understand this food,” says chef Damian D’Silva of his unbelievably complex and incredibly rich menu of classic Singaporean dishes. His point isn’t so much about the flavors—rich, spicy, acidic—as it is the fact that, around the world, everyone pines for home-style cooking. \"If there's any hashtag here, it's #notsousvide,” he jokes, adding that when he needs to slow-cook things, there’s no trick to it other than spending the time, watching and waiting. His specialty is Peranakan food, the mélange of Chinese and Malay cuisines that’s created dishes like beef cheek rendang, braised pork belly, and a spicy version of fried rice (sambal buah keluak) that are usually only prepared at home—and thus rarely available in restaurants like his. It may not be exactly like a Peranakan grandmother might make, he admits, “but if you eat it and it's got soul, then you know it's real.”Ruifang Li - 545 Whampoa Prawn Noodle\n545 Whampoa Prawn Noodle: While hawker centre food like shrimp noodle soup have defined Singapore dining for decades, these soulful classics have, in recent years, come under threat, as food and labor costs continue to climb upward, making it harder and harder to earn a living as a food stall entrepreneur. (And that’s to say nothing of the grind: Most hawker chefs spend 14 to 16 hours a day prepping, cooking, cleaning, and administering their small businesses.) Still, a new generation is boldly taking the reins, people like chef Ruifang Li, a third-generation cook who gave up her corporate career to hold it down at the Tekka Market and Food Centre, turning out some of the most incredible prawn mee not just in Singapore but in the world.Janice Wong Singapore\nJanice Wong Singapore: \"I've always been intrigued by different textures,” says chef Janice Wong, the owner of a mini-empire of sweets shops and the author of three books, including a title about dim sum. While she made her name with highly refined, artistically inspired desserts, Wong is just as gifted with savory dishes, which parade out of her kitchen at the National Museum of Singapore in wave after wave of restrained decadence. A collection of extraordinarily refined dumplings—truffle and mushroom, scallop and prawn, yuzu and milk cabbage—followed by “charcoal” colored noodles in elegant, rich broth pave the way for not-quite-molecular desserts—cake and mousse and compote and, obviously, chocolates. Don’t hold back, Wong says with an almost imperceptible smile: “You can have more than one.”Readers can experience this for their own through specially curated foodie packages available at goway.com/singapore-2018. However, if you’re passionate about exploring a new city to discover different neighborhoods and experience cultural dynamics, then you need to check out our guides for the passionate explorer and culture vulture.Explore the Natural & Innovative Sides of SingaporeCultural Experiences Not to Miss in SingaporeIf your 2018 resolution is to ignite a passion within you, this is the city for you.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Cnt Editors", "Linda Pugliese"]}