{"id": "6f3c34c4fb06d33e22435d0ba351a88a", "url": "https://www.bonappetit.com/city-guides/montreal/venue/boucherie-lawrence", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Boucherie Lawrence Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealBoucherie LawrenceAll the Mile End goods to smuggle back homeFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for artisanal Canadian food products you didn’t know you needed: Expertly crafted sausages! Maple syrup! Pickled celery in Bloody Mary brine! Boucherie Lawrence started off as a way to offer customers of its sister restaurants (Lawrence, Larrys) access to all the fantastic meats, sausages, breads, and more on the menus. It’s become a beloved butcher shop with highly knowledgeable staff.ORDER: whichever sausage sandwich is on the chalkboard! It will likely come with something pickle-y and slathered in something creamy, and it will not disappoint. Then grab a bunch of different uncooked sausages to take with you for breakfast at your Airbnb.THE VIBE IS: Hip modern butcher shop with a nod toward the small quaint boucheries of yesteryear that once dominated this neighborhood. The space is part butcher counter, part sandwich shop, part grocer, so there’s plenty to explore.PRACTICAL STUFF: Open Tuesday to Friday 9 a.m. to 7 p.m., and Saturday and Sunday 10 a.m. to 6 p.m. Closed Monday, so plan ahead.—Molly BazWE ALSO LOVELarrysA natural wine bar that also serves the best breakfast in Mile EndSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainCafé OlimpicoGet your caffeine fix at this Mile End espresso shopExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Molly Baz"]}