{"id": "6f40205749622c0820a78107112c4b3e", "url": "https://www.bonappetit.com/story/youve-got-time-white-fish-cannellini", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "You’ve Got Time For This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou’ve Got Time for ThisIntroducing a new cooking column from Bon Appétit’s editor in chief.By Dawn DavisApril 8, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to You’ve Got Time for This, a column where Bon Appétit’s editor in chief Dawn Davis highlights recipes from our archives that are delicious and accessible, and work every time.Do I have time for this? Unless I’m cooking on a leisurely Sunday afternoon, I ask myself this question whenever I contemplate trying a new recipe, whether it’s from Bon Appétit, Epicurious, a new cookbook, or a blog. Nothing is as exciting as the moment of discovery, be it of a new ingredient, an unexpected flavor combination, or a hitherto untried technique. At the same time, when charting new territory, I can’t help but worry it will be a bust. What if I love it but the family doesn’t and I have to make a second dish? What if it’s a lot of work for little payoff? At one point in my life I might have had the patience for a few misses. But between attending back-to-back meetings and finding a minute to decompress, all I want are the hits.So here in this monthly column, I will dig through the archives of Epicurious and Bon Appétit to find those meals where the payoff is greater than the effort, meals that are easy to prepare, require little more than what’s in your pantry, and leave you enough time to rewatch Bridgerton, learn a new language, read a novel, or catch up with friends via social media. Meals that will convince you that you do have both the bandwidth and the time to try something new. One recommendation a month. Simple, delicious, accessible.For my first recipe, I had to go with one of my faves—Roast Fish with Cannellini Beans and Green Olives. You can whip it up quickly, and you should have all but the fish in your pantry (if not, you can get what ingredients up you don’t have at most grocery stores). It’s incredibly rewarding to get so much flavor with so little effort.Some people are intimidated by fish. But I’m enchanted by its generosity. It’s a protein that often wears its feelings on its gills. You’ll know it’s ready by virtue of its sheen and touch. Of course, the recipe will provide guidance as well.With the green olives and red chiles (for eye candy, not really heat) offsetting the white of the fish and the beans, this is a stunner. It comes together in no time if you use canned beans, though I love to make my own. I soak dried beans overnight, then throw them in the pot with sautéed onions and whatever aromatics are in the fridge—usually fresh rosemary or thyme—salt, and a broth made from the carcass of Sunday’s roast chicken. Claire Saffitz, who developed this recipe, says you can use butter beans or chickpeas and any whitefish, but I am sticking with cannellini beans and cod. For extra beauty and bitterness, throw in some radicchio. You’ve got time for this.Roast Fish with Cannellini Beans and Green OlivesThis is one of those throw-together dinner recipes that relies on staples like canned beans and lemons; all you have to do is pick up the fish.View RecipeExplore Bon AppétitYou’ve Got Time for ThisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-08", "author": ["Condé Nast", "Dawn Davis"]}