{"id": "6f4230b9b5b8f3ff3c894336a5e9d4ad", "url": "https://www.bonappetit.com/story/best-nonstick-skillet", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "The Best Nonstick Pans Are For More Than Just Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Nonstick Pans Are for More Than Just EggsBe good to your nonstick and it will be good to you. By Emma Wartzman and MacKenzie Chung FeganJune 7, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.A nonstick skillet is an under-appreciated kitchen hero. While neither as strong as a cast-iron workhorse nor as indestructible as stainless steel, the best nonstick pans can hold their own against the competition. And even if a nonstick was the first fry pan you bought at Bed Bath & Beyond when you were equipping your starter apartment, that doesn't mean it's a kitchen tool used only by novice home cooks.What should I be using my nonstick frying pan for?Eggs are a given. Scrambled eggs will stay creamy and lush—there’s no danger of ending up with those desiccated egg nuggets that can sometimes happen with a cast-iron pan. An omelet will slide right out when finished. So too will fried eggs—which will get crispy over medium-high heat, we promise—and frittatas. (We know what you’re thinking and yes, most quality nonstick cookware can go from stovetop to oven, as long as you're not exposing your pan to super high temperatures. Medium heat is fine, just don't pop it under the broiler and forget about it. Make sure the handle is oven-safe, too, and if in doubt, check the manufacturer’s website.) A small nonstick fry pan about eight inches in diameter should be a solid size for most of your egg needs.Eggs, got it. Anything else?For your non-egg needs, the best nonstick pan is slightly bigger. A 10- to 12-inch fry pan is as good for giant oven pancakes as it is for pan-fried tofu or the crackliest-skinned fish. It will heat up gently without rising to a ripping hot temperature like cast-iron or stainless steel cookware, which means that the fish skin won’t seize up and shrivel before the flesh is cooked through. And then—you guessed it—thanks to that nonstick surface your filet will slide right out.No need to worry about your skillet pancake sticking.\nEven if a recipe calls for stainless or a cast iron skillet, you can also often swap in a nonstick. There are some cases where it's not the right tool for the job—like if you want to hard sear a steak—but if you just need to sauté a handful of mushrooms and you don’t want to lug out your heavier gear, a nonstick will work just fine. And if you don’t have a microwave, a nonstick is so lightweight and easy to clean that reheating leftover fried rice or stir-fry is almost as simple as pressing the 30-second cook-time button.I'm sold. How do I take care of my new nonstick baby?As for maintenance, taking proper care of your nonstick is just as important as taking proper care of your cast iron (which, as you probably know, people are obsessed with). Simply put, to extend the lifespan of the nonstick coating, you should stick to silicone spatulas and wooden spoons when stirring, flipping, or serving. Metal utensils can scratch the coating, causing it to flake off into your food and reducing its nonstick properties. High-quality nonstick pans may claim to be scratch-resistant and compatible with metal utensils, but we say, why risk it?Same goes for hand-washing. Even if your pan is dishwasher safe, you'll get more life out of it if you give it a quick sudsy rub-down in the sink.You should also take care when storing a nonstick skillet. Keep it solo in its own cubby or, if you must stack, put a kitchen towel over the surface to protect it.Ceramic or Teflon?Nonstick coatings come in two forms—polytetrafluoroethylene (also known as PTFE or by the brand name Teflon) and ceramic.PTFE gets a bad rap because of its association with perfluorooctanoic acid (or PFOA), a man-made chemical that is a legitimate health concern. While PFOA was historically used in the manufacturing of PTFE, since 2015, all cookware sold or made in the USA must be PFOA-free. If you're picking up an off-brand pan at a discount store, it is possible that it was manufactured using PFOA, so we recommend sticking with a reputable brand if you're going all in on that nonstick cookware set.\"Ceramic\" may sound like the more artisan or less industrialized option, calling to mind a carefully thrown earthenware vessel on a potter's wheel, but this is actually clever branding. Ceramic nonstick pans are made of metal, just like PTFE-coated pans, and they are coated with what is essentially melted-down sand, or silica. Ceramic coatings tend to be less nonstick-y than PTFE coatings, and they sometimes have durability issues. But many consumers prefer ceramic because of the misconception that PTFE is harmful or unsafe.So which nonstick pans are the best nonstick pans?You've got options! Are you the kind of person who only skimmed the \"care and maintenance\" section of this article? Do you know in your heart of hearts that you will use a metal fork on your pan's nonstick surface? Do you have a roommate or partner who will one hundo percent stack a random sauté pan on top of your new nonstick skillet? This Tramontina 10-incher is for you. It's made from heavy-duty aluminum, which we like for even heat distribution, and features a stainless steel handle that is secured with multiple rivets and covered in a removable silicone sheath. But most importantly: It's under $30. You can afford to replace this pan at the first sign of a scratch. (Note: if you have an induction cooktop, this is not the pan for you unless you have an induction converter disc.)Tramontina Nonstick Fry Pan, 10-Inch$36 at AmazonBut the best overall nonstick pan, in our book, is the Zwilling Madura Plus. This guy sports a type of PTFE coating called DuraSlide, which Zwilling says is up to 40 times more durable than your standard PTFE-coated pan. And while it's also made from aluminum, the Madura Plus features a magnetic plate, making it compatible with all cooking surfaces, including induction. The Madura Plus line is more expensive than a Tramontina pan set, but if you treat these pans right, they'll serve you for years to come.PHOTO BY CHELSIE CRAIGZwilling Madura Plus Nonstick Pan, 9.5-Inch$81 $65 at Zwilling$81 $65 at TargetExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-31", "author": ["Condé Nast", "Emma Wartzman", "Mackenzie Chung Fegan"]}