{"id": "6f5ec60f601547fbbdac11228d9e843e", "url": "https://www.bonappetit.com/recipe/grilled-bistecca-with-herby-fish-sauce", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Grilled Steak with Fish Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueGrilled Bistecca with Herby Fish SauceBy Ignacio MattosApril 17, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhy baste your steak with fish sauce? It’s called umami. Get into it. Rub steak with ¼ cup oil; season with salt and sprinkle with pepper (it should nearly cover both sides). Let sit at room temperature 30 minutes. For an over-the-top dinner menu, serve with arugula with Italian plums, Romano bean salad, paccheri with shellfish, grilled red mullet, and brioche au rhum. We said over-the-top.Ingredients8 servings21½\"–2\"-thick porterhouse steaks (about 6 lb. total)½cup extra-virgin olive oil, dividedKosher salt3Tbsp. freshly ground black pepper2garlic cloves, finely grated¼cup fish sauce2Tbsp. coarsely chopped marjoram, rosemary, and/or thymePreparationStep 1Rub steak with ¼ cup oil; season with salt and sprinkle with pepper (it should nearly cover both sides). Let sit at room temperature 30 minutes.Step 2Mix garlic, fish sauce, herbs, and remaining ¼ cup oil in a small bowl.Step 3Prepare a grill for medium-high indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side of grill). Grill steaks over direct heat until nicely charred, about 2 minutes per side. Move steaks over indirect heat and continue grilling, basting with fish sauce mixture, until browned all over, about 5 minutes per side. An instant-read thermometer inserted into the thickest part of steaks should register 120° for rare; temperature will rise to 125° (or medium-rare) as they rest. Transfer to a cutting board and let rest 20 minutes before slicing against the grain.How would you rate Grilled Bistecca with Herby Fish Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitSteakBeefMeatEasy5 Ingredients or FewerMainDairy-FreeGluten-FreeKetoGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}