{"id": "6f618cd6a0a3f1cbd6060f42a5613e91", "url": "https://www.bonappetit.com/recipe/new-standard-vinaigrette", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "New-Standard Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueNew-Standard VinaigretteBy Molly BazApril 24, 20194.2(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintNo more excuses for store-bought salad dressing: This jar vinaigrette, made only from staple ingredients, takes almost no time to assemble and will keep for up to a month.IngredientsMakes about 2¼ cups1½cups extra-virgin olive oil¾cup any combination red wine vinegar, white wine vinegar, and/or apple cider vinegar1Tbsp. Dijon mustard1Tbsp. honeyKosher saltPreparationStep 1Combine oil, vinegars, mustard, and honey in a large resealable jar or airtight container; cover and shake vigorously until emulsified, about 30 seconds. Season with salt.Step 2Do Ahead: Vinaigrette can be made 1 month ahead. Cover and chill.How would you rate New-Standard Vinaigrette?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis has been my go-to vinaigrette ever since it was published. It's awesome on simple green salads. Ithaca, New York6/17/2020Just finishing my first jar - have loved it. I like more vinegar in mine (tend towards 1.5:1 oil to vinegar. And shallots were in mine, and taking it out of the fridge when cooking starts helps w the clumping.  I’m also a fan of predressing it by putting it an a large bowl then adding and mixing the greens by hand (w gloves). dwilkinsboise2581Boise, ID5/9/2020Édit : no need to store in fridge (it’s mostly oil). If you do, take out early enough for it to warm up. AnonymousFrance 5/5/2020All salad dressings are fair game and I like to play creative - but let me be my French self for this : a classic vinaigrette requires...\n- black pepper \n- no honey!\n- optional shallots (« vinaigrette à l’échalote »)\n- the secret twist : always add the oil last before final shaking. The vinegar must first welcome the salt, pepper and mustard to dissolve them well. Even more important if there are shallots (need to soak in the flavors). \nThere. I feel comforted in my Frenchness having corrected everyone :-D\nAnd thanks to America for the perfect vinaigrette shaker/storer/pourer (by OXO, in my opinion). Massive contribution. Pamela CaillensFRANCE 5/5/2020good basics, but needs an allium (gahlic, shallot, green onion, etc...)Anonymousboise4/3/2020to the commenter about the dressing clumping up in the fridge, Olive oil does not do well when refrigerated. (someone smarter than me needs to provide the reason or science behind that) try letting the vinaigrettes sit out for enough time to get it to room temp. I think it will help to re emulsify the dressing.    AnonymousCLE3/23/2020I liked this dressing and was quick to make. The only problem I had was it clumped after a few days in the fridge. Tried mixing it again, but it wouldn't mix...what did I do wrong?heather eatsMontreal2/29/2020I agree with comment about it not needing to be sweet but, as a variation, I prefer maple syrup to honey: it tastes more like you meant it to be sweet. Also, using a stick blender in the jar instead of shaking it creates an emulsion that holds, no matter what!elyssUK8/15/2019Pretty legit but no need to be sweet: the first thing I learned as an au pair in Paris in the 80's was this classic vinaigrette, minus the honey.  We made the dressing in the empty salad bowl, then added the salad and tossed right before dinner.Boston8/14/2019Wow, great vinaigrette. I've used it on salads, grilled veggies, over white rice and on pasta so far. Whole family likes it.XochitlNew Jersey5/11/2019Explore Bon AppétitSalad DressingSaladCondimentQuickEasy5 Ingredients or FewerVegetarianDairy-FreeGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-24", "author": ["Condé Nast", "Molly Baz"]}