{"id": "6f69dfbdd3f6453aca2f7241ea8c7a94", "url": "https://www.bonappetit.com/story/vegetable-polpette", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "This Polpette Recipe Is the Perfect 'Emptying-Out-the-Fridge' Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen You Have A Glut of Vegetables and No Ideas, Make PolpetteThese Italian vegetable fritters can be made from any kind of vegetable and baked, shallow-fried, or deep-fried.By Marianna CeriniJanuary 19, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Meatballs—or any similar dish featuring a mix of seasoned ground ingredients rolled into a ball—have long been part of food cultures across the world. They likely originated in Persia, where leftover meat was used to make a dish known as koofteh (today’s kefta), and have since been assimilated by cuisines in the Middle East, the Indian subcontinent, Central Asia and the Balkans, and eventually Europe via trade routes to North Africa and Spain.In Italy, where we call them polpette, they’ve come to be a staple of “cucina povera” (“peasant cooking”) and home cooking—a dish so easy to whip up that, in offering a recipe for them in the 1891’s The Art of Eating Well: An Italian Cookbook (the O.G. of all Italian cookbooks), author Pellegrino Artusi described them as “a course anyone can make, starting from a donkey.”Plump and crispy, the tiny balls capture the essence of Italian food: they’re unassuming but absolutely delicious, simple yet packed with flavor. They also come in endless variations, the loose instructions easily transferable to different ingredients and tweakable in countless ways. Which is how my grandma—and everybody else’s—approached them. (Many Italians will insist that their nonna made them best, and even though my nonna never shared her exact recipe, I feel the same. To me, my grandma’s polpette were second to none—and still are.)While she occasionally presented us with classic meat versions—chicken, minced beef, lamb—it was her vegetable polpette that really spotlighted the dish’s culinary versatility. A firm believer that throwing away food was a sacrilege, she would make them whenever she had vegetables past their prime lying around, or if she needed to free up space in the kitchen before a market run. For her, polpette were a thrifty revival remedy that could work as lunch, dinner, and midafternoon snack, over multiple days and for multiple mouths to feed.Today, I too make polpette any time my fridge needs emptying out. My own method relies partly on what I learned from her, partly on trying things out, and it changes slightly depending on the vegetables I have at hand.Only three ingredients are musts: one crustless slice of soft white or sourdough bread (you can dip it in water to make it lightly mushy) or fresh breadcrumbs, one to three eggs (beaten), and a generous handful of grated Parmesan. The rest is anyone’s game. That goes from the choice of veggies—eggplant, zucchini, broccoli, cauliflower—to the cooking method. Hankering for a crunchy bite? Deep-fry your polpette. Prefer a lighter crust? Bake them in the oven. Looking for an in-between? Shallow-fry them. You can even make polpette solely out of stale bread; cook them in sauce in that case—a rich tomato one, preferably—to let them soak up all the juices.The level of cheesiness can be adapted too: Pecorino can be added alongside the Parmesan, while bite-size pieces of ricotta, provola, or mozzarella can be folded into the polpette as you roll them.Keep these tips in mind for the best polpette:Less liquid equals crispier polpette, so whatever vegetables you’re working with, be sure to drain them thoroughly.If using leafy greens like spinach or kale, for instance, don’t boil them. Instead, cook them gently in a skillet till they wilt and let them release all their water. Drain them, then chop into tiny pieces with a knife (or, even better, use a mezzaluna).With zucchini, shred them using a box grater, and place in a colander with a pinch of salt for around 10 minutes and squeeze out the moisture before you get started.Boil broccoli, cauliflower, or potatoes till you can easily pierce through each with a knife, but for any other vegetable, just sauté—it’ll make for more flavorful balls.Ideally, try squashing your veggies with a fork, rather than a food processor—even if that means having to use some good elbow grease (especially in the case of cauliflower or broccoli polpette). You want a nice malleable mixture, not the type of purée a food processor offers. If fork-mashing doesn’t work for you, an immersion blender is your second best option. Just remember to pulse gently.Mixed vegetables polpette recipe:Proof that any leftover vegetable can be turned into a crispy ball, this recipe, for about 24 polpette (six portions), is the mother of all polpette recipes. You can substitute, omit, or use any combination of veggies as you wish.Start by boiling 2 russet potatoes for around 40 minutes, skin on. Drain and peel them, then place in a large bowl and mash with a fork or potato masher.As they cool, work on the rest of your vegetables: dice 2 carrots, 5 oz. green beans, and 2 zucchini (which you can also grate and leave to drain in a colander, as mentioned previously) into really thin pieces. Have a leek? Chop it into half-moons and add it to the mix.In a medium skillet, fry 1 clove of crushed garlic with a generous glug of olive oil and a pinch of salt for about 5 minutes, until it starts to crisp up and brown a little, then add your chopped veg: leeks first, then carrots, green beans, and zucchini. Sauté until they turn soft and tender, about 10 minutes, then set aside.Go back to the bowl with the potatoes, and add ½ cup grated Parmesan, 2 beaten eggs, and salt and pepper. Finely crumble 1 crustless slice of soft bread into the bowl (you can soften it further by dipping it in water) or use ¾ cup fresh breadcrumbs. Mix in the vegetables, alongside a pinch of nutmeg and a handful of chopped parsley. If you want more cheese, add in grated bits of fresh mozzarella or provola or blobs of ricotta—½ cup (4 oz.) should be plenty. Like with the vegetables, drain the mozzarella and ricotta of their liquid before adding them in order to avoid making the mixture too moist.Using your hands, work everything into a consistent mixture, then scoop out large clumps and shape them into small balls. Roll them in flour, a third beaten egg, and more breadcrumbs to coat.You can deep-fry (around 4 minutes) or oven-bake (20–30 minutes at 425°F) your mixed vegetables polpette. Shallow-frying works too: Warm some olive oil in a skillet over medium heat, then add the polpette and brown them on both sides. Serve with a salad or roasted potatoes.Eggplant polpette recipe:Eggplant polpette are ubiquitous in Italy. While they vary regionally in terms of herbs (thyme, oregano, dill, basil, you name it) and seasoning (chile flakes, smoked paprika, black pepper), their foundation is pretty much consistent across the country.To make them, start off by preheating the oven to 425°F. Prick three medium-size Italian eggplants a few times with a knife, then place them on a baking sheet and roast for 1 hour, until the flesh is completely soft. Take them out and, once cool enough to handle, scoop out the flesh into a colander, mashing it lightly with a fork to remove any excess moisture (as I said: Draining is key).Transfer the eggplant flesh into a bowl and add 1 beaten egg and 1 garlic clove, crushed. Give it a stir, then crumble in 1 crustless slice of soft bread (wet it gently with water to make it extra soft) or pour in ¾ cup fresh breadcrumbs as well as  1 cup grated Parmesan, a handful of chopped parsley, and a pinch of salt and pepper.With your hands, knead everything together. The texture should feel firm, not loose—if it doesn’t, fold some more breadcrumbs in.Roll the mixture between your palms to form walnut-like balls—you should get around 15–20 (less if you’re making them bigger). You could also flatten them out, fritter-style. Feel like you could do with some more cheese? Take 1 cup of shredded mozzarella and fold it into the polpette as you make them.If you are going to deep-fry the polpette, dip them in ½ cup flour, followed by 1 beaten egg and a handful of dry breadcrumbs. Deep-fry for about 3–4 minutes, until they turn golden brown. Place them on paper towels to absorb any excess oil and serve hot.Alternatively, bake them in the oven at 425°F for 15–20 minutes (and feel free to skip the flour-egg-breadcrumbs dredging step). They’ll be lighter but just as delicious.They’ll last a couple of days in the fridge, or you could freeze them, uncooked, and save them for a rainy day.For bread polpette, sauce is recommended!\nPhoto by Marcus NilssonBread polpette recipe:Quick and easy, bread polpette are perfect for when you have day-old bread in the kitchen. They pair very well with a thick tomato sauce, but are also great on their own baked.Crumble 2 cups’ worth of crustless stale/dry bread into small pieces, then place it into a bowl and pour just enough milk to cover. Let the bread soften for a few minutes till it turns slightly soggy and with a dense texture, then drain it to squeeze the milk out. Add two beaten eggs, ½ cup grated Parmesan, and two tablespoons dry breadcrumbs, and start stirring. Chop a handful of fresh parsley or basil leaves and throw them in too. Add a thinly sliced garlic clove and a drizzle of olive oil if you want, or some Pecorino to match the Parmesan. Season with salt and pepper, give everything another mix, and let the mixture rest in the fridge for 30 minutes (you can skip this, but it helps firm up the polpette).Once the time is up, you could go the traditional polpette way—deep-fry or bake them, as per previous recipes (dip the polpette in flour, another egg, and breadcrumbs, then cook for four minutes in the frying pan, or 15–20 minutes in the oven at 425 degrees°F)—or opt for my personal favorite, cooking the polpette in a velvety tomato sauce.For this second option, pour 10 oz. passata (tomato purée) in a large heavy pot over medium heat alongside a garlic clove and a generous glug of olive oil. Bring to a simmer, turn down the heat, then start rolling your polpette and add them one by one to the pot. Let them cook, gently, for around 20 minutes, or until you can insert a knife into the middle of the balls and have it come out clean. Turn off the heat, garnish with some fresh basil, and serve.Although great with bread polpette, this sauce is a bit of an exception as far as other veggie balls go, at least for me. Opinions run deep when it comes to whether polpette need to be accompanied by a dressing or relish of any kind. Generally, I’m of the feeling that the polpette should do all of the talking. The sauce is just extra noise.Marianna Cerini is a freelance writer based in Rome.Explore Bon AppétitItalianBasicallyMeatballIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-19", "author": ["Condé Nast", "Marianna Cerini"]}