{"id": "6f6d3e170e61d4c5992bd5c2077ecc72", "url": "https://www.bonappetit.com/story/agreatbritishsparklingwineforeverymeal", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "A Great British Sparkling Wine For Every Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Great British Sparkling Wine For Every MealProduced by Bon Appétit with Food is GREATBy Food is GREATDecember 17, 2019FacebookTwitterEmailBolney Wine EstateFacebookTwitterEmailWinemaking has existed in Great Britain since Roman times — back when the Isles were host to a warmer climate and more grape-friendly rainfall levels. But local winemaking regions have truly found their footing in modern times, thanks to quick-thinking vintners who’ve taken advantage of the U.K.’s recent warm summers. These days, an increasing number of leading producers are popping up in British counties like Hampshire, Sussex, and Kent, where the limestone-rich soils are perfect for making sparkling wine.While sparkling wines are a must-have for special occasions, British sparklers are particularly unique in their striking versatility, capable of adding subtle complexity to pair with a weeknight dinner. So, looking for inspiration? Here’s how to get the most out of Great Britain’s most enticing sparklers.Balfour Brut Rosé 2015\nPhoto credit: Paul Winch-FurnessAn Elevated Breakfast AffairTo those who contend wine isn’t suited for the breakfast table, we politely disagree. Light and crisp rosés like Hush Heath Estate’s Balfour Brut Rosé 2015 can help transform ho-hum breakfast gatherings into elevated affairs. Pale salmon-pink in color, this bottling marries Chardonnay, Pinot Noir, and Pinot Meunier grapes to produce clean notes of wild strawberry, lime, and redcurrant.It’s an excellent match for still-warm-from-the-pan crepes, topped with luxe clotted cream and fresh strawberries tossed with a tangy splash of balsamic vinegar.Brunch Done RightStep aside, Bloody Mary cocktails: Sparkling wines are taking over brunch tables on both sides of the Atlantic. If traditional gut-busting brunch fare is on the menu, turn to the Bolney Estate's stylish-but-traditional Blanc de Blancs, which boasts striking yellow fruit character with floral notes and wonderful yeast-forward undertones. It easily stands up to a hearty platter of Buttermilk Fried Chicken and Sweet Potato Waffles with its smooth texture and fine mousse.If a gastronomically lighter route is your preference, Citrus-And-Dill Gravlax on Rye pairs wonderfully with sips of Ridgeview Wine Estate's Bloomsbury bottling, which packs notes of citrus, peach, and honey. (If you go the latter route, you’ll be in good company: Bloomsbury was the official wine served at Queen Elizabeth’s grand Diamond Jubilee affair in 2012.)Of course, you could always swirl some sparkling wine into a citrusy mimosa or nectar-rich Bellini. For this, opt for a straightforward and well-balanced sparkler such as Bolney Estate’s Bolney Bubbly Brut, which offers floral and brioche notes with hints of zesty citrus fruit, honeysuckle, and elderflower.Ridgeview Wine Estate's Bloomsbury\nJulia ClaxtonA Luxurious LunchCasual lunch fare—a.k.a. the humble sandwich—gets a major upgrade when paired with bubbles. The trick works with nearly anything: Dainty tea sandwiches brimming with slow-roasted turkey, juicy vine-ripened tomatoes, and crunchy strips of bacon? Between bites, sip on Ridgeview Wine Estate’s Fitzrovia Rose, which won silver at Decanter World Wine Awards in 2018 with notes of raspberry, citrus, and honey. In the mood for the perfect burger? Yeah, us too––always. Enjoy it with Hush Heath Estate’s fruit-forward Balfour 1503 Classic Cuvée, a crisp blend of Pinot Noir, Chardonnay, and Pinot Meunier with notes of lemon balm, white flower, green apple, and a hint of red berry fruit. Even crisp crab cakes benefit from a chilled flute of Ridgeview Wine Estate’s Bloomsbury Brut NV, a refreshing and juicy number that smacks of crisp Granny Smith and mellow Golden Delicious apples.Ridgeview Blanc de Noirs\nJulia ClaxtonA Dinner to RememberWhy reserve bubbly for a once-a-year celebration? Break out a sparkling bottle of Ridgeview’s stylish Blanc de Noirs, with its cherry, sweet spice, and fresh herbs, to go alongside a filet of pan-roasted mackerel. Alternatively, a hearty plate of rich duck confit pairs perfectly with a glass of Ridgeview's Cavendish, made with a classic blend of Pinot Noir, Pinot Meunier, and Chardonnay that translates to a long-lasting finish and surprising freshness.Balfour 1503 Rosé\nDon’t forget dessertNever let a chance to pour something sparkling pass you by. At dessert time, sweet treats enriched with red berries—think peach-plum galette with a hefty scoop of vanilla ice cream, or an elaborate pound cake with fig chutney—are perfectly complemented by Balfour 1503 Rosé , which brings notes of wild strawberry and herbs to the table.Hungry yet? Whatever’s on the menu, enjoy it with a chilled glass of English sparkling wine — it pairs with everything, any time.To learn more about the very best of UK food and drink, follow @GreatBritishFood on Instagram.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-17", "author": ["Condé Nast", "Food Is Great"]}