{"id": "6f6df404410922bcd111b028d624a68c", "url": "https://www.bonappetit.com/recipe/goat-birria-tacos-with-cucumber-pico-de-gallo", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Goat Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueGoat Birria Tacos With Cucumber Pico de GalloBy Rick MartinezFebruary 11, 20204.9(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintBirria is usually served with a side of consomé, the rich pan juices from the roasted meat. We went a step further and puréed those juices with the roasted vegetables and softened dried chiles left in the roasting pan, turning the brothy soup into a super-flavorful, spicy dipping sauce. If you are a purist, you can skip the purée, strain the broth, and serve it on the side instead. Start with some guacamole and this pico de gallo recipe and you’re set for the night.Ingredients10–12 servingsGoat17–10-lb. bone-in leg of goat or lamb, untrimmed⅓cup Diamond Crystal or 3 Tbsp. Morton kosher salt, plus more1large white onion, chopped10garlic cloves, peeled3large guajillo chiles, seeds removed1large ancho chile, seeds removed2dried chiles de árbol13\" piece ginger, peeled2whole cloves114.5-oz. can diced fire-roasted tomatoes1Tbsp. black peppercorns1Tbsp. dried oregano, preferably Mexican1tsp. ground cuminSalsa and Assembly5Persian cucumbers, cut into ¼\" pieces½medium red onion, cut into ¼\" pieces⅓cup fresh lime juice¼cup chopped basil1tsp. kosher salt1–4habanero chiles, seeds removed, finely chopped246\"-diameter corn tortillas, warmedPreparationGoatStep 1Rub goat leg with ⅓ cup Diamond Crystal or 3 Tbsp. Morton kosher salt, working into flesh and fat. Wrap tightly in parchment or wax paper and chill at least 3 hours and up to 3 days.Step 2Place a rack in lower third of oven; preheat to 350°. Evenly scatter onion, garlic, guajillo chiles, ancho chile, chiles de árbol, ginger, cloves, tomatoes, peppercorns, oregano, and cumin across a large roasting pan and place a roasting rack on top. Unwrap goat leg and set on rack. Pour 4 cups water into pan and cover tightly with foil. Bake until meat is pulling away from the bone and shreds easily with a fork, 4½–5 hours.Step 3Let leg sit (still covered) until cool enough to handle (about 1 hour). Shred meat into small pieces and place in a large bowl; discard bones. Remove ginger from pan; discard. Working in batches if needed, purée liquid and aromatics left in pan in a blender until smooth. Pour half of consomé over meat and mix to coat. Taste and season with more salt if needed. Cover and set aside. Pour remaining consomé into a medium bowl and set aside for serving.Step 4Do Ahead: Meat can be prepared 3 days ahead. Chill meat and consomé.Salsa and AssemblyStep 5Toss cucumbers, onion, lime juice, basil, and salt in a medium bowl. Add 1–4 chiles, depending on their heat and how spicy you like things, and let sit 10 minutes.Step 6Top warm tortillas with meat, then salsa. Serve with consomé for dipping.How would you rate Goat Birria Tacos With Cucumber Pico de Gallo?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleDefinitely on my keeper list. Collecting the ingredients was the hardest step. AnonymousSan Francisco, Ca2/5/2021Great flavor. Used a 5-lb leg of lamb in stovetop pressure cooker for 90 minutes after Browning meat first, then sautéing onion / garlic / ginger before adding rest of ingredients and closing the lid. Defatted the sauce before blending, didn’t need to reduce. Made a lot - saving to make a small batch of red enchiladas....  Salsa good also, nice partner to lamb. jsgoboysGrapevine, TX6/30/2020The effort for this is minimal, yet it tastes fantastic! I used a leg of lamb, and when I strained the juices and aromatics, I defatted the drippings, then reduced it by over a half, before pureeing them altogether. This recipe is a keeper, for sure. rlewis3Thurmont MD4/13/2020Don't let goat intimidate you, using a lamb leg was equally delicious and this recipe was incredible! Easier than it seems, it has a long cook time but actually requires little active time or technique. A great way to make tacos for a crowd. Don't skip the pico de gallo. I will be making this again and again. AnonymousChicago, IL4/6/2020I made these for dinner tonight and they turned out so delicious! We did not have any goat or lamb so I made them with some bone in venison. I would 100% make these again and would for sure make with goat once I can get my hands on some, so easy and very tasty. AnonymousRinggold, GA3/28/2020I made this with leg of lamb for a game night with friends. It's a lot of ingredients, but super easy to put together and make. It was seriously one of the most delicious things I have ever cooked.MgubiczaPhiladelphia, PA3/18/2020Explore Bon AppétitTacoMexicanLatin AmericanLeg Of LambLambMeatAncho ChileChileVegetableCucumberGoatGuajillo ChileEasyMainDairy-FreeGluten-FreeNut-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Rick Martinez"]}