{"id": "6f7f3f942b86bd63703f34ae88c3d2c0", "url": "https://www.bonappetit.com/recipe/pickled-hot-chiles", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Pickled Hot Chiles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssuePickled Hot ChilesBy Molly BazMarch 19, 20195.0(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe pickles themselves are crunchy, tangy, sweet, and addictive—but don't forget about the vinegary brine they're sitting in: The chiles infuse the vinegar, which creates a balanced, spicy, and acidic liquid that can be the base of your next vinaigrette.Ingredients1cup white wine vinegar¼cup sugar1Tbsp. kosher salt4garlic cloves, crushed6Fresno chiles, thinly sliced crosswise into ringsPreparationStep 1Bring vinegar, sugar, salt, and garlic to a simmer in a small saucepan over medium-high heat, stirring to dissolve sugar and salt. Pour brine into a small heatproof jar or bowl, add chiles, and let cool.Step 2Do Ahead: Chiles can be pickled 1 month ahead. Cover and chill.How would you rate Pickled Hot Chiles?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleMy new addiction.  Oh my goodness, I put them on everything. DonnaLong Beach2/17/2021These are truly great. Made them a few weeks ago and there’s only three or four left. Good on avocado toast, tacos, Or just straight from the brine. Super hot, but I can’t stop eating them. This is a new staple I’ll make whenever I run out, and I’ll definitely figure out something to do with the brine - it too is good on its own.brianjmarshallPasadena, CA5/27/2019This takes literally less than 5 minutes to make and they are certainly addictive. I made them last night, put some on a toasted bagel with cream cheese for breakfast and I can still taste them in the back of my mouth. Make these.. NOW.kermitologyCalgary, AB4/29/2019Explore Bon AppétitCondimentPickleFresno ChileChileVegetableEasyDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}