{"id": "6f8750adcbef03047167f4ee06af12d0", "url": "https://www.bonappetit.com/story/nafisa-kaptownwala", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Nafisa Kaptownwala Is Diversifying Runways One Model at a Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNafisa Kaptownwala Is Diversifying Runways One Model at a TimeThe founder of Lorde Inc modeling agency spikes her Eton Mess with rose syrup.By Kyle BeecheyOctober 16, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Nafisa Kaptownwala, the founder of Lorde Inc, a boutique modeling agency amplifying models of color.Nafisa Kaptownwala was working as a fashion booking agent and casting director in the early 2010s when she noticed a trend: Even her fellow casting directors and designers of color weren’t hiring models of color. “Rather than wait for the industry to make space for us, we really didn’t have a choice but to do it for ourselves,” she says. In 2013, she founded Lorde Inc, a boutique modeling agency representing models of color that don’t adhere to Western beauty standards. Today you can spot Lorde Inc models in Nordstrom, Uniqlo, and Fenty campaigns, and walking the runway for brands like Vetements and Rui Zhou during Paris and New York fashion weeks.Kaptownwala was born in Vancouver, British Columbia to Indian parents, and uses her heritage as a source of creative influence and a tool to explore her many identities. She looked to artists like DJ Rekha and MIA, Bollywood films from the '70s and ‘80s, and activist organizations like Gulabi Gang as inspiration for photography and film projects, plus her own fashion cues. Depending on the day, Kaptownwala’s clothing can range from a long plaid dress paired with a hijab and tiny zebra print purse to an oversized black blazer and white t-shirt.When she founded Lorde Inc, Kaptownwala feared the push for diversity was just a fleeting trend. Now with six years and yet another hectic New York Fashion Week under her belt, she believes diverse representation is more than a fad on the runway. “No one was looking at the kind of models we were into in 2013, and now they’re everywhere,” she says. Models of color represented nearly 50 percent of all of those that walked in the Spring 2020 of NYFW, and while the numbers continue to grow with each season, Kaptownwala acknowledges that many challenges still remain for people of color in the industry. “The aesthetics of colored people are co-opted and profited off of by mostly white CEOs, and our voices are never included in that process,” she says. “I hope that these conversations around diversity will open the floodgates to the immense amount of work that needs to be done to make the industry truly diverse.”We talked to Kaptownwala about the challenges facing the fashion industry, the power of prayer as self-care, and the Indian foods she wishes were stocked at bodegas.I started Lorde Inc because... of the long conversations I had with a friend. We felt pretty disheartened by the lack of diversity and opportunities for creatives of color in the fashion and art industries. I established Lorde Inc to create opportunities for my community, so other creatives of color could band together to forge more visibility for ourselves.Talking about representation... was sort of just a launching pad to tackle bigger conversations around race and equity in fashion. It is an entry point to have a much bigger conversation on how white supremacy permeates every aspect of the industry, like how people of color aren't included in many fashion houses’ decision making process. Now we can start talking about how many developing countries bear the labor of producing the materials and clothes for the West and how the toxins in those materials have poisoned the environments for many communities of color and garment workers are paid so poorly.At the end of the most hectic day I’m... binge-watching trash TV like Are You the One! I need to unwind to something that asks me to use my brain as little as possible.I think the world would be better if... everyone contributed to their local community, whether it's getting to know your neighbors and having them over for dinner, or volunteering at community gardens. The work starts locally by supporting the people directly beside us.My favorite Indian/British/Canadian food hybrids are... so many! I don't even know where to start. I've been obsessing over dessert called Eton's Mess that's like this popular British sort of deconstructed custard, but I make it with Rooh Afza, which is a South Asian rose syrup.The most rewarding part of Lorde Inc has been... starting a platform that's been a part of telling the stories of marginalized people, and bringing visibility and voices to these stories.If there was one Indian product  I wish I could find locally it would be...Rooh Afza. I once tried to get it in Brooklyn and it was a mission. Also, my life would be infinitely better if I could get  bun maska and chai at the bodega.I incorporate wellness in my life by... journaling. Honoring what I've experienced, what's hurt me, moved me, and what I aspire for myself has become part of my self-care practice, and prayer is becoming something I can't ignore anymore. So much harm in this world is just so massive, greater than humanity even, and I can't think of any way of trying to assemble healing to the earth and each other than prayer.Getting older has made me... be intentional about my relationship to wellness and being honest about how it's not an indulgence—it's life. Everything can crumble around me but if the relationship to my body and my loved ones are in a healthy place, I'll be alright. I enjoy spending time with my family and honoring the connections I have with people I care about, making time for those people, fostering those connections and creating the opportunity for those relationships to flourish. I never want wellness to mean having to buy a single thing. You should be able to find wellness in yourself.True success for Lorde is... legacy.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyleSinikiwe Dhliwayo Wants Everyone to Chill Out in Triangle PoseBy Ryan Walker-HartshornRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Kyle Beechey"]}