{"id": "6f9555cb5da2cb5837b1e1253c9f205f", "url": "https://www.bonappetit.com/recipe/five-spice-popcorn-chicken", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Five Spice Popcorn Chicken Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDFive Spice Popcorn ChickenSponsored by The Spice HunterFacebookPinterestTwitterEmailServes 4 PeopleIt’s easy to rely on take-out for some of our favorite Chinese dishes. However, with the right pantry staples, dishes like this 5-Spice Popcorn Chicken can become part of your go-to arsenal of recipes. First the chicken is marinated with garlic, sugar, and Chinese Five Spice, a blend of star anise, cloves, cinnamon, fennel, and black pepper. After frying, it gets an additional sprinkling of the zesty spice blend, and is served with creamy sriracha mayonnaise and scallions.PrintIngredientsIngredients1 tablespoon soy sauce1 tablespoon sugar1 teaspoon The Spice Hunter® Chinese Five Spice Blend, plus more for serving1 clove garlic, finely grated1 1/2 pounds boneless skinless chicken thighs, cut into roughly 1-inch chunks⅓ cup cornstarch1 large egg, beaten¾ cup all-purpose flourCanola or vegetable oil, for fryingFlaky sea saltScallion, thinly sliced, for servingSriracha mayonnaise, for serving, optionalRecipe PreparationIn a medium bowl, whisk the soy sauce with the sugar, Chinese Five Spice, and garlic. Add the chicken and toss to coat. Let marinate 15 minutes.Drain any excess marinade off of the chicken and toss the chicken with the cornstarch to coat. Once fully coated, add the beaten egg and toss to coat.In a large heavy bottomed pot, heat 1-inch of oil to 350.Place the flour in a large ziploc bag. Working in batches, transfer a few chicken pieces into the bag with the flour and toss to coat, then remove, leaving excess flour in the bag.Carefully place the breaded chicken in the hot oil and fry, turning occasionally, until golden and cooked through about 3 to 4 minutes.Using a slotted spoon or spider, transfer the cooked chicken to a paper towel lined plate. Season with salt and additional Chinese Five Spice seasoning. Repeat the flouring and frying with remaining chicken.Serve with scallions, more Chinese Five Spice Blend, and optional sriracha mayonnaise.Sponsored by The Spice HunterGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredThe Spice HunterMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["The Spice Hunter"]}