{"id": "6fa8d82647a72ea12228e973f51e06f8", "url": "https://www.bonappetit.com/story/easy-caesar-salad-recipe-makes-me-feel-fancy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "This Easy Caesar Salad Recipe Makes Me Feel Like a Fancy, Old-School Chef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Easy Caesar Salad Recipe Makes Me Feel Like a Fancy, Old-School ChefIt's got everything I love about the restaurant version, but without the raw egg yolks and all that whisking.By Aliza AbarbanelJune 19, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailI love a good salad. And yes, I cringed typing that sentence. My inordinate love of vegetables might be a side effect of working at Healthyish, but, really, it's just who I am. (I grew up snacking on whole carrots like a rabbit, with little kid buck teeth to match.) I’ve eaten (and loved) Caesar salads my whole life—at middle school spaghetti fundraisers and white tablecloth Italian restaurants and all the spaces in between—but it never crossed my mind to actually make one for myself. I blame the intimidating-sounding process behind the traditional version—you're essentially making a homemade mayo or aioli, whisking oil drop-by-drop into raw egg yolk to create a creamy sauce—which isn't actually that complicated but just doesn't feel at-home doable. And then I met Basically's easy Caesar salad recipe, and everything changed.When I first looked at the recipe for Lazy Caesar Salad, which depends on the sneaky addition of store-bought mayo to create a creamy and emulsified dressing, I knew it was made for me. I decided to try it on a group of friends I had over for a dinner party—usually a dicey proposition, but it looked so easy I knew I couldn't mess it up.I started by making croutons, which really just means tearing the fluffy inside of a loaf of bread into bite-sized pieces and baking them. This is highly satisfying, and how every salad recipe should start. I tossed the hunks of bread into the biggest bowl I own—trust me, you will always need a larger salad bowl than expected—and added salt, pepper, and a drizzle of olive oil. I arranged the fledgeling croutons on a baking sheet in a single layer, then baked them at 450° until the croutons were golden and crispy but still a smidge squishy in the center.While the croutons cooled, I started on the dressing by grating a garlic clove into my now-empty big bowl. (The less dishes to clean, the better.) I put two anchovies on my cutting board and, using the flat side of my knife, mashed them into a paste and tossed that in the bowl along with some spicy Dijon mustard, lemon juice, and mayo, and whisked until smooth. (If you’re not a huge anchovy person, just add one.) Finally, I carefully streamed in ⅓ cup of olive oil while constantly whisking to create that classic creamy, well-emulsified Caesar dressing.Why make your dressing in a small bowl (that you have to wash!) when you can make it right in the salad bowl?!\nNext came my favorite part: using a vegetable peeler to shave a big hunk of Parmesan into shards. I broke up any especially large pieces, and definitely ate a few in the process. Finally, I began constructing the whole salad by tearing two romaine hearts into bite-sized pieces, and dropped them directly into the bowl with dressing. I seasoned the lettuce generously with pepper and lightly with salt (those anchovies are pretty salty already!), then added about three-quarters of the cheese and croutons and toss gently until the lettuce is coated. (Take a look at your salad—if the romaine hearts were on the smaller side and the salad looks a little soggy and sad, add some more lettuce.)Once the salad was dressed, I transferred it to a platter and sprinkled the remaining cheese and croutons over top—everyone knows Caesar salad is really just an excuse to eat a bunch of dressing-soaked croutons. To turn this salad into a proper dinner, I copied every bougie country club and random hotel restaurant in existence and threw some grilled chicken on top. Naturally, it did not suck, and my friends were more than pleased.I’ll be straight with you: This salad is well outside my Healthyish wheelhouse. There’s no thinly shaved fennel or tahini ranch, just an anchovy-heavy dressing and a freaky quantity of croutons. It's an absurdly easy Caesar salad recipe that goes toe-to-toe with the old-school, yolk-heavy restaurant version and wins. And it's just as perfect as I remembered.Turn your kitchen into Caesar's Palace:Lazy Caesar SaladNo raw egg yolk, no problem. All the flavor you love in the classic in a quarter of the time.View RecipeExplore Bon AppétitSalad DressingSaladBasicallyRead MorecookingThis Is the Summer You Start Making Homemade Salad DressingBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Aliza Abarbanel"]}