{"id": "6fb2c61f3d6301330ae1c23bd2e6999c", "url": "https://www.bonappetit.com/story/family-secret-cornbread-casserole", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Cornbread Casserole Was My Family’s Secret Thanksgiving Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Cornbread Casserole Was My Family’s Secret Thanksgiving Recipe...Until It Wasn'tThat moment when you realize your mom's famous dish isn't hers at all.By Hilary CadiganNovember 9, 2018FacebookTwitterEmailIllustration by Jan BuchczikFacebookTwitterEmailFor as long as I can remember, one dish has risen above all others at the Cadigan family Thanksgiving dinner table. No, it’s not turkey. (Of course it’s not turkey.) It’s my mom’s cornbread casserole, the tastiest dang thing and also the easiest to make, provided you avert your eyes while combining a box of Jiffy corn muffin mix with a stick and a half of butter, a cup of sour cream, a can of corn, and a can of creamed corn. (Bake at 350 for 50 minutes. Literally, that's it.)Pull it hot from the oven and its surface resembles a picture of the sun close up, all gilded and crackly, with shallow golden butter craters and dark blotches where the crusty top toasted just so. Cut into it—all you need is a spoon, or you can just stick your whole hand in there—and it gives way like a heavy cloud, the interior moist and dense and studded with fat blond corn kernels. Just robust enough to chew yet soft enough that you don’t really have to. Butter and bread melded into one.When I was a kid my family moved around a lot: I’d made my way kicking and screaming through the suburbias of Dallas, Chicago, New York City, and Boston by the time I turned seven. Despite our many moves, Thanksgiving remained blessedly consistent: turkey with gravy and two types of cranberry sauce (the jelly kind that retains the shape of the can for my dad and the kind with actual berries in it for my mom), stuffing, biscuits, mashed potatoes with a molten butter center affectionately referred to as the “butter surprise” (we really love butter), green beans with mushrooms and crispy onions, a gelatinous pot of peas, and the hallowed cornbread casserole. No deviations; no substitutions.Deep into adulthood I’d make my mom’s cornbread casserole for potlucks, revel in the praise, and share the many-times-forwarded family recipe (adorably modified in the early aughts to include “one cup Mum’s love”). When I lived in northern Thailand, I dutifully re-created it three years in a row, even though the process involved spending 20 times the price of a box of Jiffy mix on imported ingredients. Slowly but surely I widened the casserole’s circle of influence, bequeathing this Cadigan family original onto the people of the world. Sure, its primary component was a boxed mix, but the recipe was special because it was ours. Or so I thought.Then, one day not so long ago I was asked to write an essay (this essay) about my strongest Thanksgiving food memory. So I did some googling. And suddenly, boom. I was faced with a shattering piece of knowledge: My most prized culinary heirloom can be found on jiffymix.com.“We’ve heard lots of stories like this, Hilary, if it helps lessen the pain and the anguish and the broken trust factor.” I’m on the phone with Howdy Holmes, the 70-year-old patriarch (and former race car driver) who now holds the keys to the Jiffy mix empire, which began with his family’s Michigan flour-milling company back in the 1800s. “You wouldn’t believe how many times somebody’s called me up and said, ‘I’ve got a really great recipe,’ and it’s the spoon bread casserole.”Holmes isn’t sure who first came up with this so-called spoon bread casserole. Its earliest documentation was as a tear-off sheet mounted to grocery store shelves in the 1950s; it was then known as “corn bowl.” Around 1970 the recipe was featured in the official Jiffy recipe book, and today it’s on Jiffy’s website for all to search and find.I decide to confront my mom. She claims innocence. “I got the recipe from a friend! I thought it was hers!” She pauses a moment. “Come to think of it, though, I’m pretty sure just about every one of our Thanksgiving recipes came from the side of a box or a can.”For a second I feel cheated. Like something precious has been stolen from me, or worse, was never mine in the first place. Then we both start laughing and can’t stop. In my head unfurls a sizzle reel of all the memories this calorie-loaded casserole had provided over the years: doling out second portions for my late great-aunt Theresa, a Catholic nun who’d scold us for forgetting to pray before eating; cooking with my mom while speaking exclusively in British accents (it’s our thing); my boyfriend, Rob, burning off every eyelash trying to bake the casserole in a rusty old pizza oven at a Thai bar (he persevered; we’re engaged now).These memories belong to me, even if the recipe doesn’t. And there’s something kinda warm and fuzzy in knowing that, for the better part of a century, thousands of other families across the world have been making it too. Like we’re all sharing one big ol’ corn bowl of collective memory.Plus, the Cadigan version contains twice as much butter.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Hilary Cadigan"]}