{"id": "6fbdb3264036d8b7100e80b42b22a8a3", "url": "https://www.bonappetit.com/recipe/hot-honey-wings", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Hot Honey Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueHot Honey WingsBy Jessie YuChenJuly 6, 20214.7(42)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintHot honey is good on pizza, biscuits, and not surprisingly, wings. But the hot honey we make for these wings go beyond the usual sweet and spicy notes, with the addition of chili crisp and lime. It’s the cherry on top of these supremely crispy yet low-fuss grilled wings. The secret lies in the prep. Cooking wings low and slow in the oven before grilling is a controversial ask, but hear us out: This allows the excess fat in the wings to render so it’s not dripping into the grill and causing flareups. (Bonus: This means you can prep these wings ahead of time. (You’re welcome!) Once roasted in the oven, toss the wings in a hot honey glaze and finish directly on the grill over medium heat. —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonHeat Resistant Leather Gloves$22 At Amazon16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonCitrus Juicer$7 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 - 6 Servings1Tbsp. bird chile powder or cayenne pepper1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1Tbsp. freshly ground black pepper2lb. chicken wings, patted dry2limes, divided½cup honey1Tbsp. fish sauce3Tbsp. chili crisp, plus more for serving1cup shishito peppers (about 8 oz.)3–5red Thai chiles or jalapeños, thinly sliced¼cup cilantro leaves with tender stems¼cup coarsely chopped salted dry-roasted peanutsPreparationStep 1Mix chile powder, salt, and 1 Tbsp. black pepper in a small bowl until well combined.Step 2Arrange chicken wings in a single layer on a foil-lined rimmed baking sheet. Rub all over with spice mixture and let sit at room temperature at least 15 minutes, or cover and chill up to 1 day. If chilling, let sit at room temperature 1 hour before grilling.Step 3Place a rack in middle of oven; preheat to 375°. Bake wings until slightly golden, 30–40 minutes. Remove from oven; let cool slightly.Step 4Slice 1 lime in half and squeeze juice into a large bowl; mix in honey, fish sauce, and 3 Tbsp. chili crisp. Transfer chicken wings to bowl and toss to coat in hot honey glaze.Step 5Prepare a grill for medium heat. Grill chicken wings and shishito peppers, turning occasionally, until chicken is deep golden brown and charred in spots and shishito peppers are blistered and charred in spots, 5–8 minutes.Step 6Transfer chicken wings and shishito peppers to a platter; top with chiles, cilantro, and peanuts and drizzle more chili crisp over. Slice remaining lime into wedges and serve wings and shishito peppers with lime wedges for squeezing over.How would you rate Hot Honey Wings?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI made this for Valentine's Day for my husband who loves wings but had challenged himself to abstain from fried foods for the month (No Fried February).  The meal was delicious and the presentation was great.  Thanks, BA!LeeJacksonville, FL 2/22/2022This was such a fun, balanced recipe. I think fish sauce might be the most underrated ingredient of all time and chili crisp is my new favorite ingredient. Delicious!Warren BuckJacksonville, FL12/31/2021This is an absolute favorite! How have I lived without chili crisp my whole life?!Juju kennett square pa12/28/2021In the video they used Lao Gan Ma chili crisp. I got mine from WegmansJessicaQueens, NY9/6/2021WAY too much black pepper in the rub. Couldn’t taste anything else Jean 9/5/2021Yes, WHAT is chilli crisp\nWendyAustralian 8/17/2021What is chili crisp??Leon8/3/2021We didn’t grill but they were still tasty. One thing though, we used cayenne as we didn’t have Thai bird chilies and yowza! They were spicy! But oh so yummy!! \n\nSuper easy and we will make them again as the family really enjoys the flavor profile. AnonymousNew York, NY8/2/2021This is a new go to recipe! Pre-baking the chicken was a game changer- it was so juicy. Excellent summer meal!GrillingInSeattleSeattle, WA7/28/2021Don't have a grill, forgot the shishitos, and these were still A+. We find that a lot of recipes with a sweet element usually lean too hard on the sweet for our taste, so for a little over 2 pounds of wings, I used just under 1/2 C of wings (maybe closer to a 1/3 C), doubled the lime, added just a splash extra of fish sauce, and sprinkled in some chili flakes (our chili crisp is savory and delightful but not super hot). For the dry rub, subbed about half the cayenne for chipotle powder to help get that smokey taste. Really tasty, forgiving, and riffable.NytashaOakland7/20/2021Is 375 degrees correct?  That does not sound like \"low and slow\" to me!David RosenthalOakland, CA7/13/2021Amazing! I made these and served them with steamed artichokes, and a dry Riesling, it was the best finger food night ever!Kari L.Napa, CA7/10/2021Explore Bon AppétitChicken WingChickenPoultryShishito PepperVegetableThai ChileChileJalapeñoPeanutNutMainStarterDairy-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Jessie Yuchen"]}