{"id": "6fc45b000395ecfd857cb781dd1983db", "url": "https://www.bonappetit.com/recipe/apple-hazelnut-rye-cake", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Apple-Hazelnut Rye Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueApple-Hazelnut Rye CakeBy Bronwen WyattSeptember 14, 20214.4(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintBig chunks of tart apples, toasted hazelnuts, dates, and a little rye flour come together to make this rich, deeply decadent cake dressed up with a tangy buttercream. Cake maker extraordinaire Bronwen Wyatt of New Orleans “tiny-bakery” Bayou Saint Cake says you can swap the hazelnuts for walnuts or pecans and the rye flour for whole grain flour, and add or subtract any spice you like. Just make sure you’re using tart baking apples (such as Granny Smith) or the flavor might get lost. Lastly, you really want to bake this cake until it’s a deep, burnished copper color. If you’re short on time, you can omit the buttercream and serve the cake warm with ice cream or crème fraîche.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFat Daddio's Round Cake Pan, 9 x 3 Inch$14 At AmazonFood Processor$49 At AmazonStand Mixer$460 At AmazonInstant-Read Thermometer$35 At ThermoworksIngredients8 - 10 ServingsCakeNonstick vegetable oil spray¾cup (108 g) blanched hazelnuts1¼cups (156 g) all-purpose flour¼cup (30 g) rye flour1½cups (300 g) sugar1½tsp. baking soda1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. ground cinnamon¼tsp. ground coriander¼tsp. freshly grated nutmeg2large eggs¾cup (135 g) pitted Medjool dates, coarsely chopped¼cup plus 2 Tbsp. extra-virgin olive oil1½lb. tart baking apples (such as Granny Smith; about 3 large), peeled, cored, cut into ½\" piecesButtercream and assembly3large egg whites¾cup (150 g) sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt⅛tsp. cream of tartar (optional)1¼cups unsalted butter, room temperature, cut into pieces3Tbsp. fresh lemon juice¼tsp. vanilla extractEdible flowers and/or toasted blanched hazelnuts (for decorating; optional)PreparationCakeStep 1Place a rack in middle of oven and preheat to 350°. Lightly coat a 9\"-diameter cake (sides should be at least 2\") or springform pan with nonstick spray. Line bottom of pan with a parchment paper round; lightly coat with nonstick spray. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool.Step 2Meanwhile, whisk all-purpose flour and rye flour in a small bowl to combine.Step 3Pulse hazelnuts, sugar, baking soda, salt, cinnamon, coriander, and nutmeg in a food processor until mixture looks sandy. Add eggs, dates, and oil and process to a thick paste (mixture will resemble freshly ground nut butter). Transfer to a large bowl and add flour mixture. Using a rubber spatula or wood spoon, mix until almost no dry streaks remain. Add apples and, using wet hands, mix apples into batter (apples will be barely surrounded by batter). Scrape batter into pan; press down firmly and evenly into pan with wet hands (batter will be very thick and sticky).Step 4Bake cake, rotating halfway through, until very deep golden brown and a tester inserted into the center comes out with only a few moist crumbs attached, 70–80 minutes. Transfer pan to a wire rack and let cake cool in pan. (This cake is very fragile when warm, so it’s important to let it cool completely in the pan before attempting to turn it out.)Step 5Hold a plate upside down over pan and invert to turn out cake; peel away parchment paper. Chill cake 30 minutes (this will make it easier to frost).buttercream and assemblyStep 6While the cake is chilling, whisk egg whites, sugar, salt, and cream of tartar (if using; it helps stabilize the egg whites, giving you lofty peaks) in the bowl of a stand mixer just to combine. Set over a medium saucepan filled with 1\" of gently simmering water (the bottom of the bowl should not be touching the water). Heat, whisking constantly, until sugar is dissolved and an instant-read thermometer registers 185°, 8–10 minutes.Step 7Fit bowl onto stand mixer fitted with whisk attachment and beat on medium-high speed until meringue is stiff and glossy and bowl feels barely warm to the touch, about 5 minutes. With the motor running, add butter a piece at a time, incorporating fully before adding the next piece, 8–10 minutes. If mixture starts to look chunky or liquidy, just keep beating; it will come back together. Add lemon juice and vanilla extract; beat on high speed until buttercream looks glossy and smooth.Step 8To frost the cake, make sure bottom of cake is facing up (this will provide a flat surface for easy frosting). Scoop buttercream on top of cake and spread a thick layer over the surface with a small offset spatula or butter knife. Spread a thin film of buttercream over sides. Decorate top with edible flowers and/or toasted hazelnuts as desired.Do ahead: Cake can be baked 2 days ahead; tightly wrap and chill, or freeze up to 2 weeks. If frozen, thaw in fridge before frosting. Frosting can be made 5 days ahead; cover and chill. Bring to room temperature, then beat in stand mixer before using. Cake (without decorations) can be assembled 3 days ahead; cover and chill. Bring to room temperature before serving.How would you rate Apple-Hazelnut Rye Cake?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI only made the cake (not the frosting) and thought it was pretty tasty, but not necessarily special. I couldn't taste the hazelnuts or rye at all, so not sure why they're necessary or in the name - I usually have rye on hand but others may not, and hazelnuts are expensive.  The texture of the batter seemed super weird and it was a little hard to combine with the apples, but the texture of the baked cake was moist and relatively light. The dates contributed a lot of caramel-y flavor. It's a little on the sweet side - I'd be curious to cut the sugar if I made it again, but I don't know that I'll bother. I don't have a springform but it worked totally fine in my 3\" deep cake pan. Alison MSan Francisco2/9/2022This cake was delicious but I was not a fan of the icing. The icing was a lot of work for not much gain. I will definitely make again, maybe with a cream cheese icing.Christy AndrewsHouston1/26/2022I made this with 1/2 the sugar and salt.....perfect! I did not peel the apples and also used pecans instead of hazelnuts I eliminated the buttercream frosting and opted for a poured caramel frosting topped with whole toasted pecan halves. It was the hit of our monthly fellowship potluck. Kendall Savillemanning, Oregon12/2/2021I love this recipe but hate blanching hazelnuts, so sharing my pro tip: I order my hazelnuts from the American Hazelnut Company, which sells a variety where the skins are not bitter. So I use their hazelnuts, skip the blanching and just leave the skins on, and the recipe turns out perfectly and takes way less prep. RebekahMinneapolis11/18/2021In the October issue that feature this fabulous recipe, I noticed they mentioned currants in the description and than did not include them in the list of ingredients? I was curious why they were left out?  Are they in the original recipe?LizAmbler PA11/13/2021I made this cake for my birthday.  It was spectacular.  Just what I wanted/needed.  Made it exactly like it said, couldn't have been better - so moist, so flavorful, perfect combination of ignredients.  Thank you so much for making me so happy on my bday with the perfect finish to my day. xxooLuciaNew Haven, CT11/10/2021I just made this cake today.  The flavors are unique and I'd make it again, however, it's incredibly sweet, as one of the other reviewers mentioned.  I could easily see cutting the sugar in half for the cake, especially since the dates and apples provide plenty of sweetness.  In fact, the sweetness distracts from all the other flavors.  And this is coming from someone who LOVES sweet things.  I actually liked the frosting with it, but again, the overly sweet cake was distracting from the the whole ensemble.  Next time I make it I'll cut the sugar in half and add more spices.LynmaeSan Diego11/3/2021Absolutely delicious, and a wonderful departure\nfrom the average cake. Loved the contrast between the chewy side crust and the body of the cake, and the icing is perfection: the lightness and tang is a perfect\nfoil for the sweetness of the cake. I confess that I used golden monk fruit sweetener instead of sugar (cake ingredients like dates and rye seemed to beg for a healthier option) and it worked perfectly. The sophisticated flavors of this cake will make it a mainstay for me. \nVMillerNew Orleans10/20/2021Made this for a dinner party. I did use a 4th egg white and 1/4 cup extra butter in the frosting as I used a 10\" round pan. Very moist, very decadent - it will be on our Thanksgiving table in place of apple pie.Chris Forked River NJ10/3/2021Oh wow. This is delicious and beautiful on its own - doesn’t need frosting at all.  If so would need something light and tangy - I like the idea of crema freche.    I had a slight issue w doneness - after 80 min I thought tester was clean but the very center was still mush when cutting. Oops.  Cut that part out and focused on the edges and, well,  this is a keeper for sure.  AnonymousBrooklyn NY10/3/2021I enjoyed the flavors, but it was very sweet. I’m glad I didn’t make the icing. The contrast between a crunchy outside and chewy inside was nice. My dough was very dry, definitely not sticky; I added more olive oil a bit at a time. Next time I’ll probably add a 3rd egg. Anyone else have this issue?CindyColorado10/3/2021Cake was phenomenal. Buttercream was also very good, but not the right icing/frosting for this cake. The apple and spice sweetness vs the buttercream / lemon flavors was jarring. KathyNew Jersey10/3/2021Explore Bon AppétitAppleFruitHazelnutNutRyeCakeDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Bronwen Wyatt"]}