{"id": "6fe756094888aed5a46359b961d97197", "url": "https://www.bonappetit.com/story/salmorejo-soup", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "How Did I Survive Summer Before Salmorejo? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Did I Survive Summer Before Salmorejo?Southern Spain’s ancient answer to the heat.By Megan LloydAugust 13, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Kay BoystovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When my fiancé warned me about the brutal summers in Seville, I dubbed him a dramatic sevillano. I was certain that the capital of Andalusia, Spain’s most southern region, had nothing on my native Houston’s grueling humidity. But when you walk everywhere in one of the hottest spots in Europe (unheard of in Houston’s car-clogged furnace), 104°F weighs heavy. So I looked to the citizens of Andalusia to lessen the load. And the Andalusians look to salmorejo.If you were to sum salmorejo up as a dense gazpacho, an Andalusian would scoff at your gross generalization. In a conversation with author and food historian Almudena Villegas, Ph.D., she tells me it’s a historical symbol of Andalusian identity. My friend Maribel claims salmorejo is a religion. But, technically speaking, it’s a cold, spoonable emulsion of tomato, bread, garlic, and olive oil.Salmorejo finds its ancient roots 90 miles northeast of Seville in Córdoba. According to Villegas, occupants of this area have been making a version of the dish since they started cultivating wheat. The base, gachas (old bread mashed with other ingredients), has been found in archaeological sites throughout wheat-growing areas in the Western world dating back to 2000 B.C.Like the bulk of Andalusian cuisine, salmorejo was, and is, accessible and inexpensive. Though commonly associated with farmers in the rural south, its tradition stretched across economic classes and into urban areas. Women would use enormous mortar and pestles to mash bread, garlic, and olive oil into a paste that they’d keep in a designated cool area of their homes until it was time to eat. The tomato was incorporated sometime in the 18th century, and eventually the blender turned salmorejo into an undemanding emulsion and summertime salvation.Salmorejo reveals much about Andalusia—its intense climate, agricultural economy, and resourceful citizens. “It reveals our ability to adapt to our means,” Villegas says. “It’s the capacity to use so few resources to make a nutritious and flavorful dish and turn it into a popular part of our gastronomy.”These days salmorejo continues to alleviate hunger and fight off heat, just as it has for centuries. It shows up on practically every menu from Córdoba to Seville (even as a sauce), with classic versions at cheap tapas bars and creative riffs at fine dining establishments.When I asked about recipes, friends and family were confused: “What? It’s so simple!” Even so, my fiancé’s aunt, tita Conchi, offered a tutorial. She learned from her mother-in-law, who learned from her mother, who muscled it by hand. The adapted version of tita Conchi’s recipe with the Córdobes original goes like this:Roughly cut 2 lb. ripe tomatoes (stems removed) in the palm of your hands—be careful!—over a blender. Add 1 clove garlic, a couple pinches of salt, and blend until smooth.Tear 7 oz. white bread (a big hunk of something, like a hoagie roll; some crispy crust is fine) into thumb-size pieces into a bowl. Sprinkle some water over the bread and use your hands to get the bread nice and damp. The staler the bread, the more water and time you’ll need for it to soak in.Blend the bread with the tomato until smooth. Depending on your tomatoes, bread, and preferences, you may need more water. You’re going for the texture of a smoothie.While the blender is running, drizzle in ⅔ cup extra-virgin olive oil and blend until the mixture turns from pale red to orange. Taste for salt and chill in the fridge.Top it with chopped hard-boiled egg like Maribel, canned fish like my fiancé, Carlos, or bits of cured ham if you’re feeling fancy. And as tita Conchi says, always finish with a drizzle of extra-virgin olive oil. Welcome to 58% of your summer diet.Megan Lloyd is a food and travel writer and recipe developer based in Seville, Spain.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-13", "author": ["Condé Nast", "Megan Lloyd"]}