{"id": "6fee99e7060514d9cecb37d5d37f8a6f", "url": "https://www.bonappetit.com/recipe/granola-scones", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Granola Scones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueGranola SconesBy Roxana JullapatJanuary 12, 20214.5(40)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“These scones are full of flavors and textures reminiscent of a granola bar,” writes Roxana Jullapat in her cookbook Mother Grains (out April 2021). “They’re neither terribly sweet nor what a nutritionist would recommend to clients. They’re rich in fiber, omega-3s, antioxidants, and protein, with a sweet kick from copious dried fruit and a sprinkle of raw sugar. They don’t need to be served with clotted cream or jam and are best enjoyed as a midday snack or an accompaniment to morning coffee.”IngredientsMakes 6¼cup plus 2 Tbsp. (53 g) whole wheat flour½cup plus 1 Tbsp. (57 g) old-fashioned oats½tsp. ground cinnamon½tsp. baking powder¼tsp. baking soda⅛tsp. kosher salt6Tbsp. (¾ stick) chilled unsalted butter, cut into ½\" pieces¼cup plus 2 Tbsp. (47 g) all-purpose flour, plus more for dusting2Tbsp. raw sugar, plus more for sprinklingZest from 1 orange1cup (145 g) chopped pitted Medjool dates (about 16)1cup (145 g) golden raisins½cup (80 g) flaxseed½cup (45 g) sliced almonds⅓cup (30 g) unsweetened shredded coconut6Tbsp. (55 g) dried black currants5Tbsp. (50 g) pumpkin seeds (pepitas)⅓cup heavy cream, plus more for brushingPreparationStep 1Place a rack in middle of oven; preheat to 350°. Pulse whole wheat flour, oats, cinnamon, baking powder, baking soda, salt, butter, ¼ cup plus 2 Tbsp. (47 g) all-purpose flour, and 2 Tbsp. raw sugar in a food processor until butter is no larger than pea-size, 5–7 pulses. Transfer to a large bowl; mix in orange zest, dates, raisins, flaxseed, almonds, coconut, currants, and pumpkin seeds. Toss by hand until well combined, then make a well in the center. Pour cream into well and toss vigorously with your hands (like a salad) until mixture comes together to form a dough.Step 2Transfer dough to a lightly floured surface and pat into a 6\"-diameter disk about 1\" thick. Using a large chef’s knife, cut disk into 6 equal wedges. The dough will be crumbly and may fall apart as you cut it; don’t be afraid to compact it back together.Step 3Arrange scones on a parchment-lined baking sheet, spacing at least 2\" apart. Lightly brush top of each scone with cream and sprinkle with raw sugar. Bake scones, rotating baking sheet front to back halfway through, until light golden, 25–30 minutes. Let scones cool on baking sheet before serving.Do ahead: Scones can be made 3 days ahead. Store airtight at room temperature.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Granola Scones?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleInfinitely riff-able -- I keep the dry ingredients the same but just use whatever dried fruits, nuts, and seeds I have in the pantry. I've made them with dried figs, dried apricot, crystallized ginger, dried pineapple... Adjust the amount of cream slightly depending on how well the ingredients stick together. Always works great!RTNew York1/10/2022These definitely taste and feel like granola. Good flavor but very crumbly and rather dry. Followed the recipe to a T but I'd recommend trying a little more cream to see if they stick together better. You could break these up over yogurt and it would be almost like eating granola. I divided mine into 8 scones and they were still quite large. I think it would help to make them even smaller. Maybe 16 triangles or bake them in little balls. Then the fall-apart crumbliness wouldn't be so much of a problem.RoseSeattle, WA11/6/2021Cannot say enough about how wonderful these are!  Rough textured, but not touch. Not too sweet but so flavorful!  Beautiful with the dried cherries I subbed for raisins.  They have an incredible crust on the bottom (use parchment!) and freeze very well. A lovely thing to  put in a gift basket. As others mentioned, the dough is bit crumbly during assembly, but after baking, mine held together just fine.  I will never forget or lose this recipe and plan to enter it into competition at our State Fair next year (after seeing - but not tasting.- the competition this year!).CBKIndianapolis, IN8/13/2021Excellent and different scones! Definitely not a traditional cream scone, but that's what makes them so good. I didn't have any trouble with the crumbliness and they baked quite nicely. The final result is moist and tender. I used spelt flour instead of whole wheat and substituted dried apricots for half of the raisins. ElizabethSanta Barbara, CA3/27/2021I made them the first time, and found I had to pulse the figs and other dried fruits as well as the flax seed and oats. They were very crumbly and delicious. I used all whole wheat flour and added a 1/2 cup of dark chocolate chips. The second time, I added a quarter cup of 2% Greek yogurt to solve the crumbly problem and added a full cup of dark chocolate chips. I increased the orange zest and again pulsed the nuts, seeds, and fruits variously to make a more even crumb for the dough. Winner! Carol ConnareAmherst, MA3/8/2021These are absolutely delicious, and 1 scone is a meal in itself.  The dough is very dry and crumbly, and needs a lot of work to hold together.  But once baked, they are moist and yummy.  My husband has these on repeat request, as they fuel him completely before his bike rides.Jeanne P.Jacksonville, FL3/7/2021I loved everything about this scone! I would agree it's not your traditional scone, but I wasn't expecting it to be given all of the nuts, fruits and seeds added to the mix. It was light, and yes crumbly like granola but had so much depth and flavor. I substituted dried figs for the dates, and dried cherries for the raisins and cut mine into eights. I found them be just the right size for breakfast or an in-between-meal snack. I will definitely be making these again!Emily SmithPhiladelphia, Pa3/1/2021Disappointing. Dry and needed to be nuked and buttered to make it palatable but I was looking for something to take hiking or to eat while driving to trailheads. Flax seed is problematic and probably should be ground.HughCalgary, Alberta2/20/2021disappointing, got me in trouble! will revert back to classicNicolasBellevue, WA2/14/2021The flavor was good—toasty and buttery like an oatmeal raisin cookie, but they are very crumbly and need more scone essence. The crumbliness might’ve the oats as I’ve had this issue with a different oat scone. I might try this concept of granola loading again but with another whole wheat scone base recipe that I use consistently.Morgan E.2/11/2021These were very delicious but verrrrry crumbly both in getting the dough together and eating. I had to add an extra 1-2 Tbsps of cream to the dough to get it to even remotely stick together, and had to pat the pieces back together after slicing. They looked like a hot mess but still tasted great! Next time I might try pulsing the fruit in the food processor to get them to meld into the dough better. SoapnanaChicago2/7/2021Excellent flavor, a bit crumbly but nonetheless moist. Not sure if it reminds me of granola but delicious with a cup of tea. Will repeat! AnonymousCascais, Portugal2/7/2021Explore Bon AppétitSconePastriesWhole Wheat FlourFlourOatRice & GrainsDateDried FruitFruitFlaxseedSeedCoconutDried CurrantAlmondNutEasyVegetarianBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}