{"id": "6ffb5c2940017cb69afe87c6fa92df06", "url": "https://www.bonappetit.com/recipe/chicken-tinga-tostadas", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Easy Tostadas With Chicken Tinga and Black Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Tinga Tostadas With Bacony Black BeansBy Rick MartinezSeptember 17, 20214.9(99)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekatarina BoytsovaEmailPinterestPrintEmailPinterestPrintHere's everything you could possibly want on your chicken tostadas (and then some): smoky, spicy tomato salsa, bacon-y refried beans, and a smattering of cilantro and cheese. Use skin-on, bone-in, chicken breasts—they’re juicier and more flavorful than their skinless, boneless counterparts—and if you prefer mild heat, reduce the adobo sauce to 1 tablespoon. Leftovers keep best stored separately and assembled when you’re ready to eat.Tostadas are infinitely versatile. In the summer, when the grill is fired up, we like Shrimp Tostadas with Herbed Mojo de Ajo Slaw. And, if you’re craving crispy tostadas right when you wake up, this vegetarian recipe with beets is topped with fried eggs for a Texas-style breakfast taco feel.Editor’s note: This recipe was originally published on September 29, 2019.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Saucepan$60 At AmazonSpatula$12.99 At AmazonForkLarge Skillet$84 At AmazonWooden Spoon$6 At AmazonPotato Masher$10.19 At AmazonTongs$13 At AmazonMedium Bowl$17 At AmazonIngredientsMakes 8 (4–6 servings)1medium white onion4garlic cloves17-oz. can chipotle chiles in adobo115-oz. can fire-roasted tomatoes2Tbsp. chili powder2skin-on, bone-in chicken breasts (about 1½ lb. total)Kosher salt4oz. smoked bacon215-oz. cans black beans8tostadas4oz. queso fresco¾cup cilantroPreparationStep 1First, prep the spicy tomato sauce: Peel and finely chop 1 medium white onion; set aside ½ cup for serving. Transfer half of remaining chopped onion to a large saucepan (you’ll use the rest of the onion for the beans). Peel and finely chop 4 garlic cloves. Transfer to saucepan. Finely chop 1 chipotle chile and transfer to saucepan. (You can store any remaining chiles individually in the freezer to use for later.)Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Add 1 15-oz. can fire-roasted tomatoes, 2 Tbsp. chili powder, and 2 Tbsp. adobo sauce (use 1 Tbsp. if you're sensitive to heat) to saucepan, stir to combine, and bring to a boil over medium-high heat. Nestle 2 skin-on, bone-in chicken breasts into mixture, reduce heat to medium-low, and bring liquid to a simmer. Cover saucepan and cook until chicken is cooked through and shreds easily with two forks, 25–35 minutes.Step 3Meanwhile, make the beans: Slice 4 oz. smoked bacon into thin strips about ¼\" wide and transfer to a large skillet. Add remaining chopped onion and cook over medium heat, stirring occasionally, until fat has rendered, bacon is crispy, and onion is browned and tender, 8–10 minutes.Step 4Increase to medium-high and add 2 15-oz. cans black beans and their liquid (that's right—don't drain them!). Bring to a boil and cook, stirring occasionally, until liquid is reduced slightly, about 5 minutes.Step 5Using a potato masher (or a wooden spoon, if you're in a pinch), smash beans until almost no whole beans remain and mixture is thick, smooth, and creamy, like the consistency of sour cream. Remove from heat, taste and season with salt if necessary, and let cool slightly; the refried beans will thicken as they sit.Step 6When chicken is finished cooking, use tongs to transfer to a plate and let cool slightly. While chicken cools, increase heat to medium-high and simmer sauce, uncovered and stirring occasionally, until it looks like a thick and chunky salsa, about 5 minutes. Let cool slightly in pan.Step 7Remove skin from chicken breasts and separate meat from bones; discard skin and bones. Shred meat into small pieces and transfer to a medium bowl. Pour warm salsa over chicken, season with 1½ tsp. salt, and toss to coat.Step 8Assemble your tostadas: Use your hands to crumble 4 oz. queso fresco into small pieces (about the size of dried lentils).Step 9Spread about ⅓ cup refried beans over 1 tostada. Top with about ½ cup chicken tinga.Step 10Repeat with as many tostadas as you think you’ll eat (the separate components will keep well in the fridge). Top with queso fresco, cilantro, and reserved chopped onion.How would you rate Chicken Tinga Tostadas With Bacony Black Beans?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleFantastic!  This is a very flavourful and straightforward recipe.  I will make it again and I recommend it to others.   Our family and guests loved it, too. I cooked my beans from scratch, using Allison Roman's instructions, and divided them into two batches: one with bacon and one without.  I'm not sure the bacon is necessary.  The next time I make this, which I will, I will omit it.  There's a lot of flavour going on in the dish and for me the bacon wasn't necessary.  I know, who in their right mind has ever said bacon wasn't necessary?  It's also delicious the next day, so it's a great make-ahead dish I can serve for a weeknight supper or for company and not have to worry about the preparation while entertaining. I served with BA's Spicy and Creamy Slaw Recipe also delicious!  Thank you for the terrific recipes.AmyNew York3/21/2022Absolutely love this! It's simple, fast, and sooo flavorful! Laura BNashville, TN1/31/2022I'm mexican and I love cooking, but this is a different tinga recipe. 🙄LAURAPuerto Vallarta, México 1/18/2022delish!Anonymous904031/13/2022WOW! I made these last night and they were amazing! My husband is a fantastic cook and makes most of our dinners, but I’ve been cooking a couple nights a week. I’m not a great cook so look for recipes that are easy and flavorful. This recipe was definitely both! My husband still hasn’t stopped talking about how good they were. I had leftovers for lunch and I think the chicken was better the second day! I used cheddar cheese instead of queso fresco and added some fresh avocado! Delicious! Definitely will make this again. Lee10/25/2021WOW!!!!! I was desperate for a new recipe so I made this tonight. It’s packed with flavor! The chipotle in adobo makes this dish by giving you “cooked all day” flavor in 45 min. My kids don’t like chunky tomatoes, so i put the fire roasted tomatoes in a blender for just a few seconds to break them down a bit more. I did need to cook it a bit longer to reduce, but the result was perfect for them. Otherwise I followed the recipe completely. Well done Bon Appétit, we’ll be making this one again!!KathyMyrtle Beach, SC10/18/2021This recipe passed with flying colors!  My husband is a native from Mexico and was pining for his mother’s homemade tings’.  After making it he accused me of sweet talking his mother out of the recipe. AnonymousCalifornia 9/24/2021Another genius recipe from Rick Martinez! There is so much flavor in this dish you'd think it took 10x the amount of effort it actually requires. Thank you for this gem- I've been making this on repeat since it was published and never get tired of it!Camille FNew York, NY8/5/2021Simply put, this is FANTASTIC. I followed the recipe to the letter, and my wife and I both absolutely loved it. We had it for dinner, then dinner the next day, then lunch the following day.  And you know what we did while we were eating it for the third day in a row? Making out a grocery list to get the stuff to make it again later this week. It's amazing how good this is for how little effort it requires. Easy enough for a weeknight, but good enough to feed to company. Five stars.Johnny BellrockSedona, AZ8/3/2021Bon Appetit, are you competing with Chipotle now?  Add the contents of several canned products with some powdered spices and mix with a shredded boneless chicken breast???  I'm disappointed.WaljNew York5/24/2021i used canned refried black beans as i was trying to make this easier to count points for my diet plan. I can take a little heat but i skipped the chipotle and adobe altogether and only used 1/2 tbsp chili powder and 1/2 tbsp chipotle chili. They were plenty spicy and flavorful.  T b e cooking method for the chicken is solid.Todd RHarrisburg,  PA3/28/2021This is a keeper. I made this bad boy with black beans I cooked in the instant pot (which was easy peasy, no soaking). I did not really figure out how to get the store bought tortillas that I had very crispy like a tostada should be, in the oven, but next time I am going to try cooking them much longer (350 degree oven, I cooked them about 10 min total, I think they needed more like, 18-20 minutes total?) but they were moderately crunchy and didn't ruin the tostada experience. I also topped these with a basic guac (shallot, lime, salt, avocado) and I can't get a good queso fresco near me so I used some feta. \n\nIt was delicious! And they looked very cute all prepared with their toppings. Will make this again and again! AJSPhilly1/31/2021SO good!  For not a ton of ingredients, this recipe was super flavorful and complex.  I didn't have pre-made tostadas, so I deep fried some caramelo bacon fat tortillas.  Loved it.AnonymousSunnyvale, CA1/26/2021amazing!! My personal goal is to start cooking more. I’m in my 20’s so I will have my own family one day. this recipe was super easy. I’m Latina and the flavors in these tostadas were amazing. My first recipe I’ve made off this site. I cooked it for my family and they all loved it. My siblings aren’t too big on spice so I reduced to 1 TBSP of Chilli powder and it was perfect mix of spicy for us adults but not too spicy for the kids. ( if that makes sense) will definitely be saving this recipe!! ✨AnonymousINDIANA1/5/2021This was awesome! I mixed this refried bean recipe with the one from the BA pupusas recipe and it turned out great! Basically I cooked the bacon (set it aside) charred half of an onion and blended that with the beans. Then I refried the beans in the bacon fat, added little bit extra oil, and put the bacon back in! It was a big hit. the chicken is also so simple and delish. I used sinless skinless thighs.California 10/21/2020Explore Bon AppétitTostadaMexicanLatin AmericanChipotleChileVegetableChickenPoultryChicken BreastBaconCured MeatMeatBlack BeanBeanQueso FrescoCheeseCanned TomatoTomatoMainGluten-FreeNut-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-29", "author": ["Condé Nast", "Rick Martinez"]}