{"id": "7030dbcc7ab65c92ce624a383bcad428", "url": "https://www.bonappetit.com/story/popular-kitchen-gear-2021", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "The Kitchen Accessories We Loved That You Loved in 2021 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Kitchen Accessories We Loved That You Loved in 2021From tiny baking dishes to flameless candles, these are the kitchen tools, ingredients, and cookware you couldn’t get enough of.By MacKenzie Chung FeganDecember 27, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.<Cues retrospective music> What a year, folks. In 2021 we learned how to eat in restaurants again, cooked with our far-flung friends and family for the first time in months, and air-fried. Lots of air-frying. Here at BA we were hard at work Highly Recommending our most treasured snacks and reviewing the tools and appliances we can’t cook without. Some of our favorite products spoke to you. Others…not so much (does no one like raw clams as much as we do?). Below you’ll find the cookware, kitchen accessories, and ingredients you, our readers, loved most in 2021—because if you didn’t get exactly what you wanted this holiday season, it’s not too late to do a little shopping.Tomato powderSenior cooking editor Sarah Jampel gets through winter with these flavor-packed jars of dehydrated tomato powder, and her fellow tomato-desert dwellers couldn’t get enough. The fire engine red variety from the Spice House packs peak summer tomatoey sweetness while Burlap & Barrel’s sun-dried offering is saltier, tangier, and more complex.Photo by Emma FishmanSpice House Tomato Powder$9 at The Spice HousePhoto by Emma FishmanBurlap & Barrel Tomato Powder$9 at Burlap & BarrelAir fryersAh, 2021, the year we all got back to normal bought air fryers. Senior staff writer Alex Beggs fell headfirst into an air fryhole, emerging months later crispier, crunchier, and with recommendations for the best air fryers on the market. Many of you preferred the Cosori Air Max XL, our pick for the best basket-style fryer, but those of you with more countertop space and bigger families went nuts for Beggs’s personal favorite, the Breville Smart Oven Air Fryer.Cosori Air Fryer Max XL$120 at AmazonPhoto by Emma FishmanBreville Smart Oven Air Fryer$350 at Bed Bath and Beyond$650 $350 at Sur La TableOur Place Perfect PotDigital product assistant Nico Avalle wrote this in-depth review of the Our Place Perfect Pot, the latest piece of cookware from the folks behind the trendy Always Pan. His verdict: It’s not for everyone, but it is perfect for some—including, apparently, many of our readers. If you’re looking for a pot pretty enough to go from stovetop to table that steams veggies as well as it simmers soups, this may be the one for you.Our Place Perfect Pot$165 at Our PlaceDiptyque ginger room sprayAll your apartments smell like zesty fresh-cut ginger. This is the only conclusion I can draw from the popularity of this piece on Diptyque’s gingembre room spray, written by assistant to the editor in chief Jenna Adrian-Diaz. It’s potent without being cloying, can be spritzed on fabrics as well as in the air, and will banish the lingering smell of last night’s broiled salmon.Photo by Emma FishmanDiptyque Gingembre Room Spray$68 at Nordstrom$68 at Diptyque ParisBaking Steel skinny griddleWe love a multitasking piece of kitchen equipment, and so do you. This griddle from Baking Steel transforms your burners into a diner-style flattop perfect for smash burgers, omelets, and pancakes for a crowd. But what makes it more than a one-trick pony, writes contributor Jarrett Melendez, is that it doubles as a pizza stone, producing some of “the crispiest pizza [he’s] ever been able to make at home.”Baking Steel$119 at Baking SteelStasher bagsOur commitment to sustainability at work and at home only grew in 2021. One easy swap recipe production assistant Mehreen Karim made (and you made along with her) was subbing in reusable Stasher bags for single-use plastic. They’re safe for use in the dishwasher, freezer, and microwave and can even be used to sous vide.Photo by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)Flameless candlesYou loved these flameless candles. Like, a lot. Maybe you, like culture editor Hilary Cadigan, are tired of blowing your cash on home decor items that are inherently consumable, or maybe you too have cats with a penchant for lighting their tails on fire. Whatever the case, you bought hundreds of these remote-controlled flickering candles, which look better IRL than they do in still images. Hilary promises!Waterproof Flickering Flameless Candles$30 $23 at AmazonPresto waffle makerThe best waffle maker, in Sarah Jampel’s book, is one that doesn’t take up a ton of space and costs less than $50. You agreed, if we’re using the popularity of the Presto FlipSide Belgian Waffle Maker as a metric. It flips from one side to the other, “crossing upside down through the vertical position like a gymnast on a bar” to ensure even cooking and batter distribution—and it also can be stored upright to save space.Photo by Emma FishmanPresto FlipSide Belgian Waffle Maker$55 at Amazon$73 at WalmartUmeshiso Little Dipper spoonIf being obsessed with spoons is wrong, test kitchen director Chris Morocco doesn’t want to be right. His current favorite is the Umeshisho Little Dipper spoon, developed for coffee cupping but equally handy for cooking, tasting, scooping, and slurping. It comes in rose gold, gold gold, iridescent rainbow, and goth black—all colors so pretty that Chris can “barely look at another spoon now.”Umeshiso Little Dipper Spoon$8 at EtsyLaundress barY’all messy. But thanks to this $7 bar of laundry soap, that’s okay! Jenna Adrian-Diaz swears by The Laundress’s Wash & Stain Bar, which has saved her silks and wools from red wine stains, ragù dribbles, and grease splatters.The Laundress Wash & Stain Bar$7 at The Laundress$6 at AmazonTiny baking dishI suppose it makes perfect sense that you all loved this cheerful mini baking dish so much. We spent the first months of 2021 cooking for two instead of 10, and Mehreen Karim’s favorite wee casserole was perfectly suited to scaled-down versions of eggplant parm and ooey gooey butter cake. But I’ll admit to some surprise when the entire internet sold out of these 5x6.5\" dishes thanks to your fervor. The good news is they’re back in stock and ready for winter baking.Photo by Isa Zapata, food styling by Kat BoystovaSweejar Mini Baking Dish$16 at AmazonMask lanyardsAnd the award for the most relevant product of 2021 goes to these beaded mask lanyards, handmade by 10-year-old Tori Taylor. As we dipped our vaxxed toes back into indoor dining, these Croakies-for-your-mask became summer’s hottest dining accessory. It’s looking like they’ll be sticking around into the new year, so if you didn’t grab one in 2021, there’s no time like the present.Photo by Isa Zapata, styling by Nicole LouiePersonalized Mask Lanyards$10 at EtsyExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-27", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}