{"id": "703a2a8217ed493e0ae29b81386aa9b4", "url": "https://www.bonappetit.com/story/ghia-le-spritz", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "All of the Bubbles, None of the Booze | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingAll of the Bubbles, None of the BoozeWhen I’m taking a break from drinking, this nonalcoholic canned aperitivo is my cocktail replacement.By MacKenzie Chung FeganJuly 15, 2021FacebookTwitterEmailPhoto by Nacho Alegre/courtesy Ghia FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I don’t drink cocktails before 6 p.m. This is not a hard and fast rule, and weekends are sometimes exceptions, but for the most part I’m not mixing myself an Americano until evening rolls around. This specificity, to me, is what makes cocktails so delightful—they’re beverages for a time and place, like eggnog (December 1–25 and not a day after) or date shakes (I-10 between Cabazon and Indio, California).So when I’m taking a break from drinking and six o’clock rolls around, what I do not want is another can of the off-brand seltzer I’ve been gulping throughout the workday. I want something special, festive, cocktailesque to help me transition from day to night. Right now, that something is Ghia’s Le Spritz, a sparkling canned beverage with all the bitter complexity of an aperitivo but none of the booze.Photo by Nacho Alegre/courtesy Ghia Ghia Le Spritz$18 at Drink Ghia (4-Pack)Le Spritz—which, according to my high school French, means “the spritz”—is the single-serving, ready-to-drink offering from Ghia, an impeccably branded, nonalcoholic aperitif that packs a seriously bitter bite. I tend to cut Ghia’s original offering with tonic or Spindrift, but with Le Spritz, all I have to do is pop the 8 oz. can and grab my favorite rocks glass. The liquid is the color of a dusky, unfiltered rosé, and the bubbles are present but gentle. Like any good predinner drink, Le Spritz whets your appetite. There’s sweetness from Riesling grape juice and fig concentrate; citrusy and herbaceous notes thanks to yuzu, lemon balm, and rosemary; and a bitter wallop from gentian root, a flowering Alpine plant showcased in aperitifs like Suze and Salers. It’s so complex that it feels like a thoroughly adult beverage, even though it’s zero-proof.No one likes the feeling of deprivation—this is why gluten-free croissants exist, however ill-advised—so when I’m not drinking, I set myself up for success. Sure, I could stick to sparkling water, but why deny myself when Ghia’s Le Spritz fills that cocktail-shaped hole in my heart?Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-15", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}