{"id": "70413772a3a14ec63934b6b43367e53c", "url": "https://www.bonappetit.com/story/miho-imada-sake", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Miho Imada Is Quietly Brewing Some of the Best Sake in the World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMiho Imada Is Quietly Brewing Some of the Best Sake in the WorldOut of 1000 or so sake breweries operating today, only 20 are run by women tōji. But Miho Imada isn’t counting.By Maiko KyogokuApril 18, 2018FacebookTwitterEmailCourtesy of Imada BreweryFacebookTwitterEmailI was sent a list of rules: No perfume. No pictures. Be punctual.You must follow these when you visit Imada Shuzō in Akitsu, Hiroshima, a small brewery in rural Hiroshima that is producing some of the most creative and internationally acclaimed ginjo style sakes today. Imada’s “Fukucho” ginjo sake won the platinum award for Junmai sake at Kura Master 2017, an annual contest selecting the best sakes from over 550 sake brands across Japan. And they are also one of the only sake breweries owned and led by a female sake tōji (brewmaster), Miho Imada.Imada Shuzō was a bucket-list stop on a recent two-week trip I took to Japan this January. Imada’s junmai ginjo sake “Biho” has been on the drink list at my restaurant, Bessou, since the opening. Its bright, fragrant fruit flavors and smooth, soft impression in the mouth make it a lively and elegant sake; it's one of our bestsellers. I was eager to meet the sake master in person and to express my gratitude for making such a lovely drink. Little did I know that behind this small, unassuming brewery, this woman was forging the way towards reviving Hiroshima’s status as one of the best sake makers in the world, all with the utmost humility and grace.The tour would be brief, though, as Miho was in the middle of making daiginjo, the highest grade of sake and the brewery’s finest offering. Daiginjo is known as the crème de la crème of sake and is a far more tedious and meticulous process to make than the average grade, so I understood why Miho wanted little distraction during this period. The rules, the time limit—it all made me so nervous that I arrived in town a full two hours ahead of our tour.The exterior of Imada Brewery.\nCourtesy of Imada BreweryIt was unusually frigid in Hiroshima that day, a prefecture typically known for its mild climates. The brewery was in a nondescript compound enclosed with dark wood fencing. There was no indication that sake was made behind those walls save for a simple table at the entrance that displayed eight or nine bottles of sake with various labels. Near the door, two women were talking to one another, one dressed in workman’s garb with a dark buttoned down denim shirt and a white tenugui towel tied tightly around her head—an additional clue as to what was going on behind those doors.  She looked up and walked toward me. It was Miho.Contrary to my nervousness, when we finally met, Miho was a woman full of ease and calm. She led me to the back tatami mat reception room and asked me to wait while she went to grab some snacks and tea. When she came back with some yokan (a classic red bean dessert) and green tea, she sat down and cracked a smile saying that it had been a busy day so far. It was the first time she’d sat down all morning.Miho’s intensity comes from a deep passion and duty to her craft. Her hometown of Akitsu, in Hiroshima, was famous as the birthplace of ginjo-style sake. Ginjo sakes are premium grade; they’re made with highly polished rice, longer fermentation times in lower temperature. They’re characterized by an aromatic and often complex taste. The difference between ginjo style and regular sake is not unlike the difference in quality between malt and regular whiskey.A 3rd generation tōji, Miho had grown up at the brewery, learning the art of sake from her father and grandfather. She previously led a life in Tokyo working in noh theater—a traditional form of Japanese musical theatre originating from the 14th century and one of the oldest forms of theater known to man—but returned home when her father asked her to continue the family business at the age of 33. She studied under the tōji for eight years before becoming the head sake master.Now Imada Brewery makes about eight different sakes a year, virtually all by hand, with a team of five full-time employees and anywhere from two to five part-time employees throughout the year. “The team is small, so I am needed here all the time,\" Miho explained. When asked whether she felt any distinction as a woman tōji, Miho explained that there might be an image of few women in the sake world; in reality, it hasn’t been the case. Women have been behind the scenes having a hand in the sake making process since ancient times.She was right. As a matter of fact, one of the earliest forms of sake dating back to 3rd century BC is kuchikamizake, made from the saliva of virgins. Roughly translating to “mouth-chewed sake”, kuchikamizake was made by virgins chewing rice in their mouth and spitting it into vats. The chewing and the saliva helped to break down the starch from the rice into glucose, and natural airborne yeast transformed that glucose into a crude form of what’s known as sake today.Regarding women in the sake making business today, she explained, “women have always been around, at least in Hiroshima.” Her response was remarkably modest, considering that of the 1000 or so breweries left in operation today, only 20 are run by women tōji.For Americans, it’s natural to use gender as the framework for a conversation about women in positions of leadership, but I was struck by how Miho didn’t relate to this notion at all. What’s more, even in a country as steeped in traditional social values as Japan, a father can pass on the craft of his ancestors to his daughter, indicating how preserving tradition transcends gender. I felt inspired by this liberal outlook on protecting the ways of the past.Sake tanks the size of water towers on old NYC buildings sat quietly in the background. Miho lifted the lid and gave me a peak of the mash that was fermenting for the daiginjo sake. It smelled faintly of steamed rice. Water, rice, koji, and yeast, the four elements necessary in sake making, are important and each component enriches the flavor. But to truly understand and appreciate sake, said Miho, “you need to understand the land from which it came”—the environment it grows in, the food coming from the land, and the people who make them—“only then do you see what shapes the character of the sake.”But in the case of Imada Brewery, it is not land, but the sea that inspires the unique flavor of the sake.We were back in the tatami mat room and quiet filled the air. Miho took out her Japanese smart phone and played me “Sea in Spring” (Haru no Umi), an iconic folk song from the 1920s by Michio Miyagi. She softly hummed along. “The song is about the Seto Inland Sea. You hear the song and you are there,” she said. It was as though the slow and soulful cry of the shakuhachi flute and the lively koto, a Japanese string instrument, hinted at the great sea coaxing life from its slumber.The Seto Inland Sea.\nPhoto by Maiko KyogokuSeto Inland Sea is the soul of the town of Akitsu. It is a magnificent body of water that spans the heart of Japan for about 300 miles from Kobe to Fukuoka. It is the lifeline for so many who live in the region and the source of some of the rarest fish including the freshest oysters I would ever taste later that evening. “Our sake was created to be enjoyed with the many different kinds of seafood from Seto Sea in mind,” said Miho, “Now let’s go see it.”We hopped into her white sedan and drove to a small island offshore and got out to stare at the Seto. Yes, I could see it. The surface sparkled like light refracting through thousands of magnificent diamonds. With Miyagi’s flute still playing in my mind, I felt like I was being transported to an older time in Japan. We stood side by side, staring at the sea. The winds picked up and my scarf billowed behind me, but I was transfixed by the shimmering waters that provides so much to the people surrounding it. I could see how important this body of water is for the people of Hiroshima as a source of nourishment for both body and spirit.Sakakiyama Hachiman Shrine in Akitsu, Hiroshima.\nPhoto by Maiko KyogokuOur last stop before heading back to the brewery for the official tour was to nearby Sakakiyama Hachiman Shrine, dedicated to the sake gods of the area. We walked up 30 or so steps on a stone path lined with stone lanterns to an open space where the shrine sits. It was much more sparse than other religious sites I had visited, with no real decorations except for the sake barrel statues that featured prominently in front of the shrine. Instead of the komainu (guardian lion-dog statues that are commonly seen as protectors of the shrine), stone sake barrels stand in their place, symbolizing how important sake is to Akitsu. Miho wanted for us to pay our respects to the sake gods, but also to see a statue of Senzaburou Miura, the godfather of ginjo sake from the late 19th century. Miura created the methods to successfully brew sake in Hiroshima using Hiroshima’s water, which is known for its low minerality and difficulty in brewing. It was due to Miura that the town had prospered in sake making for the past 130 years, and I could sense in Miho’s explanation how significant he had been for Akitsu and the Imada house. I placed my hands together and bowed my head, and felt happy in that moment that I was able to express my gratitude and respect for the people and place that had shaped Miho and her sake.A statue of Senzaburou Miura, the founder of Ginjo style Sake.\nPhoto by Maiko KyogokuWe went back to the brewery and finished the tour of the property, just in time to catch the early evening train back to Hiroshima City proper.That evening, upon the suggestion of Miho, I went to a tiny izakaya called Koishi in the heart of Hiroshima City. Enjoying a plate of sautéed local uni and spinach in butter and creamy grilled oysters caught in Akitsu bay that morning, I enjoyed a glass of Miho’s “Fukuchou Hattansou,” a junmai ginjo sake made with a rare, near extinct type of sake rice from Hiroshima known as hattansou. The sumptuous, full-bodied sake was unhurried in its expression, but had a surprisingly sharp and clean finish. It reminded me of everything that I had seen that day—the steady sparkle of the sea, the slow deliberate note of the shakuhachi, and most of all, the sake maker herself—brisk and full of grace.Maiko Kyogoku is the owner of Bessou, a Japanese restaurant in New York City that features inspired takes on Japanese comfort food based on family recipes.Explore Bon AppétitJapanSakeRestaurants + TravelRead MoretechniquesDonabe: The One-Pot Wonder for All Your Kitchen NeedsBy Elyssa GoldbergtechniquesA Guide to Easy Japanese Home-CookingBy Amiel StanekLifestyleWhat Is Matcha, the Powder Turning the World Green?By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-18", "author": ["Condé Nast", "Maiko Kyogoku"]}