{"id": "7058b922fc9acb8cba3bd2978a8b45c2", "url": "https://www.bonappetit.com/story/amanda-chantal-bacon", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Amanda Chantal Bacon's Wedding Cake Was Laced with Sex Dust Obviously | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAmanda Chantal Bacon's Wedding Cake Was Laced with Sex Dust ObviouslyThe Moon Juice founder enlisted Sweet Laurel bakery to create a custom, anti-inflammatory, libido-boosting wedding cake.By Christine MuhlkeMay 4, 2018FacebookTwitterEmailPhoto courtesy of Azione PRFacebookTwitterEmailViolet Bakery’s royal wedding cake might be grabbing all the attention these days, but we’re particularly fascinated by what Amanda Chantal Bacon, America’s glowiest wellness entrepreneur fed to her new husband at their March wedding.Of course the Moon Juice founder—a former Lucques chef whose popular L.A. juice bar powerballed into an adaptogenic herb empire—wouldn’t order a sugary, gluten-leaning wedding cake. Instead, she and her fiancé, drummer and Devandra Banhart collaborator Gregory Rogove, turned to her friends Laurel Gallucci and Claire Thomas at Sweet Laurel, a Los Angeles baking company known for its floral-topped cakes free of grain, gluten, refined sugar, and dairy.Galucci and Thomas took Bacon’s favorite chocolate caramel cake—the base includes almond flour, super-dark heirloom criollo cacao, coconut oil, Himalayan pink salt, and maple syrup—and frosted each layer with their almond-butter and date-based vegan caramel and a ganache that had been “dusted” with Moon Juice’s Sex Dust. (The waitlisted blend of herbs is said to combat stress and boost energy and “male reproductive strength.”)“I really didn’t care how it looked, just that it was delicious, potent, free of ingredients that would cause inflammation, and was made by a friend,” said Bacon. “I knew Laurel was the only person for the job. She could really appreciate a 90 percent cacao ganache and not be intimidated by the Sex Dust.”“Amanda and her family have always loved our chocolate caramel cake, and adding Sex Dust made it perfect for her wedding day (and night) lol,” wrote Gallucci, who has seen an uptick in requests for Sex Dusted cakes. (In addition to being in demand in L.A., Sweet Laurel recently started shipping nationally.) She and Thomas hope to eventually add the Sex Dust cake to their regular roster.Amanda Chantal Bacon confirmed that her version was perfect and enjoyed by the whole party. “We were encouraged to consummate our marriage after being sent off to our suite with a box of Sex Dust cake,” she added.No word on whether they remembered to freeze a slice.Explore Bon AppétitHealthyishWeddingCakeTrendsRead MoreLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Christine Muhlke"]}