{"id": "7061d52048f1be83b87ac8b1f0262631", "url": "https://www.bonappetit.com/story/ernestos-nyc", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Ernesto's NYC Is My New Go-To Spot for All Things Spanish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ve Found My New Go-To Spot for All Things SpanishGo to Ernesto’s in New York City, and you’ll find me sitting at the bar, eating pintxos, drinking vermouth, and having a good time.By Alex DelanyFebruary 26, 2020FacebookTwitterEmailPhoto by Rachel VanniFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Here’s what will happen when you walk into Ernesto’s: You will see bottles of Isastegi cider on more than a few tables. Waiters will be handing plates of Basque-style seafood—packed with olive oil, aioli, paprika, and fresh herbs. Everyone will be clinking glasses and having a good time. And if you scan the entirety of the restaurant, you will probably spot me—sitting at the bar, eating pintxos, drinking vermouth, and also having a good time. Because while Ernesto’s is great for many things, it is maybe the best for some of my most favorite things: Spanish bar snacks and drinks.Chef Ryan Bartlow takes his experience working at San Sebastián’s Akelarre, a Michelin-starred restaurant serving ambitious seafood, and simplifies it on his own menu of Basque cuisine. That means croquetas filled with creamy, shredded chicken. Gildas stacked with raw tuna, green olives, and snappy pickled peppers. Toasted baguettes topped with perfectly cooked shrimp and peppers. And a pile of house-fried potato chips draped with thinly sliced jamón ibérico. These are proper bar snacks. Don’t pick favorites. Embrace them all.And the same goes for the vermouth and wine lists. Bottles of Spanish natural wine from passionate, thoughtful importers, like José Pastor Selections and Selections de la Viña, are there. Vermouths from culty producers (Partida Creus!) are just as good sipped straight as they are with lemon juice and soda water. Whatever you choose, it will pair perfectly with those pintxos.Just because that’s my move, doesn’t mean it has to be yours. Maybe you make the warmly lit, flower-filled space into a temporary residence over a relaxed five-hour dinner. Maybe you stop by Ernesto’s café next door for coffee and pastries on Saturday mornings. Maybe you drink wine at the bar before heading to some other Lower East Side spot. Whatever you do, you know where to find me, perched at the bar, eating pintxos, and drinking vermouth all night long.Go there: Ernesto’sExplore Bon AppétitHighly RecommendRestaurantsNew York CityRead MorerestaurantsThis Tortilla Española Is Like a Savory Molten Lava CakeBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-26", "author": ["Condé Nast", "Alex Delany"]}