{"id": "7080f5bd85f33d4457353e20a30d29f1", "url": "https://www.bonappetit.com/story/electric-griddle-fathers-day", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "The Electric Griddle That Turned My Dad Into a Short-Order Breakfast Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Electric Griddle That Turned My Dad Into a Short-Order Breakfast CookEvery time I go home to visit my family, he makes pancakes and eggs on his trusty electric griddle. And now I do the same.By Alyse WhitneyJune 11, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailMy parents only go out to eat once or twice a month, so most of my food memories are of sitting around our four-person kitchen table, eating something simple and home-cooked. Even though my mom cooks fantastic lasagna, “poor man’s steak” (aka Salisbury steak), and a number of different rice casseroles, the food I most associate with going home is the pancakes my dad makes on his electric griddle.He uses a box of “just add water” Hungry Jack pancake mix, “whisped”—the way he grew up saying “whisked”—gently once, and then again after the batter settles to ensure it’s the right consistency. It’s not the flavor of the pancakes that makes me crave them so much, it’s the fluffy texture and crisp edges that form once he ladles batter onto the griddle.I can’t remember a time before we had our Presto griddle sitting on top of the fridge. It has never collected dust because we used it at least once a week from when I was in grade school all the way up until I left for college. I think my dad got it at a Black Friday sale for $15, and even though it has been used for more than a decade, it has held up. Sometimes the light doesn’t go on to let you know it’s preheated, but he refuses to let me buy him a new one. It has history.My dad’s pancake process is very specific: First, he preheats the electric griddle to 325°—never any hotter, so they don’t cook too fast. Then he greases the whole thing with a swipe of Crisco and keeps the container near him with a piece of wax paper so he can repeat the process if need be. (I tried using butter once when I made him breakfast for Father’s Day—it burned and did not give the pancakes that even crispness around the outer edge.) Instead of a ladle, he uses a ¼-cup measure to portion out medium-sized pancakes, lets them bubble up on one side, flips, and then immediately puts about ½ tsp. of butter on each pancake to melt into the surface. He usually makes 4–6 pancakes at a time, leaving room on the griddle to cook a few eggs over-easy. He serves everyone a small stack before he sits down. As he cooks on the counter next to our dining table, it’s like watching a chef in an open kitchen. He’s the best short-order cook because of this electric griddle.Add a few over-easy eggs, and that’s my dad’s signature breakfast.\nAlex LauAfter moving out of my parents’ house, I missed our pancake breakfasts, so I bought an electric griddle and turned my off-campus apartment into a little diner. The griddle is naturally non-stick and not heavy like a cast-iron one. It's been with me through four different NYC apartments and many diner-style brunches, where I've introduced my friends to the sweet and savory sauce that the runny yolks and maple syrup form on top of the stack. I've used boxed mix, Julia Child’s buttermilk pancake recipe (that I have written down in my phone because my grammy told me it was her own recipe), and Bon Appétit's pancake recipe.The griddle isn’t only for pancakes and eggs—I’ve used it to make half a dozen grilled cheese sandwiches, warm tortillas for taco nights, burgers for a 4th of July party (where the built-in grease tray came in handy), and homemade breakfast sausage. The griddle makes it easier to cook for a crowd, and it also bridges the gap between New York City and Binghamton, NY. My dad always feels close by when the griddle is on, and when I tell him about it later, he‘s glad I saved money and cooked at home. Some things never change.Buy my dad’s favorite Presto slimline griddle for $45 on Amazon if you can’t wait for a Black Friday sale like him.Want more pancake inspiration? These whole grain ones should do the trick.Whole Grain Pancakes with BlackberriesWhen you want a skillet-sized pancake, burnished from whole wheat flour and studded with cooked grains, flavorful and with a hardy texture.View RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitFather's DayBreakfastPancakeShoppingRead Moretest-kitchenSleep In, Then Make the Best Blueberry Pancakes of Your Life This WeekendBy Rick MartinezcookingChocolate Chip Pancakes Cooked in Bacon Fat: Okay!By Alex BeggscookingThe Real Deal Buttermilk We're in Pancake Love WithBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast", "Alyse Whitney"]}