{"id": "7090e8da68eb1c0d7307413c8e4921d6", "url": "https://www.bonappetit.com/recipe/chicken-saltimbocca-with-crunchy-pea-salad", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Chicken Saltimbocca with Pea Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueChicken Saltimbocca with Crunchy Pea SaladBy Katie Jackson, Nick Perkins, and Aaron CrowderMarch 19, 20194.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSaltimbocca literally translates to “jumps in your mouth\"—so yes, it's extremely flavorful. The combination of prosciutto and sage is a classic that pairs with just about any side or salad.Ingredients4 servings28-oz. skinless, boneless chicken breasts3large eggs, beaten to blend2cups panko¾cup all-purpose flourKosher salt8sage leaves4thin slices prosciutto2cups vegetable oil4scallions, very thinly sliced on a diagonal8oz. sugar snap peas, strings removed, thinly sliced½cup mint leaves, torn if large2tsp. finely grated lemon zest1Tbsp. fresh lemon juice1Tbsp. extra-virgin olive oilFlaky sea saltLemon wedges (for serving)PreparationStep 1Place a chicken breast on a cutting board. Holding a knife parallel to board and working along a long side, cut through center of breast until you are ½\" from the other side. Open like a book and place butterflied breast between 2 sheets of plastic wrap. Gently pound as thin as possible without tearing meat—about ¼\" thick and 8\" wide is ideal. Repeat with remaining breast.Step 2Place eggs, panko, and flour in separate shallow bowls (cake pans or pie plates work great). Season cutlets lightly with kosher salt. Working with 1 cutlet at a time, press 2 sage leaves onto both sides of meat. Wrap 2 pieces of prosciutto around each cutlet to make a belt that holds in the sage. Dredge in flour, shaking off excess. Dip in eggs, letting excess drip back into bowl. Coat in panko, pressing lightly to help it adhere, then shaking off excess. Place cutlets on a rimmed baking sheet.Step 3Heat vegetable oil in a large skillet over medium-high until very hot (an instant-read thermometer should register 350°–375°). Carefully lower 1 cutlet along the side of the skillet closest to you and let it slide into oil so it’s lying flat. Swirl oil in skillet carefully so that cutlet is submerged and cook just until bottom side is golden brown, about 2 minutes. Using tongs, carefully turn and cook until golden brown on the other side, about 2 minutes. Transfer to a wire rack; season with kosher salt. Let sit 5 minutes. Repeat with remaining cutlet.Step 4Toss scallions, peas, mint, lemon zest and juice, and olive oil in a medium bowl; season with kosher salt. Arrange cutlets on a platter and top with pea salad. Sprinkle with sea salt; serve with lemons.How would you rate Chicken Saltimbocca with Crunchy Pea Salad?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis was quite good, but I had the benefit of other reviewers.  I think there needs to be more sage for sure as others have said.  \nThe texture came out perfect following the instructions as written.\nThe pea salad was also excellent.\nMy wife and I agreed this is a lot of work and cleanup for dinner for two, but for four or more, it was great.\n\nDave HenningChandler, AZ11/21/2020Pretty good. The prosciutto got a little lost amongst all the fried breading. The sporadic placement of the sage was also not favourable as there were some bites with no sage and some with large amounts. I would make this again but add ground sage or finely chopped fresh sage to the breading mixture  AnonymousVancouver 5/27/2020This is a winner and truly belongs in the chicken hall of fame. The sage with the breading... delicious! And super easy. The salad is also a perfect combo! \nI've decided to use the COVID time at home to cook my way through the Bon App Chicken Hall of Fame. I'll be rating each recipe as I cook them... unless I get tired of this. LOL danimalcrackersChicago4/24/2020I'm confused. I'm going to make this tonight, but does the sage and prosciutto go inside the butterflied cutlet? Wish there was a video to go with. AnonymousLos Angeles, CA 8/11/2019Had a taste of the Sugar Snap Pea Salad just as I finished it. Before chilled?  This is a winner. Will use it for Hollywood Bowl Box Picnic. The chicken?  Husband wants it for lunch tomorrow. Need I say more. Great. Simple. Easy recipe. AnonymousPasadena, CA6/13/2019This is OK, but it's not chicken saltimbocca. I'd rather just have a plain (good) chicken schnitzel, which is what this is with the addition of prosciutto and sage. AnonymousBoston6/3/2019My family and I loved this! I bought chicken cutlets which saved a ton of work and served this with roasted potatoes and radishes that had been tossed in olive oil, lemon juice and a little bit of honey. Delicious dinner!AnonymousNormandy Park, WA5/20/2019Absolutely delicious! Everything turned out perfectly. The pea salad was a great compliment to the saltimbocca! Already thinking about making it again and sharing the recipe with family and friends. teleath7315Austin, TX5/16/2019Delicious! Crunchy and crispy on the outside and juicy tender on the inside! Anonymous5/5/2019Incredible dish, the sage adds so much flavor. Also very easy to make!ryenicholsonColumbus Ohio5/4/2019I just wasn’t a fan of this dish. Adding prosciutto to a fried piece of chicken was a waste of an expensive ingredient. It totally disappeared in the dish as well as the sage leaves.  The crunch Pea Salad was lovely.  It will be a wonderful addition to my pot luck/sick friend repertoire.MsjohnstonColumbus, IN4/14/2019Crunchiness heaven!  The tastes and texture of this dish was a winner.  Whole family liked this one.  I used a bit over a lb of chicken, and still didn't need as much flour, egg or panko as was called for.  Also, it's fine not to submerge the chicken in oil - I used about  2 thirds of the called for amount.  \nEasy to make, delicious, and fresh.  Chicken was completely moist inside the crust.  5 stars!AnonymousMenlo Park, CA4/11/2019Explore Bon AppétitItalianEuropeanChicken BreastChickenPoultryProsciuttoHamMeatSugar Snap PeaPeaVegetableMainDairy-FreeNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Katie Jackson", "Nick Perkins", "Aaron Crowder"]}