{"id": "709458ff5395b17106183457b97cd4b6", "url": "https://www.bonappetit.com/recipe/chicken-and-bacon-choucroute-with-potato-salad", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chicken and Bacon Choucroute  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueChicken and Bacon Choucroute with Potato SaladBy Chris MoroccoNovember 20, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis chicken-meets-bacon-meets-sausage-meets-sauerkraut showstopper takes only 25 minutes in the oven. And there's no carving needed: Once this hearty main goes into the oven, your work is done and you can enjoy the party too.Ingredients8 servingsPotato Salad3lb. baby Yukon Gold potatoesKosher salt2small shallots, finely chopped⅓cup extra-virgin olive oil⅓cup white wine vinegar3Tbsp. Dijon mustard2tsp. hot sauce1tsp. honey¼cup tarragon leavesChoucroute1Tbsp. extra-virgin olive oil3lb. skin-on, bone-in chicken thighs (6–8)Kosher salt8oz. slab bacon, sliced ½\" thick6garlic cloves, lightly crushed2large sprigs thyme1tsp. juniper berries2lb. sauerkraut (about 4 cups), rinsed, squeezed dry1cup dry white wine2lb. sausages, such as kielbasa and/or bratwurstPreparationPotato SaladStep 1Place potatoes in a small pot and pour in water to cover by 2\"; season generously with salt. Bring to a boil, then immediately reduce heat so water is at an active simmer. Cook potatoes until fork-tender, 22–25 minutes. Drain; let sit 5 minutes to dry.Step 2Meanwhile, whisk shallots, oil, vinegar, mustard, hot sauce, and honey in a large bowl; season dressing with salt.Step 3Add hot potatoes to dressing and let sit, tossing occasionally, until they are just warm and have soaked up some of the dressing, at least 15 minutes and up to 1 hour. Just before serving, add tarragon to potato salad and toss to evenly distribute.Step 4Do Ahead: Potato salad (without tarragon) can be made 3 days ahead. Cover and chill. Bring to room temperature before serving.ChoucrouteStep 5Place a rack in upper third of oven; preheat to 400°. Drizzle oil in a large skillet. Season chicken generously with salt and arrange skin side down in a single layer in skillet. Set over medium heat and cook chicken, undisturbed, until skin is golden brown around the edges, 12–15 minutes. Using a stiff spatula, lift up chicken, then put it back down, still skin side down. Once chicken pieces have all released from skillet and slide around easily, continue to cook, shifting pieces as needed if browning unevenly, until skin is deeply browned, 6–8 minutes longer. Transfer chicken to a plate and turn skin side up. Pour off all but ¼ cup fat from skillet.Step 6Add bacon to same skillet and cook, turning once, until lightly browned, about 5 minutes; transfer to a plate. Cook garlic in skillet, tossing occasionally, until golden brown, about 3 minutes. Add thyme sprigs and juniper berries and cook, tossing, just until fragrant, about 1 minute. Add sauerkraut and wine, increase heat to medium-high, and cook, stirring occasionally, until wine is almost completely evaporated, 6–8 minutes. Remove skillet from heat.Step 7Place sausages in a 3-qt. baking dish and pile sauerkraut over (sausages should be submerged). Arrange chicken thighs and bacon on top of sauerkraut. Pour in ¾ cup water and bake choucroute until chicken is cooked through and liquid is bubbling throughout, 25–30 minutes. Let cool slightly. Serve with potato salad.How would you rate Chicken and Bacon Choucroute with Potato Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a keeper that we keep coming back to. Easy enough to prepare, but special enough for a festive occasion.AnonymousPortland, OR12/18/2020This meal was delicious! The recipe was a little unclear about whether the sausage should be precooked especially since we used fresh bratwurst but we precooked it partway and it was fine. We were unable to get slab bacon but thick sliced bacon worked out perfectly fine as well. I will definitely make this again.AnonymousNew York12/30/2018Explore Bon AppétitFrenchEuropeanChicken ThighChickenPoultryKielbasaSausageMeatBaconCured MeatPotatoVegetableYukon Gold PotatoMainDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}