{"id": "70973117f5588f3deb36d0730eb1200a", "url": "https://www.bonappetit.com/recipe/black-forest-layer-cake-with-cherry-preserves", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Black Forest Layer Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlack Forest Layer Cake with Cherry PreservesBy Natasha PickowiczSeptember 18, 20182.9(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintSome chocolate cakes can be overwhelmingly intense, but this one manages to feel light and balanced, with no single component dominating the others. Even if you’re not a fan of fruit and chocolate, this combination will change your mind.Ingredients12 servings Soak1cup (225 g) whole milk1.8 oz. (50 g) 70% cacao chocolate, finely choppedFilling1envelope unflavored powdered gelatin (about 2½ tsp.)9½oz. (270 g) 70% cacao chocolate, finely chopped1tsp. kosher salt¾cup (175 g) whole milk¼cup (80 g) light corn syrup1½cups (350 g) heavy creamAssemblyChocolate Genoise⅔cup cherry preservesChocolate Swiss Meringue ButtercreamPreparationSoakStep 1Heat milk and chocolate in a small saucepan over medium-low, whisking often, until chocolate is melted and mixture is smooth. Cover and chill.Step 2Do Ahead: Soak can be made 3 days ahead. Keep chilled.FillingStep 3Place ½ cup cold water in a small bowl and sprinkle gelatin evenly over top; chill until ready to use.Step 4Place chocolate and salt in a large wide bowl. Heat milk and corn syrup in a small saucepan over medium, whisking to combine, until steaming and barely simmering around the edges of pan. Remove from heat and add softened gelatin, whisking until dissolved. Reheat milk mixture briefly over medium-low (do not let it boil), then pour over chocolate mixture and let sit 1 minute. Gently whisk until smooth; reserve saucepan.Step 5Heat cream in reserved saucepan over medium just until warm to the touch, about 1 minute. Gradually stream cream into chocolate mixture, whisking constantly until incorporated and smooth. You should have around 4 cups ganache. Cover and chill until set, at least 4 hours.Step 6Do Ahead: Ganache can be made 3 days ahead. Keep chilled.AssemblyStep 7Line a 9\"-diameter cake pan or springform pan with plastic wrap, pressing into bottom and leaving generous overhang. Fit a 1-piece round of cake into pan, placing bottom side up. Using a pastry brush, dab a quarter of soak across entire surface of cake. Spread a third of cherry preserves over with a small offset spatula. Stir chilled ganache to loosen, then scrape a third over cherry preserves and smooth into an even layer. Place another round of cake on top of ganache, bottom side up, this time using a 2-piece layer. Repeat soaking and filling process. Top with the remaining 2-piece round of cake, bottom side up, and repeat soaking and filling process one more time. Top with remaining 1-piece round of cake, bottom side up, and brush with remaining soak. You should have 4 layers of soaked cake separated by 3 layers of filling. Wrap plastic overhang up and over cake; chill at least 12 hours and up to 2 days to allow ganache to set and cake to absorb soak.Step 8To frost, remove plastic from top of cake and invert cake onto a cake plate or platter. Remove pan and plastic. Dollop about 1 cup buttercream over top of cake and smooth across top and down sides, creating a very thin base layer. You want to fill in any gaps, adhere any crumbs to the cake, and seal in the fillings (this is called a crumb coat). Chill cake 10 minutes, then scrape remaining frosting on top of cake and spread all over, working down and around sides. Decorate as desired.Step 9Do Ahead: Cake can be made 2 days ahead. Chill until frosting sets; then cover loosely with plastic wrap. Let sit at room temperature 1–1½ hours before slicing.Photo by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyStep 10Highly recommended reading: Layer cake tips, tricks, and common mistakes from Natasha Pickowicz.How would you rate Black Forest Layer Cake with Cherry Preserves?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleLike in previous comment:,,Aside from the Chocolate Swiss Meringue Buttercream, this cake was a complete disaster.'' The filling was a disaster, runny, not set....... DONT use this recipe. PS:(why gelatin?? in the video with claire, she didnt add gelatin.......adamfrBelgium4/7/2020It turned out very well for me also. There was nothing confusing in the recipe, although it did require reading and studying to make sure I understood how three separate recipes with appropriate variations in the article all came together and I fully understood the time it took for the entire process to play out - about 2-1/2 days for me. markkuboPetersburg, AK11/25/2018I was surprised by the negative reviews.  Every part of this cake turned out well, and although it does not have a strong chocolate flavor, it's delicious.  It must be assembled in a springform pan or mold because when the ganache filling is soft enough to spread, it's also soft enough to fall out the sides of the cake.  If assembled in a mold and chilled before frosting it holds its shape.  We enjoyed the cake and I'll make it again.handweaver1Eugene, OR10/16/2018I found the directions to be rather confusing. Unfortunately, the magazine has suffered for years now. It is not the source for wonderful and sure fire recipes that it used to be years ago. Something has changed in the management of the magazine and it was not for the better. Luckily I have saved lots of issues from many years ago when it was a good magazine, and I continue to use my old issues. I keep trying and checking back from time to time hoping things will improve, but no luck so far.casual cookCalifornia10/13/2018Aside from the Chocolate Swiss Meringue Buttercream, this cake was a complete disaster. The Chocolate Genoise cake was so light in flavor that you couldn’t even tell it was chocolate, yet it was still somewhat dense. The color looked nothing like the picture that is shown, more like a well cooked vanilla cake. The Ganache filling never fully blended or fully set, leaving me with a gritty chocolate fluid. After waiting for hours longer than the recipe called for, hoping for the ganache to set, I gave assembling the cake the old college try and the whole thing just blew out. While I’m no Christina Tosi, I’m also not a beginner baker and this recipe was not worth the work. I ended up with a sad mound of what I guess you could call trifle, the only part truly worth eating being the Buttercream. This cake was the biggest failure of my baking career, I encourage you to find a better use of 21 eggs.AnonymousBrooklyn, NY10/8/2018I also have a question about the recipe....why are there not directions and ingredients for making a cake to go with the soak and the filling.  The directions tell you to \"fit a 1 piece round of cake\" into a pan to begin assembly but there are not ingredients concerning the making of a cake and no instructions for how to make the cake.  Is it just assumed that one will make a cake to use in the assembly of the final product?  mjc52d9454Tyler, TX10/5/2018More of a comment/question than a review.....I am wondering why a pastry chef would still use such an undesirable ingredient such as corn syrup?  And, would coconut sugar syrup or rice syrup be a suitable substitution?\nThanks,\nHeatherheatherfromvancouvervancouver british columbia canada9/28/2018Explore Bon AppétitCakeDessertLayer CakeGermanEuropeanChocolateOther IngredientsCherryStone FruitFruitVanillaHerbs & SpicesBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Natasha Pickowicz"]}