{"id": "70a7f7f3c8c762571baf245688b99306", "url": "https://www.bonappetit.com/recipe/pretzel-focaccia", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Pretzel Focaccia Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPretzel FocacciaBy Amiel StanekJanuary 27, 20204.1(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintFocaccia may be the easiest, most foolproof bread to make at home—no sourdough starter, no complicated spreadsheets full of percentages to worry about, no mixer required. The only nonnegotiable is making the dough the night before you plan to bake, which helps to develop flavor. What makes it “pretzel,” you ask? Brushing the surface of the dough with a baking soda–water mixture alkalizes the exterior, producing a deeply browned crust with a pretzel’s signature slightly bitter twang. You can eat it as is, or serve it with a spread—sausage, sauerkraut, pickles, grainy mustard, and mayo—for DIY sandwiches. IngredientsMakes one 18x13\" pan6¼cups (780 g) all-purpose flour2Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt1tsp. active dry yeast1Tbsp. cold unsalted butter, plus 3 Tbsp. unsalted butter, melted2Tbsp. vegetable or other neutral oil2Tbsp. baking sodaPretzel or flaky sea saltPreparationStep 1Whisk flour, kosher salt, and yeast in a large bowl until well combined. Gradually add 3½ cups warm water a few big splashes at a time, stirring with a wooden spoon to incorporate, until a thick batter forms. Continue to stir aggressively for a minute or so to get any lumps out. Cover bowl and chill at least 12 hours and up to 2 days.Step 2Grease an 18x13\" sheet pan generously with 1 Tbsp. cold butter, making sure every corner and side is covered. Drizzle oil onto pan and spread with your hands until every surface is covered.Step 3Using a rubber spatula or plastic bench scraper, turn dough out onto sheet pan. Using your hands, gently spread dough in an even layer to edges of pan.Step 4Place baking soda in a small bowl or mug and slowly pour ½ cup boiling water over, stirring to combine with a pastry brush. (Heads up: It’ll get foamy!) Generously brush entire surface of dough with baking soda solution; set aside remaining baking soda solution. Let dough rise in a warm place until nearly doubled in size, bubbly, and loose-feeling, which can take anywhere between 30 minutes to over 1 hour, depending on the temperature of your kitchen and the season.Step 5Place a rack in center of oven; preheat to 475°. Gently brush dough with reserved baking soda solution (you may not use it all). Bake 10 minutes. Rotate pan from front to back and brush focaccia with 3 Tbsp. melted butter; sprinkle generously with pretzel salt. Continue to bake until top is deeply browned (like a pretzel!) and underside looks browned and crispy when pried up with a spatula, about 10 minutes longer.Step 6Let cool slightly. Using a fish spatula or other flexible metal spatula, release focaccia from pan and transfer to a wire rack. Let cool completely.Photo by Laura Murray, Food styling by Yekaterina Boystova, prop styling by Allie WistHow would you rate Pretzel Focaccia?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis turned out so well when we made it for a party! Perfectly chewy and crispy my husband and I couldn't keep our hands off of it. This will take the place of making individual pretzels for us!AnonymousRinggold, GA3/28/2020So delicious! I might never make regular focaccia again AnonymousNew Jersey3/25/2020I followed these instructions to a tee and it turned out all wrong. It's dense, gummy, and tastes so much like baking soda it's almost inedible. Perhaps my fridge is too cold, and my kitchen is too cold, so it didn't rise properly? I let it proof in the oven with the oven light on for about an hour and baked exactly as instructed. Any idea why this happened?AnonymousLos Angeles3/24/2020Pretzel-y flavor with the texture of focaccia. Loved it.AnonymousSan Jose, California3/23/2020Made it for the first time for a German dinner we were having. My family loved it and made me promise to make it again. It’s an unusual recipe. The dough is really like a batter. You pour it onto the pan. Painting it with baking soda and water is a challenge and next time I’ll try to find a different tool than a pastry brush. Stick with the instructions. It does get dark brown. The inside stays soft and since I used bread flour, chewy. Great flavor too. A new favorite.AnonymousConnecticut3/23/2020This was tasty! Not quite a pretzel, not quite focaccia. Better for a party than a snack. I think it could make for interesting sandwich bread. Mine was a nice golden brown and not pretzel brown. Could have not been in the oven for long enough. AnonymousPhiladelphia3/15/2020We made this over the weekend and it was so good! Definitely going to add it to our repertoire. We made a few mistakes- didn't read the recipe and used olive oil to coat the pan instead of a more neutral oil and accidentally let it over proof (errands ran a little long!)- but it didn't affect the bread at all. The texture is airy and chewy. \n\nIf anything, I'd warn you to use less of the baking soda mixture than more. It sort of pooled along the edges of the bread and made them a bit more pretzel bitter (if that makes sense?) than the center but still enjoyable. We also used more like 4 tbsp of butter, making sure to get as much in the edges as possible. \n\nThis bread is so easy (with a little planning) but so worth it!AnonymousNew Jersey3/9/2020This recipe worked for me and I loved the result. It is an easy recipe, but does need a bit of planning ahead. In the midst of putting this together, I was confounded by the amount of wet ingredients. Brushing baking soda and water mixture onto a raw dough feels wrong. But, it was right. The focaccia tasted like a buttery soft pretzel with more air pockets and chewiness. Mine looked like the pictures as well (and it didn't look that way until the very end of the bake, so hang tight). Have recommended to friends and am recommending to you, fellow baker. A final note, I used a 13 X 9 pan which made for a thicker version but it worked for me. C_B_EllenBoston, MA2/28/2020The flavor of this bread is as if you're eating it while sitting next to someone who's thinking really hard about pretzels. The dough was very wet (why does this recipe call for 1 cup more water than the classic focaccia recipe?), which made it difficult to brush the baking soda solution on. The final product had good flavor because of the overnight prove, but otherwise was unexciting. It's a good concept, but it might be more effective to just make another focaccia recipe and just adding the baking soda/pretzel salt.AnonymousProvidence, RI2/27/2020Explore Bon AppétitBreadYeastOther IngredientsSideSnackNut-FreeVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-27", "author": ["Condé Nast", "Amiel Stanek"]}