{"id": "70afeb6e871f38e521c9b3d370f3cd2f", "url": "https://www.bonappetit.com/story/altar-ceramics-maui", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Altar Ceramics (Not a Tan) Are the Best Souvenirs From Maui  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Souvenir From Maui Isn’t a Tan But These Serene CeramicsAltar’s wide bowls and chubby mugs are totally worth the stress of unpacking and repacking your suitcase.By Elyse InamineAugust 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Most visitors to Maui bring back kitschy key chains, maybe a nice tan. Me? A very large canvas bag filled with beautiful vessels from ceramicist Karina Subijana of Altar Ceramics.I loved her pieces so much when I dined at the Mill House and Lineage, I DM’d her on Instagram to meet at her studio and buy some of her hand-thrown wares. Sure, bespoke ceramics are very now for restaurants to commission, but all of Subijana’s ceramics feel very Hawaii, from like the beachy-looking mug ($48) to the teal bowl with a drippy glaze ($52) to the sand-hued noodle bowl ($56). “I like to incorporate natural elements into my work,” Subijana told me. “Speckled whites, teals, and greens remind me of where the waves meet the sand.”Subijana first got into pottery a few years ago after giving birth to her son and in search of elusive “me” time. “Being a full-time mother of a new baby, I felt as though I was tending to everything and nothing,” she said. “With pottery, I was able to center and focus myself on one task and, after a few weeks, I was holding beautiful objects, tangible fruits of my labor, that I could use in my kitchen and home.”As I toured her studio, in Hana on the southeast side of Maui, I couldn’t help but touch all the wide, shallow bowls and chubby mugs. I loved their satisfying heft and sturdy roundness; they felt like worthy investment pieces but not so precious that I couldn’t also eat instant ramen out of them. My bags were already dangerously full, but I couldn’t resist taking home several of those aforementioned bowls. And while I endured some stressful unpacking and repacking in order to get them home, you won’t have to: Subijana just revamped her online shop.Buy it: Altar CeramicsAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendCeramicsShoppingRead MorecultureI Can Schlep Without Worry, Thanks to This Mesh ToteBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-05", "author": ["Condé Nast", "Elyse Inamine"]}