{"id": "70b4043dcb3c3bda04dea5480f12fb3b", "url": "https://www.bonappetit.com/story/georgia-peach-and-vidalia-onion-hot-sauce", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "This Georgia Peach and Vidalia Onion Hot Sauce Is My Go-to Desk Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEvery Desk Needs a Sauce, and This Is MineOne day, a mysterious hot sauce appeared in our office. Little did I know, I’d met my desk lunch’s perfect match.By Hilary CadiganMarch 2, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.It appeared on the office free table with no explanation. A bottle of sauce with a piece of red velveteen over the top, tied with gold elastic. “Georgia Peach & Vidalia Onion Hot Sauce” read the label, beside a storybook-esque illustration of a voluptuous red-headed lady sitting in a field of pink flowers. A blue ribbon denoted the years the sauce was deemed an “International Champion” and/or a “National Award Winner”: 1996, 1998, 1999, 2000, 2001. How could I not be intrigued?Upon further investigation (which is to say, posting a question on our office Slack channel), I learned that the bottle came from my colleague Alex Beggs, who had recently attended the 2019 Hot Sauce Expo. There, she saw a lot of braided beards and tasted 47 hot sauces in six hours. “I got that sauce from a man in a chicken hat,” she tells me, wheeling past my desk in her swivel chair. “It’s from Peppers.com.”If you haven’t yet graced the fiery wonderland that is Peppers.com, let me fill you in. The homepage is dominated by a striking piece of stock imagery featuring a chile pepper in flames. The enormous online marketplace sells salsas, Bloody Mary mixes, chicken wing sauces, barbecue sauces, and of course, hot sauces. It’s the digital baby of the aforementioned chicken-hatted guy, Chip Hearn, who followed in his father Luther’s entrepreneurial footsteps by opening a series of ice cream shops in and around Rehoboth Beach, Delaware, in the 1970s.There he is, Chip Hearn, at the Expo!\nPhoto by Amy LombardThere are thousands of sauces for sale, and apparently Chip has tried all of them, but only one is advertised on the website’s front page. And that is Georgia Peach & Vidalia Onion Hot Sauce, which Chip makes himself. “For all of you aficionados out there,” reads the product page, “this sauce is also available in a gallon-size bottle.”So back to my desk, where the bottle—a regular old 5-ouncer from Beggs’ expo swag bag—sat gathering dust beside my pencil cup and collection of unopened stress-reducing vitamins. There it remained until a couple weeks later, when someone delivered a batch full of burgers and French fries to our office without any ketchup. Lo! Not someone to suffer a naked French fry, I reached for the sauce. And that is when my office life, as I knew it, changed forever.You see, Georgia Peach & Vidalia Onion Hot Sauce is not your average hot sauce. It has dehydrated tomatoes in it which give ketchup vibes without taking over. Peaches, Vidalia onions, and cane sugar bring sweetness and a healthy dose of vinegar keeps things zesty. It has red chiles and green jalapeños and red cayenne peppers but not too much of any of them, so it’s never too hot to handle and you needn’t sprinkle it sparingly.Putting it on my fries proved a great success—like ketchup, but better. So as the Mondays turned into Tuesdays turned into Thursdays, I kept going. Turkey sandwich—yes. Cold pizza—most def. Leftover fried rice—a delight. I don’t eat scrambled eggs at my desk, but if I did, I am 99.9% certain that it would be a match made in heaven.Georgia Peach & Vidalia Onion Hot Sauce, you see, is the ideal balance of acid, salt, sugar, and heat. It pairs perfectly with just about anything you throw at it. And in the days of open-plan offices, where storage space is minimal but you can’t quite stomach the idea of a sad, dry desk lunch, it is a miracle. It is the go-on-everything desk sauce of my dreams. And I owe it all to a man in a chicken hat.Buy it: Georgia Peach & Vidalia Onion Hot Sauce, $5 at Peppers.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingHot SauceRead MoreLifestyleIn a House of Picky Eaters, These Jarred Sauces Are Always a WinBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-02", "author": ["Condé Nast", "Hilary Cadigan"]}