{"id": "70b74b433c014dd72738c2251637cba0", "url": "https://www.bonappetit.com/recipe/cbd-lemon-and-black-sesame-semifreddo", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "CBD Semifreddo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCBD Lemon and Black Sesame SemifreddoBy Andy Baraghani and Chris MoroccoApril 29, 2019EmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe developed this recipe using a 1,000 milligram (mg) bottle of Lily CBD. If your CBD is particularly strong, you may want to start with just ⅛ tsp. oil, give it a taste, and add more from there. This recipe is part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Click here to read more about how to make cannabis delicious.Ingredients8 servingsNonstick vegetable cooking spray3large egg whitesPinch of kosher salt⅔cup sugar, divided¾cup chilled heavy cream1lemon2Tbsp. black sesame seeds¼tsp. CBD oilExtra-virgin olive oil (for drizzling; optional)Flaky sea saltPreparationStep 1Coat a 9x5\" loaf pan with nonstick spray (a metal pan will conduct cold more efficiently than tempered glass). Line pan with plastic wrap, leaving a generous overhang on all sides.Step 2Using an electric mixer on high speed, beat egg whites and kosher salt in a medium bowl until frothy, about 1 minute. With the motor running, gradually add ⅓ cup sugar and beat until medium peaks form, about 5 minutes. With the mixer on medium-high speed, gradually add remaining ⅓ cup sugar and continue to beat until stiff, glossy peaks form, 6–8 minutes.Step 3Using clean beaters, whip cream in another medium bowl until soft peaks form. Fold one-third of whipped cream into egg whites. Finely zest lemon over egg white mixture, then squeeze in 2 Tbsp. fresh lemon juice. Add sesame seeds and CBD oil, then gently fold in remaining whipped cream until just combined.Step 4Transfer mixture to prepared pan and place a piece of parchment paper on top, pressing directly onto surface. Freeze until semifreddo is firm, about 6 hours.Step 5Remove parchment paper from surface of semifreddo and, using plastic overhang, gently lift from pan. Invert semifreddo onto a large platter, peel away plastic wrap, and slice 1\" thick. Divide among plates and let sit 5 minutes to soften slightly. Drizzle with olive oil (if using) and top with sea salt.Step 6Do Ahead: Semifreddo can be made 3 days ahead. Keep frozen.How would you rate CBD Lemon and Black Sesame Semifreddo ?Leave a ReviewTell us what you thinkExplore Bon AppétitFrozen DessertDessertLemonCitrusFruitCannabisHerbs & SpicesGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Andy Baraghani", "Chris Morocco"]}