{"id": "70bc07668dcf595d6a87bf4731e90754", "url": "https://www.bonappetit.com/story/keep-produce-fresh-longer", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Keeping Produce Fresh For Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscooking10 Tips For Keeping Produce Fresh Until Your Next Trip to the Grocery StoreBecause it's going to be a while.By Caroline LangeMarch 27, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailFilling the fridge for the long haul is a game of strategy, a balancing act of things to eat now and things to eat later, ideally with a range of flavors and textures for optimal versatility. This… can feel like a lot to consider, especially if you’re also trying to use everything in its prime.First, double-check which fruits and vegetables you should—and shouldn’t—be refrigerating, and make your grocery list with some attention to what will last the longest in there (the fridge, that is). Then read on for 10 tips for keeping your produce practically perfect (or, you know, good enough!):1. Store your produce DRY.A little humidity is a good thing for produce—but wet is bad news. Some moisture will keep produce perky; too much moisture can promote mold or mushiness. Make sure you thoroughly dry anything you’re washing before putting it away. There are a few exceptions to this rule: Scallions like to be stored upright, roots-down, in water at room temp—and they’ll keep growing that way forever as long as you freshen the water every now and then. Asparagus is more like a bouquet of fresh flowers: Trim the ends, set in a glass of water, and refrigerate until ready to use. Storing whole carrots in a covered container of water will keep them firm; same for halved stalks of celery. Change the water every two or three days.2. When in doubt, bag it.A plastic bag (reuse them, please, or just use the bag your produce came in) will help prevent the moisture in your veg from evaporating, which means the stuff that usually goes limp after a few days won’t. It works for hardy greens, too: Remove the thick stems, then tuck into a plastic bag or reusable lidded container.3. Swaddle your herbs.Storing herbs is its own meditation on being patient and gentle. Start by removing any twist-ties or rubber bands from your herb bunch. If your herbs are very dirty, wash them first (otherwise, consider washing as you use them so as to introduce as little extra moisture as possible). To dry, use a salad spinner or roll up between two layers of clean, dry dish towels. Gently bundle the now-dry herbs in a dry paper towel. Place the bundled herbs in a resealable plastic bag (you can put multiple bundles of herbs in the same bag) or a plastic container (like a plastic shoebox or even just a quart container).Ah, the ole' herb roll-up.\nPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Simon Andrews4. Isolate gassy produce. ;)Some fruits and vegetables—like apples, ripe bananas, pears, and potatoes—produce a gas called ethylene that accelerates the ripening process of other fruits and vegetables. For this reason, if you want to ripen something quickly, stash it with your store of apples. But if you’re trying to prolong lifespans, keep everybody as separate as you can. That means: Let bananas have their own spot, don’t store potatoes and onions together, and keep apples in a designated part of the fridge.5. Transfer ripe fruit to the fridge.Some fruit you want to keep out at room temperature so that it can ripen—avocados, pineapple, mango. But once it’s ripe, move it right over to the fridge, where you can essentially press pause on the ripening process. This is a short-term solution—everything will go bad eventually—but it’ll buy you 2 or 3 extra days with that perfectly ripe avo.6. Freeze!Want to really press pause? Toss your produce in the freezer! Let fruit reach the desired stage of ripeness, then peel and cut into pieces if necessary and freeze in a single layer on a parchment-lined sheet tray until solid. Break up the frozen pieces and store in a resealable plastic bag or freezer-safe container for up to 3 months. You’ll want to chop and blanch most vegetables before freezing (and remember, not everything freezes well).Leave 'em in your fridge, please!\n7. Keep citrus and ginger in the fridge.You know how every stock photo of a kitchen has a bowl of lemons out on the counter? Looks nice, that’s for sure, but those lemons aren’t gonna last. Citrus will be happy (firm, juicy, not shriveled) for ages longer if you keep it in the fridge. Same for ginger (and fresh turmeric root, if you’ve got it).8. The softer it is, the sooner you should use it.Make an action plan based on which produce has the shortest life. Prioritize lettuces, spinach, and other soft greens; cucumbers; peppers; cherry tomatoes; broccoli and cauliflower. Save your potatoes and sweet potatoes, cabbage, carrots, fennel, and even hardy greens like kale and collards for the last days before you head back to the grocery store. Related: If your produce has leafy tops (like beets or carrots), remove them from the vegetable and, if you want to eat them, store them separately.Salad at the start of the week, squash soup at the end.\nPhoto by Alex Lau9. Learn the coldest parts of your fridge.Generally, the top few inches of the fridge are prone to temperature swings (read: accidental freezing). Keep your most delicate produce (like herbs and lettuces) away from that top section and in the middle of the fridge to avoid frozen-then-thawed arugula (truly horrible).10. Give everybody some breathing room.If you’re only going to the grocery store once per week, it follows that your fridge is going to be pretty full. But try your best not to cram your crisper drawers. Produce, like you and I, enjoys a little personal space. That space allows the fridge to work more efficiently: With air circulating around the produce, moisture evaporates and public enemy number one, a.k.a. mold, is held at bay. You’ll also be able to better see and use what you have.Caroline Lange is a recipe tester and developer, private chef, and food stylist living in Brooklyn.Explore Bon AppétitCoronavirusStoringCommon MistakesBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-27", "author": ["Condé Nast", "Caroline Lange"]}