{"id": "70c5bcbb96f973d61a2418b421f68b9d", "url": "https://www.bonappetit.com/recipe/chicken-with-schmaltzy-rice-and-kale", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Chicken with Schmaltzy Rice and Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken with Schmaltzy Rice and KaleBy Fancy NancyApril 12, 20194.2(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThe scallion-ginger oil served alongside the chicken and rice puts this recipe from Fancy Nancy in Brooklyn over the top. If you aren’t feeling the rice, use another cooked grain (it can even be fridge-cold and left over) and just heat until warm and beginning to crisp. This recipe can also work with any large cut of skin-on, bone-in chicken, including spatchcocked and halves.Ingredients4 servings¾cup white jasmine or short-grain riceKosher salt4chicken legs (thigh and drumstick)2Tbsp. plus ¼ cup vegetable oil1bunch scallions (about 6), thinly sliced11\" piece ginger, peeled, finely chopped3garlic cloves, thinly sliced2bunches Tuscan kale, ribs and stems removed, leaves torn½cup low-sodium chicken broth or waterPreparationStep 1Place rice in a strainer or sieve and rinse, swishing around with your hands, until water from rice runs clear; drain well. Bring rice, a pinch of salt, and 1 cup water in a small saucepan to a simmer over medium-high. Cover pan, reduce heat to low, and cook rice until tender, about 20 minutes. Remove pan from heat. Let rice sit 10 minutes, then fluff with a fork.Step 2Preheat oven to 425°. Season chicken legs generously with salt. Heat 2 Tbsp. oil in a large cast-iron skillet over medium-high. Cook chicken, skin side down, until skin is golden brown and well on its way to being crispy (try weighing it down with another heavy skillet for maximum crispiness), 7–9 minutes. Transfer skillet to oven (leaving chicken legs skin side down and with weight on top if you’re using one) and roast chicken legs until deeply browned and very crispy, 8–10 minutes. Turn chicken skin side up (remove weight) and continue to roast until cooked through (an instant-read thermometer inserted into the thickest part of legs should register 165°), about 5 minutes longer. Transfer chicken to a wire rack, arranging skin side up. Reserve skillet (wrap a kitchen towel around the handle so you don’t forget it’s really hot and burn your hand).Step 3Bring scallions and remaining ¼ cup oil to an aggressive boil in a small saucepan over medium-high heat. Add ginger and immediately transfer scallion oil to a small bowl; season with salt. Let cool.Step 4Heat reserved skillet over medium. Cook garlic, stirring occasionally, until beginning to turn golden around the edges, about 2 minutes. Add kale a handful at a time, letting it wilt before adding more. Add broth and cook, scraping up any browned bits from bottom of skillet, until kale is softened, about 3 minutes. Add rice and cook, stirring often, until liquid evaporates and rice is warm and beginning to crisp, about 3 minutes. Season with salt.Step 5Transfer rice mixture to a platter and arrange chicken on top. Serve scallion oil alongside.How would you rate Chicken with Schmaltzy Rice and Kale?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleGreat recipe as is but even better (imho) with mushrooms added to the (brown/white) rice mixture.  We're on our 3rd time making it in 2 weeks!HomeChef SFSF, CA12/10/2021Made this and added carrots.  It was delicious and it took me 1:20min from start to finish.  Next time I will cook the scallions and ginger with the garlic, no need for extra oil.  I used chicken thighs and half the rice... it came out perfect!Katrina StoneLos Angeles, CA11/9/2021It was really delicious. I doubled the rice and used curly kale since I couldn't fine tuscan. For the scallion oil, I added a pinch of dried thai chili, so good. The chicken took longer to cook in the oven but that was because the chicken pieces were a little frosty (need to take out sooner).  I cooked them on convection for 10 minutes longer than the instructions and they came out perfect.  I think it could use a little acid, maybe a squeeze of lemon over the kale/rice or a splash of unseasoned rice vinegar. Overall, a great dish. Will definitely make again!KC TreanorChesapeake vA10/15/2021This is great! \"Whole 30 Anonymous\" needs to get a grip and sub lentils for the grain. If you are Whole 30 or Paleo you need to have a brain beyond what social media or the recipe specifies. Great recipes just get better if the cook is creative by thinking about what you like. This is a great one to keep.RockHouse205Fayetteville, Arkansas10/8/2020Why is a recipe with rice included in a Whole30 recipe roundoup? Rice is absolutely not compliant.Anonymous8/7/2020I like rice a lot and I use rice every day to make new recipes. I liked your recipe very much. Would you tell me which rice to use? I use Kashish Basmati rice right now. www.kashishfood.co.n­z\nkashishfoodAuckland7/1/2020I've made this recipe a couple times and think I am a little frustrated with it. The flavors, ingredients, and taste are great (which is why I keep coming back to this recipe) but I think the flow of the cooking process is clunky and the ginger scallion oil adds an unnecessarily oily element into what is already oily (see: \"schmaltzy\" in the title). I added ginger and scallions to the garlic frying step and followed the recommendation of one commenter to squeeze some lime when plating. It was nice to retain the ginger/scallion flavor profile, while also cutting out an extra step, and the lime at the end added an element of freshness that i appreciated! AnonymousSan Francisco5/29/2020This was pretty good, but lacking some acid. Needed just a little vinegar or lime in with either the chicken stock or in the ginger-scallion sauce. If we make it again, I might use the David Chang version of the ginger-scallion sauce which has a little more zip.celynch84/28/2020One of my favorites! Made this for the first time in February, and I've made it 4 times since. It works wonderfully with legs, thighs, or a whole bird. I like to add a little extra ginger for some spice.AnonymousColorado4/23/2020Great Recipe! easy to make, comes together so nicely, presentation is great. all in one pan. I recommend this and will be making it again. Also a nice meal to make for a crowd. I added a can of butter beans. It turned out to be a great idea. Would not change anything about this recipe. yummmm jessicaolBrooklyn, NY4/21/2020This was amazing !! I used boneless skinless thighs bc it’s what I had and I didn’t even miss the skin- the chicken got so crispy From cooking in the oil and the little bit of fat on the chicken. My only major change was I adopted the ginger scallion sauce that comes with the BA Bo Samm recipe since it’s the same sauce just kicked up a notch. I also had to use spinach because I didn’t have kale \nI used leftover rice from the night before  so With that shortcut everything came together in about 20-25 mins. So yummy ! Will definitely make again mcdemilia9275Miami FL3/17/2020Delicious!  Not too difficult.  Was a little wary of the scallion-ginger oil, but found it did add a little something.  Even without it, this recipe is highly recommended for its taste & ease.AnonymousCambridge 7/27/2019So good! I used bone-in thighs only, so as someone said below, cooking times in both the pan and oven were a little longer. Next time I make this I will add the chicken stock a small amount at a time. I think just adding 1/4 cup was too much at the end, so the rice didn't get crispy. I followed the steps exactly as is, making the scallion-ginger topping separate, and I thought it was great. I did use extra ginger to really make that a dense topping. mhdsileskyAustin, TX6/7/2019Made this last night with spinach instead of kale for my picky SO. It was a hit, will definitely be adding this one to the repertoire! A note to the scallion/ginger oil haters - let it boil for a couple minutes longer once it's bubbling and season aggressively with salt - Molly style :)RozPSydney, Australia5/31/2019Excellent. A hit with my whole family, including picky little kids. The chicken legs took about three times as long in the oven as the recipe suggests. MelissaberylSeattle 5/8/2019Explore Bon AppétitRiceRice & GrainsKaleLeafy GreensVegetableChicken LegChickenPoultryMainDairy-FreeGluten-FreeNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Fancy Nancy"]}