{"id": "70cbef3f2b67d73d03bae45f8341d620", "url": "https://www.bonappetit.com/story/eat-offbeat-gift-bundles", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "These Globally Inspired Snack Boxes From Eat Offbeat Let Me Travel Without, Well, Traveling | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Globally Inspired Snack Boxes Let Me Travel Without, Well, TravelingFind me in my apartment, snacking on Eat Offbeat’s Iraqi-style tahini-stuffed dates, Syrian sesame-pistachio cookies, and Senegalese candied peanuts.By Hilary CadiganApril 23, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Three things got me through this long and dreadful quarantine: my cats, forcing my friends to dance with me on Zoom, and getting stuff in the mail. Even though my doorbell makes a horrifically loud buzzing sound that makes my skin crawl every time it’s pressed, coming downstairs to find a mysterious package on my stoop that is actually for me and not my neighbor never fails to improve my day by at least 50 percent. (And make that 75 percent when said package contains something edible.)So imagine my joy when a heavy box marked “Eat Offbeat” arrived one cold and drizzly fake-spring day. I ripped it open like a significantly less patient version of Tom Hanks in Castaway to find a treasure chest full of snacks from all over the world: highly addictive Iraqi-style Medjool dates stuffed with tahini and crushed walnuts; a Venezuelan hot cocoa mix spiced with cinnamon and star anise; a savory Mediterranean za’atar blend for mixing with warm olive oil and spooning onto toasted pita bread. Even though I couldn’t, you know, actually go anywhere, the box felt like several years’ worth of travel coming straight to me.A company built on empowering resettled refugee chefs, Eat Offbeat has been catering and delivering meals locally in New York since 2013. Sister and brother cofounders Manal and Wissam Kahi started the company when a craving for grandma-level hummus (read: hummus as good as their Syrian grandma made it) led them to NYC’s refugee communities as a possible source for the flavors they sought. In the years since, the Kahis and their head chef Juan Suarez de Lezo have trained and hired more than 16 chefs from 11 different countries to contribute to Eat Offbeat’s delivery menu (carne mechada! Chicken fesenjan! Spinach momos!). Their snack bundles launched in March and are the first product to ship nationally, featuring some of the chefs’ shelf-stable greatest hits.Chef Mariama Sow from Senegal, known for her killer jollof, flexes her snack skills with bags of candied peanuts coated in cinnamon, vanilla, nutmeg, and cayenne. Chef Lebjulet Braganti of Venezuela, a trained engineer and math teacher with a passion for dessert, makes the hot cocoa mix and her famous berry jam, a sweet-tart blend of strawberries, blueberries, and blackberries. And chef Diaa Alhanoun from Syria, who runs a restaurant called Sakib in Williamsburg, shares his crispy Barazek cookies, stuffed with pistachio chips, crusted with roasted sesame seeds, and perfect for dunking into coffee. Some of the boxes also come with Eat Offbeat’s brand-new cookbook, The Kitchen Without Borders Cookbook, a collection of recipes from all over the world.Even though quarantine seems like it might...kind of...almost...maybe (???) be ending soon, Eat Offbeat boxes have become my new go-to gift for friends and family far away, especially the ones who are tough to buy for (like, for example, mothers—your own or that friend who supposedly had a baby 11 months ago you’ve still never seen). Because whether you’re trapped in your house or not, receiving a box full of snacks is never not cause for celebration.Buy it: Eat Offbeat Gift BundlesExplore Bon AppétitHealthyishHealthyish Loves ItShoppingHealthy SnacksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-23", "author": ["Condé Nast", "Hilary Cadigan"]}