{"id": "70d1c0e750908d7de36d442646d6c7b3", "url": "https://www.bonappetit.com/recipe/hot-tamales-with-jackfruit-and-cilantro-sauce", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Dirty South Hot Tamales With Jackfruit and Cilantro Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueDirty South Hot Tamales With Jackfruit and Cilantro SauceBy Bryant Terry August 10, 20213.3(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintChef-author-activist Bryant Terry created these plant-based tamales in honor of the tamales he grew up eating, sold by an independent Black food vendor known as the “Tamale Man” who parked outside a Memphis skating rink. In a nod to the Southern African American tradition of tamale-making, he uses grits, a hot tamale staple, in the dough instead of masa or cornmeal. He fills the tamales with jackfruit, a tropical fruit that mimics the texture of meat. Soaking the grits overnight cuts their cooking time by half.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonOXO Stainless Steel Good Grips Steamer with Extendable Handle$20 At AmazonMesh Sieve$13 At AmazonLarge Pot$55 At AmazonMedium Skillet$60 At AmazonIngredientsMakes about 15Filling220-oz. cans green jackfruit¼cup extra-virgin olive oil2celery stalks, finely chopped½medium green bell pepper, cut into ¼\" pieces½medium onion, cut into ¼\" pieces1garlic clove, finely chopped3Tbsp. tomato paste1Tbsp. Bragg Liquid Aminos1tsp. Creole Seasoning¼tsp. kosher salt, plus more1cup vegetable brothTamales15–20dried corn husks2cups yellow grits, soaked overnight5cups vegetable broth1tsp. Diamond Crystal or ½ tsp.Morton kosher salt½tsp. chili powder½tsp. smoked paprika⅛tsp. cayenne pepper2Tbsp. vegetable oil½tsp. baking powdersauce and Assembly2garlic cloves, finely chopped3Tbsp. extra-virgin olive oil¼tsp. ground coriander½jalapeño, cut into large pieces2Tbsp. fresh lemon juice1cup (tightly packed) cilantro leaves, plus sprigs for servingKosher saltQuick-Pickled Cauliflower (for serving)PreparationFillingStep 1Drain jackfruit in a colander and rinse well. Transfer to a kitchen towel, gather ends, and squeeze tightly to remove as much liquid as possible. Sort through jackfruit for pieces with a fibrous core; cut away and discard cores. Pull jackfruit into small pieces with 2 forks. Return to kitchen towel; squeeze again to remove any remaining liquid. Set aside.Step 2Heat oil in a large skillet over medium-low. Cook celery, bell pepper, and onion, stirring occasionally, until starting to soften, about 5 minutes. Stir in garlic, tomato paste, liquid aminos, Creole Seasoning, and ¼ tsp. salt. Cook, stirring constantly, until slightly darkened and fragrant, about 2 minutes. Stir in broth and reserved jackfruit. Simmer, stirring occasionally, until starting to thicken, 18–20 minutes. Taste filling and season with more salt if needed. Let cool.TamalesStep 3Place corn husks in a large bowl and pour in warm water to cover. Weigh down with a plate to keep husks submerged. Let soak while you cook the grits.Step 4Drain grits in a fine-mesh sieve. Bring broth to a boil in a medium saucepan; reduce heat to low. Whisk grits, salt, chili powder, paprika, and cayenne into broth. Simmer, whisking every few minutes to avoid clumping and scraping bottom of pan to prevent sticking, until liquid is absorbed and grits are tender, 15–20 minutes.Step 5Scrape grits into a medium bowl, stir in oil and baking powder, and chill until cool, about 30 minutes. (Cooled grits should have a spreadable consistency similar to fresh ricotta.)Step 6Spread out a husk on a work surface with the wide end farthest from you. Spread ½ cup grits on center of husk, leaving 2\" at sides, 3\" at bottom, and 1\" at top. Place ¼ cup filling in center of grits and form into a log down middle of tamale. Fold long sides of husk together, gently pressing grits to seal in filling, then fold over to one side. Fold narrow end under tamale and transfer tamale to a large plate. Repeat process with remaining filling and grits.Step 7Fit a stockpot with a metal steamer insert and pour in water to reach bottom of steamer basket. Bring water to a boil, then reduce heat to low. Place tamales upright in basket with open end facing up. Cover pot and steam tamales, checking every 20 minutes and adding more water if needed, 50 minutes.Step 8Remove a tamale from pot and let cool 3 minutes. Remove husk; grits should be somewhat firm and hold their shape. If tamale is not done, carefully refold and return to pot. Cook tamales 5 minutes more and check again. Repeat as needed until tamales are done. Remove pot from heat, uncover, and let tamales rest 10 minutes.Sauce and assemblyStep 9While the tamales are resting, cook garlic, oil, and coriander in a small skillet over medium heat until fragrant, about 1 minute. Let cool, then transfer to a blender and add jalapeño, lemon juice, 1 cup cilantro, and ¼ cup water. Blend until smooth; season with salt.Step 10Transfer tamales to a platter; open up. Drizzle with sauce; top with cilantro sprigs. Serve with pickled cauliflower.How would you rate Dirty South Hot Tamales With Jackfruit and Cilantro Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGrits?  They do not make tamales.  We make vegan masa  for the vegan subset of the family using maseca and olive oil and margarine whipped together for the fat, it works OK.   I love grits but the texture is not what I or anyone I know would expect in a tamale.  Maybe that's a regional thing.  Would make a good casserole though, I think.  With some corn in there, and pinto beans or black beans.RobinFLsouth of the south12/22/2021Pretty bland.  The grits were good before putting them in the tamale, but after steaming for 50 minutes - bland. Will not be making these againDarcyFolsom, CA8/13/2021Explore Bon AppétitSoul FoodAmericanSouthernMexicanLatin AmericanGritsRice & GrainsCilantroHerbs & SpicesEasyMainDairy-FreeGluten-FreeNut-FreeVeganVegetarianSteamLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Bryant Terry"]}