{"id": "70df3f391efc7ef3674d22bab70bfda1", "url": "https://www.bonappetit.com/story/bertha-gonzalez-nieves", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Bertha González Nieves on Beating the Boys Club to Become the First Female Master of Tequila | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBertha González Nieves on Beating the Boys Club to Become the First Female Master of TequilaShe runs on scrambled eggs and passion.By Ali FrancisFebruary 28, 2019FacebookTwitterEmailPhoto by Ball & Albanese LLCFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Bertha González Nieves, co-founder and CEO of Casa Dragones and the first female Maestra Tequilera.For most of my life, I’ve preferred to drink spirits only when diluted with, say, a lot of fresh lime juice, a dash of agave, and an extra salty glass. I’d never imagined sipping tequila (and certainly not *enjoying* it) until I met Bertha González Nieves. González Nieves is the CEO of Casa Dragones, a Mexican brand she co-founded with MTV-founder Bob Pittman in 2008. Their two high-end tequilas—Casa Dragones Joven, a perfectly clear master blend of silver and extra-aged tequila; and Casa Dragones Blanco, a crisp, young silver tequila—are produced from an agave varietal called Tequilana Weber, hand-harvested in the northwestern state of Jalisco.“I just fell in love with the transformation of this extraordinary plant into a juice that people adore,” González Nieves tells me, pouring us each a glass of Joven from behind the enviable bar in her New York headquarters. “It’s one of the most well-known things about Mexico and such an important part of our social fabric; we celebrate with tequila, we cry with tequila.”Maybe it was González Nieves’ genuine passion for the product—before starting her business, she spent 10 years working for tequila giant Grupo Cuervo—or maybe it was the $275 price-point. But after a swig of the Joven, I found myself saying things like: “It smells subtly of grapefruit,” and “Mmmm, I really do taste notes of smooth vanilla!” The Blanco ($75 a bottle) was less complex but more refreshing and herbaceous, like a green apple dusted with black pepper. Neither followed with any of the infamous back-of-the-throat sting you might associate with the tequila you drank in college.González Nieves’s mission is to showcase an increasingly sophisticated Mexico, so it makes sense that world-class restaurants like Rosetta and Pujol in Mexico City and Cosme and The Nomad in New York stock her spirits.We chatted with González Nieves about the ups and downs of entrepreneurship, the value of partnership, and her love of a good airport egg-scramble.Why did you decide to go out on your own after working at Jose Cuervo?I worked for the Beckmann family for 10 years. It’s an 11th generation family business, and an example of a truly extraordinary Mexican company. But I realized that it was never going to be my company. I come from a family of entrepreneurs, and I was getting the itch to build something.Have you always considered yourself entrepreneurial?Definitely! After leaving Cuervo, I invested in a [now defunct] magazine that was a hybrid of New York Magazine and TimeOut in Mexico City, which was incredible. After that, I co-produced a film in Mexico, called Matando Cabos, which was an official selection at the Sundance Film Festival in 2005. But I realized I was jumping into other people's projects and that I should do my own thing. And my passion is tequila.How did that little seed of desire develop into a business?[Laughs.] Well, I meet Bob Pittman—the founder of MTV and my business partner—at a party in Williamsburg, Brooklyn. Our conversation somehow led to, “Let’s start a tequila company together.” And I'm like, “Is this booze talk or is this for real?” We exchanged cards and the next day I get a message from his secretary saying, “Would you like to meet on this day at this time?”Would it have been possible for you to start this business without partnering, financially, with someone like Pittman?No way. I had a couple of pesos lying around here and there, but no more than that. But when an individual decides to invest in you, it's a whole other level to VC funding. Because when they sign a check for your company, they're signing a check from their personal savings. So it just changes the meaning of money forever. Like, I am the boss, but I am also cleaning our offices right now. It’s a rollercoaster for sure.What do you feel is the emotional return on having a co-founder?It’s like when you're in the gym, and you're in that tenth repetition, and you need to do the 11th and someone just literally holds the bar. They're not doing the work for you, but they're really helping you; they’re taking the weight off. I have this relationship with Bob—there are truly times that he believes in me more than I really do myself. Sometimes it’s hard to pick yourself up. No one talks about it, but it is tough.Can you explain what those founding years were like?I think that those first two years will forever be some of the best of my life. Because we were just trying to produce the best possible product. We didn't have to do anything else but focus on that, and it really set the foundation of our company around quality and excellence.Speaking of excellence, you are the first ever Maestra Tequilera (female master distiller of tequila). Can you explain what that means?A Maestra Tequilera (or Maestro Tequilero) is the person within a production house that is in charge of manufacturing the product and defining the unique formula. I became one after 12 years in the industry. Before I even applied to become certified, I called the [governing body] and asked them, “If I do this, will you take me seriously?” “Yes, sure,” they said. [Laughs.]Why are you the first woman to receive this recognition?It's definitely a male dominated industry. So, when I got my title, I told my mentors that I almost had to grow a mustache for them to accept me, and they were all laughing. But it's true. I mean, when I came into this industry that I loved so much, I looked around, and I was like, “Oh, there are no women here.”Throughout your journey building Casa Dragones, what has been the most challenging factor?The hardest thing is really persistence and endurance, and finding that passion within to drive you. When you’re building a business, your previous challenge is forgotten so quickly, because you're in front of a new one already. So, there's no time really to relish in the victories.Do you think this ability to thrive in an entrepreneurial environment is more dependent on endurance or passion?I think passion is like a magic potion for endurance. Everybody has the same level of endurance, but if you have the passion, then endurance will be multiplied by one hundred.Does naivety place a role in this formula at all?It’s a superpower. If I knew what I’d be encountering in the future, I don't think I could do it.From chilling in Bob Pittman’s office with a Blackberry on day one to now, how has the way you spend your time changed?The only thing that I know about my time is that there is never enough! The only constant is change and you have to deal with the cards you’re dealt on a constant basis. I mean, I was in Chicago yesterday, now I'm here, and on Monday I'm going to be in Atlanta. At the start, it was all about the product, and now I spend a lot of time working with my team to figure things out strategically.With all that travel, do you find time to stay active?Staying within your routine of a daily life when you're traveling is practically impossible. One of my personal goals is to try and fit more exercise in while I’m away. It just makes me a better person. But in general, I’m into adrenaline. I like Soul Cycle and stuff like that.What about food? How do you eat well on the go?I try to have raw almonds always, in case I'm really hungry. And, in airports, which are full of junk food, you can always get scrambled eggs. I love scrambled eggs with turkey and tomato or whatever. Even if it's 3 p.m., I'll have eggs, and it'll be better than anything else I'm going to eat in there.Explore Bon AppétitEntrepreneurs Run the WorldHealthyishTequilaMexicanAlcohol & Other DrinksInterviewsRead MoreLifestyleHow Alison Cayne Handles a Cooking School, a Café, a Sauce Business, and Five KidsBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-28", "author": ["Condé Nast", "Ali Francis"]}