{"id": "70ee6f3b827f7820a3f97893e1334589", "url": "https://www.bonappetit.com/story/beach-lounge-chair", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "This Beach Lounge Chair Is the Only Chair I Need This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Is the Only Folding Chair I Want at the Beach This SummerAnd also for picnicking, and camping, and ...By Amiel StanekJune 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I was having a really hard time writing this story. Which is silly, because the whole thing should have been pretty straightforward. All I wanted to do is tell the world about The Kermit Chair, the handsomest, sturdiest, and most kick-back-and-relax comfortable folding chair I’ve ever had the pleasure of landing my tush upon. Grunting out 300 or so words about a product I have strong opinions about? Easy! That’s. What. I. DO.And yet, for whatever reason, I couldn’t make it happen. I knew what I wanted to say of course. That The Kermit Chair—a cult-classic named not for the muppet, but for the BMW motorcycle enthusiast who designed it in the mid-80s to be the ultimate pack-along camping seat—was impossibly classique looking, all Tennessean White Oak, stainless steel, and richly dyed weatherproof nylon. That it was ergonomically superior to any other folding chair I had sat in before, low enough to the ground to keep me in a supremely comfortable squat, pitched back ever so slightly, with a curved stave of wood offering back support just where I needed it most.I knew I wanted to say something about how, while most folding chairs were too damn upright and made me feel like a soccer dad ready to leap up and choke a volunteer referee, or waaaaay too reclined in that scary Crap, I literally can’t get up kind of way, The Kermit Chair put me exactly where I wanted to be: laid back just enough (both physically and spiritually) as to be relaxed without feeling beached. And I was for sure going to say something about the fact that, through some feat of design, it folds up into the tidiest little burrito of a package, eminently discreet and portable.But I just couldn’t make it happen. Sitting in my slick, over-designed, graphite and mesh desk chair high up in a corporate skyscraper, I just couldn’t get the words to flow. So I went down to the photo studio where they had just finished shooting The Kermit Chair for this story, carried it to a quiet corner of the office, and settled right down into it. I opened my laptop, cracked my knuckles, and got ready to write.And then I promptly fell asleep.Buy It: The Kermit Chair, $189 from kermitchair.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-06", "author": ["Condé Nast", "Amiel Stanek"]}