{"id": "70eea73a24ef653266d344e7a57809c9", "url": "https://www.bonappetit.com/story/the-water-stop-rotisserie-chicken", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "The Rotisserie Chicken at The Water Stop Is The Second Best Reason to Go to Marfa | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Second Best Reason to Go to Marfa Is This Rotisserie ChickenFirst: Chinati Foundation. Next: The Water Stop.By Julia KramerApril 24, 2019FacebookTwitterEmailImage Courtesy of Rowdy DuganFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The first thing you need to know about Marfa, Texas, is that you do not go there for the food. You go to Marfa to tour Donald Judd’s Chinati Foundation. To sleep in a yurt at El Cosmico. To look at the stars. To get away from it all.It is, and I mean this as a compliment, a vacation from food.My first time there, almost a decade ago now, I hit all the spots, which consisted of Food Shark (the food truck), Cochineal (the fine-dining spot), Marfa Burrito (the burrito place), and Dairy Queen (for every meal that neither Food Shark nor Cochineal nor Marfa Burrito was open, which was quite a few). A lot has changed between then and my most recent visit this past winter. There are new hotels, and with them new restaurants, like LaVenture in The Hotel Saint George and the overperforming Capri at the Thunderbird. You can have all the things you have in New York: a cortado at Do Your Thing, pasta at Stellina, bagels with smoked salmon at Aster, shockingly good brisket at Convenience West.And once you’re done trying these spots, you can just decide to eat the rest of your meals, as I did, at The Water Stop, an unassuming roadside restaurant that serves some of the best rotisserie chicken I have ever encountered on this planet. Like pretty much everything in Marfa, it makes you go, How?! And Why?! So I called up the chef, Rebecca Bockelie, and asked her precisely that.After working the line in kitchens in L.A. and gigging as a private chef in New York, Bockelie was traveling back from a trip to Cuba and somehow ended up in Marfa, where she took a job as a sous chef at LaVenture. “I was only going to stay temporarily, but then I fell in love with the town,” she says over the phone. And also in love with a rotisserie, which her friend Joey Benton had bought from someone who’d bought it from a street vendor in Greece in the 1970s. In December 2017, she opened her own spot, The Water Stop. “The whole restaurant is based around that one machine,” Bockelie explains. Whole organic chickens are brined overnight in honey, sea salt, and sugar, then cooked over mesquite and pecan wood in the rotisserie, yielding exceptionally juicy meat and burnished, crackly skin.If all the Water Stop made were chicken, that would be enough. But instead, the menu is rounded out with epic biscuits, custardy quiche, and the kind of chewy, toffee-y chocolate-chip cookies every pan-banger dreams of.When I asked Bockelie if I was forgetting any of the restaurant’s other signatures, she started describing the green-chili cheeseburger, served on squishy housemade buns alongside hand-cut fries. Perhaps it is time to go back to Marfa for the food.Go there: The Water StopExplore Bon AppétitHighly RecommendRestaurantsTexasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-24", "author": ["Condé Nast", "Julia Kramer"]}