{"id": "70f007e69c7878b077d5de4cad46d182", "url": "https://www.bonappetit.com/story/ginos-detroit", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Breadsticks from a Different Time at Gino's in Michigan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsBreadsticks from a Different TimeThe Detroit suburbs have gone through a massive demographic change in the past 60 years. Gino’s has been around during all of it.By Tracie McMillanApril 16, 2019FacebookTwitterEmailPhoto by Emily BergerFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Like a lot of things that pass for mainstream, “red sauce” was a term I learned as an adult in New York. I grew up in a rural town 60 miles north of Detroit; we didn’t eat out often. And when we did, my parents didn’t want to pay for food they could make cheaply at home, like spaghetti. Add that to my dad’s aversion to tablecloths, wine sold by the bottle, or anything besides classic rock on the stereo, and well, movie-set-authentic Italian was out of the question. The closest we got was Gino’s.Like the other Italian restaurants I grew up with, Gino’s put red sauce to its best use: as a condiment for breadsticks. An underappreciated regional treasure, Michigan breadsticks split the difference between the slender crackle of grissini and the starch pucks known as garlic knots. The Platonic ideal is about an inch and a half in diameter and the length of a side plate. It’s best when the exterior stays soft enough to absorb a slick of sweet butter and garlic salt, and the interior holds a chewy density akin to fresh sourdough. They are impossible to eat in tiny bites, and my family is known to fall into silence, chewing, when the first bottomless basket, usually with a half-dozen inside, arrives.The same floral vinyl booths that have been there for decades.\nPhoto by Emily BergerWe found Gino’s through my mother’s parents, a Ford worker and a housewife of German and Scotch extraction. They’d moved anxiously from Pontiac, a small city north of Detroit, to the white suburb of Orchard Lake in 1962. The Santia family, second-generation Italians, opened Gino’s nine years later in nearby Keego Harbor, serving pizza, breadsticks, and Italian-American comfort food to the working and middle classes who’d been flowing to the suburbs from Detroit. A tiny sliver, about 2 percent, were new immigrants, and about a third had grown up in another state. But wherever they came from, nearly everyone—99.5 percent, according to the 1970 Census—was white, just like my family.As an adult, I’ve remembered Gino’s as a fancy place, mostly because we had to dress up for the birthdays and Mother’s Days we celebrated there. When I told this to Irene Santia, who opened the restaurant with her husband, she laughed. “We never were fancy,” she says. They sidelined Italian standards like linguine with clam sauce or puttanesca sauce, she says, because Americans were skeptical of them. “It was really complicated to introduce the lasagna,” she says; mild-flavored, bread-based fare was an easier sell. Their steadiest clientele were neighborhood people, and that meant white factory workers, like my grandfather, who had just enough money for a treat—but not enough for extravagance.As a kid I didn’t grasp the difference. Family lore holds that, as a toddler, I stood up in a booth, surveyed the decor, and, wide-eyed, gasped: It’s so beautiful. But it’s just a regular family place, with booths upholstered in floral vinyl and smoke-tinted glass fixtures hanging from the ceiling. The ceiling is acoustic tile; the tables and chairs are heavy wood; the carpet short, dark, and sensible. I doubt it has changed much since it opened its doors almost 60 years ago.By the time my grandma moved into a seniors apartment in the early 2010s, everything but Gino’s had changed quite a bit. The economy and Detroit had collapsed. Middle-class homes went without maintenance, while mansions lined the lakefronts. My grandma, who never fully let go of the racism she was raised with, took particular issue with the fact that white people were no longer the default residents. We rarely discussed this openly, but she acknowledged it with regular asides about things changing. Sometimes—and, since I loved my grandma, I’m not entirely proud of this—I took the bait.She’d make some barbed comment; I’d bristle—and find myself asking passive-aggressive questions.“What do you mean, Grandma?”“Oh, it’s not like it used to be.”“Well, there are more black people,” I’d say. “Is that what you mean?”She’d fix me with a long, tired stare and say, “I grew up in a different time.”I’m not sure if we ever had one of these exchanges at Gino’s. If we had, I like to think I would have responded by taking a big, pointless bite of breadstick. It is wonderful when food brings you together with your loved ones, but I’ve also come to appreciate its ability to keep me from saying something I’ll regret.Everything about suburban Detroit has changed. Gino's has not.\nPhoto by Emily BergerI live hundreds of miles from Gino’s now, so the quieting power of its breadsticks—along with the solid antipasto and salads, and a pizza that impresses—is a rarity in my life. On my last visit home, my sister Shana and I had Saturday lunch there and ordered the same meal I’ve had on every visit: breadsticks, salad, and pizza. We chatted over the salad, which arrived first, talking about the challenges of managing our adult lives while worrying about our aging parents. We tried distracting ourselves with hypothetical plans of bringing my sister’s two daughters, in preschool and kindergarten, to eat at Gino’s. When the basket of breadsticks arrived, I was grateful for the quiet pause. We ate so much bread that we barely touched the pizza and had to have it wrapped up.And then, though we had plenty of food to take with us, we ordered two bags of breadsticks to go. There were difficult family conversations in the days ahead, and the breadsticks could do double duty. Bringing home delicious food might foster goodwill. And we’d have an excuse to go silent if it didn’t.On the way out, my sister directed my attention to a frame on the wall. It held a photograph of President Reagan and the first lady and a 1985 letter from the president congratulating Irene’s parents on 50 years in America. “Together, in common purpose and faith,” the president told the immigrants, “we shall keep America as the last, best hope on God’s earth.” I thought about what my grandmother would have said about this letter, and then about how I might explain it to a five-year-old niece, and realized the same sentence could work for both: I grew up in a different time.A working-class transplant to New York from rural Michigan, Tracie McMillan has been covering America’s multiracial working class since the late 1990s. In 2012 she published the award-winning New York Times bestseller, The American Way of Eating: Undercover at Walmart, Applebee’s, Farm Fields and the Dinner Table.Explore Bon AppétitRestaurantsItalian AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Tracie Mcmillan"]}