{"id": "70f5353ff47bba528eb29dc797e08c58", "url": "https://www.bonappetit.com/story/chlorophyll-face-mask", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "This Purifying Chlorophyll Face Mask Is Natural Enough to Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Purifying Chlorophyll Face Mask Is Natural Enough to DrinkIt's literally green juice for your face.By Aliza AbarbanelSeptember 21, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailUntil recently, the idea of relying solely on natural skincare made me anxious.  I’ve spent over a decade searching for my perfect skincare routine, which usually meant resorting on an arsenal of prescription-strength chemicals to get the job done. Still, I’ve been noticing natural beauty brands popping up on social media and /r/SkincareAddiction (my two main skincare resources) for a while. Also right here on Healthyish! Amid all the beautifully packaged products out there, Cocokind’s organic chlorophyll mask caught my eye. Probably because of the Shrek-green color. But it wasn't until I saw a video of Cocokind founder Priscilla Tsai literally drinking their chlorophyll mask to cure a headache that I knew I had to try it for myself.Tsai uses this mask as a health tonic because it's made up of just a few natural ingredients; spirulina powder, wheatgrass powder, chlorella powder, and ylang ylang oil (which is safe to consume in small doses). The mixture is also gentle enough to be used on your skin daily.  This is probably the time where I should mention this herbaceous blend has led some online reviewers to be critical of the mask’s “earthy” smell. Honestly, I just think it smells like I'm massaging kale, which I don't mind. In fact, the sorta-familiar odor made me feel a little more confident in the mask’s purported nourishing powers.Just like those green “superfood” powders I put in my smoothie, this mask comes in powdered form. The packaging includes an adorably tiny spatula, along with instructions to mix one little scoop with water to create a paste. The first time I attempted this, I covered my entire sink in green goo. Now I know to apply a tiny pool of water to my palm before adding the powder, which helps it adhere to my skin instead of flying across the bathroom when I turn on the sink. Then I mix, thoroughly cover my face and wait for the mask to harden. It usually takes about ten minutes, which I’ve found is a good time to contemplate tomorrow’s outfit or halfheartedly rearrange the medicine cabinet.I found this mask makes my skin look like how drinking a smoothie makes me feel: nourished and refreshed. I knew to manage my expectations with a product whose ingredient list is so minimal, and it's true that the results weren't jaw-dropping. But when I touched my skin after rinsing, I was shocked at how smooth it felt. Some redness along my jawline noticeably faded, plus the purifying green powders proved gentle enough to work without stripping any moisture—or messing with any other ingredients in my admittedly complicated routine.A cool thing about mix-it-yourself masks is that they’re designed to be messed with. On Cocokind’s Instagram, Tsai demonstrates mixing the chlorophyll face mask with avocado for extra moisturizing power or yogurt for a probiotic boost. I went with the latter, because I’m saving my avocados for lunch, and found the yogurt quite soothing. I've been using this mask weekly for over a month now, and my skin is calmer, brighter, and generally good.  Once I'm outside my dark apartment bathroom and in decent lighting, I can even detect a glow—the ultimate gold standard for skincare in 2018.So if you need me, I’ll be gazing into mirrors at all-day cafes, airy cactus stores, and other well-lit places until the sun begins to set at 4 p.m. again.Buy it: Cocokind Organic Chlorophyll Mask, $16.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitNatural BeautyShoppingHealthyishRead MoreLifestyleAn All-Natural At-Home Face Mask Recipe That's Designed to Be Messed WithBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-21", "author": ["Condé Nast", "Aliza Abarbanel"]}