{"id": "70f9b30b79f2c97bd54a395f2f14bcab", "url": "https://www.bonappetit.com/story/coming-out-meat-eater", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "I Grew Up Vegetarian. Now I'm Scared to Come Out to My Mom...As a Meat Eater | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI’m Scared to Come Out to My Mom...As a Meat EaterI was raised a strict vegetarian, but I've been dabbling in deli meats for a decade now.By T. WiseDecember 18, 2018FacebookTwitterEmailIllustration by Cynthia KittlerFacebookTwitterEmailI am afraid to come out to my mother, even though I have done it twice. In ninth grade, I told her with confidence, “I’m gay.” Two years ago, I told her with a heavy kind of joy, “I’m trans.” Now I have to tell my sweet mother, who raised me as a strict vegetarian, “I eat meat. Please forgive me.” And this time I’m scared.My mother and father both became vegetarians at a young age because they believed that animals shouldn’t be bred and killed to feed us. My sisters and I were vegetarians from the womb. My mother, whom I call Ima, taught my sisters and me that the mistreatment of animals is just one organ in a sick body of violence, racism, and consumerism. She told us that, as people with privilege, it’s our job to fight against that structure, to work in service of something bigger than ourselves. We weren’t allowed to eat meat or even food that had been on the same plate as meat. We didn’t wear leather. We didn’t eat s’mores unless they were made with kosher marshmallows sans horse hoof.This way of life was explained, but it wasn’t negotiated, similar to how we were raised as practicing Jews. We grew up rooted in these identities, the message being that we were Jews and vegetarians always, not just when we felt like it. Hypothetically, If I told my father that I converted to Catholicism and took communion each Sunday, he would be devastated. When I tell my mother that I am no longer a vegetarian, that I take a turkey sandwich from the bodega each Sunday, I think it will break her heart.I wanted to be present and open, drinking Havana Club and eating salty\nmeat while looking at the ocean sitting glossy under purple sky.It began with chicken quesadillas at my restaurant job when I was 19 and hungry. I admit with shame that I then expanded to chicken sandwiches from McDonald’s and the occasional chicken parm from the pizza spot. Let’s take into account that I was also drinking Svedka, doing ecstasy, and falling in love with straight girls, so all this questionable poultry fit with my general self-destructive nature at the time.Besides the birds, my forays into flesh have been few. Once I ate goat for fear of offending the hospitality of my friend at her traditional Ethiopian meal. My body’s counterattack to this invasion was swift and sad for me. The next time I ate red meat was in a small circle of trees on a mostly empty beach outside Havana. I accepted a hunk of pork roasted in a pit dug out of the sand with a rusty machete. I ate it with a wedge of tomato, followed by a slice of orange. It was lovely. I spent my last day in Cuba with a fever and left most of my insides behind.My GI system has always been, let’s say, expressive, so I don’t know if my pork party was solely to blame. It had crossed my mind as I was struggling to chew the chunk that maybe my meat boat had sailed, that in both mind and body I am unequipped to casually convert to omnivorism. But in that moment I wanted to be part of the world. I wanted to thank those who had invited me into their lives. I wanted to be present and open, drinking Havana Club and eating salty meat while looking at the ocean sitting glossy under purple sky. If it is possible to know more, to feel more, and to taste more in this life, I want in. Pursuing these things is a part of my faith just like my belief in the oneness of all creation. Actually, they seem the same.But honestly, most of the time my relationship to meat is more functional. I’m on a mission to build muscle on a limited budget, so I buy sliced turkey for my sandwiches and chicken thighs for my stews. Whenever I am with Ima, whether she visits me or I go to my parents’ house, I eat strictly vegetarian, so she has no reason to question my habits.Until I slipped up. A couple of months ago, Ima read a draft of an essay in which I casually mentioned eating turkey sandwiches. She called to ask if I was just “being creative.” And I lied. I said yes, as if my turkey sandwich was my lover, but I told her he was just a distant friend.Me avoiding telling Ima the truth is clearly more about my feelings than about her ability to handle it. Of Ima’s three children, not one real vegetarian remains. My oldest sister, a chef and food justice activist, called me the other day while eating snails, so she is clearly a lost cause. And my other sister won’t touch steak but loves her some ceviche. Our mother is well aware of their treasons and does not hesitate to talk about how sad it makes her, but she has not disowned them yet.So why am I so afraid to tell Ima that I eat meat? She understands context. She knows that some people do not have the privilege of choosing what food to eat, that food doesn’t get to be a statement or a story or an adventure for everyone. And for some, meat is an important part of culture and tradition in ways that she can’t judge. But, to Ima, our family is not in those categories. Vegetarianism is our tradition and, like our Jewish faith, its survival depends on continuity.I know Ima will still love me as a meat-eater. I am still afraid of hurting her.There might not be a stranger relationship than that between an adult and their parents. We are squirrels, and our parents are squirrels, and we are spiraling up the trunk of time, never matching each other in age or perspective. How can they ever fully respect me as my own grown person if our relationship began with them wiping my butt while I was toothless? I see parents and their children fall distant because of who they vote for, how they make a living, who they marry, how they worship, or just the way they see the world.Even at 30, I want to make my mother proud, maybe even more than I did before. I know that in Ima’s mind, I am part of what she’s contributed to the world. She taught me to be kind, to respect life and protect it, to defend the rights of all human beings, to take care of the earth, and to value love above all else. That’s a lot of love and a lot of weight. I think I can eat meat and continue to live by those values. I try to be good and faithful to my partners, I work as an educator, I look people in the eye, and I make art that humanizes trans people, confronts white supremacy, and allows for vulnerability. Ima taught me all that.I still get sad thinking about any animal being scared and then slaughtered. I still struggle to see how my decisions, my actions or my failures make a difference when I am just one of billions. I still know that my choices matter. I still love fake bacon. I know Ima will still love me as a meat-eater. I am still afraid of hurting her.When I told Ima I was going to gender transition, she told me her one fear was that we would lose some part of our intimacy, that this would create distance between us. I told her nothing could ever compromise our closeness, especially not me finding peace with myself. During that time I realized that for all we have shared, including her uterus, my mother and I are deeply connected, but we are not the same. I believe that we can tell different stories in the same language and walk in the same direction on different paths.I’m calling Ima now. I’m telling her that I am not a vegetarian anymore and she didn’t do anything wrong to make me this way. I’m admitting that I have dabbled in the deli and messed around with a meatball. I’m asking her to still love me. I think she will tell me I am silly and that nothing could compromise our closeness, not even a cold cut. I’m hoping that I am right.Explore Bon AppétitHealthyishVegetarianessayRead MorecultureHow the Midwest Shaped My Vegetarian DietBy Shelly WesterhausenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "T. Wise"]}