{"id": "70ffebc5d5337b371aa4fc190a4399c0", "url": "https://www.bonappetit.com/story/thanksgiving-hotline", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "Your Most Frequently Asked Thanksgiving Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour Most Frequently Asked Thanksgiving Questions, AnsweredThe BA Test Kitchen quells all of your holiday anxieties.By The Bon Appétit Test KitchenNovember 25, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailLast week, we resumed our annual tradition of opening up our Instagram DMs to field your most pressing Thanksgiving-related questions—and had the BA Test Kitchen answer all of them. Think of it like the Butterball Turkey Talk-Line, but on the other end of the phone you’ve got Carla Lalli Music, Claire Saffitz, and Brad Leone. Here, we compiled just a few of the most helpful (or just plain interesting) questions and answers that came across our Hotline for everyone to use. We like to think of it as our unofficial Thanksgiving 2019 FAQ page. If you’d rather watch the Test Kitchen answer them, head to our Instagram Story Highlights, saved under “DM Hotline.”We’re here to help.\nPhoto by Laura MurrayCan you parbake your stuffing the day before to cut down on cooking time on Thanksgiving day?“You can cook your stuffing up to three days before, but make sure it’s wrapped tightly in foil and kept in the fridge before you parbake it. On Thanksgiving day, let it come to room temp and right before you’re ready to serve it, blast it in the oven at 425 for 15 minutes.” —Rick MartinezFor dry brining a turkey, do you wipe off the salt/sugar mixture before putting in the oven?“Generally speaking, you should wipe off the brine off with a dry paper towel, unless the recipe says to keep it on.” —Carla Lalli MusicHow can I keep a pie from getting soggy during the day?“For pumpkin, pecan, apple, and other fruit pies: After you’ve baked them, you can let them hang out at room temperature. Just pop them in the oven at 375 degrees Fahrenheit for 5 minutes before you’re ready to serve. For custard pies (like lemon, banana, or chocolate): Don’t fill the pie crust until you’re ready to serve. Refresh the crust the same way (above), and then pour in the set custard once you’re ready to serve.” —Sohla El-WayllyI’m supposed to bring wine for Thanksgiving. Any recommendations for a large, but picky crowd?“Go for a high-acid rose (look for bottles from Austria or Eastern Europe) and a low-tannin red (something like a Poulsard or a Burgundy Pinot Noir). Don’t go for just one—diversify! And after dinner, Barolo Chinato is the answer. It’s the digestivo that’ll satisfy everyone at the table.” —Alex DelanyI could use some words of encouragement as I attempt to bake my first-ever pie from scratch. Any tips would be helpful!“Consider the temperature of the ingredients! Keep your hands cold, keep the bowl cold, and most importantly, make sure you always keep the butter cold. That will get you the flakiest pie dough. Also: Bake your pie on a baking sheet, just in case it drips or leaks.” —Sarah JampelWhat are your tips for grocery shopping on thanksgiving?“Write down all of your ingredients. Cross-check with what you already have at home. And when you get to the grocery store, stick to the list. Don’t buy more than what you need; your fridge is already going to be crammed.” —Gaby MelianYou’re better than a mediocre pie.\nPhoto by Laura MurrayIs cranberry sauce really worth making?“Absolutely. If there’s ONE thing that you should make yourself on Thanksgiving, it should be cranberry sauce. Three ingredients. Go. You can make it ahead of time and leave it in the fridge, and it’ll bring tartness to all of the fatty-rich foods on the table.” —Chris MoroccoMy brother broke his jaw recently and can’t chew much, but loves apple pie. How can I make my apple pie mushier for him so he can enjoy it, without ruining it for everyone else? Smaller slices? Cook it longer?“This is a great time to blitz a slice of pie with some ice cream and top it with whipped cream. Apple pie milkshake! Take it as far as you need for him to be able to eat it, but if you can keep some texture, do. And then watch as everyone else at the table heads to the blender.” —Priya KrishnaWhat is the best time to eat on thanksgiving?“Thanksgiving is the only time you’re allowed to start dinner at 4 p.m. But if you show up at my house before 12 p.m., I will not let you in.” —Christina ChaeyExplore Bon AppétitThanksgivingPieStuffingMake AheadMashed PotatoesTurkeyCranberry SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-25", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}