{"id": "7102cc3af2d742a911e9d65e136cff6f", "url": "https://www.bonappetit.com/story/deviant-paris-restaurant-well-crafted", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Well-Crafted Kitchen: Inside the Raucous New Paris Restaurant, Déviant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Well-Crafted Kitchen: Inside the Raucous New Paris Restaurant, DéviantParisian kitchens are notoriously small. Déviant designed theirs like a tightly run ship.By Christine MuhlkeJune 4, 2018FacebookTwitterEmailPhoto by Xavier Girard LachaîneFacebookTwitterEmailWhen the grate is rolled up at Déviant, the restaurant is ready. It has to be: There are no windows or walls enclosing it. There aren’t any tables or chairs, either, just a small open kitchen surrounded by a bar and a shallow ledge on either wall. With its terrazzo, mirrors, marble, and lightsaber sconces, it looks like the coolest hot dog stand on earth—if hot dog stands served pét-nat and bone marrow with hazelnuts.The second restaurant of 24-year-old Vivant chef Pierre Touitou (BA featured him when he was still in culinary school!) and his partner, Arnaud Lacombe, Déviant is right up the block. For Touitou, the concept for the plein air space in the 10th arrondissemen comes from France’s traditional butchers, fishmongers, and charcutiers: “If the owner is standing outside, you know it’s open. When the door is open, it’s open.”They selected a black-based terrazzo for the floors and bar to mimic the concrete outside for a continuous look. Food-wise, they wanted the constantly changing menu of small plates served at Déviant to be the opposite of Vivant. Since Touitou has no kitchen in the 450-square-foot Vivant, he and his sous-chef cook behind the bar using two induction burners and an oven that’s been broken for the past few weeks. And since Déviant diners and drinkers have little room in which to maneuver on the thick marble countertops, he wanted to ensure that the food can be eaten with fingers or a fork, spoon, or thick piece of bread.Photo by Xavier Girard LachaînePhoto by Xavier Girard LachaîneThat doesn’t mean the food is simple. The tamarind-galangal sauce on those spicy chicken wings? It simmered for 10 hours. There are no charcuterie or cheese plates here to soak up the natural wine and beer. Instead, you might share a small bowl of mussels in a celery-peppercorn broth or seared foie gras with spinach and buckwheat. Dessert could be three just-right canelés with whipped cream.Since he was 18, Touitou has worked in kitchens of Alain Ducasse at the Plaza Athénée, Tatiana Levha at Le Servan, as well as at Pierre Gagnaire’s Sketch in London. Nathan Allard and Aldwin Beets, the cooks running the how at Déviant, have worked at starred restaurants like Le Meurice and Senderens, as well as Le Dauphin, the seminal wine bar of Iñaki Aizpitarte of Le Chateaubriand, the rebellious genius who has inspired Pierre’s generation. (Le Dauphin’s groundbreaking mirrored and marble interior by Rem Koolhaas and Clemént Blanchet can also be seen as a jumping-off point for Déviant’s design.)Photo by Xavier Girard LachaînePhoto by Xavier Girard LachaîneWith Déviant, what you see from the street is what you get. Hence the desire to make it all look bigger. “We went with mirrors so you don’t really realize that the actual space you have for the guests is ridiculously small compared to the size behind the counters, or when you take out toilet or the fridge and dishwasher in the back,” Touitou said. “We were joking about being just like Vivant, where you can see every single part of the restaurant from the counter. But with the mirrors at Déviant, you can see the girl winking at you on the other side.” The effect is very cool fun house, as those looking at the menus written on either mirrored wall can check out those doing the same on the opposite side.Photo by Xavier Girard LachaîneParisian kitchens are notoriously small. Look in the courtyard off of the kitchens of revered restaurants like Astrance and L’Ami Jean and you’ll most likely find crates of produce or a cooling pot of stock. Still, it’s fun to watch the clown-car antics of the two chefs as they prepare the menu’s 15-plus dishes to order on a single cooking unit equipped with a griddle and two induction burners. (A fryer is propped on top of a burner that remains off during service.) In addition to sharing a stove, they share that exposed square of space behind the counter with the manager and server. So their movements have to be tightly contained and more in sync than a Kardashian beauty launch.Photo by Xavier Girard LachaîneThe Vivant team worked with Mathieu Repetto, a young kitchen designer, or cuisiniste (yes, that’s a thing in France), who is a friend and regular. Repetto took every dish—its ingredients, its cooking technique, its sauces and garnishes—into consideration when Jenga-ing the German Palux stovetop and the eight refrigerated drawers below it. The top line of drawers is for things that go into the oven above, followed by those destined for the induction burners and fryer; then the plancha, a few condiments, and things that need to be warmed. Items that are cut to order, like salads and herbs, are stored closest to the pass.Photo by Xavier Girard LachaîneRepetto also made use of the space above the bar, building lots of exposed shelves to store everything from the well-designed wooden boxes that once contained the haddock arrives in to rolls of paper towels and bottles of sriracha and ketchup for staff meal. Everything needs to be close at hand at all times, even during the day when the cooks prep along the counter. (Behind the sliding metal window in the back wall, you’ll find the dish room and a fridge containing extra prepped ingredients for service, as well as a Japanese ice machine.)Photo by Xavier Girard LachaînePhoto by Xavier Girard LachaîneAs Touitou has learned during the design of Déviant and the upcoming renovation of Vivant, which he’s doing with his 90-year-old architect grandfather, Paul Chemetov, “The less space you have, the more focused you are on every single inch.” It also requires an extreme level of organization of one’s workstation. “You develop a kind of choreography when you work,” he said. “If your Microplane is always in the same place, and your lemons are, too, after a while you don’t have to look for your Microplane—or your lemon. I’m pushing my cooks to have a precise place that is well thought out for everything: It allows you to focus on everything else.” It’s a lot of math and a lot of thinking, he concludes, “but it makes everything easier and faster. And you’re less tired!”Photo by Xavier Girard LachaîneWith Déviant open until 1 a.m. and the kitchen serving until 11:15 p.m. —a rarity in Paris, which makes it slammed on weekends—those cooks need every trick they can to stay focused. Because in this restaurant, all eyes are on them.Photo by Xavier Girard LachaîneExplore Bon AppétitRestaurants + TravelParisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-04", "author": ["Condé Nast", "Christine Muhlke"]}