{"id": "7103bd48f486ddb40d703f4362abef6e", "url": "https://www.bonappetit.com/story/reveal-avocado-brew", "year": 2021.0, "month": 1.0, "day": 5.0, "content": "This Avocado Seed Tea Is Tangy-Sweet  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Tangy-Sweet Drink Is Made From Avocado PitsHass, queens!By Paul O. MimsJanuary 29, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!Herbal teas and brews can be made by extracting ginger, orange zest, and even rose petals, but avocado pits? The idea wasn’t far-fetched for food scientists Sheetal Bahirat and Zuri Masud, who met in Drexel University’s culinary science masters program in 2017. “I was making guacamole one day and I had so many seeds (a.k.a. pits). I thought to myself, I am such a hypocrite if I am studying food waste and here creating more,” Bahirat says. She partnered with Masud to launch Hidden Gems Beverage Company last August, a women-owned, minority-owned, and Philadelphia-based beverage company that aims to utilize food waste in creative ways. Reveal Avocado Brew, a subtly sweet kombucha-like beverage, is made from cold brewed avocado seeds, apple cider vinegar, monk fruit, and other natural flavors. The line includes grapefruit-lavender, rose-mint, and mango-ginger.“Extracting avocado seeds is nothing new,” Bahirat says. “People in Nigeria, Tanzania, and Mexico have been using them to treat diarrhea, stomachaches, and even hypertension for years and years.” But before moving ahead with production, the team needed to get FDA approval. Conducting the necessary clinical trials would require thousands of dollars, so Bahirat dedicated her graduate thesis for Drexel University’s culinary science program to getting a “generally recognized as safe” (GRAS) designation from the FDA. According to Bahirat’s thesis research, many health benefits are in the seeds that consumers throw away—including antioxidants, which are known for helping inflammation. Once they were able to get the GRAS designation, formulation testing began.An important part of their development process was ensuring that every aspect is sustainable, from rescuing seeds bound for restaurant trash cans to packaging the brew in recycled bottles. “When we first started testing, we would get avocado seeds from restaurants who were just going to throw them away,” Masud says. “We can stop that from happening.” Today, Reveal’s pits come from restaurants like Juno and Rosy’s Taco Bar in Philadelphia and Tacombi in New York, who save and freeze the avocado seeds after the flesh has been used for various preparations. Bahirat and Masud gather the seeds, which are cleaned and processed at the Food Innovation Center at Rutgers University.As someone who has jumped on and off the flavored kombucha train, I can honestly say this beverage is my new favorite. It has less sugar than leading kombucha brands and only 15 calories a bottle. But using a bottle of mango-ginger to make a Moscow Mule is the real tea!Photograph by Emma FishmanReveal Avocado Seed Brew$3.79 at goPuff$45 at Reveal (pack of 8)Explore Bon AppétitHealthyishHealthyish Loves ItAvocadoSustainableShoppingRead MoreshoppingIf You Like Tahini, You’ll Love SeedibleBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-29", "author": ["Condé Nast", "Paul O. Mims"]}