{"id": "710caf3028cbce169d386f769b9112a5", "url": "https://www.bonappetit.com/story/house-of-pies-houston", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "I’ll Wait All Night for Chicken Fried Steak, Buttery Toast, and All the Desserts From House of Pies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ll Wait All Night for Chicken Fried Steak, Buttery Toast, and All the Desserts From House of PiesTrue story.By Jesse SparksAugust 15, 2019FacebookTwitterEmailPhoto by Jenn DuncanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I am not a line person. Not for Black Friday, not for night clubs, and certainly not for whatever hype-y food fad that may be dominating Instagram on a given day. But I’ll GLADLY wait in line all night (and nearly have!) for the incredibly satisfying breakfast at House of Pies, a beloved ’70s-style diner chain with an outpost smack dab in the middle of Houston’s Montrose neighborhood.What would warrant this stark change in character, you ask? The answer is simple: breakfast for dinner. At House of Pies, plate after plate of crispy bacon and creamy soft-scrambled eggs and fluffy biscuits topped with pork-studded gravy arrive at tables like clockwork. The extensive menu can be a lot to take in when you’re trying to order—don’t look at the staggering line-up of picture-perfect pies just yet—so order as I do. Get the chicken fried steak, delightfully craggy, and served with glossy fried eggs and crackly hashbrowns. It’s the perfect Texan breakfast...but for dinner.For dessert, I skip the swirly lemon meringue, brownie-like Texas pecan fudge, and golden egg cream custard for my favorite pie ever: the Bayou Goo. It’s a decadent slice of vanilla and chocolate custards layered with cloud-like cream cheese, toasted pecans, whipped cream, and chocolate shavings. After recommending to all my friends, it’s their favorite pie now too.So while I won’t be caught dead waiting for a midnight movie premiere, I’ll always queue up for House of Pies. Because some things really are worth the wait.Go there: House of PiesExplore Bon AppétitBreakfastHoustonHighly RecommendRestaurantsPieRead MorerestaurantsYou Can’t Go Wrong with “Creamed” + “Eggs”By Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-15", "author": ["Condé Nast", "Jesse Sparks"]}