{"id": "711128a7dfe1ddfa1325e8d537a04471", "url": "https://www.bonappetit.com/story/simple-grain-free-granola-is-best", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "I Make a LOT of Granola and This Recipe Is By Far My Favorite | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make a LOT of Granola and This Is by Far My FavoriteThis recipe is proof that granola doesn’t need a million ingredients to be delicious.By Sarah JampelJanuary 22, 2021FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailYou know that feeling when you look at an old picture of yourself (or a Tweet you wrote two years ago)? Maybe the word is regret? Embarrassment? Confusion? I had that same sinking, cringy sensation when I returned to a recipe I posted for “my best granola” six years ago. It calls for sixteen ingredients and half of a ripe banana. Who wants to be stuck with a purposeless half-banana?Maybe I had the time (and the bananas) to spare in 2015, but these days you won’t find me measuring out tablespoons of wheat germ, sesame seeds, flax seeds, and poppyseeds. What you will find me doing is making Andy Baraghani’s Grain-Free Tahini Granola, which requires just seven ingredients (including salt) and can be made from start to finish in about an hour.But it’s not only simple and easy—it’s also some of the best granola I’ve ever tasted, let alone made (and this is coming from someone who eats granola whenever presented the opportunity). Delightfully clumpy and crunchy and not too sweet, it’s proof that granola doesn’t require elaborate song and dance to be delicious. I think the key to its success is the tahini, which brings a nutty savoriness and dries out as it bakes, binding the nuts into huge clusters.Lest you think I’ve changed my ways entirely, I do tweak the recipe a little depending on what I have in my kitchen. Because nuts cost a pretty penny and I’ve got nothing against grains, I usually swap out at least 1 cup for old-fashioned rolled oats. I’ve used shredded coconut instead of coconut flakes (or left it out entirely), subsidized some of it with raw sesame seeds, replaced the tahini with black tahini (natural peanut butter would also be good…!), and traded some of the maple syrup for honey or brown sugar. But no matter how many changes I make, I know I’ll never go back to that 2015 recipe—or that 2015 haircut. (What was I thinking???)Get the recipe:Grain-Free Tahini GranolaIf you’re missing the oats in this gluten-free, make-ahead granola, simply swap out 1 cup of the nuts for ¾ cup rolled oats.View RecipeExplore Bon AppétitBreakfastGranolaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-22", "author": ["Condé Nast", "Sarah Jampel"]}