{"id": "713b11da328d405b3e80aadedc37c416", "url": "https://www.bonappetit.com/story/never-fail-yogurt-flatbread-recipe", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "A Flatbread Recipe for People Who Think They Can't Bake Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Flatbread Recipe for People Who Think They Can't Bake BreadI'll probably never make a loaf of sourdough, but I make these yogurt flatbreads almost every week.By Emma WartzmanMarch 2, 2018FacebookTwitterEmailPeden & MunkFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the flatbread recipe that editorial web assistant Emma Wartzman just couldn't live without.I am not a bread person. Don't get me wrong: I love bread. But what I mean is that I don't bake bread. Sure, I aspire to have my own sourdough starter one day, and use it every week to make a beautiful, crackly-crusted loaf I can call my own—but pretty much in the same way that I hope to someday enjoy cardio workouts, or be more productive in the mornings. But such is life and so, for now, I make flatbread.\"But flatbread is bread,\" you might be thinking. Technically, you're right. But, as far as I'm concerned, bread is by definition hard to make, and this homemade flatbread recipe is maybe easier to make than scrambled eggs. No component of it has to be kept alive over days and weeks and months, fed flour and water and doted on with as much care as you would give your own child. Not that kind of thing. All you need to make this flatbread is six ingredients, one bowl, one pan, and a group of people to feed. (You don't even technically need the group of people, but it helps to have someone to say, \"Wow! You made homemade flatbread! You're amazing!\")The brilliance of this particular recipe, courtesy of Joshua McFadden of Ava Gene's in Portland, OR, is the addition of yogurt, which gives the flatbread some of the appealing tanginess that you would get from a complicated sourdough bread. And the rest of the ingredients are things I almost always have on hand: flour, baking powder, a tiny amount of sugar, some salt, and a bit of olive oil. All you have to do is mix it all together and knead for about a minute until you have a relatively smooth mass. The recipe says to divide the dough into four pieces, but I often divide it into eight smaller guys. (I often double the recipe if I'm cooking for a lot of people.) Then you let the pieces of dough rest for about 15 minutes, allowing everything to mingle and hydrate, which in turn will make the flatbread easier to roll out.Next time, skip the store-bought stuff.\nAlex LauThe next step is rolling the flatbreads out, which you can do with a rolling pin if you have one, or a wine bottle if you don't. The goal is to get to ⅛ of an inch thick and a relatively round or oval shape, but don't sweat it if they look like something closer to a weird blob. No one will care: You're making homemade flatbread for them!Heat some olive oil in a large skillet (a cast iron works great here) and, if you're making four larger ones, cook each one individually until both sides are golden-brown—you want the exterior sliiiiiightly crispy, with a perfectly chewy interior. They're best right after they come out of the skillet, so if I'm making a lot of them I'll keep them warm on a plate in a low temperature oven, or just wrap them up in some aluminum foil.So, what to serve them with? As you can see, our photo of this particular flatbread recipe comes with beautiful heirloom tomatoes and a yogurt sauce on top, but I don't recommend doing that unless it's peak tomato season. You can kind of serve them with anything, frankly. A few weeks ago I served them alongside our recipe for No-Fail Roast Chicken and they did a wonderful job of sopping up all the delicious chicken-y juices that pooled in the bottom of the pan. I've served them with our recipe for Spicy Lamb with Lentils and Herbs, stuffing the mix into the flatbread like a sandwich. I've also cut them into wedges and put them out as the vehicle for Classic Chickpea Hummus, or pretty much any other dip, for that matter. You could top it with jammy eggs, which makes just as good of a breakfast as it does dinner. The point is, the possibilities are endless. You need these flatbreads in your life.Listen, I'm all for goals, and bringing my own sourdough starter into this world and loving it and caring for it remains one of them. But as long as I'm still getting ooo's and aah's every time I bring these dumb-easy flatbreads to the table, it's not going to be a priority. And at the rate things are going...yeah, not going to happen anytime soon.Get the recipe:Falafel-Spiced Tomatoes and Chickpeas on FlatbreadView RecipeExplore Bon AppétitNever FailBasicallyFlatbreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-02", "author": ["Condé Nast", "Emma Wartzman"]}