{"id": "7152f1a0a0eec2711ddb14c12f519d5d", "url": "https://www.bonappetit.com/recipe/grapefruit-bars-with-candied-zest", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Grapefruit Bars with Candied Zest Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueGrapefruit Bars with Candied ZestBy Chris MoroccoNovember 20, 20184.2(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintJoy to the world: a citrus bar just as beautiful as it is zingy. The twice-cooked curd method was inspired by authors Rose Levy Beranbaum and Melissa Clark and ensures that these bars are extra sturdy and have a smooth, shiny surface. They hold their shape well even when sliced.IngredientsMakes about 16Shortbread1cup all-purpose flour¾cup powdered sugar2Tbsp. granulated sugar¾tsp. kosher salt½cup (1 stick) chilled unsalted butter, cut into pieces2large egg yolksCandied Grapefruit Zest1grapefruit½cup granulated sugar, dividedCurd and Assembly3large eggs3large egg yolks1cup granulated sugar1Tbsp. cornstarch1Tbsp. finely grated grapefruit zest (from 1)¼cup fresh grapefruit juice (from 1)2tsp. finely grated lemon zest (from 2)¾cup fresh lemon juice (from 5–6)1tsp. vanilla extract or paste½tsp. kosher salt½cup (1 stick) unsalted butter, room temperature, cut into 8 piecesPowdered sugar (for serving; optional)PreparationShortbreadStep 1Place a rack in middle of oven; preheat to 350°. Line an 8x8\" baking pan, preferably metal, with overlapping sheets of parchment paper, leaving at least 4\" overhang on each side. Pulse flour, powdered sugar, granulated sugar, and salt in a food processor a few times to combine. Add butter and pulse until largest pieces are pea-size. Add egg yolks and pulse just until dough comes together in small clumps. (Shortbread can also be made by hand: Whisk dry ingredients in a large bowl, then work in the butter with your fingers before mixing in the egg yolks with a sturdy spoon.)Step 2Transfer dough to prepared pan (you may find it easier to form the dough into a ball first, instead of working with clumps—entirely up to you!) and press into an even layer. If dough is sticky, use a piece of plastic wrap between your hand and the dough. Prick dough with a fork in several spots (this helps it stay flat as it bakes). Bake shortbread until edges and top are golden brown, 24–28 minutes. Let cool.Step 3Do Ahead: Shortbread can be baked 3 days ahead. Store tightly covered at room temperature.Candied Grapefruit ZestStep 4While the shortbread is baking, use a sharp knife to remove zest from grapefruit in 2\"–3\" wide strips (it’s okay to leave some white pith attached). Slice strips very thinly lengthwise; save fruit for another use. Combine zest and 2 cups water in a small saucepan and bring to a simmer. Drain immediately. Combine zest with ¼ cup granulated sugar and 1 cup water in the same saucepan and bring to a simmer. Cook, stirring occasionally, until zest is translucent and softened, 15–20 minutes. Drain, discarding syrup, and toss zest in a small bowl with remaining ¼ cup granulated sugar. Set aside until ready to use.Step 5Do Ahead: Grapefruit can be candied 1 week ahead. Store airtight at room temperature.Curd and AssemblyStep 6Reduce oven temperature to 300°. Vigorously whisk eggs, egg yolks, granulated sugar, and cornstarch in a large saucepan until smooth and sugar is mostly dissolved. Whisk in grapefruit zest and juice, lemon zest and juice, and vanilla. Set saucepan over medium heat and cook, whisking constantly and making sure to get into the corners of the pan, until curd begins to bubble slightly around the edges and thickens, about 5 minutes. Simmer very gently, still whisking, 30 seconds, then remove from heat. Whisk salt into curd, followed by butter a piece at a time, whisking to fully incorporate after each addition. Scrape curd into pan with shortbread and smooth over crust. Top with some of the candied grapefruit zest (you probably won’t need all of it; snack on any left over!).Step 7Bake grapefruit bars until surface of curd is set (the center will still wobble slightly when pan is gently shaken), 20–25 minutes. Transfer to the refrigerator and chill until very cold, at least 3 hours, or preferably overnight.Step 8Just before serving, slice grapefruit bars into 2\" squares and dust with powdered sugar if desired.Step 9Do Ahead: Bars can be baked 3 days ahead. Cover and keep chilled.How would you rate Grapefruit Bars with Candied Zest?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis was a big hit at my house.  Had to adjust because I had only grapefruit, and was looking for a way to use it.  .  Subbed in 2 tablespoons of grapefruit zest and 1 cup juice.  Flavor is terrific.  I did adjust the shortbread recipe by putting in the tiniest pinch of baking soda (I'm on a \"see if baking soda helps brown things!\" experimentation phase-just carry on).  I took the advice of other writers and left the pan in the oven a long while--20 minutes, until it really set.  I think my old convection oven doesn't really do accurate temps.  I've had this trouble with quiches, too.  Betty Rubble01730Bedford, MA3/4/2022Disappointing that  the webmaster does not monitor the recipe reviews on this  page ,  given difference in opinion in the baking pan size!  that is the 8x8 as per the recipe or  9x13 as suggested by a few reviews! \nA little confusing which could be clarified for users of this website!  \nThank you. Mazza B.  downunder. AustraliaMazza BAustralia12/20/2020I halfed this recipe (curd and cookie) and them came out perfect for an 8x8 pan. \nI would also reccommend adding the candied peel after baking, as baking with them adds very little (if anything) to the recipe, but it makes cutting them a bit difficult as the peel pushes into the curd when cutting. omgitsjulianSeattle, WA9/28/2020I love these. I did decide to strain the curd through a fine sieve. I think this helped to lessen the overall amount of curd, thus producing a less thick layer or curd to shortbread. Using a metal pan the second time around produced much better results.nataliematz88Omaha, Ne5/10/2020Hello what a success! These were supes tart and light and creamy and nice. I didn't have a zester/microplane so I highly recommend buying one before making these, because it took a lot of time without one. The commenters recommended using a 9x13 pan, so that's what I did (I used glass), and it turned out perfect in about 25 minutes in the oven. I also had a fun time making the candied grapefruit, I think it's crucial to keep this in the recipe because it adds a really nice grapefruit zing. Nice recipe! ThanksmabeorNew York3/25/2020I have now made these twice, and overall I really love these bars. Like other reviewers have said, they are more of a \"citrus\" bar than a grapefruit bar - in order to boost the grapefruit taste I have upped the ratio to 1/2 cup grapefruit and 1/2 cup lemon juice as well as increased the amount of grapefruit zest. The first time I made these, I found the candied zest to be too much of a hassle - the second time, I left the zest out and people raved about them equally as much. \n\nAs for the thickness of the bars - I agree with the other reviewers that they are indeed thick, but as long as you cut them into small enough squares they are alright. I think they need to be refrigerated at least overnight to get the desired texture. Otherwise - delicious!kateelizabethbToronto, Canada2/11/2019I made these bars last weekend. I made the crust on Friday night and the curd and candied zest the next day. However, I too feel, like a previous reviewer, that an 8x8 pan is too small. I felt like both the shortbread and the curd layers were too thick. Next time I make these I will use a 9x13 pan.  The flavor of everything was absolutely delicious. nataliematz88Omaha, NE1/30/2019**See comments below** This recipe needs 10 more minutes added to set the custard. It'll act like jello at that point; it's like it develops a jiggly body of its own when it's ready. More of a \"citrus bar\" since the grapefruit wasn't loud enough in taste.\n\nWhen preparing the custard on the stovetop it reminded me of the French Chef episode of Julie Child preparing hollandaise sauce. You gotta treat that sauce right!AnonymousCincinnati, OH1/11/2019These were a hit with my family, I didn’t have any problems with the crust or filling. They set well and seemed proportional to the pan. The candied grapefruit is a nice extra, but not really necessary. I’ll definitely make these again!\nAnonymousPortland, OR1/10/2019Easy to make and I've been asked to share the recipe by several people. It took a little longer than listed to bake with the filling - about 10 minutes longer. Tangy curd with buttery shortbread and chewy zest. Yum!TXHuskerTexas12/29/2018Wow. I would hope BA would super test their Christmas cookie recipes. I guess not. As an experienced cook and baker, I thought the times, methods and quantities seemed off. And yes, they were. While the ingredients are tasty, the cookie is a mess. First, an 8x8 is definitely the wrong pan for this quantity of both base and filling. Way too thick a bottom crust, so that the bottom is so solid I cannot cut through it. And I undercooked it as it was browning. So undercooked and yet still impossible to cut! Then the top curd layer is very fussy to make and does not bake at 300 in anywhere close to 20-25 minutes and then is still too gooey to cut after refrigeration overnight. Such promise! Such a disaster ! At holiday times, when you don’t have a lot of time to get things wrong! But I have lots of fussy grapefruit zest to put in cookie tins. \n\nThis reminds me of years ago when BA/Gourmet put beautiful Christmas stars with completely inedible silver dragees on the Christmas cover.\n\nPlease research your holiday recipes and all others.\nrosdianeEvanston IL12/19/2018I'm obsessed with the sound of these. I wanted to add them to my family cookie tins that I'm mailing out. Do you think they'll do well in the freezer before they hit the mail?Portland, OR12/8/2018Explore Bon AppétitCookieDessertBar CookieGrapefruitCitrusFruitLemonNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}