{"id": "715f27452f1742a3308acbb97072d5e1", "url": "https://www.bonappetit.com/story/get-to-know-eggplant", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "What Is an Eggplant, I Beg of You? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is an Eggplant, I Beg of You?Everything you need to know about eggplant, and some things you don't.By Alex BeggsAugust 6, 2020FacebookTwitterEmailFacebookTwitterEmailHold it right there. Are you about to put an eggplant in your refrigerator?! GET IT OUTTA THERE. Eggplants are warm-weather fruit—more on that later—and hate the cold. Maybe, foretelling a frigid indoor winter ahead, you do too. Let’s soak up all the good produce late summer has to offer, but especially that mysterious nightshade we call eggplant. Often misunderstood. Often used more as an emoji than for dinner. Often delicious if you know what to do with it. Find out, below.With special thanks to Patrick Ahern, produce expert at Baldor Specialty Foods, Mariola Plazas, a research scientist at The Polytechnic University of Valencia, Elizabeth Schneider’s Vegetables from A-Z, The Joy of Cooking, and the Oxford English Dictionary’s entry for “eggplant” (hey, why not).🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆Let's get this out of the way first:You guys: Eggplant is a FRUIT. In fact, it is a BERRY! It grows on a short bush where the berries sprout and hide beneath big leaves, hence the term “nightshade.” It’s lovely.Wait, what's a nightshade? (And why don't celebrities eat them?)Poor eggplant has been fighting off a bad reputation for centuries. People thought it’d give you leprosy, cancer, insanity, general bitterness. Nightshades (which also include potatoes, tomatoes, and peppers) contain an alkaloid that might cause inflammation, especially for people with gout or arthritis or West Hollywood diet consultants, but no medical studies have been able to directly prove it.Okay, okay—I want an eggplant. How do I choose which one to take home?Pick heavy eggplants with smooth and shiny taut skin. Avoid skin that’s dull or bruised, which means it’s probably old. Find them from summer through fall (or year-round from warmer regions like Mexico and Florida).What sorts of varieties might I find?Hundreds of types of eggplants await your discovery and delight, but for now, here are a few common ~cultivars~ you’ll find in stores:Globe eggplants are BIG ‘n’ MUSHY. They’re great for bulk cooking (wide slices for eggplant parm/big batch of baba ghanoush or Trini stewed eggplant), but can be bitter and seedy, with a tough, dark purple skin in need of peeling.Japanese eggplants are LONG ‘n’ SKINNY. They’re nearly seedless, with a milder, sweeter flavor than a globe. Their firm texture makes them easy to slice and fry.Fairy Tale eggplants are CUTE ‘n’ PRICEY! They usually have a streaky purple skin (that turns brown when cooked). They’re tender, creamy, and fast-cooking. Chefs love these because they can plate them whole and enamor diners.“Long boi.” \nChristopher TestaniHow do I store them?Eggplants hate the fridge, where their skin gets dark and rubbery, so try and cook it the day you buy it. Otherwise, store it at room temperature for 2-3 days out of direct sunlight, or in the warmest part of your fridge (near the front) wrapped in a towel or a reusable Veji Bag for bonus points. It can last there a week or so, but you might need to peel the skin.Why is eggplant sometimes bitter?According to an actual eggplant scientist I consulted, Mariola Plazas, the bitterness comes from a combination of chemical compounds that were supposed to deter predators in the ol’ Darwin days. A lot of that has been bred out by now, but eggplants still tend to get bitter as they ripen and mature (…same). That’s one reason to eat them as soon as possible—the other reason is because you’re hungry.Why are people always salting eggplant?When you’re making, say, eggplant parm, salting and then blotting the slices beforehand draws out moisture, preventing the eggplant from going soggy as it fries. But let’s be honest: eggplant doesn’t taste like much. Salt brings out its subtle, sweet earthiness and dispels any bitterness.Yes, this is squash, but the same cross-hatching principle applies to eggplant.\nPhoto by Alex Lau, Food Styling by Susie TheodorouHow can I make sure it's flavorful all the way through???Use the tip of a knife to score the cut sides of eggplant halves in a shallow cross-hatch pattern before roasting them. This creates more surface area for the eggplant to brown and more crannies for salt and other seasonings to soak in. Bonus: With more flesh exposed, it’ll cook quicker too.How did the eggplant emoji come to represent a...body part?Original emoji designs were made for Japanese iPhones. The eggplant emoji was based off of a Japanese varietal that is, ahem, longer than a typical globe. You can put two and two together here.Baby eggplants, or gigantic baking dish? You be the judge.\nPhoto by Chelsie Craig, food styling by Claire SaffitzWhat should I make first?You've got time on your hands, so how about Slow-Cooked Eggplant? Place a rack in middle of oven and preheat to 350°. Toss 1 lb. fairy tale eggplants, halved lengthwise if large, ½ head of garlic, a few wide strips of lemon zest, ½ cup extra-virgin olive oil, ¾ tsp. fennel seeds, and ¾ tsp. kosher salt in a shallow 2-qt. baking dish to combine. Turn garlic cut side down, then roast eggplant, tossing 2 or 3 times, until golden brown, very tender, and crisp around edges, 70–80 minutes. Let cool slightly, then add 1 Tbsp. fresh lemon juice and toss to coat.Followed by…Trini Stewed EggplantIn Brigid Washington's home country of Trinidad and Tobago, this garlicky eggplant dish, known colloquially as baigan or melongene, isn’t considered a recipe because all it requires is a low flame, a handful of garlic cloves, a generous dash of curry powder, and eggplant.View RecipeExplore Bon AppétitEggplantRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-06", "author": ["Condé Nast", "Alex Beggs"]}