{"id": "7160f39ca7d7d182164d920af6b898d5", "url": "https://www.bonappetit.com/recipe/kimchi-lentil-stew-with-poached-eggs", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Kimchi-Lentil Stew With Poached Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKimchi-Lentil Stew With Poached EggsBy Diana YenSeptember 12, 20214.4(34)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintSatisfying, spicy, and comforting, this vegetarian stew is inspired by the complex flavors of Korean kimchi jjigae. Lentils add heartiness and bite while poached eggs add an irresistible ooziness. If you’re feeling ambitious, this stew is also delicious made with homemade kimchi. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan with Lid$39 At AmazonLadle$8 At AmazonCutting Board$10 At IKEAIngredients4 Servings2scallions1Tbsp. vegetable oil1small onion, thinly sliced3garlic cloves, thinly sliced1Tbsp. gochujang (Korean hot pepper paste)1cup chopped kimchi with liquid1Tbsp. gochugaru (coarse Korean red pepper powder)2tsp. sugar1cup French green or brown lentils4cups low-sodium chicken or vegetable broth1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more4large eggsPreparationStep 1Remove dark green tops from scallions and thinly slice; set aside for serving. Thinly slice remaining white and pale-green parts. Heat oil in a large saucepan over medium-high. Cook white and pale-green parts of scallions, onion, and garlic, stirring often, until softened and starting to brown, about 4 minutes. Add gochujang and cook, stirring often and reducing heat as needed to prevent burning, until very fragrant and slightly darkened in color, about 2 minutes. Add kimchi, gochugaru, and sugar and cook, stirring, until kimchi is slightly softened and translucent, about 2 minutes. Add lentils, broth, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and stir to combine. Bring stew to a boil, then reduce heat and cover. Simmer, adding a splash of water if needed to loosen, until lentils are just barely tender, 20–25 minutes.Step 2Uncover pan. Crack an egg into a small bowl, then gently slide into stew. Repeat with remaining eggs, leaving some space around each. Cover pan and simmer until egg whites are set but yolks are still runny, about 3 minutes.Step 3Ladle stew into bowls, making sure to include an egg in each, and top with reserved scallion tops.How would you rate Kimchi-Lentil Stew With Poached Eggs?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI liked this.  Easy, cheap, healthy, but not boring.  For me it verged on too spicy for comfort, but I'm a bit of wimp.  I used black lentils and probably because of that it did not turn out as thick as I expected (though no less delicious).  I think if I did it again with black lentils I'd use 3 cups of broth instead of 4. ErinSan Francisco, CA1/26/2022This is a good spin on Kimchi Jigae meet lentil stew. I used sesame oil, increased the garlic, and added some ginger. Plus the kimchi was super ripe and I poured in quite a bit of juice. Made the stew tangy. It’s interesting on the palette: a spicy, tangy, hearty stew. Will definitely make again.  ASmithDenver12/6/2021Enjoyed this a lot! Reduced the salt (but I always do). Made it as specified and it was delicious. Do not skip the egg! It was a great addition - even for those who aren't \"egg\" people. For my pantry meal, I added a little more gochugang, some Chinese sausage I had in the fridge and served over some stirfried rice cakes. Definitely adding this to my rotation.EvanYpsilanti, MI10/18/2021Heartwarming food! I went 1.5x on the gochugaru and gochujang for some extra kickSam Adams10/6/2021Really tasty! As others have said, the salt can be reduced by half. I also added oyster mushrooms at the beginning.Elliot GUnited Kingdom10/2/2021Tasty and wholesome! And quick to prepare. Used green lentils, Sunja's medium spicy kimchi (made in VT, vegan and low sodium, very \"accessible\" for the kimchi anxiety), and half the sugar. Added some cauliflower florets, diced carrots, minced ginger. I decided to hold back on recommended salt until the end of cooking time, when I could taste the final product. Ended up not needing the extra salt! This stew is hearty, warming, flavorful, satisfying, and the egg adds lovely richness.Anonymous9/23/2021Yummy, I used up my adzuki beans and used homemade kimchi.  Delicious!Brushjlsolon, oh9/22/2021This is a great base recipe.  I'm not used to jjigae with chicken broth but it was a nice change of pace.  I'd add more kimchi and reduce the sugar by half.  Everything benefits from a poached egg!  Serve with a side of rice and it's a great pantry dinner.AmyHouston, TX9/14/2021Explore Bon AppétitGreen Onion ScallionOilOnionVegetableGarlicgochujangKimchigochugaruSugarLentilChicken BrothKosher SaltEggDinnerVegetarianEasyWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-12", "author": ["Condé Nast", "Diana Yen"]}