{"id": "71673b9b6917a43d5eb447ac5c0647b4", "url": "https://www.bonappetit.com/recipe/persimmon-crisp-with-spiced-oat-topping", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Persimmon Crisp with Spiced Oat Topping Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishPersimmon Crisp With Spiced Oat ToppingFacebookPinterestTwitterEmail6 - 8 servingsPrep Time: 15 minActive Time: 45 minThis cozy dairy-free persimmon crisp can be made in batches with Country Crock® Plant Butter with Almond Oil and easily entertain a crowd. PrintIngredients4 cups ripe Fuyu persimmon (about 5 persimmons)10 Tbsp raw turbinado sugar9 Tbsp all-purpose flour¼ cup Country Crock® Plant Butter with Almond Oil½ cup quick cook oats½ tsp ground cardamom½ tsp ground cinnamon1/8 tsp ground cloves¼ cup roasted salted pepitaspinch of salta pinch of freshly grated nutmegFor serving: dollop of coconut yogurt or dairy-free ice creamFresh mintRecipe PreparationMake the filling: Heat oven to 400°F. Grease an 11x7 baking dish with Country Crock® Plant Butter.Dice the persimmons into 1/4 inches, and then combine and toss 2 Tbsp of raw turbinado sugar, 1 Tbsp all-purpose flour and the pinch of freshly grated nutmeg in a medium bowl.Make the topping: In a medium saucepan, melt the Country Crock® Plant Butter on medium-low. Stir in a 1/2 cup of raw turbinado sugar. When fully combined turn off the heat.Then stir in the oats, then a 1/2 cup of all-purpose flour, then the cardamom, cinnamon, cloves. Lastly, add the pepitas and a large pinch salt. Combine thoroughly.Assemble and bake:Arrange the filling mixture on the bottom of the dish. Arrange the oat mixture on top of the filling, pressing down slightly. Bake the until the top of the crisp is evenly golden and the fruit juices are bubbling around the edge, 35-45 minutes. If the crisp is getting dark and fruit needs more time (this will depend on the fruit ripeness), cover with aluminum foil and continue to bake in 5-minute increments.Finish & Serve:Let cool slightly, then serve warm with a dollop with coconut yogurt or ice cream and garnish with fresh mint.Recipe by Country Crock® Plant ButterReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Country Crock", "Plant Butter"]}