{"id": "71696962a4b0779c9644dc2d6120a603", "url": "https://www.bonappetit.com/story/cake-flour", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Cake Flour - What Is It, How to Make It, And Why It's Important | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen a Recipe Calls for Cake Flour, Get the Cake FlourIt's the ticket to fluffy, tender, tall cakes.By Sarah JampelMarch 30, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I used to think that cake flour was merely a suggestion. Maybe a strong suggestion, but a suggestion nevertheless. I understood on a vague level that cake flour would make a cake more fluffy and tender, but I figured I could skip it (who would notice, with no superior cake with which to compare it?) or use the internet’s widely circulated workaround: Replace 2 Tbsp. of every 1 cup AP flour with cornstarch.But all of that was before I started reading BakeWise, a definitive cook-slash-text-book by the biochemist (and my personal idol) Shirley Corriher. Simply put, writes Corriher, “You will get a different texture and taste in a cake using cake flour.” On the ingredient list for her Magnificent Moist Golden Cake, which was my inspiration for this No-Mixer Vanilla Cake, Corriher states that there is “NO SUBSTITUTE” (her caps, not mine) for cake flour: The cake “will be sunken in the center and simply will not work correctly if other flour is used.”So what is cake flour and what's so special about it?For starters, cake flour is low-protein (typically 5–8% protein as compared to 10–13% for AP), and that’s because it’s milled from low-protein (a.k.a. soft) wheat. This means it does not produce as much gluten as regular AP flour and can yield more light, tender results. (It also means it will not make a good loaf of bread.)But that’s not all. Cake flour is also very finely ground, “with a silky-smooth texture that produces a fine-textured cake,” explains Corriher (you might see it labeled as extra fine or superfine flour). Because it’s so fine, it has more surface area, meaning it can absorb more liquid. Being able to add more liquid to a cake also makes it possible to add more sugar without compromising the structure. (Since sugar is hygroscopic—moisture-sucking—increasing its quantity goes hand in hand with increasing the amount of liquid; otherwise, there’s not enough moisture leftover to hydrate the flour.) And why would you want to add more sugar? It makes for a moister, longer-lasting cake with a tighter, finer, plusher crumb, akin to a wedding cake from a fancy bakery.On top of all that, according to the Bob’s Red Mill website, cake flour also assists with the even distribution of fats and helps cakes rise higher.What’s the deal with bleached cake flour?Maybe you’ve noticed that many common brands of cake flour, like the popular Swan’s Down, are bleached. In BakeWise, Corriher describes the unique advantages of bleached cake flour over its unbleached counterparts: The bleaching process lowers flour’s pH, alters its starch so it can absorb water and swell, mellows its taste, and helps with even fat distribution.But since the publication of BakeWise, King Arthur Baking Company released its unbleached, unenriched cake flour, which Cook’s Illustrated found to yield results “virtually identical to those of bleached cake flour.” That’s what I prefer and what I used to develop this cake.Unbleached and Unenriched Cake Flour$5 at King Arthur Baking Company$13 at AmazonIt is worth noting, however, that in her book BraveTart, Stella Parks calls for bleached cake flour—which she calls “a remarkably delicate flour in every sense of the word”—particularly for her angel food cake. point is: For the best results, follow the recipe and its specifications, especially when you’re making something as delicate as a cake.But I need to know: Does the substitute work?Parks calls the idea of swapping out cake flour for a mixture of AP and cornstarch “a life hack that utterly misses the point”—but I must admit to having used it with, as far as I can tell, with at least moderate success. Employ the trick at your own risk and, I would recommend, in recipes that only call for a small amount of flour total.But when your entire multilayer cake hinges on a large amount of cake flour, buy the cake flour. (It usually comes in fairly small quantities anyway, and, unlike whole wheat flours, will last a good while in your pantry.) A bakery-style cake—tender, moist, tall, sweet, buttery—will make that extra box in the pantry more than worthwhile.Get the recipe:No-Mixer Vanilla Cake With Tangy Cream Cheese FrostingExtremely plush, fine-crumbed, and dare-we-say moist, this is like the best wedding cake—and you mix it entirely by hand.View RecipeExplore Bon AppétitCakeBakeBasically BakingFlourRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-30", "author": ["Condé Nast", "Sarah Jampel"]}