{"id": "71793e1270f3946d0d15c08c56ef718e", "url": "https://www.bonappetit.com/story/cecilia-chiang-was-my-best-friend", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "I Never Thought of Cecilia Chiang as an Icon. She Was Just My Best Friend.  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Never Thought of Cecilia Chiang as an Icon. She Was Just My Best Friend.We were total opposites, but we shared the same vision in life: having fun, working hard, gathering people, and making sure they were happy.By Belinda Leong, as told to Elyse InamineNovember 9, 2020FacebookTwitterEmailPhoto by Heather StenFacebookTwitterEmailI first met Cecilia Chiang about nine years ago, at a house party hosted by Michael Bauer, back then the food critic for the San Francisco Chronicle, and his partner Michael Murphy. I was just an up and coming chef. I hadn’t yet opened my bakery b. Patisserie, and at that time, I was testing baked goods for the menu, like a big pistachio-flavored macaron cake I learned from Pierre Hermé in Paris. I brought that to the party. Everyone was like, “Oh my gosh,” but I was too shy to respond. I didn’t know anyone else there, except for my mentor Gary Danko [the chef-owner of Restaurant Gary Danko]. Knowing he was there was the only reason I felt comfortable enough to go.When Cecilia stepped into the room, people gravitated towards her. She was the life of the party. I was starstruck. Just being in the industry, you knew her like how you knew who James Beard or Julia Child were. She was a pioneer. She opened The Mandarin and introduced a lot of people to Chinese food that wasn’t cheap or chop suey but elegant like beggar’s chicken and minced squab in lettuce cups. She showed what we eat with our families, home cooking and big banquets. She gave America Chinese food like they had never seen. That was a huge risk because you don’t know if people are going to like it—you have to believe in your food and what you’re doing.Once I started talking to her, it was so casual. I don’t remember all the details of our conversation, but I remember there was a lot of “Oh my gosh! Me, too.” We just hit it off, even though we were such opposites. I walked away from that conversation feeling like, “Wow, she’s a normal person”—and also like we were meant to be.A year later, I opened my bakery. I lived right above it and she was about five minutes away. She would come in all the time to support the bakery and bring people. I was nervous, thinking, “I hope they like it. I hope they like it.” But she was always so happy each time and even took some business cards so she could tell other people about it.Over the years, we began spending more time together. She was a busy person, going out to eat about three to five times a week. The times she was at home, she would call me, saying, “I’m home for dinner, if you want to come by.” Sometimes, she made her jumping shrimp; she called it “jumping” because it was so fresh. She heated up oil, seasoning it with salt, ginger, scallions, then added the shrimp and a little Shaoxing wine and premium soy sauce. Other times, she served her popular chicken soup, simmering together preserved bamboo, Virginia ham, some slices of ginger, and a whole chicken in water. She had that in the house all the time. I loved that soup; the broth was so clean. I’d spend hours at her place, lingering over dinner. We talked about everything: the industry, food, family, boyfriends, the past.Cecilia escaped war. She told me about how she ran through the fields once to hide from Japanese soldiers shooting at her. She shared about how she came here to Chinatown, all alone. At the time, Chinatown was mainly Cantonese, but she was Mandarin and discriminated against. Normally a lot of people would be discouraged by that. But Cecilia was a warrior. She believed in herself and what she was doing, and she worked really hard to make herself successful. People always say she was so amazing, but she never tried to be. She was just being Cecilia. The most amazing people don’t necessarily set out to do amazing things—they just live their life being true to their values and convictions.Belinda Leong (right) with Cecilia Chiang, eating at Junzi in New York City.\nPhoto by Heather StenFor the last five years, I saw Cecilia a few times a week, often times with our close friends in the industry. Even in her nineties, when we would go out to eat, she’d want to stay out all night, only reluctantly giving into our pleas when we told her we had to work in the morning. Being around her all those years, I began to see little things that we had in common. We both used Cetaphil on our faces but Vaseline for our hands. We ordered Champagne or wine instead of drinking water at a restaurant. We loved to drive fast and always appreciated a dirty joke and a good laugh. Cecilia believed in having fun, working hard, gathering people, and making sure they were happy. We became best friends because we shared that same vision.A few months ago, I found out why I was invited to that house party. Michael [Bauer] and Michael [Murphy] had known Cecilia for about 40 years, and Michael [Murphy] thought Cecilia should meet me. He told her, “There is this girl. She’s Chinese, just like you. She has the same energy, and she works just as hard as you. I see you hidden in her, and I want you to draw that out.”We were so different. She only ate vegetables, while I eat meat and rice. She read a lot and I never did, which is why she constantly reminded me to read the news. She wore black turtlenecks with brooches for casual parties; she disdained skinny jeans and told me a few times that I shouldn’t wear them. She loved being the belle of the ball. I was the person hiding in the kitchen behind the mixer. But we both had this little voice, telling us “don’t wear that” or “plate a dish like this,” that guided us. It connected us, so even when we weren’t talking out loud, we knew what the other person was thinking. I never met someone like Cecilia, someone who was so different from me yet somehow understood me. She figured out a way to bring out a part of me that I didn’t know existed. She freed me to express myself, to enjoy food like a giddy little kid. Since Cecilia passed a little over a week ago, I’ve had my ups and downs. I’m sad in the morning and at night, when I usually would see her. I don’t have any photos of her or her autographs since she was my friend, not a celebrity. Now I’m listening to her old voicemails. I miss her.But when I share these stories, it makes me smile and sometimes laugh. She was so much fun. Tonight, actually, I invited our little group of close friends to have dinner at my restaurant, Routier, to just talk about her and drink Champagne, like she always would. Even in her 100s, she drank Champagne. In her nineties, she would do shots with me. She was never a party pooper. We’ve all been texting each other, remembering when Cecilia did this or Cecilia did that. So I thought we should just get together, eat, and talk about her. Cecilia cared so much about making people happy, whether it was through food or by bringing them together. It feels like she is still with us.Explore Bon AppétitChefsFirst PersonChineseRead MorecultureThe 99-Year-Old Woman Who Inspired Decades of Chinese-American RestaurateursBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-09", "author": ["Condé Nast", "Belinda Leong", "As Told To Elyse Inamine"]}