{"id": "717c7a3aa0a9d81640b16aaa82e64054", "url": "https://www.bonappetit.com/story/nadia-gohar", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Artist Nadia Gohar Calms Her “Studio Brain” with Fennel Tea and Soft PJs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleArtist Nadia Gohar Calms Her “Studio Brain” with Fennel Tea and Soft PJsThe Egyptian-Canadian artist blends her own face oils and sprinkles black seeds on everything.By Kyle BeecheyNovember 19, 2019FacebookTwitterEmailPhoto by Suech and Beck, Bench by Zachary BesnerFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Nadia Gohar isn’t afraid to challenge you. As you enter one of her multimedia installations, you never know what shape her art will take. It’s thrilling. “I’m always interested in exploring new materials so my inspiration comes from learning a new technique or finding out a new way to use a material that I’m interested in,” she says.At the moment, Gohar is processing research from her recent month-long artist residency at Darat al Funun in Jordan, which focused on architecture, urban research, and Middle Eastern identity. Gohar was born in Cairo and moved to Boston to study painting at the Massachusetts College of Art and Design.Today, she’s based in Toronto, where her mixed media practice combines elements of sculpture, video, painting, and photography to explore themes of identity, migration, and diaspora. For her recent show at Toronto’s Erin Stump Projects, she used materials like mud and clay to create sculptures that resemble Egyptian archaeological excavations. Upon entering the gallery, viewers had to walk around a \"dig\"—a sculpture in the centre of the floor containing fossil-like objects—before viewing her paintings on the wall and mobile-like sculpture hanging from the ceiling. Previous exhibitions at Seattle’s SOIL Gallery and around the world are defined by a sense of nostalgia; her pieces are tools of self-exploration to further connect herself with her origins.Gohar's constantly changing schedule—which shifts from conducting research in Cairo to attending fashion week events in Paris and Tokyo— means there is no such thing as a typical evening for her. The only constant is the change that she embraces. But no matter where she finds herself, she stays grounded with a carefully crafted skincare routine and soft white cotton pajamas.Photo by Suech and Beck Studio work vs. night workThere isn’t really a different mindset between “home me” and “work me.” Most of my hands-on work happens at the studio, but the more hands-off notes and readings I’ve done, the quicker I can get to the actual work. I often reread the same texts a million times, especially my old texts from school. I took this class on memory in my final year of art school and I treasure that collection of readings. It includes excerpts from Sylvia Plath's journals and The Bell Jar, some Proust and Oliver Sacks too. It’s not that the works are directly related to my work, they get me thinking creatively. I ask myself questions and I try to respond to them and think about them when making my work.Photo by Suech and Beck DIY (and decidedly non-DIY) skincareSkincare is important to me. I have combination skin that tends to be a little drier in the winter, so I have been using Dr. Haushka Cleansing Cream & toner daily for the last seven or so years. Following that, I use a blend of oils that I usually make myself, which changes all the time. I experiment, but I know you need a carrier (a gentler oil used to dilute harsher essential oils) so I’ll use almond oil for that, and then usually a blend of black seed oil and apricot seed oil that I mix together in a dropper bottle from my local health food store.The one ingredient I probably couldn’t live without is black seed oil. I use it on my face and I even drink it by the spoonful sometimes, put it on salads, or even just eat the seeds themselves. Is it good to use ingredients native to where you’re from? Maybe, because black seed is important in  Egyptian culture and it works for me.Sometimes I use Living Libations Rose Glow Face Creme depending on the season or if my skin is extra dry. When I remember, I use a dry brush on my body as well before all of the stuff I just mentioned. I also love the Buly 1803 Mexican Tuberose Body Oil.Photo by Suech and Beck, Cup and saucer by Jane from SisteringForever about fennel teaI like to eat a later dinner, so I generally begin doing the things that signal going to bed, like showering and washing my face, around 10 p.m. or so. After all of that is done, my favorite part is finally unwinding with a fennel tea. I love fennel tea, but I’m not into a specific brand. I usually pick up whatever is at the store: loose leaf, tea bag, whatever. My favorite cup and saucer is by Jane from Sistering.Photo by Suech and Beck Making a sleep sanctuaryMy bedroom is pretty minimal, but I have a few pieces of art on the walls. My favorite is a painting by my boyfriend’s mother. We also have a Richard Kern photograph and a small drawing by Darby Millbrath.  The yellow bench next to my bed is called “Ant Farm” and it’s by my friend Zachary Besner.When I was a kid, my mom always said that the beds were only for sleeping. We didn’t spend much time in our own rooms or in bed unless we were sleeping, and I sort of kept that going in my adult life. I think it makes going to sleep easier, because your body is conditioned to sleep if it’s in that one place.Once I’m in bed, any soft white cotton PJ really puts me in wind down mode. I am also really specific about my pillow. I like a really fluffy feather pillow. I hate a synthetic one—I’d rather not have a pillow than have one of those. I’ve heard that sleeping with a silk pillowcase is good for your skin so I’m thinking about that, but I’ve been thinking about that for years and I haven’t done anything about it.Explore Bon AppétitHealthyishGoing to Bed withInterviewsRead MoreLifestyleBrujita Skincare Founder Leah Guerrero Digs Ambient Music and Red SheetsBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Kyle Beechey"]}