{"id": "718e79d307aa6af5a43ec8cc1d4a51d8", "url": "https://www.bonappetit.com/story/heb-flour-tortillas", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Why Are H-E-B’s Flour Tortillas So Dang Good? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureWhy Are H-E-B’s Flour Tortillas So Dang Good?Texans know: These chewy, buttery beauties are a state treasure. But where did they come from?By Alex BeggsFebruary 13, 2020FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailLike you, the H-E-B flour tortilla has accepted the fact that it is imperfect. It’s okay with that. That’s part of the reason everyone loves it so much. Its little quirks. Like the lumpy, bumpy, not-quite-circular shape. Some air bubbles here and there. An edge that’s folded over a bit, like a teenage ear awaiting a piercing. These are signs that the precious H-E-B tortilla is homemade. Or as close to homemade as you can get in a 68,000-square-foot grocery store along the Houston interstate.My half-Mexican, very Tex-Mex mom used to make flour tortillas with an electric press. She’d roll balls of dough made with flour, salt, baking powder, warm water, and Crisco and let them proof into silky balloons under a towel. Then she’d set up an assembly line where my siblings and I would stand to the side while she pressed out the tortilla and then passed it to us. Well, it would have been an assembly line if we’d put them in the kitchen towel instead of eating them one by one. Sometimes we’d slather them with butter and chew them in front of the TV, not knowing how this stupid greasy moment would be one of life’s best.See what I mean about imperfection? Can relate.\nPhoto by Hayden SpearsWhen there wasn’t time for that cute glowing family portrait type of cooking, we bought similarly chewy flour tortillas at H-E-B. Our local store had people pressing them out—live! IRL!—right there in the aisle, surrounded by display tables of tortillas. They’d package the tortillas and stack them high in what Little Me thought was a tortilla fort. When you picked up a package, it would be warm and steamy. I’d clutch it to my chest like a heating pad. H-E-B had it all figured out.In fact, they’d figured it out decades before I even got there. Jorge Elizondo, H-E-B’s VP of Customer Insights, grew up in South Texas with a tortilleria three blocks away. “You would go there to find your flour or corn tortillas and then you'd go to H-E-B to do your grocery shopping,” he said. It was around 40 years ago that some savvy exec noticed the chance to fulfill two customer needs in one store. Now nearly every location—350 throughout the state of Texas and nowhere else—has an in-store tortilleria. (In 2006 H-E-B took it a step further by launching Mi Tienda, a Mexican grocery store with huge piles of dried chiles in the produce department and in-store taquerias. Catch me happily wandering the aisles with an XL foam cup of horchata whenever I’m back in Houston.)Elizondo’s parents are from Monterey, Mexico, where flour tortillas are a treat, corn tortillas the norm. He was eating an H-E-B tortilla with melted butter moments before I called him. “The first bite you take, you can smell the butter, you can taste the butter,” he said. “I was having it with a cup of coffee and the combination was reminiscent of many years ago with my parents.” I told him he was killing me.The H-E-B tortilla operation is a well-buttered machine. Roll dough balls, press, count, package.\nPhoto by Hayden SpearsAt 4 a.m. every morning, the bakers at H-E-B’s in-store tortillerias start pulling and pressing from a huge ball of dough delivered to the store from some place mysterious and, I assume, very sanitary. (Okay, it’s a bakery plant in San Antonio.) For the regular flour tortillas, it’s a mix of wheat flour, palm oil, salt, and leaveners. Depending on the store and its customer base, there might be three shifts of tortilla bakers to meet demand. Tortillas are pressed out by the thousands and packaged in bags of 10 or 20, separated with squares of tissue-like wax paper. If you ask a baker kindly for a sample, they’ll hand one over and you’ll say a quick prayer of thanks for your grocery store communion.Each store makes its tortillas a little differently. Some are thicker, thinner, smaller—or more haphazard, with those folded-over-ear edges customers write cantankerous Facebook reviews about. People, do you want carbon copy factory tortillas that taste like preservatives and plastic wrap?! I do not!When You Need a Tortilla...means what you really need is a bag of 20.\nPhoto by Hayden SpearsAll are slightly underbaked and on the pale side because the idea is you will go home and reheat them in a hot cast-iron pan or directly over the stovetop flame. Reality is, you will snack on a few in the car home because Houston traffic is ridiculous and they’re WARM (kept so in what looks like gas station ice cream coolers but are actually warm tortilla incubators). They’re floury and chewy and bendy. The regular flour tortillas are the top seller. (They cost between $2–$4.)  Whole wheat is the second most popular because people think they’re healthier. The ones made with butter are No. 3, but those are the inarguable best. They taste of butter. It’s one note, but the note is butter.After I moved to New York, I’d visit my sister in Houston and we’d hit up the H-E-B in Montrose so I could stock up on tortillas. I’d ask for them for Christmas, so my dad would mail them to me along with Bob’s Texas-style jalapeño kettle chips, paying more in express shipping than the cost of the contents within, unless you can put a price on nostalgia (it’s $26.84).The H-E-B flour tortilla is more Texas style than traditionally Mexican, but the recipe has changed in small ways over the years to reflect customer tastes—especially in areas of Texas with populations upward of 90 percent Mexican—and feedback from employees, some of whom come from Mexican families that have made tortillas for generations. As Elizondo puts it: “You have to have a great tortilla or you’re just not going to stay in business.” That’s why there are no longer artificial ingredients or preservatives in H-E-B’s tortillas.The problem is, H-E-B doesn’t sell any of its tortillas online. So the greatness, the mystique, the glory of the H-E-B flour tortilla has only grown in my memory the longer I’ve been away from Texas, in the way nostalgia can delude us. (I used to think my mom’s enchiladas were some gourmet shit—they’re just corn tortillas dipped in Old El Paso canned sauce.)H-E-B employees (called “partners”) are encouraged to give the store feedback and suggestions, which is how the tortilla recipe has evolved over time.\nPhoto by Hayden SpearsAnd sure, there are hoity-toity flour tortillas out there, like Vista Hermosa’s, which could probably take H-E-B’s in a duel, if it came to that kind of carb-on-carb violence. But the H-E-B flour tortilla is still the best supermarket-brand tortilla out there, easy. My love for them has not faded.Recently a friend went to Houston and asked if he could bring anything back for me. “H-E-B flour tortillas! This is not a drill!” I replied. He brought back two bags of 20, but one was down to 16 because he couldn’t resist snacking on a few on the plane. “Ughhhhh they’re sooo goooood,” he groaned in apology. I know, I know, I know.Alex Beggs is a senior staff writer at Bon Appétit.Want More Stories From Taco Nation? Right This Way...It’s Time We Give the Mexican Combo Platter the Credit It DeservesSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalAnd so much more!Explore Bon AppétitTaco NationTexasTortillasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Alex Beggs"]}