{"id": "71966e7f48b9f37dad6475338cab0b93", "url": "https://www.bonappetit.com/story/pinones-puerto-rico", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Home Is Where the Manteca Is: A Visit to Piñones in Puerto Rico | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHome Is Where the Manteca Is: A Visit to Piñones in Puerto RicoMy first stop off the plane in Puerto Rico is the roadside kiosk where the fried food is crispy and the beer is ice-cold.By Laia GarciaJune 6, 2018FacebookTwitterEmailPHOTO BY JAVIER J. FREYTESFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.As soon as the pilot announces that we are about to make our initial descent into the San Juan airport, I’m smiling with complete abandon. After the customary round of applause that signals a smooth landing, I look at my boyfriend, Jack, and squeeze his hand—it’s his first time coming to Puerto Rico and meeting my family.My mom picks us up and immediately asks the most mom question of them all: “Are you hungry?” Every time I fly home, there’s one essential first stop. We drive 20 minutes to Piñones, an area known for its beaches and mangroves, but more importantly, its fried food.Everything is deep-fried in lard.\nPHOTO BY JAVIER J. FREYTESSay you are going to Piñones, though, and everyone knows that where you’re really headed is the small stretch of route 187 dotted with little roadside kiosks that sell typical Puerto Rican food and beer. We call them chinchorros. They vary in size, from open-air restaurants to a few tables and chairs under a zinc or wooden roof. But the one thing they all have in common is a glass vitrine that displays the very-recently fried food. Everything is deep-fried in manteca, or lard. Hanging out at these spots is such an important part of our culture that we’ve turned it into a verb: chinchorrear, to spend a day going from kiosk to kiosk eating and drinking. Hurricane Maria hit this area pretty hard, but Puerto Ricans were already back in Piñones two weeks after the storm, seeking the thing that would make them feel human again.The place we always go.\nPHOTO BY JAVIER J. FREYTESWe arrive at El Rinconcito Latino, our usual spot. There’s loud salsa music playing, and just a few feet away, the sun shines bright upon the surface of the ocean.First, I order my favorite, a bacalaíto. It’s a golden brown deep-fried pancake-ish thing made from a mixture of cod and flour that’s generally bigger than my head. The woman behind the deep-fryer hands it to me on a napkin that’s already translucent; it’s no match for the grease that covers its surface. Sometimes I just eat around the bacalaíto, ripping all the super crispy edges first with my fingers so I get them while they are still hot and brittle. Then I give the leftovers to my stepdad, bless him. I wash it down with an ice-cold Medalla, a light Puerto Rican beer that may as well be our water.The alcapurria, in all its fried glory.\nPHOTO BY JAVIER J. FREYTESNext is an alcapurria, a long, dark-brown oblong cylinder of green plantain and taro root (although the best and rarest ones are made with yucca) that’s stuffed with ground beef or crabmeat. Jack douses the alcapurria with hot sauce and my stepdad hands him a beer.For the rest of the trip, Jack will ask if they have alcapurrias everywhere we go. I’m proud that it’s one of the first Spanish words he’s learned. Another round of Medallas. Another round of alcapurrias and bacalaítos. Our family cheers to the ritual indoctrination that’s taken place: Jack has passed the first test.Laia Garcia is the deputy editor of No Man’s Land.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsPuerto RicoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Laia Garcia"]}