{"id": "71a006fce760b8995d3b6c9a94eb8bbc", "url": "https://www.bonappetit.com/recipe/bird-of-paradise", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Bird of Paradise Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueBird of ParadiseBy Alex HolderJuly 10, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintKristen KilpatrickEmailPinterestPrintEmailPinterestPrint“This is our riff on the Jungle Bird, a classic tiki drink,” says Alex Holder from Pool Burger in Austin, TX. “The bitter flavors in the Aperol are a good balance to the sweetness. It benefits from pineapple wedges or pineapple leaves for garnish. Or stick as many swizzle sticks as you have in there.”Ingredients½cup sugar1oz. Aperol1oz. overproof rum1oz. pineapple juice½oz. fresh lime juice1pineapple leaf (optional, for garnish)PreparationStep 1Combine sugar and ¼ cup water in a jar, cover, and shake until sugar is dissolved.Step 2Combine Aperol, rum, pineapple juice, lime juice, and ¼ oz. syrup in a cocktail shaker filled with ice. Cover and shake vigorously 30 seconds. Strain into a glass filled to the brim with crushed ice and garnish with a pineapple leaf, if desired.How would you rate Bird of Paradise?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSo good. I usually skip out on the simple syrup as the pineapple juice is pretty sweet already. I've been using Plantation OFTD overproof rum. Cheers! ATLANTA10/16/2018Explore Bon AppétitCocktailDrinks AllCold DrinkAperolAlcohol & Other DrinksRumPineappleFruitQuickEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Alex Holder"]}