{"id": "71a97fb56e3d801a57232dfbe2eef605", "url": "https://www.bonappetit.com/story/just-buy-it-rolling-pin", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "The Best Rolling Pin Is Basically Just a Fancy Stick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Rolling Pin Is Basically Just a Fancy StickPut down the empty wine bottle and get a real rolling pin already.By Claire SaffitzDecember 1, 2021FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I know what the best rolling pin looks like. I’ve rolled out a lot of pie dough over the years, and in the process I have probably used every style of rolling pin—or improvised, on-the-fly hack—under the sun. I’ve used my grandma’s old rolling pin with the internal ball bearings (nostalgic but not great). I’ve tried a newfangled model that can be filled up with ice water, ostensibly to keep the butter in the dough cold (gimmicky and annoying). And, finding myself at a vacation rental or the house of someone who never bakes, I’ve definitely used my fair share of empty wine bottles (rustic yet surprisingly workable).After all those trials, I have concluded definitively that the best rolling pin is a straightforward, no-nonsense dowel-style wood rolling pin, also known as a French rolling pin. Nothing else, no matter how complicated or “ergonomically designed” offers the same ease of use and control as one of these dead simple non-gadgets. It may be little more than a rounded cylinder of wood—a glorified stick, really—but it is the only rolling pin that needs to exist. It’s the best rolling pin there is for working with pie crust, cookie dough, puff pastry, and everything else. And I believe it can’t be improved upon.Photo by Chelsie CraigFrench Rolling Pin$17 at Amazon$17 at Sur La TableWhat even is a French rolling pin?Unlike traditional American rolling pins (a.k.a. handled pins or ball-bearing pins), which have a center cylinder that rolls between two handles, French-style rolling pins consist of a wood dowel and nothing else. No internal ball bearings, no handles. Just a straightforward, no-nonsense cylinder. You’ll find French pins in two different forms: straight pins and tapered pins. While some home bakers and pastry chefs prefer using straight rolling pins because of the ease with which they roll out dough to even thickness, others prefer using tapered rolling pins because they’re easy to hold and maneuver, allowing you to pivot directions (and eliminating the need to lift your dough off the countertop and rotate).J.K. Adams Maple Plain Rolling Dowel$31 at Amazon$17 at Sur La TableWhat makes French rolling pins the best?The simple design of these rolling pins provides the least possible barrier between your hands and whatever type of dough you’re rolling out, allowing you to feel what’s happening underneath as you apply pressure. In the case of pie dough, this helps you to sense if you’re rolling out the dough to a uniform thickness—which, as every baker knows, is crucial for even cooking. A dowel-style pin is also super sturdy, making it a versatile tool that’s equally good for crushing ice cubes or pulverizing graham crackers into crumbs as it is at beating stubborn dough into submission. Don’t bother with plastic or stainless-steel or marble rolling pins, which always end up being too lightweight or too heavy.These basic pins are typically made of smooth walnut or maple wood, which allows them to glide easily through your hands, and they’re also easy to hand-wash because there are no hidden nooks for flour to hide in. The J.K. Adams rolling pins have great heft, and, at under $20, will last you a lifetime. But because the whole point of a French rolling pin is its simplicity, if, for whatever reason, you don’t like the J.K. Adams model, there are plenty of other options to choose from. If you regularly take on larger projects like, say, a slab pie, just make sure you buy one that’s at least 18\".ArtisanThese hand-turned rolling pins from Vermont are beauts and feature dramatically tapered ends. Choose from cherry, maple, or walnut.Vermont Rolling Pin$45 at The GrommetSustainableIf sustainability is top of mind, the Wooden Palate’s French rolling pins are made from wood reclaimed from the Atlantic City Boardwalk. And GoodWood’s pins are fashioned out of hardwood scraps from the NOLA design-build firm’s furniture and fabrication projects.The Wooden Palate French Taper Rolling Pin$50 at GoopGoodWood Rolling Pins$35 at Good WoodPreciseFor baking projects that require precision, Five Two’s adjustable rolling pin takes the guesswork out of rolling your dough to the correct height and width. Subtle laser-etched measurements on the pin—listed in metric and imperial—eliminate the need for a separate ruler. You can also switch among the five silicone dishwasher-safe removable rings to get the exact height you need so that each batch of buttery sugar cookies comes out identical.Five Two Adjustable Rolling Pin$39 at Nordstrom$39 at Food52MiniBigger is not always better, at least when it comes to kitchen tools. For dainty dumplings, tiny tarts, and empanadas, BA contributor Hetty McKinnon recommends a mini rolling pin, like this one in beech wood. These pins, sometimes referred to as Chinese rolling pins or dumpling rolling pins, are just like other dowel-style rolling pins but a lot shorter and thinner. The smaller design gives you more control and makes it easier to maneuver with one hand, so you can use your other hand to turn the dough while you roll.Photo by Isa ZapataThin Wooden Dowel$11 at AmazonOr you could cop one of these antique mini pastry pins from Bretagne. It doesn’t get more French than that.Antique Patisserie Mini Wooden Rolling Pin$29 at EtsyWhichever rolling pin you choose, make sure to care for it the way you would a wood cutting board or salad bowl. A regular wipe down with Boos Block Mystery Oil will set you up for smooth rolling for years to come.John Boos Mystery Butcher Block Oil$14 at AmazonNow put the wine bottle in the recycling and go make a galette: Strawberry–Graham Galette\"Galette\" is just a fancy word for \"a pie that's practically impossible to mess up.\"View RecipeThis piece was originally published in 2018 and was updated in 2021 by Tiffany Hopkins.Explore Bon AppétitToolsBA RecommendsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-17", "author": ["Condé Nast", "Claire Saffitz"]}