{"id": "71ad9df2d2435927ef1775f54005e1d9", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/ask-for-luigi", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Ask for Luigi Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverAsk for LuigiEat all the fresh pasta in Railtown’s most charming spaceFacebookPinterestTwitterEmailChris GiannakosGO HERE: for plates of Ask for Luigi’s fresh pasta in a space you’ll mistake for East Vancouver’s most lovely (and tiny) home.ORDER THE: daily pasta and, if you have room for it, the raisin-studded Sicilian-style meatballs for sharing; soft-boiled eggs with anchovies, caviar, and grilled bread; spaghetti nero with octopus and puttanesca sauce; bocconcini fritti (for all the fried cheese lovers out there); and a slice of olive oil cake to finish. To drink, try something from their concise but discerning wine list or ask for a spritz.THE VIBE IS: intimate and gracious. The staff moves efficiently through the small area, delivering plates of refined Italian comfort food. Families line up early for celebratory dinners, and there are usually at least a few well-behaved children slurping back noodles or peeking into the kitchen: The morning’s labors—flour-dusted spaghetti nests and rows of fat ravioli—are usually visible through the pass.PRACTICAL STUFF: Open: Tuesday to Friday, from 11:30 a.m. to 2:30 p.m. and Tuesday to Thursday, 5:30 p.m. to 10 p.m.; Friday and Saturday, from 5:30 p.m. to 11 p.m.; and Sundays, from 5:30 p.m. to 9:30 p.m. On the weekends, there’s brunch, from 9:30 a.m. to 2:30 p.m. Closed Monday. No reservations, so arrive early, put your name down, and then head to Vancouver Urban Winery for a drink while you wait.—Lindsay AndersonChris GiannakosChris GiannakosWE ALSO LOVEDon’t Argue! Very good pizza and people-watching at this casual Mount Pleasant jointKissa TantoChinatown’s critically acclaimed Italian-Japanese restaurant worth dressing up forLa Grotta Del FormaggioAn old-school Italian deli on eclectic Commercial Drive for sandwich savantsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}