{"id": "71ae859be122366535abe35fb39ac415", "url": "https://www.bonappetit.com/story/never-fail-cheese-twists", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "These Cheese Twists Are My Dinner Party Ace in the Hole | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Almost Set My Kitchen on Fire Making These Cheese Twists, But I Still Love ThemFire or nah, these cheese twists are still my dinner party ace in the hole.By Elaheh NozariJune 22, 2018FacebookTwitterEmailPhoto by Chelsie Craig, styling by Judy ManciniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.You know that feeling when you think you're out of toilet paper, but then you look under your bathroom sink and realize you have one more roll? That's how I feel when I'm prepping for a dinner party, panic that I haven't made enough food, then look in my freezer and find a box of puff pastry. I'm saved.I've made all kinds of puff pastry appetizers in my life—some based on recipes, others dictated by the contents of my refrigerator—but the one that hungry guests freak for the most is this crispy cheese twist recipe. Also known as a \"cheese straw\" in some circles, the mighty cheese twist is a simple but powerful union of cheese and buttery, flaky dough. Given the ingredients, it scientifically cannot taste bad—and the most recent time I made them, which happened to be last Saturday night, is definitive proof. Allow me to explain.I was going to a potluck and started to worry that the Greek grain salad I had made wouldn't be enough. (I get potluck anxiety, but that's another story.) With about four hours until go-time, I peeked in my freezer and saw—you guessed it!—a beautiful box of puff pastry, shining like a beacon. There wasn't much to work with in my refrigerator, but my cheese drawer was flush. All signs pointed to cheese twists.Rule number one when baking with puff pastry is to let the dough defrost slowly in the refrigerator overnight. I didn't have time for that so I, uh, improvised. I set it on the warm counter and poked it every five minutes until it seemed pliable enough to be rolled out without cracking. It ended up getting a little too warm, so whenever I felt like the dough was getting too soft while I was rolling it out I put it in the refrigerator to firm up a bit. Definitely not the most ideal situation, and I'm not going to tell you not to bother thawing puff pastry in the fridge overnight, but it worked for me!Rolling out that puff pastry dough is probably the most labor intensive part of the cheese twist process.\nPhoto by Laura Murray, Styling by Ali NardiAfter rolling out the pastry sheet and layering it with an egg yolk mixture, grated cheese (I used a deliciously sharp pairing of cheddar and Parmesan), salt, and pepper, I cut it into thin strips and twisted the ends until each one resembled a straw. They didn't all look the same—some were tight twists, others were a bit looser—but, in my experience, as long they maintain their overall long-and-thin integrity all will be well.I had no trouble forming the twists, but then I messed up big time. You're supposed to bake them on a parchment paper-lined sheet pan, but I wasn't paying attention and accidentally placed them on wax paper. About two minutes after putting them in the oven, my kitchen started to smell like a birthday candle, which I admittedly first found ironic because I was making them for a birthday party. Long story short, I quickly transferred the partly-cooked twists to a non-stick baking sheet (I was out of parchment) and, 15 minutes later, they came out of the oven like nothing had happened.It wasn't a perfect baking experience to be sure, but the moral of the story is that no matter how far you stray from the recipe instructions, these cheese twists still rule. At the potluck, people continued to eat them even after the main dishes had been brought to the table. I know because I watched every single guest who ate one like a hawk, fearful that someone would make some comment about a waxy aftertaste. Let's just say this: There were no cheese twists left behind.Get the recipe:Crispy Cheese TwistsStore-bought puff pastry + shredded cheese = the easiest, flakiest, most irresistible dinner party snack of all time.View RecipeExplore Bon AppétitBasicallyNever FailCheesePuff Pastry DoughRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Elaheh Nozari"]}