{"id": "71c033aa0811872295a71222962d15bc", "url": "https://www.bonappetit.com/recipe/beef-and-ginger-stir-fry", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Beef and Ginger Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueBeef and Ginger Stir-FryBy Andy BaraghaniAugust 13, 20194.4(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWant to become 1,000 percent more efficient in the kitchen? Take a cue from restaurant chefs and set up all of your mise en place—that would be your ingredients, sliced and measured out—before you start cooking. You’ll go from raw ingredients to a glossy stir-fry in the time it takes to make a pot of rice. How convenient.Ingredients4 servings1lb. skirt steak, trimmed, sliced against the grain into ¼\"-thick strips, patted dry1tsp. sugar1tsp. toasted sesame oil1tsp. plus 1 Tbsp. soy sauce1tsp. kosher salt, plus more1Tbsp. vegetable oil1medium sweet onion, sliced into ½\"-thick rounds13\" piece ginger, peeled, very thinly slicedFreshly ground black pepper3Tbsp. unsalted butter, cut into pieces1Tbsp. fresh lemon juiceCooked rice (for serving)PreparationStep 1Toss steak in a medium bowl with sugar, sesame oil, 1 tsp. soy sauce, and 1 tsp. salt to coat and let sit 20 minutes.Step 2Place a large skillet over high heat. Pour in vegetable oil and swirl to coat bottom of pan. The oil should be shimmering and you should see some wisps of smoke—if it’s not hot enough, the meat will steam instead of getting deeply browned.Step 3Add steak to skillet in an even layer (it’s okay to crowd it a bit) and cook, undisturbed, until brown around the edges, about 2 minutes. Turn steak over and add onion, ginger, lots of pepper, and ⅓ cup water. Cook, tossing often, until onion is just tender and ginger is softened, about 2 minutes.Step 4Remove skillet from heat and add butter, lemon juice, and remaining 1 Tbsp. soy sauce. Toss until butter is melted and coats steak. Taste and season with more salt if needed.Step 5Divide rice among bowls and top with beef stir-fry.How would you rate Beef and Ginger Stir-Fry?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleReally tasty! I took the advice from the other reviews and seared the steak, removed it from the pan, cooked the onions and ginger then put it back in. I definitely recommend that instead of cooking the veggies totally separately-- they need to cook with the bits of steak and marinade. RBLos Angeles, CA2/16/2022Let me start by saying that is always helpful to read the reviews as well as the entire process through before starting to cook with that said the reviews in this specific recipe we're quite helpful in the fact that I seared the meat quickly for a minute or two and then removed it keeping it warm and began cooking the onions and ginger once they had cooked a bit I added the meat back and water and followed the rest of the process through to good results the meat was tender but the meal in general lacked flavor this recipe is a good starting point however to build your sauce in any direction you would like to take it spicy or more of a mushroom beef sauce whichever direction you want to go this basic recipe is a good starting point and being this was the first time I worked with skirt steak I took the advice that was included in the directions a step farther I spread the steak out and using a fork I raked the fat out of the meat leaving small amounts behind for the cooking process raking through the grain of the meat and then cutting the pieces against the grain as directed in the recipe this I felt really added to the tenderness of what I had read could have been a tough piece of meat if not properly handled before the cooking was done with that said I will use this recipe again it is as I said previously a great starting pointAnonymousPa.11/15/2020Added a bit of garlic (because— garlic!) and some chilies. Fantastic! Make this regularly now. Everyone loves it.sandyceeCanada4/27/2020Wish that I had cooked the onions first - only because maybe if I had cooked the steak last I would not have overcooked it and the onions would jammy. flavor is good, just not sure about the process. jesssssssseIndiana 4/8/2020This was so good! Everyone raved. To add some heat, I chopped up a few dried Thai Chile’s and added them to a bowl with the soy sauce that I added at the end. AnonymousLafayette, Ca4/6/2020This was so simple and good. Used a little filet I had in the freezer. Would add a little heat at the end with sambal or something. I pulled the meat after the sear so I could cook the onions as others did. Leaving the steak in would have overcooked it, especially the cut I used. Seattle3/15/2020great! just what i would get from a asain restaurantryeguy123nova scotia12/29/2019This recipe was just fantastic - so gingery and delicious. It’s probably my favourite SE Asian-inspired recipe that I’ve made Yet. I just added some garlic to mine, because I have to have garlic in everything I make. Next time, I’ll make it with brown rice and some broccoli to make it even more “healthy”. AnonymousCalgary, AB12/21/2019I was excited to see this dish recognized as Filipino Bistek in the year end round up but am very disappointed that it's not referenced at all in the recipe.  How sad. MQAvatarWashington, DC12/20/2019The fact that this is just Filipino bistek should be acknowledged on the actual recipe page. Not just on the year-end round up. Anonymous12/20/2019Great recipe. Very tasty and not overly complicated at all. Served with boo choy and white rice. Next time I’ll sub brown sugar and use a tad more to thicken the pan sauce a bit. \nThis is a definite make again. kmiller0193Clearwater, Florida12/4/2019Really good! I made it with venison. Anonymous11/25/2019This is a keeper! So easy and I still can’t believe the flavour!  I cooked my onion and ginger first as others suggested. Will make again and again. AnonymousRothesay, NB, Canada 11/21/2019This was dinner last night and it was spectacular. It was rich and interesting without being too heavy, which is a hard balance to strike. In the spirit of transparency, I used some mediocre (non-skirt) steaks that had been taking up room in my freezer, and had no regrets. Also cut the ginger into matchsticks for my texture-averse spousal unit. I had intended to put a splash of sesame oil in (though I hate the stuff), but I must've tossed my bottle of it in a rage, so we went sans sesame. I added a little extra soy sauce to make up for any lost moisture, and a bit more lemon juice at the end for brightness and it was stupidly delicious. \n\nAs Rapo suggested, I sautéed the onions & ginger in a separate pan while the steak was searing and combined them when I added the water to the steak. Everything was done at the same time - no harm, no foul. \n\nIn summary, A+, would devour again. In fact, will devour again in about 3 hours, because leftovers. AnonymousSyracuse, NY11/20/2019This is the kind of recipe that I love and want to find on here! No fuss and ingredients that I don't have to scour the earth to find. Anonymous9722911/19/2019Explore Bon AppétitStir-FrySteakBeefMeatGingerHerbs & SpicesOne-Pot MealsWeeknight MealsQuickEasyMainHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Andy Baraghani"]}