{"id": "71d7540602f88fd33e04548bafc83476", "url": "https://www.bonappetit.com/story/rattlesnake-drink-never-fail", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Make a Rattlesnake Drink For the Name Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cocktail Is Called the Rattlesnake, and That’s Reason Enough to Make ItOther reasons include: whiskey, lemon, and that foamy top. By Alex BeggsApril 17, 2020FacebookTwitterEmailTed CavanaughFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I recently watched the 1951 classic Ace in the Hole and the sheriff in the movie carries around a rattlesnake in a shoebox for some reason. He struggles to find foods the snake will eat and the snake ends up liking chewing gum in foil wrappers? It has nothing to do with the rest of the movie. Just like this intro has nothing to do with the point I’m here to make, which is that the cocktail called the Rattlesnake is a good drink and I have a feeling you might like it as much as I do.The exact right time to make a Rattlesnake is 4:59 p.m. By the time I’m done shaking the drink for 30 seconds (to get the egg whites properly foamy), it’s actually 5, the unofficial official cocktail hour of the nation. Or at least according to all of the wall décor at HomeGoods.If you’re not a person who makes cocktails at home, now seems like a good time to give it a go. This counts as a hobby. And most classic cocktails are three ingredients, which is a lot less than bolognese!The Rattlesnake is an old-school drink from the Savoy Cocktail Book that promises “it will either cure a rattlesnake bite, or kill rattlesnakes, or make you see them.” It’s whiskey, lemon juice, simple syrup, absinthe, and egg whites. I’ve had a cute mini bottle of St. George absinthe for like, seven inexplicable years, and this is the ONLY THING I do with it. Swirl the absinthe in the glass, dump it out, and a whiff of licorice remains. That said, you can absolutely make this drink and love it forever without the obscure liquor, though purists might say it’s then an entirely different drink. In cocktail land, there are many rules waiting to be broken.Like if I’m too lazy to make simple syrup, I’ll do a squeeze of honey or put the sugar in the shaker and hope it dissolves enough. It always does! And if you’re like, I don’t have egg whites lying around, Beggs! Well make some damn chocolate chip cookies! Because the egg whites make a creamy top layer that tingles my imaginary mustache, and combined with the lemony whiskey, the whole thing reminds me of a creamsicle.It’s refreshing and mysterious (that absinthe), and it looks refined as hell. Someone around here has to!Now get the recipe:The RattlesnakeView RecipeExplore Bon AppétitNever FailCocktailWhiskeyLemonRead Moreculture24 Classic Cocktails You Need to Know How to MakeGallery24 SlidesBy Bon Appétitrecipes22 Amazing Whiskey Cocktail RecipesGallery22 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-17", "author": ["Condé Nast", "Alex Beggs"]}