{"id": "71dd2784cc890ec6f639473bb67e1e70", "url": "https://www.bonappetit.com/story/how-to-make-your-potatoes-crispy", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Crispy Potatoes: Everyone Wants Them, But How Do You Get Them? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Your Potatoes CrispyGive! the! people! what! they! want!By Sarah JampelNovember 11, 2021FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmail“Crispy potatoes.” Are there any two words in the English language that grab my attention faster? (Okay, “mozzarella sticks.”) If a restaurant menu or a recipe title claims superlatively crispy potatoes, I’ve gotta try them. I’m legally obligated.Even if you prefer creamy mashes or al dente stir-fries, crispy potatoes have a certain allure—perhaps because, like crispy tofu, they tend to be elusive. They play hard to get: Too often they’re brown but not crisp (looking at you, mushy hash) and, maybe more offensive, bland-tasting. So how do you make crispy potatoes, especially if you’re not about to commit to setting up a deep fryer? While there isn’t one right way (such is life), we have found that there are a few key steps that put crispy potatoes within reach.1. Choose your potatoes wisely.If we had to pick just one potato to cook for the rest of our lives (but please, don’t make us!), it might just be Yukon Golds. Easy to find and extremely versatile, they’re just as good for mashing as they are for roasting. They might never become shatteringly crisp on the exterior, but their insides are likely to stay creamy and dense.Russets, on the other hand, are higher in starch—they can get super crusty (in a good way) while maintaining a fluffy, light interior (like the soft, almost airiness of a thick french fry). Because they have a tendency to fall apart, however, they require a more delicate hand and care taken to not overcook.Then you’ve got the little guys. Waxy and dense, they’re easy to boil or steam whole (see below!) and then smash and crisp. Fingerlings and new potatoes are good candidates but because they’re not as starchy as russets, aren’t likely to get quite as—excuse this second instance—crusty. And, of course, if you’re shopping at a farmers market where potato varieties abound, simply ask the purveyors what they like best.2. Cook them twice.Because potatoes are dense, with a relatively low water content compared to vegetables like broccoli or winter squash, they take a while to cook. If you roast them at too high a temperature, you risk browning the outsides before the insides are cooked through. Cook them for too long at a lower temp, though, and they may dry out (telltale signs: leathery, tough) on their way to Tender Town.Most often, then, the solution to evenly cooked potatoes is cooking them twice: First, boil, steam, or steam-roast (a fancy term for cooking them with water in the oven) until they’re mostly tender but not fall-apart finished. Second, brown the outsides and finish cooking the interiors on the stovetop or in the oven.3. Let them cool, if you can bear it.Not only does that initial cook guarantee that your potatoes will ultimately emerge 100% tender, it also allows the starches in the potato to soften and expand. Then, when that potato cools, the starch recrystallizes, giving you, in the words of J. Kenji López-Alt in The Food Lab, “a dehydrated layer of gelatinized starch [...,] much like when you fry a french fry.” The clumped starch mixes with the fat—more on that below—to form a “potato-oil paste” that “acts almost like a batter for fried foods, creating an extra layer of crispness as the potatoes roast.”Sure, if you’re trying to go from raw potato to dinner in under an hour, you might not have time to let your potatoes cool. But there’s also power in the knowledge that the bowl of boiled potatoes in the fridge from Sunday can become orbs of crispy goodness on Wednesday and will actually yield better results. (Now that’s what I call meal planning!)4. Rough them up.The math is simple: More surface area = more opportunities for starches to mingle with fat = more contact between hot pan and your potato = crispier all over. So while you can slice potatoes cleanly or leave them whole, the potatoes that are rough around the edges produce the crispiest results.You’ve got options for how to create that craggy, uneven surface. If you’re using pieces of russets, like in Chris Morocco’s Burnished Potato Nuggets, toss them vigorously in the still-hot pot after you’ve boiled and drained them: Not only does this motion dry them out, it also releases starch and damages their smooth surface. The effect is potatoes so crispy, you’d almost think they were battered or breaded. When you’re working with small potatoes, as in Molly Baz’s Crispy Smashed Potatoes with Walnut Dressing, split their skin and expose their creamy interiors by smooshing the whole spuds under the weight of a baking sheet or heavy pan.5. Add lots of fat.Now’s not the time to skimp on the fat (even if you’re using an air fryer!). As Harold McGee explains in On Food and Cooking, fat—be it oil, lard, duck fat, ghee, coconut oil—plays two key roles: It helps the food get hotter, making it brown and cook through more quickly, and it participates in the molecular reactions (think caramelization and the Maillard reaction) that create a distinctly richer flavor. Fat for the win! Coat your potatoes well in your fat of choice, keeping in mind that low smoke-point fats, like butter, are not ideal for high heat situations and should be added towards the end.6. Get your pan H.O.T.Whether you’re going to be using the stovetop or the oven, give your potatoes a head start by adding them to a hot pan. Let your cast iron hang out for a few minutes over high heat or——a great trick for any roasted vegetable where burnished edges are the goal—place your baking sheets in the oven while it gets up to temperature.7. Step away from the spatula.A particularly difficult tip for all of us pickers and prodders (poke, poke, poke) but an important one: In order to develop crisp edges, your potatoes must have sustained contact with the hot surface. In other words, no touchy! Give the potatoes time to get nice and familiar with that sheet tray or skillet—in a single layer, please!—before scooting them around. If your potatoes threaten to stick (drats!), take a deep breath and step away for a minute or so: They’ll release when they’re ready and if you force them, they just might leave all of those crispy edges you’ve worked so hard to achieve behind. And we all know the pan will never appreciate them as much as you will.Graduation:Smashed and Loaded Crispy PotatoesCooking potatoes twice—once in water, and a second time in hot oil—is hands-down the best way to achieve extra-crispy potatoes at home.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-11", "author": ["Condé Nast", "Sarah Jampel"]}