{"id": "71ec9cf0ee863dce2397407ebf302616", "url": "https://www.bonappetit.com/story/grandpa-ultimate-thanksgiving-doer", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "If You Need Something Done on Thanksgiving, Ask My Grandfather | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You Need Something Done on Thanksgiving, Ask My GrandfatherFrom trimming brussels sprouts to washing dishes, no task is too thankless for my family’s ultimate doer.By Amanda ShapiroNovember 7, 2018FacebookTwitterEmailIllustration by Jan BuchczikFacebookTwitterEmailIn Thanksgiving, as in life, there are delegators and there are doers. Delegators assign. They’ll tell you to bring the cranberry sauce, they’ll tell you when it’s time to serve the pie, and they’ll make you write place cards even though you’re all family and no one needs to be told where to sit.The doers in my family, and I count myself among them, are extreme. We say “Give me a job” like if you don’t comply we’ll fall into a pit of uselessness. This makes for quite a scene at Thanksgiving, all of us hovering over each other, going out to get extra ice when the freezer is clearly full, taking a single seltzer can out to the recycling bin so as not to burden anyone else.We learned this behavior from my grandfather. He and my grandmother were the ultimate delegator-doer pair. She navigated; he drove. She set the menu; he was her sous. They played a lot of doubles tennis, and I can only imagine how it worked on the court. (Maybe there’s a reason my grandfather switched to golf.)Our Thanksgivings weren’t always in the same place, but my grandfather’s role was always the same. He’d tie on an apron and start washing and peeling the potatoes—the third worst Thanksgiving task. He’d peel every pearl onion—the second worst job. In between, he’d handle the brussels sprouts, rinsing and trimming and scoring the bottom of every one. The worst Thanksgiving job, obviously, is doing the dishes. Of course, he handled that too, washing every piece of silver by hand.Amanda and her grandfather on Block Island, Rhode Island, in 1996.\nCourtesy of Amanda ShapiroOver the years we’d try to beat back my grandfather from the kitchen. We’d get him to sit on the couch with the newspaper and a glass of wine, but inevitably, 20 minutes in, he’d be up and pacing again. “What can I do?”As my grandparents got older, they traveled less and less, spending Thanksgivings at their retirement home instead. My grandfather bred a pretty neurotic bunch of doers, but even we couldn’t match his dedication to the most loathed, least appreciated jobs. Our potatoes were pockmarked with errant knife stabs, our brussels sprouts trimmed carelessly and one time not at all.In the last couple years, my grandmother had a series of falls that left her frail. She became even more of a delegator and my grandfather even more the vigilant doer. He’d set the table in their kitchenette for the next day’s breakfast as soon as that day’s was done. When my grandmother was moved to a different wing for round-the-clock care, he’d spend all day fetching one thing after another from their apartment at the slightest suggestion of need: a pack of tissues, another sweater, her favorite comb. It seemed a little masochistic, all this doing, but it also seemed like the only thing keeping him sane.When someone you’ve cared for dies, there are plenty of logistics to handle, but there is also, suddenly, very little to do. Since my grandmother died last spring, my grandfather—chief executive doer for 67 years of marriage—has been grieving, as expected. He’s also been learning to not do. Every day he sits in his armchair and meditates. He goes to Quaker meetings. When we visit, he allows us to do things for him, running errands, making his breakfast toast. And if we’re lucky, he lets us wash the dishes when he’s done.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Amanda Shapiro"]}