{"id": "71ffafd3b8b362981a02483c1625cd34", "url": "https://www.bonappetit.com/story/happy-joes-taco-pizza", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "I Pine for Happy Joe’s Taco Pizza, the Culinary Relic of My Iowa Youth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Pine for Happy Joe’s Taco Pizza, the Culinary Relic of My Iowa YouthI regularly fantasize about pizza with refried beans on it.By Ann FriedmanJune 6, 2018FacebookTwitterEmailPhoto by Jennifer SilverbergFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.When you grow up in a small town, progress is marked by the arrival of new national chains. But the opening of a new Panera or Chipotle is a fleeting thrill. A deeper source of pride lies in regional restaurant franchises. And none is more beloved in eastern Iowa than Happy Joe’s Pizza & Ice Cream. Founded in 1972 by a man named Joe Whitty who was “not unhappy,” the primarily Midwest chain offers a signature Canadian bacon and sauerkraut pie (“Sounds unique, tastes great!” the website says reassuringly) and a BLT pizza that my father loves, which features more Canadian bacon, plus lettuce, tomato, and a mayo drizzle on top.Happy people at Happy Joe's.\nPhoto by Jennifer SilverbergBut its crown jewel—and best seller—is the Taco Joe pizza. I regularly fantasize about this pizza, which I order whenever I’m home to visit my family. I’ve forced many friends and lovers who grew up outside the Central time zone to try this feat of Midwest culinary innovation, and they invariably hate it—even, improbably, the stoners. But my taste buds developed in symbiosis with taco pizza, so it will always be delicious to me. It is my Proustian madeleine, carrying me back to the ’80s and ’90s in eastern Iowa.The taco pizza is a textural experience. It’s crispy on the bottom and puffed around the edges, blistered with a thin layer of tomato paste. Above that, refried beans, cheese, and tomato sauce melt together into a gooey sameness. Then there’s seasoned ground beef and sausage (although you can also order it without the meat, which I always do) topped with crunchy lettuce and cubed tomato. And, over everything, a blanket of crispy slightly crushed tortilla chips. These chips are the subject of much local speculation. They might be Doritos “taco” flavor or perhaps a generic “nacho cheese flavored chip.” Online, some have wondered if they are a proprietary item made just for Happy Joe’s, but that theory doesn’t hold up. A regional pizza chain is not manufacturing its own flavored tortilla chips. (Update: The chips are, the chain confirms, \"a proprietary item made just for Happy Joe's.\")Check out that taco sauce.\nPhoto by Jennifer SilverbergBut let’s not get distracted by the chip question. Taco pizza is defined by what is not on it: cilantro, avocado, lime, jalapeño, nor any other type of chile. Capsaicin is not part of the taco pizza experience. The accompanying Spicey [sic] Joe’s taco sauce has a mild, almost ketchup-y flavor and comes in packets whether you eat in the pizza parlor or take your order to go. (Online, however, it is available in bottle-size quantities from Amazon, where a satisfied customer raves, “If you are from Iowa - this is the best sauce for TACO PIZZA!!! or just plain tacos.”) As a child I was too unexposed to global culinary traditions to realize that taco pizza, with or without its Spicey Joe sauce, is the flattened flavor of white people adjusting another culture’s food to our palate. I wonder how it tastes to kids growing up in Iowa these days, who are much more likely to have eaten Mexican food made by Mexican people. Between 2000, the year I graduated high school, and 2016, the state’s Latino population grew 121 percent. Taco pizza is a regional relic.There's Happy Joe Whitty himself.\nPhoto by Jennifer SilverbergOf course, I’m sure many white Iowans don’t see it that way. Each pizza box is festooned with a cartoon likeness of the chain’s founder and namesake, Happy Joe Whitty (who was a former Shakey’s Pizza manager). He is a dead ringer for Terry Branstad, whose first tenure as Iowa governor, from 1983 to 1999, coincided with my entire childhood. Branstad was reelected to the governorship in 2010 and made headlines a few years later for dismissive comments about immigrant kids. By then, I’d become one of the many college-educated young people to leave my state and join the taco-pizza diaspora. Now, after years of enjoying the considerably spicier regional foods made by people who hail from thousands of miles away, the Spicey Joe sauce barely registers on my tongue. I squeeze it onto the mystery chips and lick it off my fingers anyway, enjoying taco pizza for what it is but recognizing what it is not.Ann Friedman is a writer and co-host of the podcast Call Your Girlfriend.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Ann Friedman"]}