{"id": "7203e4360bdb58ae3f8e4128e30c6689", "url": "https://www.bonappetit.com/recipe/all-as-spring-salad-with-mahi-mahi", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "All A’s Spring Salad With Mahi-Mahi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueAll A’s Spring Salad With Mahi-MahiBy Brigid WashingtonApril 20, 20215.0(27)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintBlistered asparagus, creamy avocados, and spicy arugula (the A’s that star in this salad) come together in minutes for a simple, anytime-of-day meal. Mahi-mahi fillets get a heavy brushstroke of good Dijon mustard before roasting for 10 minutes—which is how much time you’ll need to throw together the salad. Feel free to swap out the mahi-mahi for halibut, salmon, or your favorite fish fillet.Ingredients4 Servings46-oz. skinless, boneless mahi-mahi fillets, patted dry2Tbsp. plus ¼ cup extra-virgin olive oil, dividedKosher salt, freshly ground pepper1Tbsp. plus 2 tsp. Dijon mustard, divided1lemon1bunch asparagus (about 1 lb.), trimmed½tsp. honey1avocado, thinly sliced1bunch mature arugula, trimmedPreparationStep 1Preheat oven to 425°. Place mahi-mahi on a rimmed baking sheet and rub all over with 1 Tbsp. oil; season on both sides with salt and pepper. Brush or rub fish on both sides with 1 Tbsp. plus 1 tsp. mustard. Using a Microplane, finely grate zest of lemon over fish. Set lemon aside.Step 2Bake mahi-mahi until opaque throughout and flesh flakes easily with a fork, 8–10 minutes.Step 3Meanwhile, heat 1 Tbsp. oil in a large skillet, preferably cast iron, over high. Cook asparagus, turning occasionally, until blistered in spots, about 4 minutes total; season with salt.Step 4Remove mahi-mahi from oven. Cut reserved lemon in half and squeeze juice from 1 half over fish. Squeeze juice from remaining half into a medium bowl (catching any seeds with your other hand). Add honey, remaining 1 tsp. mustard, and remaining ¼ cup oil and whisk until smooth; season dressing with salt and pepper.Step 5Add avocado and arugula to dressing and toss gently to coat. Taste salad and season with more salt and pepper.Step 6Divide fish and asparagus among plates and scatter salad on top.How would you rate All A’s Spring Salad With Mahi-Mahi?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis was amazing!!  I used butter lettuce (we just like it better), and actually roasted the asparagus along with the mahi.  It was so delicious and a fast, easy fix!!  Will DEF be making it again!!  JillianJacksonville, FL2/23/2022Wow just discovered my new fav way to make asparagus, so simple and tasty. I used what fish was fresh at my market which was salmon and it came out perfect! Also such a good and quick salad dressing to whip up for future salads. So glad I found this recipe!DomLos angeles6/10/2021Great recipe! Very easy! Would make a good weeknight meal! Thanks BA!Nathan koenegsteinJackson, tn6/8/2021Really, really good. I made it with sockeye salmon pieces and did all the cooking on an outside grill (early June heatwave...stove/oven forbidden). Served with a baguette and some special olive oil alongside. Satisfying. This will be in summer rotation with the fish of the moment.\n\nAnonymousCanada6/4/2021This was super great! Impressed with how all the flavors came together, with not one overpowering the other. Couldn't find mahi mahi at the store, so substituted with tilapia and it was delicious. Really light and healthy dinner that fills you up. Was super easy to prep for and cook. LizzieMonterey, CA6/3/2021I have made this several times with different fish - Barramundi is especially good! So simple and so delicious, this is one of my go-to's when I want a quick and healthy meal.elcoverWilmington, DE5/17/2021This recipe is amazing! I hardly ever cook halibut but it came out perfect using this recipe.I used a large spoon and pushed on each fillet to test for done-ness (learned from another BA recipe). I am also on a GERD restricted diet so lemon was out and instead, for the dressing, I replaced with a dry white wine and  went without lemon on the fish and it was still so flavorful. Thanks for a great dinner!Lees-Lees V.Phoenix, AZ4/25/2021Explore Bon AppétitSaladMahi-MahiFishSeafoodAsparagusVegetableAvocadoArugulaLeafy GreensSpringQuickEasyWeeknight MealsMainGluten-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Brigid Washington"]}