{"id": "7203b4490e6b05f372e504536d9b4ded", "url": "https://www.bonappetit.com/story/epic-friendsgiving", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "How I’m Throwing a Truly Epic Friendsgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I’m Throwing a Truly Epic FriendsgivingThere will be no turkey and lots of dumplings.By Christina ChaeyNovember 13, 2021FacebookTwitterEmailPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeFacebookTwitterEmailThese days my mind is singularly consumed with throwing the Friendsgiving of my dreams in a new apartment. Like so many others, I haven’t thrown a dinner party on this scale in years. And while I might be a little rusty on the party-planning front, here are a few ways I’m planning on making the evening extra special:Who needs a turkey?I actually happen to be one of the four people alive who actually LOVE turkey, especially when it’s spiced and glazed. But in a year when everything has felt far from ordinary, it feels right to bring something different to the table. (Or, at least, to the Friendsgiving table. You try telling my mother you want to make a duck for Thanksgiving this year.) I’m covering the mains at my Friendsgiving—I’m thinking of this home-cook-friendly take on Peking duck paired with fresh moo shu wrappers from Kristina Cho’s incredible new book Mooncakes & Milk Bread, plus the Palestinian sumac roast chicken called musakhan.Fire up the Google spreadsheetI sent out a signup sheet to all our guests this week by making a simple Google spreadsheet. I listed the dishes I’m planning to make and left places for people to write in their name, what they’re bringing, any dietary restrictions they have, and whether or not they’re also planning to bring a beverage, which may have been a slightly passive aggressive way of saying, All the wine, please. So far friends have signed up to bring everything from this mushroom Wellington(!) to pumpkin pie. I’m already hungry.Think outside the cheese plateI will always hard-pass on the bland wedges of generic Brie in favor of an appetizer that’s as festive as it is appetite-whetting. I also appreciate an app that takes very little time to put together, which is why this year I’m planning on pan-frying and steaming some Fly By Jing dumplings, opening a jar of Zhong Sauce, and calling it a day. I doubt anyone is going to miss the cheese. Bonus: Preparing dumplings is simple enough that if I’m busy with other things, I can delegate it to a friend without having my control-freak instincts kick in...too much.Ask people to BYOD and BYOTAnd by D and T I mean dishes and take-out containers. Extra serving vessels and utensils, wine glasses, a giant cooler or ice bucket for drinks—if you don’t have them, ask friends to bring them. The take-out containers are for everyone to pack up the leftovers of their choice at the end of the night.Say yes to help...Some of my best dinner party memories are from nights when I was running behind schedule and needed to pull in a few extra hands to get everything on the table. If there’s a simple prep task that can be done easily (and not too messily) by the masses—picking herbs, spinning salad greens, arranging flowers and lighting the candles—put them to work. If they’re good friends, they’ll be more than happy to pitch in....including the dishesAfter the clock strikes 12 and I’m a pumpkin on my nth glass of wine, my love language is someone else doing the dishes (or loading the dishwasher). I bet it might be yours too—you’ve earned it.Nothing but the Hits:Photo by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiCheesy Cabbage GratinSimple Is Best DressingRice Pilaf With Lemony Brown-Butter MushroomsBitter Greens With Cranberry DressingCranberry-Lime PieRoasted Brussels Sprouts With Gochujang Brown ButterExplore Bon AppétitWhat's Chaey Cooking?cookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-13", "author": ["Condé Nast", "Christina Chaey"]}