{"id": "72041550a7e92aa91368b3d836827359", "url": "https://www.bonappetit.com/story/benchwarmers-bagels-raleigh", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Benchwarmers Is Having the Most Fun with Bagel Sandwiches | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYes, There Are Potato Chips in Your Very Crunchy Bagel SandwichAt Benchwarmers Bagels, the menu is a study in the number of textures and flavors you can cram in one bite.By Rachel KartenApril 9, 2019FacebookTwitterEmailPhoto by Owen S. JordanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.At Benchwarmers in Raleigh, NC, they take their bagels seriously. They use fresh-milled Red Turkey wheat and Einkorn. The dough goes through a three-day fermentation process. They bake everything in a 10,000-pound, ripping hot wood-fired oven. And then they stuff their No. 5 bagel sandwich with Lay’s Kettle Cooked potato chips. Because, thankfully, they don’t take themselves too seriously.The sandwich has a creamy smoked fish spread (done in-house, in that same wood-fired oven), trout roe, house-made pickles, and a handful of Lay’s chips. The result is a study in the number of different textures you can physically fit between two pieces of chewy bagel: There’s the creaminess of the fish spread, the crunch of the chip, the pop of the roe, plus the snap from the pickle. Together, it’s chef’s kiss.You can find this mix of seriousness and playfulness, high and low, all across the menu. It’s there in the peanut butter, banana, and roasted mallow sandwich, and in the fried bologna, yellow mustard, and egg combo. Could they have made their own potato chips for the No. 5? Of course they could. But where’s the fun in that?Go there: BenchwarmersExplore Bon AppétitHighly RecommendRestaurantsNorth CarolinaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Rachel Karten"]}