{"id": "720a296bd823b9cef1f9b4d42814438f", "url": "https://www.bonappetit.com/recipe/blueberry-spelt-muffins", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Blueberry Spelt Muffins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBlueberry Spelt MuffinsBy Roxana JullapatJanuary 12, 20214.7(43)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“It’s time to give the classic blueberry muffin a makeover,” writes Roxana Jullapat in her cookbook Mother Grains (out April 2021). She swaps out refined white flour for nutty, whole-grain spelt, a type of wheat that’s loaded with fiber, iron, and manganese. Spelt behaves similarly to all-purpose flour (but has more flavor!); you can swap it in a 1:1 ratio in most baked goods other than bread. Notes for this recipe: Jullapat prefers to use frozen blueberries because the fruit doesn’t get smashed while mixing the batter. If you’re using fresh berries, just fold them in extra gently. Don’t skip the spelt streusel topping. It adds delicious crunch to your muffins and helps keep them moist longer.IngredientsstreuselNonstick vegetable oil spray (optional)3Tbsp. spelt flour2Tbsp. granulated sugar2tsp. dark brown sugarPinch of ground cinnamon2Tbsp. chilled unsalted butter, cut into ½\" piecesmuffins1½cups (195 g) spelt flour1tsp. baking powder½tsp. baking soda¼tsp. ground cinnamon¼tsp. kosher salt1large egg⅔cup (packed; 133 g) dark brown sugar⅓cup vegetable oil⅓cup buttermilkZest of 1 lemon½cup (85 g) fresh or frozen blueberriesPreparationStreuselStep 1Place a rack in middle of oven; preheat to 350°. Lightly coat a standard 12-cup muffin pan with nonstick spray or line with paper liners. Whisk spelt flour, granulated sugar, brown sugar, and cinnamon in a medium bowl. Add butter and toss to coat. Working quickly, smash in butter with your fingers until pieces are about pea-size. Chill streusel until ready to use.MuffinsStep 2Whisk spelt flour, baking powder, baking soda, cinnamon, and salt in a medium bowl until there are no lumps. Make a well in the center with your hands. Whisk egg, brown sugar, oil, buttermilk, and lemon zest in a small bowl. Pour into well and whisk to combine. Using a rubber spatula, gently fold in blueberries. Evenly divide batter among 8–10 muffin cups, filling each with about ¼ cup batter. Top each muffin with about 1 Tbsp. streusel; bake, rotating pan halfway through, until golden brown and a tester inserted into the center of a muffin comes out clean, 24–27 minutes. Let muffins cool in pan 20 minutes. Turn out onto a wire rack; let cool completely.Do ahead: Muffins can be baked 2 days ahead. Store airtight at room temperature.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Blueberry Spelt Muffins?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI have many food sensitivities and wonder what you would substitute for the egg?\nCheryl StephensWest Kelowna, BC, Canada.9/19/2021I bake two batches of these muffins weekly.  One batch I bake for myself which  I place in my refrigerator freezer and take out one daily.\nWhen my neighbour, Donny, was diagnosed with cancer, I took her over a batch of these muffins that I had just baked and she couldn't stop raving about them.  \nSo, the second batch, I bake for my neighbour who currently is undergoing cancer treatment; I make her a batch of twelve, and she loves them so much, she devours them within three days.AnonymousToronto, Canada6/12/2021Excellent recipe! This is my first time working with spelt, and these are the best muffins I’ve ever made. The texture is perfect- they have nice integrity and are just moist enough. I like that they don’t fall apart.\nI was able to substitute vegan butter in the streusel and oat milk with lemon juice for the buttermilk and they came out perfectly. Definitely saving this and making these again KateFlorida 4/18/2021Such a great go-to recipe! I've made them four times each time modifying the ingredients. \nI give them to my kindie and I don't think he needs that amount of sugar. I replace the 2/3s sugar with 1/4 and I replace the oil with apple sauce. Not as decadent as the original receipt but still great. \nIf I were making these for guests I would stick to the original ingredients. avesCanada3/2/2021I made these last night and we were going to try just one, had to have another. I like these much better than white flour blueberry muffins, they have a more complex flavor and the spelt doesn't taste noticeably strange like I was expecting. Mine came out moist and springy, not crumbly or dry, with a good rise. I really focussed on not over-mixing and all of my ingredients were room temperature. The recipe produced 9 medium sized muffins with good tops.YVT2/24/2021These were wonderful despite the fact that I didn’t have  spelt (thought I did)) so substituted rice flour and a small amount of whole wheat. They were yummy, with a nice chew inside. I did have to keep them in. The freezer as they tended to dry out.AnonymousPawtucket, RI2/19/2021These were very easy and really good - loved by all I shared them with. They made 8 good size muffins in an old-fashioned 8-well tin with cupcake liners. I used only 80g of sugar (plus the additional in the streusel) and the sweetness level was perfect. As I didn't have spelt (I know, the point of the recipe) I used a combination of (locally milled) whole wheat and buckwheat. I agree with others who suggested more berries - I threw in quite a bit more and wouldn't have minded more yet. I will definitely be making these again.JennieOakland, CA2/16/2021Delicious! And, easy to prepare. We used a silicone muffin pan sprayed with Baker's Joy, no sticking at all. \n Made with the streusel, will skip next time (we think merely topping with some  turbinado sugar would work beautifully). Do **not** skip the lemon zest, really raises the flavor profile.  Recipe is a keeper.Anonymouscenteroftheuniverse2/4/2021Delicious!  I doubled the blueberries and was glad I did (may even triple next time).  The spelt flour has a nice texture and loved the touch of lemon zest - really elevated these muffins.tarabrooklyn, ny1/27/2021These are delicious!! Full of flavor.  Mine sunk in the middle - but I think my oven isn't hot enough. I'll make again and up the temp. They are quite crumbly. I used liners and agree with Soapnana that that's the way to go. Easier to eat with a fork, but worth the extra dishes!BSUTOmaha, NE1/25/2021These are so delicious and so easy! I happened to have spelt flour lying around from another recipe so this was a great way to use it. I definitely didn’t read ahead enough and thought the batter was supposed to stretch into 12 muffins, but luckily I caught the note once I got to 10 and was about to start stealing batter from the other cups to fill the whole pan. These muffins are very delicate and a little tricky to get out of the pan without ripping them, so next time I’d probably use liners instead of spraying the pan. Love the taste and the crunchy topping.SoapnanaChicago, IL1/18/2021I’m fairly new to baking but not to cooking. So baking muffins was the obvious way to get started. I’ve changed many muffin recipes from regular all purpose flour to whole wheat or spelt and it works very well. This recipes adds buttermilk so thanks for that and the streusel.DZurich Switzerland1/12/2021Explore Bon AppétitMuffinPastriesBlueberryBerryFruitButtermilkOther IngredientsEasyNut-FreeBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}