{"id": "720bab62f0f87944fae5c2fc8f57bbda", "url": "https://www.bonappetit.com/story/le-creuset-french-press", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "My Le Creuset French Press Symbolizes Everything I Love About Adulthood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingMy Le Creuset French Press Symbolizes Everything I Love About AdulthoodThe best gift my roommate ever gave me was a sense of home. The second best gift was a Le Creuset French press.By Anna FitzpatrickFebruary 23, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now. Next up, writer Anna Fitzpatrick makes the case for her beloved Le Creuset French Press.I grew up in a large, loud, close family. Doors were always open, conversations were shouted between rooms, personal space nonexistent. When I moved out—first to a dorm, followed by an apartment near campus with my best friend, and then to an attic in a house downtown occupied by Craigslist strangers—I cherished the independence that I was never afforded growing up. But it came at the cost of instability and more than occasional bouts of loneliness. My kitchen appliances were mostly sourced from Ikea, cheap and functional enough to make the three vegan recipes I knew.When I was 24, one morning I was in a shop that specializes in whimsically curated cookbooks and cookware, looking at a Le Creuset baking dish that cost half my rent and imagining the ways in which a person must have their life pulled together to own such a thing. A friend of mine was working in the store and she asked me how I was doing. I shared with her my current landlord woes. I would have to leave my attic apartment the following month and I had no idea where I would live next. “You should talk to Lara,” she said, motioning to her curly-haired coworker behind the cash register. “She needs a roommate.”I moved into Lara’s apartment that May. The kitchen was the main feature of the place, spacious and filled with natural light, shelves lined with cookbooks. She had an eye for mid-century cookware, and her collection of vintage pieces was supplemented with recent acquisitions purchased with her employee discount. She treated cooking as a pleasurable act, one in which she invested great care. I put my Ikea pots and pans in the storage closet.She came home from work one day with a Le Creuset French press in its since-discontinued bright green Palm shade. My old drip coffee maker was acting up, so I asked her if I could use it. “Help yourself,” she said. Lara was always generous with sharing her stuff, and besides, she explained, she preferred her pour-over coffee anyway. From that morning, I quietly adopted the French press as my own, and she quietly let me.Roommates are often treated as a stopgap measure, a living arrangement to be endured in your 20s before moving in with a partner or living alone. In my noisy childhood home, my bedroom was a private sanctuary. I knew I never wanted to share a room with somebody, but I valued knowing there was always someone next door to keep me company. Each morning when I use the French press, I am reminded that it was brought into my life by a person who represents the comforts of home—who isn’t family but feels like she is.I am 31 years old now, and Lara and I have lived together for nearly seven years. My morning routine has remained fairly consistent. I wake up, amble into the kitchen, turn on the kettle, and scoop several heaping tablespoons of coffee into the French press. I pour in a little hot water to give the grinds a chance to bloom (another trick my roommate taught me) before filling it up. Lara is usually nearby, prepping the travel mug she takes to work. We chat for a few minutes, fill up our mugs, and go our separate ways.Photograph by Isa Zapata.  Food Styling Kat BoytsovaLe Creuset Stoneware French Press$80 at Amazon$80 at Bed Bath & Beyond$80 at Sur La TableExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-23", "author": ["Condé Nast", "Anna Fitzpatrick"]}