{"id": "721159d6cce643d52520264e35b150ba", "url": "https://www.bonappetit.com/recipe/mussels-in-spicy-tomato-broth", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Mussels in Spicy Tomato Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMussels in Spicy Tomato BrothBy Claire SaffitzApril 3, 20184.3(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintMussels are a steal compared to most fresh seafood options, and cook in practically no time at all—a weeknight dinner dream. Be sure to buy rope-grown mussels, which require a lot less cleaning and are virtually free of grit, and always check each individual bivalve to make sure it's closed tightly before cooking—it's a little tedious, but one dead mussel will ruin the whole pot.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAColander$11 At AmazonLarge Bowl$18 At AmazonLarge Pot$55 At AmazonWooden Spoon$6 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonLadle$8 At AmazonIngredients4 servings7garlic cloves, divided1celery heart13\" piece ginger, scrubbed4lb. mussels3Tbsp. unsalted butter½cup mirin (sweet Japanese rice wine)⅓cup sambal oelek¼cup plus 1 Tbsp. low-sodium soy sauce128-oz. can whole tomatoesKosher salt½cup mayonnaise½baguettePreparationStep 1Prep your ingredients before you start cooking: First, peel and set aside 1 garlic clove for the mayo, then peel and smash remaining 6 garlic cloves.Step 2Pick any leaves from 1 celery heart. Thinly slice celery heart crosswise (making little half-moons) until you have about 1¼ cups. Set aside ¼ cup chopped celery along with leaves for serving.Step 3Peel 3\" piece ginger. Set aside a ½\" nub for later, then cut remaining piece crosswise into thin slices.Step 4Rinse 4 lb. mussels in cold water and remove the “beard” (that thread-like piece attached to the side of the shells) by tugging firmly. If any mussels are open and don’t close when tapped, discard. Drain and transfer to a large bowl.Step 5Heat 3 Tbsp. butter in large pot or Dutch oven over medium. Add smashed garlic, sliced ginger, and 1 cup chopped celery and cook, stirring often with a wooden spoon, until garlic is golden, 5–8 minutes.Step 6Add ½ cup mirin, ⅓ cup sambal, and ¼ cup soy sauce and bring to a simmer. Cook, stirring once or twice, until mixture is reduced by about half, about 5 minutes.Step 7Add 28-oz. can tomatoes and juices to pot, breaking up tomatoes with your hands as you add them, and bring to a simmer. Season lightly with salt. Let simmer, uncovered, to allow flavors to meld, about 5 minutes.Step 8Add mussels to pot and stir into tomato mixture. Cover pot and cook, stirring once halfway through, until mussels are opened and fully cooked, 6–8 minutes.Step 9Meanwhile, finely grate reserved garlic clove and ½\" nub ginger into a small bowl. Add ½ cup mayonnaise and remaining 1 Tbsp. soy sauce and stir to incorporate.Step 10Preheat broiler with rack in top position. Cut ½ baguette in half lengthwise and toast, cut sides up, directly on oven rack, until bread is golden across the surface, about 1 minute. Let cool.Step 11When mussels are opened, uncover and remove from heat. Ladle into shallow bowls along with tomato mixture. Top with reserved chopped celery and leaves.Step 12Tear bread into pieces and smear toasted sides with mayonnaise mixture. Serve with mussels for soaking up liquid.How would you rate Mussels in Spicy Tomato Broth?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is for Anonymous who struggled with the mussels.  Just keep trying.  Mussels will taste totally different depending on what your base is or what kind of mussels you get.  I am partial to Prince Edward Island mussels.  I think the most common way you have mussels in a restaurant is with basic white wine, garlic,  parsely, and lots of butter,  broth.  Using a beer recipe, or a tomato recipe completely changes the taste. It's worth figuring out how to do this, it's what I get asked to bring to all the pot luck, summer get togethers.BieckiVT1/21/2022I didn't have Mirin or oelek, so i substituted it for a splash of beer (about 3/4 cup) and 1 cup of marcella hazan tomato sauce, plus some mexican crushed chile de arbol,(you could use aleppo) it was amazing!!!!edgarg3729Madrid4/19/2020I really struggled here. Normally I have no issue following Bon Appetit and basically recipes, but mussels are such an unfamiliar and intimidating ingredient and I really felt like there was no guidance here. It took multiple google searches to figure out how to properly store and clean them, and how long they keep fresh. All my mussels were alive and seemed fine according to the recipe, but they didn't taste like mussels I've eaten in restaurants. Out of fear of giving myself food poisoning, I threw out the rest after eating a few. Really disappointed, since I spent $20 on them.AnonymousColumbia, SC1/14/2020The broth here is epic. Will most definitely be cooking this again- a great balance of spicy, tangy and fresh.cerclehuitLos Angeles 9/4/2019Just finished the whole bowl of this. It’s simple and delicious. Thanks BAHayatiIndonesia 2/3/2019Explore Bon AppétitMusselShellfishSeafoodCanned TomatoTomatoVegetableOne-Pot MealsWeeknight MealsMainNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-03", "author": ["Condé Nast", "Claire Saffitz"]}