{"id": "7212f73b12b68432f69a35c22aa16c5b", "url": "https://www.bonappetit.com/story/best-canned-tomatoes", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "How to Buy the Best Canned Tomatoes at the Store | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Are the Only Canned Tomatoes You Should BuyWhether you're making pasta sauce, soup, or shakshuka, one can really does rule them all.By Alyse WhitneySeptember 8, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailIn our dreams, fields of vine-ripe tomatoes line every sidewalk, pots of water are already boiling whenever we crave pasta, and dinner makes itself on our most exhausted days. Unfortunately, 2018 isn’t at that level of agriculture or smart home automation yet, but there is a way to have tomatoes at the ready any time of year. We love using canned tomatoes for pasta sauces, soups, pizzas, braises, and generally anytime we’re cooking tomatoes down. They’re not made for slicing and topping sourdough toast, or chopping up for a salad, but they are an ideal pantry staple for that weeknight pasta pomodoro. In fact, they’re better than fresh tomatoes for cooking whenever it’s not peak summertime.Walk into any grocery store and you’ll find an entire aisle of tomato products. So, what are the best canned tomatoes to buy? Easy: whole peeled. Every time. You can make them into anything you want from there, whether it’s crushed for a sauce, in pieces for a soup, or left whole to gently simmer until they break down naturally.Canned tomatoes make 30-minute shakshuka possible.\nAlex LauIt’s tempting to grab crushed or diced tomatoes in a can, because it seems like less work for you to do. But those cans—especially diced—often have additives like calcium chloride that are thrown in to help the pieces hold their shape. That means that diced tomatoes won’t break down properly and melt into your sauce or stew, and you’ll be left with big chunks of tomatoes.Instead, buy a can of whole peeled tomatoes and crush them yourself. Use our easy crushing method to not splatter tomato juice all over yourself in the process.Canned tomatoes are picked and canned at the peak of ripeness, and their skins are removed by steaming or other machine processing. On a label, you want to see the fewest ingredients possible: tomatoes (usually small romas, but they also sell cherry, salt (but not too much sodium so you can season yourself), and water or tomato juice. A little citric acid is okay because that's part of the canning process, but if you see basil, pepper, garlic, high fructose corn syrup, or any other preservatives you can’t pronounce, find another can. You want them to be as bare bones as possible so you can add the seasonings that you want in the cooking process.You can (and should) use canned tomatoes for our new pasta pomodoro recipe.\nPhoto by Heidi's BridgeThe only way to find your ideal brand of canned tomatoes is trial and error. A good judge of quality is if the label says D.O.P. San Marzano, which means the tomatoes were certified to be grown and canned in within a specific Italian region, and are held to a specific set of standards. They will definitely be bright, full, and sweet, but usually more expensive—about $5 or more per can. However, there are cans that say San Marzano but don't have the D.O.P. (“protected designation of origin”) label; tomatoes can be San Marzano-style because San Marzano is also a varietal of tomato that is known to have less seeds and is meatier in texture than a roma. It is very confusing. It's best to look at the labels for a slim ingredient list, or splurge on D.O.P. if you can afford it. We find Muir Glen, to be a quality USA-grown, organic, widely-available brand. (You can buy a 12-pack of cans for $28 on Amazon.)Whether you’re making pasta sauce, trying your hand at a homemade stromboli, or making shakshuka for brunch, reach for humble, dependable canned tomatoes. Maybe one day we’ll have tomato-lined streets, but until then, keep your can opener nearby.Now go make the best and easiest canned tomato sauce of your life:Basically Spaghetti PomodoroAlmost as easy as opening a can of the store-bought stuff, and one hundred times more delicious.View RecipeExplore Bon AppétitPastaTomatoTomato SauceBasicallyShoppingRead MorecookingHow 6 Chefs Doctor Up Canned TomatoesBy Alyse WhitneyshoppingCanned Cherry Tomatoes Exist and Our Food Editors Love ThemBy Elaheh NozaricookingCanned Tomatoes Are Better Than Fresh Ones (Yeah, We Said It)By Alex DelanycookingHow to Crush Tomatoes While Wearing a White ShirtBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-08", "author": ["Condé Nast", "Alyse Whitney"]}