{"id": "7222f8f479532a3ee64ffdc871215362", "url": "https://www.bonappetit.com/story/alelia-walker-radical-dinner-parties", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "A'Lelia Walker's Dinner Parties Were Radical Acts of Black Joy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Secret Radicalism of A’Lelia Walker’s Dinner PartiesThrough her famed salons the beauty heiress and socialite provided a space of refuge for those on America’s margins.By Mayukh SenOctober 14, 2021FacebookTwitterEmailPhoto from Carl Van Vechten/Yale Collection of American Literature/Beinecke Rare Book and Manuscript Library/Illustration by Brittany Holloway-BrownFacebookTwitterEmailThis story about A’Lelia Walker is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.Around 4 a.m. one August day in 1931, heiress and socialite A’Lelia Walker bolted awake, startled, thinking she’d lost her vision. “Mamie, I can’t see,” she said to a friend, pleading for some ice. A’Lelia was staying in Long Branch, New Jersey, where she had been a guest at a birthday celebration. Just hours before she’d indulged in pleasures like lobster, chocolate cake, and champagne. A doctor surmised that “she had probably suffered a stroke from too elaborate a dinner,” according to the Baltimore newspaper Afro-American. A’Lelia died an hour later of, in truth, a reported cerebral hemorrhage. She was just 46.From today’s remove, it feels morbidly poetic that A’Lelia’s death was, quite literally, brought on after too extravagant a feast: In her lifetime, A’Lelia made a name for herself hosting lush meals at her two Harlem residences and her mansion on the Hudson River, Villa Lewaro. Through these parties she established a public identity independent of her mother, the legendary entrepreneur Madam C.J. Walker, a poor child of formerly enslaved parents who became a titan of the Black hair-care industry and had a seven-figure net worth.A’Lelia honored Black artistry at these salons. She festooned the walls with quotations and poetry from luminaries like Langston Hughes and Countee Cullen; she prominently displayed a cabinet of books by Black authors.During the fecund years of the Harlem Renaissance in the 1920s, A’Lelia entertained throngs of intellectuals and artists with song, dance, and foods. Pianists usually provided the soundtrack for these evenings; performers like the jazz giant Alberta Hunter and the baritone Broadway star Jules Bledsoe would enchant guests with their singing, while actresses like Fredi Washington would dance for onlookers. A’Lelia’s menus offered potato soufflés, salmon mousse, and crushed strawberry ice cream. Her indefatigable spirit as the hostess led the writer Langston Hughes to dub her the “Joy Goddess of the Harlem Renaissance” in his 1940 autobiography The Big Sea.Many, though not all, attendees came from America’s margins: They were Black, queer, sometimes both. “A’Lelia Walker had a wide range of friends including many artists, writers, musicians and actors as well as the circle of professional men and women who belonged to the Black middle class in Harlem, Chicago, Philadelphia, Baltimore, Atlantic City, etc.,” A’Lelia Bundles, her great-granddaughter and author of the forthcoming biography The Joy Goddess of Harlem: A’Lelia Walker and the Harlem Renaissance (Scribner), says in an email. “Some of those friends happened to be queer. They were there because she enjoyed their company and appreciated their talent.”Writers and journalists now recognize A’Lelia’s fêtes as sites of queer refuge and Black joy in times of great strife for those communities. But this development is relatively recent. In the decades following her death, A’Lelia routinely faced accusations from scholars that she was riding the coattails of her mother’s philanthropy or that her parties were empty displays of capitalist excess. “Whereas Madame Walker had been civic-minded, donating thousands of dollars to charity, A’Lelia used most of her inheritance to throw lavish parties,” the queer historian Eric Garber wrote in 1989. Such dismissals ignore the fact she funneled money into social service organizations, for one, but they also misread the quiet radicalism of A’Lelia’s project. Her parties provided a sanctuary from the violence of the era.A’Lelia was born on June 6, 1885 in Vicksburg, Mississippi, as Lelia McWilliams—the A’ would come later, in 1922, for reasons unknown—when her mother was just 17. Her father, Moses McWilliams, would die just three years later, leaving her mother to raise A’Lelia alone. She came of age in St. Louis, near where her mother’s siblings lived. The elder Walker toiled away as a washerwoman, determined not to let her daughter suffer the same cruelties of her impoverished childhood.Her mother would build a hair-care business from the ground up in the years that followed, and A’Lelia spent much of her time helping maintain it. The two women were close, almost suffocatingly so, according to Bundles’ 2001 biography of the elder Walker, On Her Own Ground (which inspired the fictionalized 2020 Netflix miniseries Self-Made). As she grew into adulthood, A’Lelia sometimes felt that her mother’s love hindered her, even when she married and adopted a daughter of her own.A’Lelia’s parties gave her the autonomy she craved. As early as 1914, just after putting down her roots in Harlem, she was hosting dinner soirées with composers, magazine publishers, and realtors in her West 136th Street townhouse. Frequently hiring Black caterers, according to Bundles, A’Lelia would serve delicacies like watercress sandwiches, boned capon, and orange cake. As these parties grew in size, her personality became a draw, with a 1916 Indianapolis World piece characterizing her as a “genius” whose presence “permeates the atmosphere.” A’Lelia cut a striking figure, often sheathing her head in turbans that made her look taller than her 5'9\" frame.What guided these parties was a sense of freedom. ​​“There was men and women, women and women, and men and men, and everyone did whatever they wanted to do.”Only on occasion would the mask slip, revealing the private distress A’Lelia carried with her. In his autobiography, her friend Hughes would recount a time when, mid-party, A’Lelia started to cry about an ex-husband, retreating to her room and cradling a gold shoehorn her former lover had left her with. “The only thing I have left that he gave me,” she reportedly said. “It’s all I have left of him!”Her mother’s death in 1919 made her sink into grief, but her parties gave her purpose. Though A’Lelia became the Madam C.J. Walker Manufacturing Company’s president after that occurrence, she wanted to stand on her own. She held vibrant affairs throughout the 1920s, when the Harlem Renaissance was in full bloom. Specifics mattered to A’Lelia—especially the food. “A’Lelia Walker was very intentional about preparing the details of her parties,” Bundles says. “The menus. The caterers. The guest lists. The invitations.” The designs of some of these invitations were spare but evocative: “May your lives be filled with music,” one fold-out invitation for a 1923 Christmas dinner reads, the front of the card bearing the words “Merrie Xmas” in elegant typeface. The menu for that evening mentions venison, bacon, and filet mignon; an October 1926 luncheon reportedly contained clam broth, lobster, and alligator pear (that is, avocado) salad.In 1927, A’Lelia attempted to formalize her functions by establishing a membership club called the Dark Tower. One menu reveals the wealth of foods she charged for: cream of tomato or celery soup for $0.25; coconut cake for $0.30; cream cheese, guava jelly, and toasted crackers for $0.75. On these evenings, she’d invite artists to her townhouse to dance, play cards, or just talk, as the writer William Pickens observed in a 1928 account in the New York Amsterdam News. “It matters not to what “race” one belongs, provided he belongs to the human race and can behave humanly,” Pickens, who was Black, wrote. But A’Lelia honored Black artistry at these salons. She festooned the walls with quotations and poetry from luminaries like the aforementioned Hughes and Countee Cullen; she prominently displayed a cabinet of books by Black authors, a symbolic gesture that asserted the inherent worth of this literature.The Dark Tower closed down a year later, too pricey for a consistent crowd to attend. “Having no talent or gift, but a love and keen appreciation for art, The Dark Tower was my contribution,” A’Lelia wrote to guests in October 1928 when she shut its doors. But other parties continued there and at A’Lelia’s other residences. She often handed out hundreds more invites than she could accommodate. Her salons, colloquially called “at homes,” attracted esteemed figures like the actor Paul Robeson, the writer Zora Neale Hurston, and the photographer Carl Van Vechten. What guided these parties was a sense of freedom. ​​“There was men and women, women and women, and men and men, and everyone did whatever they wanted to do,” one frequent attendee, Mabel Hampton, said in 1983.But calamities beyond A’Lelia’s control extinguished her light. The 1929 stock market crash put a dent in the Walker Company’s sales, forcing her to put Villa Lewaro on the market and rent out her Harlem townhouse. Her parties continued—one March 1931 afternoon featuring the opera singer Minto Cato was “too swell for words,” per Afro-American—but A’Lelia reportedly grew despondent over her finances. She suffered from physical ailments too: Effects from a 1924 stroke lingered, and her climbing blood pressure led to medical warnings about her eating that she allegedly failed to heed. Her funeral drew thousands. Just like her parties, the invitations far outnumbered what the venue could hold.In spite of such public affection, vocal critics of A’Lelia emerged in the years after her death. One paper’s account of her funeral observed the presence of her ill-wishers who “smiled scornfully” when the topic of her “social leadership” came up, as “one knew that they were thinking of other women whose brilliantly intellectual qualities, highly polished and superficial culture, so-called background, or supposedly great family inheritance, perhaps better qualified them to be society leaders.” Though it is unclear whether those detractors came from within her community or outside of it, some Black writers would openly pillory her in the years to come. The journalist Roi Ottley pegged her with the pejorative “Mahogany Millionairess” in 1943, chiding her for spending money “recklessly.” Others have claimed that she had a mere seven-minute attention span, which Bundles says “​​does not scan with what I have learned after decades of research or with what her friends conveyed to me when I interviewed them in the 1980s.” These persistent misperceptions even extend to the food. Bundles questions the veracity of one prevalent anecdote that alleges her great-grandmother saddled white party guests with chitterlings and bathtub gin while her Black guests enjoyed champagne and caviar. She says she has been unable to find any credible primary sources to support such a claim.It has taken some time for the historical record of A’Lelia to be corrected through the attentive work of scholars like Bundles, whose personal connection to her subject (and namesake) has fueled her mission to represent the story in its fullness, along with amplification by journalists. A’Lelia “fostered joyful resistance and a sense of sanctuary from racial terror,” writer Jamia Wilson posited in Refinery29. These days it might be easier to see A’Lelia as one of American history’s numerous Black women scrutinized and censured for accruing wealth in a system designed to limit their material possibilities. Looking at A’Lelia’s work in this more appreciative light, then, makes the significance of her get-togethers even clearer. She provided a haven against anti-Black racism and homophobia: ills that continue to afflict the country today. The dinner party continues to hold unique power for Americans who live outside the dominant culture, seeking a reprieve from the world’s violence.But the reason why A’Lelia hosted these parties at all might be even simpler. “With all of this big house and a nice income and above all a wonderful mother, I am so alone in the world,” A’Lelia once despaired.​ For a time, she built a world where she, and others, could feel less alone.Explore Bon AppétitDinner PartiesPartiesCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Mayukh Sen"]}