{"id": "7225a5439abf67c55f81d7907d6c59d0", "url": "https://www.bonappetit.com/story/our-favorite-healthyish-dishes-you-can-now-order-from-caviar", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Our Favorite Healthyish Dishes You Can Now Order From Caviar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredOur Favorite Healthyish Dishes You Can Now Order From CaviarBy Caviar March 27, 2018FacebookTwitterEmailFacebookTwitterEmailWe’re obviously advocates of eating healthy and cooking at home, but we get it, sometimes there’s nothing better than being able to hit that delivery button after a long day at work. The good news? It’s even easier to keep your healthyish vibes flowing with the brand new collection of restaurants that deliver good-for-you-food-that-also tastes-good. We teamed up with Caviar, so it’s easier for you to eat what you love and choose from a variety of dishes—some super healthy and others -ish—that you can order right to your door. Whether you’re in L.A., NYC, SF, Portland, Philly or DC we’ve got you covered with Healthyish, delivered. Now, since we’re all hungry, here are a few of our favorites.The Feel-Good Veggie Centric L.A. Hotspot and Their GF Avo ToastLos Angeles has been committed to the wellness movement and health forward restaurant concepts for years, and Honey Hi is a current breakfast and lunch fave in Echo Park. They focus on using the very best local and organic ingredients sourced from neighboring farms, and the entire menu is gluten- and refined sugar-free. The feel-good cafe offers a variety of colorful bowls topped with various seeds and spices, but for a perfect kick-off to the morning we love the sweet potato and avocado toast with paprika-roasted sweet potatoes, lemon avocado mash, scallion, pickled onions, sumac, and herbs on gluten-free sourdough. So, basically, it’s anything but “basic.”The Stellar SF Fried-Chicken Sandwich You’ll Dream About Eating AgainYes, we did say some dishes would be healthy and some of them more, -ish! Award-winning restaurant Rich Table’s casual spinoff RT Rotisserie in Hayes Valley serves some of the most mouthwatering rotisserie chicken that’s made in-house with free-range Rocky birds from nearby Petaluma. Before they are roasted, they’re brined in buttermilk, brushed with a rich and smoky garlic oil, and finally seasoned with herbs. Though you can order your chicken in a variety of preparations—with sauces and sides or as a sando—we have to tap the Sally Hurricane’s Southern Fried Chicken Sandwich as a can’t miss choice. The crispy fried chicken is paired with charred cabbage, pickled onions, and chipotle yogurt on a toasted kaiser bun. Winner, winner.Yes, Please! The Best Ramen in Portland Delivered Right to Your DoorWhen it comes to a dinner delivery we crave, there’s nothing better than a comforting bowl of ramen with a rich, umami-laden broth and lots of goodies topping perfectly springy noodles. Food lovers in Southeast Portland have long had Biwa on their healthyish hit list for bowls of ramen and udon, handmade gyoza, onigiri, fresh Japanese-style salads, and their famous char siu pork burger. Open your app and say yes to their house ramen, served with thin Chinese-style noodles in pork, chicken, and dashi soup, with pork belly chashu, boiled egg, bean sprouts, sauteed spinach, green onions, and finished with red-hot flecks of chili oil. It’s a match made in heaven for a night on the couch with your favorite show streaming.Where Plant-Based Dishes Are a Work of Art in NYCNew Yorker’s love a plant-based restaurant with an artisanal and organic focus but when that restaurant also happens to be from Chef Jean-Georges Vongerichten and co-creator Paulette Cole, it takes things to cult status. The stunning abcV wants to do more than just serve good food. They want to inspire a cultural shift towards plant-based eating through their creativity and deliciousness. If you can’t get a reservation, or just don’t want to venture outdoors after that morning work-out session, we’re all for ordering in the yogurt and fruit bowl. It’s made with either coconut or local milk yogurt, fresh seasonal fruits, pollen, salted oats, and seeds and is almost too pretty to eat.Probably Some of the Best Hummus You’ll Ever Try in PhillyIf there was a poster child for healthyish eating, don’t you think it could be hummus? The Israeli favorite, Dizengoff, first landed stateside in Philly back in 2014, and since then has become a hotspot for its freshly-made hummus topped with a variety of seasonal garnishes (think hot-spiced lamb and pine nuts or avocado and harissa). While we’re fans of their daily specials—which you can find updated on their Instagram—there’s something so comforting about ordering a classic. The hummus tehina comes with hearth-baked pita, seasonal salad, and Israeli pickles and is sure to satisfy as a tasty lunch or light dinner.Bird’s The Word: Get Your Greens Fix From This Sustainable DC RestaurantAt Farmbird  in DC, their mission is to change the way people think about chicken. Their perfectly roasted birds feature bold flavors and put a new spin on the nourishing and sustainable foods their owners grew up eating. The food here is always fresh (you won’t find any frozen chicken) and all their menu items are prepared from scratch daily. For a plate that gets you your greens and a sample of their delicious grilled chicken, try the avocado basil. It comes loaded with sliced avo, kale pesto, snap peas, pickled vegetables, slivered almonds, sliced tender chicken breast, and basil. Healthy AND delicious.Caviar is an easy way to order meals from the best local restaurants across the U.S. Customers can order food for pickup or delivery ahead on the web, or instantly from Caviar’s free mobile app for iOS and Android.Explore Bon AppétitSuperpoweredRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-26", "author": ["Condé Nast"]}