{"id": "7226db9c38960117e6723922660d7d7b", "url": "https://www.bonappetit.com/story/alternatives-to-salmon", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "4 Alternatives to Salmon That Are Affordable and Accessible  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEnough With the Salmon Already!You're tired of cooking salmon three times of a week, right?By Amiel StanekAugust 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailToo much of a good thing is definitely a thing. So while we love salmon (we're card-carrying salmon fan club members), our fatty and flavorful standby, sometimes we need a break. That's where these alternatives come in. No, they're not one-to-one subs for salmon, but they are reliable, relatively affordable, and easy-to-find—perfect for when you're in the mood for seafood but need to take a salmon siesta:Mussels and ClamsPhoto by Chelsie Craig, Food Styling by Pearl JonesThese are a weeknight dinner’s best friend. We prefer farm-raised to wild-harvested: They're affordable, super-sustainable, and much easier to clean and prep. Steam them with garlicky butter and dry white wine just until they open—but don’t forget the baguette. (For all the details, look here.)ShrimpPhoto by Chelsie Craig, Food Styling by Pearl JonesYou’ll never regret keeping a bag of shrimp in the freezer for tacos, curries, pastas, and stir-fries. They defrost quickly and cook in a flash: Take them off the heat as soon as they’re bright pink.White FishPhoto by Chelsie Craig, Food Styling by Pearl JonesFillets of firm-fleshed white fish like pollack, hake, halibut, and cod are mild, meaty, and forgiving—and they can be cooked in much the same way as salmon (seared, slow-roasted, poached). You’ll know it’s cooked when the flesh is opaque and flakes easily. Just because you can cook white fish like salmon, however, doesn't mean it makes a perfect substitute: Here's how to navigate seafood swaps seamlessly.SquidPhoto by Chelsie Craig, Food Styling by Pearl JonesIf you like fried calamari, you’ll love a simple pasta pomodoro with a handful of sliced squid (thawed if frozen) thrown in at the end. Pre-cleaned squid cooks in no time at all and is one of the cheapest and most ocean-friendly options out there.Not salmon, still delicious:Family-Style Fish TacosNo grill, no deep-fryer, no problemo. Our summery tacos rely on our go-to fish-cooking method—slow-roast, baby—for all the flavor without the fuss.View RecipeExplore Bon AppétitSeafoodFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-16", "author": ["Condé Nast", "Amiel Stanek"]}