{"id": "722932258be3d15ca75816218699f8a7", "url": "https://www.bonappetit.com/story/fruition-milk-chocolate-bar", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Fruition Chocolate Proves that Milk Chocolate Is Best | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Favorite Chocolate Bar Is Milk Chocolate, and I Will Not Be ShamedWhen I crave chocolate, I’ll reach for Fruition’s bars over super-bitter dark chocolate any day.By Chris Morocco, as told to MacKenzie FeganMarch 22, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.In some circles there’s a conception that milk chocolate is the Merlot of the chocolate world. A true connoisseur, the thinking goes, seeks out dark chocolate—the darker the better!—and leaves milk chocolate to dilettantes and babies.But let’s take a minute and unpack that. While a lot of milk chocolate just so happens to be poor quality, milk chocolate itself is not the problem. The zeitgeist tells us that we “should” prefer dark chocolate much the same as we should prefer wine, coffee, and whiskey with flavor profiles that run toward the extreme. But sometimes I just want to eat something accessible and enjoyable without embarking on a cerebral tasting exercise. Somewhere in between 100% cacao—which, let’s be real, no one wants—and crappy milk chocolate, there’s something that delivers on quality and flavor but is still approachable. For me that’s Fruition Chocolate Works’ 68% dark milk chocolate bar.Claire Saffitz introduced me to Fruition, a small chocolatier in an unlikely location in upstate New York, when I was looking for some really nice chocolate to gift to my wife for Christmas one year. My wife is English and grew up eating Dairy Milk and Flakes and Twirls, so while she loves dark chocolate, she also has a soft spot for the milkier stuff. Fruition’s milk chocolate offerings include a brown butter bar and one that contains Peruvian salt, but my favorite is the dark milk, which is made with cacao from Peru’s Marañón Canyon. Often with single origin chocolate, the producer leans into the fruitiness or the acidity, which can be interesting from a culinary perspective but isn’t necessarily what I crave when I want chocolate. But Fruition’s dark milk is balanced and incredibly satisfying.At around $10 for a 60 gram bar, Fruition isn’t cheap, but its price is on par with most other specialty chocolates, and we are talking about a bar of chocolate that, in my opinion, is the absolute best that can be obtained by mere mortals. It’s beautiful chocolate. And yes, it’s milk.Fruition Chocolate Dark Milk Chocolate Bar$10 at Fruition Chocolate Works$13 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-22", "author": ["Condé Nast", "Chris Morocco", "As Told To Mackenzie Fegan"]}