{"id": "7239bbb3df12caa8ad08d8f0cd83fba3", "url": "https://www.bonappetit.com/story/microwave-popcorn-popper", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "This Microwave Popcorn Popper Is the Fastest Route to My Favorite Snack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Microwave Popcorn Popper Is the Fastest Route to My Favorite SnackI love microwave popcorn. I don’t love fake butter and weird chemicals.By Bianca BujanJanuary 22, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Whether I’m satisfying a midday craving, serving a bedtime snack to my three kids, or fixing “dinner for one” when my family’s not home, a big bowl of buttery popcorn is my go-to. But when it comes to the prep, I can be a bit of a picky popper.At first my air popper satisfied my needs, but it was too big to live permanently on my kitchen counter, and each use required lugging it out of the cupboard, finding a free plug, digging out a big-enough bowl, and melting the butter in a separate dish. It didn’t take me long to lose the little butter tray that doubled as the popper’s lid, leaving me to balance small bowls and plates over the opening to keep the air hot enough to pop.Although some people (allegedly) find it easy, I never quite mastered the stovetop technique–a testy trial-and-error process that left the pot either full of unpopped kernels or pimpled with charred pieces. The burnt popcorn smell would linger for days, and the cleanup process was never worth the work.And sure, microwave popcorn bags are a simple, foolproof way to serve the snack in a hurry, but that chemical-y, wannabe butter flavor just doesn’t hit right. Health concerns tied to the ingredients used to mimic that buttery flavor leave me hesitant to share the popped snack with my kids, and, I’m not going to lie, I’ve burned my fingers from eagerly busting open the boiling hot bag on more than one occasion.But the Cuisinart Pop and Serve Collapsible Popcorn Maker allows me to, yes, pop and serve the perfect bowl of popcorn with ease. I was first introduced to this microwave popcorn popper while visiting with a friend. She pulled a flattened red bowl out of the cupboard, snapped it open like an accordion, dumped in a scoop of kernels, closed the lid, and nuked it. When the microwave beeped, she poured on the melted butter, shook on some salt, and served it right in the bowl. I ordered my own on the spot.Photograph by Isa Zapata.  Food Styling by Micah MortonCuisinart Pop and Serve Popcorn Maker$20 $13 at Amazon$13 at TargetAnd now I use my microwave popcorn popper daily. My kids can prepare their own snack any time they want (without assistance–or burned fingers). It’s easy to use, simple to clean, and folds up flat for simple storage. No more microwave bags that may be lined with endocrine disruptors. No more burnt pots or lingering chemical aftertaste. Just freshly popped popcorn topped with butter. Lots of butter.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-22", "author": ["Condé Nast", "Bianca Bujan"]}