{"id": "72474db7c955072acfc3162effbe6410", "url": "https://www.bonappetit.com/story/frozen-xiao-long-bao", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "You Could Be Eating These Frozen Xiao Long Bao in Exactly 12 Minutes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingYou Could Be Eating These Frozen Xiao Long Bao in Exactly 12 MinutesI don’t have time to make my own soup dumplings, and thanks to XCJ XLB, I don’t have to.By MacKenzie Chung FeganJanuary 31, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Every Lunar New Year I make jiaozi using a recipe from my mom. The instructions contain the sentence, “If you grind the pork yourself, make sure it’s not too lean; need that fat,” and I don’t have the heart to tell her that never once in my life have I ground my own meat. While my dumplings aren’t as good as my aunt Meng Tao’s, at this point my pleating is decent and my pork-and-shrimp filling is beyond reproach (it’s plenty fatty, Mom). If there’s a bag of jiaozi in my freezer, they’re usually homemade.Xiao long bao, however, are another matter. Sure, you can technically make soup dumplings at home. You can also technically make croissants, but we all have lives to lead and Euphoria to watch. Who has the time to patiently boil down pig skin and bones to make the rich, gelatinous “soup” filling—jiggly at room temp, liquid when heated? After at least two hours on the stove, it needs to be chilled for several more until set. And unlike jiaozi or wontons, store-bought wrappers aren’t really an option. You’ll need to hand-roll each piece of homemade dough individually and then master the delicate stretch-and-fold technique used to seal the baozi (Din Tai Fung’s famous dumplings require exactly 18 folds). I may make my own babka and Japanese curry blend, but xiao long bao are too labor intensive even for me.Photograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaXCJ Xiao Long Bao$40 at Xiao Chi JieThankfully there’s Xiao Chi Jie xiao long bao—or XCJ XLB, if ya nasty. The Seattle-based company started as a neighborhood restaurant, but when the pandemic hit, it pivoted to selling its cult favorite soup dumplings frozen for steaming at home. Each bag contains 50 frozen xiao long bao about the size of a mandarin orange. Pop a few in your steamer (I prefer a traditional bamboo stack for that dim sum parlor smell, but you can customize your own setup), get your soup spoon, chopsticks, and black vinegar ready, and in 12 minutes your XLB are ready. I’m partial to pork-and-shrimp, if you’ve been paying attention, but the limited-edition Year of the Tiger crab-and-pork flavor is excellent as well.My mom may grind her own pork, but she’s a practical woman, not above break-and-bake cookie dough or store-bought salad dressing. I know she’d approve of the bags of xiao long bao nestled in my freezer, right next to my homemade jiaozi.XCJ Crab and Pork Xiao Long Bao$49 at Xiao Chi JieExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-31", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}