{"id": "724c575ec2a7cafe753991f93f2184ec", "url": "https://www.bonappetit.com/story/the-cake-is-small-but-tall", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "A Quarantine Birthday Deserves a Very Special Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Quarantine Birthday Deserves a Very Special CakeNamely, one that feeds two, not 20.By Sarah JampelMay 13, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hey Basically readers,How do you celebrate a birthday during a pandemic? It’s a question I’ve been thinking about a lot lately, considering my quarantine buddy/husband’s birthday was last weekend. We’ve been to a number of Zoom surprises over these past couple months, so that was off limits. He also insisted he didn’t want to do anything at all—which… sure, okay, right.Want this letter before it hits the website? Sign up for our newsletter!But even after the other details got worked out (a take-out bagel in the morning, a masked jog to our friends’ window in the afternoon), I still wondered about the cake. I wanted to make a layer cake—it’s a birthday, isn’t it?—without making a dessert to feed 15. I landed on this amusing solution: I baked one round cake (this excellent yellow one from Food52), then punched out smaller circles with a biscuit cutter. I stacked them atop each other and glued everything together with the chocolate cream cheese frosting from Basically’s birthday cake.It may be tiny, but this cake is still a standout.\nPhoto and Food Styling by Sarah JampelThe result was a precariously tall, very unbalanced cake that kinda looked like a mini tree stump and fed us over four days instead of 20. It felt sufficiently festive and appropriately strange.A small-but-tall slice.\nPhoto and Food Styling by Sarah Jampel“Was this the best birthday ever?” I asked him. “Well, no, but that’s okay,” he replied. I’m taking that as a success, and I’m crediting the cake. Here’s what else I’ve been up to this week:One Good TipLeftover LandThere is no clearer example of entropy than my refrigerator, which devolves into chaos no matter how often I organize it. (Scientists, don’t fact check me.) To impose some order to the madness, I’ve started to corral all of the leftovers into one area: “leftover land.” This way, it’s obvious when there’s a lingering cup or two of squash au vin that should be taken care of before I embark on another stew. And when I’ve accumulated lots of random grains and lentils and beans that don’t amount to a full meal on their own, that’s when I’ll follow Sohla El-Waylly’s lead and make koshari.Spring-y pasta never goes out of style.\nPhoto and Food Styling by Sarah JampelThe Best Thing I Ate This WeekJust Don’t Call It PrimaveraThere’s something very retro about pasta primavera—perhaps because it was invented not in Italy but in North America in the ’70s and sometimes involves broccoli and red peppers. But I still find the idea of sweet spring veg in a creamy lemony sauce extremely appealing. This week, I thinly sliced the two giant leeks that’d been stinkin’ up the fridge, then melted them down in butter until super soft before adding sliced asparagus and frozen peas. Once the veg was crisp-tender and bright green, I stirred in 12 ounces of al dente pasta, a heap of grated parm, and a few tablespoons of cream and mixed vigorously until the noodles were coated. Finishing touches: lemon zest, lemon juice, parsley, and then, once in bowls, a sprinkle of smoky, fruity black urfa chile from Burlap and Barrel.Moment of AppreciationThe Quiet HourEvery morning my cat wakes me up between 5:45 and 6 a.m., the point at which he simply cannot wait any longer for breakfast (I can empathize). Because this is aggravating but impossible to prevent, I’m trying to choose my attitude: So I get out of bed, appease him, and then, against all recommendations, crawl back into bed, where I spend one uninterrupted hour reading a book (right now, that’s Three Women by Lisa Taddeo). With most of the time zone asleep, it’s the only time of day I feel no need to read the news, trawl for new content, or respond to emails.Photo and Food Styling by Sarah JampelAnd then when that hour is up, it’s still only seven. The rest of the morning sprawls out in front of me! This week I made granola (my go-to is this one, but I use oats in place of half of the nuts) and radish and carrot pickles before 8. This is quite often the most productive part of my day (don’t tell my boss).Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-13", "author": ["Condé Nast", "Sarah Jampel"]}