{"id": "7256e377f70f4e9a7ac151bf06edc507", "url": "https://www.bonappetit.com/recipe/butternut-squash-and-green-bean-stew", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Coconut, Butternut Squash, and Green Bean Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesButternut Squash and Green Bean StewBy Meherwan IraniSeptember 20, 20214.1(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis warm and rich vegetarian stew with roasted butternut squash and green beans is a staple at chef Meherwan Irani’s dinner table. At home, he likes to make double or triple batches of the coconut milk curry (see his recipe for All-Purpose Coconut Curry here) and freeze it in two-cup portions. Then, when he’s ready for dinner, all he has to do is reheat the prepared curry and roast some squash. If you want to prepare this recipe with premade curry, bring two cups curry to a gentle simmer in a saucepan over medium-low heat, then add the roasted squash and cut green beans and simmer until the squash is warmed through and the green beans are tender.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketDutch Oven$80 At AmazonVegetable Peeler$10 At AmazonIngredients4 servingsSquash½large butternut squash, peeled, seeds removed, cut into 1\" cubes (about 4 cups)2Tbsp. extra-virgin olive oil2Tbsp. light brown sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltCurry and assembly3Tbsp. grapeseed oil or vegetable oil1tsp. brown mustard seeds3–4fresh or dried curry leaves (optional)½tsp. asafetida (optional)13\" piece ginger, peeled, finely grated5garlic cloves, finely grated1large red onion, finely choppedKosher salt1tsp. ground turmeric114-oz. can crushed tomatoes113.5-oz. can unsweetened coconut milk (not low-fat)2cups low-sodium vegetable or chicken broth6oz. green beans, trimmed, cut crosswise into thirds (about 1 cup)Store-bought fried onions or shallots (such as Lars Own, French’s, or Maesri); cilantro leaves with tender stems; cooked basmati rice, wild rice, or warm naan; and lime wedges (for serving)PreparationSquashStep 1Preheat oven to 400°. Toss squash, oil, brown sugar, and salt in a medium bowl to coat. Spread out in a single layer on a parchment-lined rimmed baking sheet and roast until fork-tender, 30–35 minutes. Set aside.Curry and assemblyStep 2Heat grapeseed oil in a medium Dutch oven or other heavy pot over medium-high. Add a few mustard seeds to pot. When seeds start to wiggle and pop, reduce heat to medium and add curry leaves (if using), asafetida (if using), and remaining mustard seeds. Cover pot and cook spices, swirling, until mustard seeds start popping more gradually, about 30 seconds. Uncover pot and return heat to medium-high. Add ginger and garlic and cook, stirring constantly, until beginning to brown, about 1 minute. Add red onion and a big pinch of salt. Cook, stirring often and reducing heat if needed to prevent burning , until onion is golden brown and jammy, 7–9 minutes.Step 3Stir in turmeric, then tomatoes and bring to a simmer. Reduce heat to medium and cook, stirring often, until tomatoes are glossy and darkened in color and oil starts to separate around edges of pot, 5–7 minutes.Step 4Add coconut milk and broth and stir to combine; season with salt. Bring curry to a simmer, then reduce heat to medium-low. Cover and cook, stirring occasionally to prevent sticking, 10 minutes.Step 5Add green beans and reserved squash to curry. Return to a gentle simmer and cook until green beans are tender, 7–10 minutes. (If curry gets too thick, add a splash of hot water; curry should have consistency of heavy cream.) Taste and season with more salt if needed.Step 6Ladle stew into bowls and top with fried onions and cilantro. Serve with rice and lime wedges for squeezing over.Do Ahead: Curry can be made 5 days ahead. Let cool, then transfer to an airtight container and chill.How would you rate Butternut Squash and Green Bean Stew?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleMade this with purple cabbage subbed for green beans because that’s what we had/is in season and it was incredible! Will 100% make again. Grace KBerkeley, CA1/26/2022I wish I'd re-read the notes about adding more spices to this stew. As written, the stew added up to less than the sum of its parts. Also, a tip for the unwary: mustard seeds pop just like popcorn in the hot oil. Have that lid ready to cover those little leaping seeds!KirstenWoodland Park, NJ1/16/2022It was wonderful once I added cumin, cinnamon, Aleppo pepper, and Kashimiri pepper. Otherwise, it was bland. It just needed a little heat and more aromatics. No doubt this could be made with other vegetables and also lentils and beans. Served over rice. It was a hit.BarbaraSoho1/5/2022So good, with a bit of added heat. Added some baked tofu (done at the same time as the squash), exchanged the green beans for peas, and added  hot curry powder instead of leaves and added some chili paste for warmth. But otherwise done as-is and it is really good!Vegfam01Detroit MI10/28/2021The curry base is very good but for my palate needs more spicing like chilli powder, cumin and coriander powder. With that, it becomes more complex and interesting.   Perhaps when we make the base for freezing we do it plain and for each dish, we add diff spices to it to make it taste diff.AnonymousRaleigh, NC10/24/2021The recipe itself is a good base - but it DEFINITELY needs a lot of doctoring. We added 1.5 tbsp Kalustyan house blend curry powder mix, a pinch of cinnamon, 0.5 tsp of cayenne, about 0.5 tsp maple syrup. With the added spices it is phenomenal but without those it’s very bland and very one note.DevonyNew York, NY10/2/2021I went to the local Indian grocer and got all the ingredients. Still, it ended up tasting too sour and not very complex/spiced. I don't know what went wrong :(LizOttawa9/27/2021So, so tasty. Wasn’t able to source the optional ingredients from my local grocery store, but I imagine they would add even more complexity. Might try a chili or two on my next pass. AnonymousDc9/24/2021Explore Bon AppétitCoconut MilkOther IngredientsButternut SquashSquashVegetableGreen BeanStewSoups and StewsMeal PrepVegetarianVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-19", "author": ["Condé Nast", "Meherwan Irani"]}