{"id": "726b51468dadf95399f528b405a2c89f", "url": "https://www.bonappetit.com/story/tatung-electric-steamer", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Before There Was the Instant Pot, There Was the Tatung Rice Cooker | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBefore There Was the Instant Pot, There Was the Tatung SteamerIt’s a slow cooker, steamer, popcorn machine, and rice cooker all in one.By Clarissa WeiApril 6, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When my husband and I were shopping for essential appliances for our empty apartment in Taipei, I immediately beelined for a matcha green Tatung electric steamer. “I don’t know if a steamer is super necessary right now,” my husband said hesitantly. A $133 steamer was a luxury purchase in his opinion—not really a priority.“It’s not just a steamer,” I retorted, mildly offended. “It does everything.”Originally introduced in Taiwan in the 1960s for just $9, the Tatung steamer is a ubiquitous household item across the island and in the homes of the Taiwanese diaspora around the world. The beauty is in its simplicity and versatility. Unlike the dozen or so buttons on an Instant Pot (What do they all do?!), the Tatung has a single on-off switch, and with that, it can reheat food, cook rice, and push out long, complex braises. My late grandmother used it to make herbal soups and tea; my mom steams fish with it; and some people even use it to disinfect their face masks (?!). My friend Ivy Chen, a cooking instructor here in Taipei, tells me that it’s also quite handy for fermenting yogurt. “It’s not super precise, but it’s multifunctional—and Taiwanese people love multifunction,” she says.Like a Russian matryoshka doll, it consists of a small pot nestled within a fixed bigger pot. Just pour a couple of cups of water into the outer pot, add your food to the smaller pot inside, and flick the switch. The indirect heat from the steam hovers around 159°, which is high enough to cook things like steamed fish or braised pork but low enough not to burn anything if left unattended. (See, it’s also a slow cooker. Multifunction.) Take off the lid and the temp will drop to around 108°—within the ideal range for incubating starter yogurt cultures. When the water in the outer chamber runs out, the steamer turns itself off. Easy peasy. Even a kid could do it.Microwaves or toasters aren’t common here in Taiwan, so generations of college students have been using this steamer instead to fix themselves a quick meal. My friend SueAnn Shiah, a graduate student at National Taiwan University, has one in her dorm room and uses it to make dumplings, pasta, and popcorn from scratch. Making popcorn requires a temperature of 355° for the kernels to pop, which is beyond the usual temperature capacity of the steamer. But there is a hack: “Put some oil in the bottom of your inner pot, add kernels, then hold down the on-off lever. Normally, the pot will just click off when it hits a certain temperature, but if you hold the switch down, you can manually override it.”Aesthetics-wise, the pots come in quaint monochromatic colors like green, orange, blue, white, or red, though the brand will occasionally push out a limited edition release. I got mine in green because that’s the original, most iconic color—the same version my grandmother had. My mother, though, is a proud owner of a bright pastel pink Hello Kitty steamer, which I’m hoping might one day become a family heirloom.This machine may not have any of the fancy bells, whistles, and timers that most modern multi-cookers have, but that’s really just part of its charm. Truly, sometimes the best gadgets are the simplest ones.Tatung Electric Steamer$143 $120 at Amazon$140 $98 at Wayfair$137 at TS EmporiumExplore Bon AppétitShoppingHighly RecommendToolsequipmentRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-06", "author": ["Condé Nast", "Clarissa Wei"]}