{"id": "726f664dedbdcaa2f610ce9c76675439", "url": "https://www.bonappetit.com/recipe/braised-short-ribs-with-bacon-pineapple", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Braised Short Ribs with Pineapple and Bacon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBraised Short Ribs with a Pretty Great Bacon-Pineapple Situation on TopBy Claire SaffitzFebruary 27, 20184.7(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintBraising might sound like a fancy restaurant technique, but really it's really straightforward. You're just slow-cooking tough cuts of meat in liquid until tender, and once you've mastered this method you'll be able to braise just about anything. While a lot of recipes call for braising in stock, we say skip the sodium-laden store-bought stuff or the trouble of making your own and go with a simple but delicious combo of soy sauce, rice vinegar, Sriracha, and brown sugar. We wouldn't steer you wrong.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAPlate$55 At Bon Appétit MarketDutch Oven$80 At AmazonWooden Spoon$6 At AmazonMedium Bowl$17 At AmazonPaper Towels$13.45 At AmazonTongs$13 At AmazonPlatter$29 At AmazonHeavy-Duty Aluminum Foil$10 At TargetSieve$18 At AmazonHeatproof Measuring Cup$18 At AmazonIngredients4 servings4oz. bacon1medium red onion13\" piece ginger4large bone-in beef short ribs (2½–3 lb.)Kosher saltFreshly ground black pepper½cup soy sauce½cup plus 1 Tbsp. unseasoned rice wine vinegar2Tbsp. brown sugar2Tbsp. Sriracha or sambal oelek1cup fresh pineapple chunks (about 6 oz.)¼cup cilantro leaves with tender stemsPreparationStep 1Preheat oven to 300°. Prep your ingredients before you start cooking. First, coarsely chop 4 oz. bacon.Step 2Wash your cutting board (or just flip it over!) so that you're not cutting vegetables on the same surface that you used to prep raw meat. Peel 1 onion and cut into quarters; set one quarter aside for the relish. Cut remaining quarters into large pieces.Step 3Rinse 1 3\" piece ginger, then very thinly slice crosswise (no need to peel).Step 4Place 4 short ribs on a plate; season all over with salt and pepper, turning pieces to season every surface.→  Short ribs out of the budget? Here are our fave cheap braising cuts.Step 5Heat a Dutch oven over medium-low. Add bacon and cook, stirring often with a wooden spoon, until fat is rendered and bacon is crisp, 7–10 minutes. Meanwhile, line a medium bowl with paper towels. Using wooden spoon, transfer bacon to a medium bowl, leaving fat in pot. Blot bacon with paper towels, then discard paper towels, leaving bacon in bowl.→  Don't have a dutch oven? Time to get with the program.Step 6Increase heat to medium-high and add short ribs. Cook, turning once or twice, until very well browned on at least two sides, 12–15 minutes (it’s not necessary to brown all over as long as you get a sear on a couple sides).Step 7Transfer short ribs back to plate and reduce heat to medium. Add ginger and onion pieces to pot and cook, stirring often, until ginger is just starting to turn golden around the edges, about 3 minutes.Step 8Add ½ cup soy sauce, ½ cup rice vinegar, 2 Tbsp. brown sugar, 2 Tbsp. Sriracha, and 1 cup water; stir to combine. Arrange short ribs in Dutch oven in a single layer (it’s okay if they’re not fully submerged in liquid).Step 9Cover pot and transfer to oven. Bake 30 minutes, then remove pot from oven and turn short ribs with tongs.Step 10Cover pot and return to oven. Continue to bake, turning every 30 minutes, until short ribs are fork-tender and pulling away from the bone, 60–70 minutes longer.Step 11Transfer short ribs to a platter. Tent with foil to keep warm.Step 12Heat pot with juices over medium-high and bring to a boil. Cook until braising liquid is reduced by about half, 8–12 minutes.Step 13While juices are reducing, thinly slice reserved onion quarter. Add 1 cup pineapple chunks and sliced onion to bowl with bacon. Season lightly with salt and toss with remaining 1 Tbsp. rice vinegar.Step 14Place a strainer over a heatproof measuring cup and pour reduced juices through strainer. Discard solids. Let juices settle until fat rises to the top. Spoon off fat and discard.Step 15Pour de-fatted juices over short ribs. Spoon bacon-pineapple relish over meat and top with ¼ cup cilantro.Step 16Do Ahead: Short ribs can be braised 1 day ahead. Let cool in (unreduced) braising liquid, cover, and chill. Reheat over low, then proceed with recipe. If making ahead, we recommend crisping fresh bacon for the relish.How would you rate Braised Short Ribs with a Pretty Great Bacon-Pineapple Situation on Top?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleA nice bright short rib recipe. I used boneless chuck roast cut into short rib sized pieces, followed the cooking instructions exactly and they were done and tender (200 degree internal temp) after 90 minutes in the oven. The pineapple bacon relish was delicious and would be tasty on anything. I used reduced sodium soy sauce and am glad I did or it would have been too salty.AnonymousSan Francisco, CA12/5/2021So, I am not the best cook. Let's start with that. I just got my first dutch oven and I was so excited to try something new but wanted to be easy since I'm not a pro. Guys, I COULDN'T HAVE CHOSEN BETTER. This dish was so good, so flavorful, so delicious. I-want-to-lick-the-plate kind of good. Seriously. And so easy to make. We were so sad we didn't have leftovers. I would be definitely making this again and will double up the recipe. Ps.: also used low sodium soy sauce and cooked for 2h, turning every 30min as the recipe calls.IsabelleSeattle, WA11/13/2020Literally making this right now and am so glad I read reviews for a longer cook time!  I thought I was doing it wrong because they just weren’t getting that “slide off the bone” tenderness.  I also always use low sodium/no salt added ingredients anyway, and glad for that!  Thank you so much for the Great recipe and super helpful reviews on this!  The flavors are amazing! AnnalysejarvisReno, NV6/2/2020I received a cast iron Dutch oven for Christmas from my fiance. I knew I wanted to make something with short ribs. This was the very first recipe that came up when I Googled short ribs. I made a few changes. I added 3 rough chopped garlic cloves, and I put the red onion in cheese cloth due to an allergy to the fibers in onions, but not the juice. We also couldn't find bone-in short ribs, so we got bonless. And I used a 1/3 c soy sauce. It was a big hit with my family and definitely a keeper recipe to make many more times. I'm even thinking of trying it with a pork roast.shoomim54Atwater, CA 1/2/2020Wow. I stayed up until 3 am making this last night, and it was WORTH IT. The meat is tender and delicious, the juices are mouth-watering, and the pineapple relish goes with it perfectly. (My brother disagreed, but he has an inferior palate.) My only complaint is that I'm not sure where y'all are finding these massive short ribs. I bought a pack of 4, it was about half the weight called for in the recipe, and yielded a pretty small amount of meat. I ended up buying two packs, but I wouldn't have been able to fit 8 short ribs in my dutch oven.AnonymousColumbia, SC10/22/2019I was nervous to make this recipe because my family and I have very simple tastes, but I'm glad I did! It was a little salty overall from the soy sauce, but the meat was so tender and delicious; It was a hit! I will be trying more recipes out of my comfort zone from now on.RmstadeDamariscotta, Maine4/30/2019Great recipe for short ribs, and a nice departure from the typical 'braise in red wine' method (which I truly love.) I'm lost on the pineapple topping, but that is solely based on my hatred of pineapple in savory applications. Otherwise this is a great weekend recipe! AnonymousSaint Louis, MO2/20/2019I’ve made this recipe at least 4 times and shared with friends who have also made it.  The last time, I didn’t have pineapple or cilantro and it was still amazing.  Plan for the beef to need 2-2.5 hours.  I used a covered braised and it was exactly the right tool.  Agree with low-sodium soy sauce.  I’ve served with mashed potatoes, broccoli and a nice green salad.  Gets rave reviews!!glhathawTexas9/8/2018Have made this twice.  To get a little more “Asian” flair, add a little pineapple juice (a generous tablespoon).  I also used the low sodium soy sauce and there was enough salt (from seasoning the beef).  This dish needs every minute of 2 hours to cook in the oven to get the right tenderness in the short ribs, and the bone slide right out of the meat.  Served with red potatoes and asparagus...so yum! AnonymousSan Antonio, TX4/10/2018Great recipe, just a couple of suggestion for anyone who makes it. When making the Pineapple Situation don't slice the onions, dice them, it makes it much easier to get a cohesive bite. Also, expect the short ribs to cook for 2-2.5 hours. I let my cook for the amount of time in the recipe and they still had some chew to them. I will also make the suggestion of using low-Sodium Soy sauce, I felt the sauce was a little to salty, my roommate disagreed.ravenillusionFlorida3/8/2018Explore Bon AppétitRibsBeefMeatShort RibBaconCured MeatPineappleFruitOne-Pot MealsMainDairy-FreeNut-FreeBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-27", "author": ["Condé Nast", "Claire Saffitz"]}