{"id": "727f35dab493989965e60b82dfc7ba4f", "url": "https://www.bonappetit.com/story/how-to-store-vegetables", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "How to Store Vegetables in the Fridge for Fresh Produce Year Round | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Store Vegetables in the Fridge so They Stay Super FreshThink you know how to store vegetables in the fridge? Not so fast.By Aliza AbarbanelFebruary 20, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailThere's nothing better than hitting up a farmers market (or well-stocked produce aisle)—and nothing worse than realizing that your bounty has rotted in the crisper drawer. Knowing what to buy and how to store it makes all the difference when it comes to keeping your fridge stocked with greens and veggies all year long. BA test kitchen assistant Gaby Melian used to work as a produce supervisor at the Institute of Culinary Education’s purchasing department and she keeps a close eye on the produce in our test kitchen as well. Here are her five best tips for selecting and storing the hardiest greens, herbs, vegetables, and fruits.1. Take your time picking out produce“You need to pick good produce, or it doesn't matter how you store it,\" says Melian. If you bring home a bad apple or wilted bunch of kale, no amount of refrigeration or prep will save it.2. Stocking up? Reach for root vegetables.“Carrots, beets, daikon, turnips—most crunchy root vegetables really—those things will last forever (read: a week or two) in the fridge,” says Melian, as long as you buy them fresh. After purchasing, it all comes down to prep. She removes carrot tops and beet greens and stores them separately to prevent the greens from pulling out the root’s moisture. As a rule, it's best to avoid pre-washing produce, because moisture can lead to spoilage. One exception are leeks and asparagus, which can be stored upright, with the cut end submerged in about an inch of water.Keep pod vegetables and small squash like zucchini in resealable bags, and stash root vegetables like carrots in sealed plastic bags. Sweet potatoes and gourds like squash and pumpkin also last for a few weeks and don’t require refrigeration or prep. Just store them in your go-to cool, dark place... and don't forget about them.3. When it comes to greens, think sturdy.Lettuces are notoriously fragile, but sturdy greens like kale and collards can stay fresh for about a week if stored properly.  “You want to take off the rubber band it comes with, because it compresses the leaves,” says Melian. “And when storing produce in plastic bags, leave them untied so the produce can breathe.” Kept tightly wrapped in plastic, bitter chicories like radicchio and endive will also stay fresh in the fridge's crisper drawer for about a week.4. Treat herbs with care.Most herbs are quite delicate, but rosemary and thyme are the sturdiest of the bunch. For all herbs, proper storage is key for elongating shelf life. \"Before you use them, roll up your herbs in a slightly damp paper towel, and place the bundle in a resealable plastic bag,\" says Melian. Then, remove and wash herbs on an as-needed basis to keep the whole bunch fresh.5. Reach for longer-lasting fruits.Summer fruits seem to rot in a heartbeat, but citrus and apples can hang out in the fridge for at least a couple weeks. Just be sure you’re selecting blemish-free fruits, especially when buying in bulk. If there’s one bad apple in the bushel, well, it really can spoil the whole bunch. Fruits like apples produce ethylene gas when ripe, which prompts all the other apples to ripen too. This ripening effect means it's best not to store quick-ripening fruit to close to other produce. If your fridge isn't spacious enough for total separation, reserve the crisper drawer for the delicate stuff. Turns out, an organized fridge doesn't just look pretty—it's the secret to fresher and more delicious food.Explore Bon AppétitHealthyishVegetableFruitStoringLeafy GreensherbRead MoreLifestyleThis Is the Best Lettuce to Buy at the Grocery StoreBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Aliza Abarbanel"]}