{"id": "7285160ba9405481029bbf4a50efe915", "url": "https://www.bonappetit.com/recipe/smoky-and-crunchy-peas-with-creamy-nuoc-cham", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Smoky and Crunchy Peas With Creamy Nuoc Cham Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueSmoky and Crunchy Peas With Creamy Nuoc ChamBy Andy BaraghaniMarch 15, 2022EmailPinterestPrintPhotograph by Graydon Herriott, food styling by Sue Li, prop styling by Aneta Florczyk.EmailPinterestPrintEmailPinterestPrintNo offense to the crunchy peas, but this recipe is all about the nuoc cham. A dipping sauce of fish sauce, lime juice, chile, garlic, and sugar, it varies across Vietnam; some are sweeter, some more savory. This one is less potent than the average and creamy thanks to toasted, buttery cashews. It clings to whatever you’re dressing. Here that’s snow peas, but you can also use it on salads, rice, eggs, or simple stir-fried greens.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonLarge Skillet$84 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketCitrus Juicer$7 At AmazonIngredients4 servings⅔cup raw cashews1red Fresno chile, chopped2garlic cloves, crushed3Tbsp. fresh lime juice1Tbsp. fish sauce2tsp. granulated sugarKosher salt1Tbsp. vegetable oil1lb. snow peas and/or sugar snap peas, trimmed, some sliced some left whole1cup pea shoots (tendrils)Lime wedges (for serving)PreparationStep 1Preheat oven to 350°. Toast cashews on a rimmed baking sheet, tossing halfway through, until golden brown, 7–9 minutes. Let cool.Step 2Purée cashews, chile, garlic, lime juice, fish sauce, sugar, and 3 Tbsp. water in a blender, adding more water as needed to loosen, until smooth. Taste and season with salt if needed. (Even though the sauce includes salty fish sauce, it may need some added salt.) Set creamy nuoc cham aside.Step 3Heat oil in a large skillet over medium-high until almost smoking, add peas, season with salt, and toss to coat in oil. Cook peas, letting them get blistered underneath before tossing, until all of the peas are a little charred but still have their crunchy texture, 3–4 minutes.Step 4Transfer peas to a platter and spoon reserved creamy nuoc cham over. Scatter pea tendrils on top and serve with lime wedges for squeezing over.How would you rate Smoky and Crunchy Peas With Creamy Nuoc Cham?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerSideEasyQuickDairy-FreeGluten-FreeHealthyishFrySpringCashewNutPea ShootLeafy GreensVegetableSugar Snap PeaPeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Andy Baraghani"]}