{"id": "729303b5e684fed3f2b74ff140b6034c", "url": "https://www.bonappetit.com/story/never-fail-chicken-meatball-recipe", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "This Chicken Meatball Recipe Makes Me Feel Like a Meal Prep Queen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Chicken Meatball Recipe Makes Me Feel Like a Meal Prep QueenCafeteria sushi was totally the old me.By Emily SchultzApril 6, 2018FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ANNA BILLINGSKOGFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the chicken meatball recipe that associate social media manager Emily Schultz just couldn't live without.You know those people who “can’t day-drink all Sunday with you” because they’re too busy shopping, cooking and prepping for their meals all week? Yeah, well, I am not one of those people. I want to be! I’d love to not spend $12 on cafeteria sushi every day! Or totally forget to eat lunch and then wonder why I can’t focus at 3 p.m.! But, alas, most Sundays roll around and I find myself watching an entire season of It’s Always Sunny in Philadelphia rather than dragging myself to the grocery store. That is, until these chicken meatballs rolled into my life.I decided to make these meatballs on a Monday night—we’re working on the Sunday meal prep thing here, people!—for my roommate and I. When I was finished, we each had dinner and two full servings to bring for lunch for the next two days, which I call a MAJOR SUCCESS. Let’s get rockin’ and rollin'.A few notes before we get started. There are a couple of ingredients on this list that aren’t mandatory, but are pretty freaking genius. The first is the feta IN BRINE! The brine is important because it's used in the breadcrumb mixture for meatballs. It’s not like your meatballs are going to walk off your pan in protest if you subbed the brine for water, but it adds a wonderful salty kick that balances out the sweetness of the roasted tomatoes and creaminess of the chickpeas. The other next-level addition to these meatballs is harissa, a North African spice paste that kind of looks like tomato paste and has a slightly smoky spiciness; it kicks everything up a notch, and makes these meatballs taste a lot fancier than they are.Once you buy a tube of harissa, you won't be able to live without it. Pinky swear.\nOK, let’s actually make the darn things now. First, you're going to make the binder that will turn the ground chicken into proper meat-a-balls. (Cue extreme pizza-box-chef kiss face.) Combine an egg, some bread crumbs (panko, plz!), a good splash of that feta brine, crumbled feta, chopped parsley, and olive oil. Give it all a good smash-smash with a fork until it looks like it’s all become one beautiful mess, then add grated garlic, salt, and pepper, and do a little more smashing. The ground chicken goes in, and then you mix it all up with your bare hands! Don’t be scared of getting your hands up in it. (Though, I would advise against making these on a date because ground chicken all over your hands isn’t romantic in my opinion. Make this instead. Let the meatball mixture chill out for a second, wash your chicken-y hands, and move on to the other stuff.Now, pour some drained chickpeas and cherry tomatoes onto a baking sheet. (Amanda, my lovely coworker and editor of Healthyish, subbed the tomatoes with cubed sweet potatoes for a heartier side during the dead of winter; do what you feel!). Then you add more of that harissa, olive oil, salt and pepper right there on the dang sheet pan and toss to combine. Cool! Now your hands are covered in oil and harissa. It’s almost like a fancy hand scrub—don't bother washing your hands, just go with it.That salty, milky feta brine is where it's at.\nYou’re going to start rolling your meatballs and plunking them into the spaces between the chickpeas and tomatoes. (The oil on your hands will help the chicken from sticking to your hands. Genius!) I like rolling the meatballs golf-ball sized, which will leave you with a lot of meatballs. (This is about meal prepping in case you forgot) Then, into the oven they go for about 15 minutes while you combine feta and parsley in a small bowl to create a garnish for your finished meatballs. Once the meatballs are mostly cooked, you're going to finish them under the broiler for about 8 minutes—that'll ensure that they're golden brown on the outside and super juicy inside. Once these guys come out of the oven, let them sit for a minute and then sprinkle that fancy feta-parsley mixture over eeeeeeeeverything.You can eat them with flatbread, over something sturdy like kale, or straight up. I eat the spicy chickpea-tomato business right out of the fridge because cold roasted vegetables are basically a food group to me, so they are my ideal lunch al desko. They’ll turn you into a meal prepper faster than you can say cafeteria sushi.Get the Recipe:Sheet Pan Chicken Meatballs with Tomatoes and ChickpeasHarissa, a spicy North African paste of chiles, garlic, and spices, is available in many large grocery stores and Middle Eastern markets—some brands come in tubes, others are sold in jars. If you can’t find it, though, substitute by mixing together your favorite hot sauce, tomato paste, a pinch or two of ground cumin, and a drizzle of olive oil. Keep playing with the ratios until you have a medium-spicy paste.View RecipeExplore Bon AppétitMeatballBasicallyNever FailFetaHarissaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-06", "author": ["Condé Nast", "Emily Schultz"]}