{"id": "7294975ef0713cd2488f67f90c9bc645", "url": "https://www.bonappetit.com/story/its-that-simple-pizza-dough-flatbread-recipe", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "This Pizza Dough Flatbread Recipe Can Be Whatever You Need It to Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pizza Dough Flatbread Recipe Can Be Whatever You Need It to BeStore-bough pizza dough and a 15-minute cook time? We'll be right there.By Alex DelanyJanuary 17, 2019FacebookTwitterEmailChelsie CraigFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.Here's a thing you might enjoy: It’s a party snack that’s also a meal that’s also a distraction from the countless stresses of your life, whatever and wherever they may be. It doesn’t take much effort. Or time. The ingredient list is simple and affordable. And at the end of the day, it can be whatever you want it to be. What’s the name of this mighty crowd pleaser of which I speak? It’s called pizza dough flatbread, and honestly, I’m so stoked you two are getting the chance to meet.You’ve had flatbread before, right? Maybe you bought it at the grocery store, in an individually wrapped package. Maybe you heated it up. And maybe it wasn’t all that great, because it wasn't all that fresh. Or maybe you tried to make flatbread from scratch. And it took forever to make your dough. And then after all that work you overcooked it. And you basically wasted a few hours of your life. Both of those scenarios sound terrible! Luckily, this flatbread is neither of those things. You're baking it up hot and fresh, but building it from pizza dough that’s already made. How cool is that?When it comes to buying pizza dough, you can pick up whatever your grocery store has to offer (fresh is always better than frozen), or you can hit your local pizzeria and ask them to sell you some dough. This is my preferred method and only costs about three or four bucks a pop. Regardless, you want a pizza dough that is about one pound.When you get home, let the pizza dough come fully to room temperature in a container or tray, covered with plastic wrap. Then turn around and preheat your oven to it's maximum heat, without going into broiler territory. You're looking for something in the 450° to 500° range, whatever your oven cranks to.Is your dough at room temperature? It is? Great. It’s time to shape it into a flatbread. Let gravity do most of the work here. Hold the dough up and let it droop, rotating it around with your hands it so it spreads evenly. We want a vaguely rectangular shape, but it's actually going to be cooler if it looks a little irregular. Are you a rectangle? Or a shape that can’t be defined, because you’re a special, beautiful individual? That’s right. You’re special. And so is your flatbread.Drizzle a little olive oil on a rimmed sheet pan, and place the semi-rectangular dough on the pan Continue to spread it, making sure both sides of the dough come in contact with the olive oil. That oil is going to make the edges of your flatbread well-browned and crispy, not to mention flavorful. When it’s spread across the pan, use your fingers to create dimples in the dough.Remember that dip called hummus? Yeah, that stuff is great with flatbread.\nNow we get some seasoning involved. The idea here is to create a flavorful seasoning blend with items in your pantry—anything goes. For me, I like to sprinkle a heavy layer of sesame seeds across the dough, followed by chile flakes (I like urfa biber, but Aleppo or plain ol' crushed red chile flakes will work), flaky sea salt, garlic powder, and dried oregano (or thyme). As a final touch, I'll finely dice a small yellow onion and scatter it over the seasoned dough. Not into that combo? Do you!Into the oven we go! Bake your flatbread for 10-15 minutes, until the top is deeply colored. Check the bottom of the dough after 10 minutes to make sure it isn't getting too dark. When it’s ready, remove your flatbread from the oven and let it cool.Before you serve it, drizzle a bit of nice olive oil across the flat bread for one last hit of fat. From there, the options are limitless. You could serve the flatbread with hummus, labneh, or onion dip. You could serve it as the base of a simple salad or a tray of pickles. Have some smoked fish, onions, and creme fraiche? You’ve got yourself a bagel alternative! And if you really want to go big, serve it with some shred-y braised meats or grilled skewers.You see what I mean? This is literally whatever you need it to be. Whatever problems are plaguing you, pizza dough flatbread is the answer. And it really was my pleasure to make the introduction. This looks like the start of a beautiful friendship.Want another beyond-simple recipe? Sure you do.How to Make Stovetop Popcorn Perfectly, Every TimePut down the pre-bagged stuff, shut the microwave door, and learn how to make stovetop popcorn—the best popcorn, if you ask us—once and for all.View StoryExplore Bon AppétitIt's That Simplepizza doughFlatbreadBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-17", "author": ["Condé Nast", "Alex Delany"]}