{"id": "729cd6b9bb004e56bee549c192bee6cb", "url": "https://www.bonappetit.com/recipe/freekeh-salad-with-parsley-and-cherry-tomatoes", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Freekeh Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFreekeh Salad with Parsley and Cherry TomatoesBy Maydan, Washington, D.C.August 14, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintThe chefs at Maydan in Washington, DC, our No. 2 Best New Restaurant 2018, make this summer grain salad extra tart with lots of lemon juice. It can be served on its own or alongside creamy spreads or fatty pieces of meat.Ingredients8 servings1½cups whole freekeh, rinsedKosher salt⅓cup fresh lemon juice¼cup extra-virgin olive oil2Tbsp. pomegranate molasses1small red onion, finely chopped1cup coarsely chopped parsley2cups quartered cherry tomatoes, divided3Tbsp. savory leaves and/or mustard flowers (optional)Ingredient InfoPomegranate molasses can be found at Middle Eastern markets, some supermarkets, and online.PreparationStep 1Cook freekeh in a large saucepan of simmering salted water until tender, 30–40 minutes. Drain and rinse under cold water to stop cooking.Step 2Whisk lemon juice, oil, and pomegranate molasses in a large bowl. Add freekeh, onion, parsley, and two-thirds of cherry tomatoes; season with salt and toss to combine.Step 3Transfer salad to a platter and top with remaining tomatoes and savory leaves and/or mustard flowers, if using.Step 4Do Ahead: Salad (without savory and mustard flowers) can be made 6 hours ahead. Cover and chill.How would you rate Freekeh Salad with Parsley and Cherry Tomatoes?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladAmericanRed OnionOnionVegetableLemonCitrusFruitCherry TomatoTomatoParsleyHerbs & SpicesSummerEasySideDairy-FreeNut-FreeVegetarianVeganHealthyishSimmerFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Maydan", "Washington"]}