{"id": "72a0b4061cd369ddc10b4c60095726a7", "url": "https://www.bonappetit.com/story/reel-m-inn-carey-bolton", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "General Life Advice from the Owner of Portland’s Finest Dive Bar, Reel M Inn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsGeneral Life Advice from the Owner of Portland’s Finest Dive BarCarey Bolton runs the bar, kitchen, floor, and door of Reel M Inn by herself on its busiest nights. She’s a hero.By Marnie HanelJune 6, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.On Portland, Oregon’s de facto restaurant row, SE Division Street, Reel M Inn is an unchangeable dive bar serving Rainier tallboys and bewilderingly excellent (organic, even) fried chicken to off-shift chefs, old-timers, and newbies alike. Bartender turned owner Carey Bolton, who runs the bar by herself on its busiest nights, details its longstanding magic:Bartending is about customer service. In that sense, Portland is tough. A lot of places you walk in and you get a cold shoulder. There’s a lot of “Ugh. I gotta serve you?” And the Reel, as rusty and salty as we are, we’re a pretty welcoming community. It’s “Hey grab a stool. It’s gonna be two hours so make friends with your neighbor.”Photo by Chelsie CraigWe have a pretty simple model: We do chicken well, we pour deep shots, we have ice-cold beer, and there’s no place cheaper in town. We use organic chicken because it’s good, and it’s right. I would be hung if we did it any differently.You’ve got a team of regulars who are your bouncers. They take care of anything and everything that might come up. Someone, God forbid, is causing drama? They’ll take care of it for you. If somebody is sick, they’ll take care of it.Photo by Chelsie CraigThe regs know the place better than I do. They’re reliable. You just know that Gordie is going to show up between 4:30 and 5:30 and he’s going to have two PBRs and possibly a Jack Daniels, if his wife will let him, maybe not, and he’s gone by 7:30 on the nose. You can set your watch by it. Our trash guys went to Hosford School, a couple of streets away. They’re probably pushing 60, if not 65. You know, yellow mustaches from smoking. They’re like, “Man, I’ve been coming here for 150 years.” And you don’t doubt it.Photo by Chelsie CraigI don’t think you expect a lady when you walk through the door. (We have all lady bartenders and one dude, Ronnie.) It’s a badass move to be able to handle a bar on your own. No slight on Ronnie, but generally women are better multitaskers when it comes to...I have six drink orders in my head, I’ve got a bucket that’s down, I need to drop thighs in 30 seconds, I have a 30-second window to do that, I have the dishwasher running, and I’ve gotta go change my soda and grab two bottles of Jameson. And that’s in all of 12 seconds. If you can work at the Reel solo, you can do anything in life.Marnie Hanel is a writer in Portland and co-author of The Campout Cookbook.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRead MoresponsoredLibation Lessons: Expert Bartenders Share Their Secret IngredientsBy Bombay SapphirecultureEvery Bartender's Latest Obsession Is AmaroBy Brad Thomas ParsonscultureEverything I Know About Bartending, I Learned from My Korean MotherBy Ed Marszewski Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Marnie Hanel"]}