{"id": "72a4c91b843d8513e736c55767bafca4", "url": "https://www.bonappetit.com/story/late-summer-wines-yoda", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "5 Late Summer Wines from Danilo Marcucci, 'The Yoda of Italian Natural Wine' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 Late Summer Wines from 'The Yoda of Italian Natural Wine'Danilo Marcucci creates wines that are all brimming with their own terroir, personality, and stories to tellBy Marissa A. RossAugust 24, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailIn August, I introduced you to the Yoda of Italian natural wine, Danilo Marcucci. I’ll be the first to admit that even though I watch Star Wars, I honestly just love A New Hope—you know, the first one that wasn’t really the first one because it was the fourth episode. Whatever, young Harrison Ford is attractive and the movie’s magical storytelling changed cinema forever. I digress. You don’t have to know much about Star Wars to know that The Force is not only a power, but also a feeling, a philosophy, a discipline—and Yoda is a master. But The Force and Yoda mean nothing without the Jedis who study and harness The Force’s energy, uphold its ethics, and pass on its knowledge—just like Marcucci’s methods of winemaking mean nothing without the incredible winemakers he collaborates with.This is precisely what drives Marcucci and his work. After one of his early masters refused to allow anyone in the cellar to see the process, Marcucci disavowed the secrecy of winemaking and committed himself to sharing his techniques and principles with others. Marcucci now works with about a dozen wineries, although he’s constantly picking up new projects. He makes wine with people who’ve met him at parties, people who’ve recognized him in line at a wine shop, people who’ve straight up cold-called his house/castle/manor. His impact covers 585 miles of Italy’s 736-mile length, ranging from Puglia in southern Italy to Trento in the Italian Alps.But the truly impressive part of Marcucci’s expansive work is that each of the wineries he works with are still individual and unique. Despite drinking most of the wines he’s had a hand in, I had never heard of Danilo Marcucci up until I was nearly face to face with him—Marcucci helps winemakers express their land, their fruit, and themselves as naturally as possible. The wines are all brimming with their own terroir, personality, and stories to tell.I already told you all about the Vini di Giovanni “Cilligiozzo”. Here are five more producers (and rosy late summer bottles) to be on the lookout for to experience the influence of Italian wine’s very own Jedi Master, Danilo Marcucci.Photo by Marissa A. RossFurlani “Macerato” Pinot Grigio 2017, TrentoWinemaker: Matteo FurlaniThe wine that I simply scribbled “ALL THE FEELINGS!!!” about? Yeah. This is the wine. Matteo Furlani has a line-up of deliciously zesty wines from the Italian Alps, but the “Macerato” fully captures their magic. Furlani wines are most recognizable by their pastel candy colored hues, and the “Macerato” is an impossibly perfect powder pink that is surprisingly 100% Pinot Grigio with ten days of maceration (skin-contact fermentation).  It is faint and mineral on the nose, like getting a whiff of homemade seasoning salt with bay leaves and a hint of raspberry while passing it down the dining table. It is one of those rare wines that tastes just as good as it looks—like someone threw a scoop of raspberry sorbet into a glass of pink lemonade garnished with pine needles and tossed a few SweetTarts in for fun. But what I love most about the Furlani wines are how much you can taste Matteo, and his wife, Annalisa, in them. Each bottle tastes like Annalisa’s captivating and kinetic energy was wrangled and sculpted by Matteo’s razor-sharp focus. Wild yet concentrated, it’s an Alpine party in every bottle.Photo by Marissa A. RossTiberi “Il Musticco” 2017, UmbriaWinemakers: Frederico and Beatrice TiberiCesare Tiberi planted this vineyard back in the 1970s, and if you visit on a nice spring day and are lucky, you’ll find him amongst the vines, traditionally tying them to their posts using the clippings of last year’s vines. For years Tiberi was growing grapes and selling them off, but in 2012 the family started working with Marcucci to produce their own wines. Now, fourth-generation winemakers and siblings Frederico and Beatrice Tiberi make highly textural and mineral-driven wines, like “Il Musticco.” This sparkling 80/20 blend of Gamay de Trasimeno* and Ciliegiolo looks like unpolished rubies, and drinking it is like waltzing with a treasured memory from an adolescent summer. It smells like cherry-flavored Bonne Bell Lip-Smackers and tight red roses drifting on a sea breeze. You’d swear it was the best Shirley Temple you’ve ever had when you first sip it—fresh and fizzy cherry juice with a squeeze of lime that gives it a flirtatious acidity. But “Il Musticco” finishes with a long sigh of deep strawberries, red currant, a touch of tobacco, and plenty of sandstone. It’s the levity of youth and the weight of wisdom in a single glass.*Gamay de Trasimeno is not technically Gamay, it’s Grenache. This drives me bananas. It’s confusing for consumers, and if they weren’t going to use the word Grenache, I feel like the Italians could have at least made up another word instead of co-opting a totally different grape! I get it, it’s their “Gamay,” meaning it’s lighter than many of their other reds, but it is not Gamay like how we think of Beaujolais-glou-glou-slam-a-rama Gamay. It’s freakin’ Grenache, dude!Photo by Marissa A. RossVini Rabasco “Lu Cuntaden” Rosé 2017, AbruzzoWinemaker: Iole RabascoWinemaker Iole Rabasco owned a conventional winery she had inherited when she met Marcucci in 2009. But with his help and her determination, Iole sold all her commercial machinery and focused her winemaking into an old wooden press and a handful of tanks and 54-liter demijohns (large glass jugs used for fermentation). Thank freakin’ god because Vini Rabasco was the Italian wine that made me fall in love with Italian wine. I tried them a year after I’d visited Italy for the first time, and the wines took me straight back to Rome—vibrant, crazed, and somehow totally sophisticated. But Rabasco’s “Lu Cuntaden” Montepulciano rosé isn’t Rome to me—it’s a street fair in the tiny Abruzzo town of Città Sant’Angelo in August. It is the color of worn, neon red carnival lights that glow coral, and it smells like you’re elbow deep in watermelon and pithy grapefruits with hot cobblestone radiating beneath your feet. It tastes like sour cherry lemonade muddled with late summer raspberries and a hint of Kettle-Corn, with a pulsating acidity that will compel you to start dancing like your parents to a local dad band, and you’ve never been happier.Photo by Marissa A. RossCollecapretta “Lautizio” Ciliegiolo 2016, UmbriaWinemakers: Vittorio and Annalisa MattioliMarucci’s relationship with Collecapretta is an important one—the Mattioli family were neighbors of Marcucci when he was growing up in Southern Umbria. And, in 2005, Collecapretta was where Marcucci first bottled a wine he helped make. Apparently, they were never able to shake him. Winemakers Vittorio Mattioli and his daughter Annalisa make some of the most respected natural wines in all of Italy from their tiny eight hectare hamlet that has been in their family since the 1100s. Their “Lautizio” is an annual favorite of mine. It looks like a dark jam made of crushed and concentrated garnets, and smells like a cranberry campfire crackling with white pepper and cypress tree sap. When you first sip it, it tastes like biting into crunchy cranberries and red currants, but it finishes like a fine cherry liqueur served over cedar with a whisper of smoke, like an elegant waltz through the forest. Graceful but welcoming and familial, the “Lautizio” fills your chest with warmth like a good plate of pasta fills your stomach.Photo by Marissa A. RossVini Conestabile “Rosso” Sangiovese 2017, UmbriaWinemaker: Danilo MarcucciWell, well, well, look who it is. What can I say about Danilo Marcucci I haven’t already? Without writing a whole other essay, I’ll just say he’s an Aquarius, a Sinatra fan, and makes one hell of a Sangiovese. His “Rosso” is dusty garnet in color and the bouquet is like a late spring dusk—cool but humid—settling upon a valley of plums, strawberries, oranges, and tomato leaves. Its palate leans fruity and romantic with juicy pomegranate and cherry. There’s  a melodic acidity that trembles like a mandolin, but it also doesn’t skimp on the savory with notes of flowering thyme stowed away in a cigar box. The “Rosso” is light but feels full, like sitting down for a dinner with loved ones. It’s extremely food friendly and, in fact, should be taken to every dinner you want filled with love and laughter.Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-24", "author": ["Condé Nast", "Marissa A. Ross"]}