{"id": "72a685e3c53a8e8ddc98d8d93acce935", "url": "https://www.bonappetit.com/recipe/low-and-slow-rib-roast", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Rib Roast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueLow-and-Slow Rib RoastBy Alison RomanAugust 13, 20194.6(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis rib roast is rubbed with a punchy mixture of rosemary, anchovies, and garlic. The reverse sear (starting low and slow, finishing hot and fast!) is excellent when cooking large cuts of meat for a crowd, not only for its foolproof results, but because it’s the ultimate do-ahead. Slow-roast it up to two hours before guests arrive, then finish in a hot oven at the last minute. This is the stunning main course from Alison Roman’s “Steak House Night in America” menu, alongside: Martini Bar, Baked Potatoes Deluxe, The Greatest Creamed Greens, and Upside-Down Apricot Tart.Recipe adapted with permission from Nothing Fancy: Unfussy Food for Having People Over by Alison Roman (Clarkson Potter, an imprint of Penguin Random House, LLC). Copyright © 2019. Ingredients8–10 servings13-bone standing beef rib-eye roast, chine bone removed (6–6½ lb.), bones unfrenchedKosher salt, freshly ground pepper10oil-packed anchovy fillets (from about one 2-oz. tin or jar), plus more for serving, if desired6sprigs rosemary, divided6garlic cloves, finely grated¼cup extra-virgin olive oil¾cup finely chopped parsley, plus more for servingFlaky sea saltPreparationStep 1Season roast all over with salt and pepper (use about 1 tsp. Diamond Crystal kosher salt or ½ tsp. Morton kosher salt per pound; this guideline is especially important with large cuts of meat). Place roast on a wire rack set inside a large rimmed baking sheet (this setup will keep the meat from sitting directly in the liquid that will get drawn out by the salt, allowing it to cook more evenly later). Let sit at room temperature at least 2 hours, or cover and chill up to 2 days. If you’re chilling the meat, move it back to the counter and let it sit at room temperature for the final 2 hours. Taking the chill off of the roast before it goes into the oven means it will cook in less time.Step 2Meanwhile, finely chop 10 anchovies and 2 rosemary sprigs. Transfer to a small bowl and add garlic and olive oil. Mix well to combine and season with salt and pepper.Step 3Preheat oven to 250°. Scatter remaining 4 rosemary sprigs across another rimmed baking sheet. Place meat on top and smear anchovy mixture all over. Roast until an instant-read thermometer inserted into the thickest part registers 110° for medium-rare, 2–2½ hours (temperature will rise as it sits; it should eventually hit 125°). Let rest at least 30 minutes.Step 4About 20 minutes before you want to sit down to eat, increase oven temperature to 500°. Roast meat on the same baking sheet until fat is golden brown, 10–15 minutes. Transfer roast to a cutting board, leaving any pan juices behind. Remove rosemary sprigs from baking sheet; discard. Add ¾ cup parsley to juices and stir to coat. Transfer to a small bowl.Step 5Slice roast away from bones (you can separate bones and crisp up in the oven or serve them as they are). Slice meat to your preferred thickness. Arrange on a platter and pour parsley mixture over. Sprinkle with sea salt and more parsley. Serve with more anchovies alongside if desired.Step 6Do Ahead: Meat can be roasted 2 hours ahead. Store loosely covered with foil at room temperature.How would you rate Low-and-Slow Rib Roast?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleOh man! I can’t believe this doesn’t have more reviews! I wound up with an 8lb roast, but followed the temp directions (I used an igrill probe to alert me when it reached 110. And it came up to temp nicely.) I DID take it out an extra 40 mins early, and it sat for about 4 hours before we put it back in to crisp up , bc I started it to early (I was worried it would take forever) all told it took about an extra hour 20 with sitting out and cooking) \nI sliced the roast thin, and we had enough for 9 people with at least a pound of left overs.  And I didn’t even serve the bones! (Make sure you serve the bones! Man they’re good!) I didn’t double or increase any of the other ingredients and we felt it could use more garlic and a lot more salt (even tho I let it sit 2 days in the fridge covered in diamond crystal) BUT our roast didn’t produce any juices, only oily fat on the tray, so I didn’t toss the meat in the parsley oil and I really think that was a drunken mistake. I think that’s where all the flavor was (I decided as I gnawed on the bones the next day) \nBUT this produced a most beautiful rare all the way roast and it was well loved by everyone.  Get some horseradish. Spring for the Ortiz anchovies (get two tins) \nAnd don’t be put off by the lack of reviews. This roast is glorious. AlohalifeAustin TX12/29/2021Would this recipe work with a lamb rack as well? And if so, is there anything to watch out for or change?Julia H.Zurich, Switzerland2/25/2021Making this roast for the third time! It’s a keeper of a recipe. Not too much rosemary for me. The anchovies are best, but I have also replaced them with capers for folks who are squeamish about fish. KateAsheville, NC 12/25/2020This tasted superb! I was worried about previous comments about too much rosemary, so I used thyme leaves for the paste and rosemary for the baking sheet. Perfection!\nIt was a challenge to calculate the proper cooking time for a 9lb roast.   We pulled it out at 3 hours when the thermometer read 114,  let it sit 45, hen back in the 500 oven for 15 mins. After the smoke alarms calmed down, we took the meat out & saw it was only at 135.   So had to put it back in for another 40 mins to keep cooking.AnonymousSan Pedro CA12/26/2019This recipe was amazing! A very flavorful crust and it looks beautiful too. Will definitely make again.AnonymousCalgary, AB Canada12/23/2019Okay, but... can I do this in the instant pot?AnonymousIreland12/12/2019This turned out perfectly. I was a little worried about the anchovies and almost left them out, but I’m glad I didn’t as they just added interest to the normal garlic and rosemary combo and weren’t fishy at all. Everyone commented on how delicious this roast was (not to mention how fancy it was in presentation) and I got requests for the recipe afterward. It is a great main for a cozy dinner party. That, combined with how low stress this recipe is, makes it a keeper. I will definitely make this again— probably for Christmas Eve dinner.Anonymous11/29/2019I don’t eat red meat so I made this for my mother and she thought the rosemary was overwhelming. She had no appetite after the first bite. AnonymousBrooklyn 10/20/2019Explore Bon AppétitRib RoastBeefMeatMainDairy-FreeGluten-FreeNut-FreeKetoRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Alison Roman"]}