{"id": "72c0c532e67463bfab92b1fcfe7d390a", "url": "https://www.bonappetit.com/story/crisy-tofu-never-fail", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "I’ve Always Liked Tofu, But This Crispy Tofu Recipe Made Me Looooove It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’ve Always Liked Tofu, But This Recipe Made Me Looooove ItIn which I’ll try to convince you that tofu is “sexy.”By Elyse InamineOctober 25, 2019FacebookTwitterEmailcrispy tofuPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I grew up in a tofu household, and we ate it in many forms. Wobbly, barely-holding-together silken tofu cubes, doused in inky shoyu and sprinkled with wisps of scallions. Medium-firm hunks, sunken at the bottom of miso soup. Very solid square units, thrown into a well-oiled pan and attentively nudged and flipped until each side was pocked with burn marks.It was less that I liked tofu and more that it was a requisite protein. If these dinners were an early 2000s teen rom-com, tofu would be the geeky wallflower (with amazing cheekbones hidden by thick-rimmed glasses), always around but never really noticed.Fast-forward to summer 2019. The Feel Good Food Plan dropped and there was tofu—but like I’d never seen it before: It was high gloss and heaped atop of tahini-laced noodles with gingery cucumber slices. Cue all the wallflower transformation scenes in She’s All That and The Princess Diaries (glasses, begone!). Tofu is pretty hot, huh?In this recipe, the humble protein gets a serious makeover. First it’s lightly fried in a pan until golden and crispy all over, and then it’s glazed with an addictive shoyu-honey-chile sauce until it achieves the extremely satisfying state of crispy-gone-soggy. The dry, crunchy exterior acts as a sponge for the thick, saucy glaze. Think of it like the tofu version of Panda Express orange chicken (and don’t be mistaken: That’s a huge compliment).But what makes this recipe even better is the noodles and the quick pickles. When soba is tossed in nutty tahini and a little bit of rice vinegar, you get something akin to cold sesame noodles but with more richness and depth. The Persian cucumbers, salted, squeezed, and tossed with rice vinegar, are the perfect fresh, puckery counterpoint.Nowadays, tofu isn’t an afterthought or a supplement but the thing I most look forward to for dinner. I only cook based on impulse and craving, and this recipe has become my go-to when I can’t make up my mind.I’m still living in a tofu household. But this time it’s because I love it like it deserved to be loved all along.Get the recipe:Sesame Noodles with Crispy TofuThe trick to this recipe is using the pan sauce as a base for the sesame noodles.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-25", "author": ["Condé Nast", "Elyse Inamine"]}