{"id": "72caefef241c409be428b93af7ef4aa5", "url": "https://www.bonappetit.com/story/food-tv-during-ramadan", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "My Family's Ramadan Tradition Meant That TV Was Off-Limits, With One Exception | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTV Was Off-Limits During Ramadan, With One ExceptionWatching the Food Network as a kid helped influence the way I cook.By Zaynab IssaApril 27, 2021FacebookTwitterEmailIllustration by Nishat AkhtarFacebookTwitterEmailFor Muslims all over the world, the month of Ramadan is a time of deep spiritual reflection; we fast from dawn until sunset and attempt to exclusively enjoin in good by maintaining clean minds. As kids, my siblings and I could read, play outside, pray, experiment in the kitchen (my preference), take naps (also my preference), do Kumon (most definitely not my preference), but what we could not do was watch television. My parents hoped that by keeping us away from the TV, they could prevent us from seeing or hearing anything “bad.” There was, however, one exception to their rule: the Food Network.I know that seems counterintuitive—maybe even torturous—to watch people cook and indulge in mouthwatering meals throughout our 16-hour fasts. But food is inherently good, and its absence and presence is central to Ramadan. Muslims fast as an exercise in grounding, mindfulness, and gratefulness; it’s a way to remind ourselves of the privilege of food. So if the month is about enjoining in good, my parents’ exception made perfect sense.To be completely honest, fasting as a child can be pretty dull, and that’s mostly because it’s just harder to fill the time—there’s no hectic schedule filled with meetings and responsibilities to pass the time. The weekdays offered a busy-ish schedule that definitely made things easier; I remained entirely occupied with school from 8 a.m. to 3:30 p.m. Then I’d come home, plop down on the living room sofa and nap undisturbed until it was time to break fast for iftar. We’d eat as a family, clean the kitchen, recite passages from the Quran along with other supplications rooted in practicing gratitude, then I’d do my homework, and the cycle would repeat. On weekends I could sleep until noon, and don’t get me wrong, cutting those early five hours from my fast really helped move the day along, but then what? That’s where the Food Network came into play.What would iftar be without creamy karak chai and mandazi?\nPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyTelevision programming in the food industry offers a unique opportunity for both education and entertainment, which I realize now is probably why my parents preferred us to watch Giada at Home as opposed to reruns of Gilmore Girls. Unlike the short-form recipe content now common on social media, the half-hour shows that aired on the Food Network offered a productive timepass. The hosts shared advanced techniques and processes, and 10-year-old me absorbed them like a sponge. I learned the versatility of pantry items from Semi-Homemade Cooking with Sandra Lee, the euphoria of classic comfort foods from Guy Fieri’s Diners, Drive-Ins and Dives, the importance of efficiency from Rachel Ray’s 30 Minute Meals, and the value of fresh produce and quality ingredients from the culinary queen Ina Garten’s Barefoot Contessa. When it came time to start preparing for iftar with my family, I could take the techniques I had learned and apply them. I knew exactly what I needed to do to make the dough for mandazi (a mildly sweet, hollow East African doughnut); I had seen Ina bloom yeast in warm milk with sugar, stir in the flour, and work a similar dough until it became smooth and elastic.Interestingly enough, very few of the dishes I’d seen prepared on TV ended up on our dinner table during Ramadan. Instead, we often celebrated classics from my East African and Indian culture. Kuku paka (an aromatic coconut curry) sat beside a glass Pyrex container piled high with fluffy, long grain basmati rice, along with a plate of crispy ground beef samosas still hot from the fryer, a cooling coconut chutney, fresh whole green chilies, a plastic Rubbermaid container filled with imported (and usually gifted) Medjool dates, a salt shaker, and arguably the most essential Ramadan menu item: a glass kettle filled to the brim with golden, creamy karak chai.Eventually, the techniques and dishes I learned from watching the Food Network started shaping my palate, inspiring my own experimentation with different cuisines. Paying such close attention to the process of cooking ended up influencing the way I cook—with patience, organization, and a deep love for not just the final dish but the way that food is prepared. Fasting each year reminds me of these same ideas, how food is something to be grateful for, and a source of pure joy.To this day, I limit my TV time during the month of Ramadan, though I do indulge in other food-focused forms of media, like a Netflix docu-series or short videos on YouTube. I still make mandazi because it’s the perfect involved-yet-lazy distraction from the 16-hour fasts, and though I do make kuku paka every once in a while, I set the table with my own inspired additions. A bowl of kale salad tossed in a dijon-maple vinaigrette sits beside a dish of Medjool dates, along with a casserole dish bubbling with baked ziti, a pinch bowl of maldon salt, a shaker filled with crushed red pepper flakes and, of course, the glass kettle of golden, creamy karak chai.Get the Recipes: Karak ChaiRecipe developer Zaynab Issa’s Karak Chai is richer than most cups of tea, thanks to its generous use of evaporated milk and hints of vanilla, cinnamon, and cardamom.  View RecipeMandazi (Mahamri)This East African snack is fluffy, crispy, and mildly sweet—like the best parts of French beignets and American old-fashioned doughnuts combined into one bite.View RecipeKuku PakaThis version of the classic East African-Indian chicken curry will help you see your broiler in a whole new light.View RecipeExplore Bon AppétitRamadanFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-27", "author": ["Condé Nast", "Zaynab Issa"]}