{"id": "72cf66e135d88cb65f00b03b03a09e7f", "url": "https://www.bonappetit.com/recipe/grilled-chile-lemongrass-short-ribs-with-pickled-daikon", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Short Ribs with Pickled Daikon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Short Ribs with Pickled DaikonBy Andy BaraghaniMay 22, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintIf you’ve ever had kalbi at a Korean barbecue restaurant, you’ve had grilled flanken-style short ribs. For this recipe, look for them prepackaged in the meat case, or ask your butcher. This concentrated, aromatic, spicy-sweet chile paste seasons the ribs robustly in as little as 15 minutes.Ingredients4 servings 4red Fresno or 3 serrano chiles, halved, seeds removed3lemongrass stalks, bottom third only, tough outer layers removed, coarsely chopped13\" piece ginger, peeled, thinly sliced3garlic cloves, smashed1Tbsp. light brown sugar1tsp. toasted sesame oil¼cup vegetable oil, plus more for grill5Tbsp. seasoned rice vinegar, divided3lb. ¼\"–½\"-thick crosscut bone-in beef short ribs (flanken style)Kosher salt6oz. daikon, peeled, halved lengthwise, thinly sliced crosswisePreparationStep 1Purée chiles, lemongrass, ginger, garlic, brown sugar, sesame oil, ¼ cup vegetable oil, and 3 Tbsp. vinegar in a blender or food processor until smooth. Place ribs in a glass baking dish; season generously with salt on both sides. Pour chile paste over and turn ribs to coat. Let sit at room temperature at least\n15 minutes and up to 1 hour.Step 2Prepare a grill for high heat; oil grate. Remove ribs from dish and grill until lightly charred and crisp around the edges, about 2 minutes per side. Transfer to a platter and let rest 5 minutes.Step 3While the ribs are resting, combine daikon, a pinch of salt, and remaining 2 Tbsp. vinegar in a medium bowl and toss, massaging with your hands until slightly softened.Step 4To serve, scatter daikon over ribs, leaving any liquid in bowl.How would you rate Grilled Short Ribs with Pickled Daikon?Leave a ReviewTell us what you thinkExplore Bon AppétitRibsKoreanEast AsianAsianShort RibBeefMeatChileVegetableDaikonQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}