{"id": "72d12ba6b00477a81debd908436eea13", "url": "https://www.bonappetit.com/story/easy-peel-hard-boiled-eggs", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Tips for Easy-Peel Hard-Boiled Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Hard-Boiled Eggs That Are Actually Easy to PeelBecause no one has time to spend 15 minutes peeling an egg.By Sarah JampelMay 5, 2021FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailWhy can't all hard-boiled eggs be easy-peel hard-boiled eggs? For a food that seems so simple to make (eggs + water), boiled eggs can be utterly infuriating—especially when it comes to the peeling. You've been there: All that's standing between you and egg korma (or egg salad) is a bunch of just-boiled eggs and yet it's taking you 15 minutes to peel each one and you're removing huge gashes of white with every tiny shard of stubborn shell. It's enough to drive you mad, even if you aren't very, very hungry.The truth of the matter is that making easy-peel hard-boiled (or soft-boiled!) eggs starts well before you get to the peeling. It begins with the eggs you choose, how you cook them, and how to treat them once your timer (yes, you must set a timer) dings. For eggs with yellow yolks set to your liking and pearly, smooth, unblemished exteriors, follow these guidelines for how to make hard-boiled eggs:1. Don't use super-fresh eggs. Farm-fresh eggs are going to be harder to peel—it's a matter of their particular chemistry. To minimize frustration, save those straight-from-the-hen eggs for frying and scrambling and use a carton from the grocery store when you're boiling. 2. Start the eggs in boiling water. Eggs added to boiling water rather than brought to a boil in the pot along with the cold water will be easier to peel. Plus, when you're boiling eggs with the intention of jamminess—say, for soy-marinated eggs, this method allows for more precise timing. (Otherwise, you'll have to watch closely to observe the exact moment the water comes to a boil.)The biggest risk with adding eggs to boiling water is that they'll crack and end up deflated and lopsided. To minimize that risk, scoot them in gingerly, using a spoon, then maintain a gentle simmer rather than a vigorous bubble so that they don't knock around in the pot. Cook up to 8 eggs in a 2-quart saucepan—more than that and they might butt heads and crack open.3. Set a timer. That’s 7 minutes for jammy eggs with firm but gooey yolks, 10 minutes for cooked through (but not chalky). If you’re using XL or jumbo eggs, you’ll need a bit more time.4. Use an ice bath. Unless you halt their cooking, that timer was for naught. Let the eggs hang out in the cold water for a couple of minutes, until they’re just cool enough to handle, 2–3 minutes.Using an ice bath helps halt the cooking process. Carry-over-cooking, be gone!\nPhoto by Ted Cavanaugh5. Peel the eggs under the water while they’re still slightly warm. This keeps the pesky shells—which should slip off fairly easily—contained. It also helps if you crack the egg at the fattest end, where you'll find the air pocket, and peel from there. If you're still having trouble, peeling eggs under a running faucet can help the shells slide off.Keep any eggs you won't be using right away unpeeled, though—they'll last longer that way!—and store in an airtight container in the fridge for up to 1 week.Peeled eggs, full heart, can't lose:Jammy Eggs with Paprika AioliLike deviled eggs—but faster, easier, more delicious, and fancier-sounding.View RecipeExplore Bon AppétitHard-Boiled EggsEggRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-05", "author": ["Condé Nast", "Sarah Jampel"]}