{"id": "72d9e75a671d8931e188e547920bf88a", "url": "https://www.bonappetit.com/story/heatwave-baking", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Baking a Seven-Layer Cake in a Heatwave | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow (and Why) I Made a Seven-Layer Cake in a Heat WaveBecause sometimes desperate times call for 30 eggs.By Christina ChaeySeptember 5, 2021FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyFacebookTwitterEmailI remember exactly what I was doing during the blackout of 2003, which left a huge swath of the Northeast without power on a relentlessly hot August afternoon. I was in the middle of baking my “signature cake,” the one I got recruited into baking for all of our family events: Duncan Hines Devil’s Food from a box, frosted with Martha Stewart’s chocolate ganache (from a printed recipe I guarded like a treasure), filled with a layer of strawberries, the sides coated in sliced almonds. The second the lights, oven, and AC shut off, I remember my mother scolding me for baking a cake on the hottest day of the year (as if I could have predicted the outcome), though the heat didn’t bother me.Baking in heat waves is a compulsion that’s stayed with me all these years, though I’ve since traded box mixes and Martha for genoise and Mary—Berry, that is. The second the temperature crosses 80°, a subconscious impulse kicks in that compels me to break out the butter, and I become a baker possessed, turning out trays of scones, biscuits, and cookies like I’m vying for Star Baker. Which is how a few weeks ago I spent 36 hours baking this seven-layer confection of genoise sponge, mango curd, and vanilla bean Swiss meringue buttercream for absolutely no reason.I remember when the pastry chef Natasha Pickowicz came into the test kitchen back in 2018 to shoot a magazine story featuring her impossibly chic (and complicated!) layer cakes. Aside from being wowed by the sheer amount of work involved in making the individual cake components, I remember being blown away by her nature-inspired decorations: blue thistles, golden husk cherries, tomato skins that had been dehydrated to look like giant, fantastic petals. I also remember thinking, I will never, ever make this cake. Who has the time! Who has the patience!I’m still figuring out the patience bit, but in the absence of the usual summer balms (jam-packed barbecues, late-night house parties, beach trips in crammed cars), it turns out time is pretty much all I’ve had these days. And when you’re bored of going nowhere and seeing no one (I am being hyperbolic, but not by much) and craving a dose of the fantastic, the extraordinary, the outrageous, sometimes a temporary salve can come in the form of a truly ridiculous cake that requires 28 eggs, multiple trips to the farmers market, and two days to make (also two weeks to eat). I’m not convinced I’ll ever make another one, but that’s okay. This one did its job.Not Cake, But Still Good:Photo by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeCoconut Tofu Stir-FryBlueberry and Peach Graham GaletteVietnamese Tomato SaladSpicy Pickled Summer BeansShrimp and Basil Stir-FryHot Honey WingsExplore Bon AppétitWhat's Chaey Cooking?LifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Christina Chaey"]}