{"id": "72df16c1cb8af29a76b5244a57775e1f", "url": "https://www.bonappetit.com/recipe/chicken-and-cheese-tamales-with-green-chile-sauce", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Chicken & Cheese Tamales with Green Chile Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredChicken & Cheese Tamales with Green Chile SauceBy Marisel Salazar December 7, 20214.0(2)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIngredientsFor the tamale masa (dough):2cups of lard or vegetable shortening31/2 cups of chicken broth1Tbsp. of salt2Tbsp. of baking powder2Tbsp. Sazón or annatto4cups instant corn flourFor the filling:2pounds boneless, skinless chicken or rotisserie chicken1pound tomatillos, husked, rinsed3-4serrano chiles, stemmed, deseeded1medium onion, quartered6anaheim peppers, New Mexico chiles or green poblano peppers1cup fresh cilantro, washed3garlic cloves1/2 tablespoon salt or 1 chicken bouillon cube16oz whole or shredded mozzarella, Oaxaca cheese, Monterey Jack cheese or queso frescoEquipment:KitchenAid® Stand MixerAluminum foilPutty knifeIce cream scoopPreparationFor the masaStep 1In the KitchenAid® Stand Mixer with the wire whip attachment, whip shortening or lard for about 20 minutes on medium-high speed until fluffy peaks form — similar to frosting or a meringue. Lard will change from yellow to very white. Continue mixing on medium for about 5 more minutes while you prepare the broth.Step 2In a separate bowl, whisk together broth, baking powder, salt and sazón or annatto. Working in batches, slowly pour broth into KitchenAid® Stand Mixer stainless steel bowl with the whipped shortening or lard and whip until it incorporates into the fat. Do not pour all at once, wait until broth incorporates into shortening/lard before adding more liquid. Mix for about 5 minutes.Step 3Once broth is incorporated, switch out the wire whip for the flat beater attachment. Add corn flour cup by cup into the whipped lard and broth mixture. Continue beating on medium high until the dough is whipped and smooth, about 15 to 20 minutes.To test if your masa is ready, fill a cup of water and drop a tablespoon of the dough into the water. If it floats, the masa is ready. If it sinks to the bottom, then your masa needs more liquid or fat. Cover bowl with plastic wrap and set aside.For the fillingStep 4Boil or bake the chicken until it is cooked through. The chicken is done when a meat thermometer inserted into the center reaches 165 degrees F. Place in the cooked chicken into KitchenAid® Stand Mixer stainless steel bowl. Using the flat beater attachment, shred on low. Alternatively you can used warmed, skinless rotisserie chicken and follow the same shredding process. Set chicken aside.Step 5To prepare the green chile sauce, place tomatillos, chiles, and onion in a large pot and cover with water. Bring to a boil and reduce heat and cook for 20 minutes until soft. Do not over boil and let the tomatillos burst.While the vegetables are boiling, roast peppers until they are charred and blistered. Remove from heat to a bowl and cover with foil. Let sweat for 20 minutes. Once cooled enough, use your hands to remove the charred skin and seeds.Drain boiled vegetables and blend with cilantro, garlic, the roasted peppers, and salt or bouillon until smooth.Step 6In a large saucepan, warm blended green chile sauce over medium heat. Add shredded chicken and simmer for 10 minutes. Remove from heat and allow to cool about 5 to 10 minutesTamale AssemblyStep 7Roll out a 9x9 inch sheet of aluminum foil  on a flat surface. Take about 2 tablespoons of masa in the center of the foil and, using a putty knife, spread thinly downwards almost to the edge, leaving a border.Put about 1 to 2 tablespoons of the chicken chile filling in a line down the center and add a line of cheese alongside it, leaving some space around the edges. Fold one side of the tamale over itself and press down. Wrap to form a rectangle and seal. Roll up open edges of the foil until tight. Repeat with remaining masa and filling.Step 8Fill the bottom of the pot with a steamer insert with about 2 inches of water that reaches the bottom of the insert. Crumple a large sheet of foil to form a 3-inch diameter ball. This will act as the support for the tamales to stand upright. Place the ball in the center of the pot filled with water and lean tamales with the seam side out. Bring water in the pot to boil then reduce heat to medium-low. Cover pot and steam tamales until dough is firm, about 40 to 45 minutes. Add more water if the liquid amount gets low.Step 9To check doneness, remove a tamale from the pot. When cool enough to handle, unwrap: If dough sticks to the wrapper or foil, rewrap and return to the pot to steam for about 5 more minutes.Step 10When done, remove tamales from the pot and let rest for 5 to 10 minutes. To serve, place unwrapped tamales on a plate and drizzle with green chile.How would you rate Chicken & Cheese Tamales with Green Chile Sauce?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-07", "author": ["Condé Nast"]}