{"id": "72e4a3354ba3019114a84689c8b2e60a", "url": "https://www.bonappetit.com/story/original-recipe-contest", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Get Your Brilliant & Original Recipe Published on Bon Appétit! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGet Your Brilliant & Original Recipe Published on Bon Appétit!We want to tell the world about your amazing... chicken? cookies? casserole? You tell us!By Bon AppétitJanuary 31, 2018FacebookTwitterEmailFacebookTwitterEmailDo you have the best brownies in all the land? Are you famous for your chicken cacciatore? We want to spread the word!In April, we're excited to feature several reader-created recipes on the site (those cookies pictured above came from reader Kate Davis last year and we're obsessed).Here's where to share your recipe:Email staff.bonappetit@gmail.com with your original recipe by February 15. And tell us a little about it—is it a signature dish of yours? Something that was passed down over the generations? We want the backstory! And we want to know why it tastes really good. This should be a recipe that's accessible to home cooks, not a multi-day project.Once we select the winners, the Test Kitchen will get busy cooking through the recipes, which means that we may make some small modifications. Then, we'll photograph the dish and feature it on the site, on our social media channels, and in our newsletter.We'll be in touch with the winners—sorry in advance that we cannot respond to all inquiries. Please limit submissions to two recipes max. Can't wait to see what you've got!For fine print and full contest rules, see here.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Bon Appétit"]}