{"id": "72e6a2b74f7badc6ee25fcd6f3497f05", "url": "https://www.bonappetit.com/story/pankio-sports-water-bottle-multiverse", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "What Size Is the Pankio Sports Water Bottle? We May Never Know | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCan You Please Figure Out the Size of This Water Bottle, Because I Can’tAccording to its product images, the Pankio sports water bottle is both larger than a tennis racket and smaller than a dog’s head.By MacKenzie Chung FeganFebruary 14, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.In Hervé Le Tellier’s Goncourt Prize-winning novel, The Anomaly (spoilers straight ahead), an airplane traveling from Paris to New York emerges from a storm and lands safely at JFK—and then, three months later, the same plane reappears in the sky. Like, the exact same plane. Same flight crew, same passengers, all duplicates of people who have been living on Earth for the past three months. The doppelgangers must learn to inhabit the same world despite branching lives—one woman is two months pregnant; her double is not. The plane’s captain is days away from death, riddled with cancer; his double has three more months to live. Is this all proof that “reality” as we know it is a simulation? That there’s a great photocopier in the sky?These questions and more—so many more—flitted through my head as I examined this Amazon listing for the half-gallon, BPA-free, leakproof Pankio sports water bottle, which my colleague Tiffany Hopkins recently wrote about. Its product images show hale, sporty individuals in scenes of exercise and leisure. In one, a blonde woman on a yoga mat engages her left glute while holding tabletop position. In another, a man wearing suede ankle boots sits casually on a flight of steps. Beside both of them: a Pankio sports water bottle with anti-slip handle and flip-top lid.Screenshot via AmazonIn each image, the size of the bottle in relation to its human companion differs wildly. For Yoga Woman, the Pankio water bottle looks longer than her forearm. But Suede Boot Man easily palms the top of his Pankio, which extends not halfway up his shin. We are left with two conclusions—one, that the Pankio water bottle retains its physical integrity in all scenarios, and the size of humans varies beyond our current perception. The other, that the size of humans is fixed, within a certain spectrum, and the Pankio water bottle can and does exist in myriad corporeal forms simultaneously.Is the Pankio water bottle bigger than a tennis racket? Smaller than a golden retriever’s head? Should I carry my dog in a backpack? The answer to all these questions is yes. The cat in the box is both alive and dead. The Pankio water bottle contains exactly one half gallon of water and also the multitudes of the ocean. The deeper I delved into the cosmology of Amazon, the more evidence I found that the physical world is capricious. These TeamFar sheet pans, for instance, hold asparagus larger than a meat cleaver but can also fit easily into a toaster oven. In quantum mechanics, particles retain a fixed state—heads or tails, if you will—when observed, but these same particles exist in multiple states at the same time when not observed. When I’m not shopping for water bottles and sheet pans, do they exist in infinite sizes, shapes, and colors at once?In his seminal work The World as Will and Representation, Schopenhauer writes, “Die Welt ist meine Vorstellung,” which roughly translates to “The Pankio water bottle is but my representation.” Is it possible to have objective knowledge of the world? Although I have watched a Pankio video review by Amazon user EsteeDarla, I have not held the Pankio water bottle. I have not sipped from its phthalate-free food grade plastic lid. But within this vast multiverse, among the infinite Pankios scattered through the beyond, somewhere a MacKenzie Chung Fegan is playing tennis, her Pankio water bottle stood in the middle of the court beside her.Photo by Emma FishmanPANKIO Water Bottle$16 at AmazonExplore Bon AppétitCultureShoppingLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}