{"id": "72f5e486342b02fc3adea6cbf45a115d", "url": "https://www.bonappetit.com/story/never-fail-spicy-peanut-sauce-recipe-salsa-macha", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "The Spicy Peanut Sauce Recipe Is Basically Just Homemade Nut Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spicy Peanut Sauce Recipe Is Basically Just the Best Homemade Nut ButterIt’s tangy and it’s rich and it's pretty much the best sauce ever.By Emily SchultzMarch 1, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.By the end of this article, you’re going to be making your own nut butter.Can you believe that? YOU! The person who eats a spoonful of cashew butter for breakfast. Who can’t have apples without a side of almond butter. Who spends way too much time thinking about the scene in The Parent Trap where Annie and Hallie realize they MUST be twins separated at birth after discovering their shared love of Oreos and peanut butter.(No? Not you? Yeah you’re right. That’s all me. Sorry about that!)But seriously, salsa macha is essentially just an excuse to make ultra-spicy homemade peanut butter—and it's the peanut sauce recipe to end all peanut sauce recipes. Once you make it, you’ll realize that making homemade nut butter is just pulsing roasted nuts in your food processor until they form a thick paste. In this case we're also incorporating some savory and spicy things—like fried garlic, fried chiles, and the oil they both were fried in—to make a sauce, but the idea is still there. Nut butter is just toasted nuts buzzed in the food processor. Who knew??Moving on. Our recipe comes from the amazing Daniela Soto-Innes, chef of Atla and Cosme in New York City, and I feel like we are forever in her debt for this one. Salsa macha originally comes from Veracruz, Mexico and is made with peanuts, garlic, olive oil and chiles.  In Veracruz, it’s often served alongside quesadillas, but I've served it as a dip for chips and veggies, a sauce for fried eggs and grain bowls, a spread for sandwiches, and probably in a bunch of other ways I can't remember. Okay, ready to do this thing for real?First you peel six cloves of garlic and sizzle them in 1¼ cups of neutral oil (like peanut, canola, or vegetable) on the stove. You can keep them whole because all we want is for the garlic to impart flavor onto the oil—hence us choosing a neutral oil over something like olive or sesame with a distinct flavor. (You’re not going to use these cooked cloves of garlic in the actual salsa macha, so feel free to snack on them or mash them into a paste to schmear on your next roast chicken!)Next, you’re going to fry 1 cup of raw, unsalted peanuts in that now-garlicky oil. You just want them to turn golden brown and start to smell really peanut-y smell, which will only take around two minutes. Then use a slotted spoon to get those toasted peanuts out of the oil and spread them out onto a baking sheet to cool quickly.Now it’s chile time! This recipe calls for dried pasilla chiles and ancho chiles AND chiles de árbol, which is kind of...extra. You can find all of these online or at a Mexican grocery store, and whatever you don't use for this recipe can be used in soups, this red chile chicken, or...more salsa macha, naturally. You’re going to de-seed the pasilla and anchos and then drop each of the chiles individually into the hot oil (use tongs!) until they’re puffed up and slightly darkened. That should take around 30 seconds to a minute, so keep an eye on them! (You can obvs dial the amount of chiles you use up and down depending on your heat preference. TBH it'd probably be good with no chiles at all.)Now that everything is cooked and has had time to develop serious flavor on its own, into the blender everything goes. We’re adding the chiles and the peanuts to a food processor and pulsing until they’ve broken down a decent amount. Then we’re going to take that oil we cooked everything in and slowly stream it in while the food processor is on. Once it looks like all of the peanuts and chiles are finely chopped and incorporated with the oil, you can turn it off. Season it with salt and let it cool down before slathering it all over everything you plan on eating for the next week.And voila! You just made a spicy, garlicky, savory peanut sauce! It's so good, it might even reveal a long lost sibling.Get the recipe:Salsa MachaThink of this as a chile-laced peanut butter you’ll want to put on everything, from tacos to fried eggs. It’s delicious and not at all as intimidating as it sounds.View RecipeExplore Bon AppétitBasicallyNever FailPeanutPeanut ButterSauceSalsaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Emily Schultz"]}