{"id": "72f88a433f58ee97fbd7b4b800deb57f", "url": "https://www.bonappetit.com/recipe/radish-rainbow-salad", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Radish Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueRadish Rainbow SaladBy Molly BazAugust 1, 20184.4(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintWhy make a salad of only red radishes when you can use a mix of Easter Egg and Watermelon radishes too? Going to the farmers’ market is the time to be shamelessly superficial, picking these up in place of the more commonplace varieties at the supermarket. They’re equally delicious and infinitely more stunning. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings 1lb. mixed radishes, trimmedKosher salt1lemon, halved3oz. Piave cheese or Parmesan, divided½cup basil leaves, torn if large2Tbsp. extra-virgin olive oil, plus more for drizzlingFlaky sea saltFreshly ground black pepperPreparationStep 1Thinly slice half of radishes on a mandoline and place in a large bowl. Leave remaining radishes whole if small, or slice in half or into wedges if larger and place in same bowl. Season well with kosher salt and squeeze and scrunch radishes several times with your hands to work salt into flesh. Squeeze lemon halves to get 3 Tbsp. juice; save one half for zesting later. Add lemon juice to bowl and finely grate half of cheese over radishes; toss well to coat. Using a fork, crumble remaining cheese into bowl. Add basil and 2 Tbsp. oil and toss again. Taste and season with more kosher salt if needed.Step 2Transfer salad to a platter. Drizzle with more oil, sprinkle with sea salt and pepper, and finely grate zest from reserved lemon over.How would you rate Radish Rainbow Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI made this with three types of radishes from the garden, slicing, shaving and chopping the radishes.  I needed less Parmesan than called for, leaving me plenty to make more of this salad tonight! Everyone said this was the best salad I'd made in a while and I make salads nearly every day, always varying my ingredients.AnonymousNorthern Minnesota8/4/2021I've made this multiple times.  It's best with early spring radishes.  If the radishes are too old it's not as appealing.  I am not a radish fan but when I make this in Feb or March for my husband who is I also love it.JenniferCA3/1/2021Explore Bon AppétitSaladAmericanCalifornia CuisineRadishVegetableBasilHerbs & SpicesSpringSummerSideVegetarianNut-FreeGluten-FreeKetoHealthyishEasterFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}