{"id": "72fe7698089324d87445561a6b069999", "url": "https://www.bonappetit.com/story/lamb-chops-treat-yourself", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Lamb Chops Are the Treat-Yourself Dinner You Deserve This Month | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLamb Chops Are the Treat-Yourself Dinner You Deserve This MonthForget your resolutions. Forget Dry January. Just focus on making lamb chops.By Carla Lalli MusicJanuary 10, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Make lamb a treat-yourself dinnerI don’t know what made me decide to give up alcohol during the month of January, but after three days, I knew it was a mistake.My intentions were good, if narcissistic. I thought that consuming less wine for a month would mean fewer calories and more sleep, but then I decided to make lamb for dinner, and the idea of drinking water with lamb chops was too horrible to bear. I was going to make lamb chops, and I was going to drink wine, and I was going to be cranky no more.Want this letter before it hits the website? Sign up for our newsletter!Photo by Carla Lalli MusicLamb chops, especially when cut from the rib rack, always feel like a celebratory food, partly because of their price tag, which can nudge into the top of the $20–30 range. I definitely splurged on the 8-ribbed rack of domestic lamb that I picked up over the weekend, but as I always tell myself, it’s a heck of a lot cheaper than going out to a nice restaurant. The occasion for my most recent lamb chop indulgence was just Saturday night dinner at home with my family, and for once I wasn’t making lentil soup with kale. I usually grill lamb chops, which is not currently an option considering it’s the dark days of winter, but I went with a classic hot-weather preparation anyway, first flattening the chops a bit before marinating them in herbs, garlic, and olive oil. Rather than searing them over a hot grill, I figured I could cook them over medium-high heat in a big heavy skillet, turning them a couple of times on each side to develop a dark golden-brown crust. (The original recipe for this dish calls for cherry tomatoes that you also char on the grill, but I roasted some squash instead—see above re: winter.)One of the excellent things about lamb is its fat, a layer of which should surround each marbled chop, so make sure your butcher has left at least ¼” of the fat cap on the rack. I personally  prefer my chops un-Frenched, which means that the rib bones themselves have fat on and in between them, rather than being scraped clean. Fat is flavor, and I won’t give it up no matter how many Januaries you throw at me.Photo by Carla Lalli MusicSomewhere between marinating the lamb and picking out a skillet big enough to hold them all was when I grabbed a corkscrew and a bottle of red wine. Enough of this garbage, I said to no one in particular. My husband most definitely laughed when he thought I was kidding, then gave me side-eye when he realized I was dead serious (to be fair, we had resolved together to not drink, and here I was, opting out on Day Four). Then, in place of the juice glasses we normally use, he handed me an actual stemmed wine glass in solidarity with my decision to end Dry-uary. Not that he joined me in the wine—he didn’t, but trying to stop me would have been akin to biting the hand that feeds you, literally.So, there I was, drinking wine and watching lamb chops sizzle away in their own fat, the aroma of herbs and meats filling the kitchen, my sober husband and hungry children standing by, and I knew that Dry-uary was horrible, lamb chops were terrific, and drinking wine out of bonafide crystal is fantastic. The holidays may be over, but life on earth with the people I love is reason enough to keep celebrating.Get the recipe:Lamb Chops Scottadito with Charred Cherry TomatoesExplore Bon AppétitCarla NewsletterLambRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-10", "author": ["Condé Nast", "Carla Lalli Music"]}