{"id": "730306d38351360b515aebaf789b4487", "url": "https://www.bonappetit.com/story/red-pesto-pasta", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Red Pesto Pasta Is Here, and It’s Full of Bright, Spicy, Umami Flavor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRed Pesto Pasta Is Here, and It’s Full of Bright, Spicy, Umami FlavorLike a cross between savory bagna cauda and spicy arrabbiata, this one’s total dynamite.By Emma WartzmanJune 1, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailSenior food editor Molly Baz had a dream, and that was to create a Red Pesto. She would complete the third recipe in BA’s tri-color collection (all the hues of the Italian flag!) and gift the world another stupidly simple, and addictively delicious nutty, cheesy, just-throw-it-in-the-food-processor pasta sauce.The way she would get there? Take a once-lauded ingredient and give it a comeback for the ages. “I was convinced that I was going to be able to make sundried tomatoes cool again,” she told me, hoping to restore our faith in the 1980s star that had fallen from grace.Turns out, the ingredient was no Winona Ryder. “No matter what I did to them, I couldn’t get the sundried tomatoes to lose their astringent flavor,” Molly says. “After five failed attempts, I realized that they don’t deserve to come back. I was nearly ready to give up on Red Pesto altogether.”But Molly is no quitter. Instead, she decided to scrap everything and give it one more go. “I realized that the sauce was too raw—too intense,” she says. “But there’s no rule declaring a pesto can’t have cooked elements. So I landed on tomato paste.” (Tomato paste, by nature, needs to be cooked so as to lose its tinny taste.) The key then was to bring the sauce back to bring back the bright and fresh feeling pesto usually offers, so along with the more traditional ingredients—nuts (in this case, walnuts), garlic, Parmesan, and olive oil—she added anchovies (for umami!), lemon juice (for zing!), and Fresno chiles (for heat!).The end result—glossed up with a couple of tablespoons of butter, of course—is a cross between the savory anchovy-garlic dip bagna cauda and a spicy arrabbiata. It’s total dynamite, especially for something that comes together so quickly. Really! It takes less time to cook the first few ingredients than it does to snip the leaves off of a big bunch of basil.“Who knows,” Molly says, now undaunted by the thought of turning anything into a pesto. “Maybe there will be a new color down the line.”Get the recipe:Red Pesto PastaThis red pesto tastes like a mash-up of your favorite spicy arrabbiata sauce and the anchovy-garlic dip bagna cauda. All of which is to say, it’s delicious.View RecipeExplore Bon AppétitPestoPastaTomato PasteWalnutParmesanRead MorecookingWhite Pesto Is The Easiest Dinner You Will Make This WeekBy Emma WartzmancookingHow to Prevent Your Herbs From Wasting Away in the FridgeBy Sarah JampelcultureThe Test Kitchen Swears By This Mini Food ProcessorBy Zoë SessumscookingThis Pesto Potato Salad Doesn't Know It's BeautifulBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-01", "author": ["Condé Nast", "Emma Wartzman"]}