{"id": "73079a53622ae35ddb1c9ae9d79bc245", "url": "https://www.bonappetit.com/story/top-taste-feel-home", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Top Taste Isn’t the Food of My Home, But It Makes Me Feel at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTop Taste Isn’t the Food of My Home, But It Makes Me Feel at HomeWhen I eat at this Jamaican restaurant, it ties my life in the Hudson Valley back to the babysitter who helped raise me.By Julia TurshenJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.I’m a sucker for any restaurant shaped like a wedge, its front door narrow and set at the intersection of a few corners, its interior a triangle that grows as you walk in. Top Taste, a Jamaican restaurant in Kingston, New York, sits on Hasbrouck Avenue at the triple intersection of Prince Street, Garden Street, and East O’Reilly Street. The shiniest point of the star, it’s a small building brightly painted in green and yellow, the colors of the Jamaican flag. You can smell the curry chicken before you walk in the door.An impressive collection of Jamaican sauces line the restaurant’s shelves.\nPhoto by Alex LauI love Top Taste for many reasons. There’s Sammy, who owns the restaurant and runs it with his wife, Malenda. Each time I pick up food from them, I’m reminded of the ripple effect of a friendly conversation and how it can carry you for hours after. The shelves are stocked with Jamaican sauces and spices like Grace Jerk BBQ Sauce and Spur Tree Crushed Red Pepper Sauce; it feels like a perpetually unpacked suitcase stuffed with souvenirs from one Kingston to another. And then there’s the food. The food! Sammy’s jerk chicken is flavor all the way to the bone, the meat so tender that there’s no need for a knife. You would leave a bit lighter on your feet if you skipped a piece of whatever cake Malenda baked that morning, but why pass up something this good? My favorite is her coconut and rum cake, a perfect ratio of sweetness to spicy rum.Picking a favorite cake is tough, but the coconut-rum is the best.\nPhoto by Alex LauTop Taste isn’t the food of my home, but it’s the food that makes me feel at home. It helps me tie my life now, married and living in the Hudson Valley, to my childhood. I was raised in Manhattan by parents who both worked full-time. This meant I was also raised in part by Jennie, my babysitter for a decade who remains one of the most important people in my life. Jennie is from Saint Vincent, a Caribbean island about 1,000 miles east of Jamaica. When I was a kid, Jennie cooked Saint Vincentian food like stewed codfish and pelau regularly, and she loved buying Jamaican food from places like Fisherman’s Cove in Brooklyn. She would share all of this food with me, and, with it, herself. When I zoom out, I realize that so much of our bond was built over Styrofoam boxes of brown stew chicken or curried goat with rice and peas, a few fried plantains tucked alongside. When I go to Top Taste, I’m transported back to my childhood kitchen table—and to Jennie’s too.A full plate of nostalgia.\nPhoto by Alex LauThe next time Jennie comes to visit me and my wife upstate, I can’t wait to take her to Top Taste. The first time I told her about it, I could hear in her voice how relieved she was to know that, even though I don’t live as close to her as I used to, really good Jamaican food was still in reach.Julia Turshen is the author of the cookbook Small Victories and the founder of Equity at the Table.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Julia Turshen"]}