{"id": "73074daa94997021893608a0807d3e7e", "url": "https://www.bonappetit.com/recipe/multigrain-chocolate-chip-cookies", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Multigrain Chocolate Chip Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMultigrain Chocolate Chip CookiesBy Zoe KananSeptember 24, 20184.7(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintYes, there are multi ingredients in these multigrain cookies, but that’s what makes them so over the top. Take advantage of all of the options (wherever it says “and/or” you can use either ingredient listed—or both). And if you want to take the easiest path, simply sub 2½ cups muesli for all the seeds and the oats! Read more about Zoe Kanan, the baker behind this recipe, here.IngredientsMakes 201½cups all-purpose flour⅓cup whole wheat flour1½tsp. baking powder1½tsp. kosher salt½tsp. baking soda8oz. bittersweet chocolate, chopped1cup old-fashioned oats⅔cup raw pumpkin seeds (pepitas) and/or sunflower seeds¾cup polenta and/or quinoa3Tbsp. millet, poppy seeds, and/or flaxseed1cup (2 sticks) unsalted butter, room temperature1cup (packed) dark brown sugar½cup granulated sugar¼cup powdered sugar2tsp. molasses1large egg4large egg yolks1½tsp. vanilla extractPreparationStep 1Whisk all-purpose flour, whole wheat flour, baking powder, salt, and baking soda in a medium bowl.Step 2Mix chocolate, oats, pumpkin seeds, polenta, and millet in another medium bowl.Step 3Cream butter, brown sugar, granulated sugar, powdered sugar, and molasses in the bowl of a stand mixer fitted with the paddle attachment on medium-high speed, scraping down sides as needed, until mixture is the color of light mocha and very fluffy, 3–4 minutes.Step 4Reduce mixer speed to medium. Add egg, then egg yolks one at a time, waiting for each to incorporate before adding the next. Beat in vanilla, then scrape down bowl again.Step 5Reduce mixer speed to low and slowly beat in dry ingredients until just combined and no visible white flour remains. Fold in chocolate mixture with a spatula until well combined. Cover dough with plastic and chill at least 2 hours.Step 6Place racks in upper and bottom thirds of oven; preheat to 350°. Line 2 rimmed baking sheets with parchment paper. Using a ¼-cup scoop or dry measuring cup, portion dough into ¼-cup balls (about 2.5 oz. each). Arrange evenly on prepared sheets.Step 7Bake cookies, rotating pans once top to bottom and front to back, until golden brown on top and surface just begins to look matte, 14–18 minutes. Let cool slightly, then transfer to a wire rack and let cool completely. Repeat with remaining dough and fresh parchment.Step 8Do Ahead: Cookie dough can be made 3 days ahead. Cover and chill.How would you rate Multigrain Chocolate Chip Cookies?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleHands down the best nutty cookie around! I LOVE these. I barely leave them in the oven for the 14 minutes, otherwise, I find they're a little too crunchyJade VandergriftWashington3/10/2022Used a higher gluten flour (similar to bread) and mine didn't run.  Didn't have the polenta/quinoa so did an ancient grain (granola/muesli like stuff) instead.  Also added 1/3 up of dry bing cherries to avoid the 'cat litter' texture of all the seeds/grains (and would do dried fruit again).  Finally, I had almond meal so I used that instead of the 1/3 cup wheat flour.  Think this really improved the texture to be more like a traditional cookie.  As suggested, baked at 400 for 16 mins.   I'm not at all sure how much healthily\"er\" these really are, but I think I will sub some low glycemic sugar for the 1/2 cup granulated sugar next time.  San Francisco, California10/14/2020Great cookies that felt a little healthier than typical chocolate chip cookies. Haven’t baked them yet, and probably won’t... the dough is great. Ashley AstolfiBrooklyn, NY4/14/2020I think these cookies are delicious--like gritty chocolate chip cookes! I substituted 1/2 cup bread flour for 1/2 cup of the all-purpose flour and my cookies did not spread at all.  Beautiful!AnonymousKalamazoo, MI3/26/2020If using quinoa, should it be cooked first, or used raw? Thanks!Anonymous10/3/2019I made this-Multigrain cookie is a nutritious and healthy cookie made using different flours.\nI used dark nine multi-grains such as oats, corn, whole wheat, sunflower seeds, flax seeds, sesame seeds, ragi, rice and almond, for a healthy yet tasty snack.\nI have bought same cookies in \"CAFENILOUFER\" HyderabadsainathHyderabad7/12/2019These turned out pretty tasty though they spread so much in the oven, even with the hours of chilling.  I like how there's lots of room for interpretation in the recipe.  I think next time I'll also add dried cherries or cranberries for a little more moisture and the texture would go well with the chewiness.  AnonymousChicago, IL10/15/2018These are great. I used dark chocolate chips and used slightly less (a personal prefernce). I suggest making them slightly smaller, they spread a lot in the oven despite three hours of chilling. I also liked them better on the slightly less done side of 14 minutes rather than 18. They have a great chewy texture that way.AnonymousAstoria, NY10/3/2018I made this and doubled the chocolate- turned out great. I brought them on a camping trip and my buddy didn't appreciate the varied texture and called them, \"cat liter cookies.\" 😂 Hayden90Tulsa, OK10/3/2018Explore Bon AppétitCookieDessertAmericanOatRice & GrainsQuinoaChocolateOther IngredientsMolassesCondiments, Sauces & PastesWhole Wheat FlourFlourFlaxseedSeedVegetarianHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-24", "author": ["Condé Nast", "Zoe Kanan"]}