{"id": "73192abdaeb873b79876dba2dc0ccd83", "url": "https://www.bonappetit.com/story/chewy-food-texture", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Everyone Loves Crispy and Crunchy, But What About Chewy? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEveryone Loves Crispy and Crunchy, But What About Chewy?The texture exalted in East and Southeast Asian cuisines doesn’t get much love in western culture. Why not?By Elyse InamineOctober 21, 2019FacebookTwitterEmailThe nabeyaki udon at Raku Photo by Laura MurrayFacebookTwitterEmailIs there anything more wonderful than thick Sanuki udon, noodles so delightfully chubby and squishy, like a baby’s leg? Or milk tea with spring-loaded tapioca pearls that squeak between your teeth as you chew and chew and chew? Or sinewy, rip-curled slices of Chinese charcuterie-style beef tendon that tastes beefier and more delicious with each exerted bite?In my opinion, food with an intentional, unapologetic chew is the best kind of food. And I’m not talking about chewiness in the way you might be familiar with in western cooking: steak that’s too rare (or too well-done), boiled-to-death octopus, Knox’s intensified gelatin. I’m talking about the particular, highly desirable range of chewiness in East and Southeast Asian food, known as Q in Taiwan, jjolgit jjolgit in Korea, dai in Vietnam, and other not so easily translatable terms. But the best way to understand it is to start with the food itself.Beginning with the lowest value on the chewy scale, you’ve got your noodles (wheat-based udon, rice noodles of all shapes), sticky rice, jellies (coconut, grass, like in Burmese falooda), and dumpling skins. These have a slippery texture and barely resist as you chew. Then there’s Japanese mochi and Filipino kakanin, a coconutty glutinous rice cake, with a more pliable feel that verges on tacky. Next, there’s the springy, al dente chew, like tteokbokki, Korean rice cakes; pinjaram, dense Malaysian coconut milk pancakes; and banh ja’neuk, Cambodian tapioca dumplings filled with mung beans and cooked in a coconut-ginger syrup. On to more serious chew, we have the bouncy, elastic pearls in Taiwanese milk tea, which require more devoted masticating—as in not just chewing to swallow but chewing...to chew. Then there’s the chewiness that’s like chomping on a fresh pack of tennis balls: plump Japanese chicken heart yakitori, Vietnamese beef balls bursting with aromatics, jiggly fried Filipino-style tripe. Finally, there’s the most extreme category of them all, where all kinds of seafood jerky and those wisps of beef tendon fall. I call it tug-of-war chew: the texture that fights back when you bite, pushing you away as you gnaw, as if it were still alive.Across East and Southeast Asia, chewy isn’t just a common texture but a powerful tool deployed to make food taste better. Here in the States, first- and second-gen chefs are relying on the texture to recreate the food they grew up with. “Chewy food, if it’s cooked right, has a lot of flavor every time you take a bite,” chef Tatsu Aikawa told me. “It’s another element of taste.” At Kemuri Tatsu-ya in Austin, he makes eihire, a Japanese-style stingray jerky. “You savor it more,” says Christina Nguyen, chef and co-owner of Hai Hai in Minneapolis, where she makes Vietnamese staples like banh beo, sticky rice cakes topped with ground pork, mung beans, and fried shallots. “It’s literally sitting on your palate longer.”The sticky banh beo with mung beans and fried shallots at Hai Hai\nPhoto by Matt Lien But on restaurant menus these days and in this country, where different textural extremes—“crispy” nuts, “creamy” polenta, “crunchy” salt-rubbed vegetables, “braised” and “fall-apart-tender” pork shoulder, and “charred” toasts—are all prized, chewy takes a back seat. Or worse.“As a chef, I’ve been in situations where I can tell customers aren’t going to like this, and it turns into a fight,” says Deuki Hong, the chef behind the Sunday Bird and Sunday at the Museum, both in San Francisco. “I’ve seen some funny faces,” Aikawa adds, remembering how he cautioned customers about one particular dish before they ordered: shiokara, super elastic squid fermented in its own guts. “Sometimes people freak out.” They’re not the only chefs I’ve spoken with who experienced confrontations with diners, typically non-Asian ones, about food like this. The rejection can range from an elementary school–level reaction (“Ew, what’s that?!”) to sullen stubbornness (“You won’t get me to like tripe!”) to straight-up bigoted responses (won’t share those here).Why does chewy food elicit such extreme reactions? Maybe it’s because, in western cuisines, chewy is largely associated with poor technique: something that’s either so undercooked to the point that it’s gummy, or simmered or seared until it’s well-done and rubbery. Or maybe it’s because very few things are acceptably chewy, and when they are approved, it’s for their oddity alone: “You have this texture in gummy bears, but when it veers into unprocessed foods, it’s like, ‘Hey, it’s not a novelty anymore,’” says Nicole Ponseca, the owner of Maharlika and Jeepney in New York City, whose bibingka, glutinous rice cakes with salted egg and guava jam, is the height of chew. But probably most of all, it’s because it’s just still so unfamiliar and, therefore, misunderstood.The thing that got me thinking about all this started with a beef tendon—that 10 out of 10 rating on the chewy scale. I was at a $450-a-head dinner during a food festival in the South last summer, sharing a table with strangers. “Ooo, I don’t really care for that,” a guest seated next to me said, as she pushed away her plate draped with a single deli-meat-thin slice of tendon drizzled with orange-scented oil. Others joined in. I’d already eaten mine, thinking, This is the good stuff!The beef tendon charcuterie at Mister Jiu's\nPhoto by Pete LeeThe dish was the work of Brandon Jew, the chef and owner of Mister Jiu’s in San Francisco. The blanched, braised, then quickly cooled and cut tendon was his take on the Chinese charcuterie you get at the beginning of a fancy multicourse banquet at weddings or big family reunions. The luxury items. The kind of thing my Cantonese in-laws would quickly pass to me as soon as they hit the table, showing their love by offering me the first pick.“I wondered how that went over,” Jew said with a laugh, after I told him what happened at my table. “I purposely brought that dish because I thought people probably hadn’t had tendon like this before. I wanted to show people why we love this texture as a delicacy.”But our collective love for these dishes is more than just a celebration of East and Southeast Asian cuisines: The texture itself reflects the ingenuity of the cooks behind them. Instead of muting the natural bounce of ingredients—like, for instance, the tendency to simmer turkey giblets in gravy or fry them to tender submission come Thanksgiving—they play it up.In Vietnam, the signature springiness of nem, a sour pork sausage, comes from the addition of shredded, boiled pork skin; Nguyen, of Hai Hai, can’t seem to find any other alternative here in the States. In Laotian cuisine, chef Donny Sirisavath tells me, tapioca starch from cassava root and freshly ground rice flour ensures a mochi-like consistency for the noodles in khao piak, a chicken noodle soup he makes at Khao Noodle Shop in Dallas (one of this year’s Hot 10 winners). In China, fish scraps have long been kneaded and slapped against the kitchen counter until aerated and sticky enough to roll into hefty, delightfully rubbery balls, a technique Jew still practices at his restaurant. Cooks in the past did this to both pricey ingredients (rice!) and humbler ones (less-than-ideal cuts of meat and fish, wheat, millet). And in turn, they turned these ingredients into delicacies that still inspire a sense of comfort and nostalgia for people like me, and shock—and in some cases, rejection—from others.And that’s actually all part of why I love it: Chewiness is a texture that physically and philosophically challenges you. It forces you to figure out why you may (or may not) like it as a texture. It confronts deep-seated, subconscious ideas about what defines deliciousness. It demands—literally—you take your time with it, to consider it. But if nothing else, it’s just fun to eat. You have to slurp, bite down hard, pull, and get messy. And when is the last time you got to have this much fun with your food?Explore Bon AppétitAsianSoutheast AsianRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-21", "author": ["Condé Nast", "Elyse Inamine"]}