{"id": "73230fd2332c248e4078a1595bce6b11", "url": "https://www.bonappetit.com/story/farmers-market-etiquette", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Is It Ever Okay...To Touch All the Tomatoes at the Farmers’ Market? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...To Touch All the Tomatoes at the Farmers’ Market?Solicited advice for peak-produce season.By Alex BeggsJuly 17, 2019FacebookTwitterEmailPhoto by Imagno/Getty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can I use the same toothpick for a second sample? —Snackish SamYou may not. Second samples are not a thing; this isn’t Costco. When the toothpicks are out, stabbed in peach slices, you get one (of each variety, OKAY). That’s the law. And when it comes to piles of snap peas and other loosies, you can try ONE to determine if they’re sweet yet. Don’t you dare leave the snap pea sleeping bag in that pile, though! (And, sorry! No samples for doggos.)I was taught to peel back a corn husk a few inches to check that it’s not rotten. Cool, right? —Corny CaseyUNCOOL. This is unnecessary and illogical and an invasion of corn privacy. Leaving a half-naked reject cob in a pile is a deterrent for future customers, not to mention the fact that you’ve left the kernels exposed to air, causing them to dry out. Feel up the corn through the husk if you want a sense of how plump the kernels are, and check the wispy hair to see that it’s golden and brown, not brittle and black. Then buy an extra insurance cob anyway.Illustration by Cari Vander YachtSo can I touch every tomato until I find the right one? —Picky PatriceWhat are you gonna do, marry it? All tomatoes deserve our love and warm embrace. People who demand perfect produce are what got us the abomination that is the Red Delicious. Welcome ugliness into your life, and you’ll discover true happiness—just ask my clogs. (And if you do end up with one that has a bruise, compost that smidge or make sauce.)SNACK BREAK!Speaking of tomatoes, this tomato, prosciutto, and fig salad is a summery take on melon and prosciutto—and guess what’s at the farmers’ market right now? TOMATOES. Stock up. Don’t spend too much time looking for the emoji-replica red ones, though, deal?Tomatoes with Fig and ProsciuttoThis salad is a riff on melon and prosciutto. We swapped the melon for jammy figs and sweet tomatoes.View RecipeIllustration by Cari Vander YachtBanned from the Farmers’ Market Until Further Notice:Really big dogsDouble and triple-wide strollersBluetooth phone calls while examining peachesBills over $20HagglingAsking if there’s “better looking stuff in the truck”Counting change too closelyImpatienceSteven (you know who you are)Illustration by Cari Vander YachtHow do you ask whether the produce is organic without sounding like a jerk? —All-Natural NoahCome on, when a farm is organic, they splatter their signage with the word as if it were...pesticide. Which they definitely don’t use.Do I need to carry change? I’m a millennial! —Rich RenéeYes. The world doesn’t owe you a Square reader. This is why I carry a folded-up emergency $20 in my sleek Everlane credit card case. And if your total is under $5, consider buying more apples to bring back to your coworkers.Illustration by Cari Vander YachtIf you’re undecided, is it all right to put the cauliflower back on display after it’s been in your bag? —Self-conscious SoniaYes, but place it gently back on the pile, put some other cauliflower on top, lean in, and whisper, “Shhhhhhh,” so the other shoppers will have something to wonder about for the rest of their lives.Illustration by Cari Vander YachtCan I stick stuff in my tote before I’ve paid for it so I don’t have to use the plastic bags? —Sustainable StewartUgh, Stewart. This is very confusing/stressful to the farmers, so why don’t you acquire some eco-cool mesh PurifYou reusable produce bags ($16 for a set of 9 on amazon.com) and use those instead? After you pay, you can pile them in your stained L.L. Bean tote. That way, you can avoid your fear of apples rolling all over the place at the weigh scale without appearing to be shoplifting. You could also use the plastic bags, then reuse them next week, and the week after that, and the week after that. I twist them up into plastic pretzels for easy grab-and-go transport. Let’s all try to do our best.How do I walk away from a stand without buying anything? I feel bad. —Catholic Guilt CarrynLook at your phone and gasp audibly, drop the overpriced bunch of scallions you were holding, then rush away with purpose and concern.Illustration by Cari Vander YachtIs there anything that’s (gulp) actually better to buy at the grocery store? —Hesitant HerbertCat litter, bananas, and diet ginger ale!!!That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexThe painting up top is: La marchande de fruits et legumes, 1630, (The greengrocer) by Louise Moillon.Explore Bon AppétitIs It Ever OkayFarmers MarketRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-17", "author": ["Condé Nast", "Alex Beggs"]}