{"id": "73279ae64f2c1241bc4cfe42e0e5cf3a", "url": "https://www.bonappetit.com/story/muffin-tin-cookies", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "Muffin Tin Cookies Are Adorably Chubby And Perfectly Round | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Adorably Chubby, Perfectly Round Cookies, Break Out Your Muffin TinDorie Greenspan figured out the ticket to cookie bliss.By Antara SinhaNovember 2, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When it comes to chocolate chip cookies, my love knows no bounds. I’m game for any variation: earthy, nutty buckwheat cookies with pools of bittersweet chocolate; chewy and almost wholesome with oats, coconut, and seeds; or classic dunk-into-milk worthy cookies—I will happily partake. With a name like Caramel Crunch-Chocolate Chunklet Cookies, the latest take on the CCC from Dorie Greenspan’s new book Baking with Dorie makes a lot of promises. And with a couple of brilliant moves, it absolutely delivers.To get one thing out of the way (and assuage any fears), let it be known that there’s no caramel to be found in the recipe. There’s no finicky step of nervously hovering over the stove waiting for sugar to brown with a candy thermometer in hand, no bits of toffee and burnt sugar to clean off pans and countertops. Instead, in this shortbread-style cookie, the caramel flavor comes from the way the cookie dough is baked—not on baking sheets but in muffin tins.Muffin Pan$10 $9 at AmazonBaking cookies in muffin tins is, quite frankly, a revelation: The all-around heat of each buttered muffin tin well means that the bottoms and sides of the cookies brown completely—you get the flavor of brown butter and caramelized sugar with no extra work. And in the battle of crispy versus chewy, the high walls of a dark muffin tin mean you’re guaranteed dark golden-brown edges with a satisfying crunch and buttery, crumbly centers studded with “chunklets” of chocolate. (Greenspan calls these cookies “shortbread at heart.”) The constraints of the muffin tin also ensure your cookies have no room to spread—they come out tall, chubby, and uniformly round. They’re perfect for stacking, gift-giving, and cookie boxes.Baking with Dorie: Sweet, Salty & Simple$35 $30 at AmazonThe best part: The technique works for (almost) any type of cookie dough. Want crispy edges on that everything-but-the-kitchen sink cookie? Muffin tin. Need perfectly round cookies to make into flawless stackable cookie sandwiches? Muffin tin. Want the best of both worlds with an almost doughy center but golden edges on some store-bought classic chocolate chip cookie dough? You guessed it: muffin tin. You may need to adjust your bake time a bit from the recipe—depending on the thickness of your dough, the cookies might take a little longer in the oven—but it’s easy enough to gauge when they’re ready: Look for brown on the edges and slightly soft in the center.Once you realize how easy it is to toss just about any cookie dough into a muffin tin without stressing over them colliding into each other (we’ve all had at least one giant Supercookie mishap), it’ll be your go-to for all of your cookie endeavors, chocolate chip or otherwise.As for Dorie Greenspan’s genius, her cookbook is full of helpful tips, tricks, and nuggets of friendly guidance: Heavily spiced baked goods are actually tastier the next day! For the best layers, don’t drag or twist your cutter when making scones! Add cottage cheese to your biscuits to maximize tang. Baking with Dorie is so full of baking wisdom, you’ll likely reference it often—but be sure to bookmark those CCCs.Cookie monster:Caramel Crunch–Chocolate Chunklet CookiesThese chocolate chunklet cookies are ingeniously baked in a muffin tin, resulting in perfectly crispy, caramelized edges and soft centers.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-02", "author": ["Condé Nast", "Antara Sinha"]}