{"id": "733e4884fc586e44e03f80d4d2032111", "url": "https://www.bonappetit.com/story/perilla-oil", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Perilla Oil is a Versatile, Complex, and Flavorful Cooking Oil | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt Took Me Decades to Realize That The Flavor of My Childhood Was Perilla OilVersatile, complex, and flavorful, it deserves prime pantry real estate.By David JooJuly 21, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI’ve been eating perilla oil my whole life, but it wasn’t until I was formally introduced to it by my mother a decade ago that I realized it.I was trying to make kimchi pancakes in my NYC apartment but couldn’t replicate the taste of my mother’s and grandmother’s. During a phone call one day, I asked for my mother for the recipe and voilà, the generation-kept secret was revealed: perilla oil. As it turns out, many of the Korean dishes that I grew up eating contained perilla oil without my knowledge. My mother drizzles it over bibimbap, sautéed spinach, braised burdock root, stir-fried fish cakes, and, my favorite, spicy braised tofu. My grandmother adds it to miyeok guk (seaweed soup), gosari namul (stir-fried bracken), kkaennip-jangajji (marinated perilla leaf), and plain steamed rice with a dash of seasoned soy. My grandfather uses it as a dipping sauce when we have samgyupsal or galbi.Once the distinctive scent and taste I’d been searching for since leaving Korea was finally available to me, I set out to gather as much knowledge as I could, constantly probing my mother’s and grandparents’ brains on my visits back. I started by assisting in their kitchens and asking questions: How was it produced? Where did it come from? Why did they use it compared to other oils? If my mother didn’t have the answer, she would call my grandmother, who had obtained the knowledge from the generation that came before. And I continued to expand my knowledge by consulting them on my ideas to use perilla oil in less traditional ways.While each oil in my collection (walnut, sesame, pumpkin seed, olive, chili, peanut, the list goes on) has a special place in my kitchen, perilla oil is a constant staple for its versatility, flavor, and complexity.So what is perilla oil?Perilla oil is the oil produced by cold-pressing seeds of the perilla plant. The leaves, also known as Japanese shiso, Chinese basil, and kkae-nip, can be eaten raw or cooked, and the byproduct (a.k.a. press cake) of oil-making is used as animal feed or fertilizer. (The whole plant is used, an example of “no waste” mentality.)What’s the flavor profile?The flavor of perilla oil can be described as nutty and earthy, with a licorice, anise finish. Texturally, it coats the tongue with a velvety smooth feeling, adding richness. The two types of perilla oil are toasted (a.k.a. roasted) and untoasted. The toasted oil, which is a shiny, light brown color, tastes bolder and more assertive than the untoasted, which has a vibrant golden hue. On top of adding flavor and texture, perilla oil also contains high levels of omega-3 fatty acid, as well as omega-6 and omega-9 fatty acids. These are known to confer anti-inflammatory and cardiovascular benefits and to support healthy immune function.How do you use it?When I’m deciding whether to use toasted and untoasted perilla oil, I leave it to personal taste. Having grown up with toasted perilla oil, it’s what I gravitate towards for cooking, marinating, and finishing. When using it to cook, treat it like butter or unrefined coconut oil, being careful not to use high heat, which will impart a bitter taste. Use it to lightly sauté any ingredient that will compliment its nutty, earthy flavor, such as mushrooms or spinach. Try putting it into a pesto of summer greens such as watercress, arugula, and dandelion greens. Or make a fresh dip with yogurt, perilla leaf, oil, and lemon juice to enjoy with crudité. When making  vinaigrettes and soups (it would be great in a refreshing summer strawberry gazpacho), add perilla oil to the emulsifying process of the recipe. I use untoasted perilla oil to finish light dishes such as chilled soba noodles, pasta salad, or a bed of leafy greens with some citrus and fleur de sel. Try it with a grain bowl of freekeh, kamut, barley, and seasonal shaved raw vegetables, or simply pair it with juicy summer tomatoes, burrata, and basil. Add it to a yuzu-tamari-honey vinaigrette or a pea soup.While perilla oil is great to use year round, I personally find myself using it more frequently during the hotter months of the season because I like to add the flavorful fat to complement light dishes.Where can you get it?Common brands include Ottogi, Hansang, Beksul, Haepyo, Chungjungwon, NongHyup, and Sempio, all of which can be ordered online. I personally enjoy using Bangyudang Perilla Oil. Their oil is made in Gwangju, South Korea, using 100% local Korean seeds and they offer untoasted and toasted versions.Now that you’ve got a bottle of perilla oil, you’ll finally understand what your kimchi pancakes—and your soups, dips, and vinaigrettes—have been missing.David Joo is the Executive Sous Chef at The Peninsula New York, where he oversees the Forbes four star restaurant Clement.Explore Bon AppétitKoreanOilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-21", "author": ["Condé Nast", "David Joo"]}