{"id": "7372f8bf134d5b91a7a4da531ddb1917", "url": "https://www.bonappetit.com/story/make-late-summer-toasts", "year": 2020.0, "month": 8.0, "day": 5.0, "content": "5 Things to Do With Toast That Aren’t Just Tomato Toast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Don’t Need a Recipe to Make the Best Late-Summer ToastsJust memorize these five rules.By Emma WartzmanAugust 31, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailTomato toast is lauded as the ultimate summertime meal. The praise is well-deserved, no doubt. But have you ever thought about the fact that...pretty much all other produce is also amazing this time of year—and equally deserving of being topped on bread for breakfast, lunch, and dinner?You can skew savory, like stewed zucchini on top of pillowy whipped ricotta, or sweet with slices of stone fruit crowning a honey-sweetened smear of yogurt. However, you can’t just slap raw eggplant on a dry piece of toast. Building the perfect toast is a careful balancing act. There are no set rules—besides, uh, toast on the bottom—but below are all of the elements you should keep in mind, courtesy of our Test Kitchen, as well as suggestions for some of our favorite toast combinations.Choose your produceThe main thing to consider when selecting your pristine produce at the farmers markets is whether you want it raw or cooked. Of course, raw fruits and vegetables are a thing of beauty right now, like wedges of juicy peaches and thinly sliced crisp cucumbers. But there’s also something to be said for cooking your veg to death, low and slow in a bath of olive oil, until jammy and spreadable. It’s a method we’ve extolled before, and it works with everything from summer squash to eggplant to tomatoes to peppers.Buy quality breadOf course, the better your bread, the better the toast will be. But you also want to make sure it’s a sturdy variety, like a crusty sourdough, for maximum topping support.Layer on the fatOf course, fat = flavor. Think about the grassiness of olive oil, the slight sweetness of butter, and the richness of mayonnaise—you want some of that on your toast. But as the great Samin Nosrat reminds us, fat also lends a textural advantage because, let’s be honest, toast is dry. Try a swoosh of Greek yogurt, a stick-to-the-roof-of-your-mouth smear of nut butter, or a creamy dollop of whipped ricotta.Season generouslyYou definitely want to add salt to your produce, whether cooked or raw—and a sprinkle on top of that fatty layer will go a long way too. See, salt makes other ingredients taste more like themselves. Without it, your toast will fall flat. Regular kosher salt—either Diamond Crystal or Morton’s—will work, but for the final touch, there’s only one option: Maldon, the crunchy not-too-salty salt.Add some acidYour toast needs acid too—a counterpoint to both the fat and produce. Acid can come in the form of a squeeze of lemon or lime, a sprinkle of zest, or a splash of vinegar. But briny ingredients, like quick pickles or capers, will add brightness as well. And don’t forget: Sometimes you’ve already got the acid part covered. Yogurt has fat, yes, but it also has tang (read: it’s a 2-for-1 deal!).Give toast the finishing touchThere are so many different ways to zhuzh up your toasts. Add some crunch with seeds or chopped-up nuts. Throw on some tender herbs, like parsley, dill, or basil, for some freshness. Drizzle a bit of honey to sweeten your produce and offset all the salty, tangy, fatty flavors. Sprinkle on spices, like amchur or chaat masala, to level up your flavors. Or bring on the heat with a dab of hot sauce or a flourish of chile flakes.Try some of these toast combinations (FYI, bread and salt are a given!)Almond butter + sliced peaches + lemon juice + lemon zestStewed zucchini with lots of olive oil + lemon zest + basil (add a fried egg to make it a meal)Barely sweetened yogurt + sliced stone fruit + hot sauceWhipped ricotta + braised Swiss chard + a splash of sherry vinegar + a handful of herbsButter + salted and squeezed cucumbers + chile flakes + capers (add smoked salmon and call it lunch)Looking for more toast recipes?1 / 38ChevronChevronNiçoise ToastView RecipeExplore Bon AppétitSummerToastRead MorecookingWithout My Pantry Pasta Formula, I'd Be Lost (Or At Least Hangry)By Chris Moroccocooking13 Tips for Making the Most of Your FreezerBy Team BasicallycookingYour 5 Most Common Baking Questions, AnsweredBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-31", "author": ["Condé Nast", "Emma Wartzman"]}