{"id": "73a73cd55323cec1f860f234534dcdff", "url": "https://www.bonappetit.com/recipe/tofu-with-rice-and-miso-maple-dressing", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Tofu With Rice and Miso-Maple Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueTofu With Rice and Miso-Maple DressingBy Sophia RoeDecember 1, 20203.7(70)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintChef Sophia Roe, the host of Counter Space on Vice, knows exactly how to get tofu crispy and flavorful: Add cornstarch to the marinade so the tofu cubes develop a nice crust in the oven (without the mess of stovetop frying). The nama shoyu or coconut aminos called for in this recipe are both substitutes for soy sauce (which you can also use) that are naturally lower in sodium yet still deliver deep, rich umami flavor. Nama shoyu is unpasteurized soy sauce, which means it contains wheat; coconut aminos are made by fermenting coconut blossom nectar, making it a gluten-free alternative.Ingredients4 Servings114-oz. package firm tofu, drained, patted dry11\" piece ginger, peeled, finely grated¼cup plus 2 Tbsp. nama shoyu, coconut aminos, or soy sauce2Tbsp. pure maple syrup, divided2tsp. toasted sesame oil, divided5Tbsp. cornstarch2scallions, thinly sliced1small garlic clove, finely grated1Tbsp. white miso1Tbsp. unseasoned rice vinegar½tsp. crushed red pepper flakesSteamed white rice (for serving)2medium carrots, peeled, cut into matchsticks1cup cooked shelled edamame1Tbsp. toasted sesame seedsCilantro leaves with tender stems (for serving)PreparationStep 1Preheat oven to 400°. Wrap tofu in paper towels or a kitchen towel and place on a rimmed baking sheet. Weigh down with something heavy (a cast-iron skillet with a can or two inside works well). Let sit 10 minutes. Unpack and unwrap tofu, then transfer to a cutting board and cut into 1\" cubes.Step 2Whisk ginger, ¼ cup nama shoyu, 1 Tbsp. maple syrup, and 1 tsp. sesame oil in a large bowl to combine. Add tofu and gently toss to coat. Sprinkle cornstarch over and mix until incorporated. Let sit 10 minutes.Step 3Remove tofu from marinade and spread out on a parchment-lined baking sheet. Bake, turning halfway through, until golden brown and a thin crust forms, 25–30 minutes.Step 4Whisk scallions, garlic, miso, vinegar, red pepper flakes, and remaining 2 Tbsp. nama shoyu, 1 Tbsp. maple syrup, and 1 tsp. sesame oil to combine.Step 5Divide rice among bowls, then top with carrots, edamame, and tofu. Drizzle with scallion sauce, then sprinkle with sesame seeds and top with some cilantro leaves.How would you rate Tofu With Rice and Miso-Maple Dressing?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangle5 stars for the tofu marinate-dredge-rest-bake technique gave me tofu with a complex texture that shocked me with its greatness. This is now my favorite way to make tofu because most of the time is inactive (resting, baking) and frees me up to do other things.\n\nI doubled the amount of maple syrup and rice vinegar in the glaze and got a sauce that was a whole lot more approachable in terms of heat and taste. Also added a touch of fish sauce. Rory LeahyChicago, USA3/9/2022I went back after making this to look at the reviews are were surprised they were so negative! The tofu was amazing, I didn't add 5 tablespoons of cornstarch because that sounded insane but I did press my tofu thoroughly, let it marinate for a good while and turned the tofu over while it baked. Next time I might try the cornstarch with more of a breading method in mind as like others stated it did slip off the tofu a little bit, and pan frying too. I also added kewpie with the scallion dressing and used furikake on my rice and all those flavours together were so delicious! I also added some fried edamame to my dish (soy sauce, mirin and rice vinegar) and fresh cucumber. \nclaudiasydney, australia10/25/2021Loved the sauce. Would definitely make again but substitue Coconut  Aminos. I’m slightly sensitive to salt and this tasted delicious but a touch to much sodium.ErinBrooklyn, NY3/16/2021I thought it was great!  The sauce is not too sweet, and the cornstarch gives the tofu a nice texture.  I also like that you don't have to fry the tofu to get it crispy.  I'd make it again.AnonymousPortland, Oregon3/13/2021I don't understand the bad reviews! Thought this was delicious. Basically followed it to a T except I used 3 tbsp cornstarch instead, and poured the leftover marinade on the tofu before baking.\n\nDefinitely one of those recipes where you want a little bit of rice, tofu, and each topping in every bite. To achieve this more easily, next time I might mix the edamame & carrot in with the rice after it's done cooking.JadeQueens, NY1/21/2021Best ever! Absolutely delicious! Oven-fried tofu isn’t definitely the way to go. I hate cleaning the stove after all the splatter. The dressing is delicious! Was surprised how delicious carrots made this dish. Will make again! AnonymousSeattle WA1/15/2021Should have read the reviews instead of just looking at the yummy picture! Something is definitely off with this recipe. Like others have said, the tofu stuck to the baking pan like crazy. Not a huge deal, tofu tends to do that, but the worst part was that the cornstarch didn't really cook off in the oven and tasted raw? I followed the recipe exactly. I eventually had to throw the cooked tofus in a pan with oil for a few minutes after baking to cook the cornstarch flavor off. After that it was OK but I thought I had ruined a whole box of tofu for a second! Usually Bon Appetit has solid recipes so not sure what went wrong on this one.Anonymous1/8/2021I made this per the recipe.  The tofu is absolutely fantastic, nice and crispy.  I did follow the directions and let it sit, after adding the cornstarch, for ten minutes.  The tofu soaked up the marinade and cornstarch during that time.  I baked it on a silpat liner, turned over the tofu halfway through, and it did not stick.  The sauce was fine, nothing spectacular.  Definitely make double for four servings.  I'll make again, the tofu is a winner, but will maybe fool around with the sauce.  JillDenver1/7/2021this honestly was delicious- not sure why the reviews are so low. 10/10\ni usually dont like tofu but you couldnt taste the tofu at all.\nthankyou for this delicious meal <3\ni used soy, and 3 tbsp of cornstarch :3elliecanada1/6/2021I thought the flavors were good but 5tbsp of cornstarch? It’s waaaaaayyyyy too much and made this gross paste that did not in any way bake to a crisp. The flavors were good though, especially of the dressing. Just needed less cornstarch. AnonymousPhiladelphia, PA1/5/2021I thought this was pretty tasty! Not sure why so many other reviews were negative - I followed the recipe exactly, without any issues. My tofu didn't get super crispy, but that's typical for oven-baked tofu (which doesn't usually get as crispy as pan-fried). I used parchment paper and didn't have any trouble with tofu sticking to the pan. One tip - don't pour the leftover marinade onto the pan, as that extra liquid will definitely make a mess in the oven. If I made this again, the only thing I would change is maybe using less marinade, so that the tofu stays drier and will get a crispier crust in the oven. \nThe dressing is where most of the flavor comes from, so I thought that was the best part of the recipe. I used regular soy sauce, but if others are concerned about it being too salty, you could easily swap for low sodium soy sauce or one of the other options given in the recipe. \nAnonymousSeattle, WA12/31/2020This is a terrible recipe. I used soy sauce instead of nama shoyu since that’s all we had (and the recipe calls for soy sauce as an option), using low sodium in the marinade and regular in the dressing. The dressing was WAY too salty and overpowered everything. The tofu also didn’t seem to absorb any marinade, and any marinade that traveled onto the baking sheet burned and stuck to the tofu. The end result looked nothing like the photo, so I don’t know what method they used to create such an even golden crust. Would not recommend or make this again.SoapnanaChicago, IL12/28/2020I should've listened to the other reviewers.\n\nThough the tofu tasted good, the method was a disaster. The tofu stuck to the parchment and burned, so I had to cut the tofu in half with scissors and leave the burned bits stuck to the paper to be able to eat any of it. The tofu didn't get crispy at all. If I were to try again, I'd use non-stick foil instead of parchment and just bake the tofu with some oil. AnonymousCleveland, OH12/27/2020Skip the sauce in the first marinate, just coat the tofu cubes with a tablespoon of canola oil, a dash of soy sauce and some red pepper flakes and bake for 30 min. Use the other sauce (w/ the miso etc) to drizzle over the baked tofu and rice. The cornstarch in the first marinate was a disaster.Poko12/21/2020I thought this was really good! I haven’t cooked tofu as described in the recipe, so it was a nice crispy change for me. Served with a brown rice/quinoa mix. I did add sriracha when I ate it, and I think lime will be nice for leftovers. AliLos Angeles 12/20/2020Explore Bon AppétitRice and Grain BowlTofuOther IngredientsRiceRice & GrainsMisoCondiments, Sauces & PastesMainDairy-FreeVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sophia Roe"]}