{"id": "73b1bfbbe892585d86b96748d50878e6", "url": "https://www.bonappetit.com/story/dinner-at-4-pm", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Early Dinner Is My Secret to Happiness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Eat Dinner at 4 p.m. and Trust Me It’s GreatMy life is one big early bird special.By Jennifer Still April 25, 2018FacebookTwitterEmailIllustrations by Laura CallaghanFacebookTwitterEmailFor as long as I can remember, dinner has been a meal cooked, eaten, and cleaned up in time for the 5 o’clock news. Generally on the stove by the time I walked in the door from school, the last meal of the day was a welcome smell and sight in those mid-afternoon hours when my lackluster cafeteria lunch was a distant memory and my stomach was beginning to grumble. By 4 p.m., when most of my friends were eating Doritos or Dunkaroos on the couch and watching MTV, I was sitting at the dining room table eating my dinner, and frankly, I preferred it that way.Of course, this practice isn’t possible for everyone. I’m a full-time writer and editor with the luxury of working from home, which means I can grab meals between tasks without much interruption to my schedule. Since I start work earlier and end later than the typical 9-to-5 hours, I’m back at my computer once dinner’s done rather than using the meal to punctuate another day done. Most adults have jobs that keep them out of the house until well after five or six in the evening. This means that dinner times are getting later, and we’re spending less time cooking and eating our meals, as people are opting for fast food and pre-prepped meals due to childcare and work commitments. With these considerations in mind, the idea of a 4 p.m. dinner seems a dream at best and downright laughable at worst.Still, for those who can swing it, there are plenty of well-documented benefits to eating your last meal earlier in the day rather than later at night. Not only has it been proven to be beneficial for weight loss and management, but you’re also likely to sleep better since your body has had time to digest the food you ate hours prior. Research has found that people who eat earlier benefit from better heart health than those who don’t chow down until later at night. None of these factors are my primary motivator for eating early, nor do I think they factored into my mother’s decision for us to do so when I was a kid, but they’re certainly welcome bonuses.Of course, a penchant for late afternoon meals does come with a few social complications. I can’t always do it when I’m meeting up with friends, since most dinner dates are understandably held after office hours. I’m always a little cranky and over-hungry by then, but I make do. It’s also a no-go on the days that I’m not working from home, as the expectation is that you’ll get dinner when the work day is done (though I tend to eat lunch at “normal” hours, around noon, even when I’m working from my apartment). Those circumstances aren’t ideal, but they’re rare enough that nine times out of 10, dinner is a distant memory by the start of primetime TV.One of the biggest arguments I get from people when I tell them about my preference to eat before 5 p.m. is that I must go to bed starving since I ate so long ago. I eat generous meals with healthy portions of foods that are filling, nutritious, and keep me going just fine until morning. On the rare occasions that I do feel a bit peckish before bed, I drink a glass of water or herbal tea. While I’m not against the occasional handful of M&Ms after lunch, I’m generally full enough from my meals that it’s unnecessary to do so before bed. Besides, I like being nice and hungry for breakfast in the morning; breakfast is the best.Explore Bon AppétitHealthyishDinnerShoppingRead MorecultureWhy I'm Eating 90 Grams of Protein a DayBy Adriana VelezRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Jennifer Still"]}