{"id": "73c1a3d925e7b0af393980245743d635", "url": "https://www.bonappetit.com/story/purifyou-reusable-mesh-produce-bags", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "purifYou Premium Reusable Mesh Produce Bags Are the Best Way to Replace the Plastic Bags at the Grocery Store | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEvery Single Time I Break Out These Produce Bags, I Get a ComplimentI bought them for the environment; I keep them for the random praise.By Sarah JampelApril 4, 2019FacebookTwitterEmailPhotograph by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I knew that buying these purifYou reusable produce bags would help me cut down my plastic consumption—but I didn’t know that I’d receive so many compliments from strangers at the farmers’ market or grocery store.I don’t have a resting face that invites strangers to engage in conversation, exactly, and this is the only item that has made random people try anyway. There’s just something about the way the lightweight mesh bags look and feel—swishy, creamy, soft—that makes people stop and comment on how lovely they are. I’m surprised no one’s reached out to stroke them yet, considering they’re almost as tempting to touch as that fluffy pink insulation material (which you definitely should not).I get great pleasure in treating my produce with such TLC: When I put apples or sweet potatoes or teeny Sungold tomatoes in the bags, it’s like I’m tucking them into bed or buckling them into a car seat. I know fruits and vegetables don’t have feelings but come on: They must prefer it this way. The bags come in a variety of sizes, so there’s one that’ll cradle a bunch of herbs and another that will keep two handfuls of cherries from rolling around. I figure that if I select my produce with care and shepherd them in an earth-friendly fashion (rather than shoving them into the same type of plastic bags I reserve for cat litter and dirty gym clothes), then I’m also bound to put them to good use. Spring farmers’ market, here I come.Photo by Chelsie CraigPurifYou Reusable Produce Bags (Set of 9)$15 $10 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Sarah Jampel"]}