{"id": "73c3fc23f1e59158d9c12eb6bed03948", "url": "https://www.bonappetit.com/recipe/whole-wheat-oat-waffles", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Whole Wheat–Oat Waffles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueWhole Wheat–Oat WafflesBy Deb PerelmanApril 14, 20204.6(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintSmitten Kitchen’s Deb Perelman created a waffle recipe that’s easy (one bowl, hand-mixed), makeable without advance planning, whole grain (which offsets the inevitable puddles of syrup, right?), and crispy. “I also wanted them to have a neutral palate for the adults who prefer our breakfasts savory,” she says. “Sugar-free waffles allow us all to choose our own breakfast adventure: My husband and I top them with eggs and bacon or sautéed vegetables and cheese, while the kids smother theirs with fruit and syrup.”Ingredients4–6 servingssyrup1lemon, zest removed in wide strips, halved⅓cup granulated sugar110–12-oz. bag frozen blueberries1Tbsp. cornstarchwaffles and assembly1cup (125 g) whole wheat flour½cup plus 2 Tbsp. (60 g) quick-cooking old-fashioned oats1tsp. baking powder½tsp. baking soda1tsp. Diamond crystal or ½ tsp. Morton kosher salt1½cups plain yogurt (not Greek)4Tbsp. unsalted butter, melted, plus more room-temperature for serving1large eggPreparationsyrupStep 1Bring lemon zest, sugar, and ⅔ cup water to a boil in a heavy medium saucepan, stirring until sugar dissolves. Cook (do not stir) until a thin syrup forms, 6–8 minutes. Add blueberries and bring to a simmer. Reduce heat to medium; cook, stirring constantly, 2 minutes.Step 2Transfer 2 Tbsp. syrup to a small bowl, add cornstarch, and stir until smooth. Add back to syrup; simmer until thickened, about 1 minute. Remove from heat. Fish out lemon zest and discard. Squeeze in lemon juice to taste and let cool slightly.waffles and assemblyStep 3Whisk flour, oats, baking powder, baking soda, and salt in a large bowl. Make a well in the center and add yogurt, then melted butter, then egg to well. Using a fork, stir together wet ingredients, then mix, incorporating dry ingredients a little at a time, until a lumpy batter forms. A lumpy batter now means a light and tender waffle later.Step 4Heat waffle iron on medium-low. Lightly coat with nonstick spray and pour a heaping ½ cup batter onto iron (or up to 2 cups if using a larger one). Cook until waffles are golden brown and cooked through, about 5 minutes. (Keep warm on a baking sheet in a 300° oven if desired.) Repeat with remaining batter, coating iron with more nonstick spray as needed. Serve with butter and warm syrup.How would you rate Whole Wheat–Oat Waffles?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleAmazing! I have been making various waffle recipes for years and these are my kids’ (and my) favorite. I make the batter the night before just so that they’re ready to cook when I get up. But I don’t add the baking soda and powder until I’m ready to cook the waffles. \nAlso I add a hefty tablespoon of sugar not so much for sweetness as for browning. I also add a tablespoon of vanilla. Lastly we’re lactose intolerant so I use almond yogurt thinned with oat milk and oil or melted vegan butter.  They are crisp and toothsome. And they don’t get soggy when doused in syrup or jam. Irene Boulder CO1/19/2022Wowza these are amazing. I accidently used greek yogurt so the batter was too thick, so I added a quarter cup of oat milk to thin out. The texture is fantastic, it's hearty and the oats blend right in. The flavor is also way more rich and complex then standard buttermilk waffles. I will totally be making these again!LoLOSeattle, WA10/12/2021Pleasantly impressed by this recipe! I was worried the texture would be too \"oaty\" which I tend to dislike, but the oats blended right in. You couldn't even tell they were in the batter! Definitely a healthy morning breakfast that you can freeze and pop in the toaster quickly. I used 1/2 cup of buttermilk and 1 cup of whole milk yogurt and added 1 tsp. of cinnamon (which I would up even more next time). Didn't fuss with the blueberry syrup and served with fresh cut bananas and real maple syrup instead. I may try next time with whole wheat pastry flour as another reviewer suggested.SARosslyn, VA9/8/2021Need a clarification. There is no such thing as \"quick-cooking old-fashioned oats\". There are \"Quick Cooking Oats\" and there are \"Old Fashion Oats\" Two different products. Which one am I supposed to use?Anonymous7/22/2021Really quick and good. I had buttermilk but no yogurt so used that in about the same quantity , added maybe 1/4 regular milk to thin it out a bit. The batter was still thick so I just spread it out a little on the waffle iron.  I like the savory slightly salty flavor. Great with syrup or peanut butter & jelly! Heidi ZAmerican Canyon, CA4/30/2021This is the perfect recipe to make if you just want to roll out of bed and make breakfast. While I've made it as listed above, I found that it holds up well to substitutions. If you're able to find whole wheat pastry flour, I highly recommend using it here! The lower protein content definitely helps with the texture. I only purchase greek yogurt as opposed to plain, so I usually lower the amount to 1 or 1 1/4 cup and thin it out with either milk or buttermilk. It provides a bit more tanginess to the recipe, which we really enjoy. AnonymousNorwalk, CT2/15/2021Not sure what happened, but no matter how I adjusted my waffle iron heat settings for this, the batter stayed nearly raw in the middle. This is quite thick for a waffle batter, so I’m not sure if that contributed to it. We did get a couple to turn out edible and those ones were great. Also made the compote with maple syrup and a splash of spiced brandy rather than the water/sugar mixture and it was delicious. Emma TMinneapolis, Mn1/10/2021These waffles were so easy and delicious! They were fluffy and I was surprised there wasn't an oat texture. My husband, who is skeptical of healthier versions of yummy things, had seconds! This is definitely a keeper recipe.AshleyPittsburgh, PA12/11/2020So easy and hearty! I would absolutely make these again. I added a handful of frozen berries to the mixture right before scooping into my waffle iron, and it was a welcome addition. Would make again. jenmaiWashington, DC5/12/2020Really enjoyed these! So much easier than your typical waffle recipe and just how I like my morning treats - hearty, an element of grain, some salt to balance out the sweetness of toppings, and still crispy and fluffy. I used oat flour instead of oats. Even had a leftover waffle for dessert with ice cream  - yaaaaaasss so good.AnonymousAsheville, NC5/11/2020Made these today and served them with roasted rhubarb. They were delicious! For the first time in my life I was patient and cooked the waffles for the suggested five minutes on medium-low, which resulted in a crispy, cooked-through waffle. Will make again!AnonymousCopenhagen, Denmark5/10/2020Really enjoyed this one. So easy to make, although I think a might add a touch less salt in the mixture. I paired mine with some cream that I whipped up with a bit of powdered sugar and some cinnamon in addition to a drizzle of maple syrup. My dad said he really enjoyed the savory, sugarless element and I completely agree with him. What amazes me is how I was able to achieve essentially the same texture as my dad's Belgian waffles minus all the whipping of the egg whites. I almost forgot I had put in the oats! As a 17 year old, I approve. :)clarobaro5/8/2020I skipped the syrup in favor of a smear of apricot jam and made the waffles but using \"instant\" instead of \"quick\" oats because that's what I had on hand. My Belgian style waffle maker yielded 2.5-2.75 waffles from the recipe as written. They aren't light and fluffy (look at the ingredients) but they were an enjoyable and satisfying way to start the day with a strong cup of tea. I love waffles but rarely eat them because I don't feel great after I eat them. One waffle kept me full longer than my usual breakfast of eggs and whole wheat toast. I'm looking forward to making this recipe again and experimenting with cinnamon, cardamom, and vanilla extract. AnonymousBerkeley, CA5/4/2020I won't rate the recipe, since I didn't make it as written, but I used half white flour, as I ran out of whole wheat, added half a tablespoon of cinnamon and 1 tablespoon of sugar since we weren't making the syrup, and it was the best waffle recipe I've ever made. Really crispy and wonderful. I'll be making it with these alterations again. So happy to have finally found the waffle recipe I've been looking for all these years.AnonymousToronto5/2/2020Made these exactly as written, and they were pretty bad. Chewy, fibrous and needed extra syrup just to choke them down. Used KAF white whole wheat flour. Maybe my expectations were too high given the ingredients? Should there be a rest so the oats and wheat flour can hydrate?ChrisdwilliamsAndover, MA4/26/2020Explore Bon AppétitWaffleWhole Wheat FlourFlourOatRice & GrainsYogurtOther IngredientsEasyNut-FreeVegetarianHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Deb Perelman"]}