{"id": "73c5056e81e873341a55274bf54c8755", "url": "https://www.bonappetit.com/story/lemony-rent-week-pasta-leeks", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Turn This Lemony Rent Week Pasta with Leeks and Chile Flakes All the Way Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTurn This Lemony Rent Week Pasta with Leeks and Chile Flakes All the Way UpThe ingredient list is simple. But the pasta is loud.By Alex DelanyNovember 30, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe term background music has always bothered me. Why would I want background music? If music is good, it should be played loudly. I’ve never understood the point of playing music softly, dulled to the point where you can hear it without really hearing it. Especially if it’s quiet music to begin with. Life is too short to play gentle music quietly.Wait. Alex, are you using your opinions about music and volume settings as a metaphor to lead us into some kind of culinary exploit?You’re goddamn right I am. Because I think about food in exactly the same way I do quiet music: Just because you’re presented with less, that doesn’t mean that you shouldn’t absorb every ounce of it to the fullest. Whether the music is raucous or tender, whether the ingredients are opulent or humble, play it loud. And seeing that it’s Rent Week, we’re going to be turning up the volume on a humble list of ingredients. We’re making a simple, lemony leek pasta with anchovies and chile flakes. Don’t go running at the mention of anchovies—I promise this isn’t a fishy pasta. Just throw on this Loud Little Vibrations playlist I made for you (completely free of charge) and grab some leeks.Speaking of, leeks are without argument the most undervalued allium around. They provide that sweetness we love, without any harsh bite. And they’re affordable! Which is why leeks are getting the spotlight in this Rent Week pasta dish. We’re going to sauté them and fry them into a nice crispy topping. But first we have to slice them.Slice 3 large leeks in half lengthwise. Thinly slice one of the halves widthwise so you have a bunch of small, crescent-shaped pieces of leek. We’re going to fry these. Cover the bottom of a skillet in olive oil and heat it over medium heat. Drop the thinly sliced leeks into the oil and let them fry until they start to turn golden-brown. Once this happens, turn off the heat and transfer the crispy leeks onto a paper towel with a slotted spoon. We’ll come back for those when we serve our pasta. But before we get to pasta, you need to zest 1 lemon with a Microplane. Save the lemon. We’ll come back for that too.Yup, these are the 'chovies. You need them. They're good. I swear.\nFill your pasta pot with water (Don’t forget to season that water with kosher salt) and cook on high heat. While the water comes to a boil, let’s get back to the rest of the leeks. Slice the remaining leeks into slightly broader crescents than the leeks we fried, about ½” wide. In a Dutch oven, heat 3 Tbsp. of butter over medium-low heat and add the sliced leeks, stirring them so they’re coated in butter. Add a pinch of kosher salt, two hefty pinches of red pepper flakes, a generous glug of white wine (whatever you have lying around will do), ½ of the lemon zest, and 5 anchovy fillets.Fine. Let’s take a minute and talk about anchovies. I understand why people are turned off by a ‘chovy. But just because you add anchovies to something doesn’t mean the dish is instantly going to taste really fishy. You won’t turn into a slimy fish if you eat or smell this pasta. I promise. The anchovy provides a deep umami flavor to the sauce. Nothing overwhelming. Just a backbone of flavor to make this pasta taste like a hell of a lot more than it actually is. We need the anchovy. And it’s best if you use olive oil packed anchovies with a resealable lid.Drop your pasta into the boiling water, and stir the leeks so that the anchovies dissolve into the sauce. There! They’re gone! You can’t even see them anymore.  Squeeze the juice of the lemon you grated earlier into the sauce and stir. Keep the sauce over low heat, simmering until your pasta finishes cooking.Look at your pasta. Isn't it lovely?\nPhoto by Alex LauAnd by finishes cooking, I mean is just short of al dente. We’re finishing it in the pan, so we want to be able to cook it just a tad longer. Add about 1 cup of the pasta water to the Dutch oven, and transfer the pasta to the Dutch oven using tongs or a spider. Add 2 Tbsp. of butter and toss the pasta. Normally, you’d add some grated Parmesan here too to really thicken your sauce. Seeing as it’s Rent Week, that’s totally optional. Just a little finely grated Parm goes a long way in the sauce, but the butter, wine, pasta water, and lemon will do their fair share if you don’t have Parm on hand.Once the pasta is coated in a glossy sauce, it’s topping time. Plate your pasta in a shallow bowl and hit it with a sprinkle of the remaining lemon zest, a pinch of red pepper flakes, and some of the crispy leeks we started with. If you’ve got more grated Parm around, go for it, but like I said earlier, it’s Rent Week. I’m not made out of cash. Or Parmesan.And now that you’re eating the pasta, that music you’ve had turned up while you were cooking is pretty hard to hear. Everything else is pretty hard to hear. Because for being such a quiet list of ingredients, what’s happening in that bowl is pretty damn loud.In more of a soup-ish mood? We've got that too:A Rent Week Lentil Soup Recipe to Improve Your Home DecorLentil soup is a Rent Week classic, especially when it's cold outside...and you have to buy a credenza.View StoryExplore Bon AppétitBasicallyRent WeekPastaLeekAnchovyButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-30", "author": ["Condé Nast", "Alex Delany"]}