{"id": "73d0fc72ac448ade4a99ab57c9935906", "url": "https://www.bonappetit.com/story/maria-qamar", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Maria Qamar Is the Woman Behind the Art at Our Favorite Indian Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMaria Qamar Is the Woman Behind the Art at Our Favorite Indian RestaurantsHer cheeky illustrations draw from comic-book-style pop art and the Indian soap operas she watched as a kid.By Priya KrishnaJuly 9, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Maria Qamar, an artist whose cheeky illustrations electrify some of our favorite restaurants.If you’ve watched “The Mindy Project” or been in the dining room of stylish Indian restaurants like Bombay Bread Bar in New York and Besharam in San Francisco, you’ve probably seen Maria Qamar’s work. Her cheeky illustrations blend comic-book-style pop art with her own experiences growing up in an Indian household in Canada. “I put salt in her chai,” says a smug aunty in one illustration. “I spilled eggnog on my Christmas saree. Who will love me now?!” exclaims a girl in a headband and bindi in another.Qamar was born in Karachi, Pakistan—her father is from Bangladesh, and her mother is from Gujarat—but the family moved to Canada when she was nine years old. At school, she was bullied for being brown. “I never expected that negativity,” she says. She dealt with the tough times by drawing comics about these experiences, “but I would change the outcome,” she says. “In my comics, I always got the last laugh.”Her hilarious illustrations quickly caught the attention of the Desi community, particularly those of my generation, who related closely with her depictions of gossiping aunties (“She stole my husband, but she can never steal this recipe!”) overbearing parents (“Our daughter didn’t pick up the phone, Vinay! She’s obviously dead!!!”), and cultural appropriation (“Is this gori wearing a bindi again?!”).Food is a common theme in Qamar’s artwork because it played a central role in her upbringing. “If I weren’t doing art, I’d probably be cooking,” she says, so making illustrations for restaurants (and my cookbook) felt natural to her. Her chef collaborators, who include Heena Patel and Floyd Cardoz, “are doing for dining what I am doing in my art: trying to introduce people to something new that they wouldn’t find in the usual Indian joint,” she says.We talked to Qamar about comfort food, Indian soap operas, and why the fruit in Pakistan is so much better than it is here.My comfort food growing up was… dhokla [a Gujarati snack made of fermented rice and lentils] and Bengali fish fries. In Pakistan, we ate tons of grilled meats, including parts of the animal that people over here wouldn’t touch like chicken throat and goat tongue.A big influence on my artwork and humor is…Indian soap operas. They were in the background every night when my mom came home from work. There would be drama between two women, and you could hear them crying in the background. It is oddly comforting.One of my first doodles was about…. me and all these bullies at school. I released a bunch of birds on their face.Something people misunderstand about Indian food… is that there’s more to order than butter chicken. Indians make so many great things! We do need better representations of what Indian food is.Cooking is important to me because…  it grounded me when everything was chaos outside. I would come home and my mom would make me khichdi and I would feel fine. Cooking pulled me out of a depression when I was 19.I learned to cook by…calling my mom and asking her how to make certain foods. She had been making the dishes for so long she would skip the details. So I would taste her version and then try to break it down.My latest cooking discovery is… biryani but with cauliflower rice. It did legitimately taste like biryani. I was very shook.One food I really miss from living in Pakistan is… fruit! I grew up eating a lot of fruits that are impossible to find here: custard apples, mangoes, chikoos.My favorite thing to snack on while I work is… banana chips or cashews. I am the kind of person who will go to the grocery store and buy the pre-cut trays of fruit because I am a giant baby.I create art…for my own mental health, not to accomplish anything.One of the most rewarding parts of my art is…knowing that there are people who are invested in it, who feel seen.The most fun part about doing illustrations for restaurants was…. “getting free reign, for Bombay Bread Bar, on the mural [which showcases the ten-foot-tall faces of a Desi man and woman, posed side by side on the back wall of the restaurant]. With Besharam, it wasn’t just a mural, it was the menu [featuring Qamar’s signature Desi woman giving sass], the plates [bedecked with phrases like “Save the drama for your amma”], the neon sign [bright pink, with the restaurant’s name scrawled in neat cursive]. I got to get my art direction on. I probably wouldn’t ever want to be a chef because...people are way harsher with food than they are with art. With art, people are like, “I don’t get it, fine.” With food, it’s make-or-break. It takes balls to be a chef today.The future is… the younger generation. They are bolder, and they are not afraid. They are growing up in an age where they are able to say, “No, I am not doing this. You are racist, you are problematic.” That’s exciting.Explore Bon AppétitHealthyishPerson of InterestIndianInterviewsRead MoreLifestyleNew Orleans Chef Nina Compton Isn't Afraid of the Dish PitBy Kristin BraswellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-08", "author": ["Condé Nast", "Priya Krishna"]}