{"id": "73d6e0f23cc121d618c4445c9803b165", "url": "https://www.bonappetit.com/recipe/whipped-ricotta-toast-with-date-and-rhubarb-compote", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Whipped Ricotta Toast With Date and Rhubarb Compote Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueWhipped Ricotta Toast With Date and Rhubarb CompoteBy Zaynab IssaMarch 15, 2022EmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintCaramelly Medjool dates mellow rhubarb’s astringent tartness with their earthy sweetness. Serve any extra with pancakes, oatmeal, or yogurt.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonSmall Offset Spatula$6 At AmazonSmall Saucepan$155 At AmazonLarge Nonstick Skillet$50 At AmazonIngredients4 servings5Medjool dates, pitted, chopped⅛tsp. ground cardamom½tsp. kosher salt, divided2medium rhubarb stalks (about 4 oz.), chopped1cup whole-milk fresh ricotta3Tbsp. extra-virgin olive oil, divided41\"-thick slices country-style sourdough bread2Tbsp. coarsely chopped raw pistachiosFreshly cracked black pepperPreparationStep 1Bring dates, cardamom, ¼ tsp. salt, and 1 cup water to a boil in a small saucepan. Cook, stirring often, until dates are very soft, about 5 minutes. Add rhubarb and cook, stirring occasionally, until rhubarb is soft and compote has thickened, 7–10 minutes. Let cool.Step 2Meanwhile, pulse ricotta and remaining ¼ tsp. salt in a food processor to combine. With motor running, stream in 1 Tbsp. oil; process until ricotta is ultrasmooth and airy, about 1 minute. (Or, whisk ricotta, salt, and oil in a medium bowl until smooth and light.)Step 3Heat 1 Tbsp. oil in a large nonstick skillet over medium. Add 2 slices of bread; cook until golden brown and crisp underneath, about 4 minutes. Transfer to plates and turn fried side up. Repeat with remaining 1 Tbsp. oil and remaining bread.Step 4Spread ricotta on toasts and top with compote. Scatter pistachios over; season with pepper.How would you rate Whipped Ricotta Toast With Date and Rhubarb Compote?Leave a ReviewTell us what you thinkExplore Bon AppétitBreakfastLunchSnackQuickEasyVegetarianHealthyishToastRhubarbFruitDateDried FruitRicottaCheeseSpringRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Zaynab Issa"]}