{"id": "73d8c648b71492de94fb341ff34a7581", "url": "https://www.bonappetit.com/story/our-go-to-crispy-tofu-method", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Our Go-To Crispy Tofu Method Could Not Be Easier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOur Go-To Crispy Tofu Method Could Not Be EasierThis is tofu we want to make again and again and again.By Amiel StanekMarch 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWe love tofu all the ways. Silky and soft in a spicy stew. Crumbled and marinated in a tangy dressing. Blended into a creamy dip. But when we're in WTF am I going to make for dinner RIGHT NOW mode, it's this crispy tofu method that we turn to again and again and again.It's simple. It's satisfying. It yields beautifully-browned nuggets of bean curd swaddled in a sweet-salty sauce. And it cuts out a lot of steps—marinating, pressing, dredging—that in the end we just didn't find necessary. Ready to fall in love with this crispy tofu method? Let's do this thing.Dry It OffAs is the case with just about anything we're trying to sear, fry, or otherwise render crispy and browned, starting with thoroughly-dried tofu is key. Water is the enemy of crispiness, and the more water we can remove from the surface of the tofu before it goes into the pan, the faster and more effectively it'll brown. (This is also why we don't marinate it before cooking!) We start by tearing a block of firm tofu into irregular chunks—those craggy bits hold onto sauce better than the flat surfaces you'd get by cutting with a knife—and placing them on paper towels to drain for at least 10 minutes, and even longer if possible. (Letting it sit on paper towels overnight in the fridge would be rad, if we ever thought that far ahead.)Patience Is a VirtueWhen that tofu is good and dry, it's time to fry. We start by heating a few tablespoons of coconut oil—any high-heat oil will work here, but we like the flavor that coconut oil lends—in a nonstick skillet (the one above is by GreenPan) over medium heat until it's hot and shimmering. (If you're wondering if the oil is hot enough, dip a corner of one of your tofu chunks in it; it should start to sizzle immediately.) The chunks go in, and then...we wait. We don't fuss with the tofu. We don't stir it around. We wait patiently while the first sides of the tofu pieces get golden brown, and then—and only then—do we turn the pieces onto an uncooked side and wait—patiently again!—for that side to brown. It takes direct and sustained contact with the hot oil in the pan to get the browning we're after, so not rushing this part is crucial. Once all the sides are done, we transfer the chunks of tofu to a paper towel-lined plate so they can rest before we move on to the final step.Could you brown, say, two sides, and not all of them? Sure! But you could also save time in the morning by only putting on one sock. What's with all the rushing around, anyway? Just brown the tofu! And brown it well! It's worth it!Lost in the SauceThe finishing touch. The pièce de résistance. The sauce. For crispy tofu that we actually crave all the time, we like to cook our (patiently!) fried tofu one more time—this time in the sauce. Why not just drizzle some sauce on top of our tofu and call it a day? Because we want every bit to be completely drenched in the stuff, for two to become one. In this recipe, we whisk together a super simple sauce of peanut butter, soy sauce, rice vinegar, and honey, and cook that all together in the same pan we used for our tofu. Once it reduces slightly, the crispy tofu pieces go back in for a quick tossy-toss in the saucy-sauce. Could you use a different sauce? Sure! This maple-soy version is good as hell, too.The result is a study in contrasting flavors and textures. Smooth gives way to crisp gives way to soft; sweet-salty-fatty gives way to mild and vegetal. It's everything we want in a weeknight tofu preparation. And we have a feeling that, once you make it yourself, you're going to feel the same way.Make that crispy tofu already!Crispy Tofu with Coconut Quinoa and BroccoliniCrispy, craggy, and thoroughly coated in an addictive, peanut-y sauce, this tofu is so good that even the most stubborn carnivores won’t complain.View RecipeExplore Bon AppétitBasicallyTofuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-06", "author": ["Condé Nast", "Amiel Stanek"]}