{"id": "73e0a2c87ac5e513a82116e17fd273c7", "url": "https://www.bonappetit.com/recipe/pork-shoulder-braciola-with-ragu", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Pork Shoulder Braciola with Ragù Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssuePork Shoulder Braciola with RagùBy Chris MoroccoFebruary 13, 20183.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyEmailPinterestPrintEmailPinterestPrintIt wouldn’t be right to cook an herby Parmesan-stuffed pork shoulder roast recipe without making a Sunday gravy in the same pot to soak up every stray bit of flavor.Ingredients4 servings14-lb. piece skinless, boneless pork shoulder (Boston butt)Kosher salt2large eggs, beaten to blend1head of garlic, cloves separated, half finely chopped, half thinly sliced½cup panko (Japanese breadcrumbs)⅓cup chopped parsley1Tbsp. chopped rosemary1tsp. freshly ground black pepper½tsp. crushed red pepper flakes3oz. Parmesan, coarsely grated, plus finely grated for serving2Tbsp. extra-virgin olive oil228-oz. cans whole peeled tomatoes1lb. pasta (any shape)PreparationStep 1Preheat oven to 225°. Place pork shoulder, fat side down, on a cutting board with a short end facing you. Holding a long, sharp knife about 1\" above cutting board, make a shallow cut along the entire length of a long side of roast. Continue cutting deeper into the roast, lifting and unfurling meat with your free hand, until it lies flat (be careful not to cut all the way through). Season generously on both sides with salt.Step 2Mix eggs, chopped garlic, panko, parsley, rosemary, black pepper, red pepper flakes, and 3 oz. Parmesan in a medium bowl. Keeping fattier side of pork shoulder facing downward, smear filling all over top side. Roll up roast and tie closed in 3–4 places with kitchen twine.Step 3Heat oil in a large Dutch oven or other heavy pot over medium-high. Sear pork roast until browned all over, 10–12 minutes total. Arrange tomatoes and their juices and sliced garlic all around roast and bring to a simmer. Make sure roast is turned fat side up, cover pot, and transfer to oven. Roast until a skewer easily passes through meat (a thermometer inserted into the center should register 200–205°), 4–5 hours. Keep covered and let rest in pot 30 minutes.Step 4Transfer pork roast to a cutting board and remove kitchen twine. Gently mash sauce in pot with a spoon or a potato masher (simmer it gently to thicken, if desired). Taste ragù and season with salt if needed. Slice pork 1\" thick.Step 5Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; drain.Step 6Spoon pasta into a serving dish and top with some ragù; toss to coat. Sprinkle with finely grated Parmesan. Transfer pork to a platter; spoon remaining ragù over.Step 7Pork can be stuffed and rolled 2 days before roasting; cover and chill. Pork can be roasted 3 days ahead; let cool, then cover and chill. Reheat gently in sauce before serving.How would you rate Pork Shoulder Braciola with Ragù?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI don’t think I’ll make this again — the stuffing turned out extremely eggy, which was strange with the pork. I think I may have mixed up the Parmesan measurements; for 3oz I added slightly less than 1/2 a cup, but I wonder if they meant weight instead of volume? That would make a big difference, and maybe improve the stuffing. The sauce was also quite watery like others have said, but after 20 minutes reducing it was the only tasty thing that came out of it. Anonymous10/18/2021We enjoyed this. Based on the reviews, I made a couple of small changes, however. I more aggressively seasoned the pork with salt and pepper before searing it. Also, instead of whole tomatoes, I used one 28 ounce can of crushed tomatoes. That seemed to help with the wateriness. I reduced that down for probably 10 minutes, and added some basil and oregano to round out the flavors a bit.  dlnielsen11/12/2018\nWe really liked this recipe a lot! The sauce was a little runny at the end, but I loved the filling and overall taste. The leftovers have been great for lunch too! AnonymousSkaneateles, NY3/7/2018WARNING:  The meat was incredibly dry, so I would suggest that folks cook it for a much shorter amount of time.  (I followed the recipe exactly, and cooked the meat for 4 hours.)  The presentation was otherwise very pleasing, but I'll try it one more time to see if it can be made right.  Otherwise, I'll decide it isn't worth the trouble.  The sauce was very flavorful.  I used it with a side of rigatoni, which was perfect.  It was the best part of the meal.AnonymousSan Diego2/28/2018It wasn’t terrible, but no one in the fam enjoyed the filling and the sauce came out so watery. Rather a lot of effort for the results. Erin Crawford2/25/2018Explore Bon AppétitItalianEuropeanPorkMeatPork ShoulderNoodlePasta & NoodlesCanned TomatoTomatoVegetableMainNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}