{"id": "73e4195d91bf3084a3cf9a0507186d21", "url": "https://www.bonappetit.com/story/prius-road-trip", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "In a Prius on the Edge of Sanity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatIn a Prius on the Edge of SanitySometimes it takes a ridiculous, hedonistic, emotionally fraught road trip across 19 states to figure out where you really are.By Hilary CadiganAugust 14, 2020FacebookTwitterEmailIllustration by Kyle PlattsFacebookTwitterEmailAT AGE 27, fresh off a three-year stint in Northern Thailand, low on cash, and completely unsure of what to do with the rest of my life, I embarked on a road trip.This was not just any road trip. This was not a casual four-hour jaunt with a stop along the way for lobster rolls. This road trip was a month long. It covered 19 states. It included a wedding and a visit with my 86-year-old grandma and a stopover at, um, Burning Man. This road trip did not start and end in the same place because it was also, ha ha, a move.It’s hard to articulate exactly why my boyfriend, Rob, and I decided to wedge such a trip in between our return to the States and our ultimate destination: a recently vacated room inside a crumbling Victorian in Atlanta. I suppose we wanted to reintroduce ourselves to the country of our birth while trying to figure out how to shoehorn ourselves back into it. To reconnect with friends whose lives had taken turns unknowable to us: new states, new partners, new dogs. And, well, to binge on greasy road trip snacks. It’s not like three years of eating almost exclusively Thai food was any kind of sacrifice, but a cheeseburger-and-taco-shaped hole in one’s heart does beg to be filled.So yeah, we had a lot of catching up to do. But this absurd travel plan also felt like a salve of sorts. Like maybe getting physically lost could be the solution to feeling emotionally lost. Or something like that.We plotted our route almost entirely around meals and via the couches and air mattresses of family and friends. Starting at my parents’ house in Massachusetts, we’d travel across the country, down the West Coast, and back east in a big squiggly sideways U. We embarked like two idiot pilgrims, headed into the great wide open on a very tight budget, waving out the windows to my doubtlessly alarmed mother and father. And we’re off!Then there was a breakdown. Not of the car—an elderly silver Prius named Betty White who took the whole journey like a complete champion—but of yours truly. We were about 500 miles in, departing the wedding of an old friend in Ithaca, New York, when I suddenly had an extreme burning desire to peel off my own skin. I’m not sure if it was the ostentatious displays of joyful settling down as seen from my residence on the edge of the void or what, but suddenly everything crashed down on me at once: the sadness of having left behind the pretty excellent lives we’d built on the other side of the world, the anxiety of not knowing what to do in this country that was supposedly home, the fear that I’d irrevocably changed and would never quite fit in anywhere ever again, and on top of all that, a crushing guilt: Who was I to complain? I had made these decisions, and was privileged to do so. Objectively, my suffering was total bullshit.Anyway, I handled it by turning into a human potato, sitting silently in the passenger seat inhaling Country Ranch Nut Thins as we sped down the highway toward Pennsylvania. I stared out the window like a girl in a bad poem, watching the broken white lines flick by on the steaming asphalt so fast they became unbroken. “Life feels finished,” I wrote, extremely dramatically, in my elephant-print notebook. “My lips are as dry as the road.” (Lol.)We pulled into a ’50s-themed diner guarded by a giant statue of Homer Simpson and ate greasy burgers in tension-y silence. Then we pitched our tent next to an amusement park on the shores of Lake Erie and, as the sky melted into lavish shades of pink and gold over the cool gray water, burst into a screaming fight. “I am sad!” I howled, but in an accusatory way. Rob, who had learned by then never to tell me to calm down, did his best to apply comfort before giving up and telling me to stop being such a selfish asshole. “The world is indifferent!” he said. “It’s not out to get you, and it doesn’t owe you anything!” I fell asleep curled as far away from him as one can be in a two-person tent with a single sleeping bag, my sniffles mingling with the screams of people riding the rickety wooden roller coaster over our heads.But here’s the thing about having complete emotional meltdowns on road trips. Once you’re done, you can pack your shit back into the car, post an Instagram of the sunset, and move on.And move on we did. First to Cleveland, where we drank double IPAs and ate Polish Boys slathered in coleslaw with an old roommate who had somehow managed to become a full-blown gynecologist in the time we’d been gone. Then to Louisville, where my friend Audrey took us to the Kentucky State Fair to pet goats and eat sandwiches layered with inch-thick slabs of juicy vinegar-marinated pork chop and watch a hairless Chihuahua balance on his front paws in the palm of a Guy Fieri doppelgänger.In St. Louis we took a booze cruise down the mighty Mississip’, drinking out of smuggled mini vodka bottles and dancing to a band whose front man played the didgeridoo. We crossed Kansas in six hours, the flat brown landscape exactly the same at hour one as at hour six (I have photographic evidence). In Denver we drank cider flights and drove out to Red Rocks to see a friend of a friend’s band play for free.The trip was exhausting, especially since every friend whose life we stepped into wanted to show us the best and most fun version of said life, which, when you’re in your 20s, usually involves a lot of booze. But with each stop I remembered a little bit more how the world could hold me, even if it took the form of a polyester couch in a basement apartment that smelled of old cheese.I’m going to skip the part when we went to Burning Man (that’s another essay for another time, which is never), but I will say that the front seat of a car feels a lot more like home when you’ve spent the past week in a hot tent full of dust. On our way out of the Nevada desert, we stopped for Indian tacos—ground beef and shredded cheese layered over a shimmery bubbled cushion of hot fry bread—at a roadside stand on the Pyramid Lake Paiute Reservation. Then we slept in a Walmart parking lot because all the motels in a 40-mile radius were full.The way back happened faster: two nights in Alameda, California, with my grandma, who concluded the visit by kissing Rob on the lips; a few more with two different friends named Chris—beef pho and a Barbra Streisand dance party in San Francisco; killer papaya salad and a futon full of ants in Berkeley. By the time we left California, all I wanted was to get home, or, if that didn’t exist, at least into an actual bed, so we booked it across the Southwest, stopping only to eat and sleep in Phoenix (enchiladas on a dorm room floor), El Paso (steak tacos and a Motel 6), and Houston (kolaches in a house full of cats). There may have been some McDonald’s stops in between; I’m no saint.By the time we got to Atlanta, at 2 a.m. on a room-temperature night in September, I just about crawled up the stairs to our new attic bedroom, barren but for a lumpy mattress the previous occupant had left behind. I flopped onto it giddily and whispered so I wouldn’t wake the housemates: Mine! Mine!Did I then have to settle for the first terrible job I was offered because I had straight up run out of money? Yessiree. Did we need to source all our bedroom furniture from the side of the road? Sure did. Do I regret a thing? I do not. Who knows if I’ll ever again have a chance to spend an entire month between somewhere and nowhere, driven entirely by whim, letting the hot wind tangle my hair into the kinds of rat’s nests that would later require scissors, bursting with pleasure over fry bread in the middle of the desert, having emotional meltdowns and leaving them behind in unfamiliar towns.Sometimes throwing caution out the window of a fast-moving car is a thing you gotta do. Just make sure it’s a Prius. Gas isn’t cheap.Explore Bon AppétitRoad TripFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-14", "author": ["Condé Nast", "Hilary Cadigan"]}