{"id": "73ec74cba584d3c281750d9e48d75a86", "url": "https://www.bonappetit.com/recipe/wilted-greens-in-tomato-bacon-broth", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Wilted Greens in Tomato-Bacon Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueWilted Greens in Tomato-Bacon BrothBy Claire SaffitzMay 22, 20184.9(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintSweet, sour, and simple, these wilted greens are a faster version of braised collards and make a fantastic summer side dish. The tomato-bacon broth is everything. While you can use any green you like for this wilted greens recipe, a mix of tender and sturdy ones—some bitter and some hardy—gives the best balance to the final dish.Ingredients8 servings1Tbsp. extra-virgin olive oil, plus more for drizzling4slices bacon, coarsely chopped1small onion, chopped4garlic cloves, smashed1pint Sun Gold or cherry tomatoes2Tbsp. sherry vinegar or red wine vinegar2tsp. honeyKosher salt10cups torn greens (such as escarole, Swiss chard, and/or mustard)1Fresno chile, thinly sliced into ringsPreparationStep 1Heat 1 Tbsp. oil in a large saucepan over medium-low. Add bacon and cook, stirring often, until brown and crisp around the edges, 5–7 minutes. Add onion and garlic and cook, stirring often, until onion is translucent, about 5 minutes. Increase heat to high and add tomatoes. Cook, stirring occasionally, until tomatoes have mostly burst and are lightly charred in spots, about 5 minutes. Mix in vinegar, honey, and 1½ cups water. Season lightly with salt and simmer over low heat to allow flavors to blend, 8–10 minutes.Step 2Working a handful at a time, add greens, stirring to wilt before adding more, and cook until all greens are wilted and submerged in the broth. Season with more salt; let cool slightly.Step 3Transfer greens to a serving dish. Generously drizzle with oil and scatter chile over.How would you rate Wilted Greens in Tomato-Bacon Broth?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis was DELISH. It's kind of like BLT soup. I added more stock/water (about 4 cups total) and a can of white beans to make it a meal on its own. So tasty! CJSan Diego, CA11/8/2021This is a solid recipe, start to finish: easy, hearty, rewarding.  Dom's review hits the nail on the head as you may want to play with the proportions a bit on your second run, the broth is amazing.  This one's going into the repertoire on the regular.TylerNew York, New York2/22/2021Loved the end product! But I would make a few tweaks: for fattier bacon the oil isn't really needed and I ended up with so much fat I couldn't really char the tomatoes. Also, I prefered adding a fair bit more salt to counter the sweetness of the honey. Next time I'll use half the amount of honey because otherwise it was too sweet. RhiFrance 2/16/2021Why doesn’t this have more reviews?? It’s so good! And simple to make. Previous reviewer you could really add as much or little greens as you want but I always put a lot more than I think I will use when I make this cause it wilts down to such a small amount. But man I could drink that broth by itself so I add a lil more bacon, vinegar, and water. Love this dish!DomLos Angeles, California1/20/2021I love this recipe, but \"10 cups torn greens\" couldn't be a more vague amount. Is this two bunches? A pound? Who's to say. I think I usually use two bunches (~2lbs). Sarah D.Chicago, IL1/2/2021Explore Bon AppétitBaconCured MeatMeatCherry TomatoTomatoVegetableLeafy GreensSummerEasyWeeknight MealsSideDairy-FreeNut-FreeGluten-FreeKetoHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}