{"id": "73f78b6e12d782f8fabcf57f4dea89bc", "url": "https://www.bonappetit.com/recipe/broccoli-salad-with-peanut-dressing", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Broccoli Salad with Peanut Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBroccoli Salad with Peanut DressingBy Chris MoroccoMay 15, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThe raw broccoli salad at Emily and Emmy Squared showed us that broccoli can be delicious even when squeaky raw. The secret? Over-the-top flavor from a creamy peanut dressing and pops of sweetness from dried cherries.Ingredients4 servingsDressing¼cup natural creamy peanut butter2Tbsp. unseasoned rice vinegar1Tbsp. soy sauce1tsp. sugar1tsp. toasted sesame oil1½\" piece ginger, peeled, finely gratedKosher saltSalad and Assembly2small heads of broccoli (about 1 lb. total)2mini seedless or small Persian cucumbers, thinly sliced13\" daikon, peeled, thinly sliced3Tbsp. extra-virgin olive oil2Tbsp. unseasoned rice vinegarKosher salt2Tbsp. dried tart cherriesCilantro sprigs (for serving)PreparationPeanut DressingStep 1Whisk peanut butter, vinegar, soy sauce, sugar, oil, ginger, and 2 Tbsp. water in a medium bowl until smooth. Season with salt.Step 2Do Ahead: Dressing can be made 1 week ahead. Cover and chill.Salad and AssemblyStep 3Slice stems from florets, cutting away as much stem as possible. Cut up larger florets into bite-size pieces. Peel stems and thinly slice. Combine florets and stems in a medium bowl. Add cucumbers, daikon, oil, and vinegar and toss to combine; season with salt.Step 4Spoon peanut dressing onto a platter and arrange salad over. Top with cherries and cilantro.How would you rate Broccoli Salad with Peanut Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is one of my favorite recipes!  Super quick to make and never fails to impress on the flavor-front.  This paired with Chris's Sambal Pork Noodles makes for a fantastic meal!Cary AndersonBloomington, IN3/16/2020The peanut-soy-rice vinegar dressing is so. good. Will definitely make again. alizaraeNew York 3/18/2019i want to kiss whoever created the recipe for this peanut sauce/dressing. i'm not usually a pb fan but i couldn't get enough of it with the cucumbers and broccoli! plus, the added sweetness of the dried cherries was very nice.krizkpennsylvania9/13/2018Explore Bon AppétitSaladPeanut ButterCondiments, Sauces & PastesBroccoliVegetableDried CherryDried FruitFruitQuickEasySideDairy-FreeVegetarianVeganHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Chris Morocco"]}