{"id": "73f813a818a4ad160c01d0af58a099a7", "url": "https://www.bonappetit.com/story/pork-roast-meal-planning", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Make This Pork Roast on Sunday, Eat Well All Week Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Pork Roast on Sunday, Eat Well All Week LongThis centerpiece-worthy protein can be turned into tacos, sandwiches, fried rice, and more.By Shilpa UskokovicSeptember 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailI’ve tried the style of meal prepping where you spend an entire Sunday making a bunch of different meals and portioning them into tidy glass containers. And, truly, the sight of all those neatly stacked and labeled boxes in the fridge sparked a lot of joy—but it was also depressing to crack one open and peer into its cold depths five days into the week. I just couldn’t stomach it.My new-and-improved meal-planning strategy involves making a big batch of just one or two dishes that can pull double or even quadruple duty as the week progresses, like this Burnt Orange and Coriander Roast Pork, for instance. With an almost entirely hands-off braise on an otherwise slow afternoon, you have a six ways to Sunday situation on your hands—no back-of-the-fridge leftovers in sight. Here are just a few of the many ways your protean pork can be put to use for lunch or dinner to get you through the week.In a SandwichThere’s no better lunch than a sandwich you can eat one-handed while doom-scrolling through your phone. Throw a big, shreddy chunk of pork on a roll slathered with mayo and Calabrian chile paste. A tangle of cooked broccoli rabe if you have it, or other greens of choice, a duvet of cheese (Swiss or provolone works well here), some pickled veggies, and there’s your bright and shining star amid a day full of Zooms.Anchoring a Noodle SoupBorrowing inspiration from all the great noodle soups of the world, I make a cheat-y broth by simmering water with gochujang, Chinkiang vinegar, garlic, ginger, and the tiniest splash of fish sauce. Slip in a handful of pak choi or torn Swiss chard, a large scrap or two of the pork, and a nest of cooked rice or wheat noodles before topping with fried shallots and thinly shaved onion.As TacosRemember that one time you went to Mexico City and ate at that taco place you still think about? This might not be quite that, but it’s pretty darn close. Chop up the pork, mix with a squeeze of mayo (this helps get it crispier), and sauté in a pan until warmed through and you’ve achieved some crunchy bits. Pile over toasted tortillas. Use a spoon to portion some half-moons of perfectly ripe avocado on top. A squeeze of lime and a sprinkle of minced white onion brings it all together.Flavoring a HashSmash tiny steamed potatoes and fry in a skillet with shreds of pork until crispy and golden. Seasoned aggressively with salt, freshly cracked black pepper, and a touch of ground cumin, it makes a cozy bed for a couple of fried eggs and a drip of chile crisp.Fried With RiceFried rice is my favorite fridge-clean-out meal. My completely inauthentic version includes lots of garlic, chopped-up kimchi, any half-wilted greens in the veggie drawer, frozen corn, and bites of pork. Toss it all in a wok or cast-iron skillet until the rice gets faintly crackly.Simmered Into a RagùWhen I’m down to the last few tatters of pork, I extend its life by simmering it along with a can of peeled tomatoes, too much crushed red pepper flakes, and half a stick of butter. This becomes a rich salve for any short-shape pasta alongside a plate of garlicky, barely wilted escarole.Get the Recipe:Burnt Orange and Coriander Roast PorkA slow-roasted, centerpiece-worthy hunk of pork that yields a week's worth of excellent leftover possibilities.View RecipeExplore Bon AppétitMeal PrepcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-08", "author": ["Condé Nast", "Shilpa Uskokovic"]}