{"id": "74056c6e3b56ec904c0b2795bef15538", "url": "https://www.bonappetit.com/story/what-is-a-jelly-roll-pan", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "What is a Jelly Roll Pan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Jelly Roll Pan Is Good for So Much More Than Jelly Roll CakesThe Goldilocks of sheet pans.By Sarah JampelOctober 16, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you’re someone who cares deeply about the ratio of cake to frosting, please consider the jelly roll. [Note to colleagues: Bon Appétit has approximately zero jelly roll recipes—why?]Because the cake—a soft and fluffy sponge—is rolled, rather than stacked, it’s easy to achieve a nearly 1-to-1 ratio of cake to frosting or filling (yes, that filling may include jelly). Jelly rolls are fun and a teeeeny bit stressful to make (what’s baking without a little risk?), beautiful to look at, and straight out of The Great British Bake Off.The only issue is that in order to make a jelly roll (a.k.a. roulade, rolled cake, Swiss roll, cream roll), you typically need a jelly roll pan. What is a jelly roll pan, you ask? Compared to half-sheet pans, which are 18x13\", jelly roll pans are smaller, usually about 15x10\". Jelly roll pans have 1\"-high sides, sufficient for containing the batter as it rises in the oven.Use your jelly roll pan to make a bûche de Noël.\nChristopher TestaniWhen you’re following a recipe specifically formulated for a jelly roll pan, like the Matcha Swiss Roll from Just One Cookbook, there isn’t a great workaround for that special pan. Your half-sheet is too big (the cake will be too thin) and your quarter-sheet is too small (the cake will overflow); your 9x13\" is probably the best estimate, but it’s also a bit too small in area and the higher sides can make it trickier to gently unmold your cake.Rest assured, if you do invest in a jelly roll pan because you, like me, cannot shake the desire to bake King Arthur Flour’s Pumpkin Cream Cheese Roll, it won’t sit in your cabinet untouched. Because they’re smaller than half-sheets, jelly roll pans fit easily into any oven. (I used them exclusively in my old apartment, for everything from roasting vegetables to baking scones, because the oven was miniature.) If you’re only cooking for one or two people, use it to make a couple servings of a sheet-pan dinner or six cookies instead of 12. Or, if you prefer edge brownies and thin blondies, trade out the 9x13\" for the jelly roll pan, where the batter has more room to spread out (though watch the pan closely as the batter will bake faster). In her upcoming book A Good Bake, pastry chef Melissa Weller calls for a jelly roll pan to make slab pies that serve 12–15.But whatever treat you decide to make, promise me you’ll also give the jelly roll a try. After all, that’s what this pan was made for.Photo by Laura Murray, Food Styling by Pearl JonesNordic Ware Jelly Roll Pan$16 at Amazon$18 at NordicwareExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-16", "author": ["Condé Nast", "Sarah Jampel"]}