{"id": "740aaba6684b2c66ba07bf3fbab776f1", "url": "https://www.bonappetit.com/recipe/lentil-nicoise-salad", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Lentil Niçoise Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueLentil Niçoise SaladBy Anna StockwellJuly 9, 20193.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTo make this endlessly riffable salad, pair whatever produce you’ve got with 7-minute eggs, a mustardy dressing you can make ahead, and almost any protein: leftover steak or salmon, rotisserie chicken, or beans, to name a few.Ingredients6–8 servings¾cup extra-virgin olive oil¼cup fresh lemon juice2Tbsp. Dijon mustard1tsp. honey1tsp. freshly ground black pepper1tsp. kosher salt, plus more6large eggs1lb. asparagus, trimmed4cups halved or sliced radishes, fennel, and/or tomatoes3cups cooked lentilsOlives, caper berries, peperoncini, pickles, or other pickled-briny ingredients (for serving)Flaky sea saltPreparationStep 1Whisk oil, lemon juice, mustard, honey, pepper, and 1 tsp. kosher salt in a medium bowl; set dressing aside.Step 2Bring a medium pot of salted water to a boil. Carefully add eggs and cook 7 minutes. Using a slotted spoon, transfer eggs to a bowl of ice water (keep pot over high heat); chill until cold, about 5 minutes. Peel; set aside.Step 3Meanwhile, add asparagus to same pot of boiling water and cook until just tender, 2–4 minutes. Using a slotted spoon, transfer to bowl of ice water; let sit until cold, about 3 minutes. Transfer to paper towels; pat dry.Step 4To serve, slice eggs in half and arrange on a platter with cooked and raw vegetables and lentils. Top with pickled-briny ingredient(s), sprinkle with sea salt, and drizzle some reserved dressing over. Serve with remaining dressing alongside.How would you rate Lentil Niçoise Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis vinaigrette is everyting!  I am vegan/vegetarian and my hubby is French, a meat eater.  We both loved this salad, I used tomatoes, green beans, potatoes, lentils with copious amounts of the sauce, and briny things like capers. In France you don't put asparagus into a NIcoise but you can put cooked green beans, tomatoes and potatoes and the lentils - It is a go to meal when I make a bunch of lentils.  Then I double or triple up on making the sauce so that I can throw it on diced beets or gartered carrots or boiled leeks... so so good.  I have made this recipe at least 10x (each time without the asparagus somehow the lentils were a hell-yes but after living in France for over a decade I just could not do it with the asparagus.French Jamaican US YogiFoodieNew Rochelle, NY11/12/2021Very saucyJSChicago, IL7/20/2021The vinaigrette makes this a wow dish!  It was so good that I made it twice in the same week. My husband is a meat eater and he loved it.  He works from home a lot and when I have a lot of work I do this.  I plate the veggies in advance then pour the sauce in before eating.\nWendyPeloYogiNew Rochelle, NY4/24/2021Explore Bon AppétitSaladFrenchEuropeanEggAsparagusVegetableBlack LentilLentilFrench LentilSpringSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Anna Stockwell"]}