{"id": "7410686d7e08edf99c602529df6b73c0", "url": "https://www.bonappetit.com/story/cauliflower-rice-pilaf", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "This Cauliflower Rice Pilaf Is WAY Better Than a Paleo Recipe Deserves to Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cauliflower Rice Pilaf Is WAY Better Than a Paleo Recipe Deserves to BePaleo, who? With ghee-toasted almonds, golden raisins, and fresh scallions, this pilaf is definitely not diet food.By Aliza AbarbanelFebruary 4, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailDespite my very best intentions, I’ve always found cauliflower rice to be a bit of a disappointment. There’s nothing exciting about eating a bowl of mush, especially when there is actual rice to be had. I’ll admit to a few flirtations with Trader Joe’s frozen cauliflower rice several years ago, but that relationship ended when I realized I’d rather be eating my cauliflower pretty much any other way—especially roasted in a blazing hot oven until each floret is caramelized and crunchy. Then Lauren Schaefer developed a cauliflower rice pilaf that showed me the light.Schaefer’s weeknight-friendly recipe taps a few key ingredients—sliced almonds, golden raisins, scallions, ground cinnamon—to give riced cauliflower that much-needed makeover. “It’s the same principal with salads: You want something crunchy, something salty, and something fresh,” she says. “I see cauliflower rice in everyone’s carts at the grocery store, but I feel like it’s something you eat alone—but I think anything you eat by yourself, you should feel proud to eat with other people.” You can turn a plain old head of cauliflower into “rice” by pulsing pieces in a food processor, but I live in a New York City apartment with minimal counter space (read: limited appliances), so I just bought it pre-made at Trader Joe’s. It was time to give those frozen bags another chance.The makeover began by toasting sliced almonds in a pool of ghee. The rich, buttery smell gave me hope. These nuts should be golden brown, not burnt brown, so I took them off the heat as soon as they started to look golden and let them finish cooking as they cooled. Then I added cinnamon and red pepper flakes and poured the whole delicious-smelling mixture into a big bowl. Next I heated a bit more ghee in that same pan, sautéed some sliced scallions and golden raisins, and added the cauliflower. A little steam released, no biggie, but soon the aromatics and cauliflower became one harmonious mixture. I poured the whole thing into the big bowl and tossed until the cauliflower rice was completely coated in spiced ghee. Then I topped the pilaf with sliced scallion greens and took a bite. Just like that, I was a cauli-rice convert.The buttery blend of warming spices coated each cauliflower crumb, which were studded with toasty shards of almonds and sweet pops of chopped raisins. It was a supremely comforting bite. I decided to serve the pilaf with homemade yogurt flatbread (I'm clearly not trying to give up carbs) and quick-pickled cucumbers, but I’m already planning to serve it with a roast chicken for an easy dinner party. It’s a vegetable dish and a starchy side all in one—plus I’m itching to share this cauliflower rice treatment with my friends. It'll make them believers too.Give cauliflower rice a chance:Cauliflower Rice PilafThis cauliflower rice recipe is very adaptable; just use what you find in your cabinets.View RecipeExplore Bon AppétitHealthyishCauliflowerRice PilafSideRead MoreLifestyleApologies to My Husband But Cauliflower Bolognese Is My Boyfriend NowBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Aliza Abarbanel"]}