{"id": "74160eb2492d76bb72f837581ff5b2ab", "url": "https://www.bonappetit.com/story/just-buy-it-soup-ladle", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "A Good Soup Ladle Is Worth Its Weight in Gold (or at Least Stainless Steel) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Good Soup Ladle Is Worth Its Weight in Gold (or at Least Stainless Steel)Put down that half-melted plastic one and get a real ladle already.By Alyse WhitneyMarch 7, 2018FacebookTwitterEmailFacebookTwitterEmailWhen I graduated from high school, I got a plastic set of cooking utensils that all locked into each other for easy storage. I used this Big Love of spoons and spatulas for almost a decade, and they got burnt, melted, and stained along the way. The first real casualty was the soup ladle, which was used for turmeric chicken noodle soup and never recovered. What was once a lovely(ish) shade of mint green plastic became...yellowish? Light orange? It's a hard color to describe. Since it also kinda melted, I decided to say goodbye to my college utensils once and for all and went on a hunt for new ones.But I didn't get a new ladle right away; it was low on my list. I had my silicone spatulas to stir and flip food, tongs, and a wooden spoon, so it just wasn't a priority. Then I made lemony chicken and rice soup and realized there was no way to get soup from my Dutch oven to a bowl without spilling it all over the place. I realized how much I took my ladle for granted, a tool that could easily pour stock into quarts for freezing, portion soup into meal prep containers, and generally keep a kind-of-klutzy person like me from splashing hot liquid everywhere. In a panic, I used the largest serving spoon I had to carefully get soup into the bowl, and then immediately ordered a stainless steel ladle on Amazon. ($7.70—what a steal!)Ladle lemony chicken and rice soup into bowls, stage an Instagram-worthy photo, eat it. Repeat.\nAlex LauLook: If you make soup, chili, stew, or anything even remotely broth-y, it's time to buy a damn ladle already. A sturdy, no-nonsense stainless steel one that isn't going to warp and melt and get stained and permanently smell like the first thing you used it for. It will help keep your life spill-proof—my favorite microwavable soup containers also do that—and will actually hang onto the side of the pot so you don't have to get your counters all dirty or have it fall into the pot by accident. The one you want is all metal, which means it will get hot if you leave it in the pot (careful!), but it won't melt or stain like my old plastic ladle (R.I.P.).Soup is just the beginning, though. It also is great for saucing Italian food like spaghetti and meatballs, layers of lasagna, or simple homemade pizza. You could use it to serve a giant punch bowl of rosé aperol spritzes. If you made a big vat of queso (normal weekend activity), you could keep most of it warm on the stove and ladle some into a serving bowl. If your boat sprung a leak, you could probably use a ladle to get water out and maybe even plug the hole. Travel with your ladle—you never know when you're going to need it.Just Buy It: Winco Stainless Steel Ladle, $7.70 on Amazon.Now go make chili:Explore Bon AppétitBasicallyShoppingSoupStewChiliRead MorerecipesChicken Soup for the Chilly Soul: 21 Comforting, Warm RecipesGallery22 SlidesBy Danielle Walshcooking73 Healthy Soup Recipes That Make Any Day CozierGallery73 SlidesBy The Healthyish TeamcookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza Abarbanelrecipes9 Chili Recipes for Your Super Bowl PartyGallery9 SlidesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Alyse Whitney"]}