{"id": "741a587a059ec187381b2014d7c28f1a", "url": "https://www.bonappetit.com/story/caribbean-cookbook-provisions", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "This Caribbean Cookbook Spotlights Vegetarian Food and the Generations of Women Who've Cooked It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Vegetarian Cookbook Spotlights Caribbean Food and the Generations of Women Who've Cooked ItJulia Turshen talks with sisters Michelle and Suzanne Rousseau about their new cookbook, Provisions.By Julia TurshenOctober 31, 2018FacebookTwitterEmailPhoto by Ellen SilvermanFacebookTwitterEmail“The story of Caribbean food cannot be told without telling the story of Caribbean women,” opens Provisions, the new cookbook from Jamaican sisters Michelle and Suzanne Rousseau. The sisters have a long history of collaborating in food together: They have run restaurants and a catering and events business, and they co-authored another book, Caribbean Potluck, in 2014. With Provisions, they further cement their legacy not only as ambassadors of Caribbean foodways but also as preservers of its history. We sat down recently, me on my couch in the Hudson Valley and them on theirs in Jamaica (thanks, technology!) to talk about their thoughtful and emotional journey putting together this collection of contemporary vegetarian recipes. Inspired by the literal roots of Caribbean cooking, Provisions is as much a beautiful meditation on what the sisters cook today and as it is an homage to all the women who have stood in kitchens stirring pots to feed their communities before them. – Julia TurshenYour book begins: ‘This book is dedicated both to the women of our past whose stories have disappeared from the family tree because they were deemed unimportant, irrelevant, or unnecessary, and to the women of our future who will carry on this beautiful lineage and create new stories and recipes to share with their daughters.’  When you started this book, did you know that this is what it would be about?Michelle: To be honest, no. The book originally came out of the name Provisions. The focus was for us at first was slavery and the inheritances of slavery and looking at the Afro-Caribbean influence of the food during slavery...the tradition of eating these ingredients in this particular way and peppered by the influences of either the colonizers or other influences. It started from there, but a natural female perspective came. And we couldn’t tell the story without telling the story of women.The authors, Michelle and Suzanne Rousseau.\nPhoto by William RichardsWhat feeling do you hope readers, especially young women, will take with them from this book?Suzanne: An understanding of legacy of those who came before and how important it is to recognize that aspect of our history. How we do everything and how we eat— it's all a function of everything that came before. We run the risk in the Caribbean of thinking that how it’s done in a different, wealthier environment is “better.” They emulate women who aren’t from here and we have to hold strong to our own.Michelle: A sense of belonging. If you take the time to listen and hear stories about people who came before you, not only does it help to root you and ground you and inform who you are and where you want to go, it helps inform this heritage that we're losing. Recipes and documentation are being created outside of us and if we don’t sit and speak to these women, their stories will disappear. You don’t have to document it, but if you don’t start to understand it, you also lose an aspect of yourself. We don’t want to lose the past. We don’t have to dwell there—that’s why the recipes are modern. They give you a point of reference so you can better understand yourself.There are recipes in the book that some people might not immediately associate with Caribbean food.Michelle: Like the falafel with tahini. People don’t know that there’s a massive Arab population here, so that dish to us is as much Caribbean as anything else. It’s been in the region for a very long time. Asian-Caribbean food has a long legacy and it’s equally as authentic as anything else. The book is a way to present the food with the plethora of food with all of these ingredients to show how diverse our food is and what is available to us.What do you think is the most misunderstood thing about Caribbean cooking?Michelle: There’s a perception that everything that comes out of the region is rustic. Even in the photography they wanted everything to be rustic and dark and we were like no we want color, we want antiques, crystal, silver, and to use the things that have been handed down. There’s a massive heritage of artisanship, of basket weaving and crafts, just as in the Gullah culture. That heritage is very present.This book is all vegetarian— was that intentional from the beginning or something that evolved?Michelle: I think the focus came from the publisher because when we first sent out versions of manuscript, slaves were given salted meat (fish and meat, liked salted fish, pigtails, and son on). That was there allotment of protein. Fresh meat wasn’t given to them and they substituted with [what we call] provisions of every kind (breadfruit, plantains, etc). [We were] looking at what they were eating and we sent that to the publisher and they liked how there was such a focus on healthy, vegetarian cooking and asked if we would consider taking out the meat and making it just that.If someone is unfamiliar with provisions [cooked, starchy vegetables common in Caribbean cuisine], which recipe do you recommend they start with?Suzanne: The roast breadfruit. Most people don’t eat provisions in that way, but doing breadfruit with honey and Maldon salt is incredible, and you can incorporate it in a really simple way into any kind of meal.Which recipes from the book do you find yourself making again and again?Suzanne: There are so many in there that we love. The pepper sauces and pickles are really fantastic. We use those all of the time. Our grandmother always had a jar of pickled cucumbers and peppers she always had with every meal. The pak choi salad. The curried chickpeas.Michelle: The eggplant with roasted tomatoes and a little feta—that is amazing. The romaine salad, the black bean plantain burger…the plantain gratin—we make that when we entertain.Did working on the book make you feel closer to the women in your own life?Suzanne: We both dreamt about our grandmothers. There was definitely a calling that there was a story to be told and an acknowledgement to me made for women who hadn’t been seen and acknowledged. One day I had an overwhelming sense of my paternal grandmother’s presence and a sense of the hardship of her life, the loneliness of her life. I think our understanding of their lives, not of them just as grandmothers and aunts, became so much more real.How has creating this book changed you?Michelle: I feel a sense of relief because I felt like I had these voices telling me to record this before it was too late. This group of women came together to help us create it and it has made it more complete and more complete in a way we could’ve ever made on our own. It feels no longer mine. I feel like we can let go.Suzanne: I look at it and I'm like, who wrote this? Where did it come from? We had to let go at some point and give it to the universe and hope it will be received well. It was very emotional for us. When we wrote, we wept. It felt like it was so much bigger than ourselves. Every time we would sit and read, it felt like there was a panel of women around us. We have to have a dinner for the ancestors and set a place for everyone.Buy Provisions: The Roots of Caribbean Cooking, $20All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishInterviewsCaribbean/Central AmericanCookbooksRead Morecooking'It’s Puerto Rican Because I Made it'By Korsha WilsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Julia Turshen"]}