{"id": "741fca9983ebe8800529805ce68588ff", "url": "https://www.bonappetit.com/story/homemade-tomato-sauce-in-a-half-hour", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "FYI, You Can Make Delicious Homemade Tomato Sauce in a Half Hour | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFYI, You Can Make Delicious Homemade Tomato Sauce in a Half HourYou don't have to cook tomato sauce all afternoon for it to be noodle-worthy. Two methods for getting big flavor in no time.By Alex DelanyMarch 20, 2019FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailThere’s this romantic idea that a truly great homemade tomato sauce requires hours of gentle simmering to be even remotely noodle-worthy. If you want spaghetti and red sauce on a Wednesday night, well, looks like you just have to buy a jar of marinara from the grocery store! When you're short on time, you've got to pay someone else to do all of that cooking for you, right?Not so fast! You've got more options than you think. You can absolutely make a delicious, from-scratch tomato sauce in less than 30 minutes. For real. Like, in the time it takes to boil a big pot of pasta water and cook some noodles, you can make sauce. We wouldn’t lie to you. And we’re not talking smack on a five hour Sunday gravy—we love that stuff. But we don't always have the time. So given this new information, we just want to know: If you can make a killer tomato sauce in a half hour, why are you still buying jarred tomato sauce from the grocery store?The reason long-cooked tomato sauce is so tasty is that you’re taking the time to cook off as much water as possible, concentrating the umami-rich flavors in those tomatoes. You're taking the time to develop the fruit's natural sugars, balancing the acidity of the tomatoes and smoothing out the sauce's edges. But when making a quick tomato sauce, you don’t get all of that time to build flavor. You need to change up the procedure if you want to develop that complexity more quickly. And there are actually a couple ways to do that, both of which result in a flavorful sauce. And both start with sautéing aromatics in olive oil.In the first technique—one we utilize in our spaghetti pomodoro recipe–you start with smashed garlic in olive oil. But it’s what you do to the tomatoes that really deepens the flavor. Instead of crushing the whole peeled tomatoes and dumping them into you Dutch oven, we strain the liquid from the can into a bowl and throw the whole tomatoes into the Dutch oven, sans-liquid. This allows the tomato solids to caramelize without that liquid getting in the way. After they’ve picked up some color and flavor,  you crush them with a wooden spoon and add the liquid back in, along with some basil, to reduce for about 15 more minutes.Adding Parm and butter to simple sauce builds texture and creamy flavor.\nPhoto by Heidi's BridgeWhen your pasta is a bit shy of al dente, you dump it into the pan with a little bit of the pasta water and stir to coat. Then you add two ingredients that make the sauce even tastier. Slowly sprinkle in some finely grated Parmesan cheese and then finish with a bit of butter. Then end result is a sauce that is hefty enough (thanks to butter and Parm) and naturally sweet enough (thanks to the strained and browned tomatoes). Thirty minutes. Super sauce. Done.But you can also go a different route—one we use in our skillet lasagna recipe—for an equally flavorful sauce. And this one comes together even more quickly. Here, you start with chopped onion and garlic. You’ll see onion in almost every long-cooked red sauce ever—partly because it’s traditional, but mostly because onions provide sweetness. And in this method, you increase the onion quantity to deliver even more.A hefty portion of onions and garlic adds balancing sweetness to a tomato sauce.\nAfter the onions and garlic start to caramelize over medium heat, you add crushed tomatoes—we’re on the fast track here, and this saves the time of crushing whole peeled tomatoes—directly to the skillet and season the whole thing with salt, pepper, and red pepper flakes. Then we just let it simmer for fifteen minutes, giving it a stir every once in a while. There’s no Parm or butter here. It’s all about quick, simple tomato flavor, balanced by the sweetness of onions and garlic. And while this sauce is delicious layered up with ricotta and sheets of pasta, it'd be every bit as tasty tossed in the pan with spaghetti and a few splashes of starchy pasta water.There you go. Two quick methods that deliver the tomato sauce flavors you know and love, without standing over the stove for hours or shelling out for the pricey store-bought stuff. Plus, you know exactly what’s going into that homemade sauce—there’s probably less sodium, sugar, and preservatives in your quick tomato creation. Apologies to your favorite jarred sauce, but you're on to bigger and better things. Nice knowing you, bud!And here's that lasagna we were talking about earlier:Basically Skillet LasagnaFinally: an easy, cheesy, vegetarian(!) lasagna recipe that doesn't require you to dirty every pot and pan in your kitchen.View RecipeExplore Bon AppétitBasicallyTomatoTomato SaucePastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-20", "author": ["Condé Nast", "Alex Delany"]}