{"id": "7455b42bb4600b93b3ff228c2d5fc322", "url": "https://www.bonappetit.com/recipe/chicken-under-a-skillet-with-lemon-pan-sauce", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Chicken with Lemon Pan Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueChicken Under a Skillet with Lemon Pan SauceBy Claire SaffitzMarch 20, 20184.2(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintButterflying and flattening the bird might feel like chicken chiropractory, but it’s all in the name of crisp golden chicken skin, and what more noble cause could there be? The flatter the chicken, the more contact with the cast-iron pan and the more crackly skin to enjoy at the end. And we wouldn’t tell you to invest in a second cast-iron pan if we didn’t think the crackly skinned roast chicken waiting for you on the other side was 1,000 percent worth it. Using the top pan as a weight maximizes the surface area that makes contact with the bottom pan, which all translates to—you guessed it—ethereally crispy skin. We recommend using a bottom skillet that’s at least 12\"—any smaller and you won’t be able to fit the whole bird.Ingredients4 servings 13½–4-lb. chicken, patted dryKosher salt, freshly ground pepper2Tbsp. extra-virgin olive oil1medium shallot, finely chopped½tsp. crushed red pepper flakes¼cup dry white wine¼cup fresh lemon juice2Tbsp. unsalted butter, cut into pieces¼cup chopped parsleyPreparationStep 1Place chicken on a work surface and use kitchen shears to snip off wing tips (they get in the way of the breasts during cooking; save them for stock). Turn chicken breast side down and use shears to cut along both sides of the backbone to remove it (save for stock along with those wing tips).Photo by Laura MurrayStep 2Open up chicken and use the tip of a knife to cut a shallow line along either side of the rectangular bone and strip of cartilage in the middle of breast. Turn chicken skin side up and press down on center of breast to flatten chicken—you should hear the breastbone crack.Photo by Laura MurrayStep 3Season generously on both sides with salt and pepper and let sit at room temperature at least 20 minutes and up to 1 hour.Step 4Preheat oven to 350°. Heat a dry large cast-iron skillet over medium. Pat chicken dry with paper towels and season all over again with a light sprinkling of salt. Add oil to skillet, then chicken, arranging skin side down. Cover the bottom of another smaller cast-iron skillet with foil and place over chicken to weigh it down.Photo by Alex Lau, styling by Claire SaffitzStep 5Cook, peeking under foil and lifting chicken a bit to check, until skin is deep golden brown and crisp all over, 15–18 minutes. Remove top skillet and turn chicken skin side up. Transfer skillet to oven and roast chicken just until cooked through (an instant-read thermometer inserted into the thickest part of breast should register 160°), 15–20 minutes. Carefully remove skillet from oven and place chicken skin side up (to preserve that crispness) on a plate to rest.Photo by Alex Lau, styling by Claire SaffitzStep 6Set skillet over medium-low heat and add shallot and red pepper flakes. Cook, stirring often, until shallot is softened and golden, about 3 minutes. Add wine and lemon juice and swirl skillet to emulsify. Reduce heat to low and add butter; cook, swirling to combine, until melted. Pour in juices that have pooled under chicken on plate; mix in parsley. Return chicken to skillet to serve.How would you rate Chicken Under a Skillet with Lemon Pan Sauce?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleFollowed written recipe with a smaller chicken and 350 is not hot enough after 20 minutes our skin wasn’t crispy at all the written recipe is not accurate it should be taken down do not follow.AnonymousCanada 1/12/2022Two skillet method turned out amazing. The couple of tweaks I made were marinating the chicken in a lemon-pepper buttermilk brine overnight, and roasting at 400° instead of 350° after the sear. One note, I seared my chicken for maybe 5 - 7 minutes on high. Although I probably preheated the pan too much, if I would have let it go for the recommended 15 - 18 the skin surely would have burned.\n\nPulled the chicken at 160°F and it was insanely tender, moist, and flavorful. The resultant pan sauce was beautifully bright from the lemon juice and wine yet savory from the fond and chicken fat left from roasting the chicken directly in the skillet. Nick W.Philadelphia, PA1/4/2022Follow the video, not the printed recipe.  This is so easy and works every time.  I'm single and will grab 3- 3.5 lb. chickens when I find them to keep in the freezer for nights when I want this delicious chicken.  I used the leftovers for chicken salad and nachos and use the carcass to make the most amazing chicken stock.  Fast, failsafe and utterly deliciousChicago12/19/2021I’m so confused - video and written are two diff recipes..... oven wasn’t hot enough @ all. Chicken ended up needing to cook for so much longer + skin wasn’t crispy at all( following above written recipe). Bethany YoungCanada 8/1/2021Don't invest in a second cast iron pan. Invest in (or use if you own one) a dutch oven. gud2gro2/2/2021Every time I make this, my fire alarm goes off because it's so smokey. The chicken is perfect, but I don't know which part is causing the smoke. I even switched to avocado oil since I thought the EVOO had too low of a smokepoint for 500, but still too smokey. Any advice? Sheila d.Austin, TX1/18/2021Follow the recipe in the video, not the written one. I've made it both ways. I've followed the written recipe the last 3 times (yes the finished dish is THAT good) and each time the chicken is extremely undercooked after the 30 minutes. It's not just because my chickens are juuuuust on the high side of 4 pounds either MattParamus, NJ1/10/2021this turned out incredible!!! I added brussel sprouts to the white wine sauce and it was truly a completely stunning dishjilleforestville ca 11/28/2020Just a quick note to say I used this basic technique with some skin-on, bone-in chicken thighs, and it worked brilliantly.Ed HawcoMontreal7/26/2020Fantastic. Great for a weeknight. Super easy. You can follow the recipe as written EXCEPT for the oven temp which MUST be 500 (not 350). Removing the keel bone is a huge help to get the chicken really flat.AnonymousLos Angeles6/28/2020this recipe does not follow the video which makes it confusing. Do not follow the written recipeAnonymousPhiladelphia, PA5/24/2020This is one of the best chicken recipes I’ve ever made. It’s always praised around the table by family and friends. Follow the written instructions to the letter. It always turns out perfect. I see many people here commenting about the video. The “Carla Makes 30 Minute Brick Chicken” video is not the video for this recipe. I think people are mixing aspects of the two recipes and not getting good results. Just follow the written recipe. It’s great!boyinthebushBrooklyn5/16/2020The temperature indicated in the written recipe didn't feel right to me.  So I followed the recipe as showed in the video and the chicken came out perfectly.   I used about a cup of stock.  Next time I will use less butter and more of the rendered fat.   PesqVillTijuana5/7/2020It was a great recipe but...How can you tell if you use the parsley stems or just the petals in a recipe.? Lcrowder1100Texas5/5/2020Given the pandemic, chicken options were limited at my local store. I ended up with boneless, skinless but still hearty chicken breasts. This recipe was great - I appreciate a more well-done chicken. I adjusted time based on what  I like and the end result was fantastic. I had been eyeballing Ina Garten and Giada recipes ... but this one spoke to me. TY, BA!   marygseattFort Collins, CO5/4/2020Explore Bon AppétitChickenPoultryMainGluten-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}