{"id": "746139ec6e363fef1fd4245b294e8a73", "url": "https://www.bonappetit.com/story/caitlin-hata", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Caitlin Hata: Inside the Mad-Science World of a Professional Fermentation Chef | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleInside the Mad-Science World of a Professional Fermentation ChefHow Caitlin Hata, the fermentation chef at The Manufactory, turns food waste into kimchi and more.By Zan RomanoffMay 15, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmail“I like it when people ask me, ‘How did you get into fermentation?’” Caitlin Hata says. “Because I like to say: ‘It scared me.’”Like most of us who grew up in a culture that prizes the anti-bacterial, Hata didn’t see how fermentation could possibly be a good idea. “I didn't understand how vegetables could just sit out on the counter and it was fine to eat them,” she says. But instead of shying away from the subject, she threw herself into it: “It turned into this obsession,” she says. “If that’s okay, well then how is this okay? Or this? How do you know if it's not okay? And I just started going down the rabbit hole.”It’s a quiet, gray Los Angeles afternoon and we’re sitting on the back patio of Alameda Supper Club, a Cal-Italian restaurant from chef Chris Bianco that comprises approximately a third of the recently opened Manufactory complex. Hata serves as the fermentation chef for all of the Manufactory, which, in addition to Alameda Supper Club, includes the more casual Tartine Bianco, as well as a specialty food market and a walk-up counter that sells coffee, bread, and house-made soft-serve.The Manufactory occupies 44,000 square feet, and Hata’s work can be found in nearly every cornerThe idea of a fermentation chef is a relatively new one in professional kitchens, particularly in the French-influenced world of fine dining, which doesn’t traditionally have many ferments on its menus. Rene Redzepi’s Noma put fermentation in the spotlight when it won Restaurant Magazine’s Best Restaurant in the World award in 2010, but most kitchens still don’t dedicate an entire staff position to thinking about and executing fermentation projects. The title isn’t one Hata ever aspired to, mostly because until recently, she didn’t even know it existed.Hata was born and raised in Simi Valley, forty miles north of Los Angeles; after graduating from high school she took a couple of classes at Pasadena City College and spent some time in culinary school before deciding she wasn’t in love with either option. She ended up moving to North Carolina, where she got her first restaurant job at fine dining spot. “I walked in and I'm like, ‘Hi I want to learn how to cook and do nice food,’” She says. “The chef just hired me.” And that was that.Hata eventually moved back to California, where she worked at Bouchon Beverly Hills before moving on to The Charter Oak in Napa Valley. Her job title was line cook, but she was using any spare time she could find for her fermentation projects. The kitchens she worked in were happy to support her, she says, but she didn’t have the freedom to experiment that she has now.The Manufactory's kimchi uses leftover ginger, root vegetable tops, and pulp leftover from fresh-squeezed juices.\nPhoto by Emma FishmanThe Manufactory occupies 44,000 square feet, and Hata’s work can be found in nearly every corner. At the bar at Tartine Bianco you can order a Violet Revolver, a bright, fruit-forward cocktail that features a currant-kefir ferment; you can eat chicken hearts that have been marinated in an umami-heavy paste made with Hata’s house-fermented koji rice. The barley in Alameda Supper Club’s barley risotto is fermented before it’s cooked; Hata then takes the liquid left over from that process and turns it into a syrup that gives the Supper Club’s Barely Legal cocktail its smooth, earthy flavor.Bar director CJ Catalano says that collaborating with Hata is one of his favorite parts of the job. “It's a consistent back and forth on, ‘how do we make things better?’” he says. “She gets these brilliant ideas and comes to us; we have other ideas and we try to come to her and say, ‘How do we make this happen?’ It's a mutual admiration.”Camden Herschberger, Tartine Bianco’s chef de cuisine, agrees that having someone to talk with can help spur creativity on days when he feels burned out. Having Hata makes his job feel sustainable “not just in the food aspect, but also in the emotional and mental aspects as well,” he says. “We can definitely lean on each other and help each other get through things.”Hata’s work spans far beyond the cocktail program: she also makes pickles you can order by the ramekin, as well as kimchi and the kombuchas and shrubs on the restaurants’ zero-proof drink menus. She cultures butter and yogurt, and dries garlic butts and onion ends so she can grind them into powders for the kitchens to use. She’s working on distilling leftover wine into house vinegars. She blends the spice mix for the coffee bar’s chai. The only places you won’t see Hata’s hand in something are the breads and desserts, though she’s working on that, she says: teaming up with the bakery to create a bread that incorporates koji, and with the sweets team on a vinegar sauce called saba.“It hurts my soul as a person to see things go to waste because it's not a perfect square,” Hata says.Hata is 28 years old and no more than 5’2, but she has one of the biggest jobs in the Manufactory. She gets to work around 5 a.m. every morning—she likes to be the first person from the savory team in the kitchen so that she can check on her fermentation projects undistracted, she says. Most days she works for about 12 hours, though she swears she’s “getting better” about heading out by 3:30 or 4 p.m.Tartine is quietly committed to minimizing food waste, and Hata is critical to turning these culinary gears. “Ginger is a beautiful example” of how her position helps minimize organic waste, Hata explains: “We use the juice in the kombuchas and the bar program; the skins we dry for our chai tea, and I use the pulp in the kimchi. It’s zero-waste.”The Manufactory's fermentation storage is highly organized.\nPhoto by Emma FishmanThe Manufactory’s kimchi is almost all second-use product: in addition to the ginger, it incorporates root vegetable tops that local farmers’ market vendors save out for her, as well as the pulp leftover from the bar program’s fresh-squeezed juices.An aversion to waste was another element that drew Hata to fermentation. Fine dining restaurants like the ones she came up working in are often very exacting about presentation, which can create a lot of trim: bits and pieces shaved off as a chef tries to turn an irregular piece of produce into an exactly symmetrical shape. “It hurts my soul as a person to see things go to waste because it's not a perfect square,” Hata says.Now, even a project gone awry can yield useful results: one of the things she’s most excited about is a coriander blossom shrub she stumbled onto by accident. “I was trying to preserve the blossoms in a different way,” Hata says. “But then they completely disintegrated and fell apart. So I was like, why don't I just cover it in vinegar and call it an infusion?”Coriander blossom shrubs will go onto the Manufactory’s menus this spring. Hata is already looking forward to the next project, packaging some of what she produces to sell as part of the Manufactory’s retail operation. She dreams of selling pickles, kombucha, and her house-dried onion and garlic powders, which will allow Angelenos to buy better spices than the tired dry stuff you find at most grocery stores.When Hata’s not working, she rock climbs and is working on getting her paragliding pilot’s license. “On my days off, I'm never just resting,” she says. “I like to stay busy and recharge in a different way, even though I'm still doing something physically demanding.”Does she see a parallel, I ask, between her attraction to the bubbling cauldrons of fermentation and the dangers of these thrill-seeking hobbies?She admits that she gravitates toward things she doesn’t understand.  “I'm scared of it, so I have to learn everything about it. And then I become obsessed.”Explore Bon AppétitHealthyishFermentationTartineLos AngelesRead MoreLifestyleCortney Burns Is the Godmother of FermentationGallery9 SlidesBy David TamarkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Zan Romanoff"]}