{"id": "747d7dd8fd3c2a75910fb116282fb421", "url": "https://www.bonappetit.com/story/reverse-sear-chuck-steak", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "The Reverse-Sear Chuck Steak Is the Biggest, Cheapest, and Most Foolproof Steak You'll Ever Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Biggest, Best, and Cheapest Steak You’ll Ever Make Is Also Impossible to Mess UpWe all need a little more reverse-sear chuck steak in our lives.By Amiel StanekJanuary 4, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailBasically editor Amiel Stanek spends all day every day trying to help readers get dinner on the table as quick and efficiently as possible. So when he gets to cook at home, he likes to slow things down and be a little...extra. Welcome to Not So Fast, a column about what he’s cooking.You know what I love? Steak. And you know what else I love? Cooking a big, thick steak for a bunch of my friends, not spending that much money on it, and doing it in such a way that practically guarantees that it turns out a perfect wall-to-wall medium-rare—all without sweating and stressing over the stove. Cool, right?But, Amiel, you might be thinking to yourself, Steak is expensive! Like, payday-on-my-birthday expensive! And I get hives just thinking about trying to get that internal temperature to sweet perfection!Well, friend, that's because you've never met the reverse-sear chuck steak. But I'm going to introduce you.This miracle of a non-recipe relies on two foundational ideas. The first is that, contrary to popular belief, anything can be a steak if you cook it like one. While the cuts of beef in the butcher's case that are actually labeled “STEAK” tend to be pretty expensive, there are plenty of others that, while traditionally used for braising or slow-roasting, are actually delicious when cooked to a juicy medium-rare and sliced thinly. In this case, we're talking about chuck roast, a big, honkin‘ chunk of meat that's usually long-simmered for pot roast. Chuck roasts usually clock in at around two and a half pounds, which is more than enough to feed six hungry people. While it definitely has more chew than, say, filet mignon, it more than makes up for in affordability and beefy flavor.The second is that the conventional approach to cooking a thick steak (blasting it with high heat to form a beautifully-burnished crust, and then reducing the heat to allow the internal temp to come up more gradually) is tricky, inefficient, and pretty intimidating for all but the most seasoned cooks—and that a practically foolproof alternative exists. That method is called the “reverse-sear,” and while I certainly didn't invent it, I am pretty obsessed with it. As you may have guessed, it involves flipping the usual method on its head.You start by cooking a big piece of meat very gently in a low oven until the entire thing is almost at your desired internal temperature, and then searing it in a screaming-hot pan just before serving to get the external browning you're after. The best part? You can do stage one well before any of your guests show up and then, come showtime, disappear into the kitchen, move on to stage two, and emerge five minutes later with a giant platter of perfectly cooked meat. It isn't the fastest way to cook a steak—you're going to want at least a two hour runway before dinner time for a piece of meat this large—but it is prooooobably the best. Here's how it's done.Handsome Boy! Beautiful Boy!\nPhoto by Chelsie CraigFirst things first: There are a few tools that are non-negotiable here. A sheet pan. A wire rack of some sort that fits into said sheet pan, which keeps air circulating around the whole steak. A decent instant-read thermometer.Take your 2½-lb. chuck roast out of the fridge and unwrap it. Look at that Big Boy! Handsome Boy! So beefy and bold and streaked with fat! Using a meat mallet or an empty bottle of wine, give it a few good thwacks so that it loosens up a bit and is a nice, even two inches thick. Now, give Handsome Boy a literal shower of kosher salt—each and every side, way more than seems reasonable or humane. (It's a big piece of meat and can take it!) Preheat the oven to 225°F, place the meat on a wire rack set into a sheet pan, and let it sit out at room temperature for a half hour to an hour. Room-temperature meat will always cook more evenly than fridge-cold.When you’re ready to cook, use paper towels to dry the meat off as thoroughly as humanly possible. Pop the whole steak-rack-pan situation into the oven. Keep the steak in the oven until an instant-read thermometer inserted into the thickest part of the meat reads between 115°F and 120°F. This actually takes quite a bit of time—usually about an hour and 10 minutes total for me—but I start checking every 10-15 minutes after the first 45 or so. It’ll look preeeetty weird, kinda grey and funky and maybe not that appetizing, but this is just stage one! Once you’ve reached the desired temperature, you can let the steak kick it at room temperature for up to two hours before moving on to stage two—and that’s plenty of time to take a shower, prep the other dishes that you’re serving, whatever. (But you can also sear it as soon as it comes out of the oven if you want!)Once it’s go time, put a big skillet (cast-iron is ideal) on the stove, crank the heat, and really let that thing get crazy hot. The cool thing about this method is that the exterior of your steak has lost a lot of moisture during stage one, jump starting the browning process; you’ll get the deeply caramelized color you’re after in as little as a minute per side. Drizzle a bit of neutral oil over the steak, and rub it all over so that it’s coated. (Less oil in the pan, less smoke in your kitchen.) Transfer the steak to that now-hot pan, and sear it on each side for about one minute, or until all sides are crusty and gorgeous. (You could also toss a knob of butter and some herbs in at this point and do a quick bastey-baste, but that’s totally optional.) When it’s finished, transfer the steak to a cutting board, because it’s slicing time!That’s the stuff: Wall-to-wall rosy pink, with as little grey as possible.\nPhoto by Chelsie CraigAnother wild thing about this method? You don’t even need to rest the steak before cutting into it—how cool is that?? Grab a sharp knife and slice the meat as thinly as possible, discarding any big chewy chunks of fat or gristle (there will be some). Unlike some other steak-steaks, the chuck roast is comprised of a few different muscles, so you may need to change your knife angle as you go, and don’t be afraid to get handsy with it. Pile all of that rosy-red meat on a big platter, hit it with some flaky salt, some freshly cracked pepper, and maybe a drizzle of grassy olive oil if you’re feeling fancy.And there you have it folks: the reverse-seared chuck steak in all its glory. Go forth and eat more steak.Once you’ve got the reverse-sear bug, check this recipe out:Reverse Sear Rib-Eye Roast with Fennel and RosemaryCutting the meat into two smaller pieces reduces cooking time, but it’s the roast first, brown later “reverse sear” that’s game-changing in this recipe.View RecipeExplore Bon AppétitSteakNot So FastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-04", "author": ["Condé Nast", "Amiel Stanek"]}