{"id": "748233d2c65911c8737f4812a7c740a0", "url": "https://www.bonappetit.com/recipe/chicken-braised-in-lime-and-peanut-sauce", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Chicken Braised in Lime and Peanut Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueChicken Braised in Lime and Peanut SauceBy Carla Perez-Gallardo and Hannah BlackJanuary 7, 20203.3(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBraising chicken with charred limes adds bite but no bitterness thanks to rich peanuts and tomatoes. This recipe is from Lil’ Deb’s Oasis in Hudson, New York.Ingredients4–6 servings2tsp. cumin seeds2tsp. coriander seeds4medium red tomatoes (about 1¼ lb.), cored6garlic clovesZest of 1 orange1cup fresh orange juice, divided½cup salted dry-roasted peanuts, plus more crushed for serving4limes, halved, divided1Tbsp. vegetable oil3lb. chicken thighs and drumsticks1large onion, thinly slicedKosher salt, freshly ground pepperChopped dill and cilantro and chili oil (for serving)Special EquipmentA spice mill or mortar and pestlePreparationStep 1Toast cumin seeds and coriander seeds in a dry small skillet, preferably cast iron, over medium heat, tossing occasionally, until very fragrant and just beginning to darken, about 5 minutes. Transfer to a plate; let cool. Reserve skillet.Step 2Finely grind seeds in spice mill or with mortar and pestle. Transfer ground cumin and coriander to a blender and add tomatoes, garlic, orange zest, ½ cup orange juice, ½ cup peanuts, and 1 cup water. Purée until sauce is smooth.Step 3Arrange 6 lime halves, cut side down, in reserved skillet and cook, undisturbed, over medium-high heat until charred, 5–8 minutes. Transfer to a large plate.Step 4Heat oil in a large Dutch oven over medium-high. Working in 2 batches, cook chicken, skin side down, until golden brown and crisp, 6–8 minutes per batch. Transfer to a plate. Add onion and cook, stirring often, until softened and browned, about 5 minutes. Return chicken to pot and pour sauce over. Bring sauce to a simmer. Season with salt and pepper; cover, leaving lid slightly askew. Cook, stirring in 2 charred lime halves halfway through (reserve remaining charred limes for serving), until chicken is very tender, about 1 hour.Step 5Transfer chicken to a platter, leaving sauce behind. Squeeze juice from uncharred lime into sauce. Add remaining ½ cup orange juice and season with more salt and pepper if needed. Spoon sauce over chicken. Top with herbs and more peanuts; drizzle with chili oil. Serve with reserved charred limes.How would you rate Chicken Braised in Lime and Peanut Sauce?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleI was not a fan of the sauce at all. The chicken turned out very moist, but I didn't like the marinade enough to justify making the recipe again. I think the orange conflicted with the peanut in a way that was not enjoyable. AnonymousNH5/3/2020This dish was absolutely delicious! To avoid bitterness, I just squeezed the grilled lime juice in rather than putting the whole lime half itself in during the braising process. HIGHLY RECOMMENDAnonymousPORTLAND, OR4/29/2020I'm a big BA fan, but this recipe was a huge flop. In fact, it was so bad, that I'm compelled to write a review, which is something I never, ever do. The sauce tasted like raw, stewed tomatoes with way too much lime-y bitterness. Don't waste your time.AnonymousNew York4/28/2020Heartily enjoyed this recipe. Not too complicated, and I ended up with a warm, savory, tangy sauce. I served this over basmati rice with generous amounts of chopped cilantro on top; it was even the better reheated the next day. AnonymousUpstate NY 4/21/2020This turned out really great. No limes at the grocery so we used 3 lemons instead. After the chicken was cooked, we took the time to reduce the sauce even further, and used the juice of only one and a half lemon. Keep tasting and adding citrus and salt until you like it. Didn't experience any of the bitterness noted below. When you're plating, don't skimp on the dill or cilantro, it really brightens things up. And lastly, instead of chili oil we added chili crisp, and boy was that ever delicious. AnonymousCanada4/10/2020I really loved the recipe - A lot of complaints in the reviews were about tomatoes not being in season in January, but I use cherry tomatoes that are organic and it’s now almost April. This dish was divine! I am with some of the other reviewer’s who did not find the limes offensive, they were delicious and reminded me of summer :-)Hharv001Chicago3/26/2020Nice recipe. Put only 2 charred limes in the curry and squeeze them after 20 mins and then get them out. The taste balance is perfect then! samdebodeNetherlands3/14/2020Wanted to love this dish.. however the limes made it almost inedible. Incredibly bitter. AnonymousOhio3/5/2020This is delicious. If you’re worried about the likes being bitter or there being too much orange juice in the sauce, add incrementally and taste... half tsp MSG doesn’t hurt either. johnny_d_b_searsDC 1/26/2020Really enjoyed this dish and was not offended by the charred limes. I used most of a can of whole tomatoes instead of fresh because it’s January. This did add a fair amount to the sauce so after I pulled the chicken after an hour I let it reduce in the pot for another 10 minutes. Ended up serving it over rice.BeetleborgzCalifornia1/24/2020Like the other reviewers, I was so excited about the recipe because I love lime and peanut sauces. It tastes like neither of those flavors. Because of the amount of orange juice the recipe calls for, I only get orange flavor and bitterness from the lime. I think peanut butter and lime juice would have made this recipe have more flavor. I also agree with the tomatoes comment from another reviewer. Due to seasonality I had to use canned tomatoes. \n\nI really wanted to love this one!!rachelkludeman4163Arkansas1/22/2020I was SO excited about this recipe. And the potential is there but there was too much bitterness in it from the lime. AnonymousMelbourne, Australia1/22/2020I enjoyed the charred limes and thought the dish was a great after-the-holidays reminder of summer, while not relying on the grill and still being just the right amount of cozy/comfort me. I was excited for the dark red color of the dish as it was pictured, but was disappointed when it came out more of a dark yellow: like curry. I followed the recipe to a tee and can’t see what in the ingredients list would cause that dark red color that inspired me in the first place. Better tomatoes (difficult to get during the winter)? Maybe some tomato paste? AnonymousColorado 1/20/2020The charred limes make the whole thing inedibly bitter, the other flavors don't support it enough eitherAnonymousON1/20/2020Explore Bon AppétitChicken ThighChickenPoultryPeanutNutTomatoVegetableChicken DrumstickWinterMainDairy-FreeGluten-FreeHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Carla Perez-Gallardo", "Hannah Black"]}