{"id": "74b239b36037f7b12406227545ff7a27", "url": "https://www.bonappetit.com/story/what-is-gua-sha-massage", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "What Is Gua Sha Massage and Does It Live Up to the Hype? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Gua Sha Massage and Does It Live Up to the Hype?Facial massage, but make it fancy.By Deanna PaiMarch 12, 2019FacebookTwitterEmailFacebookTwitterEmailThe other week, my boyfriend and I started massaging each other’s faces. (I don’t know what to tell you. Life is short and the commercial breaks during The Bachelor are long.) Plus, face massages are amazing. Really: Put down your coffee or kombucha or whatever and gently press your (clean) index fingers into the center of your forehead, just above your brows. Doesn’t that feel soothing? Am I right, or am I totally, completely, without-a-doubt right?That’s the thinking behind gua sha, an East Asian form of massage that’s garnered a big following on Instagram just like jade rollers before it—at least in part. “Gua sha uses a facial tool to massage the skin to relieve tension in the muscles, move lymphatic fluid, and increase blood circulation in the skin,” says Y. Claire Chang, M.D., a board-certified cosmetic dermatologist at Union Square Laser Dermatology in New York. Activating the lymphatic system, which ferries toxins, waste, and excess fluid away from your cells, can result in clearer, smoother skin. And by deeply kneading and thus loosening your facial muscles, gua sha boosts circulation and in turn ensures that skin cells get essential nutrients from your blood supply. It’s like a foam roller for your face.Instagram contentThis content can also be viewed on the site it originates from.Fans of gua sha say that it can also minimize fine lines and wrinkles, boost skin’s elasticity (so it looks firmer), and give skin a glow almost instantly. That immediate transformation is why Britta Plug, a holistic facialist and founder of New York City’s Studio Britta, began incorporating it into her facials. “I noticed that when I started incorporating this into my treatments, skin was changing beneath my fingertips,” she says. “It was getting firmer. Loose, saggy tissue felt tighter under my hands, it was less puffy, and muscles were releasing—and it’s all working by influencing the body’s internal systems.”Chang’s a little more skeptical. “While gua sha may...decrease facial puffiness, there is no evidence that it actually prevents skin aging and facial wrinkles,” she says. “Gua sha is definitely not equivalent to botulinum toxin [Botox], which helps decrease facial muscle movement, the root cause of facial wrinkles.” Speaking of: Plug informs me that gua sha and injectables don’t mix, so when I arm myself with a few gua sha tools and get started, I’m careful to avoid my recently Botox-ed forehead. (Alas, scowling at people for nearly 30 years has a downside.) Active acne, open wounds, and irritated skin are also a no-go.Plug recommends applying an oil first, which enables the tool to glide over skin. I pair Kora Organics Rose Quartz Heart Facial Sculptor with my usual moisturizer. While I like the tool—the heart shape makes it easy to hug the curves of the face—the moisturizer doesn’t give me much slip. I find way more success when I use it the next night with True Botanicals Pre Cleanse Oil. Not only does it smell herbal and calming, it also offers just the right amount of lubrication so it doesn’t tug or pull on my skin.Instagram contentThis content can also be viewed on the site it originates from.I follow the guide in this Mount Lai video, skipping the initial forehead portion and starting instead on my neck. Plug suggested beginning here: Holding your skin taut at the base of your neck with one hand, sweep the tool upwards and under your jaw. This helps get the lymph fluid moving, she says.I then follow the rest of the video, pressing it along my jawbone, cheekbones, and orbital bones. It feels really, really nice, as if my face were able to contort myself into pigeon pose. I know from yoga that I tend to clench my jaw, so massaging my jawbone from chin to ear is deeeeeeply relaxing. But besides some slight redness afterwards, I don’t notice much of a difference after my first go.Next, I try Mount Lai’s Jade Gua Sha Facial Lifting Tool. It’s roughly half the price of the Kora Organics Sculptor, and the biggest difference is in the weight and bulk of the stone. The Kora tool did a lot of the heavy lifting as far as applying pressure, but I find that the notch in Mount Lai’s conformed to the curves of my face more comfortably. Again, I don’t notice any lifting, although…do my smile lines look a little fainter? (Or maybe my eyesight is waning.)There’s not much of a difference after a few days of alternating the two—in my skin, at least. Because while my face doesn’t necessarily look better, it certainly feels better. The tension I hold in the lower half of my face is less noticeable after just one session. Gua sha makes for a very relaxing five minutes, and unlike jade rollers, I don’t feel like it’s a waste of my time. If anything, it’s totally worth it.Buy it: Mount Lai Gua Sha Facial Lifting Tool, $28.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautySelf CareTrendsRead MoreLifestyleWhy We're All About Bakuchiol, Natural Skincare’s Answer to RetinolBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Deanna Pai"]}