{"id": "74c4f5aaabcee7d8cc9887c3d420bfa3", "url": "https://www.bonappetit.com/story/cane-roti-lime-menu-redirect", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "When Life Gives You Lemons, Have a Lime | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen Life Gives You Lemons, Have a LimeAt Cane in D.C., Peter and Jeanine Prime are channeling the communal joy of the beloved Trinidadian hangouts known as limes. It just looks a little different than they thought it would.By Peter Prime, As Told to Christina Chaey With Additional Reporting by Jesse SparksSeptember 30, 2020FacebookTwitterPinterestPhoto by Rey LopezFacebookTwitterPinterestThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.A lime is what Trinis live for. It’s the word we use for different types of hangouts, and it’s a really integral part of the culture, from our after-work lime to our roti lime to our beach lime. With Cane, [my sister Jeanine and] I wanted to bring the lime to D.C. to represent how we hang out and get down. Our fish and tiffin boxes with roti at the bottom and all the curries on top are designed for you to share and dive in with your hands. Because Cane only has 33 seats, everyone was always sharing and talking to everyone else about their food, and when dishes arrived at the tables it was always a big discussion.But we’re never going back to that kind of density again; Cane as we know it isn’t going to exist anymore as a sit-down restaurant. So now we’re thinking of new ways to connect with our friends and family to keep the energy going. I’m looking into finding a new, bigger space for Cane, ideally with more outdoor seating and event spaces so you can still get a sense of community without being crammed in. We’re also thinking about things like smaller catered events at people’s homes or virtual cooking classes where we can still have that social interaction. Even if you’re not eating something I made, we can still share a recipe and an experience.Have your own DIY lime at home: Photo by Rey Lopez1/6Buss Up Shut Paratha RotiUse the silky shreds of this flaky Trinidadian flatbread to scoop up everything on this lime menu.View RecipePhoto by Rey Lopez2/6Curry GoatThis marinated, then slow-cooked Trinidadian goat is fall-apart tender.View RecipePhoto by Rey Lopez3/6Aloo and ChanaBe sure to add some spoonfuls of this delicious chickpea-and-potato mash.View RecipePhoto by Rey Lopez4/6Tomato ChokaIn this Trinidadian dish, chopped onions, peppers, and chiles get sizzled in hot oil before they’re poured over broiled peak-season tomatoes.View RecipePhoto by Rey Lopez5/6Green SeasoningThis herby, peppery blend is used as a seasoning for many traditional dishes from Trinidad and Tobago, including aloo and chana and curry goat. View RecipeREY LOPEZ6/6Fruit ChowServe this simple Trinidadian chow on the side for a fresh, bright contrast.View RecipeExplore Bon AppétitTrinidadianCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Peter Prime", "As Told To Christina Chaey With Additional Reporting Jesse Sparks"]}