{"id": "74cd29168bf0afdde9fb96fcaca2a093", "url": "https://www.bonappetit.com/recipe/grilled-swordfish-with-charred-leeks-and-citrus", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Swordfish with Charred Leeks  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Swordfish with Charred Leeks and CitrusBy Andy BaraghaniMay 22, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFirm, thick swordfish steaks can handle being cooked over medium-high heat like a steak. An even higher temp chars the leeks so that they’re smoky outside and sweet and juicy inside.Ingredients4 servings4medium leeks (about 2½ lb.)1cup green olives¼cup coarsely chopped dill3Tbsp. white wine vinegarKosher salt5Tbsp. extra-virgin olive oil, divided, plus more3oranges41\"-thick swordfish steaks (about 3 lb.)Freshly ground black pepperPreparationStep 1Prepare a grill for high heat. Trim dark green parts from leeks and remove any tough outer layers. Rinse off any sand and dirt and pat dry.Step 2Throw leeks on grill (no oil needed) and grill, turning every few minutes with tongs, until outside layer is completely blackened (they should start to soften and you might see some juices begin to ooze out), 10–12 minutes. Transfer to a platter and let cool (this also allows them to steam and become tender on the inside). Reduce grill heat to medium-high.Step 3Meanwhile, smash open olives using the side of a chef’s knife and remove pits (try to leave olive flesh in big pieces). Transfer to a medium bowl.Step 4Cut leeks into ½\"-thick rounds (ashy parts and all) and add to bowl with olives along with dill, vinegar, a big pinch of salt, and 3 Tbsp. oil; toss to combine.Step 5Slice off both ends of oranges, exposing the flesh beneath the pith, then stand an orange upright on a cut side like this:Illustration by Joe WilsonStep 6Following the natural curve of orange, slice away peel and white pith from top to bottom.Illustration by Joe WilsonStep 7Trim off any remaining bits of pith, then lay orange on its side and cut crosswise into ¼\"-thick rounds. Set aside for serving.Illustration by Joe WilsonStep 8Clean and oil grate and rub swordfish steaks with 2 Tbsp. oil; season with salt. Grill until lightly charred and just cooked through (fish will feel firm when gently pressed), 5–7 minutes per side.Step 9Divide swordfish among plates and arrange reserved sliced oranges around. Spoon leek mixture and any juices in bowl over. Drizzle with more oil and season with pepper.How would you rate Grilled Swordfish with Charred Leeks and Citrus?Leave a ReviewTell us what you thinkExplore Bon AppétitSwordfishFishSeafoodLeekVegetableOrangeCitrusFruitOliveOther IngredientsEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}