{"id": "74eab2eb53a79d84636197383e0e5c91", "url": "https://www.bonappetit.com/story/whats-the-difference-between-charred-and-burnt", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "What's the Difference Between Charred and Burnt? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat's the Difference Between Charred and Burnt?It's a fine line. And an important one.By Alex DelanyAugust 23, 2018FacebookTwitterEmailFacebookTwitterEmailWe would never tell you to burn your food. No one likes that. We wouldn’t hand you an ear of corn that crumbled to black dust when you touched it or a chicken wing that resembled a lump of coal more than it did anything edible. Burned food is no good. But we will tell you to char your food. We like charred food a whole lot.But what’s the difference between burned and charred? It seems like we’re talking about the same thing, right? Very dark color on the exterior of a vegetable, fruit, or protein. That’s charred? Or burnt? It could be either! What differentiates the two is how far you take this flavor-building process.Let's start with burnt. When you burn a piece of food, you're allowing the proteins and sugars within it to go past the point of caramelization to a fully-blackened, carbonized state. Burned food is, by definition, overwhelmingly bitter—the other flavors present will be unpleasantly overshadowed by acridness. You know how sometimes you forget to set a timer and only remember that you have cookies in the oven when your smoke alarm starts going off? Yeah: That's burnt. The subtle flavors of butter and sugar and chocolate and whatever else you put in them is barely detectable over the intense sharpness of their burned bottoms. No good!Charred scallions should be served with every pork chop.\nAlex LauChar, on the other hand, is all about balance. When we talk about charring a piece of food, we are, in fact, asking you to burn it—to take something over the edge between caramelized and carbonized. The difference is that you're allowing that to happen, and stopping the process at a point where the bitterness you've developed will be a welcome contrast to the other flavors in the mix. Foods with a lot of natural sugar in them, like sweet potatoes, corn, beets, and peppers, taste great with a bit of char because those newly-introduced bitter notes actually heighten your experience of their sweetness. You're creating complexity, which is a good thing.In this context, the difference between something that is pleasantly charred and disastrously burnt has to do with the ratio of burnt to not-burnt parts. If you roast wedges of sweet potato until one side is blackened, they'll be delicious, with plenty of sweetness to round out the package. But if you let those same pieces go until they're dark all over, the acrid flavors will be the only thing you taste. Bummer! Same goes for corn. We like to char corn until we have a nice mix of toasty-charred kernels and sweet, juicy ones, which creates complexity in what could otherwise be a one-note eating experience. But an ear of corn in which all the kernels are blackened? Not so much.So, no: Charred and burnt are not the same. But if you’re not careful, charred can turn to burnt quickly. It’s important to keep an eye on what’s going on with your food and remove it before something beautiful turns to something tragic. We’re not in the market for a tragedy. We’re in the market for flavor.And we're definitely in the market for some charred corn salsa:Corn SalsaWhether it’s scooped up with tortilla chips or spooned over a simple fillet of fish, this zippy charred corn salsa is the ultimate peak-August condiment.View RecipeExplore Bon AppétitBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Alex Delany"]}