{"id": "74f29e48fbcd48676d288046d017fead", "url": "https://www.bonappetit.com/story/kale-minestrone", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Kale Minestrone Soup With Pistou | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKale Minestrone Is The Brightest Spot Amid Winter's GloomI care more about soup season than sweater season, sorry. By Sasha LevineNovember 7, 2019FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.For me, the end of daylight saving time means two things: The start of my seasonal affective disorder (s.a.d.!) and the start of soup season (yay!). It’s been less than a week since the clocks rolled back, and the liquids are already flowing. Simple ribollita? Finished the batch on Wednesday for lunch. Chicken and rice soup? Last night’s dinner. And I’m already planning for what’s coming next: kale minestrone with pistou.Packed with vegetables (leeks, onions, carrots, celery), greens (kale), beans (cannellini), tomatoes (canned, duh), pancetta (just a bit for flavor), and potatoes (waxy Yukons take the place of pasta), it’s a hearty, satisfying pot of chunky deliciousness—the whole food pyramid in a single pot. (If you want to go completely vegetarian, the pig is optional; you won’t even miss it.)Yes the ingredients are many—the recipe also includes the makings of a “pistou,” which is French for “pesto,” and an “herb sachet” a.k.a. “bouquet garni” (fancy speak for “some herbs tied up with string”)—but really, it’s just chopping. And you definitely don’t need to get precious with that: The beauty of minestrone is that it’s rustic and unfussy; the more imperfect it seems, the better and more appetizing it looks. It helps, too, that there’s a fresh herby drizzle to go on top, adding a bright shock of basil, garlic, parm, and lemon zest to the soup’s deep, developed flavors.Best yet, this soup makes eight servings, which means if you’re not interested in sharing, that’s a whole week of really good soup right there. Because you know what else the onset of winter indicates? That it’s the time of year to get a little bit lazy (uh, I mean \"cozy\"), too.Get the recipe:Kale Minestrone With PistouThis rave-worthy soup is all about layering powerful flavor-enhancers that you probably already have on hand—tomato paste, herbs, Parm, and, of course, kosher salt.View RecipeExplore Bon AppétitNever FailSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Sasha Levine"]}