{"id": "74f9d697634bccd7f421fea0d4b10969", "url": "https://www.bonappetit.com/story/peanut-pork-collards-rice-noodles", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Creamy Peanut Noodles for Anxious Home Cooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCreamy Peanut Noodles for Anxious Home Cooks (Like Me)I’d rather lie horizontal on a couch eating food I ordered off the internet. But this new recipe got me out of a rut.By Hilary CadiganJuly 25, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailI am not a person who finds cooking relaxing. I wish I was, and I’m jealous of people who are—people who come home from a long day at the office to whip up a meditative skillet of bread pudding (shout-out to my roommate, Mandi, who actually did this recently)—but for me, relaxing means being horizontal on a soft surface eating food I ordered off the internet.Working at a food magazine, however, means cooking is now part of my job. Also, I really like to eat. So I’m determined to change. And lucky for me, the theme of this month’s Bon Appetit is simplicity, meaning it’s packed with recipes that are doable for even yours truly. And one of those recipes is peanut rice noodles with pork and collard greens—which sounds like something I’d immediately click + order for my horizontal couch dinner. But this time, I vowed to make it myself.The ingredients found in this dish are #blessedly few: soy sauce, sugar, rice vinegar, ground pork, red pepper flakes, peanut butter (the recipe calls for smooth but I’m sure crunchy would work fine). I opted for the pre-cut, pre-washed collard greens that come in a bag because I enjoy using my anxiety as an excuse to do less. I had a minor freakout when I couldn’t find flat rice noodles at my local grocery store (WHY!?!) but kept it on the inside and settled for spaghetti-shaped ones instead. Comme ci, comme ça.After a stressful day that maybe concluded with a short silent cry on the subway, I arrived home expecting to find a few roommates willing to help with things I hate, like chopping. But alas, the apartment was empty but for my two cats and the several dozen fleas we recently learned they are harboring. Things are going really well in my life, thanks for asking. So I popped on a Yo La Tengo record for feeling-melodramatic-in-solitude purposes, and set some water on to boil, prepared for the inevitable waves of panic that roll in every time I’m in front of a stove.But as I read step by step through the recipe, a funny thing happened. That panic never came.Whisk together water and peanut butter and rice vinegar and soy sauce and sugar and crushed red pepper flakes. Easy enough. Cook ground pork in a skillet. Okay. Add chopped ginger and garlic. Sure. Add collard greens (the more the merrier; they shrink up fast). Cool. Toss in sauce and noodles and simmer until thickened and coated. Check, check, check, and...boom! You’re done.Fact is, this dish is stupid-easy to make. The prep work takes no longer than water takes to boil, and the noodles go from dry to al dente in four minutes flat (follow these hot tips to make sure they don’t stick together; I didn’t and mine did). Rice noodles, it turns out, are the ideal late-summer pantry staple for those of us who start sweating a little when presented with ingredient lists. They’re light, fluffy, and the perfect vehicles for getting sauce into your mouth really fast. Plus, you can order them in bulk online so you don’t have to use whatever spaghetti-shaped BS your local grocery store sees fit to throw at you.Oh, and the pay-off is real: a gooey golden tangle flecked with fragrant crumbles of pork and bright green ribbons of collards. The pork soaks up all that garlicky, gingery twang until it acquires an almost sausage-like kick; the greens add a hint of healthy freshness; the noods are chewy and satisfying; and the peanut sauce sits atop it all like a big creamy hug.Like Xanax, in noodle form. But better, because I made it with my own two hands. And nary a Postmate in sight.Get the recipe:Peanut Rice Noodles with Pork and Collard GreensThis one goes out to all the peanut sauce fans out there.View RecipeAnother weeknight use for rice noodles:Explore Bon AppétitRice NoodlesWeeknightSummerPeanutPorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Hilary Cadigan"]}