{"id": "7503c8b10ad4a6286097a9f8fc596b8c", "url": "https://www.bonappetit.com/recipe/smashed-chickpea-toast-with-harissa-yogurt", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Smashed Chickpeas on Toast with Harissa Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSmashed Chickpeas on Toast with Harissa YogurtBy Molly BazMay 23, 20184.9(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintBright and herby smashed chickpeas get spooned on garlicky toast that’s been smoothed with harissa yogurt to make the perfect vegetarian tartine.Ingredients4 servings1large shallot, finely chopped1tsp. finely grated lemon zest¼cup fresh lemon juice2small garlic cloves, divided215.5-oz. cans chickpeas, rinsed2celery stalks, finely chopped, plus tender celery heart leaves for serving½cup chopped cilantro, plus sprigs for serving1Tbsp. finely chopped peperoncini, plus more thinly sliced for serving¼cup extra-virgin olive oil, plus more for drizzlingKosher salt4slices country-style bread, toasted1cup plain whole-milk Greek yogurt4tsp. harissa pasteFreshly ground black pepperPreparationStep 1Combine shallot, lemon zest, and lemon juice in a large bowl. Finely grate 1 garlic clove into bowl, then toss to combine. Let sit 5 minutes.Step 2Add chickpeas to shallot mixture and smash with a potato masher or wooden spoon until some of the chickpeas are broken into smaller pieces. Add chopped celery, chopped cilantro, finely chopped peperoncini, and ¼ cup oil and toss to combine; season with salt.Step 3Rub one side of toasts with remaining garlic clove; drizzle with oil and season with salt. Spread yogurt over and spoon 1 tsp. harissa on top of each. Using a small spoon, swirl harissa into yogurt to incorporate slightly and marble.Step 4Divide chickpea mixture among toasts (you may have some leftover depending on the size of your bread). Top with celery leaves, cilantro sprigs, and sliced peperoncini. Drizzle with more oil; season with salt and pepper.How would you rate Smashed Chickpeas on Toast with Harissa Yogurt?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleLoved it completely as is. I agree with the reviewer below, not quite balanced without the toast part. If you’re anti bread maybe dress some greens in the toast toppings and find a crunchy component to add. New staple recipe for me!AnonymousOR6/25/2021Wow this is good! I ate it for three meals this week and already want to make it again. The salad is good by itself, but the harissa yogurt on toast really makes the dish. I subbed in parsley for cilantro because I didnt have any, and used giardiniera instead of peperoncini. Easy to make, so fresh and flavorful. HMichigan4/15/2021So fresh and easy to make. I make the chuckle salad weekly now without the toast and just eat it plain as a nice healthy prepped snack / lunch salad! Love itAnna wardSan Clemente CA3/5/2021I made just the smashed chick pea salad to put on top of my green salad - and while delicious is was way too lemony, perhaps needing the toast and yogurt to balance it. I’ll do it again on salad with less lemon or maybe with red wine vinegar instead, and also try the full dish. Yum!Lisa NJ11/11/2020this is great for anyone who wants to eat something cold and savory on a hot day in the summer. its quick, fresh, and filling! I think I added too much shallot so be cautious because your breath might be smelly..AnonymousPalo Alto, CA5/26/2020Great vegetarian pantry sandwich that still delivers some zing.ssfarionPhiladelphia, PA5/14/2020Quite satisfying, and would be easy to make substitutions based on what herbs/dairy/crunchy veg you have.AnonymousCalifornia5/9/2020Yeah this is perfect, so f'kin good 👌🏼mst1228Minneapolis, MN4/7/2020This was fantastic. I had my doubts about a smashed chickpea sandwich filling. But with the addition of celery, picked veg, and shallots... much like you would use in tuna salad, DELICIOUS! Also, the yogurt harissa spread is genius. Such a delicious sandwich/toast topper.  Anonymous902913/23/2020DELISH! super tasty and fresh recipe perfect for the hotter days. the lemon, garlic, celery and shallot add a nice bright freshness to the recipe. i might even throw in some chopped up capers the next time round. becuase there is quite alot of liquid from the veg going around in this recipe, i feel like this dish can take on quite a hefty amount of salt and pepper to get it to the right seasoning. my friend who hates celery was pleasantly surprised at what it brings to this dish. none of that bitterness, and a whole lot of freshness! niccsuxSingapore1/19/2020Delicious and versatile recipe! AnonymousWisconsin11/19/2019This recipe is really delicious! I tried it with and without rubbing garlic on the toast, and I think without is nicer. The taste of raw garlic was a bit overpowering. A really lovely vegetarian lunch ideaemylouParis6/13/2019Fantastic!   I used great white northern beans instead of chickpeas.   Better than avocado toast in my opinion - flavors were complex and fresh without being overpowering.   Definitely will have this regularly in the fridge - I served it for breakfast, but could be for any meal.AnonymousGreenwood, Virginia, United States2/24/2019I used home-cooked chickpeas instead of canned. The chickpea mixture smells and tastes so fresh. It also keeps nicely, so you can definitely make a batch of this early in the week and come back to it for a lunch or snack whenever.AnonymousMinneapolis, MN6/7/2018Explore Bon AppétitToastNorth AfricanAfricanChickpeaBeanVegetableHarissaCondiments, Sauces & PastesYogurtOther IngredientsQuickEasySnackStarterNut-FreeVegetarianHealthyishRamadanLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-23", "author": ["Condé Nast", "Molly Baz"]}