{"id": "750d3f76b7d945d6a7f87d8193c9a92b", "url": "https://www.bonappetit.com/story/basu-ratnam-inday", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "INDAY Founder Basu Ratnam Gets Through the Day With Breathing Exercises and Coconut Cold Brew | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureINDAY Founder Basu Ratnam on Designing an Ayurvedic Menu and His Favorite Post-Workout DrinkFrom morning meditation to an afternoon roti, here's how Ratnam gets through the day.By Ali FrancisJuly 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailBasu Ratnam tends to skip breakfast in favor of coffee or reishi tea doctored up with some MCT oil, grass-fed ghee, and turmeric shavings. He wakes up early, around 6:30 am, to sneak in some breathing exercises (right now, it’s the Wim Hof method) and a quick sesh at the gym. Oh, AND a morning meditation with his team before their hectic days begin.Ratnam is the CEO of INDAY—a group of three Indian-inspired, fast-casual restaurants in New York City. His work days are, well, intense: running the restaurants, building the business, sussing out new markets, and haggling for more retail space. (It’s okay, weekends are more like tennis, reading, and eating.) We meet for pita at Dez—a new mezze-heavy Middle Eastern spot in Soho from Eden Grinshpan and Sam Wasser. Ratnam wears dark blue khakis with a denim button-up, and is clearly right at home in the colorful, Marrakech-inspired space. It almost feels like we’re on holiday, and I can’t help but think, “This dude is so freaking chill.” It’s an adjective rarely synonymous with restaurateurs. But, for Ratnam, meditation and yoga were introduced at an early age. His mother, a psychology professor, wrote a book called, Spirit Versus Scalpel: Traditional Healing and Modern Psychotherapy. “She thought seriously about holistic health and wellness earlier on than most people,” Ratnam says.INDAY's Cauli'fornia bowl features cauliflower rice and baked falafel with supergreens, tamarind chutney, garlic hummus, and pomegranate seeds.\nPhoto by Chelsie CraigYou’ll find this intention extended to INDAY’s refreshing menu, which is rooted in the ancient Indian medical system of Ayurveda. INDAY’s food is gluten, raw dairy, soy, and refined sugar free. “We try to avoid foods that cause inflammation or irritation, and cook everything from scratch,” Ratnam says. In the summer, you’ll find tons of cooling herbs and hydrating vegetables. In the fall and winter, it’s warming spices and immunity boosters like turmeric and ginger. “We focus a lot on the season: not just what’s coming out of the ground, but also what your body needs in relation to the environmental conditions.”INDAY is a word Ratnam invented to reflect growing up Indian-American in a “pretty white community.” “It means India all day,” he explains. “India is a part of me but not all of me. And that’s really the foundation at INDAY.” Both of Ratnam’s parents were born and raised in India, but because they’re from different parts of the country (with very different cuisines and languages), western food became the common denominator at home. “They couldn’t quite agree on the cuisine, so we ate a lot of Americanized stuff, since that’s what me and my sister wanted,” he explains. “It was interesting to grow up that way because I was always self-conscious hanging out with other Indian-Americans. It felt like I was a mixed-race kid, neither here nor there.” For Ratnam, INDAY has been as much a path of cultural re-discovery as it has a thriving business venture.Ratnam’s lunch usually happens in one of the three locations. If he’s at the location in NoMad, he’ll opt for their take on New York's classic street meat: Chicken and rice (organic long-grain basmati, antibiotic free grilled tandoori chicken, cucumber and tomato salad, homemade hot sauce, and coconut tahini). In Midtown, it’s chicken curry over cauliflower rice. “We’ve been working on this curry recipe for three years,” Ratnam says. “It’s savory, sweet, umami, and spicy all at once, and there’s no oil or dairy so it’s super light and refreshing.” If he’s uptown, he’ll grab a roti to go. “It’s styled after a traditional kati roll, except we make our homemade bread out of coconut flour, chia seeds, organic masa, and coconut oil.” Ratnam’s filling of choice: Braised lamb with avocado. If he’s not at INDAY for lunch, he loves abcV, Fairfax, Breads Bakery (“I love the tuna salad!”), Sweetgreen, and Kazunori (light on the rice).In the afternoon, Ratnam will reset his focus with some deep, diaphragmatic breathing. “I do it whenever I find myself getting distracted,” he says. \"Taking full breaths that fill the belly have been shown to cleanse the body, improve digestion, and lower stress hormones. Just a few minutes of this each morning, night, during a workout, or anywhere you can remember will work to keep the body in its slightly alkaline state.” Speaking of working out, Ratnam does yoga or high-intensity interval training five or six days a week. After, he’ll revive with INDAY’s coconut cold brew: a combination of Nam Hom coconut water from Western Thailand and a custom low-acid coffee from Birch.Given the hours he works, dinners are not often home-cooked. For better or worse, INDAY is an extension of his life. “It’s a reflection of everything I believe in, so it kind of goes with me wherever I go,” he says. “But I do need better phone etiquette,” he admits, as we finish the last bites of our cauliflower pitas before parting ways. “I’m trying to learn to be more present.”Can’t make it to INDAY? Give this chicken curry a whirl.Quick Tomato Chicken CurryThe honey lends a sweet, caramelize-y twist to this quick curry, but if you want to up the heat, add a big pinch of cayenne pepper. Have some thick, crusty bread handy to scoop up all the extra sauce, or serve alongside a pile of rice for a low-maintenance comfort food dinner.View RecipeExplore Bon AppétitHealthyishIndianNew YorkNew York CityprofileRead Morerestaurants13 Places to Eat Healthyish in NYCGallery13 SlidesBy Molly Young and The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Ali Francis", "The Healthyish Team"]}