{"id": "751702a0a0ece100485df30c55267137", "url": "https://www.bonappetit.com/story/christina-lecki", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Christina Lecki On Leaving Reynard and What She's Doing Next | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleChristina Lecki On Leaving Reynard and What She's Doing NextLecki is trying to get to the root of who she is and where she wants to be.By Priya KrishnaMay 3, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAt the beginning of this year, Christina Lecki announced that she had left Reynard, the Williamsburg restaurant she helped to transform into an acclaimed destination for sustainable wood-fired cooking. Here, she talks about the personal journey she went on followed her departure, and why she’s not in a hurry to find a new job just yet.When I took the job as executive chef at Reynard, it was paramount for me to prioritize wellness. And I think I did okay. I joined a gym close to work. I ate breakfast every day. I tried to create an open dialogue with my staff about mental health.But toward the end of my tenure at Reynard, I was getting depressed. I was feeling listless and unaccomplished — some of the really high bars I set for myself, like those sustainability goals, I wasn’t achieving as quickly as I hoped. When Andrew [Tarlow, the restaurateur who formerly oversaw Reynard] left, I felt like I didn’t have a partner there anymore. So I decided to leave the job right before the new year so I could start 2019 on a clean slate.I wanted to prioritize who I was as a person—to carve out space so that I could reaffirm who I was besides just a chef. Careers are so all-consuming, and you find yourself being this one-dimensional person. I decided to go to Oaxaca, Mexico for three weeks to work on creative stuff that had nothing to do with my previous job.I joined a residency called Pocoapoco. Anyone can apply to go—there was a ceramicist, a photographer, an architect, and me. And you just have space to do what you want to do, and the resources of Oaxaca to help with that. I did a lot of natural dyeing (I studied fashion before becoming a chef), making napkins and table runners out of locally sourced indigo. I did sculpture with bread, and then toward the end I cooked this big healthy dinner for the community: I made bone broth, snapper ceviche with passionfruit, and an eight-hour smoked chicken cooked over the fire.That dinner was a big highlight. Without the burden of a restaurant, I could be a more pure version of myself. There weren’t the confines of service or making money. It wasn’t for profit. It was just an expression of myself—which, for me, was life-changing. I felt energized and re-charged.I have definitely felt subconsciously unhappy with my weight, too. I was always trying to radiate positivity to my staff, and once I didn’t have my staff to think about I started to pull out of my brain the other things I was thinking and feeling. I decided to go on a diet. Since I left Mexico, I am not drinking or eating sugar or dairy. I have never in my entire life disciplined myself in this way, and I mostly just want to see how I feel. It’s been three weeks, and I feel very good and very strong. I feel less sore and depleted.These days, I wake up and meditate for 30 minutes—I’m not great at it, but I’m getting better. I’m trying to stay away from my computer and cell phone more. I try to get good sleep. I’ll jog in the park before sundown and go to the gym and do interval training. I’m gathering with friends for dinner.I am also trying to get to the root of who I am and where I should be, and piece together what my future looks like without freaking out. New York is so go go go—you’re all in, you’re always on. And I love that manic, crazy, intense way New York makes you. But for the first time, I don’t have a plan, besides to take care of myself. That’s obviously very hard; we are in a city of overachievers. The biggest challenge is not freaking out and trusting myself.I know that I want my next move to be in the restaurant industry. Cooking is my joy. It’s the thing I am best at. But I want to be more than just a chef. I want to figure out how I can help the community around me and have other artistic endeavors.I’m currently working on writing down everything that I value. The next step is creating a plan for what a business would look like that fits into those values. I understand that having a business in New York while also maintaining life balance and giving your staff decent hours while also making money is really hard. I want to believe that it’s possible—that you can have a meaningful business that doesn’t shut down possibilities for other things.But first I need to believe in myself again.Explore Bon AppétitHealthyishChefsNew York CityRead MoreLifestyleHow Jessica Largey Battled Anxiety and Self-Doubt Before Opening SimoneBy Jessica LargeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Priya Krishna"]}