{"id": "7519a7897328b9ae97737a0b047624a0", "url": "https://www.bonappetit.com/recipe/crispy-chicken-with-zaatar-olive-rice", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Crispy Chicken With Za’atar-Olive Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueCrispy Chicken With Za’atar-Olive RiceBy Kendra VaculinMarch 15, 20224.0(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Dayna SemanEmailPinterestPrintEmailPinterestPrintNot only is ground chicken or turkey a fast-cooking weeknight superstar, but the fat leftover from crisping it up can get work done. Case in point, this low-lift one-pan dish. The leftover fat is used to blister olives that then get mixed with cooked rice (or any other cooked grain you’ve got) and chopped greens like spinach, kale, or chard. Za’atar provides another layer of flavor. Be sure to check the ingredient list on your blend and season accordingly—if it includes salt, you might not need to add any extra.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonWooden Spoon$6 At AmazonSlotted Spoon$13 $10 At AmazonIngredients4 servings1lb. ground chicken or turkey½tsp. smoked paprika1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepper3Tbsp. extra-virgin olive oil1cup Castelvetrano olives, smashed, pits removed3cups cooked rice1Tbsp. za’atar, plus more for serving2cups coarsely chopped greens (such as spinach, kale, or chard)Zest and juice of 1 small lemon2oz. feta, thinly sliced into planksCoarsely chopped dill (for serving)PreparationStep 1Place chicken in a medium bowl. Sprinkle paprika and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt over chicken; season with pepper. Gently mix with your hands to combine.Step 2Heat oil in a large nonstick skillet over medium-high. Arrange chicken in pan in a thin, even layer and cook, undisturbed, until golden brown and crisp underneath, about 5 minutes. Continue to cook, stirring and breaking up into bite-size pieces with a wooden spoon, until cooked through, about 1 minute. Using a slotted spoon, transfer chicken to a plate, leaving oil and fat behind.Step 3Add olives to same pan and cook, undisturbed, until heated through and blistered, 1–2 minutes. Add rice and 1 Tbsp. za’atar and cook, stirring often, until slightly crisp, about 3 minutes. Add greens and lemon juice and cook, stirring occasionally, until greens are wilted, about 2 minutes. Remove pan from heat; stir in lemon zest, feta, and chicken. Taste and season with more salt and pepper if needed.Step 4Transfer chicken and rice to a large shallow bowl; sprinkle with more za’atar and top with dill.How would you rate Crispy Chicken With Za’atar-Olive Rice?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleSeemed a bit dry...we found it it dry and not all that much flavor....disappointedCBICKSTERAustin, TX3/26/2022I made this last night for dinner, but added a chopped onion, which I sautéed until it caramelized. I thought he really lacked the onion.  The result was delicious!Carol BMenlo Park, CA3/24/2022This was great! I used a wok and it worked really well. Great for a weeknight dinner with leftovers for lunch.AJNashville, TN3/22/2022I really enjoyed this as a lunch for a few days. I used tofu instead of chicken (torn up firm tofu with cornstarch, olive oil, and paprika baked in a 400 oven for about 35min). Added red pepper flakes also. For olive-averse people, castleveltranos are quite different from the typical Spanish green olives, really urge you to try them if you haven’t before!JuliePhiladelphia, PA3/21/2022How is this without olives?  Outside of a martini, I really don't care for them, but the rest of the dish sounds good!Drew HOith3/21/2022Excellent Dish - Flavorful, Easy-to-Make\n\nThis dish came together very well!  I loved the strategy of arranging the turkey \"in pan in a thin, even layer and cook, undisturbed.\" That seemed to keep enough liquid / moisture to bring everything together. You might like a wok-sized pan to finally bring everything together, but a terrific dish that will be a go-to in our home. Drew C.Fairfield, CT3/21/2022The flavors in this dish are amazing, but I had a hard time getting the rice crispy due to the sheer volume of ingredients in the pan (who has a non stick that big?). Next time I will do the rice by itself in a separate pan (or maybe do the whole thing in the wok?) and combine at the end. The dill on top is a great touch, really brings the freshness out, and as someone who can make 30-40 olives be dinner, it's great to use them IN something. This is going in the rotation for sure.chelsearichmond, va3/18/2022Very dry. There’s no liquid in this recipe!  Maybe some chicken broth would help. AnonymousAmarillo, TX3/18/2022Explore Bon AppétitMainDinnerQuickOne-Pot MealsEasyWeeknight MealsHealthyishGluten-FreeNut-FreeGround ChickenChickenPoultryGround TurkeyTurkeyFetaCheeseOliveOther IngredientsRiceRice & GrainsZa'atarHerbs & SpicesSpinachLeafy GreensVegetableKaleSautéSwiss ChardCastelvetrano OliveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Kendra Vaculin"]}