{"id": "751bf40c8dabe38117921630883eef01", "url": "https://www.bonappetit.com/recipe/radicchio-with-hot-honey-vinaigrette-and-cotija", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Radicchio With Hot Honey Vinaigrette and Cotija Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueRadicchio With Hot Honey Vinaigrette and CotijaBy Chris MoroccoJanuary 4, 20224.8(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Pearl Jones, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintThis salad gets a little more heft thanks to toasted hazelnuts and quinoa. Package directions for cooking quinoa can vary across brands, so for the ultimate chewy-tender texture, we prefer to simply boil it like pasta in salted water, then drain and let it sit, covered, in the pot to steam out any excess liquid. It’s worth seeking out black or red quinoa, which have an extra-firm bite.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketLarge Saucepan$60 At AmazonWhisk$10 At AmazonMesh Sieve$13 At AmazonIngredients½cup blanched hazelnuts¾cup red or black quinoa, rinsedKosher salt2Tbsp. honey2tsp. mild red pepper flakes (such as Aleppo-style or gochugaru) or 1 tsp. crushed red pepper flakes1tsp. crushed chipotle chile flakes or crushed red pepper flakes4Tbsp. extra-virgin olive oil3Tbsp. unseasoned rice vinegar1large head of radicchio, leaves separated, torn if large½cup crumbled Cotija cheeseCilantro leaves with tender stems (for serving)PreparationStep 1Preheat oven to 350°. Toast hazelnuts in a single layer on a small rimmed baking sheet, tossing halfway through, until golden brown and fragrant, 7–10 minutes. Let cool, then coarsely chop.Step 2Meanwhile, place quinoa in a large saucepan and pour in water to cover by at least 4\"; season generously with salt. Bring to a boil, then reduce heat to maintain an active simmer, and cook until quinoa is just tender, 12–15 minutes. Drain and return to pot. Cover and let sit 10 minutes.Step 3Bring honey, mild red pepper flakes, chile flakes, and 1 Tbsp. water  to a simmer in a small saucepan over medium heat. Stir, then let cool 5 minutes. Whisk oil and vinegar into honey mixture; season dressing with salt.Step 4Combine radicchio and quinoa in a large bowl. Drizzle half of dressing over and toss to coat. Taste and season with more salt if needed (don’t forget the Cotija will add some salt too). Drizzle with more dressing and top with hazelnuts, Cotija, and some cilantro.How would you rate Radicchio With Hot Honey Vinaigrette and Cotija?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleAny substitutions for the quinoa? The recipe looks amazing, but my stomach is too sensitive for quinoa. Anonymous1/27/2022Dynamic AND Compelling! Chris Morocco has done it again! Another reviewer mentioned serving this salad with a knife - I'll counter that by saying you should leave the leaves large, put the quinoa, nuts, and cheese in the middle and eat this salad with your HANDS like little boats. Truly SO good. Bravo!Nicholas GrayGrand Rapids, MI1/23/2022Stunningly good combination. The quinoa and honey cut right through the radicchio's bitterness. If you don't tear up most of the leaves before tossing, serve with a knife.chrispbaconBrooklyn, NY1/17/2022Explore Bon AppétitDinnerWeeknightQuickEasyRadicchioChicoryLeafy GreensVegetableCotijaCheeseQuinoaRice & GrainsWinterSideHazelnutNutVegetarianGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Chris Morocco"]}