{"id": "751c435a7c4033337adffdfa3b67e2da", "url": "https://www.bonappetit.com/recipe/chile-honey-glazed-fries", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Air Fryer Chile-Honey-Glazed Fries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAir Fryer Chile-Honey-Glazed FriesBy Shilpa UskokovicOctober 19, 20215.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintFreezer-aisle fries like you’ve never had before! Tossed in a sticky, spicy honey glaze, these are the perfect exemplar of that very specific and beloved texture: crispy-gone-soggy. This recipe is based on a similar dish that often appears in many Indian Chinese restaurants known as honey chili potatoes. Use crinkle-cut fries, waffle fries, tater tots, or even fries from your favorite take-out place if you’d like. Just make sure to warm the fries through in the oven before tossing them in the sauce. If you want to retain some virtuousness, serve these with steamed white rice and steamed green vegetables such as broccoli, Chinese broccoli, or bok choy. —Shilpa UskokovicAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBreville Air Fryer$520 At AmazonCast Iron Skillet$30 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonIngredients4 servings16oz. frozen crinkle-cut or waffle fries or tater tots1Tbsp. Diamond Crystal or 1¾ tsp. kosher salt, plus more2scallions1Tbsp. cornstarch½cup honey¼cup Sriracha4tsp. soy sauce1Tbsp. ketchup2Tbsp. vegetable oil1small red bell pepper, cut into 1\" pieces1small white onion, cut into 1\" pieces2garlic cloves, coarsely chopped2tsp. toasted sesame seedsPreparationStep 1Cook fries in an oven or air fryer according to package directions; season lightly with salt and keep warm.Step 2Meanwhile, separate dark green tops from scallions. Thinly slice and set aside. Thinly slice remaining white and pale green parts and set aside separately.Step 3Stir cornstarch in ¼ cup water in a small bowl to dissolve. Add honey, Sriracha, soy sauce, ketchup, and 1 Tbsp. Diamond Crystal or 1¾ tsp. kosher salt and stir to combine; set sauce aside.Step 4Heat oil in a large cast-iron or nonstick skillet over high. Cook bell pepper, onion, garlic, and reserved scallion white and pale green parts, stirring often, until vegetables are slightly blistered and just starting to soften, about 3 minutes.Step 5Stir reserved sauce well (in case any cornstarch has settled at the bottom) and pour over vegetables. Cook, tossing, until sauce is thick and glossy, about 1 minute. Remove from heat, add warm fries, and stir until well coated in sauce.Step 6Transfer glazed fries to a platter or shallow bowl. Top with sesame seeds and reserved scallion greens.How would you rate Air Fryer Chile-Honey-Glazed Fries?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleso pumped to see chindian food on bon appetit! having eaten a TON of honey chilli potatoes during my childhood in india i can tell you that this recipe really hits the spot! EmilieZurich11/14/2021Tom Jones, shut da hell up AnonymousHell, OH11/3/2021I'm shocked.  Tim Jones?  Really?  I thought this wasn't a site for uppity food snobs.The Rest Of UsEverywhere10/30/2021I'm shocked. Tater tots? Really? I thought this was a site for adults.Tim Jones10/25/2021Explore Bon AppétitFrench FriesChileVegetablehoneySideDinnerLunchEasyVegetarianSrirachaPotatoBell PepperOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Shilpa Uskokovic"]}