{"id": "751d4c5908fe89479741f8a2c89e699c", "url": "https://www.bonappetit.com/story/may-horoscope-potato-chips", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Your May Horoscope Knows That What Lies Ahead Is Actually Just Potato Chips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour May Horoscope Knows That What Lies Ahead Is Actually Just Potato ChipsA potato chip horoscope for every sign of the Zodiac, because this is a food website after all.By Catherine UrbanMay 1, 2018FacebookTwitterEmailIllustrations by Taro UryuFacebookTwitterEmailWe wavered with the idea of the theme of this May’s horoscopes—how about seasonal spring produce for every sign? But then realized everyone would want to be ramps or rhubarb and it just wasn’t fair. So, uh, we went with a topic with a seemingly infinite variety of flavor and personality: potato chips! The future before you is looking salty and crunchy, according to our star charts. Now read about what else is in store this month, and find out which bag of chips is going to get you through it.Illustrations by Taro UryuAriesYour dream of becoming a superhero comes true this month. Well, almost. Maybe you don’t have a pseudonym or a stain-resistant cape, but you are kicking ass and taking names. You’re juggling a lot of high-roller responsibilities right now, but it’s helping you score credentials and influence at work. And you deserve it. You have a lot of practice after all, and now people suddenly want to learn from you (shouldn’t be that big of a surprise!). Nacho cheese Doritos are the snack for you—a perfectly cultivated cheesy, tangy flavor that makes them the most popular at the lunch table, and like you, we can’t get enough of em! They’re a solid reminder that no matter how accomplished you may feel, you should still lick all the orange dust off your fingers.Illustrations by Taro UryuTaurusCan you feel it? Something exciting may be coming your way this month, Taurus, and no, it’s not the surprise party your pals are definitely probably planning for you. Normally, surprises aren’t your thing. But you’re feeling more spontaneous and outgoing than usual and you’re willing to spin the wheel of chance. And while you may be facing some big life decisions (do I actually want that sacred geometry tattoo?), there will be no questions when it comes to your snack attack. Munch on jalapeño kettle chips until your mouth is pleasantly on fire; that’s the kind of thrill-seeking we’re talking about.GeminiAfter a long winter, your usual swag is back and more charming than ever. A sharp yet laid-back wit makes you the master of banter. Skip the giant parties for now and circle up with a smaller group for a book club, an intimate dinner—something that will foster a deeper conversation or debate. As social as you might be, May tends to be a reflective time of year for you, Gemini. Find somewhere to escape the noise and be with your own thoughts, maybe a hike on a trail you’ve heard so much about. Bring a bag of BBQ chips with you so you don’t get hangry on the hike (and so you can bribe a squirrel to be your friend). Like you’re, they’re a little spicy, a little sweet, and they’re just the crunchy thing to silence the chatter of your mind for a brief moment.Illustrations by Taro UryuCancerHang back this month and get your chill on. No need to hustle; coast at a pace that feels right for you. You are good at doing what you feel, so you’re already halfway there. Try not to take on anything extra so that you can use your free time to follow your intuitive whims. Intuitive whims may include: skipping work to hit a museum, or skipping work to hit the high score on Mario Kart—you see the theme here. You’ll find that luck works its way into your world when you go with the flow. Keep things cool with sour cream and onion Ruffles. Tangy, salty, oniony and a tad sweet, this snack hits every note (we know how picky you are). And as you like it, the chip dip is optional.Illustrations by Taro UryuLeoYour career is a major focus for you this month, and while things may be going well, you still entertain the idea of quitting, joining the festival train, or seeing what the expat life is like in Paris. And while you may ultimately decide to stick with your cushy retirement plans, you still have some options concerning your professional focus. To venture in a new career direction  or not? Practice putting yourself out there by braving the karaoke bar with your friends at 2:30 a.m. Stave off a hangover with a happy bag of Funyuns because you’re obviously the most fun (duh), and your Uber driver (probably?) won’t care about your onion breath.Illustrations by Taro UryuVirgoDeep in thought and staring blankly into space, you wonder how you ended up at a work conference in Palm Springs of all places, when pool time isn’t anywhere on the itinerary? “And why did I even both packing shorts when the AC is set to 60⁰?” We can always count on you to pick up on these important details, attentive Virgo. And truthfully, work is going really well for you. But you realize it’s time to burn though some of those racked-up vacation days, in a place you actually want to be. Buy those plane tickets, and in the meantime, hold yourself over with Sun Chips. Like an early spring spray tan, there’s no actual sun involved here, but you delight in a wannabe healthy snack (do I detect notes of Garden Salsa?!), with a wavy texture that will remind you of the beach in your future.Illustrations by Taro UryuLibraEveryone knows you as the tactful one. “That Libra, so nice, so sweet, there really is good in this world...” Like sugar, you are usually refined, but this month, you’ll be in the raw – throwing people through the loop as your true feelings come out unfiltered. Your closest friends know and love this side of you, with your rare dark humor and depreciating societal commentary. You know it’s impossible to be sweet all the time (which weirdly comes as a shock to people?). And TBH, it feels damn good. That’s why you’ll be enjoying the heck out of those yummy salt and vinegar chips! Salty and tangy without a hint of remorse. Wash ‘em down with a crisp saison and let the cackling continue throughout the weekend.Illustrations by Taro UryuScorpioYou say the word “Scorpio” and people nervously recoil. Why? You are a freaking powerhouse capable of anything you put your mind to. And this month, people actually have good reason to get out of your way because you are especially focused right now. You usually keep your thoughts and feelings to yourself, but this month you’re full of big ideas and you need to talk them out. Another big focus for you this month is partnership—ahem, partnership. Grab some tortilla chips and attack the guacamole with your favorite human. And like you, these chips are able to go to extremes, so be sure to layer them excessively with toppings when that nacho craving sets in.Illustrations by Taro UryuSagittariusGive yourself plenty of space this month, both in your schedule and in your physical radius. You need freedom to sprawl out, but lately you’ve also been trying to figure out how to live a more balanced and healthy life. That is, going with what feels best to you in all aspects of life. Tired, you contemplate “do I feel like grocery shopping on Friday night?” Deciding that it’s not the healthiest thing for your spirit, you duck into the corner store and settle on a big bag of Terra chips. Because they’re vegetables, right? Beets, sweet potato, potato...seems balanced enough. Like you, these chips are smart, colorful, and always on the shelf in times of need so that you can keep your flow no matter what life throws at you.Illustrations by Taro UryuCapricornFeeling more pensive and chill lately, you might not be especially enthused about all the graduation and Memorial Day parties around the corner this month. But once you get out and have your first beer, you’re glad to be in the sunshine with people you haven’t seen all winter. Who knows, you might even make a valuable connection with someone who finally explains why and when you should buy Bitcoin; or if you are single, romantic sparks could fly when you meet someone new. No Memorial Day cookout is complete without classic Lay’s potato chips. Nostalgic yet never stale, these no-nonsense chips are always welcome at the party (the party of life), which is how we feel about you, Capricorn.AquariusWith all that’s up in the air right now, you can’t help but feel a bit anxious this month. You might be thinking about moving or making a considerable change at home (wallpaper is a huge commitment, after all). You feel steady when you’re in control, so find stability through your creative outlets (spray paint anyone?). But make time to switch up your normal routine to keep your mind stimulated. See what happens when you make a PB&J with Fritos layered in the middle? Wizardry. That’s what you get. An out-of-this-world extra crunchy spin on a classic with everyone’s favorite corn chip. That’s why we need your ingenuity, Aquarius.Illustrations by Taro UryuPiscesFilm Festival season has begun and you’re squeezing as many flicks into your schedule as humanly possible. A social activity that doesn’t require too much talking? Right up your alley. Awed and inspired, you wonder if you could have what it takes to make a documentary. Of course you do, but you settle on embellishing your Instagram story first. You’re buzzing with creativity this month so you’ll need a snack as hot as your ideas.  Get your hands on a bag of Flamin’ Hot Cheetos, as bold as you, and, judging by the glitter paint all over your crafting table, you won’t mind the red specks of Cheeto powder everywhere.Catherine Urban is a writer, astrologer, and chip lover… especially Sun Chips. Check out more of her work here.Related: Regional Potato Chips You’ve Never Heard Of, But Need to TryExplore Bon AppétitFood HoroscopesSnackChipsRead MorecultureYour April Horoscope, Now with 100% More PizzaBy Catherine UrbancultureMarch Horoscope Time: What's Your Egg Sign?By Catherine UrbancultureRead Your February Doughnut Horoscopes and Then Make Them Come TrueBy Catherine UrbancultureYour January Horoscope: Dumplings and PredictionsBy Catherine UrbanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Catherine Urban"]}