{"id": "752db52ef7e5a79a7743580b2350a593", "url": "https://www.bonappetit.com/recipe/mozzarella-fritters", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Mozzarella Fritters With Pesto and Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMozzarella Fritters With Pesto and GreensBy Ozoz SokohAugust 8, 20214.3(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintBefore you fry these little packages of joy, everything—salad, sides, fellow diners—should be at the table and ready to feast. Like carbonara not eaten immediately or risotto that sits for more than a few moments, the essence of this dish fades just as quickly as it comes together. These crispy-creamy fritters shine with all kinds of accoutrements, from your favorite pesto and leafy greens to fresh or sun-dried tomatoes and some warm ciabatta.—Ozoz Sokoh, recipe developerAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronTongs$13 At AmazonMedium Skillet$60 At AmazonCitrus Juicer$7 At AmazonMedium Bowl$17 At AmazonWhisk$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings ½cup all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1tsp. freshly ground black pepper, plus more2large eggs2cups panko or coarse dried breadcrumbs10oz. spring greens salad mix or other mixed greens6Tbsp. extra-virgin olive oil, divided2lemons, divided8oz. fresh mozzarellaStore-bought pesto (for serving)Ciabatta or other crusty bread (for serving; optional)PreparationStep 1Whisk ½ cup all-purpose flour, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 1 tsp. freshly ground black pepper in a medium bowl to combine. Place 2 large eggs in a shallow bowl and beat lightly to blend. Place 2 cups panko or coarse dried breadcrumbs in another shallow bowl.Step 2Place 10 oz. spring greens salad mix or other mixed greens in a large bowl and evenly drizzle 2 Tbsp. extra-virgin olive oil over. Cut 1 lemon in half and squeeze juice over greens. Toss to coat, then season salad with salt and pepper.Step 3Cut 8 oz. fresh mozzarella into eight ½\"-thick slices. Working with 1 slice at a time, dredge mozzarella in seasoned flour, shaking off excess, then dip in eggs, letting excess drip back into bowl. Dredge in seasoned flour and dip in eggs a second time. Coat in panko, pressing gently to adhere before shaking off excess. Transfer coated mozzarella to a plate as you go.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Heat remaining 4 Tbsp. extra-virgin olive oil in a medium skillet over medium. Working in 2 batches, carefully place mozzarella slices in pan and cook, turning halfway through, until golden brown, 5–7 minutes total. Using tongs, carefully transfer mozzarella fritters to paper towels to drain.Step 5Mound salad into shallow bowls or on small plates. Arrange mozzarella fritters on top. Cut remaining 1 lemon into wedges. Serve fritters with store-bought pesto, ciabatta or other crusty bread (if using), and lemon wedges for squeezing over.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Mozzarella Fritters With Pesto and Greens?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThese should be made illegal!!! Tried these out yesterday and I single handedly devoured these and could have done with more. Great recipe, and would definitely make as entrees. Thanks for sharing!JeanneVictoria, Australia8/28/2021So delicious! It does need plenty of salt in the flour as mozzarella is so mild - so don't skimp. Added a big handful of tomatoes from the garden to make it a bit more voluminous for supper. AJLondon, UK8/26/2021They are easy and great. Fun to serve as a quick appetizer. I tried air frying it too, and it worked well that way. I will try a vegan cheese next time to see how that pans out. Mix some spices and herbs in the panko and jazz it up a bit for different flavors.  India B.Greensboro, NC8/11/2021I made this one as soon as I saw it in BA. It turned out wonderful and was totally satisfying.  David MMill Valley, CA8/10/2021I  intend to make this tomorrow night...so easy!!!AnonymousNew Jersey 8/10/2021Delicious, easy and quick.  Makes dinner for myself & my husband. I like to add chopped fresh basil for garnish.  I think combinations of herbs or nothing else is fine as there is pesto.  Pesto is salty, that's why fresh herbs , balsamic & olive oil to dip bread.  Folks can be creative.Steff C.Seattle8/9/2021Instead of pesto, I think this recipe would be much better with a homemade Marinara sauce.PeterIllinois8/8/2021Explore Bon AppétitFritterSaladLeafy GreensVegetableMozzarellaCheeseQuickEasySideStarterVegetarianFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-08", "author": ["Condé Nast", "Ozoz Sokoh"]}