{"id": "752ef4244868d64b62d61b98abee684e", "url": "https://www.bonappetit.com/story/double-boiler", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "How to Make a Double Boiler With a Pot and a Bowl  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Your Own Double Boiler There are lots of kitchen tools we encourage you to buy—this isn't one of them.By Emma WartzmanMarch 9, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.My mom—who is, for the record, an excellent baker—always kept a double boiler in our kitchen. As her official sous chef, I would watch her take out the set of nearly identical pots, one stacked and locked in perfectly on top of the other one like a double decker bus, and know that we were about to make brownies (hold the nuts). When we were kids, her go-to recipe involved melting together butter and chocolate.No shade to my mom, but that the double boiler is a tool that I now know to be as totally and completely unnecessary as buying a nine piece knife set (you really only need three) or an avocado slicer (all that’s required to get the job done is a sharp knife and a spoon).It's not that the function of the double boiler is unnecessary—it's essential whenever you're warming up temperature-sensitive ingredients that require gentle, indirect heat (chocolate is a prime example). It's just that it's simple to assemble your own with equipment that you already own (or most certainly should own). Why invest in a double boiler when you can DIY one with a medium-sized pot and a heatproof metal or glass mixing bowl?To do it, simply bring an inch or two of water to a simmer—a boil is not necessary here because you’re going for gentle heat—and then place the bowl with your ingredients inside over top. You want it to fit snugly without touching the water (if it dips into the water, it will get too hot). There you go! A double boiler at your service.The view from above.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesThe DIY version is not only more economical, but also easier to put together and take apart, making it better for cleaning and storage (efficiency FTW!). In a one-trick-pony double boiler, the pieces often stick together, especially after extended use. Plus, there’s an unnecessary lid. You really never need a lid. (In fact, there’s a good reason you don’t want a lid: It promotes condensation, which turns into drippage, which can spell disaster for melted chocolate.)In the case of Basically’s Camouflage Chocolate Fudge Brownies, you actually employ the DIY double boiler twice: first to soften cream cheese, which can take forever to get to room temperature on its own but is too delicate for direct heat, and then to slowly melt together butter, cocoa powder, and sugar. This mixture needs to get hot so the sugar can start to dissolve, but you don’t want to risk the butter browning or the cocoa scorching.You’ll need to put together a double boiler when you’re heating egg whites and sugar for a meringue that will hold stiff peaks, or for a hollandaise sauce where you could break the precarious emulsion if the egg yolks overheat. And of course, when you're melting chocolate or, sometimes, when you're working with cocoa powder. But other than that, your bowl and pot will live freely, available for so many other uses. Can a fully-formed double boiler claim that?Now excuse me while I send this article to my mom, who will be freeing up some cabinet space very soon, and then hopefully making brownies to celebrate.Get the recipe:Camouflage Chocolate Fudge BrowniesThe secret to the fudgiest, most chocolaty brownies is cocoa powder—not melted chocolate. We borrowed chocolate expert Alice Medrich’s technique, then added a cream cheese topping for tangy balance. Don’t overthink your camo design; the brownies will look even better when sliced.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-09", "author": ["Condé Nast", "Emma Wartzman"]}