{"id": "7536732affe61ecc44d02c22c488f650", "url": "https://www.bonappetit.com/story/how-to-get-healthy", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "How to Get Healthy According to Grandparents Because They Know EVERYTHING | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe Asked Grandparents How to Get Healthy Because They Know EVERYTHINGGrandparents always have the answer, you guys.By The Healthyish TeamMarch 7, 2018FacebookTwitterEmailPhoto by Allan Grant//Time Life Pictures/Getty ImagesFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.One of the worst things about growing up is taking care of yourself when you get sick. Netflix is no nurse, and the delivery guy definitely won’t tuck you into bed after dropping off your matzah ball soup. Oh, adulthood. Tired of Googling our symptoms, we decided to ask the people who know how to get healthy best: our grandparents.Armed with the particular kind of wisdom distilled from surviving countless flu seasons and raising multiple generations of sick kids, they rose to the occasion. Here, our grandparents (and other people’s grandparents), share their time-honored home remedies and advice for how to get healthy whether you've got the sniffles or the stomach flu. Go ahead, close that WebMD tab. Grandma’s here.“If you feel a cold coming on, gargle with salt water and steam your face over a pot of boiling water with a few drips of eucalyptus. Eat yogurt when traveling to keep tummy troubles at bay—yogurt and rice is good for stomachaches.” —Tourie Nozari, mother of e-commerce editor Elaheh Nozari and grandmother.“My parents used to do an old Russian treatment for a cold called a gogol mogol. You can Google it! You make a broth with a raw egg and some honey and whiskey, and it helps a sore throat. You have to sip it while it’s hot. ”—Jean Abarbanel, grandmother of Healthyish editorial assistant Aliza Abarbanel.“My mother would rub you down with vapor rub if you were all stuffy, because it helps you to breathe. She'd make you lie there and rub it on your neck and chest, then put a warm towel on you. I was waiting for her to make me swallow that crap! I was planning on cutting it out, but I actually used it in my adulthood. I think it helped, might have killed me, but it killed something else, too.”—Nana Henrietta Hartshorn, grandmother of assistant to the editor in chief Ryan Walker.“My big thing was dissolving any medication in chocolate ice cream. Who cares if you're not supposed to eat dairy when you're sick? Also I think everyone who is Jewish says this, but make chicken soup. Period.”—Grandma Marilyn Hoder Salmon, grandmother of web editorial assistant Emma Wartzman.“For vomiting and diarrhea you should not eat food or raw vegetables till you feel better.  Only Gatorade and salt crackers, and Jell-O, ‘till you are over the bout.  If you are not better in 24-36 hours go to the doctor quickly because you will dehydrate. And do not wash your hair and go out in the cold or at night right after washing your hair.  I have experience—remember I grew up in New York City! I guess you can Google all this.  But this is just grandmotherly knowledge.”—Abuela Vivian Jaime, grandmother of senior visuals editor Elizabeth Jaime.\"Don’t go out too much. Don’t get over-tired. When you’re tired that is when you get sick easier. Stay home and rest and drink juice. Rest is very important. Chicken noodle soup is good, matzo ball soup, eggs, things that are light. Gargle with salt water if your throat is sore, and chicken soup will also help for that because it has a lot of salt.\" —Grammy Ina Bellis, grandmother of associate web editor Alyse Whitney.\"When one [of my six kids] got sick, it went from one to the other. I called it City Hospital. We used a bucket to catch whatever such things needing catching. Campbell's bean with bacon soup is one of my favorite remedies. In fact, I just had some the other night. It's good, but also nutritious and filling.” — Grandma Rose Harris, grandmother of senior web editor Alex Beggs.\"'Plow through it' is the family recipe. Been seeing this for generations. One may call it denial; its been a traditional family coping tool for as long as I can remember. Matzo ball soup is the food/medicine that cures all, especially when served on bed tray in bed.\nBoxes of Manischewitz are always on hand in our house, ready to be pulled out for pneumonia, mono, flu, sniffles, stomach aches, bruises or bad moods. Whether it cures or not, it clearly brings comfort to the patient and the nurturers.\" —Jill Weinberg, mother of senior editor Julia Kramer and grandmother of Philip Kramer.“Go see a doctor.”—Jay Abarbanel, grandfather to Healthyish editorial assistant Aliza Abarbanel.Explore Bon AppétitHealthyishGet WellRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "The Healthyish Team"]}