{"id": "75372eb563598a7b304274232ffc8540", "url": "https://www.bonappetit.com/story/eton-mess-recipe", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Eton Mess Is Summer’s Easiest Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEton Mess Is the Cool, Laid-Back Friend Version of DessertThis new recipe uses store-bought meringues, which makes it one of the easiest summer desserts out there. But no one has to know.By Carey PolisJune 28, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailIn the 4.5 years I have worked at BonApp, I have campaigned for many recipes to exist on our site: a salmon burger that isn’t dry, ooey gooey butter cake, and baked ziti. But the campaign I was most passionate about, most willing to not give up the fight (see: mug cake attempt #4 of fall 2016) was getting a proper Eton Mess in the pages of our magazine and online. It has finally happened, people, and June 2018 has been a glorious month of celebration.Eton mess is essentially a less-scripted trifle without the cake; it’s whipped cream mixed with strawberries and meringues. And yes, its origins do come from a certain British private school.Why is this four-ingredient recipe worth so much devotion? Because it epitomizes everything I want in a dessert: under 30-minute preparation, varying textures, and the opportunity to be sincere when saying, “Oh this? It was no big deal. Really, it was nothing. No, really. Have seconds!” Let’s break it down:Quick PrepIf you can buy strawberries, toss them in sugar, and simmer them on the stove, then you’ve got this. Layer the berries on top of whipped cream (yes, please, make it yourself) and store-bought meringues. That’s... it. Eton mess is essentially one more step beyond serving berries and cream, which is a great dessert already, but lacks any sort of complexity. Meringues—even store-bought ones—make it seem like you really went out of your way (I know, you didn’t, sshhhh).Varying TexturesEach bite should have a combination of softly crunchy meringues with cream whipped to soft peaks so it remains a tiny bit loose. In this particular recipe, half of the strawberries are cooked for about 25 minutes, and the other half are mixed in after—so some are mushy and others retain a bit of give. Three ingredients, four textures.It’s No Big DealThere’s something about fresh whipped cream that really impresses people. It seems so elegant, so refined, so... not from a $2 carton at the grocery store. Ditto with the strawberries: Even if the ones you have aren’t the best quality, since you’re mixing them with sugar, it... doesn’t reallyyyy matter. Let the dinner guests think you put together something complicated. They don’t need to see that plastic clamshell of meringues sitting on your counter or the bruises on your berries. Whipped cream hides everything.Get the recipe:Strawberry Eton MessLet us introduce you to summer’s easiest dessert.View RecipeAnd FYI, here’s how to make whipped cream by hand:Explore Bon AppétitDessertWhipped CreamStrawberryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Carey Polis"]}