{"id": "754ab8a973bfeb38bee633dbcd051ba5", "url": "https://www.bonappetit.com/story/brit-reed", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Brit Reed Is Leading a New Generation of Indigenous Chefs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBrit Reed Is Leading a New Generation of Indigenous ChefsWe talked to the Choctaw chef about learning to get your hands dirty and the sanctity of corn.By Nicholas Mancall-BitelMay 18, 2018FacebookTwitterEmailPhoto by Jessica Sargent of Ink & Paper PhotoFacebookTwitterEmailBrit Reed did not set out to become a cook, teacher, farmer, historian, and activist for the food sovereignty movement, preparing and preserving Indigenous foodways. Until college, she wasn't even an active member of her native Choctaw community. But today, as she leaves culinary school at 29, she is set to become a leader in a food movement spurred by a new generation of Indigenous chefs.The Choctaw now live in Oklahoma, but Reed was raised by a non-Indigenous family in Dallas. When she arrived at Evergreen State College in 2010, she enrolled in Native American Studies, before entering a masters program in tribal governance. She learned how government-run commodity food programs and food deserts on reservations cause rampant diabetes, hypertension, and heart disease. She also learned about corn. “There were over eight thousand varieties of corn at the point of Contact [with Europeans], and even in 1900 there were still a thousand,” she says. “Today you can get maybe two or three in a regular grocery store. I talk about corn a lot. In Japanese cuisine, you can’t not have rice. For Choctaw, corn is our staple in that way.”Her interests quickly led her beyond the classroom. Her essay, “Food Sovereignty Is Tribal Sovereignty” (named for a speech by Native nutrition educator Valerie Segrest), exploded from a class project into an online forum for Indigenous cooks. But it was a story about Indigenous rights icon Winona Laduke that really transformed Reed from academic to food activist. Laduke’s father challenged her academic background, telling her, “I don’t want to hear about what you have to say until you can grow corn.” Reed recalled, “That kind of sunk in for me, and I thought, ‘I should stop this theorizing about all these things and actually get my hands dirty.’”Reed enrolled in the Seattle Culinary Academy, though she wasn't drawn to professional cooking as just another job. Community service is the norm for Indigenous chefs. Reed worked with the Tulalip Health Clinic, a healthy eating education program for the Coast Salish community near Seattle, and with Yappalli in Oklahoma, a program in which community members walk sections of the Trail of Tears. Straight out of culinary school, Reed joined I-Collective, a group of Indigenous chefs and activists who organize pop-up dinners and seminars to educate mainstream media about Indigenous foods and rising cooks.The program highlights the work of young female cooks. Reed says she’s thankful that well-established chefs like Mixteco chef and I-Collective cofounder Neftalí Durán and cofounder M. Karlos Baca (Tewa/Diné/Nuche), have given female cooks the spotlight because, even as women work alongside male chefs to heal Indigenous communities, they've had to fight for gender equality within the kitchen.Durán and Reed agree that female Indigenous cooks should be honored, both in modern kitchens and for their historic roles in feeding Native communities. Before Contact, Reed explains, women took the lead on tending the corn, squash, and sunflowers that sustained the community. When first Spanish then French explorers came through Choctaw land, it was women who dominated trading decisions, determining who got to share in their harvest. Female control of foodways in the Choctaw community gave women powerful, even deified status by extension. “For us, corn was sacred,” Reed says. “And women were the main providers of that sacred food.”After colonizers stripped the Choctaw of their lands, traditional foods took on a magnified role in resistance, and women continued to feed their families Indigenous foods as a subtle act of defiance. Reed explains that by reframing Sunday church services by serving traditional meals or teaching children to forage for wild onion dinners, women ensured the survival of fragments of their pre-colonial traditions.As Brit Reed leaves school and grows into her role as a leader in the Indigenous food sphere, she inherits power and perspective from this history of strong Indigenous women. Back in college, she would spend summers cooking in Oklahoma, where her auntie would always remind her to “embrace traditional women’s roles,” and that advice has become a source of both power and appreciation.“Grandmas have been holding it down and making sure we still have these foods and this knowledge. We’re just embracing who we are,” Reed says. She has also taken Laduke’s father’s lesson to heart, getting her hands dirty. “I recently took it upon myself for the first time to try my hand at gardening,” she says. “I tried to grow corn, and thankfully it grew pretty well.”Explore Bon AppétitHealthyishNative AmericanprofileRead MoreLifestyleThis Healthy Diet Has Stood the Test of TimeBy Sean ShermanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-18", "author": ["Condé Nast", "Nicholas Mancall-Bitel"]}