{"id": "7551b008bdf3b2fa56d98437a9ded275", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/la-casa-de-tono", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "La Casa de Toño Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityLa Casa de ToñoThe 24-hour diner that always plays the hits.FacebookPinterestTwitterEmailPhoto by Carolina LafuenteGO: for all the Mexican classics you love, on the cheap. La Casa de Toño is a great spot for a big crew, or when you just need to eat various combos of meat, cheese, and tortillas.ORDER THE: pozole. That alone should be enough to fill you up, but why stop there when there are flautas, enchiladas, quesadillas, and tostadas calling your name...THE VIBE IS: bustling. Expect gatherings of all sizes of families and friends. And a crazy efficient waitstaff that might even clear your plate before you've had the last bite.PRACTICAL STUFF: There are several locations of La Casa de Toño and not all of them are 24-hours. See here for more info.—Carey PolisWE ALSO LOVEEl Mirador de ChapultepecFamilies in the front, partiers in the rear, raw-beef ceviche throughoutTostadas CoyoacánNot just Instagram-worthy but incredibly tasty, tooMercado el 100Prime people-watching while supporting local farmers and producersExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Carey Polis"]}