{"id": "7553a3a898b2adf9b5ead6af077c2584", "url": "https://www.bonappetit.com/story/life-on-marz-community-club-chicago-design-tour", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "The Little Things: A Design Tour of Life on Marz Community Club, an Arty Chicago Brewery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Little Things: a Design Tour of Life on Marz Community Club, an Arty Chicago BreweryIt’s part brewery, part social club, part art project, and all fun.By Emma OrlowSeptember 27, 2021FacebookTwitterEmailPhoto by Danielle A. ScruggsFacebookTwitterEmailFor decades Ed “Edmar” Marszewski has been a key player in the Chicago DIY arts scene. His zine, Lumpen, has blossomed into a universe of interdisciplinary projects: gallery, radio show, and art fairs, as well as hospitality businesses in the city (Marz Community Brewing Co., Maria’s Packaged Goods and Community Bar, Pizza Fried Chicken Ice Cream, Kimski, and a food relief program that started in the pandemic and continues today). His latest venture is Life on Marz Community Club, a nano-brewery that’s about good beer, of course, but also a place to highlight artists he’s developed connections with over the years. He tapped Adi Goodrich, a set designer and longtime collaborator, to do the interiors, and together they created their own world, inspired by Chicago’s athletic clubs and immigrant-run social clubs that were a haven for newcomers.Photo by Danielle A. ScruggsThe EntranceA wall of lit-up LED signs greets customers. They’re designed by video artist Davy Force of Info Chammel, a parody 24/7 CNN-style show that Marszewski has collaborated with for nearly two decades on various performances. Each sign has been programmed to play a 12-to-15-minute loop of words meant to evoke good vibes.Photo by Danielle A. ScruggsThe Beer TapsMarszewski, who is half Polish, was fascinated by the Polish social clubs that used to be more common in Chicago. These were community spaces for Polish immigrants and had in-house bars that sold beer. As a nod to that history, Marszewski and architect Charlie Vinz installed top-of-the-line Perlick beer taps. (Yes, it’s a smiley face.)Photo by Danielle A. ScruggsThe Wall ArtAs the interior design was coming together, Goodrich felt like the large walls looked bare. So she added a relief to trick the eye into thinking the ceiling seems lower, which gives a more intimate feeling to the space. The blobby wood cutouts are her interpretation of bacteria in the beer fermentation process, which happens right behind the bar.Photo by Danielle A. ScruggsThe Custom Chip BagsThe brewery highlights Midwest snacks, such as Brewer’s Crackers (an upcycled cracker company that uses food waste from the beer-making process) and snack mixes made with Japanese pop-up Mom’s. But Life on Marz also has its own private label potato chips (cheddar!), which are manufactured by Ole Salty’s in Rockford, Illinois, and stuffed into custom packaging illustrated by artist Jeremiah Chiu. Marszewski sells them wholesale to other businesses and hopes to expand his portfolio of potato chips soon.Photo by Danielle A. ScruggsThe Light FixturesOriginally, Marszewski wanted to use ceramic vessels Goodrich collaborated on with BX Ceramics as beer glasses. Soon they realized that clear glasses would be a better way to show off what’s on tap. But as Goodrich was holding up a BX Ceramics bowl to mimic the height of a light fixture she wanted, it dawned on the team that they could use those, so she worked with BX Ceramics to make new bowls. The opaque material creates a spotlight directly down on the tables, which again gives a more intimate feeling.Photo by Danielle A. ScruggsThe RestroomsWhile the restrooms are gender-neutral, Goodrich wanted each one to have its own distinct color: green and blue. One of Goodrich’s biggest bar pet peeves is when people waiting in line are on their phones, so she wanted to give them something to look at. Each monochromatic restroom is outfitted with backlit lighting and frosted windows. “You can see if the silhouettes inside are of a big group of friends or people hooking up,” Goodrich says with a laugh.Photo by Danielle A. ScruggsThe SoundproofingSoundproofing was a priority in the space, in part as a courtesy to the apartments located above the brewery. Goodrich upholstered the Homasote-made soundboard with green and blue wool to match the bathroom doors. It’s not the only creative soundproofing hack in the space: Vinz lined pegboard light fixtures with carpet padding to absorb noise.Photo by Danielle A. ScruggsThe Fictional Marz Motel (and Its Merch)Marszewski dreamed of opening his own motel, but that seemed like too much work. So he created a fictional one. With his friends in the art community, he made a keychain, postcard, matchbook, and ashtray for Marz Motel, which he sold at the original Marz brewery and brought over to Life on Marz. “People thought we actually opened a motel,” Marszewski says.Photo by Danielle A. ScruggsThe Actual MerchWearing adornments like pins was once a way for social club members to identify themselves and one another. At Life on Marz the way to show allegiance to the brewery comes in the form of posters, T-shirts, and these stickers designed by Brooklyn-based creative studio Franklyn. One of the more oddball offerings: custom puzzles with a signature beer to go alongside it.Photo by Danielle A. ScruggsThe Communal TablesChicago social clubs were often funded by the community they served. “They weren’t fancy spaces for billionaires,” Goodrich says. She wanted to be intentional about using materials that felt approachable. When creating the tables, she covered them with speckled Marmoleum, which is usually meant for floors. They’re easy to clean and are “more affordable than terrazzo,” she says.Photo by Danielle A. ScruggsThe Hot Dogs (and the Trays)At Kimski, Marszewski’s Korean-Polish street food joint, he pays homage to backyard hangouts of his youth, where his mother would combine flavors from both sides of his family. With little room for a full-blown menu at Life on Marz, he zeroed in on hot dogs. He offers Polish version using sausages from the famed Makowski’s Real Sausage and a traditional Chicago stadium-style hot dog. Both are sold in kitschy red trays and wrapped in custom paper.Photo by Danielle A. ScruggsThe Beer GlassesIn addition to having long-loved Marz beers on tap, Life on Marz brewed a few exclusives to this location, like the hazy IPA Marzonic Supreme. “We couldn’t just give people regular old glasses for them,” Marszewski says. He worked with Franklyn design studio to create these cartoonish glasses that incorporate designs from their previous and current beer cans.Explore Bon AppétitRestaurantsFuture of RestaurantsChicagoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-27", "author": ["Condé Nast", "Emma Orlow"]}