{"id": "755dee1ca86fec01df3a06e65d247c12", "url": "https://www.bonappetit.com/recipe/einkorn-shortbreads", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Einkorn Shortbreads Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueEinkorn ShortbreadsBy Roxana JullapatJanuary 12, 20214.0(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintEinkorn is the great-great-great-great-great-(you get the picture)-grandmother of all other wheats. It’s the oldest wheat variety out there. It’s also high in protein, iron, thiamine, dietary fiber, B vitamins, and the antioxidant lutein. “It tastes bran-y,” says Roxana Jullapat, the author of the cookbook Mother Grains (out April 2021). “It can get a little milk-chocolaty too. Shortbread is a good canvas for it because it brings out that richness. And einkorn loves butter.” Make sure to use einkorn flour labeled “whole grain,” which has been ground with the whole kernel (that’s where all the nutritious goodness and flavor is). All-purpose einkorn flour isn’t the same. Jullapat’s favorite einkorn is from Grist & Toll, a whole-grain mill in Pasadena, CA.IngredientsMakes about 12¼cup (packed; 50 g) dark brown sugar¼cup (28 g) powdered sugar½cup (1 stick) unsalted butter, cut into ½\" pieces, room temperature¾cup (85 g) whole grain einkorn flour½cup plus 1 Tbsp. (70 g) all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher saltSpecial equipmentA 2\"–2½\"-diameter cookie cutter; ½\" triangle, heart, clover, or other shape cookie cutter (optional)PreparationStep 1Place a rack in middle of oven; preheat to 300°. Pulse brown sugar and powdered sugar in a food processor to combine. Add butter and pulse just until combined. Add einkorn flour, all-purpose flour, and salt and pulse until dough comes together. Turn out onto a clean surface; press into about a 6\"-diameter disk.Step 2Place dough between 2 sheets of parchment paper and roll out to a ⅓\"–½\"-thick round. Remove top sheet of parchment and punch out cookies with larger cutter. If using smaller cutter, punch out center of each cookie. Carefully transfer cookies to a large parchment-lined baking sheet, spacing 1\" apart. Reroll scraps; punch out more cookies.Step 3Bake cookies, rotating baking sheet front to back halfway through if browning unevenly, until golden and firm around edges, 25–35 minutes. Let cool on baking sheet.Do ahead: Cookies can be baked 2 days ahead. Store airtight at room temperature.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Einkorn Shortbreads?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI really like the deep flavour of this cookie. I appreciated using one tool to bring everything together. I will reduce the sugar a bit next time. This was my first time baking with Einkorn flour. Intrigued.   LizGVancouver, BC3/28/2021I love these cookies. I love einkorn flour and this is truly the perfect application for it... buttery and toasty, they are perfect with a cup of tea or coffee. I really liked how thick the cookies were.. it gave them a nice heft that stood up to a bit of dunking in hot liquid. I reduced the sugars by about 1/4 and it was perfectKamLos Angeles2/11/2021Tried these for the first time and they are the most delicious shortbread I have ever tasted, more complex than others.  I found the dough a bit sticky and hard to cut out, but chilling slightly helped. I think I made them thinner than the recipe called for, but I like the crispy way that turned out. They have held up well in a well sealed container. Very buttery, so I have to limit my enjoyment, lest my arteries plug up immediately. Might try cutting the brown sugar back just a tad, as I like cookies slightly less sweet. My first Einkorn experience and I am a convert!AnonymousFt. Myers, FL2/9/2021These cookies are very delicious! They are buttery, nutty, and complex in flavor. I love that they come together in the food processor. I’d love some guidance around whether refrigerating the dough or incorporating cold butter vs room temp butter would change the end result. The color indicator for doneness was not helpful as the dough is quite dark to begin with. AnonymousSan Francisco, CA1/23/2021Explore Bon AppétitCookieDessertWhole Wheat FlourFlourEasyNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}