{"id": "756706392dbca2fcfa13341fc9aa6bff", "url": "https://www.bonappetit.com/story/fatima-ali-died-cancer", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Chef Fatima Ali Has Died of Cancer at Age 29 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Fatima Ali Has Died of Cancer at Age 29; This Is Her Essay from Our Upcoming IssueShe dreamed of opening her own restaurant. Then she learned she had a year left to live.By  Fatima AliJanuary 25, 2019FacebookTwitterEmailPatrick Randak/thelicensingproject.comFacebookTwitterEmailWe are saddened to share that Fatima Ali, a former Top Chef contestant, has died of cancer at age 29. A version of this essay is slated to run in our March print magazine. We are running it early online to share her perspective and honor her memory. Three months ago, Ali wrote for us about how she was spending her remaining months, following her terminal diagnosis. This version expands on her earlier piece.I grew up in Pakistan, where food is a really integral part of the culture. I started cooking with my grandmother when I was six or seven, and she would teach me how to make little bread bears. They had peppercorn eyes and cloves for buttons, and I remember thinking it was such an amazing thing, that I could actually make something with my own hands.After I graduated from the Culinary Institute of America in 2011, my mom wanted me to come home, but I said “Just give me one year in New York City. There's no place better for me to learn.” Every time I’d go back to visit my family in Pakistan, I would cook. Watching me evolve gave my mom comfort, and helped her understand that this was absolutely my calling. So she finally let go, and said, “Look, just promise me that you'll do your absolute best. And I’ll be happy with that.” And I said, “Okay. That’s a promise.”My first job was at an Indian-Latin restaurant in New York. I was a floor manager and the sous chef at the same time, weirdly enough. So I spent three days in the front, and four days in the back. I was doing seven-day weeks, 14-hour days. I did that for nine months. Later, at another job, my executive chef quit suddenly, as they often do. I was just a 21-year-old junior sous chef, but suddenly in charge of the whole place. I worked breakfast, lunch, dinner, catered all these super-VIP holiday parties. I’d get home at 1 a.m then have to wake up at 4 a.m. for a private breakfast party. One time several cooks called out and then the person who was transporting the catering trays dropped them all onto the pedestrian walk at 45th St. and Lexington Ave. In the middle of lunch rush. We had to remake everything, with all the cooks missing. There were plenty of days like that. But you know what? It was amazing. Managing to get through a day like that—and not only living to tell about it, but doing it again and again—I think it really makes you understand what a human is capable of. We’re so resilient. If I had to do it all again, I wouldn’t change anything.When I got diagnosed with a rare form of cancer called Ewings Sarcoma, I had just finished filming Top Chef in Colorado. It was 2017 and I was working at the U.S. Open with my friend Joe Flamm, who was the winner and had opened up a pop-up restaurant there. I’d had this weird ache in my shoulder for the past couple of months that I’d been ignoring. You know, popping a couple of Advils, going to sleep. But one day, in the middle of lunch, my shoulder swelled up and the pain was mounting literally by the minute. I had to go to the emergency room.They gave me an MRI literally within 20 minutes of seeing me, because I was in so much pain. I remember the doctor was exceptionally handsome. I remember standing over there crying my eyes out and this guy could be on a runway. He calls me on my cell phone and I’m thinking, “Ooh, this hot doctor's asking me out.” But instead he says, “I want to refer you to an oncologist.” That was just the beginning. They didn't discharge me from my first hospital admission for three weeks.Honestly, until your first chemo cycle, I don’t think it really hits you. Then your hair starts falling out, and finally you’re like, “This is actually happening. This is the rest of my life.” I did eight rounds of chemo. It was horrible, but at the end, my scans were all clear. I thought I’d beaten it. Then it came back. Worse than before. It was metastatic. It had spread to my lungs. The doctors told me I had a year to live.The first thing I did when I found out was dye my hair. Platinum blonde. I thought, “I’m dying, so why not?” I felt like I had to reclaim the hair thing. So I called this guy to my hospital room. Then I did one more round of chemo and all my frickin’ hair fell out again.That sucked, but I was like, “You know what? Stop feeling sorry for yourself.” I‘ve been to hospitals in New York and I‘ve been to hospitals in LA, and when you‘re around that much sickness, and you see people from all sorts of backgrounds, all sorts of ages, in all stages of disease—it really gives you perspective. Because even now, it could be so much worse than it is. I‘m still very lucky to be able to do a lot of the things that I love.I decided not to spend whatever time I had left (whether it’s a year, a month, another ten years—you don’t know until you’re gone) lamenting all the things that weren’t right. Instead, I’d make the most of it. I’m using cancer as the excuse I needed to actually go and get things done, and the more people I share those thoughts with, the more I hold myself to them. If I write this intention down, if I have it printed somewhere like I do here, I have to hold myself responsible, because I have people counting on me.What is my intention? To live my life. To fulfill all those genuine dreams I have. It’s easy to spend weeks in my pajamas, curled up in my bed, watching Gossip Girl on Netflix. I could totally do that. And don’t get me wrong, I still watch Gossip Girl. But now I’m doing things. I’m going out to eat. I’m making plans for vacations. I’m finding experimental treatments. I’m cooking. I’m writing.My brother and I have challenged ourselves to write a recipe a day—spaghetti; braised lamb with Pakistani spices and root vegetables; comfort food. Things I like to eat. Things people will actually make. Every day I come up with a recipe I’ve never made before, write it down in a notebook, make a little drawing of it, go shopping for those ingredients, and cook it. My brother wants to compile them all. He’ll turn them into something one day.I’ve also been eating at a lot of restaurants. Vespertine, Sushi Masa, Broken Spanish, Kismet. I went to Eleven Madison Park with my family and the manager, a friend of mine, made a replica of my food stall, VanPakistan, in the kitchen. Down to the tablecloth. Down to the kind of napkin dispenser I had. The chef made the most delicious, melt-in-your-mouth Seekh kebabs I’ve ever had, with flatbread and pickled onions and green chutney they had made just for me. My mom was in tears, bawling. My older brother was crying. Everyone was hugging each other. We were blown away.We’re planning a trip to Europe: Austria, Italy. I want to eat really phenomenal Parmesan and balsamic and fresh buffalo mozzarella and real Italian tomatoes and basil and fresh pasta with good olive oil and great cheese. That’s all I fucking want. Oh, and I DM’d Noma. I was like, “I’m coming to town. I hope even if there aren’t spots, you could make a spot for me.” I received a reply from chef Rene Redzepi himself. Turns out people respond when you tell them you’re dying of cancer.My brother and I were talking the other day and he made an interesting point. He was like, \"As chefs, you guys deal with death every day.\" And he’s right. When you’re a chef, you understand the circle of life. We're butchering rabbits, whole hogs, and baby lambs; we’re filleting fish and cleaning shrimp. All these things have died for us. I suppose you have to see it as the natural progress of life. Perhaps I've had to face it a little bit sooner than expected, but it's not an unfamiliar feeling.There are days that I'm exceptionally afraid. There are days I sit alone and cry, because I don't want to do it in front of my family. And there are other days that we all sit down and cry together, because it is such a scary thing. But at the same time, you can't let that fear cripple you. It's harder being miserable than it is to be happy.As told to Hilary Cadigan on November 28, 2018Explore Bon AppétitFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-25", "author": ["Condé Nast", "Fatima Ali"]}