{"id": "7567a223ad7217f1a088368a156e8add", "url": "https://www.bonappetit.com/story/how-to-buy-baking-apples", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "The Best Apples For Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One Rule Separates Good Baking Apples From The LosersNo offense to soft apples, but we're looking for something firm and crisp.By Sarah JampelSeptember 26, 2019FacebookTwitterEmailPhoto by Joseph DeLeoFacebookTwitterEmailYou're at the farmers' market (or the apple orchard, or the good old grocery store) but none of the six apples we've deemed best for baking are. The crew didn't come through! But don't panic: Your future apple dessert needn't suffer.This easy tip from Claire Saffitz, the brain behind Apple Pandowdy, Apple-Walnut Upside Down Cake, and Caramel Apple Clafoutis, is all you need to remember: A baking apple should be so firm that when you press on it with your thumb, you don't leave an indent.Softer apples—those that would yield to the pressure of your thumb—are higher in water content and more likely to lose their shape or get soft and mushy when you cook them. That might be desirable for applesauce but it's not what you're looking for in a recipe where you want the pieces of fruit to remain distinct. Plus, the more watery the apple, the more likely it is to sink into batter. Your cake will taste just as good but your seasonal fall baking Instagram post might take a blow.So next time you can't locate Mutsu, Braeburn, or Winesap (or you have no service in a basement grocery store and are frantically trying to google \"best baking apples\"), stay calm: The only tool you need to scout other good candidates is your thumb.Apple season awaits:Apple PandowdyThis puff pastry apple dessert will be your new favorite fruit dessert. Cobbler, you’ve been warned.View RecipeExplore Bon AppétitAppleFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-26", "author": ["Condé Nast", "Sarah Jampel"]}