{"id": "7576a937dda3c02bb268ae131dedb985", "url": "https://www.bonappetit.com/story/silicone-cooking-bands", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "Silicone Rubber Bands Are 1000x More Useful In the Kitchen Than Regular Rubber Bands | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSilicone Rubber Bands Are 1000x More Useful in the Kitchen Than Regular Rubber BandsWashable, reusable, heat-proof, and cold-resistant, they're your kitchen's biggest little helpers.By Catherine RussellMay 19, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There’s probably nothing more ho-hum than a rubber band—a classic, ubiquitous object of fidgeting and flinging, they’re useful in certain emergencies but hard to get excited about. Yet sometimes even a household standard can be quietly improved in a big way, and that’s what’s happened to rubber bands. Silicone bands are an upgrade and, in the kitchen, the hands-down better choice, easily worth the few bucks you shell out for them.But, you say, rubber bands are freebies! Yeah, well sometimes free isn’t worth it. Here’s why:“Rubber” bands can be made of any number of synthetic or natural materials, from the sap of the rubber tree to petroleum extracts, and you can’t easily tell by sight what you’ve got. But no matter where they come from, these types are not safe to cook with. Not only can they melt or ignite, but they can also leach chemicals into food at temperatures well within a normal cooking range.In the kitchen you need bands that can handle heat and hold up to use, even if that’s for storage purposes. And it should be something that can be made clean and sanitary, too. Natural rubber collects dirt, can’t be easily sanitized, can be sticky when the surface degrades (which it does fairly quickly), cracks and crumbles with age, and is not usually antimicrobial.Another silicone kitchen helper we love? This GIR spatula.\nPhoto by Alex LauSilicone cooking bands are just the ticket to replace rubber bands in the kitchen. Though not perfect—they can still disintegrate at extremely high temperatures, though beyond average cooking numbers— they’re safer in boiling, baking, broiling, air frying, microwaving, grilling, and storage. Silicone is chemically stable, food-friendly, doesn’t carry bacteria or odors, is super heat-resistant, and can be sanitized right along with your dishes. The material has become a favorite in scientific and medical applications—and in kitchenware—and has been thoroughly studied.At under $10 for a pack of dozens, they’re inexpensive enough to use however and whenever. Clean and reuse, or snip and toss, it’s your call.Here are just a few ideas for putting silicone bands to use:Tie fresh herbs together before they go into the pot.Securely truss poultry legs or wrap a roulade.Make a small bundle of vegetables (like carrots or asparagus) for the grill, or wrap the bands multiple times around skewer ends to prevent softer items, like tomatoes, from slipping off, and to give you more traction when rotating with tongs.Wrap a band around each end of a rolling pin for perfect pastry thickness.For extra protection against freezer burn, roll a freezer bag down tightly and seal with a band. Silicone won’t wear out in the cold as a rubber band would.For bread or fragile stuff like potato chips, do the grab-and-spin move, fold the twisted end over itself once, and secure with the band.That baking mat that always gets in the way? No more. Run it through the dishwasher, then once it’s bone-dry, roll it tightly, and secure with a silicone band. Now it’s all clean, fits perfectly alongside the boxes of wrap, out of the way but handy.When that wrap lasts longer than its busted box, a band around the roll works perfectly to contain the unfurling.Minding sourdough starter? Use two or three silicone bands around the container to mark its progress.Eyeballing your most expensive vodka? Band on the bottle. Your roommate can always move the band, but that’s not a problem I can solve.Colorful silicone bands are an easy, fun, and cheap way to ID glasses at a party, and can go right in the dishwasher on/with the glasses.Or, use a band to lace stemmed glasses around the upright prongs of the dishwasher rack. Safe glasses; clean bands.Secure a tea bag string around the mug with a band before adding water.Wrap a band around the handle of a cooking spoon for an instant ridge to keep the spoon from slipping into the pot.Wrap bands around two edges of a cutting board or hot pad for counter traction.Cap on the vanilla extract fused? Stubborn pickle jar? Wrap a band multiple times around the cap or lid, add another band around the bottle or jar, grab by the bands, twist, and voilà! This works especially well on oddly shaped caps, even beyond the kitchen, such as those on nail polish bottles.Now, everything will wear out eventually, but silicone bands are almost infinitely reusable—as long as you keep them clean. Silicone itself doesn’t support biological growth and does not absorb oils or fluids, but any stuff left on its surface could mold or attract pathogens, such as salmonella. So wash after every use with a degreaser like Dawn dish detergent, soaking as necessary, and avoid abrasives. Even easier, toss the bands in the dishwasher! Just be sure to put them in a lidded basket or tightly around the prongs, because you don’t want the bands sloshing around loose (they can get caught in the machine’s drain or moving parts).Once you realize how useful these little babies are, you’ll be carrying one around like a scrunchy. Hey, there’s yet another use: hair tie. Or, use a pair of bands to keep your sleeves up while cooking. And when the cooking gives way to eating, you can loop a silicone band around the button on your pants, through the buttonhole, and back again to the button, to loosen your waistband. Ah, life is good.Photo by Isa ZapataArchitec Stretch Cooking Band, Pack of 25$9 at AmazonExplore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-19", "author": ["Condé Nast", "Catherine Russell"]}