{"id": "7578115ab365565773129e784e3414eb", "url": "https://www.bonappetit.com/recipe/five-spice-spatchcocked-grilled-chicken", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Five-Spice Spatchcocked Grilled Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueFive-Spice Spatchcocked Grilled ChickenBy Jessie YuChenJuly 6, 20214.9(19)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintFor grilling the whole bird, we stand by the tried-and-true methods of spatchcocking the chicken and giving it a dry rub. The spatchcock does a few things: It flattens the bird so the breasts and legs cook evenly and cuts down on cooking time. And unlike a wet brine, a dry rub—this one’s got five-spice, MSG, and light brown sugar—gets into every nook and cranny of the whole bird without making a big mess. (You can skip the MSG if you prefer, but it will add just the right amount of umami backbone to the rub, so we recommend it.) —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonInstant-Read Thermometer$35 At ThermoworksHeat Resistant Leather Gloves$22 At AmazonScissors$17.95 At Amazon16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonIngredients4 Servings2Tbsp. five-spice powder2Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt1tsp. MSG (optional)1Tbsp. plus ½ tsp. freshly ground white or black pepper1Tbsp. plus ½ tsp. light brown sugar13½–4-lb. whole chicken1Tbsp. vegetable oil, plus more for grill2scallions, roots trimmed2garlic cloves, finely chopped2red Thai chiles or jalapeños, thinly sliced¼cup unseasoned rice vinegar3Tbsp. soy sauce1Tbsp. toasted sesame oilPreparationStep 1Mix five-spice powder, salt, MSG, 1 Tbsp. white pepper, and 1 Tbsp. brown sugar in a small bowl.Step 2Place chicken, breast side down, on a cutting board and, using kitchen shears or a large knife, cut along both sides of backbone to remove (you can ask a butcher to do this for you if you prefer); discard (or save for making stock). Open up chicken and turn breast side up. Press down on center of breast to flatten chicken—you should hear the breastbone crack. Tuck wings behind breast, then tuck in legs so bottoms of drumsticks are pointed away from body and chicken is as flat as possible. Sprinkle spice mixture all over chicken. Let sit at room temperature 20 minutes, or cover and chill up to 1 day. If chilling, let sit at room temperature 1 hour before grilling.Step 3Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Lightly oil grate. Grill chicken, breast side up, over indirect heat, undisturbed, until browned and lightly charred underneath, about 20 minutes.Step 4Turn chicken breast side down and move over direct heat. Grill, turning often and returning to indirect heat as needed, until well-browned, cooked through, and an instant-read thermometer inserted into the thickest part of a thigh registers 165° and into thickest part of breast registers 160°, 15–20 minutes. Transfer chicken to a cutting board and let rest 5 minutes.Step 5Brush scallions with remaining 1 Tbsp. vegetable oil and grill, turning occasionally, until charred in spots, 6–8 minutes. Transfer to a cutting board and thinly slice.Step 6Mix scallions, garlic, chiles, vinegar, soy sauce, sesame oil, remaining ½ tsp. white pepper, and remaining ½ tsp. brown sugar in a small bowl.Step 7Carve chicken and arrange on a platter. Serve with charred scallion sauce for spooning over.How would you rate Five-Spice Spatchcocked Grilled Chicken?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleExcellent! Followed Mag’s oven version below and roasted baby potatoes in the skillet with the chicken. Paired it with roasted Leeks (instead we of scallions) and asparagus and doused with the vinegar sauce!\n\nAdding this one to the rotation! B&DDC,USA1/27/2022This is a fantastic recipe that I will return to time and time again.  The flavors were perfectly balanced (please, please don’t skip on the MSG), and the sauce was a perfect compliment. We served our chicken with steamed jasmine rice and Chinese broccoli. \n\nHowever, right as we were about to grill, there was torrential downpour, so we had to pivot. I ended up roasting it in a cast iron skillet in the oven. 500-degrees for the first 25min, and lowered the oven to 450-degrees for the remaining 20min to slow the browning a bit. \n\nCan’t wait to try this on the grill, but the roasted chicken was incredible. Mag LundholmChicago, IL9/3/2021This was delish and will make again. A welcome change to my standard roast chicken. I followed the recipe exactly and used my new Traeger grill it came out just perfect with crispy skin and juicy flavorful meat, the sauce puts it over the top. I served with a kale salad & roast shiitake mushrooms, grated carrots and a peanut butter dressing as well as blistered green beans with garlic & ginger. The meal was a hit. Thanks Bon Appetit !Chef RachelleNYC 8/4/2021This chicken is so fragrant while cooking and filled with flavor to eat! I have been wanting to try spatchcocking chicken for a while and this recipe just sounded appealing. It was not difficult to prep the chicken and it came out so moist and delicious! I could not find the five spice in my area (rural NC) so I made my own by grinding the spices together. It was such a hit with my family and neighbors that we will be using this recipe for a neighborhood get together! Dr. LizNorth Carolina 7/19/2021Explore Bon AppétitChickenPoultryScallionOnionVegetableSummerMainDairy-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Jessie Yuchen"]}