{"id": "7582c710a36a41370f2be56d7e01482f", "url": "https://www.bonappetit.com/story/pot-of-beans-meal-prep", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "How I Turn a Pot of Beans Into a Week of Dinners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow I Turn a Pot of Beans Into a Week of DinnersEditor in chief Adam Rapoport shares his bean strategy for making a pot on Sundays and repurposing them in multiple recipes.By Adam RapoportOctober 9, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.All beans are magicAs my 10-year-old might say, I’m a total noob when it comes to cooking beans. I am the opposite of your Italian nonna or Mexican abuela. I can never figure out when to add the salt or exactly how much. I always ask myself if I should include something porky to make the beans tastier—or is that cheating? I struggle to find that sweet spot between just enough time on the stove and way too much.I have all sorts of question but not a lot of answers. So I keep trying. Yesterday morning, I wandered to the market looking to buy a pound of bacon for breakfast and wound up buying a pound of beans. I got in my head that I wanted to be meal-prep guy—make something all-purpose on Sunday and enjoy it throughout the week.Want this letter before it hits the website? Sign up for our newsletter!And what is more all-purpose than a pot of rich, brothy beans? Infused with garlic and onion, meaty and satisfying, even if there is no meat in the pot.Because I didn’t have the time to soak the dried beans overnight, I employed the brilliant Bon App power-soak method. I covered them with water, brought them to a boil, and then covered the pot with the heat off for at least half an hour, and drained them. When I was ready to cook, I added a charred Vidalia onion and a halved head of garlic to the beans, and sprinkled in a fair amount of salt, ignoring everyone who tells me never to add the salt ‘til the end. When I listen to them, my beans never taste like anything.Photo by Alex LauFor this go-round, I used the exceedingly flavorful charro beans from the Mexican-inspired 2M Smokehouse in San Antonio as inspiration. The recipe calls for pinto beans, but I used Rancho Gordo cranberry beans, which I consider a close relative. (Oh, and Rancho Gordo—by far the best beans you can buy. Go online and order some now.) After the beans simmered for about an hour, I sprinkled in some onion powder, garlic powder, and glug or two of pureed tomato from the fridge. I tasted to see if the beans were salty enough, knowing that as they sat, the flavors would marry and deepen.And then I did what my friend Roo, a bean enthusiast, always tells me to do: not a thing. Just let them mellow. I splashed some olive oil on top because, as Amiel Stanek likes to say, beans love salt and fat. To which I say: who doesn’t?Photo by Alex LauSo, I’ve got a pot of beans. Now what? I know that at some point this week, I will make a stripped-down version of Bon App’s beans and greens pasta or my favorite weeknight creamy, tomato-y pork and beans pasta, using leftover beans instead of canned. Both also call for crumbled Italian sausage but, honestly, if you make really good beans, the pasta doesn’t need it.On Wednesday, when my wife is out with her girlfriends, I will make breakfast for dinner. I’ll fry up some eggs in olive oil ‘til extra crispy, heat up some beans, and warm some Vista Hermosa flour tortillas, which are by far the best store-bought flour tortillas I’ve found. I’ll slice up an avocado and some lime wedges and grab a bottle of hot sauce, and I will be a very happy solo diner.Alex LauFinally, if I’m feeling ambitious as the week crawls on, I will make Rick Martinez’s refried beans. And I’ll serve them up at a long, lazy breakfast next weekend.Oh, and because a pound of beans always makes more beans than you think, I tucked away a pint in the freezer. A month or two from now, on one of those nights when I have nothing in the fridge but don’t want to order in, I’ll know exactly what I’m having for dinner.Get some bean recipes:Cuban-Style Black BeansBrothy BeansCharro BeansRigatoni with Sausage, Beans, and GreensPork and Beans PastaOlive Oil-Fried EggsRefried BeansExplore Bon AppétitBeanAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Adam Rapoport"]}