{"id": "75897f12bd15c81ed60cffd26447fbda", "url": "https://www.bonappetit.com/recipe/winter-white-salad", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Winter White Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWinter White SaladBy Molly BazFebruary 10, 20204.0(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintWinter months might not give us as much vibrant produce to look forward to (yes citrus, we see you), but cold-weather fruits and vegetables have their own hidden joys. Take advantage of the monochromatic monotony of winter and turn whatever is available into a chic and crunchy shaved winter salad. Even the creamy, tangy dressing fits the pale vibes—but without sacrificing flavor.Ingredients4 servings¾lb. mixed winter white vegetables (such as cauliflower, fennel bulbs, daikon radishes, and/or turnips)2white endive, leaves separated1Asian pear or firm Bosc pear, halved lengthwise, cored, thinly sliced3oz. Piave cheese, shaved1Tbsp. extra-virgin olive oil1tsp. finely grated lemon zest3Tbsp. fresh lemon juice, dividedFlaky sea saltFreshly ground black pepper½cup whole milk yogurt¼cup mayonnaise1garlic clove, finely gratedKosher saltPreparationStep 1Trim stems of vegetables. Cut out core of cauliflower (if using). Thinly slice vegetables crosswise about ¼\" thick.Step 2Toss vegetables, endive, pear, and cheese in a large bowl. Add oil and 1 Tbsp. fresh lemon juice; season with sea salt and pepper. Using your hands, toss salad until well coated. Chill (uncovered is fine) while you prepare the dressing.Step 3Whisk yogurt, mayonnaise, garlic, lemon zest, and remaining 2 Tbsp. lemon juice in a small bowl; season with kosher salt.Step 4Arrange about one-quarter of salad on a large platter. Drizzle some dressing over, letting it fall into the nooks and crannies of the vegetables. Add another one-quarter of salad; drizzle with dressing in same manner. Repeat with remaining salad and dressing. Season with kosher salt and pepper.Step 5Do Ahead: Dressing can be made 1 day ahead. Cover and chill. Vegetables can be sliced 1 day ahead. Wrap in wet paper towels, place in a resealable bag, and chill.How would you rate Winter White Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made this for an NYE dinner with steak au poivre and fondant potatoes and it was an excellent complement to a festive dinner. I halved the recipe, subbed blue cheese for the Piave, and used cauliflower as the winter white veg. The dressing is exceptional! It's great as-is for a more elevated dinner, but to make it weeknight-friendly in the future I'll likely simplify by making the dressing with a pile of mandolined cauliflower and sliced almonds or other things I more typically have on hand. LauraPhiladelphia1/3/2021This salad is very satisfying. The dressing is simple yet elegant and packs a nice punch. I have modified it before for my in-laws, who are barely accustomed to eating garlic at all, by adding some garlic powder. Worked great. I have made this salad 4 times now and its always great. Hail Molly.josiesappWY5/11/2020Such a unique recipe that feels refreshing and comforting at the same time. Would be beautiful at a dinner party too. Made just a few modifications here such as adding small white beans and replacing piave with blue cheese. AnonymousBrooklyn2/27/2020Explore Bon AppétitSaladEndiveChicoryLeafy GreensVegetableAsian PearFruitYogurtOther IngredientsWinterEasySideGluten-FreeNut-FreeVegetarianNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-10", "author": ["Condé Nast", "Molly Baz"]}