{"id": "75b61a0b348cf64eb6cf0c59967c425d", "url": "https://www.bonappetit.com/recipe/short-ribs-slow-roasted-in-coconut-milk", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Short Ribs Slow-Roasted in Coconut Milk Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueShort Ribs Slow-Roasted in Coconut MilkBy Chris MoroccoFebruary 13, 20185.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyEmailPinterestPrintEmailPinterestPrintIn this riff on Indonesian beef rendang, the meat is cooked in coconut milk until it breaks up into gloriously rich jammy solids and delicious fat. Our hands-off method delivers on two counts: It browns the beef, then cooks it until the meat is fall-apart tender. A low oven temp is crucial: It allows the coconut milk to gradually evaporate until it’s thick and saucy.Ingredients4 servings⅓cup unsweetened coconut flakes3lb. 1½–2\"-thick cross-cut beef short ribs (flanken style; well-marbled works best)Kosher salt2lemongrass stalks1shallot, chopped4garlic cloves2red Fresno chiles or jalapeños, seeds removed11\" piece ginger, peeled, finely grated113.5-oz. can unsweetened coconut milk1Tbsp. curry powder1cup cilantro leaves with tender stems2Tbsp. fresh lime juiceSteamed white rice (for serving)PreparationStep 1Place a rack in middle of the oven; preheat to 250°. Spread out coconut flakes on a rimmed baking sheet and toast until golden, 10–15 minutes. Let cool.Step 2Meanwhile, season beef generously with salt and set aside. Trim top three-quarters from lemongrass stalks and place top portions in a large cast-iron skillet or heavy roasting pan. Peel outer layers from root end and finely grate into a blender. Add shallot, garlic, chiles, ginger, coconut milk, and curry powder; purée until smooth.Step 3Arrange short ribs, bone side up, in skillet; pour purée over. Roast until meat is halfway to tender and liquid is reduced by two-thirds (it will look slightly oily and broken, and this is exactly what you want), 3–3½ hours. Turn ribs onto their sides and continue to roast, adding water by ¼-cupfuls if liquid in skillet looks in danger of burning or getting very dark, until meat is fork-tender and liquid is a jammy glaze, 2–2½ hours longer.Step 4Toss coconut, cilantro, lime juice, and a pinch of salt in a small bowl. Top short ribs with gremolata and serve with rice.How would you rate Short Ribs Slow-Roasted in Coconut Milk?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWhen I roast the ribs, do I cover them with foil? Sounds like a long time to roast uncovered and likely to get dry 🤷‍♀️LuluMelbourne, Australia7/17/2021Luscious.  Tastes so good it feels like you probably shouldn't be eating it!\nAnonymousTexas10/24/2020Made this last night for 6 of us and we all devoured it.  Only added a few more chillis and served it with Pad Thai.  The left over beef will be shredded in big chunks and added to rice with the sticky jammy saucy leftovers.  Honestly one of the best and most spectacular flavours we've eaten in a while.  Definitely making this again and will share the recipe with family members. Tracy WilkinsonAustralia 9/11/2019For a nice occasion, these short ribs on rice were perfect. Making them was a fun experience. Fun to braise something in southeast asian ingredients. SO good to eat, too. AnonymousCalifornia3/24/2019i'm no fan of coconut in savory dishes; it just detracts, for ME.  so this recipe caught me by surprise.  when i can next afford short ribs, i will look to this recipe for the garlic, ginger, lemongrass, chilies (WITH seeds), and ALL THAT CILANTRO!!! -- that will be HEAVENLY!hollis5Vero Beach, FL3/16/2019OMG this was incredible. Since I was a dummy and didn’t read through the instructions before starting (5+ hours!? Holy crap) I seared the ribs first than cooked at 350 for 45min before covering and cooking at 300 for another 2 hours. I made coconut rice to go with. It feel off the bone, the fat was delicious and edible. Oh man I’ll be making this again. Also!! Just quickly cook the sauce on the stove top at the end if it hasn’t gone jammy yet to bring the oil and solids back together.bigelow_katelouiSan Francisco 10/15/2018Very good.   If you own a high end blender like a vitamix, skip the grating of lemon grass and just blend everything.    DO get RED Chilis for this.    I used a green jalapeño and flavor wise it was great but presentation suffered.    One pepper works for those wishing to keep spice levels down.      Gremolita was good.   I suggest using it at the table rather than sprinkling over whole dish.   AnonymousNJ3/22/2018Explore Bon AppétitRibsShort RibBeefMeatCoconut MilkOther IngredientsOne-Pot MealsMainGluten-FreeKetoBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}