{"id": "75bc5cd10c3722f7d7eed605414f1974", "url": "https://www.bonappetit.com/story/giada-de-laurentiis-pantry-staples", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "The 6 Pantry Staples Giada De Laurentiis Can't Live Without | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 6 Pantry Staples Giada De Laurentiis Can’t Live WithoutHidden anchovies, spicy chili paste, and artisanal pasta, of course.By Alyse WhitneyApril 17, 2018FacebookTwitterEmailFacebookTwitterEmailGiada De Laurentiis’ pantry is stocked as well as a gourmet Italian grocery store. The Food Network star keeps her shelves lined with the best olive oil, artisanal dried Italian pasta, and jars upon jars of mix-and-match ingredients and condiments to throw together dozens of recipes on the fly.The first chapter of her latest cookbook, Giada’s Italy ($21 on Amazon), outlines her Italian pantry and essential fridge ingredients (copious amounts of Parmiggiano-Reggiano and Finocchio salami), but she spoke with us to share the specific brand of Calabrian chili paste she keeps on hand, a buttery olive she’d eat day and night, and more.In addition to her pantry staples, her weekly grocery shop includes lemons, chicken breasts for her cat and dog (Bella and Bruno—yeah, she cooks them homemade food), arugula, bananas, green grapes, fennel, salami and cheese packs for daughter Jade’s lunch, dried pasta, broccoli, and of course her new Simply 7 popcorn. Check out her favorites below, and then maybe take a good hard look at your pantry—is it Giada-worthy?1. Lucini Extra-Virgin Olive Oil“I eat olive oil with almost everything—from my oatmeal in the morning to salads to cooking with it, there’s no such thing as too much olive oil,” she explained over email. There is olive oil in the majority of recipes in the book, and this basic olive oil can be used for all of them. Whether cooking, raw in dressings, or a drizzling to finish, use Lucini—it’s that good.Buy Lucini Extra-Virgin Olive Oil for $17 on Amazon.Your shrimp cocktail doesn’t look as good as the Spicy Calabrian Shrimp from Giada’s Italy.\nAubrie Pick2. Tutto Calabrian Chili PasteOlive oil 2.0 is when it’s filled with crushed dried chiles. De Laurentiis will throw it into everything from pasta sauces to stews to dressings for a bit of mellow heat. “One jar will last a long time,” she reasons for its slightly-elevated cost. (You can also make it yourself, FYI!) One of her favorite ways to use it is a roasted Italian version of shrimp cocktail. Mix 1 lbs. large shrimp with 2 Tbsp. olive oil, 2 tsp. Calabrian chile paste, 1 tsp. Lemon zest, ¼ tsp. Dried oregano, ¼ tsp. Kosher salt, 1 Tbsp. lemon juice, 1 Tbsp. chopped basil, ½ cup Parmigiano-Reggiano cheese and marinate for 10 minutes, and then roast at 425° for 8–10 minutes.Buy Tutto Calabria Crushed Hot Chili Peppers for $15 on Amazon.3. Amore Anchovy PasteWe all have that friend who proclaims, “I hate anchovies!” when a Caesar salad hits the table. If you want to trick them, just use anchovy paste—De Laurentiis likes the affordable-but-powerful Amore brand. “Anchovy paste adds a certain salty, depth of flavor that is hard to replicate with any other ingredient. Bonus: It easily dissolves right into oil so people don’t even have to know it’s there,” she raves. Unlike anchovy fillets, which need heat to dissolve, paste can be whisked easily into a creamy dressing or room-temp sauce. A good conversion is ½ tsp. paste to every fillet listed in a recipe, something she notes in her crispy chicken thighs with peppers and capers recipe.Buy Amore anchovy paste for $8 (two tubes) on Amazon.The simple crispy chicken thighs with peppers and capers from her book get extra flavor from hidden anchovies.\nAubrie Pick4. Mutti Canned Cherry TomatoesThese tomatoes are also a fan-favorite of the BA test kitchen, and De Laurentiis prefers them over a blended canned tomato sauce. “They are perfect for pasta—they’re more flavorful and give the perfect touch of sweetness.” She also uses them in her farro and white bean minestrone rather than large whole peeled tomatoes to speed things up.Buy a 12-pack of Mutti canned cherry tomatoes for $46 on Amazon.5. Setaro Dried PastaBecause not everyone has time to make fresh pasta on a weekend, let alone a weeknight. De Laurentiis calls Setaro “one of the best dried pastas on the market” because “it has the perfect chewiness and, when cooked al dente, tastes just like fresh pasta,” she said. She appreciates pappardalle, which can stand up to a hearty spicy lamb ragù, as well as small orzo that makes a 15-minute flavorful weeknight dinner with clams, fennel, orange zest, and jarred piquillo peppers.Buy Setaro dried pasta for $10 from Pennsylvania Macaroni Company.Dishes that De Laurentiis describes as “la dolce vita” take longer to cook, but are worth it, like her lamb bolognese.\nAubrie Pick6. Castelvetrano OlivesDe Laurentiis eats these bright green olives from Sicily around-the-clock for the “buttery flavor that is more sweet than briny.” Her favorite olives are perfect for snacking, salads, sauces, or chopping into a rosemary-olive tapenade to top sliced fried potatoes and goat cheese. That’s olive, folks.Buy a 7 oz. jar of Castelvetrano olives for $5 on Thrive Market.An ideal way to consume more Castelvetranos:Photos reprinted from Giada’s Italy. Copyright © 2018 by GDL Foods Inc. Photographs by Aubrie Pick. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitGiada De LaurentiisGroceryShoppingItalianRead MorecultureGiada De Laurentiis Gets RealBy Christina ChaeyGiada De Laurentiis Has the Best Pasta Sauce Idea We’ve Ever HeardBy Elyssa Goldbergrecipes64 Italian Dishes for When You Want Pasta and So Much MoreGallery64 SlidesBy Nico AvalleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Alyse Whitney"]}