{"id": "75cf07296488f581e3609e942b913713", "url": "https://www.bonappetit.com/story/homemade-natural-wine", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "My Pandemic Hobby is Making Natural Wine in My Jersey City Apartment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Pandemic Hobby Is Making Natural Wine in My Tiny ApartmentSome people got puppies, some got pregnant, and I got grapes.By Keelan HigginsMarch 10, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailLast summer I returned to my rural Massachusetts hometown on a mission: to make my own natural wine, with “nothing added, nothing taken away.” For months I’d watched friends embrace ambitious new hobbies to keep busy during the pandemic (DIY home improvement, shibori tie-dye, and who could forget all that sourdough). I figured if people have been making wine using only grapes since the beginning of time, why couldn’t I give it a go in my Jersey City apartment?My mom reminded me that Black Rabbit Farm, around the corner from our house, operates a sprawling minimal-intervention, noncertified organic vineyard on its 10-acre lot. After a quick email exchange, I found out that for $50 , they could sell me a bushel of Marquette (a hybrid red grape that descends from Pinot Noir). Before heading back to Jersey City, I drove down the road and found a large black crate waiting for me, piled high with beautiful bunches. I’d only felt excited a handful of times during the pandemic, but this moment topped my list. Some people got puppies, some got pregnant, and I got grapes.Though I had plenty of experience drinking natty wine, I hardly knew a thing about creating any from scratch. I watched an introductory YouTube video by No-Till Growers about making natural wine at home and scoured r/naturalwine on Reddit. I learned that after picking and macerating the grapes, fermentation could begin so long as I had two elements: yeasts (which grow wild on the grape skins) and sugar (from the fruit). I also stocked up on the right equipment and studied Isabelle Legeron’s book, Natural Wine, which gave me a much-needed confidence boost. Legeron, a Master of Wine, emphasizes the importance of patience in the process; natural vinification is ultimately about trusting healthy grapes to do their thing.After my research and a visit to a local homebrew shop, I traveled back to Jersey City to fuss over my grapes there. I brought my grandmother’s six-gallon stoneware crock (a ceramic basin used for pickling and preserves). The homebrew shop set me up with six- and three-gallon carboys, two bungs, two airlocks, a steel funnel, cheesecloth, and a wooden spoon.That night I covered the floor with old rags and carefully combed over the entire bushel, adding only the healthiest clusters to the crock. To my horror, dozens of spiders crawled out from between the bunches. I screamed the entire time, but those spiders were actually a good sign; the grapes had been organically farmed and gently harvested, with minimal use of sulfur and lime to cope with western Massachusetts humidity. When my partner, Jason, and I finished sifting, I cleaned my feet, climbed into the crock, and started stomping grapes in my tiny apartment. I couldn’t stop smiling at the absurdity of the scene.Once the pulpy liquid was ready, I added just a few tablespoons of local honey to kick off fermentation, in case the wild yeasts needed a nudge (a move inspired by Zafa winemaker Krista Scruggs, whose wine blends often list maple syrup as an ingredient). Two days later the juice started bubbling. Before stirring the crock, I lowered my ear above the cheesecloth and listened to the happy sugar-feasting yeasts partying inside.On the seventh day I removed the skins and stems using a sterilized sieve and funnel, then “racked” (fancy winemaker talk for “transferred”) the juice into a clean,six-gallon carboy. Unfortunately, my wine only amounted to about 2.5 gallons, leaving a big gap of unfilled space in the container. Oxygen exposure can create off flavors, but my other options also seemed risky. If I topped off the jug with a store-bought Marquette wine, I might ruin the integrity of my flavors. But it felt equally risky to aerate the batch by switching to a smaller carboy. In the end I decided not to do anything and trust the grapes to lead the way.I sampled the juice every few weeks, often wondering if I’d accidentally produced a big vat of vinegar. Soon, though, I found lively notes of pomegranate and cranberry, along with an earthy finish that tasted just like the smell of the ground cover in my parents’ backyard. By early December the wine had become more robust, and I knew we were ready to bottle. I gathered my sanitized tools and returned to the apartment floor. We funneled the wine into glass bottles while in the background Bob Dylan’s rickety voice matched our shaky pours. For the finishing touches we hand-corked and labeled the 12 bottles, named in honor of the street I grew up on: Honey Pot Road.We celebrated with a toast. The intense flavor took me back to when I was a kid, playing in the dry New England dirt under a canopy of hemlock trees. I suddenly felt closer to that place, more than I had throughout the entire pandemic, more than when I was even physically there. I started this project because I wanted to learn about wine, from root to bottle. I didn’t expect to reconnect with the land where I grew up in the process. I made wine, and it tastes like home.Explore Bon AppétitHealthyishWinenatural wineGrapeessayRead MorecultureHow Long Does Wine Actually Last After It’s Opened?By Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-10", "author": ["Condé Nast", "Keelan Higgins"]}