{"id": "75d1c9cd3a45f4610d4ee2d68746481e", "url": "https://www.bonappetit.com/recipe/bucatini-alla-griccia-with-fava-beans", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Bucatini Alla Griccia With Fava Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueBucatini Alla Griccia With Fava BeansBy Evan FunkeMarch 17, 20203.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis recipe is from Evan Funke, chef-owner of L.A.’s pasta temple, Felix Trattoria. Think of this as carbonara minus the eggs but still with massive amounts of flavor from guanciale, black pepper, and Pecorino. The secret to Funke’s supremely creamy (yet creamless!) sauce? Vigorously stirring the pasta with a wooden spoon as soon as it hits the sauce. This coaxes out the starch and helps the noodles bind with whatever fat you’re using to create, as he says, a truly “groovy” dish. The method transforms this simple guanciale fat and hot water emulsion into glossy perfection.Ingredients4 servings1Tbsp. black peppercorns8oz. guanciale (salt-cured pork jowl)1¾cups fresh fava beans (from about \t1¾ lb. pods) or frozen fava beans1lb. bucatini2oz. Pecorino Romano, finely grated (about 1 cup), plus more for servingPreparationStep 1Place peppercorns in a bag, close, and coarsely crush with a rolling pin or heavy skillet (alternatively, you can crush them directly on a cutting board set inside a large rimmed baking sheet). Slice guanciale into ¼\"-thick slabs, then slice slabs crosswise into ¼\"-thick matchsticks.Step 2If using fresh fava beans, cook in a large pot of boiling salted water until just tender (the best way to gauge doneness is to check one; be sure to slip it from its skin before tasting!), about 3 minutes. Using a spider or slotted spoon, transfer to a bowl of ice water; let cool. Drain and peel away outer skin from each bean; discard skins. Reserve pot with boiling water for cooking pasta.Step 3Place guanciale in a dry large Dutch oven or other heavy pot and set over medium-high heat. Cook, stirring often with a wooden spoon, until golden brown and crisp, about 5 minutes. Add crushed peppercorns and stir once to combine. Add 1 cup hot tap water (using pasta cooking liquid here could make the dish too salty) and bring to a boil. Remove pot from heat and stir mixture aggressively to emulsify. Let sit until pasta is done.Step 4Return reserved pot of water to a boil and cook pasta, stirring occasionally (if using frozen fava beans, add about 2 minutes before pasta is done), until al dente. Drain pasta and fava beans.Step 5Add pasta, fava beans, and 2 oz. Pecorino to pot with guanciale and set over medium-low heat. Cook, stirring vigorously and adding more hot tap water if needed, until saucy and pasta is coated, about 2 minutes.Step 6Divide pasta among bowls and top with more Pecorino and ground pepper.How would you rate Bucatini Alla Griccia With Fava Beans?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleWe're making this tonight! But just FYI - this isn't the complete recipe. Can you please add for others that don't have the physical magazine? Thanks! AnonymousBrooklyn, NY5/29/2020Rest of the recipe, from the magazine:\nAdd pasta, fava beans, and 2 oz. Pecorino to pot with guanciale and set over medium-low heat. Cook, stirring vigorously and adding more hot tap water if needed, until saucy and pasta is coated, about 2 minutes. Divide pasta among bowls and top with more Pecorino and ground pepper.ClaraExploresIdaho5/20/2020*GriciaAnonymousChicago4/8/2020I thought if I leave it a bad review the whole recipe will get posted lol. I will adjust my review as soon as the recipe is full and I can make this dishAnonymousVancouver,BC3/31/2020This is not a review but a question.  You ask for 1 cup of cheese (plus extra for topping), but do not say what to do with it.  My guess is that it was supposed to be added, with the pasta, to the guanciale pot and blended into the oily sauce.  If so, or if used differently, can you correct the recipe?  I doubt it is all just topped onto the pasta.AnonymousAstoria, NY3/29/2020Explore Bon AppétitPastaItalianEuropeanGuancialeCured MeatMeatSpaghettiPasta & NoodlesFava BeanBeanVegetablePecorinoCheeseBucatiniSpring5 Ingredients or FewerMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Evan Funke"]}