{"id": "75d2d9518ff883c5f5cf3cca1af92829", "url": "https://www.bonappetit.com/story/cheryl-day-southern-baking", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "Cheryl Day Just Wrote the Definitive Book on Southern Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCheryl Day Just Wrote the Definitive Book on Southern BakingTreasury of Southern Baking is bringing pineapple cakes and Black history to your kitchen.By Chala Tyson TshitunduOctober 26, 2021FacebookTwitterEmailPhotograph by Christopher Testani, Food styling by Victoria Granof, prop styling by Alex BrannianFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Baking in the American South is more than just a holiday season endeavor or casual hobby–it is a staunchly storied way of life. If your family tree is rooted in the Deep South like mine, you have strong opinions on which auntie makes the best banana pudding and whether or not sugar belongs in cornbread. Even if you’ve never set foot on Southern soil, you’ve probably been lucky enough to try some of the region’s most iconic dishes, like flaky buttermilk biscuits, crumbly peach cobbler, and fluffy sweet potato pie (which is miles better than pumpkin pie; you simply cannot change my mind).But Southern baking–like most of the region’s historic foodways–is more than just an amalgam of timeless treats: Many of the South’s most cherished baking traditions are vestiges of the lives and livelihoods of enslaved Africans and their descendants. Black women, in particular, originated many of the innovative recipes that the white women they cooked for would publish and profit from. This whitewashing erased generations of Black women’s contributions to Southern culinary culture, a long legacy that chefs and food historians are working to fully uncover to this day.While many conversations on Southern baking still tiptoe around this complicated history, Back in the Day bakery co-owner and Southern Restaurants for Racial Justice cofounder Cheryl Day is here to set the record straight: “We are the creators of this cuisine,” Day tells me, holding my Blackness in tandem with hers for a brief moment. “I want [Black] folks to be really proud of the fact that Southern baking is something that we created.” Day’s pride in her craft and heritage shines brightly through the pages of her newest cookbook, Cheryl Day’s Treasury of Southern Baking, out November 9.Cheryl Day's Treasury of Southern Baking$40 $37 at Bookshop.org$40 $34 at Amazon“This book would not have been possible without the millions of enslaved laborers who worked in the fields, plantations, and kitchens of the United States,” Day writes in the book’s dedication. “My great-great-grandmother Hannah Queen Grubbs was born enslaved in 1838 and was among the women who created many of these Southern recipes.” Featuring over 200 original and adapted scratch-made recipes beautifully captured by food photographer Angie Mosier, Cheryl Day’s Treasury of Southern Baking is a masterful work, bringing centuries of Southern food, hospitality, and culture into homes across America and around the world.“I consider my heritage, my ancestors, and the recipes that were passed down to me some of my greatest treasures,” Day tells me. As the title implies, Treasury of Southern Baking is an invaluable trove of collective knowledge representing Day’s two greatest passions: food and history. “There were so many recipes I wanted to include, and it just kept growing and growing,” she says of the extensive recipe selection process. “I talked to all the people in my community, looked through my vast collection of cookbooks, and came to the decision that these are anything that you would ever want if you are a Southern baker.”Photo by Angie MosierWhen Cheryl Day says “anything that you would ever want,” oh, boy, does she mean it. Drawing inspiration from vintage cookbooks, old church bake sale ledgers, handwritten family recipes, and more, Treasury of Southern Baking is a master class in making memorable baked goods. Heck, three of the book’s 13 chapters are dedicated to cakes alone, drawing distinct lines between gathering cakes (the kind usually made on a sheet tray for picnics and baby showers), layer cakes (those gorgeous gals stacked high and slathered with frosting), and loaf and Bundt cakes (like this decadent, ganache-enrobed sweet potato number).If you’re looking to satisfy more than your sweet tooth, don’t worry. Beyond the cakes, pies, cookies, and other confections that make up the bulk of the book, Treasury of Southern Baking also features a hefty helping of savory recipes, from spicy jalapeño corn sticks to whole wheat mushroom hand pies to, yes, four kinds of biscuits. “If you’re a Southern baker, you need more than just one biscuit recipe,” Day says matter-of-factly.As educational as it is expansive, Treasury of Southern Baking sprinkles informative sidebars throughout its chapters; there’s a guide on cake-decorating techniques, a cheat sheet on hosting with Southern hospitality, and even a step-by-step process for peeling ripe peaches with precision. “I didn’t want you to have to pick up another book,” Day says. “If you were interested in the craft of Southern baking, I wanted it to all be in this book, and I feel like we accomplished that.”At its heart, Treasury of Southern Baking celebrates the most important ingredient of all, as cheesy as it may be: love. “Southern food is a mélange of cultural influences,” Day notes in the book’s introduction. “Tastes and flavor profiles vary from region to region, and yet it all represents love and treasured memories of our mosaic heritage.”While her skill and expertise with Southern baking are made evident by the book’s breadth alone, Day’s dedication and love for the craft–and for the Black women who birthed it–set this towering tome apart from every baking book I’ve ever read. “This is a way for me to pass on the legacy of our ancestors,” Day says, her exuberance echoing over the phone. “It’s really the book that I wish I always had, and I am just excited that I am the person to bring this forward.”Bake like Cheryl Day:Sweet Potato Loaf Cake With Dark Chocolate GanacheThis tender, gently spiced cake enrobed in dark chocolate ganache requires that you make your own sweet potato purée. And yes, it’s absolutely worth it.View RecipeApple-Rose PieBreak out the vanilla ice cream and tuck into a slice of this fun, floral take on the classic apple pie.View RecipePineapple Upside-Down CakeThe retro classic pineapple upside-down cake gets an instant upgrade with sophisticated, fruity Luxardo cherries.View RecipeMini Baked AlaskasThese showstopping miniature baked Alaskas are as foolproof as they are impressive, plus every easy-to-make component can be made ahead of time.View RecipeLavender-Lemon Crinkle CookiesIf the joy of frolicking in a field of flowers could be captured in a cookie, it would be these crackly, chewy lavender-lemon crinkle cookies.View RecipeExplore Bon AppétitLifestyleCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-26", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}