{"id": "75fb26ee2bc92e24c208fb94682b9449", "url": "https://www.bonappetit.com/story/vegetarian-travel", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "How Vegetarian Travel Is Possible Without Losing Your Mind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Travel Abroad as a Vegetarian Without Losing My MindYes, I'll eat fish sauce.By Sarah JampelJuly 3, 2019FacebookTwitterEmailPhoto by Slim AaronsFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.My greatest shame—and biggest secret—as a nearly lifelong vegetarian is that once every two months or so, I eat fish. And most often, it’s because I’m somewhere that’s known for its seafood—like a fancy restaurant or a shoreside lobster shack in Maine.I’m sure that a lot of you are thinking that these occasional forays into the sea mean that I’m can’t call myself a vegetarian at all. Which, okay, fair enough. But humans are complex, and labels are simplistic—our imperfect-but-necessary linguistic methods for translating that complexity into words. I say that my seafood consumption is a shameful secret because I know that diehard vegetarians will no longer consider me one of them. But I’m not ready to give up that part of my identity for those four or five “special situation fish” per year.Throughout my life, what it has meant to be a vegetarian has grown as I have. When I first stopped eating meat, I was simply a six-year-old lemming, blindly following my older sister in her thoughtful decision. When I was in elementary school, I loved animals and had approximately 30 pig stuffed animals, none of whom I could imagine as bacon. In middle school, my dietary habits set me apart from my group of friends; it was cool. When I was in high school, college, and young adulthood, vegetarianism finally became a more informed decision: If I didn’t have the time, energy, or financial resources to source my meat and fish in an environmentally responsible way, I wouldn’t eat it.My decision to eat fish wasn’t spontaneous or random—it was spurred by travel, curiosity, FOMO, and all of the exciting, uncomfortable feelings that come with putting yourself in an unfamiliar environment. I was on a trip to Japan with three friends, the furthest from home I’d ever been, and we were lucky enough to eat at a handful of hushed and elegant omakase restaurants. At that point, it had been at least 15 years since I’d had fish (had I ever had fish?), but it seemed silly to have traveled halfway around the world, to a place I probably wouldn’t return to for years and where fish is treated with incredible care and attention, and turn away piece after piece of sashimi. So I dove in: red snapper, tuna, salmon, eel...I ate it all.And even though a large part of my identity was called into question (NBD), I had one of the most carefree, fun, and well-rounded trips of my life. Instead of obsessing about every meal, worrying whether I’d find something to eat at a fish-heavy restaurant or if I could convince my friends to trek to a veg-friendly spot, I was able, for practically the first time in my life, to go with the flow. I had set my limits—no meat—but I had also opened up enough to feel like I could begin to experience at least some of what Japanese food is renowned for. The trip didn’t make me a regular fish-eater—it didn’t even make me want to try seafood on my next vacation—but it did help me to rethink how I eat when I’m traveling internationally.Here’s what works for me: First, I try to decide what I’m going to do ahead of time, before I leave. It doesn’t need to be a written manifesto, but it does help me to mentally prepare if I’ve set my boundaries prior to departure. Plus, if I’ve decided for myself, I can also better communicate my needs to my travel partners (no, I don’t need to find a special restaurant; no, I’m not okay with eating street food that, 80:20 odds, contains pork; yes, I’m fine with bonito).Then, I learn the words for what I won’t eat or, if pronunciation is hopeless, write them on an index card (or in a note in my phone) so that I feel ready to communicate. I accept the answers I get and decide if risking a mistake is worth it to me.I’ll also do a lot of research ahead of time. In some cases, that might mean choosing to go to countries that are particularly vegetarian-friendly (spending time in India and Indonesia, for example, was fairly easy) or specific subsets within a cuisine that are meat-free, like temple food in Japan. In other instances, it’s browsing restaurant menus ahead of time or finding food tours or cooking classes that accommodate vegetarians. I decide which out-of-the-way veg restaurants seem worth my time (the vegan ramen place in Tokyo Station, for example) and if there are any nearby sights or activities that would make the special trip even more worthwhile.And, most importantly for me personally, I let some things go. When I went to Vietnam, I accepted that fish sauce was going to be nearly unavoidable. It was one less ingredient to worry about, and it seemed like a small concession to make compared to how many dishes became permissible. A whole world opened up when I stopped crossing any dish seasoned with fish sauce off my list.Oh, and I bring snacks!  I’ll pack energy bars so that I can feed myself in desperate times and I’ll make a stop at a convenience or grocery store for a selection of packaged items (the advantage being that it’s usually at least a little easier to figure out what ingredients they contain).These tips help me relax when I’m traveling and focus less on what I’m eating and more on what I’m seeing and learning, but obviously it’s all about the individual: If you’re a vegetarian because of allergies or religious scripture, you’re not going to be loosey-goosey, no matter what. I talked to a kosher friend who said just thinking about eating pork made her upset; my other vegetarian friend went to Taiwan and, to her knowledge, had no fish—even in flake or sauce form—the whole time. You get to decide what being a vegetarian means to you and how that changes depending on where you are in life and the world.As for me, I’ll eat bonito flakes in Kyoto if it means I can eat more miso soup. And, at least in my mind, that doesn’t make me any less of a vegetarian when I get home.Explore Bon AppétitHealthyishThe Not Depressing VegetarianessayRead MoreLifestyleWhy It’s Terrible to Be a Vegetarian at a Wedding (And How to Make It Better)By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Sarah Jampel"]}