{"id": "75fde18a97a074c0944e5fa8b65f2e3c", "url": "https://www.bonappetit.com/story/drunk-elephant-serum", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Drunk Elephant’s D-Bronzi Serum Works Great As Long As You Mix It Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDrunk Elephant’s D-Bronzi Serum Works Great As Long As You Mix It RightUse this stuff right and you'll look glowy—not greasy.By Deanna PaiOctober 3, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIf you’re reading this, you’ve probably heard of Drunk Elephant. Because whatever instinct steered you to a website called Healthyish probably also led you to this “it” healthyish beauty line. Free of controversial ingredients like silicones, drying alcohols, and fragrances, Drunk Elephant was one of the first brands to hit the skincare scene, and it surpassed the competition quickly after.Do a quick Google-search for “Drunk Elephant reviews” and it’ll pull up pages and pages of gushing testimonials and breathless “I tried it!” blog posts. Unlike other natural skincare brands, which often skimp on science, founder Tiffany Masterson created the brand to be both clean and clinical, meaning the products still pack a punch. All you have to do is feel the tingle of the T.L.C. Framboos Glycolic Night Serum to know that that stuff is working.So I was eager to take the D-Bronzi™ Anti-Pollution Sunshine Drops, which launched this summer, out for a test drive. (Plus, I need to troubleshoot my dark olive skin, which in the winter turns so sallow that I look like I’m one Bloody Mary away from jaundice.) If you can get over the name “D-Bronzi™ Anti-Pollution Sunshine Drops,” which took me a week because I knew I would have to type it multiple times, you then have to go through the work of trying to understand what, exactly, this is. Is it self-tanner? Antioxidant serum? Bronzer? All of the above?Technically, it’s a bronzing serum, which means that it has the deep, nutty color of a serious bronzer paired with, yes, an antioxidant serum. There are also hydrating fatty acids and peptides in the formula, which are beneficial for all skin types. But, even so, the anti-pollution benefits touted in the name seem like more of an afterthought. (It’s a nice afterthought! But it’s still an afterthought.) That’s partly because the pigment is so concentrated that it looks and acts far more like a makeup product than skincare.Masterson says you can mix the D-Bronzi™ Anti-Pollution Sunshine Drops (ugh) with a number of things, like other serums, oil, sunscreen, or moisturizer. I first mix it with my moisturizer, and am immediately impressed by how sheer and subtle the glow-enhancing effect is, as though I spent a three-day weekend on an alpine hike. It also gives my skin a dewy finish, which I’m very into—until I remember that I still have to put on sunscreen. The SPF blurs out most of the sun-kissed color, and I’m back to square one.The next day, I mix it with my sunscreen. I usually wear sunscreen that’s fairly liquid in texture, meaning it blends in easily and never looks chalky. But the sunscreen and bronzing serum together make me look a little too dewy, like I ate a Whopper Junior with cheese late last night and now, in the early light of dawn, all of the grease is finally emerging from my pores. And I already have oily skin! No, thank you.Finally, I go off-label and combine it with my foundation. (It’s IT Cosmetics Your Skin But Better CC+ Cream Oil-Free Matte with SPF 40, in case you too emit more grease than a drive-thru window.) The matte, oil-free foundation blends seamlessly with half a pump of the D-Bronzi™ Anti-Pollution Sunshine Drops. The resulting mixture gives me everything I want: glowing skin, a fresh finish, and just enough coverage to trick people into complimenting my skin. And protection against pollution, I guess.I really like the D-Bronzi™ Anti-Pollution Sunshine Drops now that I’ve figured out how to pair it. It’ll take some experimenting for you, too, since everyone’s routines and skin types vary. Find the right delivery method, and you’re golden.Buy it: D-Bronzi™ Anti-Pollution Sunshine Drops, $36All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleI Love This Turmeric Brightening Mask Despite Its Unfortunate ColorBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Deanna Pai"]}