{"id": "7612a58b998d147d737cacf7c94ab107", "url": "https://www.bonappetit.com/recipe/easy-flatbread-with-cauliflower-and-tofu", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Easy Flatbread with Cauliflower and Tofu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEasy Flatbread with Cauliflower and TofuBy Chris MoroccoDecember 26, 20184.5(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintChef Josh McFadden’s crazy-simple yogurt flatbreads from Bon Appetit’s August 2015 issue inspired this whole-grain version. It pairs with just about anything you can think of. Make sure to use conventional (i.e., not Greek) yogurt, otherwise the ratio of dry to wet ingredients will be thrown off. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servingsFlatbread½cup whole wheat flour¾tsp. kosher salt¼tsp. baking powder⅓cup all-purpose flour, plus more for dusting½cup whole-milk yogurt (not Greek)Cauliflower and Tofu2Tbsp. ghee or extra-virgin olive oil, divided½medium head of cauliflower, cut into florets1small red onion, cut into wedges through core2garlic cloves, crushedKosher salt, freshly ground pepper1½\" piece ginger, peeled, finely grated½tsp. ground turmeric½14-oz. block firm tofu, cut into 1\" pieces2Tbsp. golden raisinsToasted sliced almonds and dill (for serving)PreparationFlatbreadStep 1Whisk whole wheat flour, salt, baking powder, and ⅓ cup all-purpose flour in a medium bowl. Stir in yogurt. Transfer dough to a clean work surface and knead until mostly smooth, about 1 minute. Divide into 2 pieces and wrap with plastic. Let rest 15 minutes to let dough relax.Step 2Working one at a time, roll out dough on a lightly floured surface, sprinkling dough with flour as needed to prevent sticking, to about ⅛\" thick.Step 3Heat a medium cast-iron skillet over medium-high. Cook flatbread until underside is golden brown and puffy with a few charred spots, about 2 minutes. Turn and cook on other side until golden brown, about 1 minute. Transfer to a plate, then repeat with remaining dough.SabziStep 4Heat 1 Tbsp. ghee in a large Dutch oven or pot over medium-high. Add cauliflower in a single layer and cook, undisturbed, until golden brown underneath, 4–5 minutes. Toss and continue to cook, tossing occasionally, until still crunchy but browned in spots, about 4 minutes longer. Add onion, garlic, and remaining 1 Tbsp. ghee. Cook, tossing occasionally, until vegetables are halfway to tenderness, 8–10 minutes longer. Season generously with salt and pepper, then add ginger and turmeric. Cook, stirring constantly, until fragrant, about 1 minute. Add tofu, raisins, and 1 cup water. Bring to a simmer and cover. Cook, partially covered, until cauliflower is tender and liquid is reduced by about half, about 10 minutes. Season with salt and pepper.Step 5Arrange vegetable mixture on a platter. Top with almonds and dill. Serve with flatbreads alongside.How would you rate Easy Flatbread with Cauliflower and Tofu?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleCauliflower review only:  Loved this recipe. Cauliflower was no so popular at home  and now we make this recipe very often.  Haven´t made de flatbread yet, but are looking forward to make it soon!  yadfrancMexico City5/6/2020Cauliflower-only review. Followed the recipe almost:  I had to sub out regular raisins for the golden ones (they actually added some visual appeal) and I changed out the almonds for pistachios. I used olive oil instead of ghee plus 1/2 teaspoon of salt and 1/4 teaspoon of pepper.  At the end of cooking, I gave it a taste and really felt it was lacking something. I added a couple teaspoons of butter (gasp!) and a generous squeeze of lemon and a sprinkle of salt. I garnished with fresh dill, which I felt added a nice layer of flavor.  If I had initially used ghee, maybe I wouldn't have felt the need for butter.  I will make this again, using my modifications.Sunglasses56Fishers, Indiana4/13/2020This was pretttttty good, perfectly fine for a weeknight meal but it's not going on my list of things to make again. The process for the cauliflower mixture seemed overly complicated, and if I made it again, I'd follow another reviewer's process of just roasting everything together. My garlic cloves got completely burnt by the end of cooking, so I had to take them out of the final mix. However! The flatbread was super easy and fun to make. Make sure you let the cast iron pan preheat for a few minutes before setting the dough in there - I always jump the gun on that, and my first flatbread wasn't quite as nice as the second one turned out after the pan was good and hot. Overall this was a good dinner, but too complicated.soapnanaChicago, IL2/28/2020Another flatbread-only review. Wow!!!  So simple to make, and it wowed everyone who ate it. I did a mad improvisation with sour cream instead of yogurt (I was out), and it was still great (if obviously sour). kirsplashSan Jose, CA12/17/2019This review is for the flatbread only: the recipe is just as easy as promised, and really yummy. I made it exactly as described, except added a bit of ghee to my cast iron pan when cooking (why not?). I made some spicy yellow dal and used the flatbread to scoop it up. I actually think you could easily get 3 flatbreads out of this recipe--they're very filling!AnonymousNew York, NY3/11/2019This was OK.  Not may favorite. You really need to increase the recommended amount of spices.  On top of the turmeric I added 1/2 tsp of curry.  A good chutney would be a delicious additive.  I need to cook the flatbread at a lower temperature and dust off any surface flour.  You cannot try to use low fat yogurt.  I did that the first time i made it and the full fat is necessary.  The second batch was also helped by my Kitchenaid and dough hook.  I like the suggestion to add herbs belowAnonymousNJ2/7/2019I only made the flatbread, but I’ve already made it twice in 24 hours! It came together super easily and is super customizable. I kneaded in garlic, thyme, and rosemary and it was delicious.AnonymousBerkeley, CA1/20/2019Flatbreads are my obsession. Since yogurt is the only wet ingredient at first the dough may feel a little dry, but just spend some time kneading it and be generous with your AP flour when rolling the dough out into discs! Also, I added some cooking time to my cauliflower and tofu because they weren't quite soft at 10 minutes. eschultzBonAppetit.com1/8/2019This recipe is amazing for a weeknight dinner! The flatbreads might take a little extra time if you've never made them before, but overall it's really easy, delicious and so filling! Would recommend this for a dinner party too. AnonymousToronto1/6/2019I made this in a sheet pan (400F for 40 minutes) and it was outstanding—exact same ingredients minus the water and used cilantro instead of dill.Morgan ChessiaBoston1/5/2019Explore Bon AppétitFlatbreadBreadCauliflowerVegetableTofuOther IngredientsWhole Wheat FlourFlourYogurtEasyStarterSnackVegetarianHealthyishFryBakingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}