{"id": "761ab2887a92266af90d04171f26e678", "url": "https://www.bonappetit.com/recipe/hot-honey-chicken-with-fried-bread-and-bitter-greens", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Hot Honey Chicken Thighs with Fried Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueHot Honey Chicken Thighs with Fried BreadBy Andy BaraghaniFebruary 13, 20184.7(12)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintChicken fat does triple duty in this weeknight dinner recipe to yield crisp skin, golden toast, and a schmaltzy dressing. When cooking the chicken, we start with a cold pan because it encourages gentle, thorough rendering of the tasty fat, which you’ll use for the bread and greens. Keeping the thighs skin side down the whole time allows the skin to get extra crispy while the flesh cooks through.Ingredients2 servings1garlic clove, finely grated2Tbsp. fresh lemon juice, divided4skin-on, bone-in chicken thighsKosher salt¼cup honey1small red chile, thinly sliced into rounds2Tbsp. extra-virgin olive oil2½\"-thick slices of bread2small endive, leaves separatedPreparationStep 1Preheat oven to 450°. Mix garlic and 1 Tbsp. lemon juice in a medium bowl to combine. Pat chicken thighs dry with paper towels and place in bowl. Season with salt and toss to coat. Let chicken marinate at room temperature at least 20 minutes and up to 1 hour.Step 2Meanwhile, bring honey and chile to a bare simmer in a small skillet over medium-low. Let hot honey cool.Step 3Drizzle oil into a large heavy skillet, preferably cast iron, and place chicken thighs, skin side down, inside. Set over medium-high heat and cook until skin is golden brown underneath, 8–10 minutes. Transfer skillet to oven and bake chicken until cooked all the way through, 16–20 minutes. Pull chicken out of the oven and move to a plate. Save those pan juices in the skillet, though.Step 4Place skillet with juices over medium heat and add bread. Fry bread until nicely toasted and golden brown, about 2 minutes per side. (You’re essentially making a large chicken fat–doused crouton here.) Transfer bread to paper towels to drain and sprinkle with a bit of salt.Step 5Toss endive in a medium bowl with remaining 1 Tbsp. lemon juice and a drizzle of fat from skillet (if the pan is scorched or the drippings are all gone, use olive oil instead), season with salt, and toss to coat.Step 6Tear the bread in half and poke it with a paring knife to create a few holes (this will help the bread soak up the chicken juices). Arrange on plates and top with chicken thighs. Scatter endive leaves around and drizzle some of the hot honey over the chicken (and the endive if you want).Alex LauStep 7Do Ahead: Chicken can be marinated 1 day ahead. Cover and chill.How would you rate Hot Honey Chicken Thighs with Fried Bread?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleLoved the flavours and simple to throw together.  Belinda New Zealand1/24/2022Ah this is so good! I'm so glad I stumbled across this recipe. I'm trying to pace myself and not make it twice/week. Easy and so delicious.Just_JessSt. Louis6/2/2020We've made this 3 or 4 times now.  My 9 year old begs for it.  Relatively fast and easy plus extremely tasty.TXHuskerTexas5/13/2020Didn’t have endives but it didn’t matter. The thighs cooked perfectly and the hot honey/toast combo was delicious. Whole family enjoyed!!Bona coursiNew Jersey 4/4/2020My family and I loved this! I had a specialty green Chile Pistachio honey that I bought in New Mexico, so I used that instead of the red Chile honey, but it was fantastic. The bread and endive made it!!Augusta61New Orleans1/24/2020Loved this recipe! I was only able to find dried red chiles at the market, so I rehydrated one by boiling water, removing it from heat, and then soaking the chile in the hot water for 30 minutes before slicing. My honey sauce had a nice bite to it, so I'd say it worked. I used a miche sourdough bread - and it went great with it.AnonymousMichigan8/20/2019An excellently balanced dish between the sweetness of the honey, spice of the chiles, richness of the chicken, sour of the lemon, and bitterness of the endive. This will definitely be in my normal rotation. I used sourdough bread and thought it worked wellAnonymousChicago5/8/2019AMAZING recipe!AnonymousColleyville, TX5/4/2019SO. GOOD. You have to make this. Seriously. I've long been a big fan of hot honey, and this did not disappoint. I added a bit of chili powder to the honey for an extra kick, and it was great. The fried bread was just as good as you'd imagine -- you really can't go wrong with bread, hot honey, and chicken fat. The skin on the chicken was wonderful, and the endives provided a welcome coolness and crunch to the dish. Totally recommend.AnonymousBerkeley, CA2/10/2019Explore Bon AppétitChickenPoultryChicken ThighChileVegetableMainDairy-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Andy Baraghani"]}