{"id": "7620517ea606d27c36fdf717e32fed63", "url": "https://www.bonappetit.com/story/buffalo-chicken-pizza-recipe", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "This Buffalo Chicken Pizza Recipe Is the Collaboration of the Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Buffalo Chicken Pizza Recipe Is the Collaboration of the YearHalf Buffalo chicken wings. Half pizza. This is a joint venture between the tastiest foods we know.By Alex DelanyMarch 9, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSome Venn Diagrams are more interesting than others. The Venn Diagram you made in second grade that compared amphibians to reptiles (Both cold blooded! Wow! Neat!) is slightly less interesting than a diagram comparing pizza and Buffalo wings. Because in the middle of that diagram, you have a modern miracle. Buffalo chicken pizza.Buffalo chicken pizza might seem like some kind of monster, dreamt up in a stoner’s laboratory, but while it is certainly not traditional, it is 100% certified to be delicious. When we talk about cravings, the spicy, creamy, salty, cheesy flavors of Buffalo chicken pizza are what we talk about. It somehow manages to incorporate about three too many gratuitous ingredients and still be better for it.We decided to give in to our cravings and develop a recipe for a cast-iron, Buffalo chicken pizza, one that’s easy to make and uses store-bought dough and already-cooked chicken (or rotisserie) for an extra, cozy layer of convenience.After proofing (a crucial step to phenomenal homemade pizza), the dough is thrown into a ripping-hot, pre-heated cast-iron pan and piled with exactly what you’d expect: Buffalo sauce, a mixture of mozzarella and blue cheese, and chicken tossed in the same Buffalo sauce. It all melds into one fatty, crispy, spicy, melty, savory piece of art.A preheated cast-iron skillet is the secret to this pizza’s success.\nNo nutritionist has ever recommended that you eat Buffalo chicken pizza. There’s a reason that this recipe wasn’t published on Healthyish, and that reason is called Buffalo sauce. Our Buffalo sauce is a mixture of butter, hot sauce, marinara sauce (an atypical addition in our recipe), and cream. Like we said...not super healthy. It’s an extremely flavorful sauce that battles with the blue cheese sauce you drizzle over the pizza at the end. Oh. We haven’t told you about that yet.Yes. More sauce. So much delicious sauce. As a final step, we drizzle a mixture of blue cheese, yogurt, lemon juice, garlic powder, water, and celery salt (essentially homemade blue cheese dressing) over the pizza and shave some celery (a vegetable!) on top. The crispness of the celery and acid in the dressing liven up the cheesy, saucy pizza below.If you love blue cheese, really lay that stuff on, but if you don’t, go lighter. Make sure to leave some extra blue cheese dressing and buffalo sauce to dip your crust in. Because everyone knows plain crust needs...a little something.Get the Recipe:Buffalo Chicken PizzaTwo beautiful bar foods in one pizza package. Inspiring.View RecipeExplore Bon AppétitPizzaBuffaloBlue CheeseMozzarellaChickenCast ironRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-09", "author": ["Condé Nast", "Alex Delany"]}