{"id": "762254f5c0efded4ef1ff1776fc54ac4", "url": "https://www.bonappetit.com/recipe/hot-honey-butter", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Hot Honey Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueHot Honey ButterBy Claire SaffitzJanuary 9, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintUse a hot sauce that isn’t just heat and vinegar but has a personality of its own. We like Frank’s. Serve it with this classic skillet cornbread—and see more Super Bowl recipes here.IngredientsMakes about ¾ cup½cup (1 stick) unsalted butter, cut into pieces, room temperature3tablespoons honey1tablespoon hot sauceGenerous pinch of kosher saltPreparationStep 1Vigorously whisk butter, honey, hot sauce, and salt in a medium bowl until smooth.Step 2Do Ahead: Butter can be made 8 hours ahead. Cover and store at room temperature.How would you rate Hot Honey Butter?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGreat with Valentina!KatiehwalshAustin4/10/2020This is very good. I used the Green Chilulua sauce. Addictively sweet and hot. Minneapolis, MN1/19/2019Explore Bon AppétitCondimentEasySideGluten-FreeNut-FreeVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Claire Saffitz"]}