{"id": "762c929f921530fdb1ccdea70f425fec", "url": "https://www.bonappetit.com/story/meditation-bus", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "I Spent an Entire Day on a Meditation Bus and It Was Very, Very Quiet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Spent an Entire Day on a Meditation Bus and It Was Very, Very QuietThe wheels on the bus go \"Ommmmm.\"By Rachel Sugar May 8, 2018FacebookTwitterEmailIllustrations by Gabriel AlcalaFacebookTwitterEmailOn a freezing morning in mid-March, I woke up with the sun to take the subway to Midtown Manhattan to meditate on a bus. When I boarded just after 8 a.m., I was the only aspiring meditator there. The walls and ceiling were plastered with LED strips of color-changing lights that glowed in soothing, geometric patterns, and a diffuser puffed out a micro-mist scented with lavender, sage, and ginger.The bus is the brainchild of Carla Hammond, who worked in international relations non-profits before spreading the gospel of meditation full-time. When Hammond got her hands on it, the shuttle bus had upholstered seats and overhead bins, but now it’s a “mobile meditation studio,” a 27-foot-long, 7-foot 4-inch-wide sanctuary on wheels. The idea was to deliver everyone a space and the time to just be—Be Time, Hammond calls it—like a food truck, only with inner peace instead of tacos.Through the miracle of soundproofing, it is possible to forget you are sitting cross legged in the middle of Manhattan; the only noise is standard-issue “relaxation music,” which creates a pleasant impression of a New Age spa. At the back of the bus, an enormous circle of colored light emanated from a dark, mirrored wall. “The oculus [represents] the third eye of consciousness, or the center of focus for meditation,” Hammond explained.“I’ve been trying to let the students really feel what they need,” said Dana Nalven, one of the instructors. She demonstrated how the lights can change colors with a click of her remote. Blue is popular, she said, because it’s “ocean-y, and very spacious,” but when we scrolled through the rainbow, I felt a strong affinity for the pinks. Later, once class started, we shifted into purples.Eventually, Hammond hopes to have a whole fleet of meditation buses, parked throughout the city, offering meditative respite in easily accessible, 15- or 30-minute slots ($11 or $22 a pop, respectively). I had imagined that the bus would be moving, and I would meditate to the gentle thrum of traffic, the way other people are lulled to sleep on boats, but all classes take place when the bus is parked. As for location, anywhere with a commercial parking space is a possibility; in New York City, that’s pretty much everywhere.Hammond discovered meditation at 15, when her mother took her on a Siddha Yoga retreat in Mexico City. “I had no idea what I was getting into,” she said. But it clicked. “I’m like, ‘Whoa, this is really deep stuff’.” But the reason Be Time exists is because of what she’d seen what meditation can do for others. After training mid-level government officials and UN ambassadors in genocide prevention, and teaching financial literacy to Hispanic immigrants, Hammond worked for a non-profit that provided after-school mindfulness and meditation classes to underserved high school kids across Brooklyn. “The transformation in these kids was crazy. Like, amazing,” she said.. Their focus got better and their grades went up; they seemed to fight less. “That’s something that meditation really does provide,” Hammond said. “It gives you a little space between something that’s happening and how you choose to react to it.”Be Time offers five different half-hour classes, plus some 15-minute “Quick Resets,” focused on different meditation techniques drawn from an encyclopedia of traditions, including Buddhist metta meditation, mindfulness meditation, and mantra meditation. “Be Creative” leans on guided visualization, loosely based on yoga nidra. “Be Love” fosters compassion by “bringing your attention back to the energy of the heart.” I think of myself as being extremely nice, but am also angry all the time. Also, my mother was visiting. I could have used some Be Love.“People think to effectively meditate, your mind has to be blank,” Hammond said. “On the contrary, the magic happens when you’re focusing on your breath and you notice that you’re having a thought, and you’re like, ‘Okay, there’s a thought,’ and you don’t judge it. And in the moment that you realize that you’re having a thought, you go back to your breath. In that instant, that’s when the magic happens.”We sat cross-legged on our cushions with our weighted blankets and were told to breathe deeply and visualize heart-related things. We were supposed to think of someone we were grateful for. I did. I also thought about Law and Order: Special Victims Unit, whether it made sense to go to Target later, what I would eat for lunch, and an upcoming trip to Los Angeles. Nalven told us to gather up a source of tension and sit with it, letting it build before releasing it. It felt great. I'd been stressed about a job thing, and I was still stressed about the job thing, but the stress felt more external, more separate from me, and therefore less overwhelming. Then I worried I would have to do this regularly.The next class, Be Here, was harder. We breathed in. We breathed out. We visualized, paying attention to different parts of our bodies. There was more guided breathing, and more silence, so much silence. We exhaled down into the ground, and while I had some nice images of tree roots, I also wanted to jump out of my skin, but just a little bit. It is, as they say, “a process.”When I exited the bus, I was surprised to find I was still in Midtown, even though we had discussed this fact several times. Did I feel different? Maybe! Then a man cut in front of me at the drugstore, and I spent the next 15 minutes brooding. I am still me. It’s still a process. But in the weeks since, I have thought about the bus often. I have Googled weighted blankets. And, late one night, I downloaded a fancy app to help me meditate. Later, when I checked my bank statement and discovered I’d accidentally agreed to pay for an entire year of fancy app-based meditation, I was very calm about it. They might be onto something.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleHow Meditating Before Eating Changed My Relationship With FoodBy Perri Ormont BlumbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Rachel Sugar"]}