{"id": "762fcba8d865d71e9df0d2db229df25d", "url": "https://www.bonappetit.com/story/july-horoscopes-ben-jerrys-ice-cream", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "July Horoscopes: Which Ben & Jerry’s Ice Cream Are You? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJuly Horoscopes: Which Ben & Jerry’s Ice Cream Are You?Find your future in a pint of ice cream, where you knew it was all along.By Catherine UrbanJuly 1, 2018FacebookTwitterEmailIllustration by Oscar Bolton GreenFacebookTwitterEmailThe sunburns are out, and the horoscopes need to cool down. That’s why the theme this July is Ben & Jerry’s ice cream flavors. This isn’t sponsored, there are just SO MANY FLAVORS. And you can definitely ~find yourself~ at the bottom of an empty ice cream pint. If not there, where? See which flavor is paired with your Zodiac sign below—as if you needed another incentive to go out for ice cream right now.Illustration by Oscar Bolton GreenAriesYoung at heart and naturally restless, you prefer to be on the move at all times. Time has gone by waaay too fast and this month, you’ll realize how much you miss that one friend. Plan as many group activities as possible this month so you can reconnect with friends, family, and old coworkers you haven’t seen in awhile. Convince someone to join you for a paddleboard adventure down the river! A day filled with people you love will make you feel most at home. A day filled with outdoor activities will also make you sweaty and hungry. Grab a pint of Salted Caramel Almond—creamy vanilla bean ice cream marbled with salted caramel and roasted almond slivers—it’s the perfect match for a go-getter like you.Illustration by Oscar Bolton GreenTaurusLately, you’ve been more open to branching out of your comfort zone, well, to an extent. Like when you show up to a camping weekend with friends with a three-room tent, queen-size blow-up mattress, a Sodastream, and somehow, a wine fridge. No one is surprised, and they love you for this tendency to go all out.  And in this spirit of braving the unknown, you’re going to need to try the new Glampfire Trail Mix this month—chocolate ice cream swirling with gooey marshmallow and crunchy pretzel pieces. Like you, it’s ambitious and just a touch extra.Illustration by Oscar Bolton GreenGeminiSometimes it’s hard for you to make decisions with your mind all over the place. Looking ahead this month, you might be trying to plan your next vacation, but can’t decide between a tropical (though structured) yoga retreat and a more spontaneous trip to wander Iceland and see the northern lights. As a student for life, you love traveling because you can learn experientially, but this time you’ll have to decide which suits your needs better: structure or spontaneity. Encourage your split mind to unify by taking a spoon to a pint of Banana Split—smooth strawberry and banana ice cream expertly blended with walnut and a double dose of fudge. Yes, this ice cream will satisfy your restless desire to try ALL the flavors in life.Illustration by Oscar Bolton GreenCancerSince you are known for your impeccable memory, it’s no wonder that your birthday this month prompts you to reflect on the past year to take stock of everything you achieved. Nice 401k, by the way! Now it’s time to look ahead: should you pay off that student loan, or should you buy that glittery purple jet ski instead? Decisions, decisions. You’re willing to wait until something feels right. Regardless, you want to treat yourself now, and it is your birthday month. Give this new flavor a try, it’s Pecan Sticky Buns—brown sugar, cinnamon, and fluffy cream cheese. A mix of nostalgia and innovation, it’s ideal for someone like you who prefers familiarity, but still likes to explore their options.Illustration by Oscar Bolton GreenLeoYou’ll need plenty of time to clear your head this month, so hit the pavement, or the hiking trail, and walk it out. Ahh, so peaceful here. You won’t be able to resist asking your hiking buddy to take a pic of you in tree pose on a giant stump. And after a few more of these requests (you can’t help yourself), you’ll have the perfect shots for the IG (now for the filter and caption…). On your way home, pick the pint calling your name: Peanut Butter World—chocolate ice cream blended with peanut butter and chocolate cookie bites. Like you, this one’s personality is much more robust than its name lets on, it’s a lotta flavor in a little pint, but we know you can polish it off.Illustration by Oscar Bolton GreenVirgoYou’ll be feeling more antsy than usual this month, so (try to) get out of the hammock and put your running shoes on. But it might be difficult to gather motivation on your own, so sign up for something fun, like an ultimate frisbee team, or a summer pool membership. With your appetite roaring, lunge for the non-dairy Chunky Monkey. The signature swirl of banana ice cream (made with almond milk), walnuts, and fudge chips is not overly complicated or too sweet—sound like anyone we know? With a tendency to be mindful of your health, you’ve done the math and you reason that since it’s vegan and full of potassium, it’s perfectly okay to eat the entire pint for dinner.Illustration by Oscar Bolton GreenLibraYou’re good at getting what you want, especially this month, when you make friends with someone who has access to a boat—how convenient! And luckily, things seem to be smooth sailing for you this month. Your career will challenge you to grow, you’ll spend time with friends (that boat tho), and the stress of finding a new bathing suit will be NBD, for once. While your idea of happiness may not be the same for everyone else, well, there’s a pint made for everyone. For you it’s Americone Dream—patriotic pieces of fudge-dipped waffle cone woven in vanilla ice cream, sweet caramel and…the Stephen Colbert stamp of approval. Look at you, living the dream!Illustration by Oscar Bolton GreenScorpioIn an effort to make your house more of a home, oh resourceful Scorpio, you’ve been making adjustments, small and large. This month, you’re going to want to get your backyard game on point—you miiiight be trying to impress someone—from your luscious garden, to your firepit, and your slip ’n slide. To cool down, go for a classic pint of Cherry Garcia—tart cherry ice cream with goldmines of black cherries and fudge morsels. Let ice cream be your excuse to slow down and take a break from what feels like nonstop work; we know you don’t rest easy, but that’s what summer’s for.Illustration by Oscar Bolton GreenSagittariusYou’ve been undergoing a bit of a metamorphosis, and in this month’s chapter, you’ll be figuring out how to prioritize. You might choose roller-skating in short-shorts down the pier over doing your laundry (save it for a rainy day). You also might be feeling stir-crazy, TBH, and even though there’s plenty of things you could do, let your impulses lead you this time. Get out and explore your town. After the sunscreen wears off, maintain your chill with a scoop of Half-Baked—(partially in honor of your new tan lines) dueling chocolate and vanilla ice creams with baked brownie and cookie dough bites—just what you need to keep procrastinating that laundry.Illustration by Oscar Bolton GreenCapricornYou love perusing summer street fairs; between the music, people-watching, food trucks and artist booths, you get a few solid hours of entertainment. Relationships can potentially soar to new heights this month, so plan plenty of evenings that involve tables for two, shared desserts and romanticizing over-the-top ideas together.  Don’t forget to invite your partner along for a meandering walk that ends with ice cream. Split a not-so-subtle pint of Chubby Hubby. Love—as is common knowledge—blossoms around bites of fudge-dipped pretzels and peanut butter chunks.Illustration by Oscar Bolton GreenAquariusBlame Instagram, but you’ve weirdly become more self-aware lately and might be thinking a lot about your posture, or your resting you-know-what face. You’ll focus on trying to be a healthier, happier version of yourself this month (without taking away from your summer fun): grilling a ton of vegetables, getting into boxing, or diving deep into the world of foaming face masks. But don’t overthink it—you never get too uptight about anything. This is how you’ll find yourself with a pint of FroYo Chocolate Fudge Brownie. This flavor is off the charts in chocolate (and protein) to ensure you meet those 😉self-care 😉 goals.Illustration by Oscar Bolton GreenPiscesSummer concerts, outdoor movies, and fruit-related festivals are your scene. It doesn’t matter how many beers people splash in your hair because you know it’ll wash out later And for you, this is what life’s about: experiencing unspoken connections with others. This month, you’ll feel like you can do anything—crowd surf, make out with a total stranger, or get up on stage and dance (okay maybe not that far). Swim to the sidelines for a cone of Phish Food—gooey swirls of marshmallow and caramel with fudge fishies—a good reminder for a dreamer like you that your heart (and stomach) will rarely steer you wrong.Catherine Urban is a professional astrologer and writer who has already enjoyed several of these delicious pints throughout the writing process. work research. Check out more of her work here.Oscar Bolton Green is an illustrator in London. Check out more of his work here.Explore Bon AppétitFood HoroscopesIce CreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-01", "author": ["Condé Nast", "Catherine Urban"]}