{"id": "76332a8c3e5d7a4c3c9b38e4adc2978a", "url": "https://www.bonappetit.com/recipe/dutch-oven-no-mai-fan", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Dutch Oven No Mai Fan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueDutch Oven No Mai FanBy Peter SomOctober 19, 20213.6(19)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintNo mai fan (also spelled lo mai fan) is a Cantonese dish of steamed glutinous rice studded with lap cheong (Chinese sausage), mushrooms, and other savory bits. For Chinese American recipe developer and fashion designer Peter Som, it was a childhood favorite that has since become a staple on his Thanksgiving table. In place of the traditional clay pot, or “sand pot,” Som’s version uses a Dutch oven, which is ideal for keeping the rice warm until you’re ready to serve it. If you can’t find glutinous rice, also known as sweet rice or sticky rice, use all jasmine rice and add a few extra tablespoons of broth for a slightly stickier consistency. After cooking, let the rice sit, covered, for 10–15 minutes. (Using only jasmine will be a fair approximation, but it’s well worth seeking out glutinous rice for this recipe.) And while any brand of Cantonese cured pork will do for its distinctive sweet and savory taste, Som prefers Kam Yen Jan’s sausages.For the rest of Som’s Thanksgiving menu, see his recipes for Asian Pear Salad With Peanut-Lime Dressing, Roasted Brussels Sprouts With Gochujang Brown Butter, Sweet Potato Tian, Char Siu Wellington, and Milk Tea Bread Pudding With Crème Anglaise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonChinese Sausage$7 At Weee!Mesh Sieve$13 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonIngredients8 Servings1½cups glutinous rice1½cups jasmine rice3large shallots, thinly sliced4garlic cloves, finely chopped3Tbsp. grapeseed oil or vegetable oil4lap cheong (Chinese sausage, such as Kam Yen Jan), chopped1lb. shiitake mushrooms, stems removed, finely chopped¼cup dark soy sauce or 3 Tbsp. regular soy sauce plus ½ tsp. sugar2Tbsp. oyster sauce3cups low-sodium chicken brothKosher salt1cup thawed frozen peas½cup (packed) cilantro leaves with tender stems, plus more½cup sliced scallions, plus morePreparationStep 1Rinse glutinous rice and jasmine rice in several changes of cold water in a medium bowl until water runs clear. Drain well and set aside.Step 2Combine shallots, garlic, and oil in a small Dutch oven or large saucepan. Cook over medium-high heat, stirring occasionally, until shallots are tender and beginning to turn golden brown around edges, about 3 minutes. Reduce heat to medium and add lap cheong and mushrooms. Cook, stirring occasionally, until mushrooms are browned in spots, about 3 minutes. Stir in dark soy sauce, oyster sauce, and reserved rice.Step 3Pour in broth and season with salt; stir to combine. Bring to a simmer, then reduce heat to low. Cover and cook until rice is tender, 20–25 minutes.Step 4Remove pot from heat and stir in peas, ½ cup cilantro, and ½ cup scallions. Transfer rice to a platter and top with more cilantro and scallions.How would you rate Dutch Oven No Mai Fan?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleNeed to soak the glutinous rice overnight for it to cook evenly and thoroughly in the time frame in the recipe. There's also way too much dark soy sauce - it overwhelms every other component of the dish. After quite a few adjustments the dish came out pretty good but unfortunately the recipe itself is pretty flawed. AnonymousBoston, MA12/6/2021I followed the recipe exactly.  Didn't have a problem with the rice being crunchy.  I wish I had added the whole 14oz pkg of Lap Cheong instead of only half.  Cilantro was a must IMOPamAtlanta, GA11/15/2021Thank you for the previous reviews to avert disaster. I steamed the rice (3 c. of Jasmine rice) in 3 c. of chicken broth and steamed the lop cheung (Chinese sausages sliced) in a rice cooker on top of the rice so the rice was cooked and lop cheung were plump. I prepared the other remaining ingredients & lop cheung in a wok and then added the rice back in. It was ok... However, I would NOT use the dark soy sauce again–it makes the rice way too dark. I would use the light soy sauce instead. Since the recipe has so much soy sauce, I skipped the kosher salt. Not needed with the saltiness of the soy sauce. Next time, I will also skip the chicken broth. I don't think it adds much.nano Lsouthern New Jersey11/10/2021I second the previous review. Didn't anyone try this recipe prior to it going to press? More like a thick porridge with most of the rice remaining undercooked and crunchy. ScottPhiladelphia PA10/24/2021This recipe was very far from the picture and quite frankly a disaster. The glutinous rice made everything stick together, the image has the mushrooms whole instead of chopped and the sausage (which in the recipe is also said to be chopped but in the image its sliced) became soft after I added the chicken broth. The dish soaked up the broth pretty fast leading to the jasmine rice not being cooked while the sticky rice became a mush. I would definitely not make this again.Tati KIrvine, CA10/23/2021Explore Bon AppétitChineseEast AsianAsianSausageMeatDinnerRiceRice & GrainsWeeknightEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Peter Som"]}