{"id": "765169e66eba214a1ca6a6ef3eb0171d", "url": "https://www.bonappetit.com/recipe/molletes", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Molletes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueMolletesBy Rosalyn VeraMay 25, 20214.3(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintMy favorite thing about molletes is that they’re an open-faced blank canvas, as simple as they are flexible. This version has all the essentials, and makes for a hearty on-the-go breakfast, but can easily be dressed up to become the star of a fabulous brunch—add chorizo or bacon for a meatier variation, or summer squash blossoms or roasted poblanos for a lighter take. —Rosalyn Vera, Cocina Luchadoras, Baltimore, MDThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonPotato Masher$15 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 ServingsRefried Beans1cup vegetable oil2large onions, chopped215.5-oz. cans pinto beans, rinsed1bay leafKosher saltPico de Gallo1medium tomato, halved crosswise, seeds removed, chopped½small red onion, chopped2Tbsp. chopped cilantro1Tbsp. chopped seeded jalapeñoJuice of ½ limeKosher saltEggs and Assembly4Tbsp. salted butter, room temperature2telera rolls, bolillos, birotes, or other crusty rolls, halved lengthwise1lb. Oaxaca cheese, pulled into strings, or Monterey Jack, coarsely grated4large eggs, fried1avocado, thinly sliced⅓cup pickled or sliced red onionHot sauce (for serving)PreparationRefried BeansStep 1Heat oil in a medium Dutch oven or other heavy pot over medium. Add onions and cook, stirring, until just beginning to turn golden brown, 10–14 minutes. Stir in beans and add bay leaf. Cook, stirring occasionally, until beans begin to soften and fall apart, 9–11 minutes. Season beans with salt and remove from heat. Remove and discard bay leaf. Mash beans with a potato masher until smooth and spreadable.Do Ahead: Beans can be made 3 days ahead. Let cool; cover and chill.Pico de GalloStep 2Toss tomato, red onion, cilantro, jalapeño, and lime juice in a small bowl to combine; season with salt.Eggs and AssemblyStep 3Heat broiler. Generously butter cut sides of rolls and place, buttered side up, on a rimmed baking sheet. Broil until butter is melted, about 1 minute. Remove from broiler; spread ⅓ cup refried beans over cut side of each roll half and arrange cheese down center. Broil until cheese is melted and beginning to brown, about 2 minutes.Step 4Top each mollete with a fried egg, then pico de gallo, avocado, and pickled onion. Serve with hot sauce.How would you rate Molletes?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWe will use leftover refried beans, PICO DE GALLO, other items from tacos, Beef and cheese burritos, or carne asada meals to make these the next few mornings.  I would not use 1 CUP oil to thin out the refried beans however more like 1 Tablespoon.  Robin FoxLebanon Oregon 1/28/2022PLEASE fix your printing/formatting issues?  Does not print with a photo?  Photo would be nice...  Anonymous1/26/2022I love molletes  and they are very easy to make but this particular recipe I just don’t like  it’s too much oil  also you can use  Mexican blend cheese   Basically you can spread your bread  I like baguette  with refried beans add some cheese on top  bake the molestes until the ch melts then you can add any salsa. Maria México 1/9/2022Your recipes are fantastic!  HOWEVER, what is the reason there is not a PRINT icon OR when you highlight, copy, paste to save in order to print, the COPY is not READER FRIENDLY?  The QUANTITY measurements are ON THE RIGHT and not the left next to the ingredient..... easy to make a mistake with measurements.  Am I the only subscriber with this complaint about the format of your recipes?   AnonymousWindsor, CT12/27/2021Fantastic Brunch dish. I originally thought that was a lot of oil but it actually makes the beans very creamy. The layers make every bite delicious. The soft but crusty edged bread, creamy refried beans, runny egg yolk, slightly salty oaxaca, freshness of pico de gallo, avocado and tangy pickled onions. The textures blend really well. I’ve made it a few times. I added some Mexican chorizo the first time and that was also delicious. This recipe is a keeper!ShanPonte Vedra, FL8/13/2021One cup of oil is crazy!LucyZPleasantville, ny8/8/2021Does this recipe really call for 1 cup of oil for two cans of beans? Seems like a lot. Mia you other reicpies only. All for one tablespoon of oil per can of beans Jlstephens Nyc7/13/2021my god thay are so good .Anonymouslondon england 7/9/2021Explore Bon AppétitToastMexicanLatin AmericanEggCheeseMonterey JackAvocadoVegetablePinto BeanBeanTomatoJalapeñoChileRed OnionOnionQuickEasyNut-FreeVegetarianSautéBroilBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Rosalyn Vera"]}