{"id": "766251851fa4edd20ae32a5e8f6dcaee", "url": "https://www.bonappetit.com/story/no-more-free-kale-massages", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "No More Free (Kale) Massages | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNo More Free (Kale) MassagesSave your time for more important things, like scrolling through Westminster Dog Show photos.By Amanda ShapiroFebruary 20, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Kat BoytsovaFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’m both terrified and fascinated by what the internet thinks I want to buy, a.k.a. the ads that haunt me across Instagram and Twitter and seemingly everywhere else I browse. Last year around Valentine’s Day, I remember being particularly appalled by the number of lingerie ads flooding my screen. I blamed the patriarchy and heteronormative culture and made-up holidays that enforce outdated relationship models. Then I...bought a lot of lingerie. Like, a lot. Listen, it was a stressful period of my life! I wasn’t buying for the made-up holiday; I wasn’t even buying for my partner at the time. I bought all that lingerie because I was feeling uncomfortable—in my body, but really in my brain—and I wanted that feeling to go away.Not only were the ads ever-present, they were so—to use the marketing word—targeted. There were no airbrushed models in angel wings, no ribbons or poofs or other items that belong only on cat toys. There were people of all sizes. They were lounging on couches or patio furniture, not tropical beaches. They looked like they could be my friends...or me.I’d never given much thought to my underwear before. But as soon as I tried on that first blue bodysuit from that direct-to-consumer brand, I couldn't stop thinking about buying more. Did I buy an unconscionable amount of lingerie because these items made me feel better in my skin? Or because I couldn’t get the ads off my screen?Obviously both answers can be true. I discovered a new arena of fashion, one that really does make me feel beautiful...and I fell into a perfectly laid capitalist trap. Though, for what it’s worth, the deluge of ads came again this year, and I didn’t buy a thing. And now I've moved on to complaining about ads for spring clothes that I'm much too cold to wear.This kale doesn't need a massage to taste great.\nPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaOn Healthyish this week...Today we published an essay from Irina Groushevaia about going to bathhouses in Russia with their family as a kid, then re-discovering the tradition as a gender non-binary adult in Brooklyn. It’s a good reminder that there are so many spaces beyond public restrooms that are hard to navigate for trans and non-binary people. And that activities like going to the sauna aren’t all about luxury and indulgence: They can be about family, tradition, and mental and physical health too.And the Healthyish recipe of the week comes from Chris Morocco, who wants us all to let go of the misguided fantasy that raw kale is good, no matter how much you massage it in olive oil or citrus or whatever. For this recipe, Chris gives kale a quick char in a very hot pan, then soaks it in a green tahini dressing, mixes in some sliced citrus, and tops it with store-bought crispy shallots (though you could use a nut or a seed or anything else to give it some crunch). Chris wanted to call it a kale salad, but I put my foot down. The world doesn’t need another kale salad! In the end we compromised. We called the recipe Charred Kale with Citrus and Green Tahini and he got to use the phrase “no more free massages” on Instagram.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyle‘Miss Americana’ and the Most Buttery RiceBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-20", "author": ["Condé Nast", "Amanda Shapiro"]}