{"id": "7667bfbf8cc3efc87247ac78ee69a396", "url": "https://www.bonappetit.com/story/office-treats", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Office Treats Are a Perk. I Wish We Could Stop Freaking Out About Them. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Wish We Could Stop Freaking Out About Office TreatsPlease, it's time to chill.By Lauren LarsonJuly 2, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailMaybe your office has a treat table. If so, it’s probably located near an oft-traveled thoroughfare, like in the hallway between the busy conference room and the printers. It’s probably shielded from the boss’s office—as a rule, the boss rarely visits the treat table. The gravitational field of the treat table is so intense that people who have just entered the office for the first time can immediately identify it.I sat next to my office’s treat table from 2014 to 2016. Every day—every few hours, around the holidays—people wordlessly deposited their baked goods on the file cabinet that abutted my desk. I was working at a fancy magazine, so these were not your middle school bake sale brownies. These were investment treats: Dominique Ansel pastries, Levain cookies, Milk Bar truffles, and biscuits that had been flown in from Louisiana that morning. At first I felt very blessed. I had just moved to New York, and I liked that my new coworkers felt obligated to chat with me whenever they popped by to gorge. I also liked that I got first dibs on macarons.But quick as the eight-dollar croissant goes stale, sitting by the treat table got old. The catalyst of my discontent was not the baked goods themselves but the nervous ritual that accompanied them. It began to rankle me that the women in the office, in particular, rarely took a dessert from the table without narration. I’d become the backboard for their dietary anxieties, which in turn compounded my own dietary anxieties. “I’ve been so bad this week,” one would say to me, quartering a doughnut. “I did a Barry’s this morning,” another would tell me as she carefully scraped the frosting (!!!!) off a lavender cupcake. Some would eye the baked goods with the Lenten suspicion of the buttoned-up Comte in Chocolat, say “I can’t” with a tragic flair, and move on. Soon I started performatively fretting too. “I’m really balling out today,” I would say to nobody in particular, building a little Munchkin pyramid on a napkin. Since college (dietary dark ages) I’d worked really hard to repair my relationship with food; my sudden self-consciousness disappointed me.American women get a lot of mixed messages about desserts. I single out Americans because I’m writing this in Stockholm, where fika (“a coffee and cake break,” bless their hearts) is a hallowed, anxiety-free daily rite. I single out women because men seem to celebrate each other for grotesque and/or militant eating habits à la Jack Dorsey. For me, the minute calculation that occurs when faced with a plump, shiny croissant is much more confusing. I’ve been made aware that eating a burger on a date signals that one is a Cool Girl. I’ve also been made aware that to be a Cool Girl, one should be skinny.That I can feel bad for ordering an arm-sized burrito (too many calories) and for ordering a lil salad (too few Cool Girl points) is proof of the twisted logic inseminated in me by the patriarchy. [Throws bra onto bonfire, cackles as bra bursts into magnificent violet flames because of toxic materials used to cheaply approximate laciness.] In the same way, taking a second piece of birthday cake off the treat table is a choice fraught with meaning, and so is not taking any birthday cake. (Etiquette also plays a part here: Refusing a homemade baked good can be perceived as snobbery.) This Catch-22 has played out in particularly interesting ways online. A few years ago, so many influencers were posting photos of themselves “eating” junk food on Instagram that an account called @YouDidNotEatThat began aggregating the images. (“‘You Did Not Eat That’ Shames Skinny Women For Instagramming Food,” read a 2014 Huffington Post headline, an apparent death knell to the account.) We feel watched when we’re partaking in the wonders of the treat table because, more often than not, people—followers, coworkers—actually are watching.I’ve read several treatises on office baked goods that suggest not bringing them in at all. (I particularly love this one, in which a Canadian woman named Karen laments, of her dessert-bearing colleagues: \"I get mad at them. It's like 'What are you doing? Are we not friends?'\") That’s a sad solution—free baked goods are just below health insurance in my hierarchy of work perks.I know that we can be chill about the treat table. I saw it, once. During my tenure as treat table csar there was one woman who, when treats were present, would stop at the table, say “Ooooo,” take the proffered treat, and bound away. She was a well-adjusted glitch in the matrix, and her chill was contagious: When other people witnessed her taking treats with fret-free delight, they also took treats with fret-free delight, and, just like that, the performative shame pattern is broken. So next time you go in for a Munchkin power hour, know that you’re doing your office a small service. We’re not going to smash the patriarchy by approaching the treat table differently, but at least we can enjoy our sheet cakes in relative peace.Explore Bon AppétitHealthyishessayRead MoreLifestyleIs Your Wellness Practice Just a Diet in Disguise?By Melissa A. FabelloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Lauren Larson"]}