{"id": "76704d9f0d129f884080710b2024b178", "url": "https://www.bonappetit.com/story/just-buy-it-sheet-pan", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "The Best Sheet Pan Costs $20 and Will Last a Lifetime | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Only Sheet Pan You’ll Ever Need Costs $20 and Will Last a LifetimeThe BA Test Kitchen swears by this small-but-mighty baking tray.By Ali FrancisSeptember 15, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Is a kitchen really a kitchen if it doesn’t have a sheet pan (or five)? Metal baking trays are our workhorses, handling everything from cookies to roasted vegetables to entire sheet-pan dinners. Sure, you might think a bit of metal is just a bit of metal. How different can sheet pans be? But not all are created equal, and for a piece of kitchen equipment as vital as a baking tray, you’ll want to make sure you’re getting one that will serve you well and last for years.Our platonic sheet pan is no wallflower. We need it to be durable enough to use daily without warping under high heat, high-quality so that your food cooks exactly at the rate it should, and the right size to fit in most home ovens. For all that and more, we turn to the inimitable Nordic Ware Naturals Aluminum Half-Sheet. It’s the best sheet pan on the market—and the BA Test Kitchen’s agreed upon, all-time favorite.Nordic Ware Half-Sheet Pan$19.50 at Bon Appétit MarketWhy is the Nordic Ware Naturals Aluminum Half-Sheet our pick for best sheet pan?Our crowd-favorite baking sheet is made with high-quality, pure, uncoated aluminum, which conducts heat more efficiently and uniformly than aluminized steel (aluminum-coated steel) or stainless steel. This results in food that bakes evenly, rises predictably, and browns perfectly—meaning, when you put a tray of choc-chip cookies in the oven, they start baking straightaway on your aluminum sheet pan and stop baking as soon as you pull them out. Nobody likes a burnt-bottom biscuit! Conductivity is king!Made from heavy-gauge (read: thick) aluminum, these sheets are also our pick for durability. Metal expands when heated, and under extreme temperatures a thin, rimless baking sheet might turn into something that looks more at home in a sculpture garden than your kitchen. Something called a “reinforced encapsulated steel rim” is the secret weapon to making Nordic Ware’s baking trays virtually un-warpable. The edge of the aluminum tray is rolled around a rectangular frame of steel wire, which pushes against the four sides and keeps the bottom flat, making sure your pan stays level and absorbs heat evenly.This half-sheet is also mess-free! The one-inch high edge, like a dam levee, keeps olive oil from sloshing everywhere, sheet-pan dinner juices from spilling, rising dough from expanding off the edge, and crispy little veggie bits from ending up in bottom-of-the-oven purgatory. All of which makes for an easier cleanup later.The coziest little butternuts\nPhoto by Alex LauSo, what size pan should I buy? What is the difference between a sheet pan and a jelly roll pan and a cookie sheet? Help, I’m spiraling.Okay, so when it comes to sheet pans, size matters. Typically, we recommend a half-sheet pan, which is about 18x13\" and is big enough for most home cooks but small enough to fit easily into your apartment oven. Unless you are a commercial baker, when you read a recipe that calls for a sheet pan, this is the size in question.Nordic Ware Half-Sheet Pan$19.50 at Bon Appétit MarketFull sheet pans, the ones you see used in restaurant kitchens and commercial bakeries, are actually ginormous (26x18\") and won’t fit in most home kitchen ovens. But if you need to cook for a crowd, the Nordic Ware Big Sheet Baking Pan, at 21x15\", is your fighter. It’s 35% larger than the classic half-sheet pan and still fits most standard-size ovens. Made from aluminum, it’s a trusty pan that you can count on for the long haul.Nordic Ware Big Sheet Baking Pan$25 at Bon Appétit MarketQuarter-sheet pans also exist. At 13x9\", their surface area is half the size of a half-sheet pan’s, naturally, and they’re great for when you’re roasting a portion of small portion of veg, toasting nuts or seeds, baking a “I’m having a hard day” cookie for one, or storing meat in the fridge. For a small but mighty tray, don’t look past the Nordic Ware Bakers Quarter-Sheet Pans. They’re staples in restaurant kitchens and virtually guaranteed to make you a better, faster cook.Photo by Alex LauNordic Ware Quarter-Sheet Pans, 2-Pack$26 at Amazon$34 at Food52While cookie sheets are often referred to as baking sheets, there is a difference. At best, they have one or two slightly raised edges—like this Vollrath Wear-Ever Cookie Sheet Pan—but typically they are totally flat. This feat of design excellence allows hot cookies to slide off the tray easily without ruining their shape. But never, ever roast on these! They’re more susceptible to warping and your meat juices and oils will be very everywhere.Vollrath Wear-Ever Cookie Sheet Pan$26 at AmazonFor the pastry chefs among us: A jelly roll pan is another thing altogether. At 15x10\" in size, a jelly roll pan is larger than a quarter-sheet pan and smaller than a half-sheet pan. If you make a lot of roulades, go ahead and buy one rather than trying to scale up or down your recipes. Sure, they make for dainty spirals of sponge cake, but they’re also a great size for baking just about anything.Photo by Laura Murray, Food Styling by Pearl JonesNordic Ware Jelly Roll Pan$16 at Amazon$18 at NordicwareHow do I care for my sweet little sheets?Even without a nonstick surface (or an added nonstick coating), cleaning your sheet pans is easy, especially when you line them with parchment paper or a silicone baking mat prior to cooking. Before the initial use and after every use following, hand-wash your baking sheet with warm, soapy water. Aluminum cookware and bakeware reacts with acidic foods—like tomatoes and citrus—which can cause discoloration, darkening, corrosion, and pitting. It’s totally cosmetic and harmless, but if you roasted tomatoes and don’t like your new splotches, follow this more fastidious guide to cleaning sheet pans and they’ll be spiffy in no time. (Note: Using a dishwasher isn’t recommended; hand-washing is best.)Take good care of your sheet pans and they'll take good care of you.\nPhoto by Alex LauOkay that all makes sense…but what should I cook?The world, my friend, is your roasted oyster mushrooms (with polenta and thyme). Make a huge batch of the world’s easiest focaccia bread, then snack on it all week. Crack a bev and bake some hot honey wings! Roll out some crisp-yet-tender sugar cookies to remind yourself that there are still good things in this cursed world. Turn to any one of these 30 sheet-pan recipes for easy weeknight dinners that are even easier on the cleanup crew. One piece of kitchen equipment that does all this and more? That’s so metal.Oh sheet:Chipotle-Rubbed Chicken Sheet-Pan DinnerSweet-spicy chipotle chicken, zippy roasted tomatillo salsa, and spice-rubbed squash all on one sheet pan.View RecipeExplore Bon AppétitToolsBA RecommendsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-21", "author": ["Condé Nast", "Ali Francis"]}