{"id": "767313a16e6554f01c068041c8d66cc5", "url": "https://www.bonappetit.com/story/parmesan-grating-feud", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Broc-Bolo: Easy to Say, Easy to Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBroc-Bolo: Easy to Say, Easy to LoveDon’t think too hard about it.By Alex BeggsOctober 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Broc-bolo yoloFinally made Rapo’s Broccoli Bolognese, shortened to “broc-bolo” around the office because talking is hard. It was fantastic! Some readers hate that we called this “bolognese” because it’s not bolognese at all, but I don’t take things like “words” and “meanings” so literally. It’s a catchy name, you see what you get, it tastes good, and it comes together fast. And it’s pretty variable, if you consider yourself a visionary. I used bacon in place of sausage.So make it, why doncha: Broccoli Bolognese with OrecchietteWant this letter before it hits the website? Sign up for our newsletter!Christopher TestaniOh here we goI sneezed twice this week so I made Carla’s famous ginger brew. I like to dilute it on ice with seltzer, swap lemon for lime, and spike it with a flu shot.Brew it: Lemon-Ginger BrewButt-ernutMother Nature’s gifts are vast and varied, but one showed up in the Test Kitchen this week that was cracked and scary. A butternut squash that lived up to its name. “Send me your photos of the butt-ernut,” I asked the staff. What I received will haunt me for the rest of my days.Hi momDo you watch Healthyish’s weekly Instagram series, “30 Seconds with Andy”? If you’re interested in the skincare tips, bulging bicep secrets, and other self-improvement musings from Andy Baraghani, tune in! I know one person who never misses an episode, and that’s Andy’s mom, who DMs the Healthyish Instagram account with her supportive feedback. The love here is meant for Andy, but it’s received by all, especially our social media editors who could use a break from the snippy messages about why we’re not wearing hairnets (this isn’t Luby’s!). Some of Mama B’s words of encouragement: “U look amazing”, “Right on my love”, “this recipe is so good, can’t wait to make it”, and my favorite, “Why not serum first”. 💕💕💕Photo by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiSpeaking of AndyI made his tried-and-terrific lamb meatballs this weekend, and they still bang.Get the recipe: Lamb Meatballs with Raisin PestoPhoto by Alex LauSnack-ishThe best desk snack is a near 2-pound tub of Goldfish and I won’t take any other answers seriously!Read it: All the Snacks Bon Appétit Staffers Stash at Their DesksShould I talk aboutThe whiskey Tide pods? You know I hate giving into to trending stories manufactured by marketers in a sterile conference room, but if I have to, I have to. Glenlivet partnered with a swank London restaurant to make limited-edition cocktail “capsules” with a dissolvable seaweed wrapper that looks like a you-know-what. *Whispers Tide Pod* *Whispers Deathhhhh.* *Whispers condom full of Scotch.* Honestly? I’d try it. Moving along.Courtesy of Williams SonomaStar Wars x Le CreusetAfter I read this article about super fandom, I thought about the new Star Wars Le Creuset collection, which targets two intense fan communities. What a genius, moneymaking collaboration. Yes, people love those $300 pots. We used to write about every time Le Creuset announced a new color and the traffic to those stories was bonkers. People would be like, PURPLE POTS? YASSSS. LOVE PURPLE. FAVORITE COLOR. LOVE POTS. COOK IN ‘EM. Now imagine that level of freak-out for moody Darth Vader Dutch ovens. Fans are fah-reaking. I’m wondering: do they ever even cook, let alone eat, in Star Wars movies? I don’t recall Luke braising rabbit in his little seaside hut, slapping out a loaf of sourdough. The cantina scene is a bar—doesn’t count. (Cue a million emails to me about food scenes.) Are these pots laced with some kind of “force” like a scientifically improved cast iron? In the fan article from the New Yorker, Michael Schulman writes about the power fans have to control, reject, and influence plotlines of the shows/books they adore, and what a dangerous power that is to yield. I’m probably reading too much into that when it comes to pot-lines. No matter what, I know I’m going to have to get my brother a Millennium Falcon trivet.Unnecessary lifestyle meme of the weekUnnecessary food feud of the weekWe go through a lot of Parmesan cheese around these parts. I’m not sure if it’s how I was raised, but I default use the wide shreds of the box grater for all cheeses. But it turns out, I am wrong. That’s “coarsely grated,” not “finely grated.” Nearly everyone at Bon Appétit microplanes their parm into fluffy, salty snowflakes. “We’ve microplaned for many, ever years. The past,” said Carla Lalli Music, as incoherently as I wrote it. Alex Delany uses the star-shaped side of the box grater, which I thought was only intended for ruining the sweaters of your enemies. “Food processor for quantity,” said Sohla El-Waylly, “microplane for quality.” Andy took a deep breath and spilled: “What are my top three ways to shred parm? It’s a firm cheese, there are SO many ways! The microplane or food processor for the consistency of shaker parm. Sometimes I shave it with vegetable peeler for pasta, or shave on a mandoline. Or the wide flap of box grater. Sometimes, I take a paring knife and twist it onto cheese for irregular little pieces, good if you want to drizzle oil and pepper on it for a snack, or nuggets for salad.” “He’s gone fully rogue!” exclaimed Christina Chaey (microplane). “FOOD PRO ALL THE WAY HOME,” said Molly Baz. “It’s the optimal texture and yet it still melts into pasta sauces, and it’s perfect for cae sal, so it’s perfect for me.” Side note: You can just buy it pre-grated at the cheese counter, per Carla, but only if it’s at the cheese counter. Everything else “smells like dead fishes” and might contain wood chips. Thanks for lookin’ out, Carla!!!Explore Bon AppétitBeggs NewsletterRead MorecultureI Made the Mushroom Pasta. Now It’s Your Turn.By Alex BeggscultureApple Pandowdy, Where Did You Come From?By Alex BeggscultureMake a Tarte Tatin This Weekend!By Alex BeggscultureCinderella Lattes, Lonely Tomatoes, and Butter BoysBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-12", "author": ["Condé Nast", "Alex Beggs"]}