{"id": "76872ca8bca4c2cdf33029869d459375", "url": "https://www.bonappetit.com/story/persimmon-types", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Before You Buy a Persimmon, Remember This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBefore You Buy a Persimmon, Remember ThisThey’re winter’s greatest delight. But keep in mind which type you’re buying.By Carla Lalli MusicJanuary 23, 2020FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailEvery other Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Apparently, if it’s January in North America, you have two choices. You can stay home, swear off alcohol, do a cleanse, and go to bed when the sun goes down. Or, you can lean into hibernation, drink whatever and whenever you want, and eat as many lasagnas and root vegetables as humanly possible.But what I want this time of year is not shepherd’s pie, and it’s not a five-day supply of green juice, either. What I want is persimmons.I did not grow up eating persimmons, but I finally got around to tasting a prize specimen a few years ago, and it made my life better. A good persimmon will transport me to a warmer, sweeter place. It is a glowing jewel of delectability in this time of darkness. But before I can enjoy one, I have to remember which one is which.Want this letter before it hits the website? Sign up for our newsletter!Persimmons are native to China and grow on trees. We started cultivating them domestically in the mid- to late-1800s, and California is still our main domestic producer. While there are dozens of varieties, you’re most likely to encounter these two types when shopping: Fuyu and Hachiya. Knowing the difference will greatly impact your persimmon enjoyment index. One of them can be eaten when it’s still hard and crunchy. And the other one is so high in tannins that if you bite into it when it’s under ripe, it will suck every ounce of moisture out of your mouth and coat it with an intensely bitter, chalky flavor. I have eaten persimmons, edited recipes about persimmons, and reported about persimmons; I have even had the wrong one and can still remember how hard it was to get that hideous taste out of my mouth. And yet, every single year I have to re-remember which type of persimmon is which. With a little alliteration, I’m hoping we’ll never have to Google it again.Now that (bottom right!) is the color of a perfectly ripe persimmon.\nPhoto by Gentl and Hyers, Food Styling by Susie Theodorou, Prop Styling by Nina LalliThe Fuyu is round and Flat on the bottom, and if you eat it when it’s Firm, it’s Fine. The Hachiya is Heart-shaped and pointy on the bottom, and you Have to Hold off. The Fuyu persimmon will get sweeter as it ripens, but if you don’t have time, you can eat it crunchy, like a sweet pear—or you could go slightly savory and layer it with a mild blue cheese and toasted nuts. Both types are worth trying, but I’ve never gotten the same weak-in-the-knees feeling from eating a Fuyu as I have from a Hachiya, which tastes like a mango, apricot, and sweet peach all in one. The Hachiya, while worth waiting for, is still a parable on patience. I am not a patient person. But every year I go to NYC’s Chinatown and pick up a flat box of Hachiya persimmons when they’re still rock hard. And then I park them on my kitchen counter and I wait. I hate waiting. It’s like waiting for spring. Impossible! It’s like when you know the shortest day has passed and the sun is setting a couple minutes later every few days, but you still have to wait for it to be noticeable. Takes forever. It’s like waiting for your friends to be done with Dry-uary so they’ll stop talking about the fact that they’re not drinking.But the persimmon has to soften, and you have to lean into it. As the Hachiya ripens, the flesh will transform from a rigid mass to a pudding-like parcel. It will eventually feel like a waterbed, with a thin skin encasing a jelly-like ovoid full of spoonable flesh. Happily, this can happen many times over before spring comes—it takes about a week.As you approach the big day, make sure you have some Greek yogurt, some honey, and some pistachios in the house. Swoosh the yogurt on a plate. Pull off the persimmon’s stem (calyx). Use a sharp knife to slice the fruit into wedges and put them on the yogurt. Drizzle the honey over; chop and scatter the nuts on top. Add a pinch of salt (to remind you of how you teared up when the freezing wind was blowing in your face). Or go slightly savory and make a salad of it, layering a Fuyu with a mild blue cheese and toasted nuts. Either way, this fleeting fruit is honestly one of the best things you can have. Spring is coming, persimmons are going. Enjoy this time, it will be behind you soon.Get the recipe:Persimmons with Greek Yogurt and PistachiosThis fleeting jewel of a winter-time fruit will transport you to a warmer, sweeter place.View RecipeExplore Bon AppétitCarla NewsletterPersimmonsRead MorecookingIf Loving Beans Is a Crime, I’m Officially ScrewedBy Carla Lalli MusiccookingMemorize These 3 Words and Eat Well ForeverBy Carla Lalli MusiccookingNever Cut a Squash AgainBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-23", "author": ["Condé Nast", "Carla Lalli Music"]}