{"id": "7690d383a7c5b48572c08e31c0655c56", "url": "https://www.bonappetit.com/story/how-to-make-palmiers", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "How to Make Palmiers Shiny Enough To Be in a Glossier Ad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Palmiers Shiny Enough to Be in a Glossier AdWhen you need something sweet and you need it fast.By Sarah JampelOctober 21, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed. Today: how to make palmiers.Every sugar fiend (show yourselves!) has a handful of insta-sweets: a spoonful of peanut butter covered in chocolate chips; a frozen banana blended with cocoa powder and brown sugar; a mini marshmallow, a Golden Graham, and a square of dark chocolate, all stuffed in your mouth at the same time (lazy s’mores?); a Tate’s cookie crumbled up and soaked in milk (what a former colleague affectionately dubbed “cookie cereal”).But these are desserts to eat in solitude. When you’re hosting a friend for the first time in, say, 19-plus months, maybe you don’t want to bring out the cookie butter and the Oreos. (Keep those little pleasures for yourself.)And that’s where palmiers come into play. They’re as easy and as close to instant as beautiful baked goods get. All you need is a package of puff pastry and sugar to make cookies (or are they pastries?) so plump, so shiny with caramel, that they look like they came straight from a Glossier ad.How to make palmiers:Start by defrosting 2 sheets of puff pastry. You can do this the responsible way (in the fridge overnight), but when you need dessert now, you’ll likely take the live-fast-die-hard route: Unwrap the sheets and leave them on a baking sheet, closely monitored to prevent floppiness, until pliable enough to unfurl.Once your puff pastry is defrosted, you’ll need to roll it out to smooth the cracks and create a slightly larger square. Some recipes will have you roll out the dough on a lightly floured surface, then sprinkle it with sugar and press to adhere. I, however, prefer the more extreme option, which I picked up from doyennes Ina Garten and Martha Stewart, which is to roll the pastry directly in the sugar itself. If you’re using two sheets of pastry, start by mixing 1¼ cups of sugar with 1 pinch of kosher salt. Pour ¾ cup onto a cutting board then distribute it into a fairly even layer.  Working with one sheet at a time, set the pastry in the sugar and sprinkle ¼ cup additional sugar over top, like you’re burying it in sand. Roll the pastry until you have a rough square—it should be between 12\"–15\" on each side, with every bit of dough covered in sugar to ensure maximum caramelization.If you get your hands on chocolate puff pastry, consider yourself blessed.\nNow it’s time to shape. While you can roll each side in, like you’re making a double scroll (think Torah), I find folding easier and neater. Fold each side halfway to the center—they won’t meet yet. Then fold them once again, this time so they do touch. For the final fold you’ll prop one side completely over the other so that you’re left with a long, skinny log with six layers total. Transfer it to a baking sheet lined with parchment paper and stick it in the fridge. Plop the other sheet of pastry down into the sugar that’s left on the board (adding more if necessary), then sprinkle over that final ¼ cup sugar and proceed to roll and fold like before.Chill the pastry logs—this will make them easier to slice neatly—while the oven heats to 425°. Line a second baking sheet with parchment paper. Finally, transfer your logs back to the work surface, use a sharp knife to slice them into 1/4\"–1/2\" pieces, and arrange the palmiers cut side up across the sheet pans, leaving some space for them to grow. Bake 8–15 minutes (time will vary based on their thickness), carefully flipping the cookies over halfway through baking, until the sugar has caramelized. Cool for a few minutes on the trays before transferring to a wire rack to cool completely.How to change them up:While these plain palmiers are delightfully crisp and buttery, they’re also open for interpretation. Instead of granulated sugar, go with turbinado, which has a deeper, more caramelized flavor and a crunchier texture. Add cocoa powder and cinnamon—hot chocolate! Or blitz that granulated sugar with freeze-dried fruit, moisten it with lemon (or grapefruit!) zest and vanilla bean seeds, or season it with pumpkin pie spice or ground ginger.You can also swerve left and go savory: Skip the sugar, roll out the pastry on a lightly floured surface, and spread it with cream cheese and everything-bagel spice or Kewpie mayo and furikake. Or sprinkle it with za’atar or nutritional yeast and black pepper. Or if you want a recipe, make Claire Saffitz’s roasted garlic and rosemary version.At that point, of course, you’re no longer scratching that sweet tooth itch. But that’s what cookie cereal is for.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-21", "author": ["Condé Nast", "Sarah Jampel"]}