{"id": "76904600c947ab5f1d4f1d48ca26bca8", "url": "https://www.bonappetit.com/story/roasted-fennel-yogurt-dip", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "This Is a Yogurt Dip Recipe You'll Want to Tell Strangers About | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is a Yogurt Dip Recipe You’ll Want to Tell Strangers AboutHere’s a roasted fennel yogurt dip recipe. Welcome to the rest of your life.By Alex DelanyMarch 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI want to introduce you to the most unapologetic yogurt dip enthusiast there ever was.Hello. It’s me. I am the enthusiast. Nice to meet you. I hope you grow to like me as much as I like yogurt dip. No pressure though. Let’s just see how it goes.Why are you so into yogurt dip, Alex?  you may ask. Why do you talk about it all the time, even to strangers on the street? Why don’t you invest your time in something that doesn’t make you sound like a pasty weirdo? Maybe a relationship with another human being? Or rock climbing?Well, because I had knee surgery two years ago, and my doctor said I can’t go rock climbing. But he didn’t say anything about not eating yogurt dip, which is tangy, versatile, creamy, healthyish, and absolutely delicious. So here I am, a human being with an expansive repertoire of yogurt-based dip recipes and zero intention of ever going rock climbing.My latest creation: Roasted fennel yogurt dip. I’m all about the caramelized, herbal flavor of roasted fennel, which matches up with the creamy yogurt like a charm. Seeing as you’re already here, I’m going to tell you how to make it.Grab 2 bulbs of fennel, and chop off the stalks, keeping them for later. Slice off the bottom of the bulb, where the layers all connect in that weird hard circular base. Keeping the layers together, slice across the bulb, width-wise, to create thin strips. Maybe use a mandoline, if you do your own stunts. Once you’ve sliced all that fennel up, throw it on a sheet pan, sprinkle it with salt, and toss it in a splash of olive oil. Roast it at 450°, until golden-brown, about 10-15 minutes, then flip the fennel and roast for another 10 minutes.While the fennel is roasting, grab those stalks you cut off the top, and pick all of the little fronds off of them. Yes, they’re called fennel fronds. And while the word “fronds” sounds super cute, they’re just leaves from a vegetable that you bought at the grocery store, so don’t go getting attached to them. Oh, look. The roasted fennel is done. Take it out, let it cool, and chop it all up into even smaller pieces, about the size of...uh, a ladybug? Chopping the fennel after it has roasted retains more moisture.Yogurt can be...attractive?\nPhoto by Chelsie CraigIn a medium-sized mixing bowl (or whatever bowl you’re serving the dip in), combine 10-12 oz. (two little cups) of plain, full-fat Greek yogurt, chopped roasted fennel, ½ of the fennel fronds (save the other half for finishing), lemon juice from 1 lemon, a couple serious pinches of kosher salt, 10 cranks of black pepper, and a few glugs of olive oil. You can also add a pinch of cayenne, if you want some heat. Mix that glorious pile of stuff together with a spoon, and scoop it into a serving bowl.Create some little swirls on the top of the dip with a spoon, and drizzle olive oil over the top, so it forms little olive oil pools that look and taste great. Take the remaining fennel fronds and sprinkle them over the top as a garnish. Use your judgement with the amount of fronds here. You don’t want to serve someone a bowl of dip and have to convince them that it’s not a big bowl of fennel fronds, which can taste intensely licorice-y when you eat too many.Now you dunk a bunch of stuff in that dip. Maybe some charred string beans. Maybe some flatbread. Maybe some crunchy carrots or endives. Or maybe some plain potato chips (my official co-sign). I promise it will all work well with the marvelous dip you have created. The herbal, slightly-sweet, caramelized flavor of the roasted fennel, the freshness of the fronds, the cream and tang of the yogurt (which you might even mistake for sour cream) all combine for magical experience. Marvelous is not an overstatement. Neither is magical.And that’s literally it. Wow. That was so easy. Who knew that a fennel yogurt dip recipe was so attainable? I did. That’s why I asked my editor to write this article. I hope you enjoy your fennel dip and giggling while you think about fronds. It’s been great chatting, but I have to go. I have yogurt things to think about. And rocks to ignore.Want more yogurt dips? Of course you do.3 Easy Greek Yogurt Dips You Don't Need a Recipe to MakeYogurt dips where you don't really need a recipe are the best kind of yogurt dips. And yeah, they taste good.View StoryExplore Bon AppétitRecipeYogurtGreek YogurtFennelCooking Without RecipesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-30", "author": ["Condé Nast", "Alex Delany"]}