{"id": "76a53e26bb3cb9cfb46d569dc484741b", "url": "https://www.bonappetit.com/story/never-fail-smoky-salsa-roja", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "This Salsa Roja Is My Spicy, Smoky Dinner Security Blanket | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Smoky Salsa Roja Is My Dinner Security BlanketAs long as I have a jar in the fridge, I know dinner's going to be okay.By Sarah JampelJanuary 4, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Welcome to Condiment Central, a.k.a. the top shelf of my fridge. Among the motley crew of jars labeled with masking tape there's intensely garlicky toum, crunchy chile oil, zhug, pomegranate molasses, spicy tofu crumbles, dulce de leche, and, the container that's always near-empty first, smoky salsa roja.Smooth, sultry, and just the right balance of fiery, tangy, and sweet, it has the magical ability to turn a bag of tortilla chips into dinner. (Or, when I'm feeling a little more ambitious, morph into the best enchilada sauce.)This salsa roja is delicious and it disappears fast, but that's not a problem considering that the bulk of its flavor comes from three things I usually have in the kitchen: chipotles in adobo, tomato paste, and fire-roasted tomatoes, which are—believe it or not—cooked over an open flame before they're canned to give them that charred edge. (If you don't have fire-roasted tomatoes, do not—I repeat: do not!—attempt to flame-cook your own, Regular crushed tomatoes will do the trick, and you could add a pinch of smoked paprika to compensate.)It also helps that the salsa takes all of fifteen minutes to make. You simply sauté onion and garlic, add the tomato paste and chipotles in adobo, cook them down so they're darker, thicker, and richer in flavor, then add the canned tomatoes and simmer to concentrate their power. All that's left to do is to transfer everything to a blender or food processor and blitz until smooth, then stir in apple cider vinegar (sharp!) and molasses (sweet!).If you don't have \"robust-flavored (dark) molasses,\" hope is not lost: I imagine that maple syrup, honey, or brown sugar would be strong contenders (one time I used tamarind paste, and it was delicious).You could serve the salsa roja with beer-braised brisket, but I'm more likely to eat it with scrambled eggs.\nNow, you—and all of my friends, family members, and whoever else stumbles in for dinner—might be wondering how practical it is to spend time making a sauce instead of making dinner. \"Sarah,\" you think, \"what use is a fridge packed full of condiments, none of which constitute a real meal?\" Well, I'd argue that smoky salsa roja makes all of the boring things I'm actually going to eat for dinner taste a hundred times more exciting. Fold salsa roja into soft scrambled eggs; use it as a dipping sauce for roasted sweet potatoes; slather it in a tortilla and top with seared shrimp and sliced avocado; mix it with yogurt, then toss with roasted potatoes; stir into sautéed chickpeas or braised white beans; or use it to coat tortilla chips and make yourself egg-topped chilaquiles. With a jar of salsa roja around, not even my saddest dinner is irredeemably doomed.Of course there are a gazillion salsa roja recipes (\"salsa roja,\" after all, just means red sauce), with various fresh and dried and canned ingredients. But this is the one that comes together with what I already have lying around—no mealy, dead-of-winter tomatoes necessary. And besides, I once saw an embroidered pillow that said: When you find a salsa (or, I guess, a person) that you love, you don't let it go.Salsa, fiesta:Smoky Salsa RojaView RecipeExplore Bon AppétitNever FailSalsaChipotleTomato PasteCanned TomatoesRead MoretechniquesHow to Make Fresh, Homemade Salsa & Common Mistakes to AvoidBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-04", "author": ["Condé Nast", "Sarah Jampel"]}