{"id": "76b1aa809b4c0c5e2ee7274f46b6803c", "url": "https://www.bonappetit.com/story/sous-vide-meal-prep", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sous Vide Cooking Changed the Way I Meal Prep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesSous Vide Cooking Changed the Way I Meal PrepIt's as easy and hands-off as a slow cooker, but with much better flavor and texture.By Alyse WhitneyJanuary 24, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna BillingskogFacebookTwitterEmailI program the majority of my meal prep with my phone now, usually from the comfort of the couch. With the tap of a button, I can cook the juiciest boneless skinless chicken breasts I’ve ever tasted, a week’s worth of soft-boiled eggs, or even tender shrimp for salad. No, this isn’t me daydreaming of a gadget from Black Mirror—it’s sous vide cooking. And it changed everything about the way that I meal prep.Since Brad Leone recommended it, I got the Joule by ChefSteps' sous vide machine ($179 on Amazon), and I’ve felt a lot more chill about making lunches for the week. It isn’t about speed—it’s about quantity and quality. You get both when you use a sous vide machine, which cooks food at a consistent temperature for a set amount of time. But even if I leave my chicken breasts in the water for an extra half hour by accident because I didn’t hear the timer on my Joule app, they aren’t dry and rubbery like they would be if left in the oven or poaching liquid for too long. Those chicken breasts can be sliced for grain bowls, chopped for soups, rolled into wraps, or even quickly tossed into a noodle stir-fry to warm through. I’ve done bone-in, skin-on breasts and seared them for crispy skin afterward—it takes three minutes max on medium-high heat—and made a pan sauce for dinner, but honestly boneless is the way to go. It’s so juicy that you don’t need the bone for extra protection, and it's less work to not have to remove afterward.The process is simple with Joule, because the app holds my hand and guides me through everything I need to do. My go-to technique is to season one or two chicken breasts with salt, pepper, and olive oil and put them in a gallon-sized freezer bag. (Most restaurants use special bags and a vacuum sealer, but any sturdy, sealable zip-top bag works just as well.) I’ve added curry powder, grated garlic, lemon zest (not juice or whole slices, because the acidity can mess with the cooking) and herbs like thyme and rosemary to impart flavor, but I usually keep it simple for the majority of them. After getting most of the air out of the bags, I lower them into the water before sealing—the water pressure pushes the rest of the air out so it’s almost like vacuum sealing! The app sets the water temperature by circulating it through the machine and tells you when it’s ready, then programs a timer so you know when to take them out. The default setting for juicy and tender boneless, skinless chicken is 149°F for 1 hour. They are a little pink in hue sometimes after cooking, but that’s because sous vide cooking preserves the chicken’s color while killing bacteria over time at the lower steady temperature. Unlike with traditional cooking, you don’t need to take the chicken to 165°F for it to cook fully.The whole operation takes a little bit of time and planning, but it’s great for a lazy Sunday at home. I usually do a quick batch of jammy ramen-style eggs in the morning—8 minutes at 194°F—and eat two smashed on toast with flaky salt and pepper and then immediately do several bags of chicken breasts while I clean, watch TV, or hang out with friends. Because there is no risk of the water level rising since the sous vide machine is magnetized to the bottom of the pan (my largest Calphalon stock pot is 4.5 quarts), I can even leave the house and run errands without worrying about anything scary happening to my food. I can monitor the timer anywhere I have my phone. Since chicken breasts are quick cooking, I don't normally leave the house, but for something that cooks 8 hours, like pork shoulder, I would.Soft-boiled eggs always come out perfectly jammy when you sous vide them.\nTed CavanaughIf I procrastinate meal prep and need something quick for dinner that will translate to lunch the next day, I love to sous vide shrimp. I thaw frozen shrimp under cold water when I get home from work, season with salt, pepper, and olive oil, and cook them at 158°F for 10 minutes. They’re plump and succulent and would be great chilled as shrimp cocktail, but I usually throw them on top of a quick salad, stuff into tortillas for tacos with all the fixins, mix with Kewpie mayonnaise and Sriracha for a spicy shrimp rice bowl, or chop and top stir-fries or fried rice with them. The only extra cooking I would do with these is to get some sauce on them, like letting them mingle with garlic, lemon, and white wine for a scampi-style dish.For scampi flavored shrimp, I sous vide with lemon zest, olive oil, and lots of garlic.\nLaura MurrayThis is more than excitement over a new toy—it’s genuinely changing the way that I meal prep, ultimately saving me time and from washing a mountain of dishes. Most of the action happens in disposable bags (doubled for higher temperatures, like with the shrimp). Then I can store the food in the same bags they cooked in, or portion it out in containers—either plastic takeout or my favorite glass ones—with rice, roasted vegetables, or other lunch components for easy mix-and match lunches. The best part? I can set it up so that each bag of protein has a different flavor profile. I can cook once and have a couple of chicken breasts punched up with a tangy bulgogi marinade, a few that are taco-seasoned, and another rubbed down with herby pesto. It helps me from getting bored quickly, and saves me money when I don’t buy lunch.Now that I have these sous vide staples in my meal prep rotation, it gives me bigger dreams for what I could do. Next, I want to try an 8-hour char siu pork cooked overnight, braised short ribs that get fall-apart tender over 24 hours, and even egg bites cooked in mini mason jars that I could tote to work. For now, easy breakfast and proteins seem to be the best choices to sous vide. It’s incredibly unfussy, a lazy meal prepper’s dream, and a non-threatening way to use a robot to cook. This is the future, and I’m living in it. Care to join me?Photo by Alex LauYour Sous Vide EssentialsFind out what even is sous vide, anyway?See how to sous vide with step-by-step photos herePick up the BA Test Kitchen's favorite sous vide machineGet the RecipesSous Vide Strip SteakSous Vide Pesto ChickenSous Vide Sweet and Spicy Pork BellySous Vide Salmon with Lemon and DillExplore Bon AppétitMeal PrepSous VideRead MorecultureThe Joule Is the Best Sous Vide Machine We’ve Ever UsedBy Brad LeonecookingThese Meal Prep Containers Will Motivate You to Bring LunchBy Alyse WhitneycookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris MoroccoLifestyle8 Ways to Master Meal Prep This FallGallery8 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Alyse Whitney"]}