{"id": "76bde357c5de841fd3639d859ae98db1", "url": "https://www.bonappetit.com/story/canada-travel", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Canada, We're Into You | Bon Appétit\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n      Presented By    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n  Our neighbor to the north is not messing around when it comes to eating and drinking. From world-class coffee in Vancouver to insanely fresh oysters from Prince Edward Island, butternut squash bannock pizza in Winnipeg to foraged mushrooms in Ontario, the issue isn’t how to find good food but rather how to winnow down a reasonable eating itinerary. So let’s get started.    \n\n\n\n\n\n\n\n                                                                                                         \n \n \n\n\n\n\n\n\n\n\n\n\nBeauty and Brine: Prince Edward Island Is an Oyster-Lover’s Paradise\n\n\nThe tiny province delivers big on bivalves.\nby CHANTAL MARTINEAU\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhere the Waves Are Fast and the Food Is Slow\n\n\nIn Nova Scotia surf‑and‑turf isn’t just a main course, it’s a way of life, a way to play and a reason to stay.\nby MELISSA BUOTE\n\n\n\n\n\n\n\n\n\n\n\n\n\nI’d Never Even Heard of Bite House, Now I’ll Never Forget It\n\n\nSixteen seats, 9 courses, and 1 electric stove: a look at one of North America’s most beautiful and unlikely restaurants.\nby ALEX DELANY\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI Go to Montreal for Haitian Patties, Not Poutine\n\n\nFrom crispy pieces of delicious fried pork to piquant and flaky patties, here’s all the Haitian food you need to eat in the City of Saints.\nby TERENCE TROUILLOT\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Restaurant at Pearl Morissette Offers a Tasting Menu for the Climate-Conscious Era\n\n\nRegenerative agriculture inspires exhaustive experiments in local flavor at Jordan Station’s fine‑dining gem.\nby ALIZA ABARBANEL\n\n\n\n\n\n\n\n\n\n\n\n\n\nThere Will Be Cake: A Very Detailed Guide to Road-Tripping the Canadian Rockies\n\n\nFrom high‑altitude sourdough to remote lakeside teahouses, this Canadian road trip is the flannel‑wearing adventure of a lifetime.\nby LINDSAY ANDERSON\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI Live in Brooklyn But My Favorite Place to Drink Coffee is 3,000 Miles Away in Vancouver\n\n\nI visited 12 cafés in 48 hours to find the most beautiful cafés, nuanced coffee, and flakiest pastries the city has to offer.\nby CHRIS MOROCCO\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe 8 Cantonese Restaurants That Make Me Want to Move to Canada\n\n\nIf you had the dim sum in Richmond, you’d understand.\nby ELYSE INAMINE\n\n\n\n\n\n\n\n\n\n\n\n\n\nIf You Like Wine and Beautiful Views, You Should Probably Go to the Okanagan Valley\n\n\nWith 185 wineries and a crystal clear lake smack dab in the middle of the place, it’s easy to see why the Okanagan is a destination worth seeking out.\nby EMILY SCHULTZ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nServing Up Resilience: Indigenous Chefs Preserve Native Foodways—and Create New Ones\n\n\nChefs from across Turtle Island are reclaiming their roots and sharing their take on traditional foods.\nby REBECCA THOMAS", "date": "2019-11-07", "author": ["Condé Nast"]}