{"id": "76be5d9217ee2d55b418bbd503e485e4", "url": "https://www.bonappetit.com/story/hot-penicillin-cocktail", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "The Hot Penicillin Is the Winter Cocktail of Choice  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHot Penicillin Cocktails are THE Party Drink of Choice When Everyone at Your Party is SickThis heated-up riff on the classic lemon-ginger-honey-scotch blend will have you and your friends feeling better in no time.By Hilary CadiganNovember 16, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailI live in a Brooklyn brownstone with six other adult humans and literally all of us are sick right now. It’s kind of like MTV’s The Real World, but instead of free-flowing booze, juicy drama, and secret late night hook-ups, we have free-flowing snot, Great British Bake Off marathons, and fights over the last dose of Mucinex before we all go to sleep at 9 p.m. Find out what happens when life stops being polite, and starts getting real. Kids, it ain’t pretty.This past Sunday, after spending our weekends trapped together, we were all in need of a bit of cheer. Or at least something to numb the pain of breathing in each other’s sick fumes for two days straight. So, I decided to be a hero. I pulled a jean jacket over my snot-stained sweat-onesie and headed to the corner store. Filled my granny cart with half a dozen lemons, a giant jar of honey, a knobby hunk of fresh ginger, and an additional tub of crystallized ginger. But I didn’t stop there. Next I went to the liquor store and grabbed two large bottles of scotch, one blended, one single malt. I arrived home deeply winded but ready. “GUYS, GATHER ‘ROUND,” I yelled, gulping my last breath of fresh air from the outside world and slamming the door of the malady chamber behind me. “I’M MAKING HOT PENICILLINS.”What are hot penicillins, you ask? First, I’ll tell you what they are not. They are not the antibiotics with the dangerously phallic spelling I’ve been forced to write down in the “known allergies” box on medical forms since kindergarten. They are, however, the hot cousin of the traditional penicillin, a cocktail invented by Sam Ross (of the Lower East Side speakeasy Attaboy, which I have tried and failed to get into twice) back in ye olde 2005: a belly-warming blend of spicy ginger, tart lemon, sweet honey, and toasty blended scotch with a peaty floater of single malt on top.Our own Test Kitchen celeb Molly Baz invented the hot penicillin as a riff on Ross’s original. “I was trying to make it an even cozier version of itself,” she tells me. The obvious solution? Heat that baby up.Back in my own kitchen, which mind you is approximately eight feet by five and shoved full of the gratuitous cooking paraphernalia of seven people, I’ve carved out a square foot of counter space. Flanking me far too closely on each side, one roommate is making soup and another is making tea. I slice up a four-ounce piece of ginger, dump it into into a medium saucepan with honey and water, and crank that heat up to medium. Once it starts to form tiny bubbles on the sides (this, Molly tells me, is called a “bare simmer”) I reduce the heat and stir it slowly like it is a cauldron and I am a witch, curling my body around my space to keep out errant roommates and their germs. (“MOVE, YOLANDA, I’M TRYING TO HEAL YOU.”)The key here is not to reduce the mixture but simply to agitate it enough to dissolve the honey and infuse everything with gingery goodness. After about 25 minutes, I remove the saucepan and strain its contents through a fine mesh strainer.Next, I mix that hot honey-ginger-water with six ounces of fresh-squeezed lemon juice, eight ounces of blended scotch, and an extra ounce of single malt for good measure, heat it up again, ladle it all steamy-like into mugs garnished with a piece of candied ginger, and pass them out to my ailing roommates like the sick but heroic compatriot I am.Soup and tea are left to grow cold on the coffee table as we all slurp the healing concoction, the honey soothing our ragged throats, the ginger opening up our stuffed sinuses. “Wow!” cries the sickest of the roommates, who is wearing an outside hat inside and has communicated in nothing but grunts and quiet moans for the past three days. “This is like, really good.”So here’s the moral of the story: Communal living is cute in the summer, all backyard barbecues and flip-flops and sipping rosé together beside the window-mounted air conditioner, but when winter comes and things start to look really, really bleak, that’s when your bonds are really tested. That is when you need a savior. And that savior is hot penicillin.Get the recipe:Hot PenicillinMove over Hot Toddy, there’s a new, even cozier cold weather cocktail in town.View RecipeExplore Bon AppétitCocktailScotchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Hilary Cadigan"]}