{"id": "76cc8e49bcd41f475a2000ac5e733eb3", "url": "https://www.bonappetit.com/recipe/basically-queso", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Queso Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesQueso, Not From a JarBy Sohla El-WayllyFebruary 9, 20224.1(60)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina Boytsova EmailPinterestPrintEmailPinterestPrintYou could be totally hammered halfway through the Super Bowl and still manage to make this homemade queso recipe. It’s a little bit more involved than opening up a jar from the grocery store, but the result is a thousand times more delicious. The American cheese is nonnegotiable—it’s what makes the best queso dips creamy and smooooth—but the Monterey Jack can stay on the sidelines if you’d rather put pepper Jack, Gruyère, Fontina, or cheddar cheese on the field. (We’re trying really hard with the sports metaphor here.)Chopped pickled jalapeños give this queso dip recipe a kick, but you can use canned green chiles if that’s what you have on hand. And don’t let the melty wonder stop after game day. Drizzle this cheese dip on weeknight nachos and tacos, or pull it out whenever a Tex-Mex happy hour is in need. Margaritas, anyone?Editor’s note: This recipe was originally published January 26, 2020.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEABox Grater$13 At AmazonMedium Saucepan$39 At AmazonMicroplane$16 At AmazonWooden Spoon$6 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonIngredients6–8 servings1small onion3garlic cloves1tsp. (or more) kosher salt⅓cup pickled jalapeños, plus 1 Tbsp. pickle juice8oz. American cheese8oz. Monterey Jack cheese2Tbsp. unsalted butter2tsp. ground cumin½tsp. cayenne pepper2cups milk1Tbsp. cornstarchChips (for serving)PreparationStep 1Time to do a little knifework: Peel and finely chop 1 small onion. Peel 3 garlic cloves. Finely chop ⅓ cup pickled jalapeños.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Using a box grater, coarsely grate 8 oz. American cheese (or tear if using singles) and 8 oz. Monterey Jack cheese (you should have about 4 packed cups). Set aside separately.Step 3Heat 2 Tbsp. unsalted butter in a medium saucepan over medium until foamy, about 1 minute. Reduce heat to medium-low and add onions. Using a Microplane, finely grate garlic into pot; season with 1 tsp. salt. Cook, stirring occasionally, until onions are tender but haven’t developed any color, about 3 minutes. Add 2 tsp. ground cumin and ½ tsp. cayenne pepper and cook, stirring frequently, until aromatic, about 30 seconds. Stir in 1¾ cups milk and bring to a bare simmer.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Meanwhile, whisk 1 Tbsp. cornstarch and remaining ¼ cup milk in a small bowl until smooth. By mixing the cornstarch with a portion of the milk before adding it into the pot, you greatly reduce your chance of lumps. (You can also shake milk and cornstarch together in small lidded jar.)Step 5Add cornstarch mixture to pot and bring to a simmer over medium heat. Cook, stirring constantly, until mixture is thickened (it should coat the back of your spatula) and cornstarch is hydrated—it should simmer for 1 full minute. This is important: If your cornstarch isn't fully hydrated, your queso will be grainy and floury rather than thick and creamy.Step 6Reduce heat to medium-low and add American cheese. Stir vigorously with a spatula, taking care not to let mixture bubble, until cheese is fully melted, about 3 minutes.Step 7Add Monterey Jack cheese one handful at a time, stirring vigorously to incorporate fully before adding the next and adjusting heat as needed so mixture doesn't bubble, about 30 seconds between additions and 4 minutes total. After adding all the cheese, stir vigorously to ensure that all cheese is melted, about 1 minute (it will look thick and stringy).Step 8Remove from heat and stir in 1 Tbsp. pickling liquid and half of jalapeños. Taste and add more salt if needed. Garnish with remaining jalapeños.Step 9Arrange chips on a platter or baking sheet. Serve queso right out of the pot so it stays warm and can be easily reheated over medium-low heat if needed. If you’re feeling real extra, set pot over another pot or large bowl filled with hot water so it stays gooey for longer.How would you rate Queso, Not From a Jar?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangleTasty. Doesn't need any more salt the the cheese already imparts to the dish. I could certainly handle more heat, so pepper jack may be nice in place of the plain Monterey jack, as suggested in the article lead-inA cook from BuffaloBuffalo, NY3/23/2022Really liked this dip. Very cheesy and bitey enough. \nI left off the cumin and carefully monitored the amount of jalapeño relish that I added. I did like the combination of American and Monterey Jack cheeses. Seemed like a little bit of jalapeño and the cayenne pepper was enough heat. Served with sourdough discard crackers, and it was all highly acclaimed by friends we had over for drinks at happy hour. Bob HerringLakeland, FL3/13/2022Also, to the people who said they'd rather use Rotel and Velveeta, use it then.  Your Texas is showing and I'm from Texas. That is NOT what this recipe is. This is completely different and if you have never used American cheese in queso, you are mssing out.  Real Mexican restaurants would NEVER use Velveeta, by the way. Mexican restaurants use queso blanco.  White American cheese is as close as it gets.meldrapeKerrville, TX2/14/2022Delicious rendition of a Mexican restaurant favorite.meldrapeKerrville, TX2/14/2022where's the recipe?\nAnonymous2/11/2022I'm with DH from McAllen TX- I called it Rotel dip growing up in TX and we had to use a double boiler to make it. Now, mix one 16 oz bar of Velveta cheese cut into cubes and a can of Rotel. Microwave it until it is melted and creamy. Serve with tortilla chips. You may need to warm it up if out more than a half hour. Also, now Velveta makes a white cheese. So, I queso blanco with rotel would be good too. Rotel is the secret ingredient in my chili. \nmapAKAnchorage AK2/11/2022This is good.  I prefer fresh jalapenos and no pickle juice.  And mix of Colby Cheese and Mexican Asadero instead. With some sprinkled Cilantro and serve with a dollop of creme fresca (creme fraise) in the middle.\n\nAlthough the classic Tex Mex diner way is 1 med bar of velveeta and 1 can of Ro-Tel tomatoes with green chiles.DHMcAllen, TX2/11/2022Wrong wrong wrong!  No cumin and use Velveeta cheese.  Use a jar of salsa instead of pickled jalapeños. Otherwise good. I’m a Texan and have been making Tex mex Chile con queso for years. Velveeta is the key ingredient. Ben GonzalezEl Paso, TX2/11/2022Added some ground Mexican chorizo (or other spicy sausage) and some drained Rotel (r) tomatoes for a little added umpph.  DavidBoise via South Texas2/11/2022I used 2tbsp of flour instead of cornstarch and it came out great! Next time will definitely experiment and use more cheddar/less velveeta and probably canned tomatoes daniele9/13/2021I’m surprised by this one. I have made queso many times. I decided to be adventurous and try a different technique and try this recipe. I would have usually made a flour roux. The flavour in this recipe is\ngreat but the texture suffers from the use of cornstarch. It has a grittiness. It would have been much better using a flour roux.Lisa ArlottiOntario, Canada2/28/2021Not cheesy & flavorful enough. Turned out sort of bland & thin. I even added extra cheese & spices but still not great. Too much work for a mediocre queso sauce, won't be making this again.AnonymousVirginia2/17/2021I have made this recipe several times and every time it comes out perfect. If I could bathe in this queso I would 😂AnonymousBoca Raton2/9/2021The consistency doesn't match that in the gifs despite my careful measurements and instructions. It is much too thin and is not stringy or think at all. I removed a cup of liquid to mix in another small tbls of cornstarch before pouring back in, and am hoping it will continue to thicken as it cools, bc I'm basically left with spicy cheese soup right now lol. Queso-soMA1/20/2021A little too bland for me. Not sure if i will make this recipe again. Need to use creamy mexican cheese.AnonymousSeattle 9/29/2020Explore Bon AppétitDipTex-MexAmericanJalapeñoChileVegetableCheeseSnackStarterGluten-FreeNut-FreeVegetarianKetoSimmerSuper BowlFourth Of JulyMemorial DayLabor DayBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-26", "author": ["Condé Nast", "Sohla El-Waylly"]}