{"id": "76d8954644c77b273454b16647471af6", "url": "https://www.bonappetit.com/story/vegan-butternut-squash-soup", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "This Butternut Squash Soup Is Preparing Me for a Week of Nonstop Eating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Butternut Squash Soup Is Preparing Me for a Week of Nonstop EatingIt’s quick and healthy, and this recipe will teach you how easy it is to make a puréed vegetable soup.By Christina ChaeyNovember 19, 2018FacebookTwitterEmailFacebookTwitterEmailPerhaps you wouldn’t normally listen to an argument for why you need a vegan soup in your life. But perhaps, like me, you’ve made plans this week with a kiddie pool’s worth of gravy, third helpings of buttery stuffing (I’m making this one and adding sausage because I am feeling DEFINITION EXTRA), and “just a taste” of every pie, cake, and tart on the table. I want to pop an antacid just thinking about it! (Note to self: Pack extra jumpsuits in suitcase and avoid pants at all costs this weekend.)I’d make this gingery butternut squash soup any day of the week, but it’s especially appealing during the relentless gorgefest that is Thanksgiving week, when a Crispy Cheese Twist or bacon-wrapped date is practically catapulting itself into your mouth at every turn (and who are you to resist???) It’s quick, economical, and tastes way more luxe than it should, considering it doesn’t have any butter, cream, or protein. It’s got crispy coconut chips, a tuft of bright cilantro, and a swirl of coconut milk on top to keep you from getting bored. You likely already have most of the ingredients, so all you need from the store is a Big Butternut Boy™, a bunch of cilantro, and a couple of limes.There's a common misperception that all soups require lots of time and effort. Although this might be true for some soups (you can’t rush a really good chicken noodle), this one comes together in about 40 minutes—no homemade stock necessary. For quick yet complex flavor, I sauté the power trio of onions, garlic, and ginger to amp up the flavor of the squash. I also add a can of coconut milk to provide body and extra flavor. Everything goes into a blender, so there’s no need to worry about chopping things up finely. At the end, I add red pepper flakes and fresh lime juice for a kick of heat and acid.Okay, so. The blender. Yes, you need one. No, it does not have to be a $400 Vitamix. (Molly Baz got me a $40 Black & Decker blender to test out specifically for this story, and I was pleasantly surprised to find it worked like a charm.) I’ve made many soups using both an immersion blender and a countertop blender, and I’ve realized that as long as you do it properly, making soup in a countertop blender is far and away cleaner, safer, and better at producing silky-smooth results. Sticking an immersion blender straight into a boiling pot of soup to blend it may seem convenient, but whenever I use one I always seem to end up with a chunky-ish soup and a soup-splattered counter.There are a few very important rules to keep in mind when blending hot soups. Remember these and I’m confident you’ll never settle for immersion-blender baby food soup again*:Make sure your vegetables are tender AF. Use a cake tester (my ride-or-die kitchen tool) or the tip of a paring knife to cut into the biggest veggie chunk in the pot—it should have no resistance, and cut through the flesh like butter.Never, ever fill the blender more than halfway. The volume of the soup will increase as it whirls around in the blender, and filling the pitcher too much at the start will cause the soup to overflow and end up all over you and your countertop. Not cute.Make sure there’s a vent in the blender lid so steam can escape.  Many blender lids come with a removable center piece that you’ve probably never noticed or bothered with—until now! As hot liquids blend, steam builds pressure inside the pitcher, and if you don’t give that steam an opening to escape, the top of your blender will pop right off, once again causing the soup to overflow and end up all over you and your countertop. (FYI, this is why Ninjas and Magic Bullets etc. tell you to never blend hot liquids—no steam vent.)Try not to start-and-stop. This is mostly about splatter control, but also about having confidence in yourself and the soup-making greatness that lies within. When you first turn on the blender, you should notice minimal splatter (that’s where a folded kitchen towel comes in handy) because all those chunky vegetables are being drawn into the vortex below. However, if you were to pause and then resume your blending efforts, you’ll find the now-mostly-liquid mixture will want to splash up (and all over you) with more height and force than the Fountains of Bellagio. You ever wonder how people say confounded things like, “I ended up with soup on the ceiling!” This is how that happened.*All that said, if you’re still the most comfortable with a handheld blender and don’t mind that whole chunky-rustic texture, by all means go for it! It will still be delicious.Once you’ve mastered this soup recipe, you’ve learned the blender method for making any puréed vegetable soup: carrot soup! Sweet potato soup! Cauliflower soup! Ever since I learned how easy and satisfying soup can be, I’ve embraced it as a way to use up vegetables I’ve got lying around that I don’t know what to do with, and I can honestly say I’ve become a smarter cook in the process. Approximately 17,000 gallons of soup later, I’m still deep in the middle of my love affair, with no signs of stopping. So, what d’ya say: Sööp, brøther?Get the recipe:Vegan Butternut Squash SoupIf you've always thought you needed hours to make a luxuriously silky puréed vegetable soup, well, this recipe is here to say you don't! View RecipeExplore Bon AppétitSoupButternut SquashVeganCoconut MilkWinterHealthyGingerRead MorecookingIf You Aren't Putting Toppings on Your Soup, Are You Really Living?By Alyse WhitneycookingA Rent Week Lentil Soup Recipe to Improve Your Home DecorBy Alex DelanycookingThis Genius No-Soak Black Bean Soup Makes Its Own Delicious BrothBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-19", "author": ["Condé Nast", "Christina Chaey"]}