{"id": "770031100fc2020261d05c04492955b4", "url": "https://www.bonappetit.com/story/i-sodi-new-york", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "When I Want to Be Alone, I Eat Dinner at the Bar at I Sodi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen I Want to Be Alone, I Eat Dinner at the Bar at I SodiNothing drowns my sorrows like a bowl of lemony pasta.By Carey PolisApril 15, 2019FacebookTwitterEmailPhotograph by Carey PolisFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I Sodi in the West Village is my favorite restaurant, but it also annoys me. It’s impossible to get a reservation and even attempting to walk-in with a party of two during a rainstorm at 6 p.m. is dicey. Snagging a solo bar seat tends to be a path of lesser resistance (though you still might have to wait), and the bar is an absolute delightful place to drown your Monday blues. The bartenders make a mean sbagliato and the complimentary bread with peppery Tuscan olive oil is burn-your-throat good.It’s highly likely I’m going to order pasta, especially the pappardelle al limone, which is unapologetically both lemony and buttery, resulting in an initially bracing bite that slowly mellows out. But the lasagna carciofi is also formidable in its subtlety—thin layers of pasta, bechamel, and artichoke that are there for you when the day didn’t go your way.If pasta isn’t calling for me (a rare occasion), I Sodi is one of the few places I actually look forward to salad, whether it’s the arugula with castelmagno cheese or the valeriana, made with mâche, pecorino, and balsamic. These are simple creations, made with excellent ingredients that embody chef Rita Sodi’s honed-in Tuscan cooking.It’s cooking so good that it serves as a carb-heavy therapy session. I’ve gone there when I’ve felt a little “meh” and when I’ve been incredibly close to ugly crying over my pasta because my day was that awful. But then I start eating, and I leave feeling a little better… even if I did have to wait an hour to simply be alone with my thoughts and a bowl of pasta.Go there: I SodiExplore Bon AppétitHighly RecommendNew YorkItalianRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Carey Polis"]}