{"id": "7701423de45fb403babf167bba06d229", "url": "https://www.bonappetit.com/story/meherwan-irani-cooking-for-fun", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "It Took a Global Pandemic For Me to Stop Cooking Like a ‘Chef’ and Just Chill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusIt Took a Global Pandemic for Me to Stop Cooking Like a \"Chef\" and Just ChillChef Meherwan Irani remembers the real reason why he cooks.By Meherwan IraniAugust 26, 2020FacebookTwitterEmailPhoto by Molly MilroyFacebookTwitterEmailWhen I’m at my restaurants, I instinctively cook to impress. I’m an Indian chef making Indian street food, and I can’t help but let Western-centric technique and aesthetic creep into my preparation and plating. I feel the all-seeing social media eye that’s endlessly judging, commenting, and reposting, knowing that its approval can make or break my restaurant. That reflex you have to ooh when a dish is placed before you and thumb Instagram open on your phone? Well, I see you doing that from the kitchen and it confirms that what my food looks like is just as important as what it tastes like.It took a global pandemic and being stuck at home for me to cook for flavor not fanfare. It happened when I decided to do a weekly live cooking show on, of all places, Instagram. For the first one I picked a simple curry recipe to demo since that’s what I was making for dinner. As my wife held the iPhone and my teenage daughter looked on, it dawned on me that neither they nor anyone at home were looking for someone to wow them with culinary virtuosity. All they wanted from me was a delicious meal—and the confidence to recreate it themselves.In the outpouring of comments, what struck me was how people loved the fun I was having, that I wasn’t trying to “chef up” dishes, and that I was dealing with the same challenges as them. As I continued to cook and post online, making crispy onion pakoras and spicy Goan fish curry, I found myself doing it not for likes but to bring comfort to others. The pressure to impress, which felt so crucial as a chef, now seemed meaningless as a dad, a husband, and a home cook.When my restaurants reopen, I don’t want to cook like a chef anymore. I realize that the way a dish is reviewed or photographed isn’t supposed to make you feel a certain way—the act of cooking is. And I had forgotten what that felt like.Meherwan Irani is the chef and founder of Chai Pani Restaurant Group and Spicewalla in Asheville, NC. Explore Bon AppétitFirst PersonCoronavirusRead MoreLifestyleMeherwan Irani Wants to Change Stereotypes About the South, Starting With DinnerBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-26", "author": ["Condé Nast", "Meherwan Irani"]}