{"id": "771ac76cd5e5bac1bf03f391b952f5e2", "url": "https://www.bonappetit.com/recipe/fruit-chow", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Fruit Chow Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueFruit ChowBy Peter and Jeanine PrimeSeptember 22, 2020EmailPinterestPrintREY LOPEZEmailPinterestPrintEmailPinterestPrintThis refreshing and bright chow is just one of many dishes that show up in Cane chef Peter Prime’s take on a Trinidadian lime—a hangout, or in this case, a full-on roti lime feast. You can keep the fruit chunky, chop it the consistency of a pico de gallo, or blend it into a smooth sauce—the choice is yours. If you can’t find culantro (also known as chadon beni), you can use cilantro in a pinch, though the flavor will be much less intense. Serve it alongside Aloo and Chana, Tomato Choka, Curry Goat, and the main event: the flaky Buss Up Shut Paratha Roti.IngredientsMakes about 2 cups2cups fresh pineapple or mango pieces¼cup finely chopped culantro or cilantro1garlic clove, thinly sliced1tsp. finely grated lime zest2Tbsp. (or more) fresh lime juiceKosher salt, freshly ground pepperPreparationStep 1Toss pineapple, culantro, garlic, lime zest, and lime juice in a medium bowl; season with salt and pepper. Let sit at room temperature at least 2 hours, or cover and chill up to 12 hours.Step 2Just before serving, taste chow and add more lime juice and season with more salt and pepper if needed.How it all comes togetherStep 3Use the silky shreds of roti to scoop up all the various curries, chows and chokas that make up this roti lime feast.Photo by Rey LopezHow would you rate Fruit Chow?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleFirstly this article was terribly written and interpreted. Chow is mainly eaten as a snack and basically any fruit can be made into a chow. Very rushed and not well researched article. Only chutney is served alongside those dishes mentioned which is a grated chow. Please do better. \nSigned a Trinbagonian  A TrinbagonianTrinidad and Tobago 1/9/2021Explore Bon AppétitSaladTrinidadianCaribbeanPineappleFruitMangoStone FruitEasyQuickSideVegetarianVeganRawDairy-FreeGluten-FreeNut-FreeJuneteenthKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Peter", "Jeanine Prime"]}