{"id": "7723b87c27af6aeff04758affe660de9", "url": "https://www.bonappetit.com/recipe/one-pan-chicken-thighs-with-burst-tomatoes-harissa-and-feta", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Chicken Thighs with Burst Tomatoes, Harissa, and Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOne-Pan Chicken Thighs with Burst Tomatoes, Harissa, and FetaBy Molly BazJuly 7, 20194.4(66)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintQuick-cooking, budget-friendly, and pretty hard to screw up (that dark meat is automatically juicier), chicken thighs are our default weeknight dinner—and this is our simplest recipe yet. It's made in single pan in less than 45 minutes—and you don't even have to chop a vegetable. What's the shortcut? Harissa, a North African pepper-based hot sauce that's spicy, fruity, bright, and smoky—it brings the flavor so that you don't have to. While you can always make your own harissa, buying a jar at the grocery store is always a good option. Look for brands that list peppers as the first ingredient (sometimes they can be cut with tomato product, and that's not what you want) and taste it before you add it to the skillet: Different brands vary in spiciness, so you may have to go up or down in quantity depending. We love the version made by NY SHUK.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonCast Iron Skillet$30 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketWooden Spoon$6 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings6skin-on, bone-in chicken thighs (about 2¼ lb. total)3tsp. kosher salt, divided1½lb. cherry tomatoes (any color)¼cup harissa paste3Tbsp. red wine vinegar3sprigs oregano, divided4oz. fetaCrusty bread (for serving)PreparationStep 1Pat 6 chicken thighs dry with paper towels. This will help the skin get nice and brown. Season all over with 2½ tsp. salt. (When you're seasoning meat, a good rule of thumb is 1 tsp. salt per pound.)Step 2Place chicken (skin side down) in a dry large cast-iron skillet with the heat off. Heat over medium and cook chicken, undisturbed, until skin is very crisp and deeply golden brown and releases from pan (an indication that the skin is brown and crackly), 13–16 minutes. You have permission to rotate the pan (but not the chicken) from time to time to encourage all thighs to get equal love from the burner. And just like starting fish skin side down in a room temp pan guarantees crackly, bronzed skin, doing the same with chicken renders the fat slowly—and that means even browning and the crispiest skin imaginable.Step 3Using tongs, transfer chicken to a plate. Make sure to keep it skin side up: Placing that crispy skin against the plate will cause it to steam and sog, negating all of your hard work.Step 4Add 1½ lb. cherry tomatoes, ¼ cup harissa paste, 3 Tbsp. red wine vinegar, 1 oregano sprig  and remaining ½ tsp. salt to pan. Increase heat to medium-high and cook, stirring occasionally, until tomatoes have burst and released all of their juices, and the juices have started to thicken, 8–10 minutes.Step 5Nestle chicken thighs back into skillet (keep the skin side up) over tomatoes.Step 6Reduce heat to medium-low, bring to a simmer, and cook until chicken is just cooked through and flesh is no longer pink (an instant-read thermometer inserted into the thickest part near the bone will register 165°), and tomato sauce has thickened and a wooden spoon leaves a trail when dragged through, 6–8 minutes. Let sit 5 minutes—this gives the meat an opportunity to reabsorb the moisture that moved to the surface while it cooked. Sounds technical, but it means your chicken will be tender and juicy.Step 7While chicken cooks, cut 4 oz. feta into ¼\"-thick planks.Step 8Once chicken has rested for 5 minutes, break feta planks into large pieces, scattering over skillet. Some pieces will stay intact while others will soften into the sauce a little—and that's exactly what you want.Step 9Pick leaves off remaining 2 oregano sprigs and scatter over chicken and tomatoes.Step 10Serve with torn crusty bread for sopping up any extra tomato sauce.How would you rate One-Pan Chicken Thighs with Burst Tomatoes, Harissa, and Feta?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleTastes pretty darn good, but I find my chicken doesn’t always cook through on the stove top. I’ll move it to the oven for 400 for a bit next time. AnonymousSeattle 1/27/2022One of my “greatest hits” recipes, I make this again and again.  It’s easy, super delicious and different.Lkelly Austin, TX9/5/2021The BEST!  Only change I made was to grill the thighs until about half done, then added them to partially cooked tomatoes and spices for a taste of the grill.  (NO changes made during the winter!!)Beth BenoitMeredith NH6/3/2021Will cook it again with variation — 1/2 of Feta (less salty), will use grape tomatoes (not tart Cherry),  and will use skinless thigh for less fat.Gina RamosNorthern VA5/7/2021Thought this was just great, easy and with only a few ingredients, which we already had. Didn't have harissa paste, but had the harissa sauce, which comes in the square glass container.  So, I used 1/2 cup of that.  Served it with roasted spaghetti squash, which went perfectly.  Can reuse the sauce for other dishes!RonPReston, VA1/24/2021Good and fast meal! I did bake the chicken at 400 in the oven while the tomatoes were starting and everything came together at the same time. I liked the oregano but might use mint as a garnish next time for a little more varied flavor.Detroit, MI10/19/2020Loved this recipe! Tasted so amazing for being just one pot. This was great to make after work, not too complicated. Served this to friends and they couldn't get enough. I will say that I cooked the chicken a little longer than recommended after putting the thighs back in the pan, about 20 minutes. I used harissa sauce, only thing I could find at the store and could have used more to make it spicier, but it did create a nice sauce. But overall, easy recipe and a crowd pleaser! AnonymousNew York10/16/2020Have made this recipe several times. My family requests it regularly. I do have to cook the chicken longer than the time listed, but it’s a favorite!  Thanks Molly. AnonymousColumbia MO9/22/2020A perfect recipe for the abundance of cherry tomatoes exploding from my garden. Made the harissa myself and served the dish along side crispy smashed potatoes. I did add 1/4 cup water to the sauce during the last 5 minutes to give more time for my chicken to cook. Wonderful flavor profile. AnonymousCalifornia8/19/2020So delicious! I had no trouble getting the chicken cooked through within the times directed in the recipe. I mashed the tomatoes gently as they cooked to release more juice, so there was no problem with enough liquid. I was using fresh, homegrown tomatoes, so they were nice and juicy. If it looked like the dish was dry, I would have added a little broth. I will be making this dish again - perfect for summer!QuotidianCookKansas8/12/2020Delicious and easy. The harissa/tomato/red wine vinegar sauce has many layers and depth of flavor for a sauce that is cooked so quickly. a.goekler7491Denton, TX8/11/2020This recipe is terrific.  Made it exactly as outlined with my own harissa in a cast iron frying pan.  It was yummy and my pan cleaned up perfectly.  Can wait to make (eat) it again!  Many thanksAnonymousCanada8/10/2020As everyone else is saying, there's no way that the chicken cooks through at the top with this method. I finished it in my oven for 10 minutes at the end after trying to get it to cook for 45 minutes. In that time, the balsamic burned on the bottom of the pan - and this amount of acidity is horrendous for the cast iron. The only way to make again would be to institute a huge number of changes for a passably okay dish.AnonymousOrlando8/3/2020Super simple and way more flavourful than you'd think from such a small ingredients list! I used harissa sauce instead of paste - just what I could find at the store. This may have remedied the problem other people have apparently had with saucelessness. Chicken took longer to cook through than the recipe suggested, maybe 18 minutes instead of 6-8, but hey - we can all take a breather and accept that. Thanks, Molly!gretansdWinnipeg, MB, Canada7/28/2020Very flavorful but no real sauce accumulated in pan. Had to add broth to keep pan base wet.AnonymousBelmont, NC7/13/2020Explore Bon AppétitChicken ThighChickenPoultryCherry TomatoTomatoVegetableHarissaCondiments, Sauces & PastesFetaCheeseQuickEasyOne-Pot MealsWeeknight MealsMainGluten-FreeNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-07", "author": ["Condé Nast", "Molly Baz"]}