{"id": "772b30bf91751322a771901b07819c53", "url": "https://www.bonappetit.com/story/david-chang-2018-olympics", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Momofuku's David Chang Gives a Korean Food Tour Around Seoul for the 2018 Olympics | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMomofuku's David Chang Gives a Korean Food Tour Around Seoul for the 2018 OlympicsHe is NBC's official food and culture expert during the Olympics.By Evelyn WangFebruary 9, 2018FacebookTwitterEmailBen Gabbe/Getty ImagesFacebookTwitterEmailMomofuku maestro David Chang is taking on a new role just for the 2018 Winter Olympics. This week, as NBC's official food and culture expert during the Winter Games, he's eating his way around South Korea for your viewing (and eating) pleasure. On Thursday, the network aired his first segment, a culinary tour that introduces Olympic viewers to all the different varieties of Korean food:ContentThis content can also be viewed on the site it originates from.\"Korean food is really an amalgamation of food from all over the world,\" Chang starts off, while he visits a Seoul night market. \"You have Chinese sausages, you have Japanese dumplings, you have American roast lobster with cheese. It doesn't get more multicultural than this. So maybe you've tried kimchi or gone out for Korean barbecue, but that's for beginners. The streets of Seoul offer a next-level way to explore what this country is and was—all served up hot.\"After giving a brief history lesson about colonization in Korea, Chang heads to a truck stop to enjoy a bowl of budae jjigae, or \"army stew,\" which traditionally has spam, rice cakes, kimchi, ramen noodles, hot dog wieners. (He grew up eating the dish sans wieners.) \"It seems like a crazy concoction, but it's actually a soup or stew that was made out of necessity and resourcefulness, and a delicious one at that,\" he says. \"This is what I like to eat after a big night out, for sure.\"His next two stops are at a temple, where he goes foraging for vegan ingredients with a Buddhist monk, and then a three-star Michelin restaurant called Gaon, which he calls the \"pinnacle of gastronomy\" on this culinary tour. \"At Gaon, everything about the meal is designed to take you back in time,\" he says.Throughout his tour, David Chang sprinkles in bits and pieces about Korean history and culture, and ends with a challenge to broaden your horizons. \"Next time you're eating Korean food, just realize it's so much more than barbecue and kimchi,\" he says. \"You're only scratching the surface.\"1 / 29ChevronChevronGrilled Sliced BrisketView RecipeExplore Bon AppétitOlympicsKoreanDavid ChangRead MoreLifestyleWhat 6 U.S. Athletes Are Eating for Breakfast at the 2018 Winter OlympicsBy Alyse WhitneycultureAll of the Quirky Food Facts We Learned About Team USA's Winter OlympiansBy Maggie LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Evelyn Wang"]}