{"id": "773e6ae5c1c53a025cde4d55c3518526", "url": "https://www.bonappetit.com/recipe/tomato-curry-chicken", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Tomato-Curry Chicken Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesTomato-Curry ChickenFacebookPinterestTwitterEmailA cross between chicken tikka masala and chicken makhani (Indian butter chicken).PrintIngredients1 small onionOne 3-inch piece of ginger3 garlic cloves1 1/2 cups greek yogurt1 tablespoon garam masala2 pounds boneless, skinless chicken thighs3 tablespoons unsalted butter1 cup basmati rice2 (10 3/4 ounce) cans Campbell's Condensed Tomato SoupHandfull of cilantro sprigs1 Fresno chili or jalapeñoKosher salt and freshly ground pepperRecipe PreparationPreheat broiler to high with a rack in the top third of the oven. Cut root ends off of the onion, then cut the onion in half through the cut ends. Remove the peel and finely chop the onion. Using the side of a measuring spoon, peel the ginger. Slice off 3 thin coins of ginger and then finely grate the remaining. Peel and finely grate the garlic.In a large bowl, whisk ¾ cup of the yogurt with 1 ½ teaspoons of the garam masala and half each of the grated ginger and grated garlic. Season generously with salt and pepper.Cut the chicken into large bite-sized pieces and toss with the yogurt mixture.Scrape the chicken onto a rimmed baking sheet spread in a single layer. Broil, turning a few times, until golden and just cooked through, about 15 minutes.Meanwhile, while the chicken cooks, melt 1 tablespoon of the butter in a small saucepan, over medium-high. Add the rice, the ginger coins, and a large pinch of salt and cook, stirring, for 1 minute. Pour 1 ¼ cup of water into the saucepan and bring to a boil. Cover and reduce the heat to a gentle simmer. Cook until the grains are tender and the water is evaporated about 15 minutes.In a large high-sided skillet, melt the remaining 2 tablespoons of butter over medium and add the onion. Cook, stirring occasionally until softened, about 4 minutes. Add the ginger, garlic, and remaining 1 ½ teaspoons of garam masala and stir until fragrant, about 2 min.Pour 3/4 cup of water and the two cans of Campbell's® Tomato Soup into the skillet. Stir to combine and bring to a simmer.Scrape the cooked chicken from the sheet tray into the simmering sauce and gently simmer for 5 minutes. Season with salt and pepper.While the chicken simmers, pick the cilantro leaves and thinly slice the chili.Remove the ginger coins from the rice and divide among shallow bowls. Top the rice with the curry chicken. Dollop each bowl with the remaining yogurt and sprinkle with chiles and cilantro.Recipe by Campbell'sRelated VideoTomato-Curry ChickenReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}