{"id": "773e92179d589444fc30d7e80f4b9295", "url": "https://www.bonappetit.com/recipe/summer-gazpacho", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Best Gazpacho Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSummer GazpachoBy Rick MartinezPhotography by Alex LauSeptember 1, 20214.5(21)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIn the dog days of summer, we’re grateful for this no-cook gazpacho recipe, which comes together quickly in a blender. The raw preparation, however, means there’s no hiding behind substandard tomatoes—and you’ll want at least two varieties for this recipe, heirlooms for the base and cherry tomatoes for the garnish. If you aren't making the soup the same day you buy your tomatoes, be sure to store them on the counter (rinse them first to prevent fruit flies) to preserve their flavor. Once refrigerated, even the best ones will lose their glory. If you need a break from tomatoes, Cucumber-Tomatillo Gazpacho and Watermelon Gazpacho are just as refreshing on a hot day.Editor’s note: This recipe was originally published on August 8, 2016.Ingredients4  Servings½English hothouse cucumber, peeled, seeded½large red bell pepper, stemmed, seeded2pounds very ripe red tomatoes, preferably heirloom, cut into ½-inch wedges, 3 tablespoons seeds reserved½large shallot, chopped1garlic clove, finely grated2tablespoons (or more) sherry or red wine vinegarFlaky sea salt3tablespoons olive oil, plus more for drizzlingQuartered cherry tomatoes, chopped chives, and grilled or toasted country-style bread (for serving)PreparationStep 1Cut 2\" of the cucumber into ¼\" pieces and set aside for serving; coarsely chop remaining cucumber and place in a large bowl. Cut one-quarter of the bell pepper into ¼\" pieces and set aside for serving; coarsely chop remaining bell pepper and add to bowl with chopped cucumber. Add tomatoes to bowl and toss with shallot, garlic, 2 Tbsp. vinegar, and 1 Tbsp. salt. Let stand 30 minutes at room temperature to let flavors meld.Step 2Transfer tomato mixture along with any accumulated juices to a blender. Add 3 Tbsp. oil and purée on medium speed until smooth; season with salt and vinegar, if desired. Strain through a coarse-mesh sieve into a large bowl or pitcher and chill until cool, about 1 hour.Step 3Divide gazpacho among bowls. Top with cherry tomatoes, chives, reserved cucumber and red pepper pieces, and tomato seeds; drizzle with oil and season with salt. Serve with bread alongside.Step 4Do Ahead: Gazpacho can be made 1 day ahead; cover and chill.How would you rate Summer Gazpacho?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleDelicious. Finished mine with basil, mint and a bit of fetaAnonymousNew York, NY10/3/2021One word - YUMM! I'm sad i made this in Sept instead of earlier in the summer so we could enjoy it all summer long. It will definitely be on regular rotation next summer! Super easy to make and added some boiled shrimp to make it a complete meal. I think it would also be really great topped with some chopped avocado.Natcookie67Denver, CO9/15/2021This gazpacho is delicious, refreshing, and super easy! I stayed close to the measurement of ingredients called for but I'm sure it would be great with a bit of mix and match using what you have in the fridge and the pantry as long as you have great tomatoes and maintain the allium/pepper components.GFYSeattle WA9/4/2021Our Spanish gazpacho it’s made with white vinegar, not with red Jorge Barcelona 9/2/2021Love this recipe! Added some crispy chickpeas and it was so bright and delicious. lisacreatureportland5/11/2020I spiced mine up with a whole serrano pepper and a little crab meat.AnonymousFlower Mound, TX4/29/2020This gazpacho is like tomato-summer water, in a good way. The straining removes all chunks from the soup, so it’s closer to juice than what I think of as soup. Great flavor, especially after a day or so. AnonymousBrooklyn 10/18/2018This was totally delish.AnonymousMaine9/5/2018One question.  What is the benefit of pre marinating the ingredients whole?  I always blend and then let chill in the fridge for a couple of hours.CanarygirlSpain8/12/2018OMG can you have any more ads on your site?!?! Its giving me an aneurysm!Anonymous7/12/2018Explore Bon AppétitCold SoupSoupSoups and StewsSpanishEuropeanTomatoVegetableSummerEasyStarterMainDairy-FreeNut-FreeVeganVegetarianGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-08-08", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}