{"id": "7740c033f55010891fdac0fc1dccff3a", "url": "https://www.bonappetit.com/recipe/prosperity-salad-yusheng", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Prosperity Salad (Yusheng) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueProsperity Salad (Yusheng)By Simone Tong February 12, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Anna Billingskog, Prop Styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintChef Simone Tong of Little Tong Noodle Shop in New York, who developed this recipe, says: “Also known as Prosperity Toss, this is a Cantonese-style raw salad made with various shredded vegetables and assorted toppings, a sweet plum sauce, and slices of raw fish. Each ingredient has a corresponding auspicious greeting with it. This dish is usually served as an appetizer to raise good luck for the new year by everyone gathering around the dining table and raising their chopsticks to mix the ingredients of the salad together.” Read more about Chinese New Year and find the full menu here.Ingredients8 servings¼cup plum sauce2Tbsp. low-sodium soy sauce1Tbsp. toasted sesame seeds1tsp. Chinese five-spice powder1tsp. toasted sesame oil½tsp. ground cinnamonKosher saltVegetable oil (for frying; about 4 cups)10square wonton wrappers, cut into ½\"-thick strips4oz. best-quality salmon, thinly sliced, or 4 oz. sliced smoked or cured salmon2medium cucumbers (any kind), cut into matchsticks2Asian pears, thinly sliced2grapefruit or 1 pomelo, peeled, segmented1large carrot, peeled, cut into matchsticks1medium daikon, peeled, cut into matchsticks1bell pepper (any color), cut into matchsticks3Tbsp. pickled gingerPreparationStep 1Whisk plum sauce, soy sauce, sesame seeds, five-spice powder, sesame oil, and cinnamon in a medium bowl; season sauce with salt and set aside.Step 2Pour oil into a large skillet to come about halfway up the sides. Heat over medium-high and add 1 wonton strip (this will be your tester to ensure oil is hot). Once wonton begins to sizzle around the edges and starts to shrivel, the oil is hot enough (if you have a deep-fry thermometer, it should register around 350°).Step 3Working in batches, fry wonton strips until golden and crisp, 30–45 seconds. Using a slotted spoon, transfer to paper towels to drain.Step 4Place salmon in the center of a large platter. Arrange cucumbers, pears, grapefruit, carrot, daikon, bell pepper, ginger, and fried wonton strips around salmon. Drizzle reserved sauce over and toss together with your guests before serving.How would you rate Prosperity Salad (Yusheng)?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCantoneseChineseEast AsianAsianSalmonFishSeafoodAsian PearFruitDaikonVegetableEasyStarterSideDairy-FreeLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Simone Tong"]}