{"id": "774f4ae8ab914df8dc9013bf17962a24", "url": "https://www.bonappetit.com/story/fried-garlic-chips", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Fried Garlic Chips Are the Extra Crunchy Topping You Need to Put on Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFried Garlic Chips Are the Extra Crunchy Topping You Need to Put on EverythingA nutty, crunchy, crispy condiment that makes any bowl of salad, soup, pasta, or [fill in the blank] better.By Alyse WhitneyOctober 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIf you eat salad for the croutons and tomato soup for the grilled cheese, you should be making garlic chips... to put on everything. These thin-sliced pieces of heaven crisp up in minutes and add a nutty, garlicky crunch factor to rice, stews, salads, and really anything at all.Making them is incredibly easy, if you have a mandoline. (And if you don’t—get one. We like the Benriner Japanese mandoline.) It’ll slice the cloves more evenly and thinly than your chef’s knife—just watch your fingers! Keep in mind too that this is not the time to use your favorite olive oil. We use a neutral oil like vegetable or grapeseed because, 1) you want the favor of the garlic to shine through, and 2) you want the garlic chips to be versatile—olive oil may be great for topping aglio e olio, but it doesn’t complement soy sauce and sesame oil as well.Mandoline + garlic = perfect chips, every time.\nPhoto by Alex LauCrispy garlic chips happen pretty fast, so keep your eye on the prize. You start the garlic in cold oil so it comes to temperature evenly, and you’ll know the chips are done when the oil stops bubbling around the edges and they turn slightly golden. Be conservative here and pull them out as soon as they hits a light golden-brown. It will take time to fish out each sliver with a slotted spoon, so work fast and in batches. Nothing tastes sadder than bitter burnt garlic.Check out the crispy, crunchy garlic chips on this garlicky fried rice.\nPhoto by Alex LauOnce you drain them on a paper towel, they are a nice little sweet, slightly nutty, and garlicky topper. They are best still warm and scattered atop the aforementioned fried rice, ricotta toast, seared steak or short ribs, weeknight pantry pasta, etcetera, etcetera, etcetera. They can be kept in an airtight container for a few days, so grab a few extra garlic heads and make a double batch. And while you’re at it, maybe consider investing in an extra tin or two of mints?Want more garlic? Try this chicken:Explore Bon AppétitGarlicToppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Alyse Whitney"]}