{"id": "775bf26d5ecb7778f29bf720f20f79bb", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/cafe-de-lambre", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Café de l‘Ambre Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoCafé de l‘AmbreWhat people are talking about when they praise Japanese coffee.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: to pay homage to one of Tokyo’s most venerated coffeehouses. The owner Ichiro Sekiguchi is over 100 years old, but his shop is as relevant and interesting today as it was when it opened in 1948. Beans are roasted in-house and in small batches a mere number of feet away from where they are brewed, and the staff prepares the single-origin coffees with precision and care. A variety of specialty drinks showcase Sekiguchi’s open-mindedness toward what coffee can be—the rigidity of other shops has no home here.ORDER THE: single origins if you crave coffee at full volume. Or try one of the speciality drinks for something more playful. The café oeufs, a cup of hot barely sweetened coffee that has been fortified by the addition of a raw egg yolk, is particularly interesting. The yolk does all the things that cream does for coffee but with more richness and finesse. Drink it fast though, before the eggs start to set.THE VIBE IS: nostalgic. In all its years of operation, very little has changed here. It‘s still a cozy little haven where the cognoscenti can escape the hordes of shoppers buzzing around Ginza. No matter what year it actually is, inside this shop it will feel like a bygone era.PRACTICAL STUFF: Open Monday through Saturday from 12 p.m. to 10 p.m., and Sundays from 12 p.m. to 7 p.m. The menu is available in English and the staff also speaks some English. The nearest subway stations are Ginza and Shimbashi.Photo by Xavier Girard LachaîneThe beans are roasted in-house, just feet away from where they‘re brewed.\nPhoto by Xavier Girard LachaîneThough the shop opened 70 years ago, it‘s still as relevant as ever.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}