{"id": "77640a9cc10c744efa56fae0ea05428e", "url": "https://www.bonappetit.com/story/monells-nashville", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "How Monell's in Nashville Melted My Icy, Jaded, Overfed Heart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Nashville Restaurant That Melted My Icy, Jaded, Overfed HeartMonell’s is good, clean, all-you-can-eat, family-style fun.By Amiel StanekMay 30, 2019FacebookTwitterEmailPhoto by Rick MalkinFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I could not, for the life of me, figure out what was taking so long. It was nearly 2 p.m., and my buddy Jesse and I had put our names on the list for lunch at Monell’s Dining and Catering in Nashville at least forty minutes before, and judging by the number of larger groups I had spied in the dining room and waiting on the patio for tables, it made no sense that we would have to wait so long for a table for two. To be fair, I was in town on a mission—to check out as many new restaurants as humanly possible in 72 hours and report back—and on day two I was grumpy, over-fed, hungover, and exhausted. But Jesse insisted on southern food at Monell’s. And there we were.Suddenly, the doors opened, and a flood of grinning people spilled out in one continuous, jovial stream, all belly-laughs and back-pats. They all seemed to know each other. Ah! I thought to myself, The restaurant had a buy-out! That’s why we were all waiting for so long. I’m a smart guy who used to work in restaurants; I know what’s going on.Five minutes later, the host began beckoning the waiting throng inside, party by party. When our name was called, we were whisked through a maze of rooms until we were shown to our seats, the two remaining places at a heavy wooden table for 14. I scanned the faces of the strangers surrounding me, all awkward smiles and nervous laughter, trying to figure out if anyone else knew what the hell was going on. And then our server approached the table and began the speech.Okay y’all, here’s how it works. You got cups with ice in front of you, sweet tea in that pitcher, unsweet tea in that one, and lemonade in that one. Food’s gonna come out fast and family style, and y’all are gonna pass to the LEFT. Food gets passed to the LE-EFF-TUH. Don’t be shy—we’ll bring more of whatever you run out of. Y’all are gonna get to know each other!Half the parties—older couples, families—seemed to know what was about to happen; the other half—other tourists, bachelorette parties—seemed as stunned and bemused as I was. And then, all at once, the southern food avalanche engulfed us all.Pulled pork. Cole slaw. Fried chicken. Collard Greens. Meatloaf. All piled high in bulging baskets and massive mismatched bowls. Cornbread. Corn pudding. Biscuits. Sausage gravy. We passed to the left; we could not believe we were still passing to the left. Green beans. Mac and cheese. Banana pudding. More of everything. Seriously: more of everything. The sheer too-muchness of it all had plastered a gigantic, goofy grin on the faces of literally every person around that table, and the volume, once respectful and hushed, had crescendoed to a giddy, sweaty fever pitch.At some point I accidentally made eye contact with a woman sitting across the table from me who, it seemed, was also on her sixth “last bite.” We sighed in unison, let our forks fall to our plates with a satisfied clang, and chuckled like old friends. And that was when it all made sense. There hadn’t been a buy-out before we got there. Those people I had watched walk out of Monell’s like they were about to march in a parade together didn’t know each other from Adam. But they, like us, had all been sat at long tables at the same time. And they, like us, perfect strangers, had broken bread together. Spooned the gooiest mac ‘n’ cheese onto each other’s plates and shared oh my LORDs and passed to the left the left the LEFT until they couldn’t be anything other than friends. They hadn’t just eaten; they had been fed.And that, dear readers, is the best meal I had in Nashville that weekend by a mile.Go there: Monell’s Dining and CateringExplore Bon AppétitRestaurantsNashvilleHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-30", "author": ["Condé Nast", "Amiel Stanek"]}