{"id": "77691422e4f5ca0c5e8fea5a0a35cc9e", "url": "https://www.bonappetit.com/story/no-cook-pasta-puttanesca-never-fail", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "No-Cook Puttanesca Is Here To Save Your Very Sweaty Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNo-Cook Puttanesca Is Here To Save Your Very Sweaty SummerAll the things you love about a classic puttanesca (salty! briny! olive-y!), but above-90-degree-friendly.By Rachel KartenAugust 2, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Maggie RuggieroFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Here's a thing I will do in the summer: put pasta in boiling water then stand five feet away from the pot. And here's a thing I won’t do in the summer: cook anything that requires me to be directly next to my stove for more than five minutes. Which is why I was very excited that Andy Baraghani’s new spaghetti with no-cook puttanesca recipe met all of my VERY strict summer cooking requirements.His Stovetop Lite recipe takes all the things I love about a classic puttanesca (salty! briny! olive-y!), and makes it above-90-degree-friendly by eliminating the need to, you know, cook the sauce or be in the vicinity of a burner. Plus, it’s super simple to throw together. Like, so simple that you could text a friend the recipe. Actually, let's just do it like that. Here’s how my text would read:\"Hi [insert friend’s name]! So glad you asked me for a pasta recipe that's appropriate to make after spending 20 minutes sweating on the subway platform. First, pulse 2 beefsteak tomatoes (remove the seeds by cutting them in half and giving them a squeeze!), 2 cloves of grated garlic, 1 tsp. of red pepper flakes, and a big pinch of salt in a food processor until smooth. Yes, you can use a blender in a pinch. Then transfer all that sauce to a large bowl and mix in lots of halved cherry tomatoes, 1 cup of crushed and pitted Castelvetrano olives (the only olives that matter), 2 tablespoons of capers, and about a ¼ cup oil.Cherry tomatoes give this sauce an even brighter flavor.\nPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolMeanwhile, throw your spaghetti in a large pot of boiling salted water—for minimal heat impact stand very far away while it cooks. I work at Bon Appétit, so of course you're going to save ¼ cup pasta water. That's the law. Then add your al dente pasta, ¼ cup of chopped parsley, and three tablespoons of unsalted butter to your bowl o’ sauce. This part is important: toss everything very vigorously with tongs, while adding a splash of that pasta cooking liquid as needed to create an emulsified sauce that coats pasta. Like really toss—you want the tomato sauce to really cling! Divide serve your pasta in bowls and drizzle with MORE oil. Find a chair and throw it directly in front of your A.C. unit. Marvel at the fact that you are not sweating.\"That’s it! That's my text. And that’s the recipe. The dish is a super bright and savory pasta that you can make without the slightest chance of breaking a sweat—a rare feat on a way-too-hot summer day. And even rarer when you also happen to be making pasta.Get the full recipe:Spaghetti with No-Cook PuttanescaA bright, summertime pasta sauce packed with in-season tomatoes and briny olives.View RecipeExplore Bon AppétitNever FailBasicallyPastaTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-02", "author": ["Condé Nast", "Rachel Karten"]}