{"id": "776e544720d068a3074e9d3e961f5396", "url": "https://www.bonappetit.com/recipe/salvadoran-quesadilla", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Salvadoran Quesadilla Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueSalvadoran QuesadillaSeptember 22, 20204.6(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintNot to be confused with the Mexican dish by the same name, Salvadoran quesadilla is a sweet-salty cheesecake that’s often eaten for breakfast with coffee, but at Popoca in Oakland, chef Anthony Salguero serves it as dessert. “I’m not a huge dessert person, so it’s perfect for me—the Cotija adds a distinct salty funk that really balances all that sugar,” Salguero said. “I also like that it incorporates sesame seeds, which some people associate with Asian food but are actually a huge part of Salvadoran cuisine.” If you can’t find finely grated Cotija cheese, grate it yourself by pulsing in a blender or using a Microplane. Making the cheese fine is crucial in ensuring that it melts into the cake instead of turning clumpy and rubbery as it bakes.Ingredients8 - 10 Servings1cup (2 sticks) unsalted butter, melted, slightly cooled, plus more2½cups all-purpose flour1Tbsp. baking powder¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt7large eggs2cups sugar¾tsp. vanilla extract3cups finely grated Cotija cheese1cup whole milk¼cup sesame seedsFlaky sea saltPreparationStep 1Place a rack in middle of oven; preheat to 375°. Butter an 18x13\" rimmed baking sheet. Whisk flour, baking powder, and kosher salt in a medium bowl. Separate eggs, placing yolks in the bowl of a stand mixer fitted with the paddle attachment and whites in a small bowl.Step 2Add sugar and vanilla to egg yolks and beat on medium-high speed until very pale and fluffy, about 2 minutes. Reduce speed to medium, add cheese and beat just to combine. Reduce speed to low. Add milk in 3 additions, incorporating completely after each addition before adding more. With motor running, stream in 1 cup melted butter and beat until combined. Gradually add dry ingredients and beat until combined, about 1 minute. Scrape batter into a large bowl.Step 3Thoroughly clean and dry mixer bowl. Combine egg whites and a pinch of salt in bowl. Using whisk attachment, beat, starting on medium-low speed and gradually increasing to medium-high, until tripled in volume and medium peaks form, about 2 minutes.Step 4Add half of egg whites to batter and fold in with a rubber spatula until no streaks remain. Repeat with remaining egg whites. Scrape batter into prepared baking sheet. Sprinkle sesame seeds, then sea salt over. Bake, rotating halfway through, until a tester inserted into the center comes out clean, 24–28 minutes. Let cool slightly. Run an offset spatula or paring knife around edges. Slide out onto a cutting board; cut into 3\" squares.Step 5Do ahead: Quesadilla can be baked 3 days ahead. Store tightly wrapped at room temperature.How would you rate Salvadoran Quesadilla?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangle100/10! i made a lot of mistakes and im an amateur baker but even then it came out DELICIOUS! My mom loved it and so did my brother and his boyfriend. Definitely making this again as it used to be a big part of my childhood. Im mexican and guatemalan but my grandma would make it sometimes when i was little.MansonRancho Cucamonga,CA1/29/2022I'm salvadorean and this is one of my favorite sweet breads ever. Another traditional way of making this recipe in some parts of the country is with rice flour, which is a great gluten free alternative.JuliaSan Salvador, El Salvador8/31/2021So tasty! Love the savory and not too sweet flavor... And such a great texture. This full recipe makes a ton for a household of three, but they freeze wonderfully. Much praise from friends and family who have been gifted a square or two from time to time! It's the perfect treat to have on hand. Ready to make my next batch!Nicole STruckee, CA4/25/2021Perfect For those who are trying to avoid to- sweet recipes. Also enjoyable with Cotija cheeseRicardo SandovalMexico City3/9/2021These were just delicious. My husband eats them warmed for breakfast, and unheated for dessert. I would not normally make a full recipe, but in this case, because they are so versatile, I did. Highly recommended and highly addictive. Thank you for opening this cuisine to us.Kathleen BakerBrewster, MA1/9/2021Delicious! I added some coconut shavings on top for added flavor and texture Miami10/26/2020Subbed feta and halved the recipe to fit in a 8x8 ceramic, otherwise made as stated. Turned out absolutely amazing, perfect salty/sweet combo. Friends and I couldn't stop eating it.Katy10/21/2020well, i read the other review and used 2/3 cup sugar. substituted almond and oat flour and feta cheese (sheep) due to dietary issues in our home. i liked it a lot.  could have even less sugar. yum.nantssan diego10/5/2020WOW!\nToo much sugar!AnonymousSandia Park, NM10/5/2020Explore Bon AppétitCakeDessertSouth AmericanLatin AmericanSalvadoranCentral AmericanCotijaCheeseBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}