{"id": "776f71561e1ce1eb6d97850f1d36e14c", "url": "https://www.bonappetit.com/story/out-of-milk", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "This Grocery List App Helps Me Cook With What I Have Instead of Heading to the Store Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThis App Helps Me Cook With What I Have Instead of Heading to the Store AgainShop your pantry before the supermarket.By Nayantara DuttaApril 17, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I have three roommates and limited pantry space, so stockpiling food for quarantine wasn’t quite in the cards. Instead, I’ve been using the Out of Milk app to track what I buy, help me shop smarter, and experiment with new recipes.My grocery list used to live across Post-Its and phone notes, but this app thankfully keeps everything in one place. When I get home from the store, I check off the items I bought and add them to the app’s pantry list, so I remember to use them. Over time, I’ve noticed which items get used up and re-added to the list, which helps me buy things I will actually cook with rather than more green beans (that I stare at for two weeks then feel sad about throwing away).The next step was to catalogue my whole pantry. Last week, I went through shelf by shelf and arranged everything on the countertop. Seeing everything at eye level helped me realize what I would realistically use and what I should give away (looking at you, mini jar of strawberry jam). When I decided to keep something, I added it to the app, and moved it back into the pantry. I also optimistically reorganized my food (oats to the front!) to ward off midnight snacking.I found marshmallows and rewarded myself by making s’mores, then felt motivated to get creative by cooking with what I already have. Chili-lime peanuts inspired me to make pad thai for the first time, dried apricots and marcona almonds rounded out a cheese board for my roommate’s birthday, and a surprise jar of cookie butter motivated me to dust off my ice cream maker and try out a new flavor.Shopping my cabinet has helped me see that I have enough to take care of myself. I’ve realized that I don’t need every single ingredient to make a great meal, and that I can be comfortable owning less. Still, some days are better for cooking than others: I’m heating up some frozen pizza tonight.Check it out:Out of MilkExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThis App Is the Calmest Thing in My Life Right NowBy Joanna FoxRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-17", "author": ["Condé Nast", "Nayantara Dutta"]}