{"id": "777530589acc3bdcfd88bf7d2c6774db", "url": "https://www.bonappetit.com/story/pasta-shish-barak", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "This Pasta Is So Creamy, Tangy, and Delicious, I Can Never Look at Mac n’ Cheese the Same Way Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pasta Is So Creamy, Tangy, and Delicious, I Can Never Look at Mac n’ Cheese the Same Way AgainPlus, it’s so flexible, chances are you can make it with what you already have in the house.By Sohla El-WayllyApril 2, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailOver the past couple of weeks that I’ve been quarantined at home, I’ve come to learn an interesting truth about myself: That fermented dairy, of all things, is my panic-shop comfort food. How’d I become so in touch with myself, you ask? Take one look at my fridge: Right now I have eight pounds of cultured butter, three types of yogurt, a container of creme fraiche and sour cream, oh, and three quarts of kefir all ready for me to use.But I’ve stockpiled so much fermented dairy because I use it in everything—a bright olive sauce for roasted squash, the marinade for my chicken biryani, chewy grains bathed in buttermilk—and because it can last a while, an important thing as my grocery shops become fewer and farther between. But it’s also because fermented dairy is the key to one of my favorite dinners: a cheerfully green pasta so creamy and tangy and delicious, you won’t be able to look at mac and cheese the same way again.Based on shish barak, little lamb and pine-nut dumplings served in a garlicky yogurt sauce from the Levant (a region that really loves its fermented dairy), it borrows many of the same ingredients, but recomposes them on the plate. There’s whole-milk yogurt (or kefir plus egg yolks) blended up with garlic and dill for the bright sauce. There’s spiced lamb seared so hard it reminds me of my mother’s charred koftas. And then there’s chewy-sweet dried currants and butter-toasted pine nuts to top it all off.But what makes this dish everything I need and want right now is how flexible it is. Sure, the recipe calls for full-fat yogurt or kefir, but if all you’ve got is the thicker Greek stuff, just use less and add a bit of pasta water. Only buttermilk in your fridge? Add an extra yolk for more body. No lamb? Any ground meat will work. Or keep it vegetarian with some wilted greens, creamy lima beans, or crisp-tender asparagus instead. No pine nuts? Use whatever nut you’ve got, just chop them up to roughly pine nut size so there’s buttery crunch with every bite. Out of currants? Use any dried fruit, taking care to dice up the larger specimens. No dill but lush with chives and parsley? That sounds absolutely perfect, too. Orecchiette are great, but elbows, penne, rigatoni, and shells will all shine.What I’m trying to say is, no matter what you do, everything will be fine. This is a forgiving recipe, which is exactly what we all need right now. That, and a few more pints of labne.Get the recipe:Spiced Lamb and Dill Yogurt PastaYou’ll find all the flavors of Middle Eastern shish barak (tiny lamb and pine nut) dumplings here, but made simpler and brighter with help from dried pasta and plenty of fresh dill.View RecipeExplore Bon AppétitPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Sohla El-Waylly"]}