{"id": "77750c37d8faf4755cdc7a41bafd17a5", "url": "https://www.bonappetit.com/story/teachers-strike-west-virginia", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Teacher Strike Eats: 'Strike Tacos,' Delivery Pizza, and Bagged Lunches Fuel a West Virginia Walkout | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow 'Strike Tacos,' Delivery Pizza, and Bagged Lunches Fueled an Activist MovementThe West Virginia teachers' strike brought thousands of public school teachers to the state capital. Here's how they got fed.By Brooke ShumanNovember 6, 2018FacebookTwitterEmailPhoto by Bloomberg via Getty ImagesFacebookTwitterEmailEarlier this year, teachers across the state of West Virginia left their classrooms and went to the State Capitol Building to demand better wages and healthcare for all public employees. After nine days standing and holding signs on highways in bitter February weather, the teachers won a five-percent pay increase from the state legislators. Jessica Salfia, a public school teacher at Spring Mills High School in Berkley County, West Virginia, says that she and the teachers couldn’t have kept going without the steady arrival of gift packages, pizzas, and what became known lovingly as “strike tacos” from supporters locally and across the country.Since the West Virginia teachers returned to their classrooms, similar statewide strikes have happened in Oklahoma, Arizona, Colorado, Kentucky, and North Carolina. Salfia has been a public educator for 15 years and is one of the editors of 55 Strong: Inside the West Virginia Teachers Strike, an oral history of the strike published by Belt Publishing. Here Salfia talks about how the West Virginia teachers’ strike was fed. – Brooke ShumanThat first night of the strike, my friend and I drove to Charleston, West Virginia and spent the first two days at the Capitol, lobbying. That was exciting. I learned a lot about what legislators know and don't know about the struggle of the public educator.  I learned a lot about how legislation works, which the whole public needs to take a course in because I think we'd get a lot more done if we all were as engaged as the West Virginia Public Employees were then. I've never been more inspired by my fellow West Virginians, by my fellow teachers. I don't know if I'll ever see anything like it again.A sign at the West Virginia teachers' strike.\nPhoto courtesy of Jessica SalfiaA lot of legislators, when it looked like we were for-sure going to be walking out, began using lunch and food as a weapon to vilify educators. They said, ”If teachers leave their classrooms, kids aren't going to eat.” Our local delegate published an op-ed in the Berkeley County paper leading up to the strike that said, \"Teachers are threatening to strike against our students,\" which was the most ridiculous thing I had ever heard. ​People don't realize that, in schools every day, teachers are feeding kids that need fed. They're putting clothes on the backs of kids who need clothes. They're going on home visits. They're buying school supplies for kids who don't have it. So if we're not gonna take care of our teachers, then those kids are not gonna get taken care of.Local school boards issued ads in the paper and sent out emails saying they would accept food donations. Then teachers converged on those locations to pack a grab-and-go-style lunch. They had such an overwhelming response to the first couple calls for donated food. It was all day on the picket line and then an evening of lunch packing somewhere. The packing of the lunches was first an act of love but also an act of strategy because it sent a clear message to both the public and the legislators that this was not about leaving our students behind.Those first days, there was a line that wrapped out across the Capitol grounds and you had security walking down the line saying, \"You're at two hours. You're at three hours,\" to get in.  So once you got in you didn't want to get back out. You didn't want to leave because maintaining presence in the Capitol was so important to keeping pressure on legislators, and so those pizzas, that food that got delivered to the Capitol, was critical to keeping teachers present and keeping pressure on the legislation. I would say there were hundreds of pizzas delivered from all over the country to the picket line. I know pizzas got delivered from California, from Wisconsin, from neighboring states. I think I cried every day over food. I have never seen support in the form of food in such a way.We were right outside this little Mexican restaurant called Cinco de Mayo; it's in the strip mall, and someone stopped by, a parent, and went in and purchased like $200 worth of tacos. They're so good. And so here comes the guy who owns Cinco de Mayo out with these giant pans and you could just hear this hush come over the crowd, like, \"Are those strike tacos?\" Another day these two teachers from Michigan took the time to ship a six-pack of beer with a sweet little note inside of it that just said, \"Hey, you guys are crushing it. Stay strong, keep going.”And just the knowledge that so many teachers, not just in West Virginia but all over the country, were watching our fight for respect and for healthcare—it was just so important to see that recognition come in the form of food. And I mean, it was cold. It rained really hard. It spit snow. The weather was not good. And that's something that made that food that people brought over so special, because when you're cold and tired and someone shows up with hot coffee and hot soup ... that is love in its most pure form, in my opinion.Explore Bon AppétitHealthyishTrends + NewsInterviewsRead MorecultureA Day Without Women is a Day Without HealthyishBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Brooke Shuman"]}