{"id": "778823820871e6036689efbb6e5bb02e", "url": "https://www.bonappetit.com/story/frozen-margarita-pie-is-as-incredible-as-it-sounds", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "This Frozen Margarita Pie Is Full of Tequila and Just As Incredible As It Sounds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Frozen Margarita Pie Is Full of Tequila and Just As Incredible As It SoundsIt's tart and creamy and boozy and exactly what you need when it's stupid hot outside.By Jesse SparksJuly 17, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailMargaritas are one of the greatest gifts humankind has been given. This is not up for debate. They’re refreshing and bright, boozy and cooling, just what the doctor ordered every single time. Another beautiful, perfect treasure? Pies! Crumbly, sweet, full of all kinds of decadent goodness. But you know what is one of the worst things ever? Having to pack up everything you own to move to another apartment in the middle of muggy July—which, in case you didn't catch on, is what I found myself doing last weekend. And the only thing that made the horror of moving in the heat of the summer bearable were the two aforementioned Good Things combined to form one Very Good Thing: Frozen Margarita Pie. It's light, creamy, pleasantly boozy, and so easy to make that I managed to do it with about two thirds of my kitchen already in boxes.I’d been dreading the impending packing, box lugging, and, really, the whole concept of moving for weeks. I decided to cope the way any responsible, well-adjusted adult would: by trolling the top-secret files of yet-unreleased BA recipes for something to make instead. And when I saw the recipe for that margarita pie, I volunteered to make it for this story weeks before anyone else even knew it was coming down the pipeline. With top secret information in-hand, and packing to avoid, I decided to be my own hero and make this pie.As complex as the recipe sounds, it was so easy to make that I was ready to volunteer to host a housewarming party in the home I hadn’t even moved into yet. I just tossed a bunch of graham crackers into my food processor, added salt, sugar, and melted butter, and pulsed it all until I got a bunch of fine, even crumbs. Then I put it all in a glass pie tin, used the bottom of a measuring cup to smooth it all into a firm, smooth layer all along the bottom and sides, and slid it into the freezer.The good stuff: sweetened condensed milk.\nMarcus NilssonIn another bowl, I whipped heavy cream until I saw stiff peaks telling me to lay off. Then I folded in half of my whipped cream into a combination of lime juice, sweetened condensed milk, and tequila that I had ready in a separate bowl. (Pro-tip: No one will tell on you if you take a swig of the tequila during the process. Especially if you're alone.) Once that was all smooth, I folded in the rest of the whipped cream, poured the creamy mixture into my now-frozen crust, and popped it back into the freezer to chill overnight. The next day, I topped it off with a sprinkling of lime zest. And just like that, I had brought Frozen Margarita Pie into the world.The best part? This pie tastes like what you hoped margaritas would taste like when you were a kid who wanted a sip of a cocktail just because you weren't allowed. It has the tang and acid of limes and the tequila-y kick of a great summer cocktail, all while remaining delightfully light and almost airy. The condensed milk and whipped cream made for a texture that was like a key lime pie-icebox cake lovechild. I was a little worried it would be too boozy—okay, not that worried—but the pie feels like a refined margarita in the mid-afternoon, rather than a lukewarm bag of pre-mixed margs at a fratty tailgate.And it all came together with hardly any effort or energy. As I waded through a room full of half-filled boxes and other monuments to my waste, the thought of making this pie again and eating it on the beach with friends was exactly what I needed to spur me on.Get the Recipe:Frozen Margarita PieYour favorite cocktail in pie form—what's not to love?View RecipeExplore Bon AppétitBasicallyTequilaPieFrozen DessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Jesse Sparks"]}