{"id": "778932d798e97057a999e8acbc2c7de5", "url": "https://www.bonappetit.com/story/oyster-oyster-dc-sustainable-takeout-packaging", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "Eco-Friendly Take-Out Containers Could Make Takeout Less Terrible for the Environment | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsCan Takeout Be Less Terrible for the Environment? This Chef Thinks So.At Oyster Oyster, chef Rob Rubba is reimagining takeout, one to-go container and growler at a time.By Elyse InamineApril 30, 2021FacebookTwitterEmailIllustration by Jose Berrio FacebookTwitterEmailSustainability was always the focus of Oyster Oyster, chef Rob Rubba’s veg-forward tasting menu restaurant in Washington, D.C. “Climate change is pretty darn real,” he says. “So I was thinking about what a plate of food will need to be 10 years from now.” At Oyster Oyster that means no citrus or olive oil (due to the carbon footprint of transporting them), no meat (just shellfish), and ingredients sourced from nearby farms. “We’re a restaurant that’s about restraint,” Rubba says. “It was an exercise that prepared us for takeout.” COVID-19 not only delayed the restaurant from opening last March but also forced the team to reimagine their fine-dining setup as packaged meals to go when it did finally open last summer. And that same sustainability-minded ethos drove the way Rubba thought about the whole take-out experience. “We never wanted to do takeout, but we realized we needed to do it or we wouldn’t see the other side,” he says. Here he introduces the Oyster Oyster way, which involves biodegradable utensils, tote bags, and a little ingenuity.Sugarcane To-Go Containers“Our restaurant supply company had these Tellus containers in stock, so we decided to try them out. For us, they made sense—they’re compostable and made of sugarcane fibers that are left over from milling. The only thing is that you can’t put anything wet in it. If we tried serving polenta, it would flop out the bottom. So we put a non-spray, compostable parchment paper to help.”Growler Program“There is nothing revolutionary about a growler program. We’re just a restaurant doing it. Our thought is that instead of selling single-use containers of beers, like six-packs, we could create a closed loop. We have a tap system for the beers and bought glass jugs from an American maker to reduce the carbon footprint of traveling across the country. When a guest orders beer, we fill the growler, they bring it back, and we do a three-part sanitizing process to clean the growler so it gets cycled back in.”Bamboo Utensil Kit“When we first opened in the summer, picnicking was big, since we have all these little parks in D.C. Friends were meeting up for socially distanced lunches, and we were getting requests for silverware. The last thing we wanted to do was introduce more stuff and, honestly, there’s no perfect solution for this. We looked into sugarcane utensils, but they use so many resources and don’t compost well, so we ended up with these EcoChoice bamboo ones. Even if someone left them on the ground, they would biodegrade.”Compost Pickup“What’s the point of us singing this song of sustainability if our guests don’t have access to composting? I knew it would be hard for people to compost during this time, and I didn’t want people to feel guilty about it. So I felt like it was important for us to offer this as a resource. We work with Compost Crew since they compost on a commercial scale, accepting not only banana peels and eggshells but also meat. We let customers know they can bring their compost in kickback emails after they place their orders.”Tote Bag“We’re getting into tote bags, so we don’t put another paper bag into the environment. Packaging is evil no matter what, but at least tote bags act as a conduit for better practices. Our bags are made of organic cotton and printed by a Custom Ink shop near us. We collaborate with An-Phuong Ly of An Made to decorate the bags with natural dyes made of our onion scraps.”Reusable Containers“We work with Fresh Impact Farms, which does hydroponics in Arlington, Virginia. They grow these beautiful flowers and herbs, and they deliver them in little Rubbermaid containers. I really liked them and thought a dish could fit in there. So now we’re creating a program where you can sign up for a container like this for your takeout. You bring it back and get a return deposit, and we sanitize. It’s like the old milkman system.”Oyster Shell Collection“In D.C., every restaurant is part of the Oyster Recovery Program, which takes used oyster shells to rebuild the reef. We sell oysters and have a bin to collect shells at the restaurant—we put that information out there for our customers through kickback emails, so they know they can bring the shells to us. With some of the deeper, nicer shells we receive, we turn them into votive candles. It’s not the most practical thing to do, but if something can be repurposed, it creates a longer lifeline for the product.”Sugarcane and Bamboo Napkins“There is so much gray area with this stuff, to be honest. We were looking at the local versus global impact of these napkins. Bamboo grows fast, can grow anywhere, and doesn’t require cutting down and milling trees, so that was the way to go for us. We don’t get anything fancy, just these bamboo and sugarcane pulp napkins from Caboo. It’s the little things that we’re mindful of.”Explore Bon AppétitRestaurantsWashington, D.C.SustainableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-30", "author": ["Condé Nast", "Elyse Inamine"]}