{"id": "77b65b9d7dc7b3357330870f532ec94c", "url": "https://www.bonappetit.com/story/danny-trejo-tacos", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Danny Trejo’s Been in Approximately 300 Movies, but Have You Tried His Tacos? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureDanny Trejo’s Been in Approximately 300 Movies, but Have You Tried His Tacos?You know him as Machete, or the uncle in Spy Kids, or that guy who gets his head stuck onto a tortoise in Breaking Bad—but it’s tacos that taught this actor-turned-entrepreneur some of his most important life lessons.By Danny Trejo, as told to Hilary CadiganFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel Shepard FacebookTwitterEmailThe way I grew up was bobbing and weaving and dodging bullets. But I’ve always eaten tacos. They’re the food of champions.As a baby it was soft shell only, because, you know, you could choke. But the first time my family let me eat a hard-shell taco, I was about four or five, and it was a rite of passage. I got to sit with the big people, eat ground beef, tomato, cheese, avocado, and a little bit of lettuce (not a lot because it takes up too much room) on a hard-shell taco with my dad and all my uncles. It was like me and John Wayne.In my early 20s, I got locked up in the San Quentin penitentiary. And there was this guy. I’ll never forget him. If you look up “gangster cholo” in the dictionary, you’ll see his picture. He’d always come by saying, “I got burritos! I got tacos!” Whatever’s in the prison kitchen is what you’re gonna get: ground beef, or if they have hot dogs, a weenie wrapped in a tortilla. “Hot dogs, I got hot dogs!” Let me tell you something: When you’re hungry, they're delicious.The first time I got to the joint, he comes by. “Taquitos! Taquitos!” I whistle: “How much are they, homie?” He tells me in Spanish and I say, “You know what, I just got out of the hole, homes. I ain’t got no money.” And in unbelievable, perfect English, he goes, “Oh, you don’t plan on leaving us soon, do you?” I almost died. Because what he’s saying is, “Look, if you don't pay me later, I’ll kill you.”I’ll never forget that: You might not pay anybody, but the taco guy is the guy you always pay, because you always want to eat.Nobody wields a machete—or makes a taco—like Danny Trejo.\nPhoto by MOSES BERKSONWhen I came out of the institution, I became a drug counselor. In fact, I’m still a drug counselor. I’ll never stop doing that, because you have to give back. But that’s how I ended up in movies; I was a sponsor for a guy working on set, so I started training actors to box. Then I ended up joining the cast. And then another, and another.Back then, as a struggling actor, I was just trying to feed my kids. I’d go study my lines at McDonald’s and put them in that playpen so I could study and not be bothered. Finally, my son came home from school one day—he was about seven—and he says, “Dad, you know, you’re killing us.” I said, \"What are you talking about?\" He goes, “Well, the teacher says that McDonald’s is... blah, blah, blah.” So I said, okay, maybe there’s better spots that would cook organic food and chickens that hadn’t been in jail. There are lots of different little restaurants in L.A. that are organic and the meat doesn’t have all kinds of additives. It's just meat. It's grass-fed. You make a taco out of that stuff? It's delicious.Ash Shah was the guy who got me into the restaurant business. I was doing a film called Bad Ass, and he was the producer, and he noticed I’m really picky about food. I won’t eat off just any lunch truck. I know it sounds stupid, but I’m asking the Mexican guy, \"Where do get your meat?\"So Ash said, “Danny, why don’t you start a restaurant?” And jokingly, I said, “Trejo’s Tacos.” And that’s how we got the name. Two movies later he brought me a business plan. Now we’ve got seven taquerias and one donut and coffee shop. We employ second chances at our restaurants—kids who’ve gotten in trouble. People need a job and a chance, that’s all.I don't know how many movies I’ve been in. Maybe about 300? I have a cookbook coming out this month, Trejo’s Tacos. And a record label. And a coffee label. I got beer too. I don’t even drink, but all my friends love it. Next I want to start an acting school. And I still work as a drug counselor, and with autistic kids. You gotta give back. A busy man has time to do everything.The best taco in the world right now, and I challenge anybody, is the carnitas tacos guacamole at Trejo’s Cantina. I'm telling you, man. It’s so tender. We got secret ninja sauce that nobody knows. Remember that show Get Smart? Remember all the doors he used to have to go through? That’s the way you got to get to our kitchen. You got 12 doors to go through, different locks, combinations.My recipes come from my mom and my grandma. My grandma made probably the best guacamole in the world. That’s the same recipe we have at Trejo’s. It’s absolutely delicious, but I can’t tell you what’s in it. I’d have to kill everybody who reads this.Danny Trejo is an actor who has appeared in Hollywood films such as Machete, Heat, Con Air, and Desperado. He lives in Los Angeles, where he has multiple restaurants including Trejo’s Tacos, Trejo’s Cantina, and Trejo’s Coffee & Donuts.Want More Stories From Taco Nation? Right This Way...Why Korean Tacos Are Margaret Cho’s American DreamSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayIt’s Time We Give the Mexican Combo Platter the Credit It DeservesAnd so much more!Explore Bon AppétitTaco NationCelebritiesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Danny Trejo", "As Told To Hilary Cadigan"]}