{"id": "77c7672b450bca3bd7d97ad3e5cb6fc7", "url": "https://www.bonappetit.com/recipe/cocoa-orange-catfish", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Cocoa-Orange Catfish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCocoa-Orange CatfishBy Nicole A. TaylorAugust 11, 20213.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintUnsweetened cocoa powder can transform savory dishes. Its luxurious richness adds depth to proteins, like the catfish in this recipe from Nicole A. Taylor, featured in Bryant Terry’s book Black Food. You can swap the benne seeds with sesame seeds and maple sugar with light brown sugar, depending on what you have on hand. Instead of catfish, feel free to use any skinless white-fleshed fish fillet.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFish Spatula$14 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketLarge Bowl$18 At AmazonIngredients4 - 6 ServingsCocoa Rub2Tbsp. Diamond Crystal or 3½ tsp. Morton kosher salt1Tbsp. unsweetened cocoa powder2tsp. benne seeds or sesame seeds2tsp. maple sugar or light brown sugar½tsp. caraway seeds¼tsp. dried bird chile flakes or other crushed red pepper flakesFish2medium oranges2lb. catfish or other skinless whitefish fillets5Tbsp. extra-virgin olive oilPreparationStep 1Mix salt, cocoa powder, benne seeds, maple sugar, caraway seeds, and chile flakes in a large bowl until well combined.Do Ahead: Cocoa rub can be made 2 weeks ahead. Store airtight at room temperature.FishStep 2Place a rack in top of oven; preheat to 400°. Cut oranges into 6 rounds each and set aside.Step 3Rinse catfish and pat dry with paper towels. Place fillets on a rimmed baking sheet and sprinkle liberally on both sides with rub. Drizzle with oil, then arrange orange slices on top of fillets.Step 4Roast catfish until flesh flakes easily when gently pressed with your finger, 7–9 minutes. (For thicker varieties of fish, increase the cooking time to 10–12 minutes.)Step 5To serve, transfer orange slices to a platter and arrange fish on top.Adapted with permission from Black Food: Stories, Art, and Recipes From Across the African Diaspora by Bryant Terry (4 Color Books). Copyright © 2021.\n\nBuy from Amazon or Bookshop.orgHow would you rate Cocoa-Orange Catfish?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThe caraway was a very strange combination with orange, chocolate and sugar.  If I were to do it again, I would substitute fennel seeds.  I  tried putting the fish (cod) on top of the orange slices, but that kept the fish from contacting the hot baking sheet and resulted in uneven cooking.  Won't do that again.  For me, there are better preparations of white fish chunk filets.ColoBillDenver, CO1/12/2022interesting flvors but way too salty, used Diamond kosher salt and woud cut in half next rime.  Made this with the sweet potato grits and the bitter greens salad.  Would also maybe try and char the ornages a little befor cooking to lend a tad more roasted ornage flavor.AnonymousCharlotte11/16/2021My husband and I both enjoyed this recipe.  Used Catfish.  Instead of baking, we grilled it on a piece of foil, grilled for 8 minutes.\nWill Definitely make again.  Served with rice and a carrot salad.  After slicing the orange, used the rest to serve over the rice.DDSmithLodi, CA9/8/2021Not very good. Cocoa did not mesh well with the other flavors and made the whole thing seem muddy. Combined with the natural oiliness of the catfish the dish came out nauseating. Also, I expected some type of crust to form from the seeds and spices while it baked, but it never happened because of the orange on top. Cooking times are way off too. My filets needed closer to 20 minutes.  I’ll probably fry the leftover filets to redeem it.\n\nIf I were to do this again, I would skip the orange slices, incorporate orange zest in the rub, half the amount of cocoa, double the sesame and caraway seed, and use anything besides catfish. Would probably skip baking and pan fry the fish too.Swarthy N SwoleAustin, TX8/19/2021Explore Bon AppétitSouthernAmericanAfricanSoul FoodCocoaOther IngredientsOrangeCitrusFruitFishSeafoodQuickEasySheet-Pan DinnersWeeknight MealsMainDairy-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-11", "author": ["Condé Nast", "Nicole A. Taylor"]}