{"id": "77cc318ebc52c0f3ea43116b39158032", "url": "https://www.bonappetit.com/story/heads-of-the-table-2021-dinner", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Honoring Bon Appétit’s 2021 Heads of the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsCelebrating the 2021 Heads of the TableThe winners of the Bon Appétit award were feted at a dinner in New York City.By Jenna Adrian-DiazOctober 15, 2021FacebookTwitterEmailDawn Davis, Sonia Chopra, Marcus Samuelsson, and the Heads of the Table honoreesPhoto by Jocko GravesFacebookTwitterEmailOn Thursday, October 15, Bon Appétit celebrated the 2021 Heads of the Table with a sleek rooftop cocktail party and dinner at the Press Lounge in New York City. The inaugural list celebrated trailblazers who made a difference in the restaurant industry during the pandemic, and the award recipients gathered to meet each other and some of the Bon Appétit team. Editor in chief Dawn Davis was joined by Condé Nast U.S. artistic director Anna Wintour and advisor Marcus Samuelsson in congratulating those in attendance.The cocktail hour featured a drinks and hors d'oeuvres menu created by the Press Lounge’s culinary director, Sofia Schlieben, in partnership with three mentees from a mentorship program run by honoree the LEE Initiative as part of their ongoing work to promote gender equity in culinary leadership positions. “The LEE initiative grew immensely during COVID,” said cofounder Lindsey Ofcacek at the beginning of the evening, “When it came to launching our women chefs initiative, we didn’t have an office space or kitchen. Chef Lee donated his home in Kentucky to the initiative, and thanks to our partners at Monogram Luxury Appliances, we were able to build that entire space out with a top of the line kitchen for all of our mentees to do demos, recipe testing, and really just be proud of the space that they're in.”While bites and drinks—including sunchoke pierogi with sunflower seed romesco, fried pork rillette with apple and mustard chutney, and the guest-favorite peaches and herb speciality cocktail—circulated, BA caught up with chef-owner Reem Assil and general manager Bertha Greene of award recipient Reem’s California to hear about the next phase of expanding worker equity at Reem’s. “We’re just enjoying the journey,” began Assil. “No matter what comes from this process, in the end, the byproduct of engaging with your employees and figuring out what we collectively value, how we want to grow the business together, that's equally as important.” Greene added, “It’s been breathtaking really, because you can see somebody that started out as a dishwasher and is now baking and is now thinking as a business owner. I’ve gotten the most joy out of seeing my team members growing and learning. I'm learning a lot too. It doesn't matter what your title is. Everybody can learn. Everybody can grow. It’s about learning from each other.”As the cocktail hour drew to a close, guests ventured onto the roof deck for a seated dinner under the New York City night sky. Over a first course of burrata with roasted and pickled mushrooms, honorees mingled with BA staffers, friends, and each other. Before the evening drew to a close, Eric See, of award recipient Ursula, spoke with BA about what he has in mind for Ursula over the next year. “We were, very thankfully, successful through the last year. And we haven't seen a significant dip in business or any reason to be fearful of the future. It gives us a lot of hope for the whole concept of creating community and creating safe space, especially for the queer community. That gives me a lot more motivation to continue pushing forward. I don’t know where that’s going to go yet. And so the question is, can we continue this concept in another space in another part of the city and another part of Brooklyn with the same integrity and intention that we set out this time around? What we've learned from Ursula in the last year is that you can operate a business with integrity and intention.”The Heads of the Table winners focus on their communities, sustainability, and creating a better restaurant industry. Keep scrolling to see photos from the event—special thanks to presenting sponsor Monogram Luxury Appliances—and to read about what excites them about the year ahead. For more on their incredible work, head here.Anna Wintour, Dawn Davis, and Marcus SamuelssonPhoto by Jocko GravesBon Appétit’s October 2021 Restaurant IssuePhoto by Jocko GravesChef Edward Lee, Lindsey Ofcacek, and Nikkia Rhodes of the LEE InitiativePhoto by Jocko GravesMichael Remaley (Board VP & Fundraising Committee Chair, Restaurant Workers' Community Foundation), Eric See (Chef/Owner, Ursula), Dawn Davis, Woldy Reyes (Chef & Founder, Woldy Kusina) and John deBary (Co-Founder & Board President, Restaurant Workers' Community Foundation)Photo by Jocko GravesA specialty cocktail created by LEE Initiative mentee Briana HlavaPhoto by Jocko GravesReem Assil (Chef/Founder, Reem's California), Dawn Davis, and Bertha Greene (General Manager, Reem's California)Photo by Jocko GravesPhoto by Jocko GravesHilary Cadigan, Elyse Inamine, Christina Chaey, Chris Morocco, and Arsh RaziuddinPhoto by Jocko GravesChef and Bon Appétit video host Chrissy Tracey with Eric See of UrsulaPhoto by Jocko GravesPhoto by Jocko GravesJune Kim, Sonia Chopra, and Arsh RaziuddinPhoto by Jocko GravesLeft to right: Ed Mammorella (Monogram), Carrie Frasier (Monogram), Allie Schmitt (Monogram), Dawn Davis, Marcus Samuelsson, Sofia Schlieben (Culinary Director of the Press Lounge), Julie Burns (Monogram)Photo by Jocko GravesLindsey Ofcacek (The Lee Initiative) with Michael Carter (Executive Chef, Down North Pizza) and Kirkland Lynchs\nPhoto by Jocko GravesPhoto by Jocko GravesMeet the Honorees:Heads of the TableThe trailblazing, community-building, future-making leaders changing the restaurant industry for good.View StoryThis event was held in compliance with local health and safety guidelines.Explore Bon AppétitRestaurantsHeads of the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}