{"id": "77cf8574ab73e6436895beb943b351dd", "url": "https://www.bonappetit.com/recipe/saucy-tofu-noodles-with-cucumbers-and-chili-crisp", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Saucy Tofu Noodles With Cucumbers and Chili Crisp Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueSaucy Tofu Noodles With Cucumbers and Chili CrispBy Christina ChaeyJanuary 4, 20224.6(95)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintLoosely inspired by Sichuan dan dan noodles, this saucy, spicy, satisfying, and meatless recipe starts with tofu that’s been torn into small crumbles, then seared hard on the stove. Don’t be afraid to go full Hulk on the tofu as you squeeze out every bit of water. You’re going to be obliterating it anyway, and getting out as much moisture as possible is critical to achieving the final ground-meat-like texture.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonWhisk$10 At AmazonKitchen Towels$22 At AmazonMini Tongs$20 At Williams-SonomaIngredients2–4 servings¼cup soy sauce1Tbsp. light or dark brown sugar1Tbsp. tahini1Tbsp. toasted sesame oil2tsp. black (Chinkiang) vinegar or balsamic vinegar1Tbsp. store-bought chili crisp, plus more for serving4Persian cucumbers, thinly sliced into rounds½cup unseasoned rice vinegar2½tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more114-oz. block extra-firm tofu, drained2Tbsp. cornstarch4Tbsp. vegetable oil, divided8oz. shiitake mushrooms, finely chopped1shallot, finely chopped11\" piece ginger, peeled, finely chopped2garlic cloves, finely chopped10oz. fresh ramen or dried wheat noodlesPreparationStep 1Whisk soy sauce, brown sugar, tahini, sesame oil, black vinegar, 1 Tbsp. chili crisp, and ½ cup water in a small bowl or measuring glass until sugar is dissolved. Set sauce aside.Step 2Toss cucumbers, rice vinegar, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a medium bowl to coat. Let sit, scrunching with your hands every few minutes, until cucumbers are softened and lightly pickled, about 10 minutes. Drain and set pickled cucumbers aside.Step 3Wrap tofu in a clean kitchen towel. Gather ends of towel together and squeeze with your hands over sink to extract as much liquid as possible. (Don’t worry if the tofu breaks apart—it’s going to get crumbled up anyway.)Step 4Crumble tofu into a medium bowl (it should resemble cooked ground meat with some larger pieces). Sprinkle with cornstarch and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; toss with your hands to evenly coat tofu.Step 5Heat 2 Tbsp. vegetable oil in a large nonstick skillet over high. Arrange tofu crumbles in a single layer in pan; reserve bowl. Cook tofu, undisturbed, until golden brown underneath, about 5 minutes. Toss and continue cooking, tossing occasionally, until tofu is golden brown and crisp all over, about 4 minutes more. Transfer tofu back to reserved bowl.Step 6Add remaining 2 Tbsp. vegetable oil to same skillet and reduce heat to medium-high. Add mushrooms and shallot and cook, stirring occasionally, until mushrooms are browned and shallot is translucent, about 5 minutes; season with salt. Add ginger and garlic and cook, stirring often, until fragrant, about 1 minute. Return tofu to pan and add reserved sauce; bring to a simmer. Cook until sauce is slightly reduced, about 2 minutes. Remove from heat.Step 7Cook noodles in a large pot of boiling water according to package directions. Drain and divide among bowls. Ladle saucy tofu over noodles and top with reserved pickled cucumbers and more chili crisp.How would you rate Saucy Tofu Noodles With Cucumbers and Chili Crisp?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleI am willing to be patient with this new paywall/ sign in thing but it is SO laborious I am not sure it's worth it.  Make it easier.  We are all very tired and need to find pleasure in our recipe searches and cooking, not frustration.Anonymous3/23/2022I really enjoyed the recipe but definitely agree that it's quite salty. Next time I would probably refrain from adding salt to the tofu and mushroom mixture. Anonymous2/16/2022Really good, super satisfying. I didn’t have any mushrooms so I steamed some delicata squash and subbed it in where the mushrooms would’ve gone. The sweetness is a nice contrast to the chili crisp. Would make again!AnonymousNYC2/12/2022I bought all of the ingredients for this recipe, but am now unable to cook it because I've run out of articles..... So I guess I have to figure out what else to do with all this stuff I bought. very frustrating!hangry!2/10/2022First this recipe is super delicious!!!! I will make this dish the rest of my life.\nSecond pay walls are a necessary evil, so you guys can an will provide really good content.\nPeople deserve to be compensated for producing and sell a product.\nThird Utopia has not yet arrived and \"free\" media is not \"free\"  there is a cost to someone. Ask musicians and type editors to name two.\nI have been cooking and eating passionately and professionally  my entire life (40s).\nWe have some of my moms Bon appetites' from the seventy's .\nI am so happy to see the \"magazine \" moving towards more healthy and varied cuisines and diets especially more  \"fusion\" vegan/ vegetarian cuisine. Silly boy2/9/2022So now Bon Appetit has gone the way of all other free sites...Paywall. Sigh. Understandable but so disappointing. I guess the $30 is in lieu of subscribing to a hard-copy magazine. Okay...but next year it increases to $40???????????? No way, Jose. Given that there is no additional cost to BA for additional subscribers, there is no excuse for the size of this increase. A more reasonable annual subscription would be $20. I'm sure you'd find a much larger number of interested readers at that price and it would more than compensate for the lower price. \n\nBA first went belly up with the \"cultural appropriation\" issue and now the over-the-top price. The next event will be its complete demise. This is too bad and so unnecessary.AnonymousLouisville KY2/4/2022What gives?! I loved making recipes from this site now I have to pay??? Guess I won't be using this site anymore. Why does every freaking company make you pay for a subscription for everything?!?! Frustrating..... see ya! 👋Charity 2/4/2022Followed advice from other reviewers - used tamari and only half a teaspoon of salt on tofu. Turned out really really good! Will definitely make this again! SvetlanaScottsdale, AZ2/4/2022I am  a subscriber and I was signed in and still I had to go through a few hoops to get to the recipe. Not worth it.AnonymousChicago2/3/2022This WAS a very good website now RIPYou're all so arrogant & dumbSiberian2/3/2022I have a subscription, but cannot view the recipe.\nAnonymous2/3/2022I have a subscription and I couldn't view the recipe, it would appear for a brief second and then be replaced with an ad. SamAtlanta, GA2/3/2022I am not paying for a subscription so much as I would like to make this, I can't and won't.BarbaraEureka, CA2/3/2022This SUCKS! I  bought tofu specifically for this recipe, now I cannot access it because you want me to pay for a subscription. \nGreed Almighty!Deborah Nemitz Texas2/2/2022What a divine recipe! Based on reviews, I left the salt off the tofu and added less than recommended to the cucumbers. I also doubled the sauce, because I love sauce, and am glad I did that. Not too salty at all. I've had many recipes \"based\" on dan dan noodles, and this was by far the most delicious. The cucumbers are a nice touch. The chili crisp added the perfect amount of spice and I loved the way the tofu worked. We will definitely add this to the rotation and I am so glad to have found a new noodle dish we love!nilssons1/29/2022Explore Bon AppétitWeeknightQuickEasyDairy-FreeVeganVegetarianCucumberVegetableShiitake MushroomMushroomNoodlePasta & NoodlesRamenDinnerLunchMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}