{"id": "77da235b2489942016e0ce88bfec067f", "url": "https://www.bonappetit.com/story/how-to-make-homemade-cold-brew", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Homemade Cold Brew Is Beyond Easy to Make—Here's How | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Homemade Cold Brew and Save Yourself a Whole Bunch of $$$If you thought you couldn't make cold brew coffee at home, think again.By Emily SchultzOctober 4, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Anna BillingskogFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed. This week: homemade cold brew.There are some things New Yorkers can’t get enough of—no, this isn’t the intro to the next Sex and the City movie—and cold brew is one of them. We love it almost as much as we love complaining about the MTA. No matter the season, no matter how cold it is, you'll still catch me and literally tens of thousands of other residents of the five boroughs power-walking the streets with cold coffee in hand. But the other thing about New York is that things are really expensive, and said iced coffee is no exception. But ya know what? You can have your cake, err, iced coffee, and eat it too. Because making homemade cold brew coffee that's even better than the kind you get at your local coffee shop (that also doubles as a slam poetry venue) also happens to be about as easy as making iced tea—and is a hell of a lot cheaper.Oh, you didn’t think cold brew was something you could make at home? Let’s just back up for one cold sec. Sure, when cold brew first hit the scene, it was shrouded in an air of fanciness and exclusivity, the kind of thing you could only get at coffeeshops that could also turn your latte foam into a whimsical flower. But think about it. Regular drip coffee is made when hot water and ground coffee beans come in contact with each other, and cold brew is just that—but with cold water. It's that easy! It takes A LOT longer to brew coffee with cold water (like 12 hours instead of four minutes), but the only ingredient other than coffee and water is, well, time. Bonus: Because the water and beans are mingling for so long, the resulting beverage has a whoooooole lotta caffeine in it. Cool! Rad! Awesome! Ready to do this thing? Great. Andiamo!First, I start with quality whole bean coffee, usually from Stumptown, but I also really like Reanimator in Philadelphia. I prefer to get small bags of beans, since I’m only ever making coffee for myself or my roommate, and I don't want the coffee to sit around for too long before I get a chance to brew it.My homemade cold brew-making ritual usually takes place on a Sunday evening. I scoop about a quarter cup of beans out of the bag and grind them. (This should be about 170g of ground coffee, if you’re really into that new Escali you just bought.) You want the grinds to be on the coarser side, more like what you want for a French press rather than espresso.A fine mesh strainer and some cheesecloth ensure you don't end up with a gritty brew.\nPhoto by Chelsie CraigThen, I dump the ground coffee into a 32-ounce Mason jar and fill it the rest of the way with cold water. (Another thing New Yorkers love talking about: how GREAT the municipal tap water is!) I screw on the lid on, give the jar a couple of good shakes to make sure everything is combined, and then I park my concoction in the fridge overnight (or at least 12 hours) so it’s fresh and ready for me Monday morning.Since eating coffee grinds isn’t really appealing, I strain the mixture the next day. I line a fine mesh sieve with cheesecloth and strain the mixture into a bowl or other large vessel, making sure to gather the edges of the cheesecloth together and squeeze the mess of grounds to ensure that every bit of caffeinated bean liquid is captured. Then, I’ll wash the Mason jar out and pour the cold brew concentrate back in the jar. Yeah, this is CONCENTRATE, as in it needs to be watered down. (You can always pour the concentrate into a larger jar or pitcher and dilute if you want.) I prefer the concentrate because it means that I can add lots of ice (the number of A trains without A/C is unreal) and a little bit of almond milk. This concentrate mixture will last me a week, and will save me about seven plastic cups, seven plastic lids, seven plastic straws, and at least $30 in coffee that I'm not buying on my way to work. And I will often sip it while reciting a Carrie Bradshaw monologue in my head.You know what would go great with some homemade cold brew? Shakshuka:30-Minute Shakshuka with YogurtThis shakshuka is the ultimate, don't-even-worry-about-it, weeknight pantry meal.View RecipeExplore Bon AppétitCoffeecold brewBasicallyIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Emily Schultz"]}