{"id": "780a30c13c4bd962a62f359f555fc970", "url": "https://www.bonappetit.com/story/acid-league-wine-proxies", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "This Non Alcoholic Wine Doesn’t Taste Like the Real Thing—but I Love It All the Same | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Non-Alcoholic ‘Wines’ Don’t Taste Like the Real Thing—but I Love Them All the SameAcid League’s funky, complex blends are made for my fancy stemware.By Emma OrlowApril 16, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!It can be hard to manage a healthy relationship with alcohol when you are largely unemployed, do a lot of doomscrolling, have anxiety, and, ahem, are still in a global pandemic. I am, of course, referring to myself, but needless to say, many people are rethinking how much and how often they imbibe right now.Luckily, there are plenty of products out there to help the alcohol-conscious among us. Journalist Julia Bainbridge published a non-alcoholic cocktail book, Good Drinks, last year and has launched a newsletter delving further into the subject. Drink makers like Unified Ferments and Hella Cocktail Co.’s Bitters & Soda offer booze-free bevs with bite. And in New York City there is even an entire shop devoted to stocking beers, wines, and more—sans alcohol.Lately, when I find myself wanting the ritual of pouring a cold beverage into fancy stemware, I turn to these newly launched Wine Proxies from a Canadian vinegar brand called Acid League. Each month they offer three new flavors, available as a one-off order or part of a subscription. And while none of the February trio of bottles I tried tasted much like wine to me, the uncorking experience was every bit as special.The Proxies are made from juice, tea, spices, and bitters, and are presented in curvaceous bottles with pretty illustrated labels and colorful wax closures. My favorite flavor was described as “McIntosh apples mesh with maple syrup, spruce tips, Labrador tea, and spicy cedar to capture a spring walk.” It had all of the complexity that’s typically reserved for booze, with a delightful, lychee-like flavor that was a lot more interesting than other non-alcoholic bevs I’ve tried.It’s worth noting that while the Proxies mimic the experience of pouring and drinking wine, they aren’t claiming to perfectly replicate a particular type of vino (they’ve got their own good thing going). So if you’re looking for a more realistic wine-y dupe, this product is probably not going to do it for you. But if you’re open to an experience that’s distinct from other non-alcoholic options out there, and you’re looking to be more conscientious about your booze consumption, then you’ve met your match. Like the best relationships, Acid League is curious, ever-changing, and respectful of your boundaries.Acid League Wine Proxies$70 at Acid League (one-off box)$60 at Acid League (subscription)Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-16", "author": ["Condé Nast", "Emma Orlow"]}