{"id": "780ab6a96eec0ee4770c2cc2e89fc24e", "url": "https://www.bonappetit.com/story/fruit-bowl", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "This Storage Bowl Is Like a Hot Lifeguard...for Your Fruit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Storage Bowl Is Like a Hot Lifeguard…for Your FruitSave the peaches!By MacKenzie Chung FeganAugust 13, 2020FacebookTwitterEmailPhoto by Ty MechamFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I struggle with the bounty of farmers market day. On the plus side: millions of peaches, peaches for me! On the negative: Where do I put them? Usually the answer is stacked precariously in all the medium-to-large-size bowls that I own. This one for tomatoes, that one for stone fruit. Come evening, I’m eager to make a panzanella salad or peach cobbler...only to find that all suitable vessels are occupied.This is why I’m making the argument for a dedicated produce-storage bowl—one large enough to handle a robust farmers market haul and attractive enough to live permanently on your counter. French ceramics company Emile Henry makes just such a “grande coupe de conservation”—a 14-inch-wide ceramic bowl with a cork lid shaped like an enormous ashtray. The bowl itself, which is ventilated by three discrete holes in the bottom, holds root vegetables and not-quite-ripe fruit that prefer to be stored in darkness, while the lid is large enough to showcase a fruit display that would make a Dutch master weep.The choice in materials goes beyond the cosmetic. Cork is largely composed of a waxy substance called suberin, which has antifungal properties, doesn’t absorb moisture, and repels fruit flies; French grandmothers have been known to toss a handful of wine corks into their fruit bowls for this very reason. Cork and ceramic are also excellent insulators, keeping onions and garlic stored below at a consistent temperature.At $140, this bowl is definitely an investment piece or a particularly thoughtful wedding gift. But it’s handsome enough that it does double duty as a storage vessel and decor—plus it’ll prevent food waste so you can claw back some pennies. You’ll never have to throw out a forgotten liquifying peach again.Photo by Rocky Luten/Food52Emile Henry Ceramic Storage Bowl$140 at Food52Explore Bon AppétitHealthyish Loves ItFruitShoppingHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-13", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}