{"id": "780f3e6df50d5d724f8c20a107763c99", "url": "https://www.bonappetit.com/story/patagonia-provisions-canned-mackerel", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "There's a Special Place in My Pantry for Patagonia Provisions Canned Mackerel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s a Special Place in My Pantry for Patagonia Provisions Canned MackerelMy kind of instant food.By Christina ChaeySeptember 17, 2021FacebookTwitterEmailPHOTO BY JULIAN COUSINSFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Until relatively recently, I used to stock my kitchen with a hefty assortment of instant foods meant for emergencies only: reserve boxes of Annie’s cheddar shells, random frozen dinners, overly salty canned soups, and Neoguri instant ramyun. These provisions were supposed to be my safeguard against ordering takeout on nights when I couldn’t even muster the enthusiasm to crush a garlic clove. The thing is, I had “emergencies”...often. And even on nights when I successfully managed to stay away from my beloved fried take-out delights, downing a box of instant mac didn’t exactly make me feel virtuous. I knew I would never stop having emergencies; I also knew my pantry choices could do with a bit of a revamp.These days, the VIPs of my “emergencies only” stash are a different kind of “instant” food: canned fish, all different kinds, which live in a dedicated section of my cupboard. Whether mackerel, tuna, sardines, or smoked trout, these tiny, versatile tins are my lifesavers on nights when my tired ass can’t possibly stir or stew or sauté. Open a tin of smoked trout (Fishwife makes an amazing one), mix it with sour cream, a little lemon juice, and salt and pepper, and you’ve got a fishy spread for toast. A few meaty sardines layered with lightly dressed arugula and thinly sliced onions becomes a mighty fine sandwich. Put a tin of tuna directly on a dinner plate with a little pile of pickles and crackers for a lazy person’s (me) snack platter. And on nights when you can muster the energy to boil water, there’s no more satisfying rendition of pantry pasta than this version with mackerel, which I often make using fish from Patagonia Provisions.Mackerel Variety Pack$20 at Patagonia ProvisionsPatagonia Provisions canned mackerel is my favorite everyday tinned fish because it’s priced gently enough for a Tuesday night (save the $30 tin of gourmet anchovies for a party), sustainably sourced from Spanish fishermen who catch the mackerel with minimal bycatch or baitfish, and very delicious. Like many of the best tinned fishies, the mackerel comes packed in olive oil (a must because it lends lots of flavor straight out of the can) with additional seasonings like lemon and caper and Spanish paprika, which means less work for me to turn it into a meal. They’re tasty enough that sometimes I’ll eat them straight from an overturned can sprinkled with a little flaky salt, like my own personal Fancy Feast, with some bread for dipping into the flavored oil.With a tin of Patagonia Provisions canned mackerel on hand at all times and infinite ways to make it into dinner without leaving the house, I’m way less tempted to hit the “Order” button on my phone these days—though I most definitely still have a 12-pack of Neoguri stashed in my hall closet. You know, for true emergencies.Cook the Recipe:Mackerel Pantry PastaKeep a couple of tins of fish in the pantry and this 20-minute pantry pasta will always be within reach for last-minute dinners.View RecipeExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-17", "author": ["Condé Nast", "Christina Chaey"]}