{"id": "783843823e5c72f04fa6d71da24d0357", "url": "https://www.bonappetit.com/story/never-fail-roasted-cauliflower-recipe", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "This Roasted Cauliflower Recipe Gets Everything Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Roasted Cauliflower Recipe Gets Everything RightCheesy cauliflower is one of life’s greatest pleasures. Cheesy cauliflower with capers is even better.By Aliza AbarbanelMay 3, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Not to brag, but I roast a lot of vegetables. Okay, most people wouldn’t count that as a brag, but I’m proud to count creamy sweet potatoes and crispy carrots as key parts of my diet. When I’m really on my game, they’re even part of my patent-pending Midnight Meal Prep routine. (That’s when I check my bank account before bed, panic, and attempt to throw together lunch for the rest of the week.) But once I tried this roasted cauliflower recipe, all those root vegetables became a distant memory. Cheesy, confidently-caramelized, and goosed up with a briny-tart dressing, it hits alllllll the notes. Here’s what makes this version better than the rest.Super-Smart SlicingInstead of snapping off each floret, you slice the whole cauliflower head into neat planks. (You trim the bottom first so you have a stable base for safer cutting. Safety first!) This increases the amount of cauliflower making contact with the sheet tray, creating more caramelization, charring, and crisping. Plus it’s so much faster.Melted! Cheese!Need I say more? Once the cauliflower planks are deeply browned, you take the sheet pan out and shower everything with grated parm before popping it back in the oven for another 10 minutes. In that magical amount of time, the cheese will melt and work its way into every nook and cranny of the cauliflower—you just wait for the parm to smell toasty, nutty, and pretty much irresistible, and then it's done! Try not to inhale it straight off the sheet tray, because that savory, tangy dressing to-come really makes the dish.Briny capers bring just the right amount of salt and umami to that dressing.\nDanny KimLemon-Caper DressingDespite my earlier bragging about being a roasted vegetable pro, I rarely think about making a sauce to put on them. And while I’m still not above a last minute drizzle of straight-up Sriracha or tahini, this recipe's bright and briny lemon-caper dressing is exactly what a plate of cheesy cauliflower needs. You simply whisk together chopped capers, olive oil, lemon juice, and salt, but it is just the thing you want as a foil to those deep, rich, roast-y flavors. Once you see how easy this dressing is to make, I guarantee you'll start drizzling it over just about any roasted vegetable situation from now on.This cauliflower is the perfect addition to any grain bowl or salad, but it’s surprisingly versatile. Use the leftovers in a breakfast frittata or a next-level vegetarian sandwich. Or take a page out of my book and eat them cold, standing over the kitchen counter and marveling at how delicious roasted cauliflower can be.The perfect roasted cauliflower recipe in question:Roasted Cauliflower with Capers and ParmesanThis is how vegetables can crisp and caramelize, and not slowly steam and turn to mush.View RecipeExplore Bon AppétitNever FailBasicallyCauliflowerRoasted VegetablesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Aliza Abarbanel"]}