{"id": "7839279226abcd2daf731f935c8ee69c", "url": "https://www.bonappetit.com/story/jessamyn-stanley", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "How Jessamyn Stanley Resists a Culture That Thrives on Body Negativity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Jessamyn Stanley Resists a Culture That Thrives on Body NegativityThe author and yoga teacher is all about jamming to Sia songs, cooking soft-scrambled eggs, and feeling her feelings.By Ali FrancisAugust 3, 2021FacebookTwitterEmailPhotograph by Cornell WatsonFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Jessamyn Stanley, yoga teacher, advocate, podcaster, and the author of Yoke: My Yoga of Self-Acceptance, which was published on June 22.“I realized, once I actually started practicing yoga, that the most intricate and all-consuming yoga doesn’t happen on the mat. It happens in every other part of your life,” Jessamyn Stanley says. It’s pouring rain in Chapel Hill, North Carolina, where Stanley’s sprawled out on the floor of the RV she’s driving around the country with her partner. Between sips of water, the author and yoga teacher is explaining why she wrote her new essay collection, Yoke: My Yoga of Self-Acceptance. “So the book is really for anyone who has ever struggled with themselves,” she continues, “or felt like they don’t deserve to exist exactly as they are.”I’ve been following Stanley for a while on social media, where her playful swimsuit videos, helpful and hilarious instructions on how to roll a joint, and thoughtful musings on racism, body acceptance, and relationships feel like little bolts of real talk in a storm of filters and façades. Yoke is every bit as vulnerable and relatable, walking readers through a series of deeply personal and make-you-cry funny essays about applying lessons learned in the yoga room to the harder work of being alive. Stanley calls out the overwhelming whiteness that’s become a hallmark of yoga in the West, opens up about her own imposter syndrome, and advocates for living like no one’s watching. If her first book, Every Body Yoga (2017), is the practice, then this one is the theory. Don’t expect simple platitudes or easy resolutions: Yoke is more of an experience in witnessing Stanley grow and question herself on the page than it is straightforward self-help.When I read Stanley’s book earlier this summer, lying by a pool while feeling bloated and self-conscious in my neon swimsuit, I had the uncomfortable realization that I’d fallen prey to diet culture in the very ways she was describing in the book. But that’s exactly how Stanley teaches; she leads us toward our feelings and shows us how to, well, feel them—and then accept them too. “There’s space for all of it because that’s what being human is about,” she writes in a chapter titled “It’s a Full-Time Job Loving Yourself.”When we chat over the phone, Stanley is just as chill and candid as she is on the page. She talked about her own struggles with body image, the hard truths we need to accept about ourselves, and the food she’s been cooking on repeat lately.I’ve always struggled with body image... and the way that I see myself. When I was in college, I was obsessed with losing weight and trying to look different. Around that time, I followed a lot of fat-positive and fat-acceptance writers, like Lesley Kinzel and Marianne Kirby, and they definitely planted a seed in me of wanting to explore another way of understanding myself and the world. [Soon after], I started practicing yoga and it opened me up to a new way of understanding my physical, mental, and emotional bodies.Taking photographs of my body… was a big portal for me. There are whole years of my life where I don’t have any photographs because I was so afraid to look at myself. By taking photographs of myself for my yoga practice, I really came to see the hateful things that I say and think about myself, and began to take responsibility for them. Accepting the way that I see myself has helped me have a deeper relationship with myself.Diet culture is at its best when... you think that you’re deficient in some way. But with body acceptance, you’re saying, “This is my body, and I’m going to honor it by taking care of it.” [Everything] diet and wellness culture allegedly seeks can be found through acceptance of the self, not some magic potion.Body acceptance and liberation is tackling the big issue that… we, as a society, have cosigned on the idea that our bodies are not our own—that they are the property of anyone who has an opinion about them. We work our whole existences around whether or not someone else is going to like us. Capitalism wants us to look to other people for our validation, to keep us held within the gaze and the perspectives of others. But body liberation is saying that your body is your own, that there’s nothing to seek.By writing this book I learned that… all I needed to do was reflect on my own experiences. I knew I wanted to talk about cultural appropriation and racial identity. I went into it thinking, Okay, I finally have a way to talk to all of the white yoga people who have been like, “What’s Black Lives Matter got to do with me?” And then during the writing, [I realized] that if I’m going to talk to a white supremacist, I need to talk to the white supremacist that lives inside of me first. And so that way of seeing things came to every essay in the book.We need to start accepting… our internalized racism, the complexities of capitalism, the aftereffects of colonialism, our cultural appropriation, sexism, and slut-shaming as parts of our society. I definitely hear the argument of wanting to hold people accountable, but along with the calling out [of others], there has to be a calling out of ourselves. Calling out and calling in. I think people want to have a witch hunt; we don't want to actually see ourselves as the ones that could be hunted. But if we’re able to see ourselves as part of the same systems of inequity, it makes it a lot easier to be compassionate toward other people and actually seek resolution.My way of dealing with a difficult feeling… is to just let it be there, let it breathe, give it space to stretch its legs. That means I will be grouchy and unpleasant to be around. But then I’ll try to find some sort of grounding, whether that’s practicing yoga postures, breath work, meditation, or writing in my journal. Once a feeling has been felt, I’ll be able to move forward.Just listening to the right song… can change my mood. Any time I feel like there’s too much going on, I listen to “Sing About It” by the Wood Brothers and it makes such a difference. I also love the lyrics in “The Church of What’s Happening Now” by Sia: “Throw away yesterday / Today is a brand new day.” Even if I hear it in the middle of a really difficult day, it makes it easier to think, You know what? I can just start over from here.I’m incredibly grateful to be able to eat… whatever I would like to eat, not just whatever is available, when it’s available. I did not grow up in a family where we could afford to eat out a lot, and now, one of the great joys of my life is to share a meal out with the people who I love. So I try to separate myself from anyone or anything that makes me feel like there’s something wrong with the way that I’m eating food—and try to appreciate all the beings that gave themselves to make that food possible.These days I’ve been working on cooking the perfect… soft scramble. Grits are also a food that I grew up eating that I’m obsessed with, so I’ve been preparing them with herbs and really thinking about the different viscosity levels. And I really love pasta so much. Which is a blessing and a curse, because my emotional body loves pasta, but my physical body does not. That doesn’t stop me from eating carbonara, though. I love eggs, obviously.Explore Bon AppétitPerson of InterestHealthyishLifestyleInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-03", "author": ["Condé Nast", "Ali Francis"]}