{"id": "78454c1162de8ee007b488eff10f7102", "url": "https://www.bonappetit.com/story/tips-to-fuel-your-great-ideas", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Tips to Fuel your Great Ideas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredTips to Fuel your Great IdeasBy VitamixAugust 1, 2018FacebookTwitterEmailFacebookTwitterEmailWhether you’re starting your own business or shaping a new brand, it takes tenacity, perseverance, Herculean patience, and healthful foods to keep your head in the game. So when Healthyish rolled out their Healthyish Homecoming, a day-long festival full of food, drinks, and seminars à la #FeelGoodFriday, it was only fitting that Vitamix sponsor the panel “Entrepreneurs Run the World.” Not only did the brand have its own humble beginnings back in the 1930s, but today they’re also dedicated to helping people live their fullest, healthiest lives. (“Vita” means “life,” after all.) Whether you’re an already established entrepreneur or you’ve got big dreams to become one, here are a few tips on how to get into healthy habits that will take you far along your journey.START YOUR DAY WITH FRESH FOODSYou’ve heard it a million times: Breakfast is the most important meal of the day. But it wouldn’t live on a loop in your head if there weren’t truth to it—just saying. Go light with an expertly cooked, protein-packed hard-boiled egg and a handful of antioxidant-rich blueberries, or opt for a filling, whole food–packed breakfast bowl like this Tumeric Fried Eggs with Kale, Yogurt, and Bacon recipe (even healthy dishes deserve a touch of bacon). Either way, you’ll get your body and brain ready to tackle whatever comes your way.MAKE THE MOST OF YOUR TIMEPart of any successful job, especially the one in which you are the CEO, marketing director, creative lead, and finance department, is exceptional time-management skills. Vitamix not only frees up time for you to, say, run the world, but they also use technology that works. The Aer Disc Container is designed so that liquid ingredients are pulled through small holes in the spinning disc, aerating and emulsifying them, while ingredients such as frozen fruit, herbs, and vegetables are agitated, but not puréed.Need to impress potential investors at dinner? Just wishing for more hours in the day? Whip up cream for a homemade pie, emulsify a dressing, froth foam for an after-dinner latte, or muddle fruits for drinks like this dreamy Beauty-Food Mango Slushy, which was served at the Healthyish Homecoming to refresh attendees (plus, investors love slushies!).SEE HOW THE OTHERS DID ITAn essential part of powering through ups and downs of entrepreneurship is staying optimistic. To do something that’s never been done before—or at least something you’ve never done before—you’ve got to be crazy determined enough to believe you can do it. One of the best ways to accomplish that is to get perspective on how it happened for other entrepreneurs. Choose a handful of business owners or thought-leaders you admire, and read everything you can get your hands on about their story—where they came from, how they persevered, and how they’re challenging themselves regularly. Chances are they have myriad tales that will inspire you to keep moving full-steam ahead.DO DINNER ON THE GO—OR NOTWe’re all familiar with the liquid lunch, but we’re talking about an actually sufficient meal here. Whether you’re knee-deep in a business proposal and can’t tear yourself away, or know that tomorrow night you’ll be running from one meeting to the next, dinner can be deliciously served in minimum time with maximum results. We love this Corn and Red Pepper Soup with Cheesy Croutons for its vitamin C–packed ingredients, easy-to-make instructions, and delicious flavor. Enjoy it at your desk, the dinner table, or on the run. Now back to work!Explore Bon AppétitHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast"]}