{"id": "7851b65c821316b0b54d7c962157038b", "url": "https://www.bonappetit.com/story/ba-test-kitchen-goes-green", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "The Bon Appétit Test Kitchen Is Going Green | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Not Easy Being Green—But We’re TryingYou'll be seeing some changes here at BA.By Adam RapoportJanuary 7, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Sue LiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.At Bon Appétit we're always telling you what to do. Salt your pasta water. Smash your burgers. Tear your vegetables. (No, really—try it with mushrooms or boiled potatoes. You’ll create these cool shards that get all craggy and crispy when you hit them with olive oil and high heat.)Over the past few years, we’ve added to our advice-driven ethos by promoting a more environmentally sensible approach to cooking, from sourcing local ingredients to reducing food waste. But when we took the time recently to reflect on our own habits in the Bon Appétit Test Kitchen, we didn’t like what we saw—lots of single-use plastic containers, mountains of spent paper towels, questionable recycling efforts, no composting whatsoever.Sure, we faced challenges, as everyone does. In our case, operating a professional kitchen on the 35th floor of a 100-story skyscraper prevents us from simply doing what we want. We don’t have a backyard or a garage, for instance, where we can stash our recyclables or deposit food scraps.But we do have Gaby Melian, our test kitchen manager. To put it bluntly, Gaby is not afraid to get in someone’s face. So she took it upon herself to badger building management until they installed an industrial-size compost bin and established a more efficient and transparent recycling program. If you believe change is worth fighting for, then do like Gaby—fight for it.Want this letter before it hits the website? Sign up for our newsletter!Illustration by Justyna StasikMeanwhile, Carla Music and Chris Morocco put to paper our goals—a test kitchen to-do list, if you will, just like the kind you tape to your fridge on Thanksgiving Day. You can find our full mission statement here, and you’ll start to notice some of the changes in our videos and on the pages of this magazine. In an effort to encourage a more plant-rich diet, 30 percent of the recipes we develop will be meatless. In order to cut down on disposable materials, we’ll encourage you to use a bowl with a lid, a reusable container, or beeswax wrappers.Within the kitchen itself, we’ll reduce the number of food deliveries we receive and how many plastic-bagged trash cans we use, and we’ll swap absorbent paper towels for those brown recycled and compostable ones.Don’t worry, we’re not going to get all preachy and righteous on you. We’ll still deliver delicious recipes and fun, engaging content. But we do hope these small changes of ours spark a discussion and awareness among our readers, users, followers, and fans. Yes, it’s going to take more than individual actions to change the world, but if each one of us does the work, then suddenly all of us are doing the work. Those small changes become something bigger.Explore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-07", "author": ["Condé Nast", "Adam Rapoport"]}