{"id": "7865f0fb86385c7285c191e5d9a10af6", "url": "https://www.bonappetit.com/story/piecework-puzzles", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "These Super Cool Puzzles Belong on My Table as Crucially as Food Does | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Super Cool Puzzles Belong on My Table as Crucially as Food DoesI spent hours putting together a scene of a hand smashed into a cake, which is exactly how I want to spend my time.By Alex BeggsSeptember 9, 2019FacebookTwitterEmailPHOTO COURTESY OF PIECEWORK PUZZLESFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.ATTENTION PUZZLE PEOPLE. You know who you are. You spend your long weekends, holidays, and summer vacations hunched over 1,000 cardboard pieces until they cooperate into a scene so beautiful you’re tempted to glue it together and hang it on your basement wall. That’s passion. That’s joy. I feel it deeply. I freaking love puzzles. I once did a round-up of them for The Strategist, which is how the creators of Piecework Puzzles found me.And I’m so glad they did! Rachel Hochhauser and Jena Wolfe make these arty, surreal puzzles I fell in love with at first glance. Or maybe I’m a millennial suckered in by good millennial branding! Most puzzles are folksy or wholesome or, ugh, educational. The art rarely feels as fresh as a just-stirred martini. But these do. The image of a bejeweled manicured hand smashing into a cake is as beautifully destructive as putting a puzzle together only to break it back down to return to the box. My sister and I spent nearly a week on that one, called “Life of the Party”, recently. She took on the entire hand and cake portion while I wandered from the ribbons to the milk glass cake stand. Then the solid blue portion nearly broke us, but we kept at it until piece number 1,000 found her way home. Next up, we’re tackling Forbidden Fruit, a saturated still life with cut fruit on a bright orange (SOLID, WHY?!) background. I might have to fly puzzle lover Marissa Ross to New York to help us finish.Right now Piecework makes four puzzles, all $36 each. After we finished Life of the Party, we tore her back down, and traded it with our puzzle exchange friends (you should have some!), Noah and Sarah, who in turn, gifted us with Mt. Burger, a garage sale find. I imagine in the garage sales of 2049, nabbing a well-loved Piecework Puzzle will be just as thrilling.Buy it: Piecework PuzzlesAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendproductRead MorecultureIt Never Occurred to Me to Have Cooking Shoes, Now I Can’t Cook Without ThemBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-09", "author": ["Condé Nast", "Alex Beggs"]}