{"id": "786b2fafcf69d8b23b54abbcfeaa38da", "url": "https://www.bonappetit.com/story/questionable-lunch-etiquette", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Is It Ever Okay...to Eat Week-Old Crab Curry at Work? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...to Eat Week-Old Crab Curry at Work?And more solicited (but questionable) advice for your next office lunch.By Alex BeggsOctober 7, 2019FacebookTwitterEmailIllustration by Nicko PhillipsFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Illustration by Nicko PhillipsWhen you’re eating on your boss’s dime, what do you order, price-wise? I usually go for the middle-expensive option. —Median-Minded MicahIs steak frites on the menu? Because if it is, I’m ordering it. And oysters. The boss is ordering whatever the heck she wants, and so should you. You think ~$7 matters to the COMPANY? (Assuming you work for evil corporate America, not like, an elementary school.) Well, it doesn’t. I hear there’s no such thing as a free lunch, so you’ll pay for it in other ways. Like impending layoffs! Let’s get dessert!Illustration by Nicko PhillipsAm I obligated to speak up if I feel like my coworker is eating something that is potentially unsafe, e.g. week-old crab curry? —Concerned ChristinaMore like chill out, Christina! Let her thrive in her curious cubicle of crab creation. I believe her lunch is a big bowl of NUNYA.How long is too long for cooked crab to sit in the office fridge...and then eaten at one’s desk? —Guilty Gertie(Yes, I really got both of these questions.) Get it together, Gertie! I, too, like to push the limits of the concept of expiration, but four days is your limit on leftover shellfish. Furthermore, a smell test needs to happen before you sit down and open up the Daily Mail homepage. Because if there’s one thing grislier than those headlines, it’s what’s inside that Glad-ware.Illustration by Nicko PhillipsWhat is the best food for eating politely during a lunch meeting? —Busy BeatriceI hate so much that we live in a world where people are so busy they have to eat in meetings, chewing and smacking and talking with their mouths full of spindly arugula. It disgusts me, mostly because I want a bite. Now we’re so busy that when we meet up with friends we’re like, “How are you?” And they’re like, “Busy, but even busier than usual!” We’re at “busier than usual” now. What a BUMMER. Work less, people! But here we are, gathered around a conference table talking about “analytics” and “consumers” and “objectives” and your day is so stacked with more meetings like this that you have to show us the slimy inside of your mouth as it masticates plants. It brings me great sadness to share that these are the best foods to eat during meetings:A tightly bound turkey wrapSoylent barTray of grocery store sushiBone broth in a coffee mugGood-enough grain bowlParfaitSNACK BREAKImagine rolling up to your cubicle with a jar full of these Healthyish breakfast cookies! You’d have a snack stash all week, and something to share with gossipy coworkers who come to your desk for tea.Morning Glory Breakfast CookiesThink of these textured, dense treats as chewy muffin tops that forgot to be unhealthy.View Recipe Who pays when you go out to lunch with coworkers? Is it always the person who’s highest on the food chain? —Broke BennettThis isn’t a date, you don’t need to reach for your wallet all cute. Clearly the senior person who invited you or scheduled this meal picks up the check. When your colleague puts down a card, gush with thanks and say something about how nice it is to eat in restaurants with napkins for once. If you’re eating among poor peers, split it evenly, ask everyone how much money they make because you haven’t unionized yet and a union would never let such disparities exist, and then deduct it on your taxes. If you were the one who initiated the meal, and you’re on a budget, do COFFEE, hello!Illustration by Nicko PhillipsCan you tell a coworker that they’re chewing too loudly? —Horrified HenriettaYeah that’s a no. Do you know how fast people eat? One study counted schoolkids housing their lunches in under 10 minutes. I eat mine in around 13. Go for a walk if it bothers you so much; walking stimulates the brain and will make you a more efficient and inspired worker bee anyway.We get lunch catered at my office, and there is always a vegetarian option. Recently, a gluten-free option was added. But there are countless requests that an assistant has to endure: Macrobiotic. Raw vegan. Low FODMAP. No salt. How much is too much? —Low-maintenance LorelaiI don’t even know what FODMAP is and I don’t want to know. Getting lunch delivered is not a restaurant experience, the food is coming fast and it’s not gonna be delicate. If you’re on a low-sodium diet, you and I both know you should be bringing your own lunch just to be safe—your health is at risk if a mistake is made (and with an order that big, it’s bound to happen). If your special request requires more than two substitutions or swaps, reconsider your order. It sounds like your company wants to make everybody happy, which is sweet, but if I were the exploited assistant, I’d hand out the lunches and loudly announce everyone’s requests: “KEVIN, HERE’S YOUR BOILED CHICKEN BREASTS AND PIECE OF AMERICAN CHEESE WITH A HOLE CUT OUT OF THE MIDDLE BY A STRANGER’S MOUTH, JUST LIKE YOU ASKED, YOU ASSHOLE.”Illustration by Nicko PhillipsTo order or not to order drinks at a working lunch? Is there a line between having a beer and having a martini? —Linear LeonardContext is everything, but here’s what is acceptable (and what is not) at a working lunch in which it is assumed you’re going back to the office after.* If you’re conveniently “taking a half day,” the line moves down three notches.A pilsnerGlass of white wineOr hell, an Aperol Spritz~~~~~ LINE ~~~~~~Second glass of wineMartiniSecond martini*Unless you’re John Cheever, no work is getting done after a lunch martini, I’m sorry. And you can only have two if your colleagues are your friends and someone got a promotion. The last time that happened around here, two ‘toonis-deep Christina Chaey ended up buying a $30 honey bear balloon at Balloon Saloon and then it broke off the ribbon on the stumbly walk back to the office and flew into the Manhattan skyline. And yeah, she cried. Then Balloon Saloon offered her a free replacement and everyone was happy again. It was an emotional afternoon, and that’s what you’re getting into on a two-martini lunch day.That’s all for now, but if you have petty etiquette questions or recipe requests for me, email staff.bonappetit@gmail.com and be too specific. I want the juicy details!Love, AlexExplore Bon AppétitIs It Ever OkayLunchEtiquetteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Alex Beggs"]}