{"id": "787366dc0aa1a01c4d5a810bc02d4aec", "url": "https://www.bonappetit.com/recipe/harissa-roasted-eggplant", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Harissa-Roasted Eggplant With Fried Capers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueHarissa-Roasted Eggplant With Fried CapersBy Jessie YuChenAugust 10, 20214.5(48)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThink of capers as plant-based anchovies—they’re salty with a unique acidity, and are the secret weapon in this savory-sweet roasted eggplant. Capers infiltrate every layer of this dish: They’re chopped and mixed into a spicy harissa rub for the eggplant; mixed with cherry preserves for a salty-meets-sweet dressing; and roasted for a crispy-crunchy topping that adds pops of flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketCitrus Juicer$7 At AmazonIngredients4 Servings6garlic cloves⅓cup harissa paste, preferably hot6Tbsp. drained capers, divided¾cup plus 1 Tbsp. extra-virgin olive oilKosher salt, freshly ground pepper4medium Japanese eggplants or 2 large globe eggplants (about 2 lb.), halved lengthwise2Tbsp. cherry or other fruit preserves1cup plain whole-milk Greek yogurtZest and juice of 1 lemon3Tbsp. coarsely chopped dillPreparationStep 1Place a rack in lower third of oven; preheat to 425°. Blend garlic, harissa, 4 Tbsp. capers, and ¾ cup oil in a blender until a loose paste forms (a few chunkier pieces are okay); season with salt and pepper. (Alternatively, finely chop garlic and capers and mix well with harissa and oil in a small bowl.) Transfer ¼ cup paste to a small bowl and set aside.Step 2Score cut sides of eggplant flesh in a crosshatch pattern, being sure to stop before cutting through the skin below. Rub 1 Tbsp. paste remaining in blender evenly over each cut side of eggplant so entire surface is covered. Toss remaining 2 Tbsp. capers and 1 Tbsp. oil in a small bowl until capers are coated. Arrange eggplant, cut side up, on a rimmed baking sheet, leaving a little room on one side for capers; season with salt and pepper. Spread out capers in oil in a single layer in reserved space on baking sheet; set bowl aside.Step 3Roast eggplant and capers, keeping a close eye on capers, until capers are sizzling and slightly crisp, 8–10 minutes. Remove baking sheet from oven and transfer capers back to reserved bowl. Return eggplant to oven and continue to roast until tender, 10–12 minutes more for Japanese, 20–25 for globe. Let eggplant cool slightly, then slice in half crosswise on a diagonal.Step 4Mix cherry preserves into reserved paste in bowl. Mix yogurt and lemon juice in another small bowl to combine; season with salt and pepper.Step 5Arrange eggplant on a platter. Spoon lemon yogurt over, then drizzle harissa-cherry sauce on top. Scatter roasted capers, dill, and lemon zest evenly over eggplant.How would you rate Harissa-Roasted Eggplant With Fried Capers?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleMade it with anchovies instead of capers since that's what I had. I would not recommend putting olive-oil packed anchovies in a hot oven - smoke galore! Very tasty despite almost setting off my fire alarm. HannahSalt Lake City, UT1/28/2022The cherry/harissa sauce is bomb, don’t skip it! This dish packs a punch with flavor. I didn’t think I would EVER say this, but I might reduce the garlic a little bit. Since it’s raw in the sauce, it’s a little overpowering. Lots of acidic flavors going on, so balance those as you wish. Could be good with some roasted chickpeas to beef it up a bit. KatePortland OR1/12/2022I've made this twice, and both times it came out amazing. I care a lot about the quality of my food, and this hits on every level. Easy five stars.ZevNew York, New York1/3/2022This recipe is the best….my capers ended up toasted and still tasted sooo good. Skipped the cherry preserve and yoghurt and lemon …..still tasted awesome with steamed riceEdithaMaine12/21/2021Made this with globe eggplants and just quartered them lengthwise so they were a similar size to halved Japanese. Served on top of a bed of brown rice so the eggplant was almost a creamy sauce for the rice. Very good, would absolutely make again. Served a simple cucumber salad with olive oil and red wine vinegar on the side also swapped dill for mint. Superb! Thank you, Bon appetite! ElishaSan Luis Obispo, CA12/13/2021I just keep reading the recipe over and over. This was just not good at all! We sat down, took two bites and tossed it. I adore eggplant, I know the ins and outs of it. I thought this would be a winner, but man, the flavors are just all so harsh and bitter. It was missing the balance. Perhaps my harissa sauce was no good. David P.Dallas, TX12/8/2021We made this with globe eggplants and it came out wonderfully! We made one ~critical~ modification. Rather than cutting the eggplant in half (sounds like that went bad for the person before us) we did half inch disks. Scrumptious!\n\nPairs beautifully with Cookie and Kate’s mujaddara recipe!FredBrooklyn, NY11/2/2021Our cooking club made this and this is what we thought:  Excellent dish would make again, Was great, never had before, would make again. Little mushy, Tasty very good, but mushy, Very good I like eggplant!Liz PetersonLutz, Florida10/31/2021This was excellent.  I coated a piece of salmon with the harissa cherry sauce and cooked on the grill, skin side down.  Absolutely amazing addition to the eggplants.  CookinVTShelburne, VT10/29/2021This was amazingly delicious and very easy. I really wasn't in the mood to cook and I had already planned to make this dish for dinner. But once I got started making it I realized that it was very simple and by the time the eggplant was cooked everything else was made.\nNot only did it taste wonderful but it looked beautiful as well. I have already sent this recipe to my children they are vegetarians. KathrynLong Branch, NJ9/28/2021Came out really well -- delicious flavors. I used globe eggplants but think this would work better, especially in terms of timing and manageable bite sizes, with Japanese or other smaller eggplants. It did take a while, I would do this again on a weekend rather than a weeknight. EmilyDavis, CA9/24/2021I wouldn't expect my dish to look like the picture but i  have to say i wasn't even close.\nI felt the instruction were not clear when it came to preparing the eggplant.  I saw the picture but if you follow the directions for slicing and scoring the eggplant it doesn't work.\nI used globe eggplants.  they are fat.  I sliced them in half lengthwise  as directed but ended up with two very thick pieces.  i scored them but i continued to compare what i had with what the picture showed and have no idea how you would have ended up with those thing triangular pieces.  What happened was i roasted the two halves in the oven but they flattened out and the \"meat \" of the eggplant became \"squares\" - kind of like when you score a  mango and turn it inside out - if that helps as a visual.  So, I could not finish the dish to compare to the picture as shown.  I did complete the sauce and yogurt etc but it was a mess.  And because my eggplant was so thick the flavor was more of hunks of eggplant instead of savory, saucey slices.  MCNew York9/5/2021The intriguing list of ingredients is what drew me to this recipe.  There are lots of things you wouldn't think go together - but boy, did they ever!  This was so good and very easy to make.  The eggplant had such a creamy texture and the yogurt and harrisa-preserve sauce was the \"cherry on top\", literally speaking.  I am a big fan of capers  and the crisped capers on top were delicious. I even coated some halibut in the same marinade and cooked it alongside the eggplant and added a nice protein element. TarPhilApex, NC9/2/2021Made this last night and just needed to share how ridiculously tasty it was.  Eggplant came out tender and creamy, the harissa-jam sauce was sweet and spicy, capers the perfect amount of funk and crunch on top.  On top of it all, healthy, unique and very attractive to serve. Great job all around. \n\nShameless plate-licking ensued. Grain of SaltColorado Springs, CO9/1/2021Tasty and pretty quick!  The resulting harissa sauce was a tad salty and I added no salt; likely the jarred harissa I used was already salty (Trader Joe’s).  Other than that, I loved the combination of textures and flavors:  crisped eggplant with silky centers, tangy yogurt sauce over the spicy harissa sauce, delicate herb, and those scrumptiously yummy crisped capers!  Thank you. AnonymousAlameda, CA8/20/2021Explore Bon AppétitEggplantVegetableHarissaCondiments, Sauces & PastesSummerFallSideGluten-FreeNut-FreeVegetarianRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Jessie Yuchen"]}