{"id": "787b60f71e97d8e19617e4f57d63cd8b", "url": "https://www.bonappetit.com/recipe/duck-carnitas-tacos-with-radish-escabeche", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Duck Carnitas Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueDuck Carnitas Tacos With Radish EscabècheBy Rick MartinezFebruary 11, 20205.0(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrint“Carnitas are my favorite taco in the universe,” says Rick Martinez. “My dad makes a classic pork version, but here I use luscious slow-roasted duck confit with crispy duck skin chicharrones cooked in pork fat. Same texture, same flavor...but extra extra, just like me.” Duck fat is delicious, but lard is cheaper and easier to find. Of course, if you happen to have duck fat lying around, feel free to use it. Just make sure to strain and use the fat left over from the cooked duck legs to make tortillas, roasted potatoes, or empanadas.IngredientsMakes 12Duck4duck legs (thigh and drumstick; about 3½ lb. total)6Tbsp. Diamond Crystal or 3 Tbsp. Morton kosher salt1lb. lard4morita chiles, halved lengthwise1bay leaf13\" cinnamon stick5whole cloves1Tbsp. achiote (annatto) seeds1Tbsp. black peppercorns1Tbsp. dried oregano, preferably Mexican1large navel orange, quartered1head of garlic, halved crosswiseEscabèche and Assembly⅓cup fresh lime juice1Tbsp. honey1tsp. kosher salt1bunch radishes, trimmed, halved, thinly sliced½small white onion, thinly sliced¼cup torn mint leaves3Tbsp. torn tarragon leaves1–3Fresno chiles, thinly sliced126\"-diameter flour tortillas, preferably Sonoran style, warmedPreparationDuckStep 1Prick skin on duck legs in several places with the tip of a paring knife. Rub legs with salt, working into flesh and skin. Transfer to a medium bowl or airtight container. Cover and chill at least 12 hours and up to 1 day.Step 2Place a rack in middle of oven; preheat to 250°. Heat lard in a large saucepan over medium-high until an instant-read thermometer registers 250°.Step 3Scatter chiles, bay leaf, cinnamon stick, cloves, achiote seeds, peppercorns, and oregano across the bottom of a large baking dish. Remove duck legs from bowl and brush off excess salt. Arrange legs, skin side down, over aromatics in baking dish. Nestle orange and garlic around legs, then pour warm lard over. Cover baking dish tightly with foil and bake legs 2 hours.Step 4Turn duck legs skin side up and nestle back into fat. Re-cover dish and continue to bake until meat is very tender and begins to pull away from the bones, 2–2½ hours longer.Step 5Let duck legs sit in fat until cool enough to handle (30–40 minutes), then transfer to a plate. Reserve 3 Tbsp. fat for frying duck skin and strain remaining fat through a fine-mesh sieve into an airtight container and let cool. Cover and reserve for another use (see recipe intro for ideas!).Step 6Remove skin from legs and set aside. Pull meat from bones, tearing into 1\" pieces; discard bones and cartilage. Heat reserved 3 Tbsp. fat in a large nonstick skillet over medium and cook reserved duck skin, turning halfway through, until deep golden brown and crisp on both sides, 12–15 minutes total. Transfer chicharrones to paper towels to drain and let cool 5 minutes; crumble into small pieces.Step 7Do Ahead: Duck legs can be baked 3 weeks ahead. Transfer whole legs to a large nonreactive container; strain fat through a fine-mesh sieve over meat. Cover and chill. Bring to room temperature before removing skin and shredding meat.Escabèche and AssemblyStep 8Whisk lime juice, honey, and salt in a medium bowl until salt and honey are dissolved. Add radishes, onion, mint, tarragon, and 1 chile and toss to coat. Add remaining chiles as desired (depending on their heat and how spicy you like things).Step 9Top warm tortillas with some reserved meat, then radish escabèche and reserved chicharrones.How would you rate Duck Carnitas Tacos With Radish Escabèche?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleMade these several month ago... Fantastic!!SteveSt Petersburg, FL1/9/2022I live part of the year in the southwest of France where duck is easily available as well as duck lard. On the other hand the chiles and annatto are not so easily found. I tweeked the recipe a bit as far as the aromatics. It was amazing! The meat cooks slowly in the lard and becomes very tender. We liked the escabeche a lot. I served it with cilantro lime rice and white beans cooked in duck lard which is a specialty here. I had guests and everyone enjoyed it. I will be doing this again and again! Thanks Rick!AnonymousSouthwest of France and Miami.10/4/2021We made this with older Muscovy duck legs and wings, and home made Mangalitsa pig lard...and it was absolutely fabulous!  We doubled the meat, but used the amount of lard in the recipe so top layer was chewy, but so delicious. We found the morita chilis and beautiful cinnamon at our local Latin American store.  This recipe is a keeper!StoneMeadowjcWATERLOO, ON2/22/2021This. Is. Amazing. I made the duck confit with just the standard bay leaves, garlic and thyme and this was still to die for. Everything, every texture, every flavor was a delight. One of the best meals i have ever made at home.AnonymousNorth Carolina1/2/2021Can you use duck breast to make this instead? Selena North Dakota 12/3/2020Awesome recipe. One of my favorite things I've ever cooked from BA. I highly recommend broiling the meat after you take it off the bone. I did 10 mins in my air fryer (broiler setting) and it crisped up beautifully. Such great textures and flavors in this dish!AnonymousLos Angeles6/22/2020What a treat! This recipe looked like a lot of work at first read, but most of it is really just waiting for the oven to do the magic. It's the first time I cooked duck and it turned out perfect – not dry, well flavoured and seasoned. I misread and only bought half the lard (250g) but it still turned out fine, and also had to improvise with missing spices (ancho chili flakes instead of whole morita, nutmeg instead of achiote) and it was still great.\n\nThanks Rick!AnonymousUK5/26/2020@BUCKSHOT49: Yes, the duck (or chicken) will last for three weeks in the fridge--as long as it's completely covered by the fat and not disturbed (I mean, not removed from fat and then put back in). Confit is a way people used to preserve meat before refrigeration. civilizationinruinsChicago5/24/2020Clarify please: Do Ahead section says cover and chill up to three weeks ahead.  Does duck really last that long in the fridge?\n(Making this tonight using chicken; smells great so far!Buckshot49Washington3/27/2020Made these last weekend — they were delicious! Don't skimp on the duck skin chicharrones. They are delicious, and they help make up for the lack of cripy bits on the duck. To help with the lack of crispiness factor, we did consider sticking the shredded duck under the broiler or sauteeing the shredded meat in some fat on the stovetop, BUT we ultimately decided to stick to the recipe because we were hungry and worried about drying out the duck. Curious to know what others thought about the texture! Overall, super delicious tacos. Highly recommend.AnonymousChicago3/11/2020Explore Bon AppétitTacoDuckPoultryRadishVegetableMainDairy-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Rick Martinez"]}