{"id": "7888391efb2e3b059720b374ebd0fa4c", "url": "https://www.bonappetit.com/story/desk-lunch-is-best-cold", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Desk Lunch Is a Dish Best Served Cold | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDesk Lunch Is a Dish Best Served ColdThere, I said it. Now hear me out.By Hilary CadiganOctober 7, 2019FacebookTwitterEmailIllustration by Łukasz GolędzinowskiFacebookTwitterEmailLet’s establish this right up front: I’m not a monster. I’m not saying I’d rather eat a cold bowl of lettuce over a piping hot pizza or a fridge-temp macaroni salad over a steaming bowl of khao soy. Would I rather eat a hot lunch? Of course I’d rather eat a hot lunch. But guess what, folks? Despite the illusions I'm proffering on my Instagram feed, I have not the dollars nor the time to go out for lunch every day. Which means most days, I’m B-ing my own L. And thus, my conclusion stands: Desk lunch is a dish best served cold.The reason for this conclusion can be summed up in one single word: microwaves. In four words: Microwaves are the devil. I get it—back in the ’50s they were very exciting. Some guy named Percy Spencer invented them with radar technology developed during World War II. That to me sounds kind of scary, but I’m not even one of those conspiracy theorists who is sure that microwaves are frying all of our brains. Lots of things are doing that. My cell phone is definitely killing me as we speak, and yet it comes with me everywhere like a phantom limb. We all die somehow.No, my issue with microwaves is much simpler than that: They don’t work. They make everything mushy. They are diabolically opposed to heating anything evenly, so when last night’s now-significantly-degraded lasagna comes out, one side is guaranteed to be ice cold while the other is so hot that one bite means you’re dealing with a roof-of-the-mouth burn for the rest of the week. What is worse than a roof-of-the-mouth burn? Nothing is worse. And finally, carrying your stank-ass bowl of microwaved soup from the furthest corner of the office (which is always where the microwave is) to your sad desk dwelling, leaving a hot little soup trail in your wake, is an extremely deflating way to spend your work day’s sole intermission. And if you’re me, this already crushing scenario, which is taking place at 11:16 a.m. because I lack self control, ends with dumping said soup on your lap at the exact moment that Anna Wintour is walking by your desk. (Yes, this happened.) You can’t come back from that, reader. You just can’t.It’s a salad! Sandwiched between two slices of bread.\nPhoto by Alex LauSo yeah. After Soupgate ’19, I made a promise to myself. No more would I bend to the indignity of the office microwave. Instead, I would forge a new path. A fridge-temp path, but one that decidedly didn’t suck. I would feast upon cold noodle salads with creamy peanut dressing. Or this very excellent and well-named green goddess crunch sandwich (it’s healthy!) or this more-decadent-than-it-should-be pan bagnat with anchovies (leave it to Andy Baraghani, amirite?) (see also: Andy's ramen noodles with miso pesto which arguably taste better cold the next day than hot the night before). Or the architectural marvel that is this harissa-kissed steak salad (because microwaved steak is an assault on everything good, whereas cold leftover steak is delicious). Or this lovely summer gazpacho because cold soup is for sophisticates like myself. Or maybe even this delightful creamy curried coconut peanut dip, which you can plop on your desk and spend the whole day scooping up with various foodstuffs: cucumber spears, rolled-up deli meat (trust me), free snack table pretzels, you name it. Desk dip? Yes, desk dip. Even Anna Wintour would approve of that. (Probably. Right?)Let me establish something else, here on the back end: Reheating leftovers is not a crime. There are many ways to do it humanely. In the oven, in a wok on the stove, in one of those unfortunately named Charleston steamers my mother-in-law keeps sending me. Maybe even in my air fryer, if I ever manage to clear off enough kitchen counter space to accommodate it. But none of these things are at an office. (Okay, they actually are at my office because I work at Bon Appetit, but do you think Carla Lalli Music’s video-taping schedule leaves time for a lowly print editor to squirrel around at the test kitchen stove? No, it does not.) So for now, I’m sticking with my plan. Cold lunches. Full hearts. Can’t lose.Explore Bon AppétitLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Hilary Cadigan"]}