{"id": "7889a30ddf04eea6eac18681eadcfc29", "url": "https://www.bonappetit.com/recipe/slow-cooked-bell-peppers-with-bay-leaves-and-oregano", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Bell Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSlow-Cooked Bell Peppers with Bay Leaves and OreganoBy Claire SaffitzAugust 14, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintBell peppers get sweet and silky when they slow-roast. Then use them to top ricotta toast, or serve as a hands-off side, or chop them up and mix into your lunch bowl.Ingredients6 servings1lb. any color bell peppers, halved, seeds and ribs removed½head of garlic2sprigs oregano2dried bay leaves½cup extra-virgin olive oil¾tsp. kosher salt1Tbsp. sherry vinegarPreparationStep 1Place a rack in middle of oven and preheat to 350°. Toss bell peppers, garlic, oregano, bay leaves, oil, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast vegetables, tossing 2 or 3 times, until golden brown, very tender, and edges are crisp, 80–90 minutes. Let cool slightly, then add vinegar and toss to coat.How would you rate Slow-Cooked Bell Peppers with Bay Leaves and Oregano?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleEasy.  Keeper.  Used Aura peppers (yellow - orange) and Italian sweet peppers (red).  Works with a little less EVOO if you're being ingredient 'thrifty' but the oil at end is so good for dipping bread.  dimmerswitchBoise ID9/29/2021These are TOO good. I add more sherry vinegar, but otherwise this is perfect. VikaBellaQueens, NY5/3/2020Explore Bon AppétitCondimentAmericanBell PepperVegetableOreganoHerbs & SpicesEasySideVegetarianVeganDairy-FreeGluten-FreeNut-FreeHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}