{"id": "789222a6f5288fc6fcd1c674ec5d2a9e", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-6", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "The 'Healthyish' Podcast Episode 5: The Things We Eat for Others | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Things We Eat for OthersOn the final episode of the Healthyish podcast, a story about how love changes us—and our diets.By Bon AppétitJuly 22, 2021FacebookTwitterEmailFacebookTwitterEmailWould you change the way you eat in the pursuit of love? Writer and baker Zoe Denenberg tried to go vegan for Ben, the guy she had a crush on, but it didn’t get her the result she was hoping for. Read Zoe’s essay about what she learned instead, and listen to Zoe and Ben get real with each other on this week’s episode of the Healthyish podcast.ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episodeI Went Vegan for Love—And I Won’t Do It AgainHow to ListenListen to this episode through the audio player on this page or subscribe via Apple Podcasts, Spotify, or wherever you get your podcasts to get all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitCulturePodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-22", "author": ["Condé Nast", "Bon Appétit"]}