{"id": "7894e143ce92b9e066d1609ed1bb4be3", "url": "https://www.bonappetit.com/recipe/creamy-kimchi-dip", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Creamy Kimchi Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy Kimchi DipBy Amiel StanekJanuary 18, 20183.7(19)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIf the combination of cream cheese and kimchi sounds crazy to you—well, it’s crazy good. Room temperature cream cheese is key for this recipe—if it’s too cold, it won’t blend smoothly with the sour cream. Kimchi varieties and brands vary greatly in terms of heat level and flavor profile, so choose your own adventure. See the rest of the $50 dinner party menu here.IngredientsMakes about 3½ cups2cups kimchi (squeeze over the sink to get as much moisture out as possible)8ounces cream cheese, room temperature8ounces sour cream1tablespoon plus 1½ teaspoons low-sodium soy sauceKosher salt, freshly ground pepperPotato chips, pretzels, and/or sliced vegetables (for serving)PreparationFinely chop kimchi. Cut cream cheese into big pieces and transfer to a medium bowl. Add sour cream a few spoonfuls at a time and mash together with a spatula until combined. Stir in kimchi and soy sauce. Season with salt and 7–8 good grinds of pepper. Serve with chips, pretzels, and/or vegetables alongside.How would you rate Creamy Kimchi Dip?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleAbsolutely delicious, would make a great gateway drug for anyone who is nervous about trying kimchi. ClairePennsylvania2/5/2022This recipe deserves more stars! It's very good. For those who struggled with the liquid, try squeezing the kimchi fully. Anyway, so so good. It was a hit at a NYE party I attended several years back, and at the holiday party I threw right before the pandemic began. I'm going to make it again, because truly, I've been thinking about it since.Martha12/13/2021I've not tried this yet, however it has the essentials for flavorful dish indeed.  I look forward to it.  On a side note, as I came to this site seeking different recipes for kimchi and I've not been disappointed.  I have a variation of this wherein it's not so much a dip, rather a spread.:\n8 ozs. kimchi drained and dried.  (ALWAYS open jarred kimchi over a sink because it's constantly fermenting while sealed), chopped/diced small\n8 ozs. of Shredded Sharp Cheddar Cheese\n8 ozs. of Shredded Monterey Jack\n16 ozs. Whipped Cream Cheese\nSeasonings to taste.... (use your imagination)\n\nBlend or mix thoroughly and refrigerate at least two hours, if not overnight.  (It will last well if sealed in the frig for a 7-10 days.\nUse as a spread for grilled cheese OR..... make a kimchi/spread quesadilla and add any protein (or not) you want.\n\nEnjoy and thanks for the dip recipe.\nROBINTHEUSAFL, USA4/23/2021A very nice recipe — I stepped up the Korea flavour factor by adding 1 tsp of sesame oil, a sprinkle of chopped green onions, and some toasted sesame seeds to take it to the next level. Anonymous12/31/2020This was good. I used the food processor to make life easier. Used 4% skyr since we didn’t have sour cream, and less soy sauce (~1 tsp) since I didn’t have low sodium. Really tasty as a burger condiment and to dip veggies in. The kimchi does all the work (flavor wise) for you.Anonymous6/21/2020Refrigerator cleanout becomes a fantastic dip. Refreshing and tangy, benefiting from the brightness of the three main ingredients, with a bit of umami and spice coming through from the kim chi and soy sauce. It reminds me somehow of a very retro shrimp dip my parents made in the early 1980s for their parties, bringing a nostalgic hit to an already delicious new recipe. (The flavor profile comparison makes sense - that throwback memory was a sour cream, canned cocktail shrimp, chili sauce concoction.) \nThis kim chi dip is definitely something we'll be adding to our own entertaining!Jena DiPintoNashua, NH8/24/2019Refrigerator cleanout becomes a fantastic dip. Refreshing and tangy, benefiting from the brightness of the three main ingredients, with a bit of umami and spice coming through from the kim chi and soy sauce. It reminds me somehow of a very retro shrimp dip my parents made in the early 1980s for their parties, bringing a nostalgic hit to an already delicious new recipe. (The flavor profile comparison makes sense - that throwback memory was a sour cream, canned cocktail shrimp, chili sauce concoction.) \nThis kim chi dip is definitely something we'll be adding to our own entertaining repertoire!AnonymousNashua, NH8/24/2019If you drain the kimchi - which is what the recipe tells you to do - you get an excellent dip!AnonymousMinnesota8/9/2019This was way too liquid, and agreed with the below. Didn't taste nice!mgxkleinFrance2/6/2019Sorry but this was vile tasting. Michael1642/3/2019Super good, although kimchi juice foamed all over my counterAnonymousYosemite, Ca2/3/2019QQ - CANNNN I make this the day before?AnonymousSan Francisco12/13/2018Explore Bon AppétitDipCream CheeseCheeseQuickEasySnackStarterNut-FreeVegetarianKetoBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Amiel Stanek"]}