{"id": "78991b0c2cd9bdf15d8c42253470977e", "url": "https://www.bonappetit.com/recipe/wood-ear-and-cilantro-salad", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Mushroom and Cilantro Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueWood Ear and Cilantro SaladBy Lisa Cheng SmithNovember 19, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintYou need a bigger bowl and more water than you might think to rehydrate wood ear mushrooms—they nearly triple in size. We love how chewy and bouncy they get in this salad. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 regular or 16 small servings2oz. dried wood ear mushrooms (about 2 cups)1Tbsp. dried goji berries4garlic cloves, finely chopped3Tbsp. toasted sesame oil3Tbsp. (or more) unseasoned rice vinegar¾tsp. kosher salt, plus more2red finger or Fresno chiles, thinly sliced, seeds removed if desired1cup (packed) coarsely chopped cilantroPreparationStep 1Place mushrooms in a large bowl and pour in boiling water to cover. Let soak, adding more hot water if needed, until floppy but still sturdy, about 1½ hours.Step 2Meanwhile, place goji berries in a small bowl and pour in cold water to cover. Let soak until just softened, about 30 minutes, then drain.Step 3Drain mushrooms, wrap in a clean dish towel, and squeeze out any excess liquid. Remove any woody parts from mushrooms and tear into smaller pieces if large. Wipe out bowl and place mushrooms back into bowl. Add goji berries and toss to combine.Step 4Whisk garlic, oil, vinegar, and ¾ tsp. salt in a small bowl. Drizzle dressing over mushroom mixture and toss to coat. Let sit 10 minutes, then toss again. Taste and season with more salt and/or vinegar if needed. Let sit at room temperature at least 1 hour and up to 6 hours (cover and chill if holding longer than 1 hour).Step 5Just before serving, add chiles and cilantro and toss to combine.How would you rate Wood Ear and Cilantro Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladChineseEast AsianAsianMushroomVegetableEasySideDairy-FreeVeganGluten-FreeVegetarianKetoHealthyishLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}