{"id": "789aa37f71e56570f0946e78f96aa8c8", "url": "https://www.bonappetit.com/story/how-to-eat-a-slice-of-pizza", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "A Long Answer to a Simple Question: How Do You Eat a Slice of Pizza? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Long Answer to a Simple Question: How Do You Eat a Slice of Pizza?The fold. The toppings. The location. The drink. It all matters. Maybe even too much.By Alex DelanyMarch 7, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEating a slice of pizza is kind of like taking a shower: everyone does it, but not in exactly the same way.I’m not going to say that I’ve eaten more slices of pizza than I have taken showers (because that might be gross), but the tally is probably closer than you’d think. Living in New York, slices are a huge part of life, whether they’re eaten at 2:00 a.m. on Saturday night, out of the fridge at 10:00 a.m. the next morning, or in the fifteen minute window between meetings on a Tuesday afternoon. If you walk down any block in New York, you will see someone eating a slice.Which brings me back to the procedure. The fold. The toppings. The location. The grease. The beverage. They’re all handled in accordance with personal preference. And while no method is ever wrong, I’d love to share my favorite way to get the perfectly balanced bite. The only tools you need to eat pizza.\nPhoto by Alex LauA Quick Note About Forks and KnivesPut them down. Don’t ask for them. I like to eat a slice of pizza with my hand or hands. The only exception would be a soggy Neapolitan pie, but you should keep reading, because there’s a method for that that doesn’t involve utensils.How to Fold Your SliceThe initial decision is how you hold your slice, more specifically, the way you fold it. Also, I feel like this is a good time to mention that I did not realize how exposed my chest was in this photoshoot, AND I AM TOTALLY FINE WITH IT. Here are a few approaches to folding a slice:This slice cannot support the Wide Open Plain, so The Flop ensues\nPhoto by Alex LauThe Wide Open Plain (AKA the Non-Fold)Some slices have a crust that’s rigid enough to hold the weight of a small child, or at least the weight of the cheese and sauce on top of it. This slice doesn’t want or need the help of a fold or crimp. The non-fold does not work great with slices that contain a magnitude of toppings or slices that have a more delicate foundation.The FlopSpeaking of more delicate slices, if you hold a slice without bending the crust, the tip will droop. In this scenario, you can hold the slice higher than your face and let it fall right into your mouth like a pizza waterfall. Photo by Alex LauThe CrimpA slight bend in the crust, created with pressure from your thumb and middle finger (below the crust) and your pointer finger (above the crust) gives a partial bend in the crust, creating a structural triangle. A triangle is the strongest shape—I took geometry in 10th grade. I remember this. Look at bridges. There are lots of triangles happening on bridges—so this gives your slice more support and prohibits flopping and the dripping of grease. It also allows you to maintain eye contact with your toppings, so you can plot your course. The crimp isn’t necessary, but it’s guaranteed improve your slice experience.The mark of a true professional\nPhoto by Alex LauThe Crust TacoThis is the dark horse of the pizza-folding universe, and in my opinion, the most important fold you’ll ever perform. Crust is better with sauce and cheese on it. That’s why I will always stop short of the crust when eating my slice, leaving a little strip of cheese and sauce that’s equal in width to the crust. I then fold the sauce and cheese strip toward the crust, until they meet, joining the crust and the proper pizza into one glorious, collaborative experience.Photo by Alex LauThe Pizza SpliffAt a late night slice pit stop, I recently saw someone roll their slice from crust to point, creating a pizza-taquito-joint type thing. I don’t really know if this is something that people do or what. But if you subscribe to this philosophy, you probably don’t really care what I have to say, so...carry on.The wallet fold isn’t great for an American slice\nPhoto by Alex LauThe Pizza Wallet (AKA the Neapolitan Fold)I was recently watching the pizza episode of Netflix’s Ugly Delicious, where Lucali’s Mark Iacono employed the wallet fold. He folded the tip of his slice back into the center and pressed together the sides, to create a sealed pouch. This technique is prime for a super floppy slice, but not the best on your typical Italian-American slice, because the crust is less pliable. Exhibit A: The photo above.Photo by Alex LauTable ToppingsThese last minute additions can make or break a slice of pizza, so lets see what we’re working with.Red Pepper FlakesRed pepper flakes are the Lebron James or the Serena Williams or Meryl Streep of the 11th hour pizza topping game. They are all the best in the history of their respective fields. I will put red pepper flakes on my slice 93.3% of the time. The 6.7% of the time I do not is if the slice already has a spice component. That little bit of dry heat is exactly what a plain slice is asking for.Garlic SaltPizza sauce (the good stuff, at least) already has garlic and salt in it. But that doesn’t mean a litle sprinkle can’t help a slice with under-seasoned or over-sweetened sauce.Dried OreganoDried oregano lends an herbal, earthy, vegetal quality to a slice that can boost umami to marvelous levels, but it’s all about proportion. For extra control, try shaking the oregano into your hand, and sprinkle from there. ParmesanParm is a fantastic cheese, but the Parm that most slice spots stock may not be. If you want a little diversity in the cheese flavor, I’ll cosign a table Parm flurry.Freshly Ground Black Pepperlack pepper is the most underrated table topping in the game, especially when it comes to a white slice. Think about how much you love cacio e pepe. Now think about turning your pizza into cacio e pepe. That pepper needs to be freshly ground though.Photo by Alex LauDRANKSMy two favorite beverages to drink with a slice are Lambrusco (which is pizza pro approved) or Coca-Cola. Diet Coke works too. You want something fizzy, sweet, and light-bodied to wash down bite after glorious bite. If you don’t like Coke or Lambrusco, well, I’ll widen the field to soda or juicy, light-bodied red wine or that trendy seltzer you love so much. Location, Location, LocationThis is an opinion based on zero quantifiable data, but slices usually taste better when you’re standing up. Sitting down for a slice is going to inspire a nap (unless you’re sitting at an open air table). There’s something about the brief, casual, barely-broke-your-stride mentality that comes along with a slice which makes it special, so if you can stand up while devouring your slices, do it. Eat them at a counter, on the sidewalk, or even better, at a counter on the sidewalk. Sidewalk counters are special.Wow. You read that whole thing? Now you get pizza.Cast-Iron Skillet Pizza, Where Have You Been All Our Lives?Thanks to a store-bought dough and a screaming-hot cast-iron skillet, weeknight pizza just got a whole lot better.View StoryExplore Bon AppétitPizzaNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Alex Delany"]}