{"id": "789d50c7eb3512e89f96f9a216581b8f", "url": "https://www.bonappetit.com/story/sage-green-kitchen-design", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "We're Calling It: Sage Green Is the Kitchen Color of 2021 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe're Calling It: Sage Green Is the Kitchen Color of 2021It'll help you live, laugh, and love your space again.By Ali FrancisJune 8, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.From peppy lime to sophisticated olive, I’ve never met a green I didn’t like. But these days it seems I can’t swipe an inch on my feed without seeing herbaceous-hued dining rooms, kitchen cabinets, boudoirs, feature ceilings—even toolboxes(?). While common sage (Salvia officinalis) has long been prized for its earthy flavor and medicinal properties, sage green is—according to me—the official vibe of 2021.“Sage green reminds you of spring farmer’s markets, when all the leafy produce is finally back in season,” says designer and interior stylist Anna Brettschneider. “It’s a muted green with grey undertones, somewhere between cool mint and warm moss.” Already a color Brettschneider says we naturally associate with the outdoors, sage is coming inside for dinner too—in the form of funky pepper grinders, fancy pans, and pretty placemats. During the pandemic especially “we are wanting to feel more connected to nature,” she explains. “It also makes sense aesthetically to reflect the ingredients you’re cooking with throughout your kitchen.”Photograph by Isa ZapataSowden Salt and Pepper GrinderKeep calm and crank on. This minimalist mill is made from stainless steel and features an adjustable grind coarseness.$49 at HAYColors play a huge role in the way we interpret the world around us. When we were all barefoot and roaming a monolithic piece of earth, different colors helped us identify two very important things: food and mates ('twas a simpler time). Via their saturation, brightness, and hue, colors affect us psychologically, explains Sally Augustin, PhD, an environmental psychologist and principal at Illinois-based Design With Science, a consultancy applying research-backed insights to spatial and object design. “We form cultural associations to families of shades that share a common name—for example, we link blues to credibility and trustworthiness,” she says. Sage green, on the other hand, is “very relaxing for us to look at.” It’s the chromatic answer to These Times.“Color carries a lot of meaning for us,” explains Our Place cofounder Shiza Shahid. “We use it to honor the rituals that have nourished us through the ages.” The sage-colored release of their Instagram-famous Always Pan celebrates the namesake herb for its proliferation in cuisines and culinary traditions around the world. “Sage green also symbolizes sustainability and the health of the earth we share—something that's very important to us,” Shahid says. For Food52’s tableware buyer, Casey Simring, it’s her literal job to pore over colors and textures all day, making sure a product fits the team’s “less is more” motto. And sage green, she says, is a sought-after shade that plays well with neutral colors. “It's hard not to think of freshness when you see such a soft, inviting green,” Simring explains. “After the past year and a half, I think everyone is looking for that fresh feeling right now.”Photograph by Isa ZapataAlways PanThe Russian doll of cooking equipment, this pan, steamer basket, and beechwood spatula nest together under one pretty sage dome.$145 at Our PlaceA quick way to bring sage green into your kitchen is with a lick of paint (in a shade like the evocatively named “Endless Day” or “Country Spring”). “That could mean taking off all of your cabinet doors and splashing them with some paint, or it could simply mean covering a couple of walls in your space with a fresh coat,” Brettschneider advises. If painting scares you (or your landlord), think small and bring in pops of color via your kitchenware. Placemats, for example, “are a great way to introduce color and style to your table, without committing a full dinnerware set or a dining room accent wall,” agrees Simring. Just remember, Brettschneider heeds, to tie everything together with accent colors like soft terracotta, acid yellow, and bright orange. Just like the herb, sage green is happy to star the show—or fade coolly and calmly into the background.If you really want to lean in, as they say, my colleague and resident BA plant expert Joseph Hernandez grudgingly admits sage is one of the easier herbs to grow at home. “So..... i really hate growing herbs indoors, because they're not ‘easy’ like everyone says; they have short lifespans and death wishes (looking at you, basil),” he explains over Slack. “But sage is pretty prolific and hearty.” Not to mention, delicious! A full-grown sage plant will reward you with ample aromatic leaves for butter-slicked tortellini, golden parathas, and all the tostadas.Eat Sage:Tortellini with Brown Butter and SageStore-bought tortellini are the kind of weeknight hack we can get behind—especially when they're tossed with plenty of garlicky brown butter and toasty walnuts.View RecipeShop Sage:Photograph by Isa ZapataUashmama Essential Placemats 4-PackThese perfetto placemats are made in Italy using wax-coated paper, meaning they’re spill and stain resistant and require nothing but a quick wipe-down after each use.$48 at Food52Photograph by Isa ZapataDutch OvenA good D.O. is something you’ll use for life; cooking up bread, pasta, stews, and braises. With its ceramic coating, this one also happens to be ultra nonstick (bless!).$125 at CarawayPhotograph by Isa ZapataStojo 16oz Collapsible Coffee CupFill it with wine! Hot coffee! Iced tea! Collapse it, stow it away, and repeat.$15 $12 at AmazonExplore Bon AppétitShoppingTrendsDesignHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-08", "author": ["Condé Nast", "Ali Francis"]}