{"id": "78b386834881c2f6bda27b8de5362fee", "url": "https://www.bonappetit.com/story/the-bon-appetit-podcast-is-back", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "The Bon Appétit Podcast Is Back! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Bon Appétit Podcast Is Back!And we’re kicking it off with a six-episode series from Healthyish. By The Bon Appétit StaffJune 10, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to the Healthyish podcast, a six-part miniseries that takes a close-up look at food and wellness in all their delicious complexity. Join host Amanda Shapiro (editorial director of Bon Appétit and the founding editor of Healthyish) along with professional chefs, home cooks, and, of course, our very own cast of Bon Appétit staffers to dive into what it means to eat, drink, and live healthy(ish), with lots of cooking advice and recipe ideas along the way.ContentThis content can also be viewed on the site it originates from.Check out the trailer above. The first episode of Healthyish will drop on Thursday, June 17, at 6 a.m. ET, with new episodes released every Thursday. Subscribe on Apple Podcasts, Spotify, Google Podcasts, Stitcher, or wherever you listen to podcasts.Explore Bon AppétitPodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-10", "author": ["Condé Nast", "The Bon Appétit Staff"]}