{"id": "78c65bf9780ae87d3527f14505bb578e", "url": "https://www.bonappetit.com/recipe/baked-ziti-spaghetti-squash", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Baked Ziti-Style Spaghetti Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpaghetti Squash That Fancies Itself Baked ZitiBy Sarah JampelJanuary 4, 20224.8(66)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintIn a surprise to absolutely no one, spaghetti squash—unfairly maligned as bland and watery—tastes amazing when smothered in flavorful tomato sauce and blanketed under a layer of melty cheese. Here the tomato sauce cooks in the oven at the same time the squash roasts; combine the two, return the dish to the oven, and you’ve got a hands-off dinner with minimal cleanup. Serve this with bread and a green salad one night, then mix leftovers into pasta for “noodles” on noodles the next. Halving the squash crosswise is a tip we learned from cookbook writer and food blogger Alexandra Stafford; it involves easier (and safer!) knife work and results in longer, more noodle-like strands. The bake time of the squash depends on the squash itself—anecdotally and with no scientific backing, I’ve found that smaller, yellower spaghetti squashes tend to cook faster and taste better. —Sarah JampelAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMetal Baking Pan$22 At AmazonMicroplane Grater$16 At AmazonSilicone Spatula$13 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4–6 servings1small spaghetti squash (about 2½ lb.), halved crosswise, seeds removed¼cup extra-virgin olive oil, plus more for drizzling¼tsp. kosher salt, plus moreFreshly ground black pepper128-oz. can whole peeled tomatoes4large garlic cloves, smashedA big pinch of sugar¼tsp. crushed red pepper flakes, plus more for serving1½oz. Parmesan, finely grated6oz. mozzarella, coarsely grated1handful of basil leaves, torn if largePreparationStep 1Heat oven to 425°. Line a rimmed baking sheet with a silicone baking mat or parchment paper. Place squash on baking sheet and drizzle with oil; rub to coat. Season with salt and black pepper. Turn cut side down and bake until a paring knife easily pierces skin and squash collapses easily under the pressure of tongs, 40–60 minutes, depending on your squash.Step 2Meanwhile, place tomatoes in a 3-qt. baking dish (any shape, such as an oval or a 13x9\" rectangle works!) and squish with your hands to break tomatoes apart. Add garlic, sugar, ¼ cup oil, ¼ tsp. crushed red pepper flakes, ¼ tsp. kosher salt, and season with black pepper; stir to combine. Bake, stirring once or twice, until sauce thickens slightly and is bright red and bubbly, 35–40 minutes. Using a rubber spatula or spoon, coarsely mash garlic and any tomato pieces.Step 3Let squash cool slightly, then, using a fork, tease out flesh; discard skin. Add to baking dish with tomato sauce along with Parmesan. Stir to combine, breaking up squash further into strands. Season with salt and top with mozzarella.Step 4Return baking dish to oven and bake squash until cheese is melted, 5–7 minutes.Step 5Heat broiler. Broil, watching closely, until cheese is bubbly and browned, 1–2 minutes. Top with basil, more crushed red pepper flakes, and black pepper.How would you rate Spaghetti Squash That Fancies Itself Baked Ziti?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleHave to make it first!AnonymousWestern Canada2/28/2022For how truly simple this dish is, it is absolutely delicious! Regular weeknight meal stapleAnonymous2/27/2022I've made this a few times and it's become a staple dish. It's absolutely delicious!\nI love the way the sauce is created by simply baking the hand-squished canned tomatoes. It's genius!\nTry this and I promise you it will become a staple in your house, too.Ellen M.Hudson Valley, NY2/19/2022This is delicious, and I know I will make it again.  I used a small can of tomatoes, though, and not the larger one.  I cooked the tomatoes for about 20 minutes, and that was enough.  I am wondering if next time I could add steamed chard or spinach to it during the bake - maybe when you put the tomatoes in.  I think I will try it.  FrancesNapaNapa, CA2/10/2022I made a weeknight riff on this. I par-microwaved, oiled and seasoned it, and roasted on high heat until stringy. Then mixed with doctored jarred marinara (with 1/2 lb. browned ground beef) and topped with dollops of cheesy-herby-eggy mixture and a blend of fresh shredded cheese. It was very tasty and not as wet/mushy as I'd feared. The creamy mixture is a must in my book.\n\nServed with broccoli sauteed with garlic, fennel seed, and chili flake.ChristinaMAsheville, NC2/8/2022@Donna I like the Trader Joe's vegan mozzarella!Sarah Jampel2/3/2022If anyone makes this with vegan mozzarella or vegan parmesan I'd like to know what brands you like.  I tried Miyoko's vegan mozzarella, not in this dish, and did not like it.DonnaNew York City1/31/2022I made it with veggie \"meat\" balls and it was delicious. Everyone loved it. My only complaint is that it didn't have a calorie count listed.Laura NaylorEastern Shore of Virginia1/25/2022So delicious! I made it 100% plant-based by using vegan mozzarella and vegan parmesan – just as tasty (if not tastier), healthier, and to me most important of all ... cruelty free. No animals suffered to so I could enjoy a meal. Win-win!Anonymous1/24/2022Are the crushed tomatoes in the baking dish put in the oven at the same time the squash is baked on the parchment paper (but take tomatoes out after 35-40 min)? Or am I supposed to bake the squash first for an hour and then put the tomatoes in for 40 min?Anonymous1/24/2022This recipe was absolutely delicious! I used about a 4# squash and the quantities were still great. Definitely make sure it is seasoned well before the final broil! Will make again! Sally Jane New York, NY 1/19/2022This recipe is so versatile! So many other recipes result in bland, boring spaghetti squash, but this one was great.  The techniques used are fantastic for flavorful spaghetti squash and it's super easy to sub in whatever you have at hand. I threw in some fresh thyme and feta instead of mozzarella with delicious results.ElizabethSanta Barbara, CA1/12/2022Just made this, incredibly delicious. Some changes due to not having exact ingredients. Used 1 can diced tomatoes, 1 tablespoon tomato paste and 1 teaspoon anchovy paste. It was sooo good, had 3 helpings. Best use of spaghetti squash ever. AnonymousHelena MT1/9/2022looking forward to trying this recipe will keep u posted?Anonymouscanada1/8/2022I wish Spaghetti Squash were more readily available in stores.   I'm going to grow more this year, because of recipes like this.\nVery tasty!  An Arrabbiata style sauce over Spaghetti Squash all baked in the oven.  Once the cheese melted... Mmmmm!  And so Easy 👍👍👍David StarnesHenryville, IN1/8/2022Explore Bon AppétitDinnerWeeknightQuickEasyCasseroleVegetarianNut-FreeGluten-FreeSpaghetti SquashSquashVegetableCanned TomatoTomatoMozzarellaCheeseMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Sarah Jampel"]}