{"id": "78de9e21ec2baa575c82225b66cf3311", "url": "https://www.bonappetit.com/story/best-lettuce-to-buy", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "This Is the Best Lettuce to Buy at the Grocery Store | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Best Lettuce to Buy at the Grocery StoreA very green investigation into the best lettuce: boxed, bagged, or whole heads?By Emma WartzmanJanuary 24, 2018FacebookTwitterEmailFacebookTwitterEmailWhen you go to the grocery store and lettuce is on your list, you're faced with a multitude of options. There is bagged lettuce and boxed lettuce, \"triple-washed\" lettuce, and whole heads with the root still intact, flecks of dirt visibly clinging to all the nooks and crannies. So, what's the best lettuce to buy? We prefer whole heads first because they're the cheapest, least processed, most eco-friendly, and potentially the healthiest. After that comes boxed, and then bagged. Here's why.Whole heads are cheaper.Whole heads will generally get you more bang for your buck because you're not paying for the convenience of having the leaves washed and chopped for you. At a Whole Foods in NYC, for example, one head of Romaine costs $2.49 while a bag costs $2.69 (not a huge difference, but hey), and a box costs $4.49. At another grocery store, a head goes for $2.50 while a bag is anywhere from $3.50 to $4.00 and a box is anywhere from $3.99 to $4.49, depending on the brand. When you want to make your own bagged salad for a little less money, a whole head is your best bet.Bagged and boxed lettuces aren't necessarily cleaner.Turns out that any lettuce—whole, bagged, or boxed—can be infected with diseases like salmonella, listeria, and E. coli. And while those leafy greens inside of packaging may look a lot cleaner, there's just as much of a chance they'll be tainted as their intact counterparts, even if they boast \"triple-washed\" on their label. Pre-cut and pre-packaged lettuce gets handled more before it hits store shelves, which opens up more possible points of contamination. But the truth is, \"an outbreak can happen from such a wide variety of things all along the supply chain,\" according to Food and Drug Administration spokesperson Peter Cassel. \"The problem typically starts in the field anyway. And, what's more, it's not uncommon for produce—or anything that travels in bulk for that matter—to come in contact with another product that’s been contaminated as it moves from point A to point B to point C.\" Plus, salmonella and listeria can be washed off any greens at home if you're thorough enough (which means extracting any damaged pieces, running the leaves underneath cold water a few times, and drying well). E. Coli, however, is nearly impossible to get off, whether in a massive facility or at the kitchen sink.Whole heads are the \"greener\" choice.Clearly, whole heads of lettuce are the winner here. If the environment is your top priority, stay away from plastic altogether (unless you're planning to re-use a given container). But if you must pick between two lesser options, go with a box instead of a bag of pre-washed greens. Boxes are generally made from #1 polyethylene (also known as PET or PETE), which is an easily recycled material. Bags, however, are often made of a plastic that contains additives meant to sustain the greens inside of them. \"Polymer barriers help protect the food and extend shelf life but recyclers consider them to be a contaminant in the recycling bin,\" according to the Association of Plastic Recyclers.In this case, it's definitely whole heads FTW.They may even be healthier.According to Jo Robinson, author of the 2013 book Eating on the Wild Side, bagged and boxed lettuce simply isn't as fresh by the time it reaches your salad bowl, especially if you leave it in your fridge for a day or two. “Many of these prepackaged greens might be two weeks old,\" she said in a Fresh Air interview. “They’re not going to taste as good, and many of their health benefits are going to be lost before we eat them.”A recent article from The New York Times backs that up. The sooner you eat your greens after you purchase them, the more likely they are to retain all their vitamins. In particular, vitamins B and C are water soluble and can diminish through the washing and chopping that takes place during commercial processing. Add that to the time it takes to reach shelves, then your own refrigerator, and it's just not as good for you as it once was. Whole heads are less processed on the front end, so all those good-for-you vitamins are more likely to be present when you pick it off the shelf.The farmers' market exceptionAnything you get at the farmers' market is preferable to what you'll find on the average grocery store shelf, and that includes lettuce. Whether you're getting a whole head or a bag of loose greens, buying from the market means less time from farm to fridge, less time for the greens to wilt and lose their healthy stuff, and less of a chance that they'll come into contact with, say, contaminated meat or fish.And if you're going to buy lettuce in plastic...We get it: Sometimes you're just too lazy to chop, or you can only find that butter lettuce in a box. If that's the deal, go with boxed first—then recycle that plastic.How about some salad for breakfast?Salad for BreakfastEggs on toast with quick-pickled veg and marinated feta.View RecipeExplore Bon AppétitSaladLettuceHealthyishRead MorecookingMake Your Own Bagged Greens, Eat So Much More SaladBy Dylan RupertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Emma Wartzman"]}