{"id": "78e4fc4194b9e5d9fa298bc85b772dbb", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/noma", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Noma Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenNomaThe next evolution of René Redzepi’s destination restaurant in RefshaleøenFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: because Copenhagen has grown to become an exciting global food destination since René Redzepi opened the first Noma (now Barr) in 2003, and he’s not resting on his fame. Quite the opposite. His next-gen mothership is a temple of food, for sure, but above all it’s a temple of learning for his cooks, men and women from around the world who have been given more room to create and explore in a sprawling campus of kitchens, labs, and gardens.ORDER THE: well, you don’t really have a choice! The set menu is seafood from January to June, vegetables June to early fall, and game through December. A meal here expands the mind, palate, and eye as hyperlocal and seasonal produce is used to craft poetic dishes that are built with layers of skill and meaning.THE VIBE IS: reverent but the opposite of stuffy. Like the dining room, it’s light and open. The T-shirted staff is friendly—and you’ll meet many of them as they serve you throughout your meal. Try to come early for (or linger later on in) the cozy lounge, where you can sip all sorts of crazy things, like koji-fermented barley milk.PRACTICAL STUFF: Open Tuesday through Saturday, from 5 p.m. to midnight. Closed Sunday and Monday. Reservations for the season are available several months in advance, so hover over your computer or keep checking Noma's Tock calendar. Sign up for its newsletter for alerts too. You’re strangely better off finding a table if there are more of you—or you might be able to squeak a solo spot at the group table that also serves as a 20-seat private dining room. Ten percent of tables per service are reserved for students, who receive a very nice discount with ID.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEAmassHidden in Refshaleøen, an elaborate root-to-stem tasting menuSanchezMexican food by way of Scandinavia in Vesterbro RelæLive a little with the Nørrebro tasting-menu restaurant that’s still making waves Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}