{"id": "78e6f2518d56c4816f126c768fd963c5", "url": "https://www.bonappetit.com/story/no-more-wet-brine-turkey", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "We're So Over the Wet Brine. Over It! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe're So Over the Wet Brine. Over It!The only turkey recipe you need, an apple with pink (!) flesh, and more food news from the week.By Alex BeggsNovember 17, 2018FacebookTwitterEmailPhoto by American Stock/Getty ImagesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The countdown to turkey timeLet me guess. *Waves hand over crystal ball that’s actually an onion on a plate. * You hate the taste of dry, rubbery, bland turkey. Yet it feels inevitable. As if the universe pre-determines it—like the delayed flight that has you sitting on the tarmac for two hours every year. But no! Not this year, folks. This year the dry brine is going to save us all. Andy Baraghani, who “won the Oscar” aka was assigned the turkey recipe for the Thanksgiving issue, has a simple salt and sugar mix that you rub all over the bird a day before roast time and it results in juicy, skin-crackling goodness. (Don’t forget a side of Andy’s umami gravy, too.) Don’t ask about a wet brine–it waterlogs your bird, makes a watery mess, and we’re over it. Over it!Get the recipe:Dry-Rubbed Roast TurkeyOur never-fail turkey is excellent in every way that every other turkeys often fall short. Period.View RecipeWant this letter before it hits the website? Sign up for our newsletter!PHOTO BY MICHAEL GRAYDON + NIKOLE HERRIOTT, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKII’ll tell you what I’m not makingA salad. Last year, I brought a beautiful radicchio salad with honey vinaigrette to my friend Justin’s Thanksgiving feast (he smokes a turkey in his Big Green Egg—epic), and NO ONE ATE IT. A huge bowl of perfectly dressed leaves was left untouched, as if it was decorative purple potpourri. Even I didn’t have room on my plate and had prioritized green bean casserole for my obligatory vegetable. So this year, I’M NOT MAKING A SALAD. However…this new recipe with sour cream ranch (*swoons *) is incredible and I’m making it for a dinner party this pre-T weekend, along with a big roast beef (recipe coming soon!).Get the recipe:Radicchio Salad with Sour Cream RanchWith salty, sweet, and creamy components, this recipe is more than just a salad: It's a fully realized side dish.View RecipeLolArt newsEdward Hopper (1882-1967), Chop Suey, 1929.Edward Hopper’s 1929 painting “Chop Suey” (of me and my friend Laura talking about where to find the cheapest therapy while waiting for our dinner check) sold for $91.9 MILLION.“Really, $100 million for a Hopper? I don’t know how they come up with these valuations,” Howard Rehs, a New York gallerist who presumably never orders the chicken because he can make that at home, told the New York Times. Art historians like Judith A. Barter point out that none of Hopper’s paintings in restaurants and diners actually contain food. She told Christie’s the artist was “famously uninterested in food, Hopper and his wife often made dinner from canned ingredients. What he found important were the spaces where eating and drinking took place.” $91.9 million is a lot of baked beans!Favorite pizza toppingsThis week, Christina Chaey sent me a screenshot as she applied to be a United Airlines MileagePlus member “of course.” One security question was, bafflingly, “what is your favorite pizza topping?” and the options revealed an underside of the American public that usually lives in the shadows. Who are these people with MASHED POTATOES on their pizza? Shrimp is an option but not CLAMS?? Where in the Sam Hill are the anchovies??? Zucchini is too watery for pizza! “I’ll take a half za’atar, half prawn,” SAID NO ONE. I don’t know about you, but this security question leaves me feeling more unsafe than ever.Overheard at BA:“Why didn't you do the over-under?” That was Adam Rapoport asking Rachel Karten why her stunning lattice-crust cranberry tart wasn’t properly latticed, which is because it’s more of a cookie dough, not pie, with pecans that make it hard to maneuver. We booed and hissed and sent him away—it was a BEAUTIFUL lattice. Even Claire commented, “She is PERFECT.” Has Adam ever made a tart? NO. (Note about this recipe: you can cover all kinds of mistakes, like cracks in dough and improper lattices, with a dusting of powdered sugar. It looks elaborate but it’s more accessible than you think. And so tangy! We ate it for breakfast.)Get the recipe:Cranberry Linzer TartInside two layers of buttery, crumbly walnut crust hides a tart cranberry filling.View RecipeInnovations in applesThis week we got a box of HIDDEN ROSE apples all the way from Oregon, a crazy variety that’s yellow-red ish on the outside, like a leaf in transition, and BRIGHT MAGENTA inside. “I thought you were holding a bloody steak,” said Alex Delany when he saw me chomping into one from across a room. “Or a bloody heart!” someone else morbidly noted. They’re pretty normal apple tasting, like a Fuji, with a hint of lemon and watermelon Sour Patch, though a little mealy inside. They’d had a cross-country trek, after all. “A glamour apple,” quoth Amiel Stanek.ALEX LAUUnnecessary food feud of the weekAt 5:58 p.m. on Tuesday, Molly Baz waltzed down our row of cubicles with a chicken pot pie in one hand, a tub of Vaseline in the other. “That's for lubin’ up your lips because you'll be smackin ‘em so much,” she announced. A debate broke out about whether she should use turnips or carrots in the upcoming Basically recipe—this initial version had turnips. Team carrots wanted them for color, and because it’s a more common ingredient. Team turnips didn’t want the sweetness from carrots, and wanted turnips to get their due. Carla Lalli Music declared, “Turnips? That’s food for rabbits. No one actually likes turnips. They make you gassy.” Chris Morocco told Molly he prefers daikon, which Molly huffed “isn’t even a turnip! That’s a radish!” Alex Delany thinks Basically readers are more likely to cook with carrots than turnips; he shook his head and walked away. Chaey announced, “Turnips aren’t basic,” and then whispered that she still prefers them. Someone said, “Free the ’nip!” I just kept repeating the word “turnip!” intermittently hoping to influence people subliminally. Elyse Inamine noted that turnips helped soak up the pot pie’s creamy goodness better than carrots would. And guess what. TURNIPS WON. “It's not about not liking turnips,” Molly explained, “it’s about whether they belong in pot pie.” And they certainly DO. Thoughts?Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-17", "author": ["Condé Nast", "Alex Beggs"]}