{"id": "78f6e0165d1e83baa25912616d3928da", "url": "https://www.bonappetit.com/story/indigenous-farm-workers-2020-election", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "The Restaurant Industry Needs Indigenous Farmworkers. Yet Their Fate Hangs in the Balance. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseThe Restaurant Industry Needs Indigenous Farmworkers. Yet Their Fate Hangs in the BalanceShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020The Restaurant Industry Needs Indigenous Farmworkers. Yet Their Fate Hangs in the BalanceThe pandemic and the California wildfires have exacerbated the challenges they face, but this November may be even more trying.By Esther TsengNovember 3, 2020FacebookTwitterEmailIllustration by Julia Dufosse FacebookTwitterEmailGray and white flakes of ash from the nearby Glass Fire flutter down as I speak with Gervacio Peña Lopez, the executive director of Movimento Cultural de la Unión Indígena and a Mixteco farmworker. We are wearing masks, sitting six feet across from each other outside the organization’s headquarters in Santa Rosa, CA. Lopez is bemoaning the compounding, paralyzing difficulties that Indigenous farmworkers have had to deal with this year. First, the pandemic and the susceptibility to infection, with living and working in crowded spaces and without access to PPE. Second, a fire season that has become synonymous with the grape harvest season, filling the air with toxic ash and smoke. Third, the election. An overwhelming majority of farmworkers cannot vote because they are undocumented—yet their wages and protections hang in the balance.“Our people take a lot of risks because they need to make money, but there’s more competition. People who lost jobs in other industries are coming to work here. Children [of farmworkers] are coming to work with their parents because there’s no school and the workers can’t afford childcare. Employers are reducing our hours so they don’t have to pay overtime. So, we are afraid to complain,” says Lopez. California grows two-thirds of the country’s fruit and nuts and one-third of its vegetables. It is where the impacts of the pandemic, the fires, and the looming election have befallen society’s most crucial yet vulnerable: our farmworkers.The food supply chain begins with farmworkers; the restaurant and hospitality industries depend on them as much as farmworkers depend on these industries. But restaurant closures have meant that many crops have nowhere to be sold, causing a reduction in farmworkers’ hours and therefore pay, with no assurance that the hours—or the restaurants—will ever return. The Heroes Act, which would allow undocumented restaurant and farmworkers to receive direct aid, was blocked by the Senate. As a result, over 2 million people integral to our national food systems are being left out of the country’s recovery plans. The food industry’s future is at stake this election season, and few are more at risk than farmworkers.As COVID-19 hit America’s shores in the beginning of the year, eventually shutting down all but the most essential services in the country, the government failed to protect the people working the very jobs it classified as essential. When the $2.2 trillion CARES Act was passed in March to sustain the economy during the fallout from the pandemic, it left out benefits for not only the undocumented, which account for between 60 and 75 percent of farmworkers in California, but citizens in families with mixed status. A study by UCLA has shown that this failure has cost America $10 billion in economic activity. The same study also shows that if the Heroes Act were passed, it would produce $14 billion in economic output—far more than the $9.5 billion price tag, and undocumented workers would undoubtedly contribute to that output. However, in the Republican-controlled Senate, support for the undocumented has overwhelmingly been a partisan issue.Farmworkers are classified as essential workers, but the federal government has not treated them as such. The airline industry has received $25 billion in grants and loans. The oil, gas, and petrochemicals industry has received up to $7 billion in forgivable loans and $1.9 billion in tax credits under the CARES Act. Meanwhile, according to the UCLA study, undocumented workers pay $27 billion in taxes and contribute $1 trillion to the GDP. Nearly three out of four farmworkers earn less than $30,000 per year. And though California governor Gavin Newsom had established an undocumented relief fund, one $500 check, it is barely enough to cover a week’s pay as we enter the eighth month of the pandemic. In early October, however, Newsom went further by signing the COVID-19 Farmworker Relief Package for increased farmworker protections, including bilingual educational outreach; tracking and reporting workplace investigations; paid COVID-19-related sick leave and workers compensation benefits; temporary isolated housing for farmworkers infected with COVID-19; more access to testing and PPE for rural communities and an expansion of telehealth services for farmworkers, whom have difficulties accessing medical care. While these protections have been much needed, the package did not provide any additional financial aid.Even before the pandemic, undocumented workers were marginalized and maligned by the Trump administration.The xenophobic rhetoric espoused by our president—going so far as to frame their presence here in America as an “invasion”—have emboldened racist attacks on people of color, and in particular, farmworkers. Ramon Torres, president of Familias Unidas por la Justicia, an independent farmworkers’ union in Burlington, WA, says that there has been a noticeable uptick in hostilities toward farmworkers since Trump’s election in 2016. “In Lynden [Washington], there are a lot of his supporters who live there. [Since that election], it’s become more common for people, even caravans, to drive by and start yelling at us. They’ll yell, ‘We don’t want you here. Go back to your pueblo.’ It’s happened a lot more since we’ve had this president.” When asked if there is a presidential candidate that the organization is supporting, Torres says, “We’ve seen Biden more willing to support immigrants, and if he’s president, there will be more possibilities for us to push for more laws that will protect the workers.”Farmworkers face numerous hurdles when it comes to advocating for support, with language barrier being one of the highest. Though they’re classified as Hispanic or Latino, 30 percent of these workers are actually Indigenous. Few are able to speak fluent Spanish, much less English, making them even more vulnerable to the health hazards of the pandemic as well as exploitation when it comes to wages and working conditions. Language interpretation and translation organizations like Movimento Cultural de la Unión Indígena, which provides translation services for farmworkers who speak Mixteco, Triqui, Chatino, and Mam, are crucial sources of protection, advocacy, and information. These organizations are not only a link to the broader community in which farmworkers live, their linguistic services are instrumental to their civil rights—that they not be discriminated against based on race, color, or national origin. Through interpretation in their native language, they are able to understand what’s at stake in the election, whether it’s local safety measures while they’re on the job, electing representatives that will vote on their behalf in Congress, or a president that will recognize their work as positive contributions to society.But Indigenous farmworkers, in particular, face their own challenges. Lopez says, “The COVID-19 positive rate for Latino farmworkers is at 70 percent, and we are lumped in that, so we don’t know how many Indigenous have become infected.” (Lopez isn't far off in his estimate: Counties across the state report the percentage of Latinos affected by COVID-19 range up to 90 percent of county cases, while statewide, 57 to 59 percent of people testing positive for COVID-19 are Latino.) Movimento Cultural de la Unión Indígena, through their language services, has helped them understand the virus and its complications. In addition, materials by OSHA are translated so they can understand their rights and interpretation of representatives from California Rural Legal Assistance is provided so they have an advocate. Other resources within reach include financial aid through UndocuFund and food through neighborhood food banks and Food Empowerment Project.Movimento Cultural de la Unión Indígena also hosts a hotline where workers can call in and speak to a representative in any of the four aforementioned languages. They have created their own radio program that airs on Tuesdays called Radio Autóctona Indigenista, in which they invite guests onto the show to speak on issues in their Indigenous language to members of their community who might be listening.Unfortunately, Indigenous communities in other areas often lack even support like this. Information is hard to come by, even when it directly affects their health. South of Santa Rosa is Salinas Valley, known as the “Salad Bowl of the World,” where over half of America’s lettuce, broccoli, and celery crops are grown. Triqui farmworker and Greenfield resident Juan Martinez Vasquez, through an interpreter, says he has not heard of any organization that can help him or his family with aid or food. When asked how he found out about the pandemic, Vasquez says, “No one told me. You see it on the news; they tell you how many have died because of COVID-19 and they go over the symptoms. The employers have not mentioned it.”The restaurant industry is notoriously lacking in safety nets for business owners and employees alike, and this reality is especially dire for farmworkers. There’s little incentive to enforce minimal physical protections for farmworkers. Vasquez, in describing what it’s like to work in the field after the fires without a mask, says, “You get a burning sensation in your chest, a burning sensation in your throat and your eyes because of the smoke.” As mandated by Cal/OSHA, employers are supposed to provide masks when AQI (air quality index) is above 150. But many workers have had to depend on outside organizations for them. Armando Elenes, the secretary-treasurer of United Farm Workers, says the UFW has distributed over one million masks to people out in the field—whether to protect against the pandemic or bad air caused by the fires.Farmworkers’ economic prospects are also in danger. Though there has been an increase in issued H-2A immigration visas, the surge is being used to depress the earnings of workers who are already here. Elenes explains that at the end of September, a semi-annual survey that makes H-2A visa farmworkers’ wages comparable with those of domestic workers in the same area was cut by agribusiness mogul and secretary of the USDA, Sonny Perdue, in concert with the Trump administration. Without the survey, wages would be slashed to minimum wage. In Georgia, that would be a reduction from $14.58 to $7.25. Though the UFW has filed a lawsuit against Perdue, a Trump reelection would give this unilateral change a green light, potentially depressing all farmworkers’ already low wages at the federal level.Throughout my interviews, I learned that though farmworkers are the foundation of our food systems, only the Democratic side of the aisle recognizes their “essential” status. Though they pay taxes, including Social Security, they receive none of the benefits—and it’s Republicans who actively deny their contributions to the economy and place in our communities. If Democratic senators are elected this year, the Senate will be flipped, allowing for the passage of the Heroes Act. This would provide not only a second round of payments for some of us, but two rounds—including a retroactive payment—for the undocumented farm and restaurant workers left behind.After an hour has passed, a thin, gauze-like layer has collected on Lopez’s, my, and our interpreter’s laps. As we talked, I realized there is so much more to be done to protect our vulnerable farmworkers. Their safety, representation, and food security are too important to go unmandated and outsourced to nongovernmental organizations, where only a fraction of the Indigenous farmworker community can benefit. It is time to advocate for farmworkers and our restaurants.Here some actionable ways to support farmworkers, especially undocumented and Indigenous ones, now and beyond November:Donate to relief funds that financially support farmworkers, such as the Sonoma County Grape Grower’s Association Farmworker’s Resiliency Fund and UndocuFund.Support Indigenous unions and interpretive groups that provide organizing and language services for Indigenous farmworkers, such as Familias Unidas por la Justicia; Movimiento Cultural de la Unión Indígena; and Centro Binacional para el Desarrollo Indígena Oaxaqueño in Fresno, CA.Research the Farm Workforce Modernization Act, the bipartisan bill that passed the House of Representatives but has stalled in the Senate. It marks a clear path to citizenship for undocumented farmworkers and expands the H-2A temporary work visa program.Research the Frontline At-Risk Manual (FARM) Laborers Protection Act, which would mandate sick leave and increase hourly hazard pay.Research the Heroes (Health and Economic Recovery Omnibus Emergency Solutions) Act, which would supplement aid to the undocumented workers left behind in the CARES Act and include a $120 billion restaurant revitalization fund.Research the Asunción Valdivia Heat Illness and Fatality Prevention Act, which would provide protections not just for farmworkers but across all occupations when faced with extreme heat on the job.Write the Department of Labor to protest against their H-2A program changes, which include further slashing farmworkers’ wages and reducing labor protections.Read MoreElection 2020How to Practically and Specifically Help Restaurants This Election YearBy The Bon Appétit StaffElection 2020Restaurant Workers Need More Than Health Care. They Need Mental Health Support.By Priya KrishnaElection 2020Some Out-of-Work Restaurant Workers Have Found a New Calling: Getting Out the VoteBy Priya KrishnaElection 2020I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeBy Francesca Hong Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-03", "author": ["Condé Nast", "Esther Tseng"]}