{"id": "78fec85d28a939e383e22dc56d55d9f6", "url": "https://www.bonappetit.com/story/street-food-mexico-city-photographers", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "The Best Street Food in Mexico City According to Photographers Dylan + Jeni | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopmexico-cityThe Best Street Food in Mexico City, According to Photographers Who Love Shooting ItDylan Ho and Jeni Afuso give us the lowdown.By Elyse InamineDecember 10, 2018FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailSquint at any photo credit in our magazine (or any other food publications for that matter), and you’ll spot the name DYLAN + JENI again and again. That’s Dylan Ho and Jeni Afuso, the husband-wife team who have become one of the most sought-after food photographers in the industry. And while they’re constantly traveling around the world, shooting new restaurants and bars on assignment, their true passion is photographing street food, from grilled squid along the coast of Japan to vats of cow feet and chickpea stew in Tunisia. One of their favorite cities to hit? Mexico City.“I love street food because it’s the perfect way to experience culture,” Ho tells me over the phone. “It brings the rich and the poor, the young and the old, all together at this one stand serving amazing food.”The duo have been back about a dozen times since their first visit in 2007, and they’re always seeking out different taco stalls, breakfast spots, and pozole vendors with each trip. For them, finding gems throughout CDMX is like a scavenger hunt, a quest that requires some real leg work and clue sleuthing, all for the sake of the next mind-blowing meal. Here, Ho shares some of their favorite discoveries in a city that breathes, lives, and runs on street food.Wake up and smell the fried egg tacos and huaraches.\nPhotos by Dylan + JeniBreakfast Taco Stand at Mercado La Merced“You can put anything in a taco and it'll taste great. Case in point: these fried egg tacos we found at this breakfast taco vendor in Mercado La Merced, which is the largest market in Mexico City. Locals eating at this spot told us to get these breakfast tacos, and we’re glad we took their advice. It was the most comforting way to start our day.”Huaracheria Doña Luz, Desde 1994“We stumbled upon this red tent nestled in the Roma Norte neighborhood by just roaming around the city. The vendor had a small crowd surrounding him, and you could just tell by his deftness in cooking that this was a good stall. He specializes in huarache, which is an oval-shaped ‘sandal’ of masa griddled until crisp and topped with smashed refried beans, cotija, salsa, and your choice of meat (we went with chorizo). I love this dish because of all the different flavors you get in just one bite, but what makes this particular huarache special is the perfect texture, not the least bit dry.”If you see goat taquitos in the morning, get on that.\nPhotos by Dylan + JeniTaquito Vendor at Mercado de Xochimilco“We’re always hitting up the mercados by 7:30 or 8 a.m., when it has the most food options, from soups and tacos to flautas and taquitos. That’s because you’ll find more locals at this hour, filling up with heavy breakfasts as they prepare to work long shifts. After wandering through the produce stands at the Mercado de Xochimilco in Santa Crucita, we found these unbelievable goat taquitos, which are unusual to see during breakfast hours. The meat was so tender and folded into the crispest tortilla. Delicious.”Agua frescas—and lots of it.\nPhoto by Dylan + JeniJuice Stall at Mercado La Merced“Something we learned from the locals at Mercado La Merced: Drink lots of agua frescas. They’re practically ubiquitous throughout the city: You’ll find them in markets, along street corners—you can’t miss them. Here at this market stall, we saw mamey, guava, papaya, pineapple, watermelon, and dozens more, which locals drink not just for flavor but also for digestion. We prefer these over soda, particularly this stall's juices because it's so fresh (juiced on the spot!).”The toppings are key to these flautas.\nPhotos by Dylan + JeniFlautas Lupita at Mercado San Juan“Even though it’s fried, these flautas de pollo are pretty light antojitos (a.k.a. Mexican snacks), meaning it’s too easy to eat a lot of them. The shredded cabbage adds something fresh, the guacamole gives some body, and the cotija cheese lends some salt, making for the most delightful snack as you explore this market in the Cuahutémoc borough.”Make sure you make room for the titans of Mexican street food: tacos.\nPhotos by Dylan + JeniTacos al Pastor Stand in Cuahutémoc“You know you’re at a good tacos al pastor stand just by watching the taquero. A skilled taquero never lets the meat touch the griddle below and knows how to flick a slice of roasted pineapple on top of the taco. We found this stand after drinking some mezcal at local favorite Bósforo-Mezcaleria, also in the Cuahutémoc area. It has a giant orange spit, so keep an eye out for it. They serve the most beautifully spiced pork with the sweet pineapple, which makes for the most balanced bite.”Tacos Dorados at Mercado La Merced“As we were scoping out this mercado, a vessel holding tons of tacos dorados caught our attention. I mean, who can resist a fried taco shell? Even better: They were filled with creamy potatoes, and tasted just as good as they look.”Start planning your next trip to Mexico City now.Explore Bon AppétitMexico CityCity GuidesRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Elyse Inamine"]}