{"id": "7913d6d5a502d47727abd8d29409d38c", "url": "https://www.bonappetit.com/story/douchi", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Chinese Fermented Black Beans - How to Cook With Douchi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingUmami, Salty, and Rich, Douchi Does It AllWhen a dish needs a wake up call, I reach for fermented black soybeans.By Clarissa WeiOctober 19, 2020FacebookTwitterEmailPhoto and Food Styling by Clarissa Wei FacebookTwitterEmailOne of the simplest ways to supercharge a dish is with the fermented black soybeans known in Mandarin Chinese as douchi. Douchi are soybeans that have been inoculated with a mold, salted, and then left to wrinkle and cure. In the ’70s, archaeologists found douchi sealed inside a Chinese tomb from 165 BCE, making the condiment the oldest known soy product in the world.Today it’s a timeless addition to pan-Asian dishes around the world. In dim sum restaurants small chunks of pork spareribs are steamed with black beans. In the average Chinese household, douchi is spooned over fish that’s then gently steamed with a bit of ginger and garlic. In American-Chinese eateries, it’s stir-fried with chicken and bell peppers. And in Taiwanese and Hong Kong beer shacks by the sea, they’re tossed into a hot wok of fresh clams, some wine, and a bit of chile peppers.Think of douchi sort of like salty Chinese capers, but with the funkiness and complexity of a deeply aged cheese. Time breaks down the protein in the bean, which combines with the sodium in salt to form monosodium glutamate. MSG (there’s nothing to be afraid of!) is the building block of umami, the same savory sensation found in soy sauce, Parmesan cheese, and mushrooms. Douchi is a natural source and a marvelous shelf-stable addendum to any pantry.The rule of thumb is 2 Tbsp. douchi for 1 pound of food. The consensus on whether or not to wash the douchi before cooking it varies. Some people are convinced that rinsing them off in a colander is a more hygienic approach and that it tones down the saltiness. Others say the high heat will kill any germs and that the extra saltiness is beneficial. I subscribe to the latter philosophy, though I would never eat uncooked douchi. Heat is essential and coaxes out the beans’ full potential.How you work with douchi depends on your dish. For simple stir-fries, heat 2 Tbsp. vegetable oil in a wok over high heat and add your aromatics (finely chopped ginger, garlic, or some fresh chile) with 2 Tbsp. douchi. Sauté until fragrant, then add 1 lb. protein. Chicken and clams are the proteins most classically paired with douchi, but feel free to use other ingredients like beef, pork, shrimp, or tofu. Cook the protein until it takes on a bit of color, then pour in 4 Tbsp. liquid seasoning. For me, I like to use 2 Tbsp. soy sauce and 2 Tbsp. Shaoxing wine for chicken. For clams, I prefer 1 Tbsp. soy sauce and 3 Tbsp. Shaoxing wine. Turn the heat to medium-low and cook until the meat is finished and the sauce is reduced. At this point, you can add in a bit of sliced bell pepper for color or garnish with scallions or cilantro.A good rule of thumb is 2 Tbsp. douchi for 1 lb. protein.\nPhoto and Food Styling by Clarissa Wei Steaming is a different process altogether, but the philosophy is the same: Combine aromatics with douchi to form the foundation of the dish. But instead of heating everything up in a wok, add the douchi on top of the meat right before steaming.For steamed fish, Chinese cuisine normally dictates that a whole freshly slaughtered fish is best. This is especially important for family gatherings like the Chinese New Year, because a whole fish symbolizes unity within the family. A whole fish is also traditionally indicative of freshness as if it were caught and butchered that morning. Although modern supply chains have rendered this obsolete, it is still a strong cultural preference that’s relevant all across the greater China area. I’m not a stickler for tradition though, and my husband and I like it deboned and filleted already because we’re lazy eaters. Start with 1 lb. fish. Soft, white-fleshed fish is best; I personally like tilapia, sea bass, or halibut. Pat the fish dry and put it on top of a plate safe for steaming. Season with thin slices of ginger, some finely chopped garlic, and 2 Tbsp. douchi. Steam the fish on high heat for 10 minutes. When done, take it off the heat. Mix together 4 Tbsp. light soy sauce and 1 Tbsp. sugar and pour that sauce over the fish. Garnish with finely chopped scallions and more ginger. Finish off with a drizzle of searing hot canola oil, which gives the dish a nice finishing sheen. Douchi can also be steamed with pork ribs, but you’ll want to marinate the pork ribs first with seasoning and cornstarch for at least an hour. Sprinkle on the douchi right before steaming and then cook for 10 to 15 minutes.The natural saltiness of douchi is also great for neutralizing bitter flavors. Chefs I’ve met in China have informed me that bitterness can be softened with salt; in Chinese cooking philosophy, the opposite of bitter is not sweet—it’s salty. Bitter melon is by far the best vegetable to showcase this trick. Known for its intense astringency, bitter melon can be quite difficult to mellow out, but here’s a method how: Halve the melon, seed it, and cut lengthwise into pieces. Coat the pieces in salt and let them sit for at least 15 minutes. Next, blanch the melon and then drop it in an ice bath to prevent overcooking. Finally, drain, pat dry, and quickly stir-fry for less than a minute in a hot and seasoned wok with finely chopped garlic and douchi. As always, finishing with a dash of soy sauce and cooking wine is good for sealing in the flavors.In short douchi can be incorporated into a variety of dishes and can be used as an alternative to plain old salt. It’s also a reliable source of umami, heightened through the power of fermentation and time. It’s no wonder that it has been a pantry staple for more than 2,000 years.Clarissa Wei is an American freelance journalist and video producer based in Taiwan.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-19", "author": ["Condé Nast", "Clarissa Wei"]}