{"id": "79167030d18a14744f5b4897d529bf8a", "url": "https://www.bonappetit.com/story/dahi-toast", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Meet Dahi Toast, the Indian-ish Grilled Cheese That’s Even Better Than Grilled Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Indian-ish Grilled Cheese That’s Even Better Than Grilled CheeseI know that’s a strong statement, and I stand by it.By Priya KrishnaOctober 11, 2018FacebookTwitterEmailFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Like any American family, the Krishnas take weekend breakfast very seriously. When I was a kid, it was not uncommon for us to sit down on Saturday mornings to a spread of chocolate chip pancakes, or toast with Heinz baked beans spiked with chaat masala and tomatoes, or sabudana (a.k.a. savory, peanut-lime tapioca pearls). But when we had family or friends in town, my mom upped the breakfast ante. Visiting guests meant we’d get to eat dahi toast.“Dahi” means yogurt in Hindi, and “toast” is the word my family and many other Indians use to describe cooked sandwiches, so the dish roughly translates to “yogurt sandwich.” But that sounds like the biggest undersell of one of the many favorite foods in the world.Think of dahi toast like a fancier, more interesting grilled cheese. But not in the sense of, like, a truffled grilled cheese (who actually asked for that?) or a grilled cheese that involves, like, six kinds of expensive Gouda. The main event with dahi toast is the yogurt (Greek or strained yogurt, regular will be too runny) mixed with half an onion (finely diced), a minced chile (we use harimirch but a serrano or Thai chile also works), and a handful of finely chopped cilantro. That’s slathered between two pieces of sourdough bread and griddled with a little oil on medium heat until the outsides are golden and the yogurt turns thick and ricotta-like (no cheese pull here, folks). Top it off with a drizzle of crunchy mustard seeds and curry leaves tempered in oil to get the crispy coating that mayo gives a grilled cheese. It’s spicy, it’s tangy, it’s got lots of great textures, and actually, comparing it to a grilled cheese sandwich (which, don’t get me wrong, I love!) doesn’t actually do it justice. Sinking my teeth into the crusty, oiled-up bread with the thick, onion-flecked yogurt makes me feel things.Curry leaves and mustard seeds tempered in oil, aka tadka.\nPerhaps you’re wondering: where did this notion of putting YOGURT, of all things, between bread come from? My mom first tried a variation of this dish at a friend’s house, where it was the go-to weekend breakfast. Both my parents loved the dahi toast so much that my mom immediately had to recreate it at home.What sets mom’s version apart from her friend’s (and other versions I’ve seen on food blogs) is the inspired decision to use sourdough bread, which she discovered it on a California trip in the ’80s and forever changed the course of our bread consumption. The pleasant tang of sourdough (thick slices are key) is the perfect partner to the heat of the green chilies and the richness of the yogurt and spices. Don’t make this with anything else.The only controversial aspect of dahi toast in our family is the condiments. My dad and I firmly believe that Heinz ketchup, in all its tart, sweet, glossy glory, is the proper pairing. My mom and my sister on the other hand, will dip their dahi toasts in cilantro chutney—they want that extra boost of herbs and heat. A few years ago, my dad discovered the condiment compromise that is Heinz ketchup swirled into cilantro chutney, and I’m certainly not mad about that, either (though the dirt-like color isn’t great).See what I mean about the ketchup/chutney combo.\nDahi toast is no longer just a breakfast dish in our family. It has spilled over into lunchtime, dinnertime, snack time, party time (cut your dahi toast into mini triangles!) and everything in between. At my apartment, the dish is my entertaining magic trick. It looks and tastes so complex, but doesn’t really require a recipe. Best of all, it ultimately takes the effort of, well, making a grilled cheese to produce. But it tastes ten times better.Explore Bon AppétitIndianishToastYogurtRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Priya Krishna"]}