{"id": "791e325f1312729b17ecda200efc1df4", "url": "https://www.bonappetit.com/story/jessamyn-stanley-morning", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Jessamyn Stanley Starts Her Morning With Yoga and Kendrick Lamar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJessamyn Stanley Starts Her Morning With Yoga and Kendrick LamarThe body positivity advocate and yoga instructor on social media, supplements, and trying to get to inbox zero.By Victoria BouloubasisMarch 12, 2018FacebookTwitterEmailPhoto by Justin CookFacebookTwitterEmailJessamyn Stanley is not awake at 6 a.m. pretzeled into a yoga pose.She is up by eight, answering emails. Just a few, to get them out of the way.“I get about one hundred emails a day now,” says the yoga teacher, body positivity advocate, and writer. “My inbox is frightening at times.”In 2014, before she started popping up on your Instagram feed in fly Ivy Park athleisure and targeted Kotex ads, Stanley was a hostess at a tapas restaurant in downtown Durham, NC and taught yoga classes for restaurant workers looking to relieve their over-worked bodies. Her irreverent yoga tutorials on YouTube and Instagram have since garnered hundreds of thousands of followers. As a plus-sized, queer woman of color, she's captured the attention of a world that looks overwhelmingly different than her.When she’s tamed her inbox, usually around 9 a.m., Stanley heads to her yoga room, a small bedroom painted a soothing shade of purple and empty except for her mat, a couple plants doused by soft sunlight, and usually a cat (she has three). “They’re all very distinguished. They wear bowties!” she says. She doesn’t eat anything before she practices; she drinks cold water with lemon from a blue, 24-ounce glass Ball jar. A yoga swing made of sturdy parachute material is bolted to the doorway. The swing is good for hanging upside down and loosening vertebrae, she says. “These are sensations all humans should feel regularly, allowing your blood to flow in reverse. The whole world is different.”This morning yoga session lasts at least two hours, sometimes not wrapping until almost noon. She incorporates a lot of music: Kendrick Lamar for the lyrics (“He says a lot of things that light me up inside.”); Fiona Apple to soothe a slippery mood. With so much traveling away from her home in Durham these days—from Bali to Dubai to lectures around the country—Stanley relishes in her home practice but always packs a yoga mat for hotel sessions. “My mat is like my toothbrush. I don’t use other people’s!” she says.Some days, after practicing yoga, she drives up the road to her favorite coffee shop, Cocoa Cinnamon, for a latte. (“I spend all my money on coffee.”) Other days she makes tea at home. Tazo passion is a favorite—a blend of rose hips, hibiscus and passion fruit, or anything with turmeric. “I particularly appreciate its anti-inflammatory properties and how they make my joints feel,” she says.Stanley takes daily vitamin packs from care/of, a company that puts together customized supplements. “I take vitamins because I’m not getting any younger and I want to preserve my vitality as much as possible,” she says. Her pack includes what she says helps maintain her internal balance: astaxanthin (a potent antioxidant), fish oil, a probiotic blend, garlic, zinc, turmeric, and B-complex.Most mornings, she opts for protein-rich breakfasts: egg whites with hummus on toast, greens to the side, carrot juice to sip. Her diet is heavily influenced by how she was raised, in a small town near the South Carolina border, to parents that loved food and music. “All the women in my family are celebrated cooks. Food is a huge part of how we communicate with one another,” she says. Her family also practiced Baha’i, a religion with roots in Persia (modern-day Iran). “So I spent a lot of time with Iranian grandmas, making basmati rice, understanding dill and saffron,” she says.Lately, Stanley is exploring the roots of veganism in black and indigenous cultures. “Because the concept of veganism has been so colonized and gentrified, people only see it one way,” she says. “They don’t necessarily understand it’s just a way that many people have always eaten.” Stanley isn’t vegan or vegetarian, but both food traditions and nutrition intrigue her.  “I’m interested in vegan eating because my body has a hard time processing dairy products and meat,” she admits, “despite the fact that I’m a deeply bred Southerner with a long-fed love of mac and cheese and fried chicken.” She’s been exploring vegan soul food through her friend Lauren Von Der Pool’s book Eat Yourself Sexy.After breakfast, she’ll head to The Mothership, a female-led community working space, to finish emails, write, and plan her podcast. (When she visits New York, she works out of The Wing, a women’s co-working space that she says reminds her of a place where Harriet the Spy would hang out.) Stanley often gets asked if she’ll move to Los Angeles or New York. But she’s rooted in Durham, Southern born and bred. “I’m happy here, so what’s the point of [living] anywhere else?”Despite her many followers and partnerships with brands like Target and Samsung, fame hasn't fazed Stanley. “I don’t get caught up in notoriety. I know that it’s fleeting.” This unapologetic attitude has become her brand; it’s what draws people in. The first episode of Stanley’s new podcast, “Jessamyn Explains It All,” comes with a frank disclaimer: “Parts of the show might be offensive. They might be offensive to you. It might get real in a way that makes you feel uncomfortable. But. Now you know.” That last bit she delivers crisp, like she’s saying it with a coy smile.Explore Bon AppétitHealthyishprofileRead MorecultureMeet the Equinox Trainer Who Made Us Love the GymBy Sue Li and Alex PollackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Victoria Bouloubasis", "Alex Pollack"]}