{"id": "7932d8ebf4defff10077415a9f3d82cc", "url": "https://www.bonappetit.com/recipe/country-ham-potlikker", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Country Ham Potlikker Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueCountry Ham PotlikkerBy Carla HallFebruary 8, 20223.8(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintPotlikker (or “pot liquor”) is the brothy, nutrient-dense liquid gold traditionally left behind after boiling greens and beans. An ingredient whose use sheds light on the complex racialized history of Southern cooking, potlikker was once valued only by diligent enslaved Africans who saved the nourishing broth for their families after cooking greens. Chef Carla Hall, for whom potlikker was an essential element of her childhood, switches up the order, making potlikker from scratch to use as an ultra-concentrated broth—for Hall, that’s often the first step in imbuing a dish with layers of meaty flavor. Here she makes potlikker with dry-cured country ham. If you can’t find country ham, smoked ham hocks will bring similar intensity.Use this potlikker as a base for Hall’s Bean and Vegetable Salad With Potlikker Vinaigrette, her Smothered Pork Chops in Potlikker Gravy, or any dish that would benefit from a rich, meaty broth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan$60 At AmazonMesh Sieve$13 At AmazonLarge Basting Spoon$16.37 At AmazonTongs$13 At AmazonGlass Storage Container$16 At AmazonIngredientsMakes about 2½ cups11½-oz. piece country ham or one 12-oz. smoked ham hock2garlic cloves, finely chopped¾tsp. crushed red pepper flakes½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltPreparationStep 1Bring ham, garlic, red pepper flakes, salt, and 1 quart water to a boil in a large saucepan. Reduce heat and simmer, skimming foam from surface as needed, 1 hour.Step 2Strain through a fine-mesh sieve into a medium heatproof bowl. Pick out ham and reserve for another use; discard remaining solids.Do Ahead: Potlikker can be made 5 days ahead. Let cool. Transfer to an airtight container and chill, or freeze up to 3 months.How would you rate Country Ham Potlikker?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHave never made potlikker but it has inspired me to do so, will use smoked ham hockGillianCanada 3/7/2022Recipes are fine, but a new technique that can be applied elsewhere - now that's useful information!Tom H.Raleigh, NC2/15/2022Explore Bon Appétit5 Ingredients or FewerStockGluten-FreeNut-FreeDairy-FreeSouthernAmericanSoul FoodHamMeatRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}