{"id": "79439021d10c8fb4a26d4ddab22c8de3", "url": "https://www.bonappetit.com/recipe/corn-salsa", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Corn Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCorn SalsaBy Claire SaffitzAugust 21, 20185.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintWhether it’s scooped up with tortilla chips or spooned over a simple fillet of fish, this zippy charred corn salsa is the ultimate peak-August condiment.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketCast Iron Skillet$30 At AmazonTongs$13 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonPotato Masher$10.19 At AmazonWooden Spoon$6 At AmazonSmall Bowl$13 At AmazonPlatter$29 At AmazonIngredientsMakes about 2 cups2medium ears of corn1medium poblano chile1medium jalapeño or Fresno chile½small red onion½tsp. kosher salt, plus more1large ripe beefsteak tomato¼bunch cilantro1limeTortilla chips (for serving)PreparationStep 1Remove husks and silk from 2 ears of corn. Cook corn and 1 poblano chile in a dry medium cast-iron skillet over high heat, turning occasionally, until corn is charred in spots and chile is blistered all over, 10–14 minutes.Step 2Transfer corn and chile to a cutting board and let cool for a minute or two. Lay corn flat and slice along one side to shave off kernels. Repeat, rotating cob, until all kernels have been cut off. Discard cobs. Transfer corn to a medium bowl.Step 3Crush corn with a potato masher or wooden spoon to help release starch and juices, which will help to thicken the salsa slightly. (Also a good way to get out a little aggression.)Step 4Cut around poblano chile stem to remove, then slice into flesh lengthwise to open up chile like a book. Scrape out seeds and ribs, flip over, then use the dull edge of your knife to scrape off charred skin and discard.Step 5Coarsely chop chile and add to bowl with corn.Step 6Do a little bit more knife work: Cut stem end off of 1 jalapeño, then halve lengthwise. Pull out ribs and seeds, then finely chop flesh. Add to bowl with corn.Step 7Finely chop ½ red onion and add to bowl as well. Season with ½ tsp. salt and give it all a good mix with a large spoon.Step 8Core 1 tomato, then cut in half through its equator. Squeeze tomato halves over a bowl or trash to push out seeds and watery parts and discard. Chop tomato flesh and gently fold into salsa.Step 9Pick ¼ cup cilantro leaves from stems. Very finely chop leftover stems and fold into salsa along with leaves.Step 10Cut 1 lime in half and squeeze with your hands into a small bowl. Measure out 2 Tbsp. and add to corn mixture. Taste and season with more salt. Mix one more time to combine.Step 11Arrange tortilla chips on a platter. Serve corn salsa alongside.Step 12Do Ahead: Corn salsa, without cilantro, can be made 1 day ahead. Cover and chill. Stir in herbs right before serving.How would you rate Corn Salsa?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis recipe is a keeper 5 stars!\nServed as part of an appetizer before the main.\nAll of it was gone!\nNo leftovers! Darn!USTSERVHouston, Texas8/31/2018Really Good! I added more tomato for personal taste. Served with tacos AnonymousNebraska 8/30/2018This is a delicious salsa that has become a vegetable serving at dinner.  Our friends love it also.Deborah Yao8/24/2018Explore Bon AppétitCondimentMexicanLatin AmericanCornVegetablePoblano ChileChileTomatoCilantroHerbs & SpicesJalapeñoSummerSideDairy-FreeNut-FreeVeganVegetarianGluten-FreeFourth Of JulyMemorial DayLabor DayBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Claire Saffitz"]}