{"id": "7947387d56b18b729aa524162bc450ff", "url": "https://www.bonappetit.com/story/tiny-pot", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "This Small Saucepan Is Ideal for Cooking for One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersshoppingA Tiny Pot That Every Solo Cook Should OwnAll the best things I cook for myself come out of this saucepan.By Christina ChaeyApril 3, 2020FacebookTwitterEmailPhoto courtesy of CalphalonFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. This one is part of the Healthyish Guide to Being Alone, a month-long series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.The world is always yelling at us to make BIG BATCHES of things—even if you're cooking for one most of the time. But if, like me, you can’t stand eating the same thing two days in a row (unless it’s refried beans, I’m not interested!), you're probably cooking in smaller quantities. Whenever I want a me-sized amount of dal, deep-fried tempura, or a big cozy mug of hot chai, I reach for my favorite piece of cookware in my entire kitchen: my Calphalon Tri-Ply 1.5-quart saucepan with glass lid. (Yes, the lid is critical for making rice, one of its most frequent jobs).Note that I said “my favorite” and not “the most important.” That’s because, if I’m being honest, I just bought this pot like, two months ago. Which means that for 31 years and 2 months of my life, I did just fine without a tiny pot in my cookware arsenal.But like the first time I made pour-over coffee with a gooseneck kettle, or strained the gunk out of my homemade stocks with a fine-mesh strainer, using this tiny pot has made almost all my solo cooking endeavors so much...better. Easier. More logical. I no longer end up with make awkwardly small servings in too-big pots—this one is meant to feed just me. It’s made of the heavy-gauge stuff (three layers of stainless steel and no fewer, thanks) that’s meant to last a lifetime—which is exactly how long I plan on keeping it around, whether I'm solo or not.Buy it: Calphalon Tri-Ply Stainless Steel 1.5 qt. Saucepan with Lid, $90All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItHealthyish Guide to Being AloneShoppingRead MoreLifestyleThe Healthyish Guide to Being AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-03", "author": ["Condé Nast", "Christina Chaey"]}