{"id": "794f64a27f90447c94a3b52aa88e523c", "url": "https://www.bonappetit.com/recipe/watermelon-with-lime-dressing-and-peanuts", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Watermelon with Lime Dressing and Peanuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueWatermelon with Lime Dressing and PeanutsJuly 10, 20183.6(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintSometimes the easiest way to upgrade an old-school and often disappointing dish—such as fruit salad—is to change the way it looks. That means swapping retro cantaloupe cubes and honeydew balls for a melon with a modern cut. The jagged, irregular chunks of fruit in this recipe make it clear that something unexpected is about to happen.Ingredients4 Servings½6-lb. baby seedless watermelon2Tbsp. fresh lime juice1Tbsp. fish sauce1½tsp. sugar2sprigs basil, plus leaves for serving¼cup salted, dry-roasted peanuts2Tbsp. extra-virgin olive oilFlaky sea saltPreparationStep 1Slice off both ends of the watermelon, then stand it upright on a flat side. Cut away rind in long curving strokes.Alex LauStep 2Halve melon crosswise. Working with one half at a time with the cut side facing up, slice off irregular bite-size pieces. Continue making your way around the melon, turning it as you work (standing it on the round side makes it easier to maneuver).Step 3Stir lime juice, fish sauce, sugar, and 1 Tbsp. water in a large bowl until sugar is dissolved. Lightly crush 2 basil sprigs by scrunching up in your hand and add to dressing along with watermelon; toss gently until coated.Step 4Transfer watermelon salad to a platter, leaving basil sprigs behind. Top with peanuts and basil leaves, drizzle with oil, and season with salt.How would you rate Watermelon with Lime Dressing and Peanuts?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI have not made this recipe but have made something similar. The recipe I make calls for soy sauce instead of fish sauce, which I abhor.  I would recommend trying that if you don’t like fish sauce.  Mint also works nicely in place of basil.mspringGeorgia6/9/2019The fish sauce was off putting, definitely would not make again. However, I did the same without the fish sauce and it was significantly better. Also, I would recommend to change the recipe to say chiffonade the basil before putting it on the watermelon at the end.AnonymousBoston, MA8/23/2018Amazing idea for dull a watermelon. Really delicious, a great plate for any summer BBQ too. Went down a treat! AoifeMcBath, England8/7/2018Gotta disagree with the previous reviewer, I think this is a delicious and innovative twist on watermelon. This is obviously very inspired by Thai cuisine with the basil, peanuts, lime, and fish sauce, but the watermelon itself is still the dominant flavor.  I even prepared this for a family gathering in the deep south where watermelon is a classic that is not to be messed with, and the reception was quite positive.AnonymousSeattle, WA8/7/2018Honestly Horrid, who would do this to watermelon. I followed the recipe completely, GIANT let downsamuel.e.newton9459Detroit8/7/2018Explore Bon AppétitSaladWatermelonMelonFruitLimeCitrusBasilHerbs & SpicesSummerQuickEasySideDairy-FreeGluten-FreeHealthyishFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast"]}