{"id": "796b023e87433cca5758005a1825dc85", "url": "https://www.bonappetit.com/story/our-place-cutting-board", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Love Fresh Fruit? Hate Being Sticky? You Need the Our Place Walnut Cutting Board | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLove Fresh Fruit? Hate Being Sticky? You Need This Cutting BoardIt’s got a JUICE TRENCH.By Ali FrancisAugust 12, 2021FacebookTwitterEmailPhoto by David Kitz/courtesy Our PlaceFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I live for summer fruits; their dizzying sweetness, lush juices, melt-in-your-mouth ripe flesh. But nothing kills my seasonal fructose buzz faster than breaking down a five-pound watermelon. After a series of clumsy hacks, my counters and I end up stickier than a piece of bubblegum on hot asphalt. But not this year, my friends (*laughs maniacally while holding a cleaver*). The ingenious design behind Our Place’s new Walnut Cutting Board is keeping me and my kitchen juice-free.Unlike regular, flat cutting boards, one side of this handsome board slopes down into a little juice trench that’s been carved into the wood. Presumably you know how gravity works, so I won’t belabor the point: As you slice the fruit, any liquid that’s released trickles down the board and wells in the trench, which can hold over ⅔ of a cup. (The whole thing reminds me of a Slip ‘N Slide with a kiddie pool at the end. Only the pool is full of juice and the children are watermelon seeds.) When I’m done prepping, I drain the juice—setting it aside for a salted watermelon margarita— wipe off the board, and flip it over to the flat side. At a sprawling 12” x 17”, it doubles as an ideal charcuterie platter for serving my fresh fruit spread with some hunks of cheese and requisite prosciutto coils.Photo by David Kitz/courtesy Our PlaceOur Place Walnut Cutting Board$95 at Our PlaceLet it be known that this cutting board weighs around 5.6 lbs, which is about the same as my friend Cat’s grumpy Himalayan, or twenty-something sticks of butter. The takeaway here is that good things, in this case American black walnut wood, are hefty! As Test Kitchen director Chris Morocco once explained, wooden cutting boards (unlike plastic, which we reserve for raw meat prep) are great for repetitive tasks like chopping fruit, because the material is softer and easier on your knives. “Wood has a lot of give, so your knife edge can sink into it with minimal dulling, and the cuts ‘heal’ after your knife passes through,” he said. Also, 5.6 lbs of wood won't go sliding around on you while you’re wielding the aforementioned cleaver.However, in my experience, a wooden board is a little finickier to care for. After the first use, my new walnut cutting board was sort of fuzzy, like a giant kiwi fruit. Our Place founder Shiza Shahid assured me this was normal, and that the grains would settle in time and with proper care. Speaking of: after use, you’ll need to hand wash the board with a non-abrasive sponge before towel- and then air-drying it. If it’s fuzzy, like mine was, or when it feels dry, treat it with a food-grade mineral oil to prevent cracking and enhance the patina (a kind of gloss or soft sheen that comes with age). Our Place plans to release their own mineral oil soon; our team loves this Boos Block Mystery Oil.John Boos Mystery Butcher Block Oil$14 at AmazonLately I’ve been using my Walnut Cutting Board to deploy hunks of watermelon for this zippy, umami-packed summer salad; dainty slices of kiwi for these Japanese Fruit Sandwiches; and fat papaya wedges to douse with lime juice. I simply can’t get enough! What I can get enough of, though, is being covered in juice. Oh, look at that, we’re back to the original point: If you love summer fruits but you’re sick of the stick, buy this board.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-12", "author": ["Condé Nast", "Ali Francis"]}