{"id": "7976c70c27ea3fe82a452b34d4bb61d8", "url": "https://www.bonappetit.com/story/best-juicer", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "The Best Juicer (2022) Is Quiet, Powerful, and Will Outlive Any Fad Diet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Juicer Is Quiet, Powerful, and Will Outlive Any Fad DietNever pay $9 for a green juice again.By Lauren JosephMarch 17, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Recently, I put myself through a financial audit, which revealed some weak spots—including a $9-a-pop fresh juice habit. So I began the hunt for the best juicer on the market, thinking that even with primo organic produce, I could halve, if not quarter, the cost of each juice by making it at home.  I love greens, but I also love the idea of saving for retirement.This might have all been an elaborate mind game I played with myself to justify purchasing an electric juicer, because this baby (and when I say baby I am referring to the sweet angel that is the Omega NC900HDC) doesn’t come cheap. Its price is up there with investment kitchen appliances like your KitchenAid stand mixer and Cuisinart food processor. Let me say first: If you very rarely drink juice, no amount of financial wellness gymnastics is going to make this a smart purchase. But if you’re prone to swilling a weekly kale-cucumber and that sets you back $9 or so, the juicer will pay for itself in a year. And after that year? The two of you will be happy for decades(!) to come, thanks to the 15-year warranty on this machine (the longest in the juicing industry).Omega NC900HDC Juicer$460 at AmazonI understand if the idea of juicing brings to mind the elitist fad diets of the early 2000s, but juice is for everyone and can be enjoyed without deprivation—for wellness purposes, sure, but also just because it’s damn delicious. As my wise friend, wellness expert and founder of the Ocho System Joe Holder said on Instagram recently, “Juicing is a wildly polarizing choice likely because it was one of the first exploited trends of the ‘wellness revolution’ for economic gain💰💰.” Despite those negative connotations, Joe is very much still into juice—scroll on down for two of his favorite recipes. “I juice at home ’cause it’s an easy way to stay hydrated,” says Joe, who also touts the quick intake of vitamins and minerals from juicing. (He also stresses the value of fiber: “This is why you should still eat whole fruits and veggies” in addition to juice, he tells me.) Joe has a literal MasterClass on wellness, so I’m happy to follow his lead.What are the different types of juicers?There are two main kinds of juicer machines—masticating (also known as slow juicers or cold-press juicers) and centrifugal. Slow masticating machines have a methodical auger (sort of like a large, sharp corkscrew) that is best suited to working its way through leafy greens, but will take on fibrous stalks and soft and juicy fruit as well. Hard-core juicers love masticating machines because they don’t heat up the produce in the process (possibly causing oxidation) and because they produce very little foam. Also, these mighty machines can somehow squeeze a pale green elixir from even the most papery kale leaves. “You get a lot of juice from this type [of juicer], which leads to less waste and cost over time—even if masticating juicers are more expensive up front,” Holder says. Slow masticating juicers are also soooooothing, humming along at low speed like a patient countertop grazing animal. They’re not silent, but they sure beat the lawn mower-like noise of some centrifugal juicers.But besides that noisiness, centrifugal juicers do have their appeal. They’re often less expensive, for one. Centrifugal juicers tear produce to shreds and then push the pulp through a stainless-steel mesh strainer. It’s a more efficient process, leading to a faster morning green juice. They also tend to be easier to use, smaller, and have dishwasher-safe parts. And if you’re looking for the best citrus juicer? Right this way.Which Citrus Juicer Is the Best Citrus Juicer for You?The best lemon squeezers for control freaks, luddites, and Jimmy BuffetsView StorySo why is the Omega NC900HDC Premium Juicer the best juicer?This slow masticating juicer is easy to use with a 2.5\" feed chute that is wider than others—which means you can cut down on pre-pulverizing prep time. The five grind-size settings on the end cap will easily take you from soft fruit (setting 1) to wheatgrass (setting 5). “I’ve had this Omega model for 6 years and use it almost daily,” says Daphne Javitch, health coach and mastermind of @doingwell. “It’s durable, versatile (we also make banana ice cream with it), and, most importantly, I find it easy to clean,” she says. “It’s a worthwhile investment that endures—I call it the Manolo Blahnik of slow juicers.” In addition to cold-pressed juice, this Omega model can turn out nut butters and nut milks, baby food and other purées, and sorbet.Omega NC900HDC Juicer$460 at AmazonBut what if I just want fruit juice?All that being said, if you’re more after hard produce like apples and carrots and aren’t worried about oxidation or foam, a centrifugal machine is the ideal machine. For you, fruit juice friend, the Breville Juice Fountain Plus is the best centrifugal juicer. This high-speed machine is incredibly well built and simple to use, and the 3\"-wide mouth feed tube means that even for an already speedy centrifugal juicer, you’ll be whizzing along, as you probably won’t even need to chop your produce. Included with the machine are a juice jug, which comes with a froth separator to help skim off that foam, and a cleaning brush.Breville JE98XL Juice Fountain Plus$160 at Amazon$180 at Bed Bath & BeyondAnd if I want to spend under $100 on a juicer?I would go for the Hamilton Beach Big Mouth juicer, a centrifugal machine whose main selling point is right in the product name. The wide feed chute can fit a whole apple, peeled citrus fruits, or an entire beet. At $70, it costs considerably less than the other two—expect a less sturdy construction and a limited 3-year warranty.Still, this fairly streamlined (7.8\" x 11.5\" x 14.4\") machine won’t hog your counter space, is easy to assemble, dishwasher-safe, and makes a mean glass of juice (particularly the fruity kind).Hamilton Beach Big Mouth Juicer$70 at Amazon$70 at TargetLooking for some recipes for your new juicer? Here are some of Joe Holder’s favorite combos:Green Juice4–6 stalks celery½ cucumber⅓ apple1 knob ginger½ lemonHandful of kaleHydration1 cup or so watermelon with rind1 lime½ cucumberGet Juicing:Better Than Celery JuiceCelery juice—all the rage! But still kind of a hard sell. This one gets help from apple, parsley, a dusting of black pepper. View RecipeExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-17", "author": ["Condé Nast", "Lauren Joseph"]}