{"id": "798c56dda9b5f9c32eb6fd5be26c7f7f", "url": "https://www.bonappetit.com/story/how-to-build-a-one-skillet-meal", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "How to Build a One-Skillet Meal Like It's Your Job | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Build a One-Skillet Meal Like It's Your JobFewer dishes, fewer problems, and fewer things to complain about. Sounds good to us.By Alex DelanyMay 10, 2018FacebookTwitterEmailBen DeweyFacebookTwitterEmailDoing the dishes is the worst part of making dinner. That is a universal human truth, a lament that has been well-documented throughout mankind's time on this planet. There aren’t people out there who cook dinner, throw out the food, and get high on washing the dishes. Well, not that we know of. Fewer dishes mean fewer problems, and that’s why one-skillet meals are an absolute lifesaver when it comes to feeding yourself on a weeknight—or any night, for that matter.There’s just one dirty skillet. No mountain of pots and pans in the sink. No food processors to clean. No sheet trays to scrub. Everything is cooked in that skillet, and it’s beautiful.But how do you cook everything in a single skillet? You can’t just throw everything in there at once and expect for dinner to magically come together with a few stirs. There is a formula, and lucky for you, we know that formula. Here’s the basic runthrough for one-skillet success:Protein FirstThe reason we start cooking proteins first is to extract all that delicious, rendered fat. The juices from the seared steak, crispy chicken thighs, or pork chops give tons of umami-rich flavor to anything else that goes into the pan. So go ahead, cook your protein fully, and remove it from the pan, leaving that rendered fat for step two.If you protein happens to be seafood, like shrimp or scallops, sear them so they are just shy of being cooked through, and remove them from the pan. They’ll finish cooking as the dish comes together.Aromatics SecondThat nice little pool of fat is waiting to be used. Let’s not disappoint it. Cooking aromatics, the stuff that will give your dish a base layer of flavor and aroma, in that fat will double the flavor they possess. Whether it’s garlic or ginger or shallots or onions or tough herbs like rosemary, your aromatics should always enter the skillet after your protein leaves.Okay, imagine this with more aromatics in there.\nAnd Then a Little DeglazeDeglazing is how we get all the little bits of meat and aromatics that are stuck to the bottom of the pan off of the bottom of the pan and into our dinner. When the pan is still very hot, add a good splash of liquid—wine, cider, beer, or juice are all viable options—and scrape the bottom of the pan to get all those little bits up. If you want to really know what’s up with deglazing, read this.Vegetable TimeNow we have fat, aromatics, and some deglazing liquid bubbling away in our skillet. This is essentially a recipe for flavor. It’s our job to keep the flavor river flowing, so let’s cook some vegetables in that tasty potion. Quick-cooking vegetables work best for one skillet dinners, so we want to choose something like kale, chard, snap peas, snow peas, escarole, or asparagus. Besides being pretty and green, these vegetables will cook quickly with the contents of the skillet.Pre-Cooked Grains and Chopped Toppings...If You’d LikeOnce your vegetables have cooked through, you can add pre-cooked grains like rice, farro, or quinoa to the skillet. Orzo or noodles work too. We know, this seems kind of like cheating, since you had to cook them in another vessel, but since they’re already cooked...well, whatever. We’ll allow it. Stir in the grains and any fresh herbs, chopped nuts, or ground spices you’d like to finish your dish with.The Protein Is BackYes, it is. If your protein is steak or pork, slice it up and serve it on top of the vegetables and grains. If it’s some crispy chicken thighs, go ahead and just throw them right on there. If it’s shrimp or scallops (the ones we cooked almost all the way through), leave the heat on, clear a section of the skillet, and cook them for about a minute, just until they're cooked through.Serve That StuffThe best thing about making everything in one skillet is that you can also serve it in the skillet. Serving your dinner all in one vessel is charming, cute, resourceful, innovative, lazy, or whatever you want it to be. Describe it however you wish. At the end of the day, you’ll still have the same number of things to clean: just the one.One-skillet steak and spring vegetables coming in real hot:One-Skillet Steak and Spring Veg with Spicy MustardThe ultimate fancy-but-not-too-fancy date night dinner.View RecipeExplore Bon AppétitBasicallyChickenSteakVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Alex Delany"]}