{"id": "79a124bf1bffb777580a845bd30c039e", "url": "https://www.bonappetit.com/story/healthyish-superpowered", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Introducing Healthyish Superpowered: A New Kind of Dinner Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIntroducing Healthyish Superpowered: A New Kind of Dinner PartyCome eat, drink, and party with us in a city near you!By Amanda ShapiroFebruary 26, 2018FacebookTwitterEmailFacebookTwitterEmailSince we launched Healthyish a year ago, we've been seeking out and celebrating people who believe that wellness is for everyone, who care not just about food but about all the worlds surrounding it. Today, we're a community that doesn't live solely at a web address or on an Instagram page: You guys are out there cooking, eating, and living healthyish every day. And, well, we really want to hang out with you IRL!So we're doing it. We're calling it Healthyish Superpowered: It's a new kind of dinner party, and it's coming to a city near you in 2018. Over the course of the year, we'll be hosting a series of dinners in honor of early-to-mid-career women who are living and breathing this \"wellness is for everyone\" thing every damn day. Each woman we honor will choose a local charity to receive a portion of all ticket proceeds. These dinners are our way of bringing healthyish-minded people together to meet, eat, and party at some of our all-time favorite restaurants (that just happen to be run by women). All for a very good cause.Superpowered kicks off on March 27 in San Francisco, with a family-style dinner by Gabriela Cámara at her restaurant Cala, in honor of Aileen Suzara, a cook and educator who's working with communities of color to promote vibrant, healing food cultures. Fifty percent of ticket sales go to La Cocina, the food incubator that helped Suzara jumpstart her mission-based catering business, Sariwa. And if you can't make it to the dinner, you can still eat the food: Cala is launching an exclusive healthyish dish on Caviar (our very awesome partner!) for a limited time in March. Plus, there's now a whole section of Healthyish-approved restaurants on the meal delivery app, all over the country.We'd love to see you on March 27 if you're in the SF area. And, if not, check out our whole itinerary to see when we're heading your way. We're so excited to hang out with you!Buy tickets to Healthyish Superpowered and see the whole schedule here.Explore Bon AppétitHealthyishSuperpoweredTrendsRead MorecultureAileen Suzara Is Flipping the Script About 'Unhealthy' Filipino FoodBy Melissa Pandika Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-26", "author": ["Condé Nast", "Amanda Shapiro"]}