{"id": "79a48ab93e8b0b113d7ef0b32d7b94bd", "url": "https://www.bonappetit.com/story/laminated-pie-dough", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Laminated Pie Dough is the Flakiest, Crispiest, More Tender Pie Dough of All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPrepare to Change the Way You Make Pie Dough ForeverIf you haven't been laminating your pie dough, you've been missing out. By Sohla El-WayllyApril 7, 2020FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.I’ve been a pastry chef for a long time, so I don’t always have the best gauge on how people bake at home. (You mean you don’t all have six kilos of Guittard chocolate in your closet?) That’s why when Basically Editor Sarah Jampel told me that the average home baker doesn’t laminate their pie dough, I was very confused. “What do you mean? Like, how else do you even do it?!”If you’ve only ever made pie dough by “mixing it up and rolling it out” (that’s how Sarah tells me most people do it), you probably don’t even know what you’re missing. Your past pie doughs may have been tender, sure, but my recipe, which relies on the process of “lamination” (i.e. the process of rolling and folding) puffs in the oven and shatters under your fork—it’s crispy, light, and full of air. It's the pie dough equivalent of a great croissant (a pastry that, not coincidentally, also relies on the laminating technique).Don’t try this with any old pie dough recipe: This one has more butter than the average, which means the crust will come out tender even after all of the rolling and folding. And, whereas most recipes instruct you to break down the butter into pea-sized pieces, for this one you’ll quickly smash each cube once. In the laminating process, those big butter chunks will get flattened out into long sheets. Add the ice water, smash it into the dough aggressively, and then you’re ready to laminate—and it’s really not that intimidating:Okay, so you’ve got your shaggy mass—that combination of cold butter that you’ve smashed into pieces, plus flour and water. Now dump it onto your work surface and gather it into a rough square. It will be messy. You’ll have dry bits, big pieces of butter, and even some wet clumps of dough, but that’s okay.Now’s the time to get rolling. Use as much flour to dust the counter, dough, and rolling pin as you feel you need. You can always brush the excess flour off with a dry pastry brush when you’re done. Roll the dough out until it’s about ½-inch thick. You should aim for a square or rectangle, but don’t get hung up on shape: What is most important is thickness. Your goal is to get the butter into thin, flat sheets that will be layered throughout the dough.Next, fold the dough—which will still be piece-y and broken-looking—over onto itself, using the bench scraper to assist. Then fold it over onto itself again. We’ve made four layers already!Now, repeat the process one more time by rolling the dough out to about ½-inch thickness and then folding it over itself twice. The dough will hold together at this point, with those big pieces of butter looking more like streaky sheets.After this last round of folding, those four layers have transformed into 16! That’s 16 layers that will puff in the oven as the butter melts and creates steam. That's it: You’ve just laminated dough. You’ve made a pie crust flakier and lighter than any you’ve tasted before, and I can guarantee you won’t go back to your mix-and-roll ways of the past. You’re practically a pastry chef! Now there’s only the matter of finding some closet space for your chocolate.Get the recipe:Triple-Threat Onion GaletteNot just a clever name, this savory tart combines three alliums (scallions, garlic, and onion) for maximum flavor and crispy-jammy texture. The key to the flaky crust is to move fast! Rolling and folding the dough while the butter is still cold creates distinct layers of butter and flour that will steam apart during baking, making the crust light and flaky.View RecipeExplore Bon AppétitBakeBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-07", "author": ["Condé Nast", "Sohla El-Waylly"]}