{"id": "79bad5f257abdfe5ae14eb7132c7c4f9", "url": "https://www.bonappetit.com/recipe/roasted-root-vegetables-with-green-salsa", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Roasted Roots With Green Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueRoasted Roots With Green SalsaBy Ali Slagle February 8, 20224.8(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata, food styling by Pearl Jones, prop styling by Marina BevilacquaEmailPinterestPrintEmailPinterestPrintRoasted sweet potatoes and carrots get gussied up with a zippy green salsa in this weeknight sheet pan recipe from Ali Slagle’s cookbook I Dream of Dinner (So You Don’t Have To). The verdant carrot top salsa is the real star here, balancing tart fresh tomatillos with gently charred scallions and lots of lime juice. The result is a bright condiment that can also perk up any protein, salad, grain—or even tortilla chips. If your carrots came without greens, use cilantro in their place.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEACitrus Juicer$7 At AmazonIngredients4 servings3medium sweet potatoes (about 2 lb.), scrubbed, cut into ½”-thick wedges8small carrots with tops (about 1 lb.), tops reserved, scrubbed5scallions, roots trimmed1Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt, freshly ground pepper8oz. tomatillos (about 5), husks removed, rinsed, coarsely chopped (about 2 cups)1–2green chiles (such as serrano or jalapeño), finely chopped¼cup fresh lime juiceCotija cheese, ricotta salata (salted dry ricotta), or feta (for serving)PreparationStep 1Place a rack in lower third of oven; preheat to 450°. Place sweet potatoes, carrots, and scallions on a baking sheet. Drizzle a little oil over, season with salt and pepper, and toss to coat. Divide vegetables between 2 baking sheets if cramped and spread out into an even layer. Roast until tender and browned, 15–25 minutes.Step 2Meanwhile, coarsely chop reserved carrot tops (you want about ½ cup) and place in a medium bowl. Add tomatillos, chiles, lime juice, and remaining 1 Tbsp. oil. Season salsa with salt and pepper and stir to combine (it will loosen as it sits).Step 3Cut charred scallions into small pieces, add to salsa, and stir to combine. Divide sweet potatoes and carrots among plates and top with salsa and lots of cheese.Recipes excerpted with permission from ‘I Dream of Dinner (So You Don’t Have To)’ By Ali Slagle. Copyright © 2022 By Alexandra Slagle. Published by Clarkson Potter. \n\nBuy it on Amazon or Bookshop.orgHow would you rate Roasted Roots With Green Salsa?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleExcellent recipe for a cold March night! I'm glad we scaled it up a bit because we barely had any left over. Not much protein but it was still a satisfying dinner. Clearly there are plenty of ways to rif on this with other winter veggies, but it was perfect for the last of the corrots and (oversized) scallions coming out of the garden. Every oven is a bit different, so watch the sheet pan closely so everything is browning and carmelizing, but not charring too much. Similarly, all peppers are bit different, so add the jalapeños in small batches until you get the heat you want.Eric W.Durham, NC3/13/2022Excellent recipe and a fun way to use tomatillos. I agree with the previous review that this wasn’t quite enough for a main dish. I will make it again but as a light lunch,or add more vegetables, or pair it with a protein and use it as a side dish. Anonymous3/11/2022I made this as written with fresh local scallions, sweet potatoes, and carrots from the farmer’s market. I served it with crumbled feta. It was fresh and delicious.  The recipe made more salsa than we needed for the vegetables. I served this as a main course, but it was not entirely satisfying as a main. Next time I will serve it with a protein as a side perhaps.Josie L.New Orleans, LA3/4/2022I had never made anything with Tomatillos before. The salsa was delicious and pairs so nicely with the sweet caramelized flavors of the roasted toot vegetables! I used goat milk feta cheese crumbles and serrano peppers and it had just the right amount of kick and creamy coolness! susan bentsenSeattle, Wa2/19/2022Explore Bon AppétitDinnerWeeknightSheet-Pan DinnersEasyVegetarianNut-FreeSweet PotatoPotatoVegetableCarrotTomatilloSideRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Ali Slagle"]}