{"id": "79c76271917d850d56899780dc8459ea", "url": "https://www.bonappetit.com/story/ooh-ooh-oooh-im-on-fyre", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Ooh Ooh Oooh, I’m on Fyre | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOoh Ooh Oooh, I’m on FyreA Joshua Tree dispatch from Healthyish editor Amanda Shapiro.By Amanda ShapiroJanuary 24, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,If you read no further, read this: We’d love to know what you thought of this year’s Feel Good Food Plan. Even if you cooked only a few (or none!) of the recipes, take two minutes and fill out this little survey. It’ll help us make the plan even better and more delicious next year. We appreciate you!I’m on a reporting trip in the California desert this week, and it’s been nice to see so much sky and hear so much silence. Since the Feel Good Food Plan wrapped and last week’s Healthyish 22 launch, I’ve been trying to slow down a bit. I’m one of those people who can turn even leisure-time into a stressful activity, so actually doing this requires care and attention. Though it definitely helps when the temps are in the teens and below.This past frigid weekend involved some low-key cooking, including Chris Morocco’s coconut-braised chicken, which is genius because it can be assembled in literally a minute, so the one-ish hour it spends in the oven feels like time well spent. I’d say you could add extra coconut milk at the beginning if you want it extra saucy, or use the last of the can to make coconut rice (like I did). It was one of the best meals I’ve made in a long time. Then my living companion got it into his head to make bread, and rather than taunt him for becoming a #breadbro I decided that if someone in my house wants to make delicious, warm, homemade gluten, I’d best keep my mouth shut. The bread was heavenly, then two days later he acquired a sourdough starter, so, yeah, we’re those people now.Watching the Netflix Fyre Festival documentary was definitely not a relaxing use of leisure time, and judging by my Instagram DMs, you felt the same. People like Billy McFarland are terrifying, but what I find scarier is the fact that no one around him tried to stop his sociopathic descent that pulled so many others down too. Do we never learn?! I hated pretty much everyone in that documentary except for the residents of the island who got screwed. (And I’m glad that decent people raised enough money to pay back the Bahamian restaurant owner, but we obviously owe a lot more people a lot more than that.) I had intentions to watch the Hulu doc too, but I think I’ll just listen to Springsteen instead.In other grifter news, I’d been following this Caroline Calloway Twitter thread ever since associate editor Hilary Cadigan clued me in, and I loved seeing how it all unfolded. This time, I'm happy to report, everyone seems to have gotten out unscathed. Thank God, because I don’t think I could handle another #Fyregate right now.If you need me, I’ll be in the desert.Sincerely,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThese People Are Changing the Way We Live on This Crazy PlanetBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Amanda Shapiro"]}