{"id": "79db1cbf49a5b8962998fc8a9bf13782", "url": "https://www.bonappetit.com/recipe/pears-and-radishes-with-gorgonzola-and-nori", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Pears and Radishes With Gorgonzola and Nori Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssuePears and Radishes With Gorgonzola and NoriBy Chris MoroccoJanuary 4, 20223.6(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Paola + Murray, food styling by Pearl Jones, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintThis winter salad has it all: salty, creamy cheese; crackly, crunchy seaweed; sweet and crisp pears; and crunchy radishes with a little zing. If your nori has softened slightly or bends too much to shatter, gently toasting it over a hot burner for a few seconds will help to bring out its roasted flavor and make it easier to crumble.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBamboozle Nesting Bowls$80 At Bon Appétit MarketBenriner Mandoline Slicer$80 At AmazonCitrus Juicer$7 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4 servings3ripe but firm pears (such as Bosc or small Asian)2medium radishes (such as watermelon) or purple daikon or a 4\" piece regular daikon, trimmedKosher salt¼cup extra-virgin olive oil3Tbsp. fresh lemon juiceFlaky sea salt4oz. Gorgonzola dolce or other soft blue cheeseFreshly ground black pepper1toasted nori sheetPreparationStep 1Thinly slice pears, starting from outside edge and cutting until you hit seeds and working your way around core. Thinly slice radishes (a mandoline is great, but a sharp knife will do it just fine). Combine pears and radishes in a large bowl; season with kosher salt. Add oil and lemon juice and toss to coat. Taste and season with more kosher salt if needed.Step 2Arrange some salad on each plate, dividing evenly, and sprinkle lightly with sea salt. Crumble Gorgonzola on top and season with pepper. Crush nori and sprinkle some over each salad.How would you rate Pears and Radishes With Gorgonzola and Nori?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerEasySaladPearFruitAsian PearRadishVegetableGorgonzolaBlue CheeseCheeseSideWinterVegetarianGluten-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Chris Morocco"]}