{"id": "79db9d6770515dd0c691730ec5a1b865", "url": "https://www.bonappetit.com/story/restaurant-running-clubs", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Restaurant Running Clubs Are Replacing Staff Bar Nights | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAt These Restaurants, Staff Runs Are Replacing Staff Bar NightsRestaurants across the country are forming running clubs as an alternative to late-night, bar-fueled kitchen culture.By Priya KrishnaJanuary 22, 2020FacebookTwitterEmailPhoto courtesy of Comedor Run ClubFacebookTwitterEmailAs a line cook in New York, Akira Akuto used to work painfully long shifts, sometimes not getting out until 5 a.m. Afterward, he’d go out with co-workers, grabbing drinks and often a meal at whatever spot was open at that hour. He’d sleep in as late as he could the next day, and do it all again.Now, as the chef and co-owner of the daytime Japanese sandwich shop, Konbi, in Los Angeles, Akuto and his team go on a run after service ends instead of going out to a bar. This running club is the new normal for his restaurant, and many others across the country including Bar Corallini in Madison, W.I.; Comedor in Austin; Chaia in Washington D.C.; Eleven Madison Park and the NoMad in New York; and Frasca Food & Wine in Boulder, C.O. By providing substance-free opportunities to connect outside of the kitchen, these places hope to help change the industry’s late-night, bar-fueled social culture.Akuto and his business partner Nick Montgomery started their running club as a way to build camaraderie among the staff when they opened Konbi in 2018. “We were thinking about what kind of company culture we wanted to create,” Montgomery says. That meant gearing socializing “more in the direction of something that is good for you, beneficial, and sustainable.” The running club now includes a third of the close to 20-person staff, and usually meets on Mondays after service.A lot of these running clubs started for a similar reason—as a healthy way to socialize that didn’t require too much planning or resources. Bettina Stern, who co-founded the vegetarian taco spot, Chaia, which has two locations in D.C., was inspired by the Georgetown restaurant’s proximity to the Potomac River, a popular running path. She collaborated with a nearby running shoe store to start the club for staffers and customers of both establishments.Stern says she sees running as particularly valuable for those working in the restaurant business, as “it gets you pushing your body to move in a way that you don’t necessarily do in the confines of a 2,000 square foot space,” she says. “For me, it is as much an emotional thing as a physical fitness thing.”Gabe Erales and Philip Speer began running to blow off steam when they were in the process of opening Comedor, their Mexican restaurant in Austin. “We jokingly called it our run club,” Speer says. “And then the other people in the kitchen started joining us.” They started posting about the club on Instagram with the hashtag #comedorrunclub, and within a week, much of the kitchen staff, as well as employees of other nearby restaurants, had joined them. The group meets at the restaurant three days a week at 10 a.m. to run a 5K route around the city. Some people run 6-minute miles, while others run 13-minute miles. Even a few of the restaurant’s vendors have joined.“The thing about running is that you can just go out and run,” Speer says. In other words, it’s a free activity that’s available to almost everyone.Alex Pfaffenbach, who is the director of food and beverage for The NoMad hotel’s three locations (in New York, Los Angeles, and Las Vegas) and oversees the umbrella restaurant group’s running club, takes the New York staff out for 9 a.m. runs and midnight runs in Central Park twice a week The company also has a dedicated running coach, John Honerkamp, who trained Eleven Madison Park chef Daniel Humm for marathons and is now contracted to serve as a shared resource for the restaurant group.Pfaffenbach says these runs are the best chance to get to know his colleagues. “We have a really big team,” but on runs, where upwards of 40 people regularly join, “I get to spend time with a food runner from Eleven Madison Park I wouldn’t cross over with in a work environment, and meet newer team members. It builds a broad sense of community.”Because these running clubs are as much a social outlet as they are exercise, a lot of owners say they’ve seen a slow shift away from the late night bar outings and drug-and-alcohol-fueled work atmospheres that have contributed to the restaurant industry having the highest rates of substance abuse of any profession.“I have had these moments where I’m like, ‘I would love to have a nightcap,’ but I don’t want to run hungover,” Erales says. “So I skip it, and I feel more rested.”Some of these spots have stopped offering shift drinks, the complimentary booze usually served to staff after service —a tradition that has come under fire for helping cultivate a toxic alcohol culture. At Comedor, those savings contribute to bringing a yoga instructor in on Thursdays and giving employees healthcare coverage.Not every place supplements its running club with other wellness-related benefits. Akuto and Montgomery could only recently afford to provide healthcare for employees, and they haven’t been able to find a gym to partner with for discounts. Another challenge is that running is not a totally accessible activity. Even jogging short distances at a slow pace requires a base level of fitness, stamina, and mobility. Most of these restaurant owners insist that no staffers have felt alienated by the running clubs, but when it’s the only option for socializing with your colleagues, that can potentially create uncomfortable situations for people with disabilities or those who simply don’t like to run.But the running club is just the start, says Bobby Stuckey, who oversees a club of his own at his Boulder spot, Frasca Food & Wine. His broader hope is to make his employees more invested in leading a healthy lifestyle, whatever that may look like.“We’re seeing a cultural shift” in the restaurant business, he says. “I see exercising as a way of playing the long game,” to prevent young, talented cooks and wait staff from fizzling out due to party culture.By many accounts, that strategy works. Stuckey has seen other staff members get into different forms of exercise after joining the running club. A number of restaurant owners from other parts of the country got in touch with Speer and Erales after seeing the Comedor running club on Instagram saying they were inspired to start their own. Layton is trying to expand his club to include the entire restaurant group that owns Bar Corallini, which encompasses over two dozen spots.“We care so much about sustainability in our food system,” Stuckey says. “It’s time we shift that to the people around us.”Explore Bon AppétitHealthyishRestaurantsRead MoreLifestyleCan New York’s Queer Nightlife Scene Feel at Home in a Hotel Chain?By Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-22", "author": ["Condé Nast", "Priya Krishna"]}