{"id": "79fad909aaeabf9a9c16b1a5445f6d28", "url": "https://www.bonappetit.com/story/pursuing-asian-joy", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "In Pursuit of Asian Joy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn Pursuit of Asian JoyI’m learning how embrace joy while still holding space for grief.By Christina ChaeyMarch 28, 2021FacebookTwitterEmailPhoto by Christina ChaeyFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.Like so many others, I’m holding grief and space in my heart for the victims of the shootings in Atlanta and Boulder, in particular for the six Asian women who were killed while working at Atlanta-area spas.As I learn more about the lives, dreams, and families of these six women—Daoyou Feng, Suncha Kim, Hyun Jung Grant (Kim), Soon Chung Park, Xiaojie “Emily” Tan, and Yong Ae Yue—I am humbled by what I have yet to learn (and, always, unlearn). A close friend eloquently reminded me that these women’s deaths felt, in many ways, seemingly inevitable—the violent result of their particular intersections of gender, race, and class, this country’s history of war and imperialism, and the devaluation of sex work and other care work, which is often taken on by low-income women of color with few other options. Making a commitment to learning more about these histories is one small way I’m trying to honor these women and so many more whose names we don’t know.I constantly struggle with self-imposed pressure to immediately do and say the “right” things; post the “right” things on social media; learn the “right” facts and histories, often in a crash course way; give to the “right” organizations. But the reality is that much of this learning and doing will happen over the long-term project that is my life. When I’m able to say, “I’m okay with this kind of work taking a lifetime,” I can make space for other needs, for things like private grief and Asian joy.These days, I’m calling up and spending time with Asian American friends I adore and admire. I am engaging with their work, like my friend Jennifer Hope Choi’s recent NYT op-ed that thoughtfully considers the intergenerational divide that separates our lives and values from those of our immigrant parents’.I’m seeking out Asian-owned businesses while doing some retail therapy in the form of soft gray-striped linens from Loyale Studio, Fly By Jing fragrant chiles (and chili crisp!), and snacks and pantry goods from new online Asian grocer Umamicart. (And I am patiently awaiting a restock of this adorable Heart of Dinner x Andrew Teoh bok choy tote!)I’m also seeking out Asian joy by very slowly reintroducing Instagram into my life after a many months-long hiatus. I log in once or twice a week for a few minutes at a time to read nourishing DMs from friends (like this beautiful poem on Asian rage by the poet Lacy Nguyen). And rather than scrolling, I seek out specific people whose content I deeply love: The Heart of Dinner page to look at photos of smiling, homebound Asian elders safely receiving their weekly grocery deliveries; the @asiansformentalhealth page for guidance, support, and education; my friend Kimberly Chou Tsun An, who so joyfully advocates for liberation for all; and artists like Chanel Miller, whose recent artwork perfectly, painfully encapsulated much of how I feel right now.There are so many ways to embrace joy while still holding space for our collective grief. I would love to hear about how you’re finding your own balance between the two right now. I’m @seechaey on Instagram, and if you message me there, I promise I will find you; it might just take me a week or so.All I Want to Eat Right Now:Photo by Emma Fishman, Food Styling by Rebecca JurkevichFridge Clean-Out Nabe With Mushroom DashiChinese Broccoli With Soy PasteSpicy Braised TofuSpicy Soft Tofu and Seafood StewPork Wontons With Sesame SauceCongee with Spring Vegetables and Green Garlic OilExplore Bon AppétitHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-28", "author": ["Condé Nast", "Christina Chaey"]}