{"id": "7a02573cab9f3a75bc139ee6577feaf4", "url": "https://www.bonappetit.com/story/le-creuset-stainless-steel-collection", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Le Creuset to Release New 7-Piece Stainless Steel Collection | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLe Creuset to Release New 7-Piece Stainless Steel CollectionSo shiny!By Melissa MintonMarch 15, 2018FacebookTwitterEmailLe CreusetFacebookTwitterEmailYour favorite dutch oven purveyors are at it again: Le Creuset has added to its line of stainless steel pans. The French brand’s newest collection is a 7-piece set that includes a 10-inch frying pan, 2-quart sauce pan, 3-quart sauté pan, and a 7-quart stockpot.Known for its ceramic and enameled cookware, Le Creuset designed the new pieces in the same iconic style you know and love, but with a cook’s essential material. Le Creuset also created a two-piece nonstick, stainless steel frying pan set; both will be officially available for purchase on April 15, but those who simply can’t wait can get their hands on open stock now. Prices are in the All-Clad range, from a $120 sauté pan to a 13-piece set for nearly $1,000.Le Creuset’s classic enameled cast iron Dutch ovens are great for braises, baking bread, and even weeknight pasta. But you still need that stainless steel pot to boil pasta water, or the saucepan to reheat soup or make oatmeal, and the sauté pan for fish with the crispiest skin (more on that technique here). There’s a reason they’re in our list of 12 kitchen tools you absolutely need, no matter what level of cook you are. The stainless steel pots and pans have an aluminum core that is surrounded by two layers of stainless steel, making them safe to cook with sans any fear that a weird metallic-y taste will hang around your food. The lids have the same signature circular pattern as the Dutch oven lids.Le Creuset’s Dutch ovens—cocotte if you’re French—are pretty much flawless in every way (and have been re-released in a rainbow of seasonal and trendy colors and shapes that people can’t get enough of). Likewise, we’re expecting the stainless steel set to be sturdy enough to last a lifetime.See some of the new pieces, below.Le CreusetLe CreusetLe CreusetYou’ll Need a Stainless Steel Pan for This:Explore Bon AppétitShoppingToolsTrendsRead MorecultureLe Creuset's Heart-Shaped Cookware Is Perfect for Valentine's DayBy Melissa MintoncultureLe Creuset Is Releasing Some Magical Snow White-Themed CookwareBy Evelyn WangcultureLe Creuset Releases a Line of Millennial Pink CookwareBy Zoe WeinerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Melissa Minton"]}