{"id": "7a03476ed1086effabe8ed5af40b36cb", "url": "https://www.bonappetit.com/story/use-the-oldest-thing-first", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "There's No Better Time to… Use the Oldest Thing In Your Pantry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Use the Oldest Thing In Your PantrySeek it out. Use it up. By Sarah JampelMarch 24, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Reach into the depths of your pantry and use the oldest thing first.There’s plenty of perfectly edible food squirreled away in the far reaches of my cabinets that has, for whatever reason, gone by the wayside. A couple months ago, I would have griped about it—I didn’t have time to figure out what to do with the bottle of kecap manis, I couldn’t possibly tap into the precious reserve of pearl sugar I’d been guarding with my life—but now, I’ve run out of excuses. And that’s kinda sorta empowering! That time I'd normally spend commuting? Now I can use it to soak rice or read up on (slash bug Andy Baraghani about) dried chiles or figure out how I ended up with three pounds of flattened rice, a.k.a. poha, in the first place. In some strange way, it’s lighting my creative spark (is that corny?) to work with what I’ve got rather than reach for my usual crutches.Why now? Well, over these past few weeks, there’s been plenty of information about what to acquire in preparation for hunkering down and staying in. I’ve purchased a couple pounds of pasta and a few cans of tomatoes, along with plenty of rice, nuts, beans, and practically indestructible vegetables. That kabocha will be with me for the long haul.But I’m trying to listen to the experts (hi mom) who tell me to set that stash aside for safe-keeping. Instead of tapping into the new provisions, I’m abiding as best I can by the common restaurant mantra: first in, first out. This dictates that the items I first added to my pantry (the bags and jars that moved with me to Brooklyn, ahem, nearly five years ago) should also be the first I use.Remember all that stuff you added to your pantry back in 2018? Time to use it!\nPhoto by Chelsie CraigI should say that pantry items don’t live forever. So before I make a plan, I browse the internet to get a sense of the general lifespan of the food, and then I examine it to make sure it won’t harm me or my partner. Since that would be bad.So this week, my goal is to tackle the “seaweed section,” the bag of wakame, hijiki, arame, and kombu that has escaped my grasp for years. I have multiple bags of unopened bonito, too, so I’m thinking of making dashi. I’ll refrigerate some of it for later in the week and use a portion to make a simple soup with those three ounces of soba noodles leftover from a recipe that only called for five, rehydrated seaweed, and the napa cabbage bobbing around the refrigerator.If you can’t remember what’s even in your pantry, it’s probably a good idea to take it all out! Unpack everything onto sheet trays (when I do this, I stand on the counter and my partner spots me, like I’m an acrobat or something!) and then reorganize and prioritize. You might even want to break out the masking tape! The last time I did this, I wrote an inventory of each cabinet and stuck it on the inside door. (Dork alert.) But now, whenever I reach for the sugar I’m reminded that yes, we do have dried fenugreek leaves and glutinous rice and two kinds of date syrup and maybe I can cook something I’d never ordinarily make!Let’s say you’re staring down a bottle of Ikea ketchup and you’re stumped. Send me a message on Twitter or Instagram and I’ll try to help! Really, I will. Okonomiyaki sauce? Ketchup-glazed lentil loaf? Sweet and sour cauliflower? As Hillel the Elder once said, “If not now, when?”Explore Bon AppétitCoronavirusThere's No Better Time BasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-24", "author": ["Condé Nast", "Sarah Jampel"]}