{"id": "7a0e1966179c91debf401244f3d53438", "url": "https://www.bonappetit.com/recipe/maple-sriracha-glazed-bacon", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Maple-Sriracha Glazed Bacon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueMaple-Sriracha Glazed BaconBy Amiel StanekMay 24, 2018EmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintSweet. Spicy. Bacon. What’s not to like? This recipe is clutch for a brunch party because the bacon can be cooked most of the way, held on baking sheets, then glazed and reheated right before everyone sits down.Ingredients10 servings2½lb. bacon slices (about 40)¼cup pure maple syrup1Tbsp. low-sodium soy sauce or tamari1Tbsp. SrirachaPreparationStep 1Arrange racks in upper and lower thirds of oven; preheat to 400°. Arrange bacon in a single layer on 2 foil-lined rimmed baking sheets (it’s okay if strips overlap slightly; they’ll shrink as they cook). Bake, rotating pans back to front and top to bottom halfway through, until bacon is browned but not quite crisp, 16–18 minutes. Let cool 5 minutes. (You can also let cooked bacon rest on pans at room temperature up to 2 hours.)Step 2Whisk maple syrup, soy sauce, and Sriracha in a small bowl to combine. Using tongs, turn bacon on pans. Using a pastry brush, brush bacon on one side with glaze. Return to oven and bake, rotating pans back to front and top to bottom halfway through, until bacon is crisp, 10–15 minutes (time will vary depending on your preferred level of crispiness).How would you rate Maple-Sriracha Glazed Bacon ?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI recently found Bon Appetite test kitchen and love it!! My nephew (in his 30's) and his special girl love watching it too now!AnonymousOttawa, Canada6/2/2018Explore Bon AppétitBaconCured MeatMeatEasyDairy-FreeNut-FreeGluten-FreeBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Amiel Stanek"]}