{"id": "7a0f0355b7f6913ea5a533e3db6c2363", "url": "https://www.bonappetit.com/recipe/relajo", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Relajo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueRelajoSeptember 22, 20204.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“Relajo is the foundation of so many Salvadoran dishes, but the spice mix varies depending on the dish or the cook,” says chef Anthony Salguero of Popoca in Oakland. “There are certain consistent elements—bay leaves, achiote, chiles, cumin seeds, sesame seeds, pumpkin seeds—and then more idiosyncratic additions like peanuts. It hits my palate like a Mexican mole and adds complexity to even simple dishes like this quick sautéed shrimp.” Toasting and grinding the spices in this warming blend unlocks all of their flavor. This recipe yields a lot, but you won’t have any trouble finding other uses for it: When you’re sweating aromatics for a braise, stir in a couple spoonfuls of relajo, turn it into a rub for grilled meats, or add a few big pinches to freshly fried potatoes.IngredientsMakes about 1½ cups4medium pasilla chiles, seeds removed, torn into 1\" pieces6star anise pods43\" cinnamon sticks4dried bay leaves¼cup coriander seeds¼cup dried oregano¼cup raw pumpkin seeds (pepitas)3Tbsp. sesame seeds2Tbsp. cacao nibs or ¼ cup (scant) unsweetened dark cocoa powder2Tbsp. cumin seeds1Tbsp. achiote (annatto) seeds or 2 tsp. powderPreparationStep 1Preheat oven to 325°. Scatter chiles, star anise, cinnamon sticks, bay leaves, coriander seeds, oregano, pumpkin seeds, sesame seeds, cacao nibs, cumin seeds, and achiote seeds on a parchment-lined rimmed baking sheet and bake until lightly browned and chiles are crisp, 18–22 minutes. Let cool.Step 2Transfer chile mixture to a blender and blend on high until finely ground, about 1 minute (be careful not to overprocess; you don’t want it to turn into a paste).Step 3Do ahead: Relajo can be made 1 month ahead. Store airtight at room temperature.How would you rate Relajo?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThe beautiful aroma of toasting aromatics, simply heaven. I can’t wait to use in my panes con pavo recipe. Silvia D.Naples, FL1/4/2022Delicious! I can think of so many uses for this. For those who bought fresh chiles, dried chiles often have a different name than their fresh counterpart.  To get a Pasilla chile you need to dry a fresh, green Chilaca chile. Pasilla chiles are always dried.DZMichigan11/19/2020You should specify DRIED pasilla chiles.  I see someone else had the same issue. Kind of a drag after buying all those ingredients.TMAltadena, CA11/8/2020Let's also talk about raw pumpkin seeds. Do you mean raw from the pumpkin, or plain dried ones?\n\nThanksSBBoise11/6/2020This is a truly amazing spice mixture. I substituted dried arbol chilies and cacao powder and it was perfect. Origionally made it for Pollo en Chicha which is truly amazing but now I cannot wait to use this with pulled pork en chicha and oh so many other dishes. Glad it made a lot.AnonymousSouth Carolina10/18/2020When I read through this recipe, I thought it was weird that the chiles would get crispy at 325 degrees for that short of a roasting time.  Of course I used fresh chiles as the recipe didn't specify dried ones.  Obviously, that is what was intended because the chiles NEVER got crispy, even after I separated them out from the rest and roasted them at 450 for 30 minutes.  The flavor was good though.  Please alter the recipe to reflect what kind of chiles should be used.  Thank you!\nAnonymousUSA10/15/2020I’m knee deep in this ‘relajo’ only to realize these probably should have been dried pasilla. WHY IS IT NOT IN THE RECIPE!?!?!? So now my relajo is going to be turned in to mole paste.. AnonymousMexico10/4/2020Explore Bon AppétitCondimentSalvadoranCentral AmericanLatin AmericanPumpkin SeedSeedEasyDairy-FreeGluten-FreeVeganVegetarianRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}