{"id": "7a11d4f026d1665b04bb9e1fdab5a929", "url": "https://www.bonappetit.com/story/restaurant-blankets", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "I’d Love a Blankie With My Meal, Thanks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Love a Blankie With My Meal, ThanksWe keep seeing plush, soft blankets at restaurants for chilly customers. It hints at where hospitality is going: to a place so comfortable and cozy we might soon expect a bedtime story.By Alex BeggsSeptember 19, 2019FacebookTwitterEmailCozy up with the blankets at Lazy Betty in Atlanta.Photo by Shannon ColeFacebookTwitterEmailIn this fantasy you are wearing a buttery silk slip muumuu at a restaurant in Aspen, when your arms begin tickling with goosebumps as the sun sets. Suddenly, a striped wool blanket appears. Now this, this is hospitality! Or where it may be leading: To a place so comfortable, so cozy, so thoughtful, you might never want to go home—where the blankets are nubby and threadbare.In cities known for having more than one season, you can find restaurant blankets draped on the backs of chairs or rolled into antique milk crates. Once you start noticing them, you’ll never stop. I first encountered actually in-use restaurant blankets in the high altitude Andes mountains where Mil is located in Peru. There, where the temperatures drop and the breeze hits straight to the bone, diners wrap blue-gray throws made of impossibly soft baby alpaca (woven by local artisans) around their shoulders. And those blankets can keep you warm forever and ever—they’re for sale to support the restaurant’s research team.In mostly warm Atlanta, Lazy Betty has lightweight pastel throws for guests who might walk through wandering ghosts. (You never know!) In mostly cold Aspen, you can snap up a preppy custom wool blanket made by famed parka designer Woolrich for the cabin-y restaurant Clark’s. In temperate Austin, the Launderette team buys gray blankets from a military surplus store, cuts them in half, and re-hems them. Crafty! And is that a 100 percent brushed-cotton Sferra Celine throw draped over the chairs at Angler in San Francisco? Expect no less!There’s much to admire about a restaurant so considerate of a guest’s comfort. The hospitality is warmer than a mug of hot chocolate. And at Olmsted in Brooklyn, you can get that too, along with a colorful Pendleton blanket. But it’s about more than that.Swaddle me in these blankets (clockwise from top left): Angler, The Wolf’s Tailor, Clark’s, and Lazy Betty\nPhoto by Chelsie CraigFrom a design perspective the blankets can soften a space that might otherwise feel stuffy or pretentious, especially if it’s a tasting menu spot. That’s why chef Ronald Hsu brought pale pink and mustard-yellow H&M throws into Lazy Betty—“to allow you to get really cozy,” he says. Sure, a guest walked away wearing one as a shawl on the restaurant’s opening night, but they brought it back.I talked to Angler’s director of operations, Maxfield Schnee, for over 30 minutes about blankets. “I’m the blanket guy,” he said by introduction. Picture Linus, but with a $97 throw in herringbone stitch plus tassels. At the impeccably designed Bay Area restaurant, the blankets cushion the diner’s back while they sit when they aren’t in active use. “Chef is hyper, hyper, hyper aware of the guest experience,” Schnee said. “Even the parts the guest is not aware they’re experiencing.” (Emphasis mine.)Finding the right blanket was as overthought and obsessed-over as the menu, and the lamps, and the chairs: “We went through a number of samples,” he said. “It was a fun time for a freak like myself. We tested them in the same conditions as the guests, at the tables in chairs, in every area,” say, if you’re seated under the A/C vent. “Some weren’t soft enough, some didn’t suit the look when draped on the back of the chair, some were warm but itchy.” Until they found The One. The Celine.The blankets represent more than a physical need, noted Schnee, but something subconscious, something you lean back on without noticing. “It’s simply there to increase the joy and comfort level in the everyday.”This gets back to my theory about hospitality. There’s a home direction we’re headed in (don’t make me say “hygge”) that has intimate, maternal associations. But it’s the mythic, kid’s book version of home—being tucked in, being fed soup on a spoon that zooms toward your mouth like an airplane—not the reality we escape when we flee the house seeking dinner, or hell, a new life, elsewhere. Take care of me, I surrender, we say to the blanket. But you’ve grown up, you make your own soup now. You still lean against that pillar, that blanket on the back of the chair. You didn’t get here all by yourself.And then in turn, the blankets seem to say, Let me swaddle you in my warm embrace. Let me solve your temporary problems. Let me remind you that the cooking is better here than at home, the decor nicer, and the wine list long. So please, please come back.Explore Bon AppétitRestaurantsTrendsHot 10 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Alex Beggs"]}