{"id": "7a218711dcbf3edc4b65aa31ee46651e", "url": "https://www.bonappetit.com/story/fully-loaded-everything-bagel-quiche", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "This Fully Loaded Everything Bagel Quiche Will Change Brunch Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBrunch Will Never Be the Same After This Fully Loaded Everything Bagel QuicheTwo breakfast cravings, one circular thing.By Sasha LevineFebruary 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmail“Were you high when you came up with that?”That’s what my editor in chief, Adam Rapoport, asked me on my second week on the job after I’d suggested that we create a recipe for a fully loaded everything bagel quiche. Full disclosure: The idea stemmed less from the munchies than frustration. I end up hosting large weekend breakfasts at my apartment with frequency, and bagels and cream cheese, plus some version of eggs, always ends up being the begrudging default. Wouldn’t it be nice if I could just get it all done in one? Wouldn’t it be better to do something a little less phoned-in, a little more impressive? I imagined the recipe would be all the things I love about the classic bagel sandwich—salty and savory; crunchy and creamy, warm and cold—but make it quiche.Gracious, indomitable senior food editor Molly Baz was on board to bring my vision to life.It started with the crust. The everything bagel–ness really had to hit home here. It needed to be substantial enough to hold up to the eggs and seedy enough to compensate for the surface area you get from a whole bagel. So she went with a traditional pie dough, working in a ⅓ cup mix of poppy seeds, sesame seeds, dried garlic and onion, and salt. (TJ’s sells something similar if you don’t have these in your pantry). She first tried it in a cake pan to make the quiche tower impressively, but the crust to custard ratio wasn’t right. So she went one step shallower and opted for a deep dish pie plate to ace the balance.Squint, and it looks just like the quintessential bagel sandwich.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesThen it was onto the eggs. The filling needed to simulate that neutral, clean cream cheese feeling, while remaining texturally rich and silky. So she pulled out all the dairy from the walk-in fridge and tried her custard with cream cheese, half and half, sour cream, heavy cream, and finally a mix of heavy and sour creams. The highest in fat, the creamiest in texture, and the best in brightness and tang, she found her winner. “It’s the perfect nod to cream cheese, without being actual cheese,” she said. Then Molly added raw scallions to the filling, because this is all about being extra.Last came the accoutrement: the classic combo of onion, capers, dill, and lemon that make this New York staple fully loaded. “To me, that’s a salad waiting to happen,” she said. So Molly tossed them all together, arranged a handful of it on top of the warm, fresh-baked quiche, and served the salmon (optional) right alongside.When I finally got to see it in its final form, it was absolutely nothing like I had imagined. It was taller than I had pictured. And greener. Where was the thick slather of cold, white cheese? Why weren’t there seeds everywhere? How could this match up to everything I’d dreamed of? Then I tasted it—and freaked the f#@* out. There it was: All the promise of salty, savory, crunchy, creamy, warm, and cold in one creation, and in one bite. Molly had done it. Of course, now it means I’ll never be able to look at breakfast at my place the same way again. I’m really looking forward to it.Get the recipe:Fully Loaded Everything Bagel QuicheThere isn’t anything more perfect than a fully loaded everything bagel for breakfast—and now you can eat it in quiche form.View RecipeExplore Bon AppétitBreakfastBrunchWeekendWeekend BrunchQuicheRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-25", "author": ["Condé Nast", "Sasha Levine"]}