{"id": "7a2421f687bf90732cf4ba727ab6b09b", "url": "https://www.bonappetit.com/recipe/turmeric-caramel-cod", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Turmeric Caramel Cod Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueTurmeric Caramel CodBy Kendra VaculinJanuary 4, 20223.3(72)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah MortonEmailPinterestPrintEmailPinterestPrintFlaky whitefish, like cod, is delicate and has a subtle flavor; it craves a high-octane dressing to punch it up. Here that takes the form of a sticky, savory, and sweet condiment inspired by Vietnamese fish sauce caramel. This sauce uses a heap of turmeric, so seek out a high-quality product like Spicewalla, Diaspora Co., or Burlap & Barrel. Don’t hold back on the fresh herbs and sliced raw onions on top—their freshness and bite offer a perfect counterpart to the umami-rich sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonMini Tongs$20 At Williams-SonomaCitrus Juicer$7 At AmazonMesh Sieve$13 At AmazonWhisk$10 At AmazonIngredients4 servings4limes½cup (packed) brown sugar3Tbsp. soy sauce1Tbsp. ground turmeric¼tsp. cayenne pepperKosher salt45–6-oz. cod or other flaky whitefish fillets2Tbsp. extra-virgin olive oilCooked jasmine rice, thinly sliced white onion, mint leaves, and cilantro leaves with tender stems (for serving)PreparationStep 1Slice 3 limes in half and squeeze through a fine-mesh sieve into a small bowl (you should have about 5 Tbsp. juice); discard seeds. Cut remaining lime into wedges and set aside for serving.Step 2Whisk lime juice, brown sugar, soy sauce, turmeric, cayenne, and a pinch of salt in a small saucepan to combine. Bring to a boil, then reduce heat to medium-low. Cook, swirling pan occasionally to keep mixture from bubbling up, until thickened, about 8 minutes. Let caramel cool slightly (it will continue to thicken as it cools).Step 3Meanwhile, pat fish dry, then season with salt. Heat oil in a large nonstick skillet over medium-high. Cook fish until flesh is opaque, cooked through, and flakes easily with a fork, about 3 minutes per side.Step 4Divide rice among plates and top each with a fillet. Spoon warm caramel over. Top with white onion, mint, and cilantro. Serve with reserved lime wedges for squeezing over.How would you rate Turmeric Caramel Cod?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleWife can't have citrus, so I subbed Pino grigio for the lime juice. Subbed a squirt of harissa for the cayenne. Very tasty !! AnonymousTexas3/7/2022Delicious! Used Cod and made sauce with only 1 tsp of turmeric and reduced for about 15 minutes. Added cucumber to mint and white onion (which I let chill in cold water for 15 minutes to remove the bite) and served all on top of an lemon/herb Israeli cous cous. Will definitely make again!drjazzSouth Orange, NJ2/22/2022what wine would you pair .....we have some light sicilian reds (good with seafood & on the med) ; or a french white or something else? Kelley LangHouston2/19/2022We made this last night using Sablefish and thought the recipe was stunningly delicious. I halved the recipe for the two of us. And only drizzled about half of the sauce over the fish. I didn't use all of the sauce, as we served it with seasoned potatoes instead of rice and didn't want the potatoes to become part of the sauce experience. This is a recipe I would make again. Lea2/12/2022This recipe is heavy on the turmeric, but I added a little extra lime juice (maybe 1/2 tsp?) and salt to taste, and combined with the fresh herbs, fish, and rice, my husband and I loved it. I subbed a few shakes Aleppo pepper for the cayenne.AnonymousChicago, IL2/8/2022As reviewers suggested I made this with only 1tsp turmeric. It was edible, but not a sauce i wanted more of. After reading reviews I made this recipe out of curiosity, but it’s an odd one. Looks beautiful, tastes meh. AnonymousOregon2/6/2022Love this sauce. Second time I made it divided the citrus 2/3 lime, 1/3 lemon, reduced the turmeric to 1 tsp and added some ginger. Delicious.Monica Toronto2/4/2022We made this recipe as published and have it earmarked for Regular Rotation. Delicious. Practically makes itself. Easy to prepare and fast. CBB...Couldn't Be Better. Taste is funny thang' , ain't it..Jerry HymanBrevard, NC2/4/2022It was a blind leap of faith to even try this concept. I followed the instructions exactly. It just didn’t taste good. Caramel is great on plenty of foods, but not fish. Turmeric is great in curry, but not in caramel on cod. Jim LWaynesboro, VA2/2/2022I wanted to love this - but my \"caramel\" never set up - and the tumeric was a lot!  will try again, but will probably have to cook it longer, and use less tumeric.\nAlliePhilly, PA2/1/2022I so wanted to love this recipe but the caramel needed a lot of tweaking. I think part of the problem is the \"4 limes\" as I happened to get super juicy limes (which literally never happens to me or to limes), so I ended up with A LOT of lime juice. The other issue is the amount of turmeric, a whole tablespoon is a lot. So my caramel sauce ended up tasting basically like limey turmeric, and I had to add more sugar to get it to taste OK. I had expected it to taste more like a turmeric-y, sweet teriyaki but it just tasted like tangy turmeric (similar experience to when I first tasted Turkish Delight and it tasted nothing as I'd imagined from reading \"The Lion, the Witch and the Wardrobe.\"). The combo bite of the cod, sauce, rice and onion/mint/cilantro was quite good; the accouterments definitely helped balance out the sharp flavor of the caramel. That said, I probably won't make this again. Clare KLos Angeles, CA2/1/2022Thanks to the other reviews, I made this with only 1 tsp of turmeric & it was delicious!  Based on the reviews, I almost didn't make it & I'm glad I did. It was a big hit!AABoston, MA1/29/2022Made this last night and based on the reviews pulled back a touch on the turmeric, and enjoyed it very much. The flavor profile was spot on with how it is described: “sticky, savory, and sweet condiment inspired by Vietnamese fish sauce caramel.” I’m frankly surprised by a lot of the reviews. Look at the description and ingredients—what did you expect? It was an easy and tasty recipe and the herbs and onion brought it all together. I’ll make it again. CollinNutley, NJ1/29/2022Is the TBSP of turmeric a typo??? I followed the recipe but holy hell that is a LOT of turmeric. I found the sauce to be tolerable at best. At first taste I wanted to throw it away, though it grew on me a bit. But only a bit. The turmeric was so overpowering - and the sauce has quite the kick from the cayenne. This was in the \"family meal\" section of the magazine, which, LOL, if I were to feed this to my child he would never want to eat my cooking again. Good thing we had a backup plan for him.LauraPortland, OR1/27/2022This was quite possibly the worst recipe I ever tried from a cooking magazine (in 25 years of subscriptions).   The sauce tasted like tainted cough medicine, and had to be thrown away.\n\nWhat is going on there at BA?   I don't like the magazine or recipes as much as I used to, in general.  However, this \"took the cake\"... how many people at BA actually tried it before it went to print?\n\nJe'foodSeattle, WA1/24/2022Explore Bon AppétitDinnerMainEasyWeeknightCodFishSeafoodTurmericHerbs & SpicesFryNut-FreeGluten-FreeDairy-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Kendra Vaculin"]}