{"id": "7a2e6f1ba34f38600e1e59e1ed515c21", "url": "https://www.bonappetit.com/recipe/cold-miso-sesame-noodles", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Cold Miso-Sesame Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCold Miso-Sesame NoodlesBy Claire SaffitzMarch 27, 20184.5(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThis recipe for cold miso-sesame noodles yields about 10 cups, which is...generous for four people. Fortunately, cold noodles like these make a killer next-day lunch, no reheating necessary. (Then again, if you eat noodles like we do, leftovers aren't really an issue.)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEACitrus Reamer$5.99 At AmazonGlass Measuring Cup$19.99 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonMicroplane$16 At AmazonTongs$13 At AmazonColander$11 At AmazonIngredients4–6 servingsKosher salt1Fresno chile4Persian cucumbers4scallions3limes½cup mild miso4tsp. toasted sesame oil4tsp. light brown sugar1large garlic clove⅓cup grapeseed or other neutral oil1lb. spaghetti or thin wheat noodlesToasted sesame seeds (for serving)PreparationStep 1Fill a large pot two-thirds full with water. Bring to a boil over high heat. When water starts to steam, toss in a small handful of salt.Step 2While you wait for the water, do some of your prep: Cut 1 chile in half lengthwise. Using your hands, pull out and remove stem and white ribs; discard. Tap out and discard any seeds, then finely chop chile. (Make sure to wash your hands with plenty of soap and hot water after handling chiles, or at least don’t rub your eyes!)Step 3Cut 4 cucumbers in half lengthwise, then slice crosswise into ¼\"-thick half-moons.Step 4Thinly slice 4 scallions.Step 5Cut 2 limes in half. Using a citrus reamer (or fork if you don’t have a reamer), juice limes into a small liquid measuring cup until you have ¼ cup; discard seeds. Cut remaining 1 lime into wedges; set aside for serving.Step 6Whisk ½ cup miso, 4 tsp. sesame oil, 4 tsp. brown sugar, and ¼ cup lime juice in a large bowl until smooth.→  Here are 5 more ways to use up a tub of miso.Step 7Finely grate 1 garlic clove into bowl and whisk to combine.Step 8Whisking constantly, slowly stream in ⅓ cup grapeseed oil until dressing is smooth and thick. Whisk in water 1 Tbsp. at a time until dressing is the consistency of heavy cream (it’ll likely take about 2 Tbsp.).Step 9When water is boiling vigorously, add 1 lb. pasta to pot and stir with tongs to prevent sticking. Cook according to package instructions.Step 10Drain noodles in a colander and rinse with cold water to stop cooking and remove any starch. Drain thoroughly, shaking off excess water, then add to bowl with sauce.Step 11Toss noodles to coat in sauce, then add chile, cucumbers, and scallions. Season with more salt to taste and toss again to distribute.Step 12Divide noodles among plates. Top with toasted sesame seeds and serve with reserved lime wedges alongside.Step 13Do Ahead: Noodles can be made several hours ahead. They tend to soak up a lot of the sauce as they sit, so if you want to make the day before, hold back half of sauce, cover, and chill. Toss with reserved sauce before serving.How would you rate Cold Miso-Sesame Noodles?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThis is a great recipe and works well as leftovers for lunch. If you seed the cucumbers you should not have the issue of too much cucumber water in the leftovers. You can also riff on this recipe and add different vegetables or shredded chicken or steamed or grilled shrimp even. Just a great recipe!!!ilove2cookDurham NC6/19/2021This was delicious, though I don't think it needs the extra salt at the end. I just added some to the cucmbers while assembling everything else and it turned out perfectAnonymous3/17/2021Fantastic and very easy to understand instructions. K LauritzenSanta clarita12/6/2020This was really good but as I was eating it all I could think of was \"I know this - I've had this before...\"\nAnd then it hit me and I went to the fridge to be sure - Yep! It's Red Shell Miso Dressing - LOL!AnonymousChicago5/17/2020So quick and easy, and tastes amazing!!!!! Make sure you cook your noodles past al dente for a softer, chewier texture. Its important because your noodles will stop cooking as soon as you rinse with cold water.  HeetDPhilly3/25/2020simple, delicious, can't be faulted. adding in a jammy egg makes it even better. niccsuxSingapore3/1/2020Really good, esp. the leftovers. Cook your noodles to Al dente and you shouldn't have trouble with soggy noodles. It's even better when you let the sauce soak into the noodles. I didn't have trouble with any watery cucumbers. This is a weekday staple in my house- it comes together fast, and you can substitute other veggies or buckwheat noodles to switch things up. Also great for camping and picnics, since there is no meat or dairy.sbangsPortland, OR12/24/2019Agree with below--these noodles are delicious though slightly watery the night of, but don't try to eat leftovers! They become a wet, soggy mess that is inedible. meghannashLos Angeles, CA11/7/2019Really great. I made this one in July for friends, and we really enjoyed it. Minimal prep and effort involved and the result is incredible.AnonymousColumbia, SC10/17/2019This recipe was great, until I tried to eat it the next day! Flavors were great, super delicious. But then when I took leftovers for lunch the next day, the cucumbers sitting with the noodles created this horrible, gloppy consistency and changed everything about the sauce. The texture is really unsettling now and the whole dish is like a cucumber gel. I would say if you are making this for the night of, it's an awesome recipe! But I would definitely advise against eating it the next day or using it as a meal prep option, since it doesn't hold up well and the water from the cucumbers really takes over. AnonymousNew York10/14/2019Great recipe but I substituted with what I had on hand. Used sesame paste/tahini instead of miso paste, rice noodles, added shredded carrots and cilantro also used low sodium soy instead of extra salt.AnonymousVirginia9/7/2019This was an umami bomb!  I agree it makes more than 4 servings.  We were 7 people at dinner and 2 of them took home \"doggy bags\" of the noodles for lunch the next day.  I'd say it serves 8 as a (very delicious) side dish.  Next time I'll try it with shredded chicken (as a main dish), and maybe lightly blanched snow peas instead of the cucumber.AnonymousNJ7/30/2019Sooooo good! It’s 96° today and these noodles were so refreshing. I had mine with grilled salmon and my husband had grilled chicken - went great with both! Will definitely make again.AnonymousNew Jersey7/29/2019Insanely delicious and so easy to make! I used dark rice miso since it was all I had on-hand and just put in slightly less and it was still delicious! Highly recommend.AnonymousQueens, NY4/12/2019This was really good, thanks for the recipe!Manserra1/24/2019Explore Bon AppétitPastaMisoCondiments, Sauces & PastesNoodlePasta & NoodlesSummerQuickWeeknight MealsMainDairy-FreeVeganVegetarianLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Claire Saffitz"]}