{"id": "7a3385dfa20051202025b027418ea2d2", "url": "https://www.bonappetit.com/story/what-is-matcha", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "What Is Matcha, the Powder Turning the World Green? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Matcha, the Powder Turning the World Green?Matcha is in lattes, smoothies, cocktails, and face masks—and that's just the beginning. But what is it (and why is it everywhere)?By Sarah JampelMarch 20, 2018FacebookTwitterEmailPhoto by Alex Lau, Prop Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.In January 2015, we wrote about the rapid rise of matcha on the American beverage landscape and posed the question, “Have we reached maximum matcha saturation?” Three years later, we're living amid matcha croissants, matcha custard pie, matcha face masks, matcha lifestyle guides and $50 cups of matcha itself. Clearly, the answer was \"No.\" But what is this powder we're whisking into green lattes, baking into doughnuts, blending into smoothies, and adding to our fish fillets?First, the basics.Matcha is green tea that has been specially grown and processed. Twenty days before harvest, the leaves are shaded from direct sunlight, which amps up the chlorophyll levels (and accounts for that Kermit green color) and increases the production of the amino acid L-Theanine, which is thought to promote relaxation even as the tea gives you a caffeine jolt. The leaves are hand-picked and laid out to dry. Once they are rid of their veins and stems, they’re stone-ground into what is finally matcha.The highest-quality matcha comes from Japan, where it’s been the focal point of ritualized tea ceremonies called chanoyu since the twelfth century. (The practice of milling tea leaves and whisking the powder with warm water originated even earlier, in tenth century China.)Why are you seeing it everywhere?Because matcha is incorporated into water (whereas other green teas are steeped in water), you consume the entire leaf—and thereby the full effects of its antioxidants, vitamins, and caffeine. Fans say matcha provides a calmer, more sustained energy burst than coffee or espresso, and since it’s less astringent, it mingles more readily with fruit, yogurt, and herbs in wake-up drinks like smoothies and juices.But matcha didn’t skyrocket to celeb status on health merits alone. As we said back in 2011, wheatgrass is healthy, too, but we’re not seeing it in every other bakery and café. Matcha has flavor going for it—grassy, pleasantly vegetal, and slightly bitter—and a brilliant natural color that makes baked goods (like rainbow cookies) stand out from the crowd in busy bakeries (and on Instagram).A few of the many matchas on the market\nPhoto by Alex Lau, Prop Styling by Emily EisenHow should you source it?Matcha comes in several grades that aren’t officially regulated, but the most important distinction is between ceremonial and culinary grade matcha. Ceremonial grade is made from the youngest, most tender tea leaves and is smooth and fine in texture. Use it when you’re planning to drink pure, unadulterated matcha or a top-notch latte. Culinary matcha is a less expensive and made from comparatively older leaves. It is best for baking, cooking, or making blended drinks where the matcha flavor is not imperative. (“Premium” or “select” matcha is somewhere in between the two major grades, and you can find organic versions of matcha in each category.)If you’re not sure if matcha will become a daily ritual, editor at large Christine Muhlke recommends buying a tin within the $14 to $18 range (save the under $10 matcha for baking and the over $30 for when you’re ready to commit). Some of Muhlke’s favorite brands are Chalait, Panatea, Matchaful, Kettl, and CAP Beauty, and Ippodo (seasonal releases are available at their Manhattan storefront on East 39th Street).The Tool Every Matcha Lover Should OwnSo essential (and beautiful) you’ll keep it on your counter at all times.View StorySenior food editor Claire Saffitz turns to Aiya matcha because you can buy a variety of different grades in different amounts. Price points vary—a 100-gram bag of Aiya culinary-grade matcha is around $20 compared to the same amount of ceremonial matcha for $56—as does quality.Even culinary-grade matcha is pricey. To extend its life, buy matcha in small quantities and keep it in a cool, dark place—even in your refrigerator.How can you use it?Beyond lattes and smoothies, you can take advantage of matcha’s grassy taste and verdant color in your cooking, baking, and cocktail-shaking, too.Use it as a natural food coloring in cake batter and icings, or make a less-sweet snickerdoodle by rolling the cookies in matcha-sugar. Infuse it into milk or coconut milk before you make ice cream, or incorporate it into a citrusy dry-rub for salmon or tuna. Sprinkle matcha over poached eggs to intensify their savoriness, or cream butter with matcha and granulated sugar, then spread it over toasted brioche. Or shake ½ teaspoon into a lemony, herbal cocktail.Because matcha is prone to clumping (that’s why you’ll see instructions to sift it before whisking in the water or milk), you’ll want to take the same precaution in your baking experiments: Saffitz suggests combining the matcha with other dry ingredients like sugar or flour to avoid bitter lumps in your dough or batter. And use it sparingly, she suggests: Even a few teaspoons can create an intense flavor (and color).Get to whisking:Iced Matcha LatteView RecipeBerries with Tea-Infused Cream and PistachiosThis fresh, simple summer dessert recipe gets a slight twist with addition of tea. If you’re not a fan of Earl Grey, try it with chamomile, matcha, or jasmine.View RecipeThe Greenest SmoothieView RecipeExplore Bon AppétitHealthyishMatchaJapaneseJapanTrendsRead MorecultureThe Pro Ballet Dancer Who's Not Afraid of a Little ButterBy Magdalena PuniewskaLifestyleThese Espresso-Free Lattes Will Make You Cheat On Your Morning CoffeeBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Sarah Jampel"]}