{"id": "7a330b7727ea1b471df3f16e46d4e0f7", "url": "https://www.bonappetit.com/recipe/master-vegetable-marinade", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Master Vegetable Marinade Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueMaster Vegetable MarinadeBy Anna StockwellJuly 10, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintTurn any roasted or grilled vegetable into a picnic-ready cold salad by marinating it for a few hours in this sweet-tart vinaigrette. Stir in your favorite fresh herbs just before serving.IngredientsMakes about 1 cup½cup extra-virgin olive oil½cup sherry vinegar or red wine vinegar2tsp. kosher salt1½tsp. honeyPreparationWhisk oil, vinegar, salt, and honey in a medium bowl to combine.How would you rate Master Vegetable Marinade?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleLove it!AnonymousAlabama6/5/2021Explore Bon AppétitMarinadeQuickEasyDairy-FreeGluten-FreeNut-FreeVegetarianKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}