{"id": "7a3554c4ea6ae3b362d51c9af7d54af5", "url": "https://www.bonappetit.com/story/friends-recipe-test-my-cookbook", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "What Happened When I Asked My Friends to Recipe Test My Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Happened When I Asked My Friends to Recipe Test My CookbookI got feedback I would never have heard from professional cooks—and it made all the difference.By Priya KrishnaApril 23, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailWhen I landed the deal for my cookbook, Indian-ish, two summers ago, my first reaction was the appropriate one: I screamed! I called my entire family! I bought myself a cake and ate most of it!But then I started panicking. I knew I could write the thing. But the recipes? That was an area where I had less expertise.Thankfully, my mother—a software programmer who’s a hell of a cook—is a gifted recipe writer, and this book is devoted to her recipes. The idea was that she would jot down all 100 or so of them, and that would be her corner. I would do the rest.Things started out fine. For a month and a half, my mother diligently wrote a few recipes a day after work. I set aside three weeks to test all of them, and then they’d be ready to publish. Simple, right?My first mistake was thinking that three weeks to test 100 recipes was enough time. I set up shop in my parents’ enormous Dallas kitchen and created an aggressive schedule of 4 to 6 recipes a day, with only one day off...total. Some of the recipes worked perfectly on the first try, but some were way, way off. Some I felt happy with, some my mom wanted to tweak after she saw my interpretation. The problem was that I hadn’t built in the time for a second or third cook-through. I had banked on all of my mom’s recipes working immediately, with minimal tinkering. But as anyone who develops recipes for a living knows—this is wildly unrealistic thinking, no matter how experienced you might be.I needed the recipes to be tested again, and I needed outside opinions. But my publisher had zero budget allotted toward recipe development (this is the norm, it is insane, and I could probably write a separate rant on that alone). I had read in an interview with Samin Nosrat, the author of Salt, Fat, Acid, Heat, that she had asked friends to test recipes versus hiring a tester, as it was a way to know how her recipes were being perceived by the average amateur cook, not a professional.Tester Colu Henry made the chile peanut rice (top), lauki (gourd sabzi, left), and quinoa shrimp pulao (right).\nPhoto by Colu HenryI was skeptical. How many people would volunteer to go out and buy ingredients, cook a recipe, and provide written feedback for a cookbook that’s still a work in progress?I tossed out a call for testers on social media, thinking maybe a few would express interest. Close to 200 people responded. This is not a brag. I really don’t have that many friends. It just turns out that people are excited to add something different to their meal routine—and get their name in the acknowledgements section of a cookbook.With the help of my friend, Ali Rosen, who used peer recipe testers for her cookbook, Bring It!, I put together two Google Docs: one where people signed up to recipe test (with dish preferences and allergies), and one where people answered specific feedback questions (Was the serving size right? Were the ingredients affordable and easy to shop for? Would you make this dish again?). I spent one agonizing day pairing people to recipes, making sure each dish had at least three testers, and then it was off to the races.An Indian take on ribollita, made by recipe tester Priyanka Naik.\nThe month during recipe testing was difficult. People had questions that were already answered in the recipe, dietary preferences they had failed to specify in the Google Doc, and rogue additions to the dishes that made the end result essentially unrecognizable. A few folks dropped the ball entirely and never made their recipes. One of my friend’s grandmothers, who tested two recipes, sent me an email that read: “I wanted to let you know that I tested the chickpea flour green beans, and they were disgusting.” Thanks?After all the feedback had been submitted, I poured a large glass of wine and went through everything. I highlighted the criticisms that appeared regularly, and made a list of potential changes and recipes that needed to be re-tested. I cut a few recipes out of the book that got mixed results—I wanted greatest hits only.In having my recipes tested by cousins, high school acquaintances, and former debate rivals (it’s true!) who were by no means expert cooks, I got feedback that I don’t think I would have heard from a professional: “This is good, but it’s not fancy enough for a dinner party, and too hard for a weeknight meal.” “I didn’t shell my peas because you never told me to.” “I only used one kind of squash because I was too lazy to buy the three varieties the recipe called for.” “Sea bass is expensive. I used cod.” “I ground my spices with the bottom of a whipped cream can, btw. Worked great.”Sam Gutierrez tested the cumin, asparagus, and tomato quinoa salad.\nPhoto by Sam K. GutiérrezThe whole process was a ridiculous amount of work, most of it menial. But it was worth every midnight hour. It was like doing a limited-release of my cookbook, and getting a chance to fix things before it reached a bigger audience. Knowing that three people tested each recipe (and for the most part, really loved them!) has eased my anxiety considerably. Barring any typos, I can give readers my word that they work. Plus, the exercise confirmed that a broad spectrum of home cooks—not just other Indians—were excited to work with the spices and learn the basics of the food I grew up eating.What’s more, I now have this group of people who are, in a personal way, invested in the cookbook. They helped make it happen, and they’ve been some of my loudest cheerleaders. Some of these people I hadn’t spoken to in ten years. But they tested my recipes! They’re in my cookbook. They’re part of my community. And I couldn’t be more grateful.And by the way, grandma: I kept the green beans. I don’t care what you say. They are delicious!!!Buy It: Indian-ish by Priya Krishna, $17 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitIndianishCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-23", "author": ["Condé Nast", "Priya Krishna"]}