{"id": "7a36d07bebb7c67faea95bff17db4299", "url": "https://www.bonappetit.com/story/what-is-gochujang", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "What is Gochujang, the Spicy-Sweet-Funky Korean Chile Paste? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat is Gochujang, The Little Red Tub We Keep in Arm's Reach?Spicy, sweet, salty, funky—this Korean pepper paste brings it all.By Christina ChaeySeptember 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailIt’s hard to remember a time when we didn’t always have a tub of gochujang in the fridge. What started as an occasional tryst (spicy steak or the occasional ribs) has turned into a full-blown love affair: We’re constantly using this Korean fermented pepper paste (by the spoonful, not the cup) to add a boost of spicy-sweet umami to everything from stir-fried noodles to this (brand-new!) Slow-Roast Gochujang Chicken, which cooks on a bed of little potatoes that soak up all that hot-sweet schmaltz. But what exactly is gochujang? And how do you use it? We’ve got you covered.What is it?Gochujang, a fundamental ingredient in Korean cooking, is a thick and spicy-sweet crimson paste made from red chile pepper flakes, glutinous rice (also known as sticky rice), fermented soybeans, and salt. Traditionally, it’s fermented over years in an earthenware pot kept outdoors, during which time the starches in the glutinous rice are converted to sugars, giving the condiment its underlying sweetness. The chile peppers provide a healthy amount of lingering heat, while the fermented soybeans act as the miso-like ingredient that anchors gochujang's \"umami\" flavor.Gochujang plays nicely with kimchi in these saucy udon noodles.\nWhere can I find it?You can find gochujang paste in the condiments aisle of any Korean market, on Amazon, and at most well-stocked supermarkets. It's almost always sold in small, red square tubs (not to be confused with doenjang, another extremely popular Korean fermented soybean paste, which is commonly sold in beige square tubs). Commercial brands can come in varying heat levels and the packaging is often in Korean, so you may want to try a couple of brands before settling on your favorite. A small tub will run you about $5.And how should I use it?Gochujang's sweet-hot-salty flavor shines when it's used in moderation to add depth to all kinds of dishes, from stews and braises to marinades and sauces. Unlike sriracha or Tabasco, gochujang isn't meant to be used as a finishing sauce on its own—it's too aggressive. Instead, it’s used to complement rich meat dishes, like spicy pork or beef bulgogi or our new chicken recipe, and liven up starchy foods like winter squash or squishy Korean rice cakes.A gochujang-based dressing will make nearly any vegetable—steamed fennel included—irresistible.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelGochujang has such a potent flavor that you only need to use a bit to make a big impact. Start with a teaspoon at a time to make your favorite soups and marinades a little more complex (and fiery), or stir it into sauces and salad dressings: It adds a spicy-sweet kick to both vinaigrettes, like the one in our Steakhouse Salad with Red Chile Dressing and Peanuts, and creamy, dairy-based dressings, like the ranch riff in this Crispy Chicken Bowl. You’re likely to see gochujang cut with another ingredients, like sesame oil, crushed garlic, sugar, and/or soy sauce, any of which help to balance some of its intensity.And you can experiment with gochujang even without a fully-fledged, thought-out recipe. Take a cue from chef Sohui Kim: Balance your gochujang with sesame oil, honey, and rice vinegar, tasting as you go, then use it as a sauce for blanched or roasted vegetables. Or do like Alex Delany and mix it into a dressing for cucumbers and radishes, then serve it over a bowl of steaming white rice.Or make some tteokbokki, the irresistible saucy Korean rice cake snack—preferably right before you need to ask your friend to help you move out of your sixth-floor walk-up apartment.This chicken will also earn you favors:Slow-Roast Gochujang ChickenThis isn’t the crisp-skinned, high-heat-roast chicken you’re probably familiar with. Instead, it’s a melt-in-your-mouth tender, schmaltzy, slow-roast version.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "Christina Chaey"]}