{"id": "7a40666fe8e5e51c48fe6317288eae60", "url": "https://www.bonappetit.com/story/choc-bar-puffs", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "“Choc Bar Puffs” Are As Close to Homemade Chocolate Croissants As I’m Going to Get | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking“Choc Bar Puffs” Are As Close to Homemade Chocolate Croissants As I’m Going to GetNadiya Hussein’s version requires only three ingredients (which is about all I have energy for).By Sarah JampelNovember 24, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.It’s a sign of the times that out of all of the delicious-sounding recipes in Nadiya Hussain’s new book, Time to Eat—like Sticky Coconut Rice with Tempered Pineapple and Pizza Parathas (OMG) and Speculoos Cookie Sheet Cake—I immediately gravitated toward the simplest one of all. Nadiya’s Choc Bar Puffs consist of three ingredients, all of which are easily kept on hand (frozen puff pastry, chocolate bars, one egg), and require almost no equipment. Just flaky, buttery dough encasing melted chocolate, they’re maximum comfort for minimum effort, which is sort of the premise of Nadiya’s whole book, as well as her wonderful Netflix show of the same name.And while it would be dishonest to say that the era of project cooking has ended for me (in a fit of election-related anxiety, I made pizza, enchiladas, vareniki, and anpan over the course of one week), I can say that preparing complicated recipes, and then cleaning up the aftermath, has lost its glow. I’ve learned that just because I have no plans on Friday night (not this one, not the next one, forever and ever, amen) and can, theoretically, make croissants, that doesn’t mean I should make croissants. But the Choc Bar Puffs? They take an hour, max, and are as satisfying and impressive as anything I could bake entirely from scratch.To make them, start by defrosting two sheets of puff pastry (from one box of Pepperidge Farm or two of Dufour). I never remember to defrost puff pastry in the fridge overnight, so I just use the shortcut in this Spinach and Feta Tarte Soleil recipe: Put it on a baking sheet and watch it carefully. Meanwhile, break or slice eight chocolate bars in half crosswise so that you have 16 shorter pieces. The choice of chocolate is up to you, but you’ll want to make sure the bar is plain (not chock-full of nuts and other add-ins), meltable, and made from ethically harvested beans. (FWIW, I like Guittard, Valrhona, and Alter Eco.) Crack an egg into a bowl and whisk it to make an egg wash.On a lightly floured piece of parchment paper, roll out one sheet of puff pastry (you can keep the other one on the baking sheet; stow in the fridge if it’s getting sticky). Your goal is to get the dough big enough that it can fit 15 of the chocolate pieces—five across and three down—with about ½ inch of pastry in between. (Yes, you will have one extra chocolate bar half. I’m sure you know what to do with that.)Once the chocolate is snug on its squishy mattress, transfer the pastry to a baking sheet (parchment and all), shove it in the fridge, and roll your second piece. You want it to be slightly bigger than the first one—it’s going over the top. Take the baking sheet out of the fridge, arrange the chocolate pieces, then brush all of the visible dough with egg wash. Egg wash is the glue that holds the pastry sheets together, so be diligent. Place the second piece of pastry on top of the first and press gently so the dough adheres on all four sides and in the chocolate gaps. Let the baking sheet hang out in the fridge while your oven heats to 400°F.Final stretch! Transfer the pastry-chocolate sandwich to the cutting board (again, use the parchment to assist you), trim the perimeter so it’s neat, and cut between all of the chocolate bars so that you have 15 rectangles. At this point you can freeze the pastries (in a single layer on a lined baking sheet; transfer to a bag when frozen solid) if you’re not ready to bake them. Otherwise, distribute them among two parchment-lined pans, brush generously with egg wash, sprinkle with flaky salt (optional but recommended), and bake for 20–25 minutes, rotating the pan halfway through, until deeply golden and delightfully puffy. (Once they’re cool, you can also freeze them at this stage.)Dust any you’re going to serve with cocoa powder (also optional but recommended) and eat while slightly warm so that the chocolate is gooey. Dip them in hot cocoa! Save some for breakfast! They’re almost like chocolate croissants.Maybe one day I’ll feel motivated to make my own puff pastry to stuff with chocolate bars. But for now I’m taking Nadiya’s cue and doing what’s reasonable and easy and just as delicious. Forget the elaborate cinnamon rolls—these are my holiday breakfast plans.Time to Eat: Delicious Meals for Busy Lives: A Cookbook$27 at AmazonExplore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-24", "author": ["Condé Nast", "Sarah Jampel"]}