{"id": "7a4fc0e1cfba0c1c6488b24e2af54a26", "url": "https://www.bonappetit.com/story/calculated-industries-kitchencalc", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "This KitchenCalc from Calculated Industries Makes Everything I Do in the Kitchen Easier | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Calculator Makes Everything I Do in the Kitchen EasierI’ve been cooking professionally for a decade, and even I don’t have most conversions memorized.By Ryan McCarthySeptember 9, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.A little bit of control in the kitchen goes a long way. Anyone in the business will tell you that a day that goes by without even a minor problem is a rarity—so savor it while it lasts. Chefs and bakers constantly strive for consistency, and many of us are classic type-A personalities: organized multitaskers who strongly dislike inefficiency—or, say, literally anything that does not go exactly as planned. This is precisely why I love KitchenCalc (Models 8300 and 8305) from Calculated Industries. It gets me.Calculators are, by nature, dependable. That’s why we love them! Push buttons: get answers. Repeat. In a kitchen calculators are used to adjust recipes to consistent units of measurement. You know the (dreaded) drill: cups into milliliters, pounds into grams, and tablespoons into fluid ounces. It can be maddening for even the most proficient among us; absolutely no one wants to be converting units of measurement on the fly, especially when your hands are covered in flour and you just realized the sauce on the stovetop hasn’t been stirred in ages.The KitchenCalc converts every common food preparation measurement, be it liquid or dry. That means volume units (think teaspoons, cups, centiliters, gallons) and weight units (dry ounces, grams, kilos, pounds). It even converts temperatures and scales the number of servings, which means that the days of multiplying each ingredient from your go-to recipe are over. Hello, devoted meal preppers!It displays information in whatever style works best for you, including decimals, fractions, and metric. It completes 146 different conversions, and it has a built-in timer (!). It’s even great for coffee perfectionists—calculate your brewing ratio and set a timer for steeping in just a couple taps. French press purists, rejoice!The KitchenCalc comes in two sizes, handheld and countertop, and they both have a clear protective case to brush off inevitable splashes and spills. Does this make it the proud pocket-protector-wearing nerd of the calculator world? Yes! Does it help? It does! The handheld model is small enough to nestle in with the nonperishables on my pantry shelves; it’s always there when I need it, tucked between the canned tomatoes and jars of chile crisp.Cooking can be unpredictable. Plans change, problems arise. This little machine can help you get some predictability back.Ryan McCarthy is a professional chef and baker who lives in Providence, RI, and you can follow his cooking adventures on Instagram (@ryguymcc).Calculated Industries KitchenCalc$27 at AmazonExplore Bon AppétitHighly RecommendproductShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-09", "author": ["Condé Nast", "Ryan Mccarthy"]}