{"id": "7a68aeb3a1ddf3b9dd9893904dfcc156", "url": "https://www.bonappetit.com/recipe/cottage-cheese", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Cottage Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCottage CheeseBy Molly BazSeptember 4, 20184.2(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintAn instant-read thermometer is a must for this cottage cheese recipe, since the target temperature is a key moment in the process that you can’t really eyeball. You can double the amounts here to make twice as much, but keep in mind that it will take slightly longer for curds to set up and for mixture to reach 115°.  A note on the milk: don’t use milk labeled “ultra-pasteurized,” because it will keep the milk from setting.IngredientsMakes about 1 pint½gallon whole milk, not ultra-pasteurized and ideally locally sourced⅛tsp. liquid animal rennet2¾tsp. kosher salt, divided, plus more⅔cup buttermilk3Tbsp. heavy creamIngredient InfoRennet is an enzyme found in animals’ stomachs used to coagulate milk.Special EquipmentCheeseclothPreparationStep 1Gently heat milk in a large saucepan over low, stirring occasionally, until an instant-read thermometer registers 80°. Remove from heat, add rennet, and stir to combine. Cover pot with a tight-fitting lid. Let rest in a warm place (so milk will maintain room temperature) until curd is set, looks like the texture of silken tofu, and is just beginning to pull away from sides of pot, 4–5 hours.Step 2Using a sharp knife and inserting into pot, cut curd vertically into 1\" strips, then cut 1\" strips horizontally to create a grid pattern. Let sit 5 minutes.Step 3Line a colander with 2 layers of cheesecloth.Step 4Return pot to very low heat (as low as possible) and add 2 tsp. salt. Gently stir with a wooden spoon to break up curds. Continue to cook, stirring once every 5 minutes, until instant-read thermometer inserted into center of curds registers 115°, about 15 minutes.Step 5Pour curds into prepared colander set over sink and let drain until curds are room temperature, about 15 minutes. Transfer drained curds to a medium bowl. Add buttermilk, cream, and ¾ tsp. salt. Stir with a fork to break up curds and combine. Taste and add more salt if needed. Cover and chill at least 1 hour before serving.Photo by Alex LauStep 6Do Ahead: Cottage cheese can be made 4 days ahead. Keep chilled.How would you rate Cottage Cheese?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleLove the recipe. It is so simple. Other recipes make the process sound so involved that it scares people off from trying to make cottage cheese. I've made one batch already and and I am typing this review while the second try is setting. (-Dont worry, I will not be typing for 4-5 hours.) 😀Janet P.Edmonton, AB8/14/2021I LOVE cottage cheese...even as a small child. The dairy we used in Houston ( Westmoreland ) had an all Guernsey herd and made the most phenomenal cottage cheese. This recipe is close withe whole buttermilk. Thank you.Diane WCollege Station Tx2/10/2021Can I use vegetable rennet with this recipe?Ann FortAtlanta, GA4/27/2019I have a question regarding the addition of buttermilk in this recipe. Is it necessary? I'm not a fan and would like to avoid the sour tang if at all possible. Anonymous4/24/2019Are the degrees in Fahrenheit? It's kind of confusing 'cause 80° Fahrenheit seems kind of low to set curds.AnonymousTurkey9/10/2018Explore Bon AppétitAmericanButtermilkOther IngredientsSideSnackNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Molly Baz"]}