{"id": "7a8c21734e831409e431fa2f5df05cab", "url": "https://www.bonappetit.com/story/rent-week-egg-salad", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "A Rent Week Egg Salad Recipe for Anyone with Bills | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Egg Salad Recipe for Anyone with BillsJammy eggs, a mustard-y vinaigrette, and more dollars in your pocket.By Alex DelanyFebruary 7, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ve been waiting. For a lot of things, but most pressingly for someone to write some strict, straightforward guidelines that outline the acceptable places to consume egg salad. It seems as though a lot of people haven’t quite figured that out yet. Don't get me wrong: I love the stuff. But its aroma can be a little...much for public spaces. Since no such literature exists, I’ve taken it upon myself to come up with some starting points. They are as follows:1. You should not eat egg salad in a closed vehicle (especially trains and planes). Open air conveyances like boats and convertibles are acceptable, so long as they are safe. 2. You should not eat egg salad at your desk in an office. 3. Well...that's really as far as I’ve gotten. Just don't eat egg salad in an enclosed, public space. It’s a bad look. No, it’s the worst look. But you know where you can—and should—enjoy egg salad? At home. During Rent Week.Let’s do that. You thought I was just going to bring up egg salad and then tell you how to make French onion soup? No. I’m not here to deceive you. Smash the play button on this 1960 Something playlist (filled with tunes from the 60’s, an era that always makes me think of egg salad, and free of charge), and get those eggs out of the fridge.Well, actually, put the eggs down. My bad. We’re going to start by making some quick pickles. Pour about ½ cup of white vinegar in a small bowl, and whisk in 1½ Tbsp. of salt and 1 Tbsp. of sugar. Peel and thinly slice 2 shallots and throw them into the vinegar mixture. (You could use onion, too, if you don't have shallots lying around.) These will just sit in the bowl until we serve our egg salad. Don’t bother them. They’ll be fine.Photo by Chelsie CraigYou need to make eggs to make egg salad. That’s an inescapable truth. But this is not going to be your standard finely-chopped, spackling-esque mixture of (very) hard-boiled eggs and mayo. And no, there's not going to be celery in this egg salad. (Celery in egg salad is atrocious, IMHO.) We're making jammy egg salad, and to make jammy egg salad, we need jammy eggs.Wait. What’s a jammy egg? Is it some kind of retro, fruit-filled dessert old folks eat in England? Well, that definitely sounds possible, but not what I’m talking about. I’m talking about a boiled egg with the most beautiful yolk consistency possible—right in between hard-boiled and soft-boiled, with a partially-set, almost-runny center. That’s prime real estate, and it takes about 7½ minutes to get there. Boil a pot of water, and carefully lower 8 eggs into the jacuzzi. Start a timer set for 7½ minutes.Once your kitchen timer goes off, your phone alarm rings, or you count to 450 aloud, transfer the eggs to a bowl filled with ice and water. We’ll call this an ice bath. Putting your eggs in the ice bath for a few minutes makes them a hell of a lot easier to peel. Plus, it’s just cool to drop the term “ice bath” in casual conversation. It makes your kitchen seem a lot more well-equipped than it is. You don’t have to tell anyone that an “ice bath” is just “a bowl of ice water.”Photo by Chelsie CraigWhile the eggs are chilling, make some dressing. The dressing for this egg salad is extremely simple, essentially a cheater’s version of a mustard vinaigrette. I don’t always look down on cheaters. Sometimes, a cheater is just a misunderstood innovator. This dressing uses three ingredients that you should have available at just about any time: lemon juice, Hellmann’s mayo, and mustard. For the mustard, whole grain dijon is preferable, but anything besides classic ballpark yellow will work just fine. Mix ¼ cup mayo, 3 Tbsp. whole grain mustard, a ½-lemon worth of juice, and a bit of chopped fresh parsley (if you're feeling fancy) together in the bowl.Crack and peel your eggs, and cut them into quarters, lengthwise. Oh, not all of your eggs are picturesque? That’s cool. I don’t care. The dressing doesn’t care. The eggs don’t care. We’re not on a photoshoot here. This is real life.Approach the mixing of the eggs and the dressing in the same way you’d approach talking about your passion for writing Star Wars fan fiction on a first date—with extreme caution. We want the eggs to stay intact, with just the runniest parts of the yolk mixing into the dressing. Use a spoon to move the dressing over the egg quarters, adding a sprinkle or two of kosher salt as you go.Photo by Chelsie CraigNow, let’s put that egg salad on something. I like mine of some toasted Italian bread. The really basic, white stuff, crisped on the outside and fluffy on the inside.You’re eating eggs tossed in mayo. Health isn’t exactly the name of the game here, but if you’re the Healthyish type, ditch the bread and go for a crisp piece of chilled romaine lettuce. You might be thinking, oh that’s kind of a lame move. It’s not. The refreshing texture of the lettuce is actually really nice with the egg salad. Some (most notably Basically editor Amiel Stanek) would call this hand salad. I would agree.Top the egg salad with a little bit of that leftover parsley, some flaky sea salt, and some of those pickled shallots. Whoa what are we looking at here? This is egg salad? It sure doesn’t look like it was teleported in from some '60s-era sandwich counter. It looks...well...good. And guess what, friends. It tastes that way too.  Just, please, don't be the person that brings this on the bus.In more of a Rent Week chicken mood? I gotcha:These Crispy Chicken Thighs Are the Only Way to Start the YearChicken thighs, with garlic-honey, are here for the first Rent Week of the year. Breathe. You're in a space now.View StoryExplore Bon AppétitBasicallyegg saladEggToastLettuceRent WeekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Alex Delany"]}