{"id": "7a90574092b7926cdc1dd7a19e413ead", "url": "https://www.bonappetit.com/story/never-fail-ina-gartens-zucchini-pancakes-recipe", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Carve This Zucchini Pancakes Recipe Onto My Tombstone, Because It's That Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Can Carve Ina Garten's Zucchini Pancakes Recipe Onto My TombstoneThe world needs to know about these 5-ingredient veggie-packed pancakes.By Alyse WhitneyMarch 9, 2018FacebookTwitterEmailPhoto by Quentin BaconFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: the zucchini pancakes recipe that associate web editor Alyse Whitney just couldn't live without.Ina Garten's zucchini pancakes recipe inspires a Dr. Seuss-esque poem in me. I would eat them in a boat (fishing for fluke with Jeffrey). I would eat them with a goat (whose fresh cheese is sold at Cavaniola's, her favorite cheese shop). I would eat them in the rain, and in the dark, and on a train to East Hampton. And, it so happens, they are green and would go well with eggs and ham. (Sorry.)But you didn't come here for poetry—you came here for a recipe. It's originally from her 2006 book Barefoot Contessa at Home and was cooked on her Food Network show, but I don't need to Google it anymore; I have it memorized from making it a few times a month for the past few years. Grate two medium zucchini and about ¼ of an onion into a bowl, add 2 beaten eggs, 1 tsp. baking soda, 1 tsp. salt, a few grinds of black pepper, and ⅓ cup of flour, and stir. Unlike most zucchini recipes that require you to drain the shredded veg before adding other ingredients—including Bon Appétit's fritters, which are also great—the water from the zucchini actually helps thin the batter to the perfect consistency. If the mix looks too thin, add more flour, one tablespoon at a time, until it's the consistency of breakfast pancakes: pourable, but a little thicc.These fritters require wringing out the water from the zucchini—Ina's don't. Great for lazy cooks.\nChristopher TestaniTo cook, heat equal parts butter and vegetable oil (about a tablespoon each) in a skillet over medium heat. I'll drop a small pancake into the pan to test for seasoning, but if I'm lazy or low on time, I go for it and sprinkle with extra flaky salt at the end. Ina says (yeah, we're on a first name basis, NBD) to cook for 2 minutes per side, but that depends on the size of your zucchini pancakes. I make mine about ¼ cup each so that a serving of two is enough for a meal. But you can make smaller ones as appetizers or a side dish. I often double the recipe, especially in summer when zucchini are fresher, larger, and more bountiful at the market, but the best part is that you can always find mediocre zucchini at the grocery store. So you can always have these pancakes.They're great for meal prep, a quick dinner, or an easily-reheatable breakfast. They get crisp around the edges and puff up a bit when they first come out of the skillet, but even after microwaving or putting them in the toaster oven they remain tender in the middle (the zucchini barely cooks) and a little eggy in flavor. Putting another fried egg on top wouldn't hurt, though. Other great additions are a sprinkle of Parmesan cheese, a drizzle of simple yogurt sauce, or my favorite weird twist: full-fat cottage cheese with plenty of salt and pepper. (I don't want to know what Ina would say about that one.)Buttermilk pancakes will always hold the No. 1 spot in my heart, but still, I will eat zucchini pancakes here and there. I will eat them anywhere. What can I say? These pancakes are my muse. Let them be yours.Another great way to use zucchini:Reprinted from Barefoot Contessa at Home. Copyright © 2006 by Ina Garten. Photographs by Quentin Bacon. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House, LLC.Explore Bon AppétitIna GartenNever FailBasicallyZucchiniPancakeRead MorecultureIna Garten’s Grocery List Includes Whiskey Sour Supplies and Impulse CookiesBy Alyse WhitneycultureIna Garten Can’t Live Without These 3 Kitchen ToolsBy Alyse WhitneycultureIna Garten Loves Daiquiris, Hates This Food TrendBy Rachel KartenrecipesOur 41 Best Zucchini Recipes for Using up All Your Darn ZucchiniGallery41 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-09", "author": ["Condé Nast", "Alyse Whitney"]}