{"id": "7a96a3b2fd33dd5ea2aedd730736c7c1", "url": "https://www.bonappetit.com/story/instagram-supper-club", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Want to Join These Dinner Clubs? Slide Into the Chefs' DMs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWant to Join These Dinner Clubs? Slide Into the Chefs’ DMsNo longer bound by traditional brick-and-mortars, chefs are using social media to rethink their dream dinner experiences.By Bettina MakalintalOctober 14, 2021FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmailThis story is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.Strangers have been showing up at Imana’s house for dinner for almost a year now. On Friday and Saturday nights, her panoramic Oakland patio transforms into Hi Felicia Supper Club, a $225-per-person fine dining experience that includes seven courses and beverage pairings. The dinner series—which has counted the farm-to-table chef Alice Waters among its guests—is “the most fun I’ve ever had,” says Imana, a longtime Bay Area hospitality worker who uses her first name only.Until local press caught on, people heard about Hi Felicia through Instagram or from friends in the know. The dinner club doesn’t have a website with a menu or a public phone number for reservations—only open DMs. “I give almost no information to people,” Imana explains. “You just show up at someone’s house and it turns out to be this really carefully curated, whimsical experience overlooking the hills of Oakland.” Hi Felicia is sold out through the end of the year and has, to her surprise, become a place people choose for their birthdays, anniversaries, and special celebrations. According to Imana, she’d have none of that business without Instagram.Instagram contentThis content can also be viewed on the site it originates from.Over the past decade the food world has come to rely on Instagram: It’s where new projects are announced, where diners save places to add to their “must try” lists, and where everyone shows off what they’re eating. But, especially during the pandemic, the platform also opened new doors, allowing laid-off pastry chefs to start successful micro-bakeries, mutual aid food projects to find communities, and pop-up restaurants to advertise meals to long waitlists without a middleman. And, as Imana found, the platform has helped pop-up dinner clubs gain traction as their customers look for novel experiences and opportunities to gather. Gaining devoted followings, these Instagram-promoted events offer up exciting potential for alternative models of dining—their hosts don’t need a website, much less a brick-and-mortar location or a specific culinary resumé, to make it work.Nala is the name of the large table around which Misha Lasoff and Pearl Banjurtrungkajorn host their Her Name Is Nala dinners. It seats 10 guests, the pair’s ideal number, who gather around family-style food inspired by whatever looks good that week at the farmers market. When Lasoff and Banjurtrungkajorn became roommates in New York, they knew they wanted to throw dinner parties; neither of them worked in food professionally, but they had a passion for cooking together at home. Assuming the table would be so essential to their shared lives that it would be like another roommate, they dubbed it Nala after The Lion King films. “We wanted to feed our guests with the maternal energy that the mother lion feeds her little cubs,” says Banjurtrungkajorn.Instagram contentThis content can also be viewed on the site it originates from.The pair had their first official dinner in late 2019, mostly made up of friends. Giving the table her own Instagram page started as a bit of a joke, but after those first guests loved the events, they realized Her Name is Nala had potential as a dining club focused on intentional eating, gathering, and hosting. The project grew into early 2020 as friends brought plus-ones, as word-of-mouth spread about the Nala dinners, and as the dining club picked up followers online. The inherent vetting that comes with hearing about Nala’s events from friends or from a fairly self-selecting pool online means there’s a level of trust to their dinners, Banjurtrungkajorn explains. People arrive knowing that even if you don’t know the person next to you, Nala will be an intimate experience similar in feel to a family meal, she says.The pandemic forced a pause in Nala’s gatherings, but as conditions improved in New York, increased interest in the dinners led to weekly at-home events and twice-monthly collaborations with brands such as Marly Garden and Alimentari Flâneur. Now, they often wonder how they can accommodate every person who DMs them to come to a dinner. “It’s really nice and lovely having our friends all at a table,” says Lasoff. “But for someone who doesn’t know us to reach out and have interest in coming? That’s such a praise.” Ultimately, the pair hope to grow Nala into a full-time venture with similarly formatted dinners happening across the globe.Restaurant workers Katie Yun and Sachi Nagase have been cooking together since their college project, the Sprouted Radish Supper Club, in 2016. That spun off into their New York–based food business, Both And, in 2017, which has been at various points an art collective, a pay-what-you-wish dinner series, and pop-ups at spaces like the rooftop farm Brooklyn Grange and the bar King Tai. Though Yun and Nagase have worked in traditional restaurants, Both And felt like a way to “explore new techniques and different ways of making food for people, while also really trying to take care of people and take care of each other,” says Yun, who previously worked as the “Dreamweaver” at Eleven Madison Park. That their first event was cooking soup for 400 people at Queer Soup Night, with proceeds funding immigrant families, speaks to their idea of food as community care, Yun says.Both And’s pay-what-you-wish dinners, which they ran out of their apartments twice-monthly before the pandemic, allowed them to extend the attention and care of fine dining to friends who worked at cafés and industry folks who couldn’t afford to eat at the types of restaurants which employed them. (When the pandemic put their dinners on hiatus, they transitioned to mutual aid food work, like cooking meals to stock community fridges, primarily through connections from Instagram.) Unlike the hierarchy of fine dining kitchens and the frequent disconnect between guests and the people making food, “Both And was a way where we could kind of reimagine what we wanted [dining] to be,” Nagase says.Instagram contentThis content can also be viewed on the site it originates from.A similar ethos guides Imana of Hi Felicia. Having worked front-of-house in restaurants like the Michelin-starred Coi, she wanted to carry into her 28-seat home restaurant the most magical components of fine dining: the perfect plates, the elements dolloped and poured in front of you, the attention to detail that ensures the forks and napkins are placed just right. But she didn’t want to totally replicate traditional fine dining; she wanted to leave parts of it behind, like the hierarchies and the racism and sexism the industry’s known for. “There was no seat at the table for Black people, specifically Black women, in fine dining—so I wanted to create one,” she says.What Instagram, and its new wave of dinner club hosts, has helped prove over the past year and a half is the viability of breaking from tradition. “I think what’s amazing is that people are coming up with new models and new ideas, which is so important,” says Yun. This is of particular interest to diners, who’ve gotten used to constant novelty and new experiences to both try and to show off online. Of course, Instagram isn’t perfect: It algorithmically prioritizes people who are good at using the app, and a single picture of a dish can’t show all the work and people that made it come to life. But, Yun adds, the platform ultimately helps people who might not have a footing in the food world to access certain spaces and audiences. There’s certainly risk, time, and money tied up in starting a new dinner club online, but the barrier to entry is lower here than in other food businesses.While a roving dinner series might be the end goal for some, it can prove to be a step toward bigger things for others. In late September, Imana made an announcement about Hi Felicia: “It’s ‘brick-and-mortar’ time,” she wrote on Instagram. She’s now crowdfunding for a space in Oakland that’ll have the same small, intimate feel as her Hi Felicia dinners and which will, ideally, create opportunities for people who might also have felt excluded by fine dining. The transition to a traditional model does come with some internal conflict (“I kind of hate it,” she says), but she admits that the certain types of press or awards that really bolster a new business might not come without a permanent location.While her campaign is still in its early days, Hi Felicia’s hugely successful nine-month-long run has validated Imana. “I said I was done being treated poorly in the industry,” she says. “I said I was going to change it. And I did it.”Explore Bon AppétitDinner PartiesPartiesCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Bettina Makalintal"]}