{"id": "7aad132cc1c80bf33216330918c06598", "url": "https://www.bonappetit.com/story/totes-toast-tuna-time", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "It’s Called TOTES Toast: Tuna, Olives, Tomato, Eggs, Shallot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt’s Called TOTES Toast: Tuna, Olives, Tomato, Eggs, ShallotThis new recipe brings together two of my favorite things: toast and abbreviations.By Emily SchultzMay 22, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Molly Baz, prop styling by Emily EisenFacebookTwitterEmailAnyone who has talked to me IRL or online knows I’ve spoken in abbreviations since the beginning of time, a.k.a. 1993. I’d spend hours crafting my buddy profile in neon-pink Impact typeface that would have all of my BFF’s names underneath. I’d write HAGS in the yearbook of that kid I had that one class with that one time. I’d write LYLAS in the countless cards of Hebrew school friends whose bat mitzvahs I’d attend. And a few years later, I get to use this acquired skill as the associate social media manager of Bon Appétit. Even my mom cannot escape it.My mom has no time for that nonsense.\nSo when I heard Molly Baz talking about this thing called TOTES toast, I was excited AF to make it. TOTES stands for tuna, olives, tomato, eggs, shallot. It’s a niçoise salad, hold the lettuce, perched atop a piece of crusty sourdough bread, living its truth.If this were 2010, we would be in the version of Facebook that let you have a teeny-tiny bio underneath your profile picture, and mine probably would’ve said something like <3 ToAsT LoVr <3 because I love toast THAT much. I’ve written about it on BonAppetit.com, posted it on my Instagram, and gotten several looks from coworkers when the smell of burning breadcrumbs wafts through the office at 10:30 a.m.I prefer to eat TOTES toast at home because it’s piled high with fun things. It’s messy. But first, we’re frying up some bread because it needs to be sturdy enough to support all of the things that are about to go on top of it.Yes, this story comes with memes.\nThen we need to mix up the paprika-spiked mayo that consists of mayo (Hellmann’s or Duke’s only, plz), paprika, grated garlic, and red wine vinegar. The red wine vinegar cuts the fat in the mayo, and the spice in the paprika wakes up your senses enough to remind you of the privilege that is eating TOTES toast. Next, toss thinly sliced shallots and tomatoes in some lemon juice; I use cherry tomatoes here because it isn’t peak tomato season in NYC.Other toppings: cured black olives from the antipasto bar at Whole Foods, olive oil–packed tuna (the good stuff), and 8-minute eggs. At this point, I took a photo of my mise en place for my Instagram story.Order of assembly: mayo, tuna, olives, tomato-shallot mixture with some of the juices, sliced eggs, flaky salt, and pepper.Finish it with your favorite torn herbs and a glug of EVOO. Turn on your favorite show (Jersey Shore season 3) and tell your friends you’ll TTYL.And if you’re thinking that all of these acronyms are getting to be too much, let me share this inspiring message exchange between Bon Appétit editor in chief Adam Rapoport and me after discussing a very pressing Instagram matter:Our editor in chief is quite insightful.\nLike an acronym, life is short! Save the time you spent by skipping all of those full-length words and make some toast.Here’s the recipe:Niçoise ToastFried bread, with buttery oil-packed tuna on top. This is what you call dinner toast.View RecipeRelated: The Canned Tuna I Bring to the Beach (Yes, the Beach!)Explore Bon AppétitTunaToastWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Emily Schultz"]}