{"id": "7abb20c49e38b7207578fd473ff90482", "url": "https://www.bonappetit.com/story/simply-julia-diet-culture", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "How Writing a Comfort Food Cookbook Helped Me Break Free From Diet Culture | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Writing a Cookbook Helped Me Break Free From Diet CultureIt hit me one day like a splash of cold water in the face. I had only ever felt two things in my life: happy or fat.By Julia TurshenMarch 2, 2021FacebookTwitterEmailPhotography by Winnie AuFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.For most avid home cooks, Julia Turshen needs no introduction. When she’s not in her Hudson Valley kitchen making food, the writer, podcast host, and bestselling author is talking about it. In this essay, slightly adapted from her new (and very Healthyish!) cookbook, Simply Julia, Turshen confronts the negative feelings she’s harbored toward her body for years. In having the privilege to write a book that’s all about healthy comfort food, I think it’s important to be honest about my feelings about my own body while suggesting all sorts of things you can cook to feed yours. It’s important, also, to acknowledge that these feelings are evolving.Related: The Myth of Healthy Eating with Christina Chaey and Vanessa RissettoContentThis content can also be viewed on the site it originates from.For as long as I’ve always loved food, I’ve also been as conﬂicted about consuming it. A few years ago it really hit me how much time and energy I had spent feeling bad about myself, especially about my body. And that made me feel really sad. So I decided to start untangling the knot. I knew it wouldn’t magically untie itself just because I wanted it to. I had to get some help.What did that help look like? So many things. I tackled hard stuff in therapy; I changed who I follow on social media to learn more about people who had broken free from diet culture; I researched what diet culture actually is; I read books and listened to podcasts about intuitive eating and shame and vulnerability; and I started to speak more openly to my closest friends about their relationships to their bodies. I began to talk honestly with my mother about how much I absorbed from watching her not treat her own body with kindness. I stopped (I’m trying to stop) asking my wife, Grace, to reassure me that my body is okay. I hid my scale in a closet, and then, one day when I finally felt ready, I threw it away.I’ve had a handful of breakthrough feelings throughout this ongoing shift. One was, after many gentle suggestions, Grace finally got me to watch The Matrix and it’s given me the most helpful framework to think about diet culture. Now when I think about it, a culture that prioritizes thinness and urges us to keep comparing ourselves to each other so that we’re left feeling really isolated, I simply think, Oh, that’s not actually real.Another major breakthrough was when I realized I had limited my range of feelings to just two options. It hit me one day like a splash of cold water in the face. I had only ever felt two things in my life: happy or fat. I remember feeling like a light switch had turned on in a dark room. Oh, that’s what’s been going on in here.For so long, whenever I felt fat, or what I deemed fat, it was almost always a way to describe anything other than happy. Not only had I equated “fat” with “anything other than happy,” I had set up a tidy, miserable binary for all of my feelings to fit into.How did I get to this restricted emotional place? Through the same roads so many people I know have also traveled. I inherited body image and weight issues; I internalized the bullying I experienced when I was younger when I was told repeatedly that I was fat and understood it to be an insult. What else? I unﬂinchingly accepted the idea that thin is ideal, and I put myself in close proximity with people who didn’t challenge any of this. I listened to doctors tell me I was overweight according to charts whose problematic origins I didn’t ask about, and I didn’t push for more information when they told me my blood work was great, but I should still lose some weight. I didn’t ask them why. I put my head down.It should not feel revolutionary to say, especially coming from the author of a cookbook that’s about healthy cooking, that fat does not equal bad or unlovable. But it’s worth saying.So how did I begin to dig my way out of this dark hole? I started to believe my wife when she said there was a version of my life that didn’t revolve around feeling bad about my body. I started to change who I was talking with and looking at and listening to. I followed the money and started questioning all of the programs and people who were telling me my life could be so much better if only you did this thing I am selling you. I realized they stay wealthy if I stay desperate. I dug into the things that made me feel all the things other than happy. I started to question how I measure happiness. I learned how many different, and more loving, barometers exist. I made an effort to stop using the word “should” (I even got a tattoo of it, crossed out, on my arm). I stopped equating “fat” with “bad.” I watched the “Fat Babe Pool Party” episode of Shrill on television so many times (written by Samantha Irby, one of my favorite writers, and developed by Lindy West) and went from crying to smiling.I became an observer of myself. I bought an “EMOTIONS” poster, the kind you see in little kids’ classrooms that list tons of emotions and depict a child making a face that represents each. I made myself go look at the poster to figure out what I was actually feeling in the moment and which emotions they were tied to.It turns out that the more I understand my range of feelings, and actually feel them, the more I get to know myself. I’m a more imperfect, silly, and complicated person than I ever knew. I screw up a lot. I bump into so many things all of the time, literally and figuratively. I rewrote this very essay at least a dozen times. And that’s okay.Just like cooking, I work on feeling my feelings on a daily basis. Sometimes it’s really challenging. Each time I willingly step outside of the framework I grew so accustomed to, I encounter things like pain, anger, sadness, embarrassment, and fear. All of those things that fall under “anything other than happy.” But I’m also encountering more love, joy, confidence, and satisfaction than I ever knew was possible. I am learning what it feels like to not merely accept my body, but to understand that there’s nothing wrong with it. To love it. To know that no matter how much space it takes up in the world, it’s worthy and I’m grateful to live in it.It should not feel revolutionary to say, especially coming from the author of a cookbook that’s about healthy cooking, that fat does not equal bad or unlovable. But it’s worth saying. There is nothing wrong with being fat. The only thing wrong is thinking that any person, living in any type of body, is less valuable than someone else.From the book SIMPLY JULIA by Julia Turshen. Copyright © 2021 by Julia Turshen. Published by Harper Wave, an imprint of HarperCollins Publishers. Reprinted by permission.Order your copy:Simply Julia: 110 Easy Recipes for Healthy Comfort Food$32 $21 at Amazon$33 $30 at Bookshop.org$33 at Oblong Books & MusicExplore Bon AppétitCookbooksHealthyishComfort FoodessayRead MorecultureThis Is the Winter for Grandma Cookbooks (You Know Which Ones I Mean)Gallery7 SlidesBy T.S. MendolaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-02", "author": ["Condé Nast", "Julia Turshen"]}