{"id": "7ac1ebb3d90dd988c51661c069be9507", "url": "https://www.bonappetit.com/recipe/smoked-trout-avocado-dip", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Smoked Trout-Avocado Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSmoked Trout-Avocado DipBy Lauren SchaeferMay 10, 20184.3(8)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIf you're not the kind of person who keeps canned fish in your pantry at all times, this is the recipe that will convert you. While smoked trout is great in this dip, any canned fish (think sardines, mackerel, or tuna) will work—just make sure it's packed in oil. Crackers optional. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonForkChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMicroplane$16 At AmazonSpoon$24.69 At AmazonSmall Bowl$13 At AmazonIngredients2 servings23-oz. tins smoked trout2scallions1lemon1Tbsp. mayonnaise1tsp. kosher salt, divided½medium ripe avocadoFreshly ground black pepperCrackers (for serving)PreparationStep 1Pour off excess oil from 2 trout tins, then place trout in a medium bowl.Step 2Thinly slice 2 scallions on a diagonal. Add half to bowl with trout; reserve remaining scallions for serving.Step 3Using a microplane, finely grate half of lemon into bowl with trout.Step 4Cut lemon into quarters and remove any seeds. Squeeze 2 quarters over trout mixture.Step 5Add 1 Tbsp. mayonnaise and ½ tsp. salt and toss gently to combine.Step 6Finely chop ½ avocado. Transfer to a small bowl. Squeeze juice from remaining 2 lemon quarters over. Season with remaining ½ tsp. salt.Step 7Top dip with avocado and a few grinds of pepper. Serve with crackers alongside.How would you rate Smoked Trout-Avocado Dip?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made this using home made canned smoked pike. It was delicious. I didn't need to add any salt because the smoked fish was already pretty salty. I did add a couple of cloves of chopped garlic. I think some fresh herbs would be good in season. AnonymousSouth Range, WI1/11/2021I have made this on multiple occasions for both family and friends and it gets rave reviews every time.  I do not make any modifications to the recipe at allRolltideCharlotte NC12/24/2020This is now our go-to tuna salad recipe!  I doubled all the ingredients for two 4 oz tins of fish (sardines, trout, and tuna - I've tried all three and they are all great!!).AnonymousTennessee 3/27/2020Explore Bon AppétitDipAvocadoVegetableSmoked TroutTroutFishSeafoodEasyQuickSnackStarterDairy-FreeNut-FreeGluten-FreeKetoNew Year'sBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-10", "author": ["Condé Nast", "Lauren Schaefer"]}