{"id": "7ad01159e8ebd8822ed6763236c488ec", "url": "https://www.bonappetit.com/story/what-is-tomato-paste", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "What Is Tomato Paste? And How Do You Unlock It's Full Potential? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Tomato Paste? And How Do You Unlock Its Full Potential?That little can or tube of tomato paste holds some serious flavor. But with great power comes great responsibility.By Alex DelanyFebruary 22, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Molly BazFacebookTwitterEmailWe’re not going to beat around the bush here: Tomato paste is kind of weird. The putty-like tomato gloop looks like something you’d find in a hobby shop or the dental care aisle of your drug store. Whether it comes in a little can or a tiny tube (also...weird), tomato paste can be hard to understand. But understand you should, because tomato paste holds a monumental amount of flavor.Q: What is tomato paste? A: Tomato paste is concentrated tomatoes. Yep, it's really just tomatoes that have been cooked down, then had the seeds and skins strained out, and then cooked down some more until it becomes  super dense and, well, paste-like. Tomatoes have a lot of bright acidity and umami flavor in their raw state, and when all of that pesky water has been cooked out the result is packed with the stuff. As is the case for most concentrated ingredients, a little can go a long way, which is why the cans are considerably smaller than can of sauce or crushed tomatoes. Some tomato paste is labeled as “double-concentrated,” which obviously means that the tomato is even more intense. A few ounces of the stuff packs a punch.You’ll definitely see seasoned versions of tomato paste at the store. Whether it’s basil, oregano, garlic, or any of the other usual suspects that get added to the tomatoes, it’s best to just skip those cans entirely. Go with the plain stuff and add the additional ingredients yourself. You’ll get fresher, more robust flavor and a general feeling of happiness. (Well, we do, at least.) And when it comes to a brand, we’re all about a can or tube of Mutti tomato paste, which happens to be double-concentrated. If you can’t find that at the store (and don’t want to order it online), a can of Hunt’s will do the job just fine.The secret to making tomato paste taste great is caramelization. You can’t just stir some tomato paste into a sauce or some vegetables and expect it to taste fantastic. It won’t. You’ll still get a sort of raw tomato flavor (even though the tomatoes are cooked), not even close to the umami-bomb that we’re looking for. The secret is to sizzle it in some olive oil or other fat until it turns brick red and starts to caramelize—usually about 5 minutes or so over medium heat. Once it goes dark and starts to stick to the pan you can just deglaze with some water or other liquid, scrape up any stuck-on bits, and go on your merry way.Yeah, that's what we're talking about. Vodka sauce.\nPeden + MunkWhich is where tomato paste shines: when it can be incorporated into a dish at the beginning of the cooking process, along with other aromatics, to add another layer of flavor. While pasta sauce (more specifically vodka sauce) is the first thing that comes to mind when we’re talking tomato paste, it can be a dark horse flavor-booster in a ton of other dishes. Stirring  some caramelized tomato paste into to chilis, sautéed vegetables, braised meats, soups, and sauces adds tons of savoriness, and ups the complexity factor in a big way. You can also add it to marinades for some color or mix some into your classic pizza sauce for a change of pace. Or, uh...paste. Sorry. We’ll see ourselves out.Caramelize some paste for those peppers, why don'tcha:Sausage, Peppers, and Onions SubsAin't no party like a sandwich party.View RecipeExplore Bon AppétitBasicallyTomato PasteTomatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Alex Delany"]}