{"id": "7ad7589e882dbcc3339d044c665c8f10", "url": "https://www.bonappetit.com/recipe/sticky-guava-barbecue-drumsticks", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Sticky Guava Barbecue Drumsticks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSticky Guava Barbecue DrumsticksBy Gabriella VigoreauxSeptember 6, 20204.2(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich EmailPinterestPrintEmailPinterestPrint“My mother (like many Puerto Rican mothers) has always had a copy of Yvonne Ortiz’s A Taste of Puerto Rico in our kitchen,” writes chef and recipe developer Gabriella Vigoreaux. “I can tell which dishes she’s made the most because the book just naturally falls open to those recipes. Only during quarantine have I started using it myself, marking new territory with soffritto stains on the pages my mother managed to keep pristine all these years. I turn to it when I want to taste my grandmother’s and great-grandmother’s cooking with half of the effort. One of my go-tos is Ortiz’s guava barbecue sauce. Ortiz's recipe is wildly simple (four ingredients) with a single sentence procedure: ‘Thoroughly combine all the ingredients.’ It takes about five seconds to make but instantly conjures memories of childhood trips to the island, stopping at a kiosko for a pincho de pollo (chicken skewer) and licking the sticky sweet sauce from off my little fingers. My version is nothing like the original but it still brings me back just the same. I’ve slathered this sauce on ribs and whole fish and used it as a glaze for pork belly, but I will always like it best with chicken. This is just to say, you might want to double it.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Bowl$13 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Pot with Lid$155 At AmazonWooden Spoon$6 At AmazonWire Rack$23 At BA MarketRimmed Baking Sheet$20 At Bon Appétit MarketInstant-Read Thermometer$35 At ThermoworksIngredients4 Servings1Tbsp. achiote (annatto) powder or paprika1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt1Tbsp. garlic powder1Tbsp. ground coriander1Tbsp. ground cumin2tsp. dried oregano2tsp. freshly ground black pepper8–12large chicken drumsticks or 4 thighs and 4 drumsticks (about 3 lb.)8oz. guava paste or jelly or quince paste12\" piece ginger2garlic cloves1canned chipotle chile in adobo½cup apple cider vinegar⅓cup spiced or dark rum3Tbsp. fresh lime juice3Tbsp. ketchup1Tbsp. soy sauce½tsp. ground allspicePreparationStep 1Mix together 1 Tbsp. achiote (annatto) powder or paprika, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, 1 Tbsp. garlic powder, 1 Tbsp. ground coriander, 1 Tbsp. ground cumin, 2 tsp. dried oregano, and 2 tsp. freshly ground black pepper in a small bowl. Generously sprinkle seasoning all over 8–12 large chicken drumsticks or 4 thighs and 4 drumsticks (about 3 lb.). Let sit while you make the barbecue sauce. (If you have time, arrange chicken on a wire rack set inside a rimmed baking sheet and let chill, uncovered, overnight.)Step 2Assemble your ingredients: Chop 8-oz. guava or quince paste into ½\" cubes (if using 8 oz. guava jelly, just add directly below, no need to prep). Peel and finely chop one 2\" piece ginger and 2 garlic cloves. Finely chop 1 canned chipotle chile in adobo sauce.Step 3Bring guava paste, ginger, garlic, chipotle chile, ½ cup apple cider vinegar, ⅓ cup spiced or dark rum, 3 Tbsp. fresh lime juice, 3 Tbsp. ketchup, 1 Tbsp. soy sauce, ½ tsp. ground allspice and ¼ cup water to a simmer in a medium pot over medium-high heat, about 5 minutes. Reduce heat to medium and continue simmering, stirring occasionally, until guava melts and sauce is thick but pourable, about 10 minutes. Scoop out ½ cup sauce and set aside for serving.Step 4If grilling, prepare a grill for medium-high heat. Grill chicken, turning occasionally, until lightly charred, 15–20 minutes. Baste chicken with guava sauce and continue grilling, turning and basting often (try to use most, if not all, of the sauce) and moving to a cooler part of the grill if you have flare-ups, until cooked through and an instant-read thermometer registers at least 165° (we like the extra tenderness of bringing it to 175°, so feel free to go a bit further), 8–10 minutes longer.Step 5If baking, place a rack in very top position of oven and remaining rack in the middle. Heat broiler. Line a large baking sheet with foil and set a wire rack inside. Arrange chicken on rack and broil, undisturbed, until charred in spots, 5–7 minutes. Remove chicken from oven and turn over. Broil until other side is charred in spots side, 3–5 minutes. Brush chicken with guava sauce. Reduce oven temperature to 350° and move chicken to middle rack. Bake 10 minutes. Turn over and brush with more sauce. Continue cooking, basting with more sauce every few minutes (try to use most, if not all, of the sauce), until an instant-read thermometer registers 165° (we like the extra tenderness of bringing it to 175°, so feel free to go a bit further), 20–25 minutes longer.Step 6Transfer chicken to a platter and let rest 5–10 minutes. Serve with reserved guava sauce for dipping.Step 7Do ahead: Sauce can be made 1 week ahead. Cover and chill.How would you rate Sticky Guava Barbecue Drumsticks?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleI tried this last week and it came so well. This is bang on and tasted so well!AnonymousIndia9/22/2020Literally. So. Good. \nThe guava barbecue sauce is incredible - sweet and slightly tangy. The chicken is super moist and juicy. This definitely will be a repeat. steph.pitsiToronto, Canada9/13/2020Made this last night and it was BOMMBBB! I will definitely be making this again. Finally a real #boricua writing Puerto Rican recipes. AnonymousSan Juan 9/10/2020I feel like I pitched this recipe last month. JamiErriquezzFort Lauderdale, FL9/10/2020I feel like I pitched this recipe last month. JamiErriquezzFort Lauderdale, FL9/10/2020The sauce was so so good. I willl definitely be making this again! ems11825690Atlanta9/10/2020For everyone complaining about the discrepancy in ingredients- When the description says \"Simple four ingredient recipe\" it is referring to the barbecue sauce, which is 4 ingredients. This recipe looks delicious and I'm excited to try it. emmykSeattle9/9/2020delete my comment about how your not paying employees of color one more time, i dare you. twitter is going to love this \nnice wings. (now this comment has direct relevancy to the article at hand, you disgusting, censoring racists) BonAppetitIsRacistEQUALPAYcalifornia9/9/2020stop deleting comments that expose how your paying employees of color less than your white employees.BonAppetitIsRacistEQUALPAYcalifornia9/9/2020stop posting this garbage that noone wants when you have real problems you need to address. pay your employees of color equal wages. i swear, these other comments are paid actors smhBonAppetitIsRacistEQUALPAYcalifornia9/9/2020So, how did ¨It's wildly simple(four-ingredient) recipe¨ morph into 18?\nWill I ever make this recipe again? please.Bachelor (party of one)New York City9/7/2020This recipe sounds delicious. I'm planning on doing a \"Wingsgiving\" for Thanksgiving this year ( wings instead of turkey) and now I know which flavor I will be making.  Can't wait to try it!AnonymousMiami, Florida9/6/2020This looks amazing! Love the diy sazón recipe. Can’t wait to make it for my family. Looks better than my abuelitas!! AnonymousFlorida9/6/2020Looks delicious and I can’t wait to try it, but I’m counting way more ingredients than you stated: “It’s a wildly simple (four-ingredient) recipe”. Why not stick to the original?AnonymousUs9/6/2020Explore Bon AppétitPuerto RicanCaribbeanGuavaFruitChicken DrumstickChickenPoultryMainNut-FreeGluten-FreeDairy-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-06", "author": ["Condé Nast", "Gabriella Vigoreaux"]}