{"id": "7ae5d02b737339305e7c12effe644e21", "url": "https://www.bonappetit.com/story/crispy-kale-crown", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Crispy Kale Chips: Your Last-Minute Sheet-Pan Add-on | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Crispy-Crunchy Built-In Side I Make Every Time I’m RoastingGive your sheet-pan dinner the Crispy Kale Crown treatment.By Cathy ErwayNovember 20, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.However kale chips entered your life—whether through a meme, a health-food fanatic ex, Gwyneth Paltrow, or a food magazine like this one—put that behind you. The glistening shards of plant-based mica that crackle in your mouth and shatter in your palm are here to stay, and for good reason: They’re easy to make. They’re fun to eat. And they don’t even have to be a cooking endeavor of their own. While developing dozens of Sheet Pan Chicken recipes, I found that they can be made on top of almost anything you’re roasting anyway. They make a crispy complement—like having fries with that.If you’ve ever made a sheet pan of oven-roasted kale chips before, then you know the drill: Separate the thick stems from the leaves (curly and flat-leaf varieties of kale both work fine), break them into pieces about the size of your palm, and massage with some olive oil and salt before spreading evenly across a pan. This also works when that pan is already full of browned savory goodness that just needs a few minutes more to cook. I call it a Crispy Kale Crown (C.K.C.): a single layer of oil-massaged kale leaves draped across the top of mostly-done other stuff. It shrivels into a brittle forest of a side dish in 10 to 15 minutes on high heat, at which point the rest of your ingredients on the pan are done too.They may not be as evenly cooked as slow-baked kale chips. They might brown a bit more at the ruffled edges; if you’re like me, though, the slightly-burnt bitterness is an earthy highlight. It’s an afterthought to the dish du jour while cooking but ends up grabbing the spotlight easily, so go ahead and give a C.K.C. to your sheet pan full of roasted root vegetables, halved winter squashes or eggplants, sheet-pan meatballs, whole fish roasts, and more. And if you do this with chicken in the pan, whether a whole spatchcocked roaster or a pan full of pieces, you’ll get the benefit of savory schmaltz soaking into the flaky pieces of kale too. Almost any recipe can benefit from a side of crispy kale. And kale chips, I’ve found, really benefit from chicken fat. Your chicken fat–infused kale chips are even better than those frizzled in olive oil.Sheet Pan Chicken: 50 Simple and Satisfying Ways to Cook Dinner$17 at Bookshop$16 at AmazonCathy Erway is a cookbook writer, podcast host, and blogger living in New York.Explore Bon AppétitKaleSheet-Pan DinnersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-20", "author": ["Condé Nast", "Cathy Erway"]}