{"id": "7b1354e772a31399f12d0da8eb4c3e38", "url": "https://www.bonappetit.com/story/how-to-make-gravy", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "How to Make Gravy (Depending on How Much Time You Have) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Gravy (Depending on How Much Time and Energy You Have)Whether you’ve got 20 minutes or two days.By Antara SinhaOctober 22, 2021FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWhen you’re hosting a dinner for a crowd, whether it’s Thanksgiving, Christmas, or any other holiday festivity, you may not put as much thought toward how to make gravy as you put toward, say, how to make a pumpkin pie that can accommodate your vegan sister-in-law, how to fit 15 people in your tiny living room, or how to pull off your very first showstopping centerpiece turkey.But we urge you: Consider the gravy! Gravy is your dry-bird insurance plan (knock on wood) and there’s bound to be a guest or two who’ll be disappointed if it’s not on the table. So take the time to pick your gravy strategy carefully: Depending on what kind of cook you are, gravy can be a hasty affair, pulled together in the final hour, or a laborious multistep process involving a long-simmering from-scratch stock. It doesn’t always have to include a whole bird hot from the oven, an expertly cooked roux, or the giblets—but, then again, it can if you want! We’ve sifted through the many, many turkey gravy recipes in the archives to pull out the best option depending on how much time you have and how seriously you take your gravy.For the OverachieverIf you’re truly looking to impress, and if gravy gets the star treatment on your table, this classic silky, rich make-ahead gravy is the labor-of-love route to take this year. Instead of a speedier pan sauce method that relies on turkey drippings (more on that later), you’ll start by making from-scratch turkey stock using chicken and turkey wings, crimini mushrooms, and smoked ham hock. Then you’ll simmer that stock down with more browned chicken wings, aromatic vegetables, herbs, and dry white wine before thickening it with roux. The result: layers of flavor, impeccable silkiness, and, when you tell your guests that every bit is from scratch, a major wow factor.Give yourself plenty of time for this: The turkey stock can be made a couple of days in advance and you can make the finished gravy a few days before serving as well, which will free up another burner on the big day. While it’s certainly a project, depending on how you like to prepare for guests (looking at all of you Type A’s, Virgos, and Ravenclaws), this can be less stressful than pondering how to make gravy after you’ve roasted your turkey—and when guests are walking in the door.Make-Ahead GravyThis do-ahead gravy skips the pan drippings.View RecipeFor the “Play It by Ear” HostIf you’re not quite an over-preparer and not quite a procrastinator, Why-Is-It-So-Good Gravy is your answer. It’s an impressive, reliable gravy recipe you can make from scratch without too much stress. Instead of pan drippings, from-scratch stock, or roux, this rich, crowd-pleasing favorite is founded in roasted turkey (or chicken) wings, ginger, peppercorns, garlic, shallots, mushrooms, and the umami powerhouse known as MSG.The best part: You can feasibly whip it up the day of the dinner or decide to take care of it the day before—just leave out the vinegar and MSG if you}re planning to go the make-ahead route. You’ll want to add those last as you’re reheating the gravy. Why-Is-It-So-Good GravyA make-ahead gravy gets a remarkable depth of flavor from roasted poultry bones and—surprise!—a sprinkle of MSG.View RecipeFor the Last-Minute CookIf working days in advance isn’t quite your style, we recommend an easy gravy recipe that starts with a pan sauce made right in your roasting pan when the bird is resting. This Classic Turkey Gravy with Thyme goes fast—from pan to table you’re looking at about 20 minutes, tops. And with only six ingredients, it’s about as speedy and simple as a gravy can get but with zero compromises on depth and flavor.Since you’re not spending as much time on layering the flavors in this method, you’ll want to splurge on high-quality store-bought poultry stock and take the time to develop a deep golden brown roux. You can easily use all-purpose flour here in a pinch, but Wondra, which is more finely ground, makes for an extra silky sauce and is worth seeking out.Classic Turkey Gravy with ThymeView RecipeExplore Bon AppétitThanksgivingcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-22", "author": ["Condé Nast", "Antara Sinha"]}