{"id": "7b13289f991a9fe7dd4b1fad6332b9b1", "url": "https://www.bonappetit.com/story/maira-kalman-cake", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "Artist Maira Kalman Carries Cake in Her Suitcase | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureArtist Maira Kalman Carries Cake in Her SuitcaseAnd she doesn’t like to share when she gets home.By Christine MuhlkeMay 4, 2018FacebookTwitterEmailIllustration by Maira KalmanFacebookTwitterEmailFor artist and author Maira Kalman, the above image sums it up. “That painting is my ideal world,” she says: “Cake and coffee served in a garden.” This page from her new book, Cake—which is as devoted to its title subject as you’d guess—was inspired by a trip to Delacroix’s museum in Paris.In fact, places where pastry and history intersect figure prominently on Kalman’s travel bucket list. “I will track down the patisserie where Gertrude Stein had her éclair, contemplating whether she should buy the Cézanne—we should all have such problems!” she says. “In Berlin I’ll visit Café Einstein; in Vienna I’ll stay at the Hotel Sacher,” home of the chocolate Sacher torte. “You know what?” she concludes. “Food is important.” That’s evident to anyone familiar with her work, such as her 28 books featuring countless sweets and her illustrations for Michael Pollan’s Food Rules.Cake combines Kalman’s whimsical paintings and wistful text with recipes by her friend Barbara Scott-Goodman. Kalman depicts a pink cake in Rome, a sweet remedy for heartbreak, and the honey cake her Israeli cousin bakes for her visits. “I’m always going back to New York with a suitcase full of cake,” she says, “which I distribute like a miser to family.” Not all souvenirs are for sharing.Read more: 17 New Spring Cookbooks We Can’t Wait to StainThen make a cake:Explore Bon AppétitCookbooksCakeRead Moreculture17 New Spring Cookbooks We Can’t Wait to StainBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Christine Muhlke"]}