{"id": "7b2baafe5eb5fb1e38b32ff8aa1ef537", "url": "https://www.bonappetit.com/recipe/tater-tot-egg-bake-with-bitter-greens-salad", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Tater Tot Egg Bake With Bitter Greens Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueTater Tot Egg Bake With Bitter Greens SaladBy Hetty McKinnonOctober 20, 20204.0(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“To suit our mainly vegetarian household, we decided that the Thanksgiving sides would become our mains,” says author and publisher Hetty McKinnon. And that menu always, always includes tater tots. This year she decided to turn the tots into an egg bake, which is directly inspired by, and strikingly reminiscent of, tortilla española. A Spanish tortilla is traditionally made with oil-poached potatoes, but using their processed counterparts is not new, notes Hetty: “Many years ago a chef friend shared that she used leftover french fries, and chef Ferran Adrià famously makes his with potato chips.” It turns out that tater tots, with their crispy exteriors and creamy middles, are perfect stand-ins. The finished product is full of texture and somehow still brimming with a tot aroma that’s undeniably familiar, even if you’ve never tasted one. If you’re surprised by (and skeptical of!) the amount of tots in this recipe, don’t worry, a lot of them break down to form a creamy union with the gently set egg.Ingredients6 - 8 Servings1small shallot, thinly sliced2Tbsp. fresh orange juice2Tbsp. sherry vinegar or red wine vinegar7–8Tbsp. extra-virgin olive oil, divided1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, dividedFreshly ground black pepper⅓cup sliced almonds1large onion, halved through root end, thinly sliced10large eggs132-oz. bag tater tots, thawed1small head of radicchio, leaves separated, torn2cups baby arugula3oz. Manchego cheese, shavedPreparationStep 1Whisk shallot, orange juice, vinegar, 3 Tbsp. oil, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large bowl to combine; season dressing with pepper. Set aside.Step 2Toast almonds in a dry 10\" nonstick skillet (at least 2\" deep) over medium-high heat, tossing occasionally, until golden brown, 6–8 minutes. Transfer to a plate and let cool.Step 3Wipe out skillet, pour in 2 Tbsp. oil, and reduce heat to medium. Add onion and cook, stirring occasionally and reducing heat if needed, until very soft but without taking on any color, 10–12 minutes. Let cool slightly.Step 4Meanwhile, whisk eggs in a large bowl with remaining 1 tsp. Diamond Crystal or ¾ tsp. Morton kosher salt; season with pepper. Fold in tater tots and let sit 10 minutes.Step 5Fold onion into egg mixture (try to keep tater tots intact, but it’s okay if some break up). Heat 2 Tbsp. oil in same skillet over medium-high. Pour egg mixture into pan and flatten surface with a heatproof rubber spatula to make sure tater tots are mostly submerged. Reduce heat to low; cook, undisturbed, watching edges to make sure egg isn’t getting too brown, until golden underneath and top is only a little runny, 20–25 minutes.Step 6Using spatula, loosen edges of egg. Wearing oven mitts, place a large plate upside down over skillet and swiftly flip over to turn egg out onto plate. If skillet is dry, add 1 Tbsp oil. Slide egg back into skillet, top side down, and cook until center is just set, about 5 minutes. Transfer back to plate; let cool if desired.Step 7To serve, add radicchio, arugula, cheese, and nuts to reserved dressing and toss to combine; season with salt and plenty of pepper. Pile salad on top of tortilla.How would you rate Tater Tot Egg Bake With Bitter Greens Salad?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleTastes great but didn't work out practically for me. In step 5 would suggest getting the pan and oil pretty hot so the egg tot mixture pulls away from the pan in step 6. This recipe produced way more than 6-8 servings so next time I'll third or half it to make it more manageable.AmberLa Quinta, CA12/21/2021I love this! Having lived with tortilla-flip anxiety ever since I lived in Spain 25 years ago, I used a cast-iron pan and finished in a hot oven, no flip necessary. \n\nMy family will be enjoying “Tot-illa Españolish” on many future Sundays!!LaurieSan Francisco 5/7/2021This recipe is such a creative and brilliant take on Tortilla Española which I ate many times in Spain. I love how crunchy the outer shell became. I followed the recipe exactly. I needed help “swiftly” flipping it on to a plate as I made it in a well seasoned cast iron skillet. The salad is a KEEPER!! Oh my word. Manchego is my all time favorite cheese and the salad took less than five minutes to whip up. My kids thought the tortilla tasted like hashbrowns and were happy. My six year old requested Gorgonzola!!! I complied and also tried a slice atop my tortilla and it was divine. Kelsey CooksMobile, AL4/18/2021Is it Tortilla? No. Is it fun, easy and totally delicious? Absolutely! We made this on a lazy Saturday morning and it took about 40 minutes start to finish. There's lot of cooking \"waiting time\" so most of was hands off. the small group LOVED it! My first flip browned slightly (20 mins exact) but there was still a slightly soft runny middle so it was perfect for us. I used 3/4 the bag of tots mostly bc my bowl was small and that ratio was perfect. Will make again as an easy and impressive group breakfast! AnonymousAstoria, NY12/27/2020I think this recipe is fun, versatile and delicious. My \"tortilla\" came out perfect. I highly recommend using the almonds and cheese with the salad. (I subbed what I had: a container of mixed greens and gouda/Parmesan blend).JudyWLouisville KY11/29/2020how to receive to a receipe file\n\nAudrey MacLellanSevierville TN11/22/2020Wait, this lot is actually calling tater tots repulsive? This is a fun take on tortilla espanola, not the real thing. Requesting the food snobs to lighten up. originaldiscokidLos Angeles11/19/2020Gotta have tots!  fun recipe to riff off of in a number of ways.  DavidBoise11/16/2020We liked this a lot but the bottom was overdone cooking in the pan on stove top.  The next time I make it I'm going to just bake in the oven in casserole dish.  I think I will have better luck keeping the heat even that way. \n2ralphsPhiladelphia PA11/16/2020 If you are at all decent at cooking tortilla espanola, this recipe will not be better than it. The tots are a novelty and might be convenient for some, but any joy that could be derived from such a delightful inclusion is lost by using them thawed. BethanyMelbourne11/7/2020I halved the recipe and it fit perfectly in one layer in my cast iron skillet. It was super easy and fun. Halving the recipe also halved the cooking time so it was quick. I skipped the almonds and cheese and did dressing and greens on top. It was comfort food that also felt healthy and tasty with the salad and flavors blending nicely. I keep tots in the freezer for when I don't want to make potatoes from scratch and craving some fast comfort. This recipe was perfect for an upgraded version of tots. You gonna eat your tots?CookiePortland11/7/2020Or you could just skip the repulsive processed food and make tortilla espanolAndrewSan Francisco11/3/2020Explore Bon AppétitEggEasyOne-Pot MealsWeeknight MealsMainVegetarianBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Hetty Mckinnon"]}