{"id": "7b2c121cfd1c5ebeee872c0952eaa5a6", "url": "https://www.bonappetit.com/story/indian-ish-baked-potatoes", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Your Baked Potatoes Need This Sharp and Spicy Indian-ish Upgrade | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Baked Potatoes Need This Sharp and Spicy Indian-ish UpgradeTop your potato with green chilies, chutney, and chaat masala and you might never return to boring ol’ bacon bits.By Priya KrishnaDecember 6, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.These days, being a vegetarian is no big deal. Restaurant menus always have a meat-free entrée. No waiter will be offended if you check that the fries weren’t cooked in beef fat.Back in the ’90s, however, when my mom was taking bi-weekly trips to London for her job developing software for airlines, it was a cold and unfriendly world. Her requests for meatless food at restaurants and pubs were largely met with scoffs. And if there was a vegetarian option, nine times out of ten, it was a baked potato.So my mom learned to subsist on the humble spud during her work trips. She got used to the routine of heading to the pub closest to her hotel, ordering a baked potato, and topping it with sour cream, salt, and pepper (and, if she remembered to pack it in her carry-on, a sprinkling of bottled masala). She’d eat it with a side of baked beans and a beer and be on her way.For whatever reason, my mom never got sick of baked potatoes. In fact, at home in Dallas, she’d make baked potatoes for our family when she was feeling too lazy to put a pot of dal on the stove. It was easy, and we always had potatoes in the house, since I’m certain that no one stans potatoes like Indian vegetarians. (What’s not to like? They’re filling, they hold onto seasonings well, and they can be prepared in limitless ways.)But my mom didn’t top our potatoes with sour cream, salt, and pepper. Being at home meant she could get a little more creative. She’d adorn our spuds with the ingredients we regularly kept in our fridge: red onion, ginger, cilantro, green chilies (everything finely chopped), and the funky spice blend, chaat masala—plus, sour cream (she couldn’t resist).Aside from sour cream, I grew up totally unfamiliar with traditional baked potato toppings like those artificial-tasting bacon bits, or that stiff, pre-grated cheddar cheese. My baked potatoes were sharp and spicy, with fresh ingredients and varied textures. Eventually, my mom moved beyond the standard russet and started baking baby new potatoes and serving them sliced open like flowers for an easy party appetizer.Baked potato bites, ready to party.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraOver the last decade, baked potatoes have fallen out of fashion in American food culture—I’m not sure why. I guess people perceive potatoes as empty carbs and starch, and if they’re going to have a potato, they might as well have it in fried form. When it comes to my mom’s Indian-ish baked potato, I respectfully disagree.I love the way baking a potato turns its innards into silky tufts. I love watching the sour cream melt into the flesh. I love how intensely the flavors of the ginger and the chaat masala imprint themselves. I love crunching the red onions (do not fear raw onions, people!) and getting that creeping heat from the chilies.But I love it most of all when I serve the dish in its baby potato form at parties. People look at the colorful, dainty morsels and think I spent all this time putting together a fancy appetizer plate when in reality, it’s just a baked potato.Follow this basic recipe for the baked potato, and then doctor it up with Priya’s suggestions above.You can pre-order Priya’s upcoming cookbook Indian-ish on Amazon for $23. Woo hoo!Explore Bon AppétitPotatoIndianishVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Priya Krishna"]}