{"id": "7b3042f22aacde2862dd66e540cecc4f", "url": "https://www.bonappetit.com/story/natural-food-definition", "year": 2018.0, "month": 4.0, "day": 5.0, "content": "What Does Natural Mean? The FDA's New Definition Might Change Your Pantry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow the FDA's New Definition for \"Natural\" Food Could Affect Your PantryThe FDA wants to weigh in on this nutritional buzzword, and their decision might change what you reach for on the shelf.By Leslie NemoApril 30, 2018FacebookTwitterEmailIllustrations by Annalee SoskinFacebookTwitterEmailWhat does \"natural\" mean? Debating the definition of the word is like debating whether people see colors the same way. Is your \"natural\" wine like my \"natural\" quinoa? We’re all on the same page about trans fats, thanks to the FDA’s 2006 requirement that they be declared on Nutrition Labels. The same goes for “organic,” which the U.S. Department of Agriculture clarified in 2000 as being free of synthetic chemicals. But when it comes to defining “natural” food, we’re still on our own.The term first appeared on labels in the 1970s, and it rose in popularity as shoppers embraced the health-associated buzzword in their pantries. In 2015, about 60 percent of surveyed consumers thought packaged foods labeled “natural” were made with no toxic pesticides, no artificial colors or ingredients, and no GMOs. Between 80 and 85 percent of them thought that “natural” should indicate each of those three things.Last month, the FDA announced that it’s close to issuing standards. The new rules would provide a real definition for everything but meat and poultry (the U.S. Department of Agriculture is responsible for the safety of meat, poultry and egg products, while the FDA regulates all other foods). Beef and chicken can only bear the word “natural” if it has no artificial ingredients or added colors, and if it wasn’t “fundamentally altered” during processing. (Don’t sweat about finding “natural” eggs: Those are always natural, according to the USDA.)Where the USDA took action in 1982, the FDA has dragged its feet. Efthimios Parasidis, a law professor at Ohio State University researching the natural claim says they have taken “embarrassingly long” to come up with a definition. Parasidis has studied the dozens of times upset customers have taken brands to court over claims of so-called “natural” foods. So far, foods made with GMOs, high-fructose corn syrup, and artificial preservatives or coloring struggle the most to keep the term. Some brands are told to drop the label, while others had already let it go once they saw early lawsuits. Judges have also ruled in favor of customers more often in cases of processed foods, like cookies and energy bars—in part because those foods are brought to court more often. If a product has dozens of ingredients and is formulated to be shelf-stable for years, there’s a higher chance one of those additives won’t make the “natural” cut.Because most lawsuits revolve around ingredients, the FDA definition will probably focus on those. They could also limit how foods are produced, says Parasidis. Ionizing radiation, a shelf-life preservation tactic of aiming X rays at food to kill off bacteria, and using sewage sludge as fertilizer could be two processes that won’t pass for “natural.” Right now, the nine kinds of food that can be irradiated get a friendly green symbol on the package. If food is grown in the sanitized solid byproduct of wastewater treatments—which happens on 1 percent of U.S. farmland—it isn’t marked at all. The only way to dodge these two in your groceries is to go organic, which bans them both.Speaking of organic, the potential “natural” definition—no artificial preservatives, GMOs, radiation or sludge—sounds a lot like what organic already stipulates. And yes, there might be some crossover, says Parasidis. “Natural” might also be like organic in that it could have tiers. This is where qualifiers come in: organic foods can be “100% organic,” “organic,” or “made with organic ingredients.” Each phrase signifies a percentage range, forcing brands to clarify how much of what they’re selling fits the rules.So, say the FDA definition kicks in, and Parasidis’s predictions are correct. How will that change what you see on the shelves? The artificial colors, preservatives, and GMOs most Americans think shouldn’t be in natural foods probably won’t be there. If brands decide it’s worth the cost, some of your borderline-natural favorites might rise to the occasion with production and ingredient tweaks. If the FDA allows it, labels could take on qualifiers like “made with natural” or “all natural.”Based on the lawsuits so far, processed foods are more likely to straddle the line between tweaking for the new rules or abandoning the label. But fruits, veggies or grain brands might also choose losing the designation over growing in something more costly than sludge—a choice you can’t discern from the package, like you can by looking at the ingredient list for, say, high fructose corn syrup. If brands drop the “natural” claim, they’ll probably drop in price, too.In the past, FDA definitions have boosted sales of accurately labeled products — this happened with trans fats. Julie Caswell, an economist at the University of Massachusetts Amherst, studied how many “trans-fat free” margarines people bought before and after brands could make the claim in 2006. At first, a wave of new products with the slogan hit the shelves, and we bought them. Within five years, though, we put fewer “trans-fat free” tubs in our carts and the popularity waned. “I think it’s relatively common in markets to have the initial response to be larger to the long-term response,” says Caswell.“Natural” may transcend that post-law bump, however. As Caswell points out, “trans-fat free” was new and surprising to a lot of shoppers when that 2006 regulation appeared. Plus, trans-fat was a single ingredient shoppers could focus on and avoid if they wanted to. “Natural” is a much vaguer claim with a broader halo effect, and products labeled as such are still on the upward climb. In 2013, foods with “natural” on the label made up $40.7 billion in sales, and a 2016 Consumer Reports survey says we’re even more likely to buy natural over organic.There’s no guarantee that the FDA’s forthcoming definition will encompass everything you want it to. Natural means nothing unless you know how each brand defines it, so today and going forward, it doesn’t hurt to do some research. Decide what ingredients and treatment processes matter to you, and then read labels and look up the brands to see what they say about their methods. Who said you can’t define your the contents of your pantry on your own terms?Explore Bon AppétitHealthyishOrganicGroceryShoppingTrendsRead MoreLifestyleThe Real Reason to Eat Organic Food May Have Nothing to Do With HealthBy Aaron Carroll, MDRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-30", "author": ["Condé Nast", "Leslie Nemo"]}