{"id": "7b39ec49e9529782166d35ec89237fdb", "url": "https://www.bonappetit.com/story/seven-sundays-cereal", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "This Seven Sundays Chocolate Flavored, Flower-Shaped Cereal Is All I Want for Breakfast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Chocolate-Flavored, Flower-Shaped Cereal Is All I Want for BreakfastSeven Sundays has all the nostalgic vibes without the processed ingredients.By Devorah Lev-TovApril 2, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!It wasn’t until I moved in with my now husband that I discovered he loved cereal. My twice-weekly bowl was quickly eclipsed by his twice-daily (at least) indulgence. Suddenly, we were going through gallons of milk and boxes of fibrous flakes faster than you can say Cinnamon Toast Crunch.Naturally, our son Sammy inherited my husband’s obsession. As soon as he could eat solids we were ordering Corn Flakes, Kix, and Cheerios in bulk. But as Sammy became more enamored with cereal I became more concerned with the nutritional labels, which all seemed to be loaded with processed ingredients. Occasionally I’d bring home some “healthy” option to try out, but they all tasted like cardboard.Then one day last fall, I discovered Seven Sundays, a Certified B Corporation, which automatically put it at the top of my pile. Minneapolis-based husband and wife Hannah and Brady Barnstable started selling muesli in 2011 but recently launched a grain-free, flower-shaped cereal in three flavors: Cocoa, Cinnamon, and Berry. Could it satisfy this family of connoisseurs? I was willing to find out.There are just a handful of ingredients in Seven Sundays (and you’ll definitely have heard of all of them), which earned another tick from me. The one that intrigued me the most, though, was sunflower protein. Turns out, Hannah explained, farmers growing sunflowers in order to extract sunflower seed oil were being left with a solid byproduct that was rich in protein and fiber but going to waste. So she worked with a local Minnesota sunflower farmer to do some additional milling and sifting in order to upcycle the by-product into a quality food-grade flour they use to make the cereal.The result is a delightfully crunchy, somewhat springy cereal that doesn’t get soggy quickly. My favorite flavor, the Cocoa, is so dark and rich it leaves you with a slurpable bowl of chocolate milk at the end. The Cinnamon—which is made with the real deal instead of “cinnamon flavor”—is a close second. And the Berry, Sammy’s favorite, is made with freeze-dried blueberries and strawberries from a farm in Illinois. The only sweeteners used are either maple syrup or dates and coconut sugar, and each variety clocks in at 5 or 6 g of sugar per serving, compared with at least 12 g for most supermarket brands.By now you must be wondering what the cereal guru (my husband) thinks? Well, at least one of his two daily bowls are Seven Sundays now, and trust me, that’s the highest praise a food can get from him.Seven Sundays Real Cocoa Sunflower Cereal$9 at Amazon$7 at Seven SundaysExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreshoppingI Never Thought I’d Love a Low-Sugar Candy Bar But Here We AreBy Ali FrancisshoppingI Can't Stop Munching On This Fluffy, Flavorful Popcorn DupeBy Amber GibsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-02", "author": ["Condé Nast", "Devorah Lev-Tov"]}