{"id": "7b4cf0f28624f50eac15a11a3ebda7b2", "url": "https://www.bonappetit.com/story/casa-jacaranda-mexico-city", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "We Swoon for Casa Jacaranda's Mexican Cooking Classes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopmexico-cityTrue Story: I’d Go Back to Mexico City Just to Take This Cooking Class AgainAt Casa Jacaranda, a dreamy cooking class provides a intimate, hands-on look at the ins and outs of Mexican cuisine.By Hilary CadiganDecember 10, 2018FacebookTwitterEmailPhoto by Cody JamesFacebookTwitterEmailI plop an egg-sized dollop of masa mix onto a papery scroll of corn husk and start rolling. “To get a proper tamale you need the perfect roll,” says my instructor, Jorge Fitz. “Not too tight and not too loose.” My tamale is skinny and oozing slightly from the fold (somehow both too tight and too loose) as I stick it upright into the steamer with the rest, but I’ll get it right the next time. Jorge will make sure of that.Here at Casa Jacaranda, the dreamy sun-dappled home Jorge shares with his husband Beto Estúa in the middle of Mexico City’s cooler-than-cool Roma neighborhood, the couple hosts cooking classes several times a week. But they’re not the kind of cooking classes that make you feel like a sheepish tourist, limping through a rapid-fire series of dumbed-down recipes with a bunch of other sheepish tourists. Spending the afternoon with Jorge and Beto feels more like reconnecting with old friends—if those old friends lived in a house straight out of the pages of Architectural Digest and knew how to whip up a 20-ingredient mole from scratch. Plus, there’s wine.The day begins at 10 a.m. with a purposeful wander through the nearby Medellín Market, a riot of serpentine pathways woven around stalls stacked with brightly colored sauces and fruits. Medellín sells produce and products from all over Mexico, and is particularly significant for the city’s diverse immigrant communities, many of whom hail from South America.“Coming to a market in Mexico is all about the relationships you have with the sellers,” Jorge says. He picks out ingredients for the afternoon’s lunch lesson, dipping from a seemingly infinite reservoir of knowledge about everything we see, from the dried chiles to the coffee beans.A day at Casa Jacaranda begins with a trip to the Medellín Market with Jorge.\nPhoto by Cody James“Here, try this,” he says, handing me what appears to be a mango, but shrunken down to the size of a ping-pong ball. It’s the sweetest mango I’ve ever tasted, its texture like velvet. A few stands over, we meet Don Carlos Palma, who has been here selling products from Mexico’s Yucatán Peninsula since 1968. His offerings are eclectic: bottled horchata; ground pepitas for making nutty, tomatoey sikil p'aak dip; canned cheese from Holland that’s somehow become a Yucatán staple; and an array of handmade hot sauces. The coconut varietal is my favorite, sweet and creamy and fiery all at once. I buy a few bottles to take home. “It’s important to know that there’s no such thing as one Mexican cuisine,” Jorge tells us. “Rather, it’s a bunch of different regional cuisines, all with their own unique flavors and styles.\"Jorge grew up in Cuernavaca, capital of Mexico’s Morelos state, where his family owned a restaurant. He became a graphic designer because he didn’t want to spend his life working in the family business. “Those long hours, those nonexistent Christmases, no thank you!” he says with a wave of his hand. “But the love was there.”Don Carlos Palma has been selling products from the Yucatán at the Medellín Market since 1968.\nPhoto by Cody JamesIn Morelos, where the cuisine is influenced by a rich agricultural tradition and a confluence of cultures indigenous to the region, Jorge would ride through the mountains on his family’s horses. “When it was time for lunch we would just go to the closest house, ask for food, and these ladies—who sometimes had next to nothing—would whip up something beautiful out of two eggs, tortillas, and chile, and that’s it,” he recalls. “I didn’t think much of it back then, but I know now that I was blessed to see that. That’s traditional Mexican cooking. Nothing fancy; just using the fire, smoking things, grinding everything by stone.” It’s these kinds of simple, old-school methods he hopes to share in his classes: the tried-and-true backbones of Mexican cooking.Back at the house after our market trip, we set down our things and gather around a large central island off the kitchen, in an open room flush with sunlight. Artwork covers the walls and sits stacked in corners. Books overflow from the shelves. A potted tree grows through its own personal skylight. Beto stands at the head of the island in front of a large cooktop, setting out bowls of spices and dried chiles. Jorge points to a large chalkboard wall, where he’s written out a flow chart for the recipe we’ll be making today: Oaxacan mole, one of the most complicated dishes in Mexican cuisine. The chart is broken out by method—grill, fry, boil, burn, grind—and all leads up to the crucial step, which is circled many times over with different colored chalk: INCORPORATE!Jorge and Beto's home is decorated with art from their travels.\nPhoto by Cody James“Mole is considered by many the first true fusion dish,” Jorge says. “It’s also the first truly Mexican dish, because it combines the spices that are native to Mexico, the spices that Europe gave us, and many of the ingredients that the Spanish brought from Asia. And that, really, is Mexico.” He pauses for effect. “It is not what was before the Spaniards came, and not what they brought with them; rather, it’s what happened when those things collided.”Since the beginning, Beto and Jorge’s relationship has been built on a shared love of food and cooking. The idea to start a class came from the constant requests Beto and Jorge would field from American friends. “One of them would call me and say, ‘You don’t know this but we are having dinner at your place Saturday, and my friends want to learn to make your enchiladas,” Jorge recalls. “Eventually it got to a point where we said, oh we could charge for this, no?”Jorge and Beto teach classes about three times a week at their home in Mexico City's Roma neighborhood.\nPhoto by Cody JamesThe pair seems uniquely suited to the task. Beto is patient as he teaches us how to make tortillas from nixtamalized masa dough, the kernels soaked in limestone to unlock their niacin. We light a few of the tortilla on fire to bring out the smoky flavor, which will go into the mole along with the chiles, tomatoes, onions, garlic, apples, raisins, plantains, almonds, sesames, spices, and ground cacao to form a thick onyx-colored paste.“Recipes should be shared so they don’t go extinct,” says Jorge, demonstrating the proper way to crush spices with a mortar and pestle (twist, don’t hack). The tamales come next. After a few tries I manage to master the rolling technique. Packed tight, the steamer is turned on to do its work.Beto makes tortillas out of masa dough.\nPhoto by Cody James“For many decades, Mexican food was untouched. No one played with it, no one changed a single thing about the techniques or ingredients, because what we Mexicans like are the flavors of when we were growing up—what our abuelas made. We like the nostalgia.” That’s changing now, he says, but maintaining respect and understanding for the past is crucial.A day at Casa Jacaranda concludes with a meal on the couple's rooftop, beneath the jacaranda tree.\nPhoto by Cody JamesWhen the meal is ready, there’s one more surprise. “Follow me!” says Beto, and we gather the dishes and carry everything up a flight of floating stairs. The door opens and suddenly we’re on a beautiful rooftop patio, awash with greenery and shaded by the gnarled branches of a jacaranda tree heavy with purple blossoms. Jorge pulls out a few bottles of local Mexican wine and passes them down the table. We unwrap our tamales to reveal their downy, sweet flesh and dollop our homemade tortillas with the spicy, smoky mole we made ourselves. For dessert, there’s ice cream made from mamey, a sweet salmon-colored fruit that only grows south of Texas.At the end of the meal we say our goodbyes, gather our things, and mosey on. Outside the cool, quiet cocoon of Casa Jacaranda, the streets are hot and crowded, but I feel calm, happy, sated. What better way to experience Mexican cuisine than start to finish, from the market to the kitchen to the plate? What better way to spend a day?Explore Bon AppétitMexico CityCity GuidesRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Hilary Cadigan"]}