{"id": "7b5dfb6826a0c7a1ef62015f17e59f00", "url": "https://www.bonappetit.com/story/how-to-cook-sausages", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "How to Cook Sausages So They're Not Weirdly Raw Inside (or Burnt) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cook Sausages So They're Not Weirdly Raw Inside (or Burnt)Know how to cook sausages? So they're not weird and maybe raw in the middle? No? We got you.By Alex DelanyFebruary 1, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailSausages are tricky. Well, they were tricky, until we learned how to cook sausages properly. Before we found The Method, whenever we made sausages they would end up charred on the outside but raw on the inside. Or the casings would split. Or by the time they were cooked through, they’d be dry as all hell. Sound familiar? Yeah. It doesn't have to be that way.The problem with simply cooking them over direct heat in a pan or on a grill—the mistake most people make—is that you either end up blasting them, hoping for the best, and winding up with sad, dry meat, or you find yourself in the uncomfortable situation of squinting at the cut-into piece of sausage on your plate wondering whether or not you're going to give all of your guests food poisoning. Not ideal. That's why we use a two-step, simmer-then-sear technique in which the links get gently cooked in water first, and then crisped in a hot pan right before they're served. And it's never let us down. Here's how to do it.To start, drop your sausages into a large pot or saucepan and fill it with enough cold water to just cover the sausages. Put the vessel on the stove, turn the heat to medium-high, and cook just until the water reaches a gentle simmer—that should take about 6-8 minutes. Then turn off the heat and get those sausages out of the pot. Voila! Those little guys are cooked through, tender, and ready for step two.At this point the sausages are cooked and intact but, as you’ll notice, they’re very...gray. The next step is to get some color and crispness on them. You can either slice the sausages in half, lengthwise, to get a crisp on the exposed interior (great for sausage sandwiches), leave them intact and crisp the casings, or cut them into coins or chunks. Whatever! However you slice them, grease a pan with a bit of oil, get it shimmering-hot over high heat, and then carefully place your sausages in there. Since the sausages are already cooked through, you won’t need to leave them in the skillet for long (or the grill, if the weather's cooperating). Get that sear you're after, and get them out of the pan before they dry out.And then you can throw them in a sandwich, plop them on toast, slice them to incorporate into some rice or pasta, or just eat them straight-up. What you do with them is your business. Making sure you know how to cook a sausage properly? That’s our line of work.Now, SANDWICHES:Sausage, Peppers, and Onions SubsAin't no party like a sandwich party.View RecipeExplore Bon AppétitBasicallySausageSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Alex Delany"]}