{"id": "7b6447871b75771af5cfc83eaf0c1c8b", "url": "https://www.bonappetit.com/story/pea-pesto", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Pea Pesto is a Super Simple Side That's Easy to Throw Together Whenever You Need Something Else on the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Most-Requested Recipe Starts With a Bag of Frozen PeasIt's so easy, I'm almost embarrassed to share. By Carey PolisMarch 19, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.Whenever I’ve decided I need just one more thing on the table, or whenever I'm running low on fresh provisions, I fall back on pea pesto, which has never failed me in trying times.I start by finding a 10-ounce bag of frozen peas in the depths of the freezer. I'll microwave ‘em, let them cool slightly, and toss them in the food processor. Then, I add juice from half a lemon, several glugs of olive oil, a teaspoon-ish of salt, a handful of the wilting parsley in the back of my fridge, the browning clove of garlic sitting in a bowl on my counter, grated hard cheese if I have it, and if I’m feeling frisky, some caramelized-until-I-got-impatient onions. I blitz everything, adding a tiny bit of water if the mixture feels too thick, and adjusting salt and lemon juice as needed.The pesto works excellently as a spread for toast, but I’ve also used it for a quick pasta sauce and a dip for vegetables. Even if I've managed to bake a beautiful galette or a chocolate-y cake (hey, it's called stress baking), the pea pesto is the recipe that guests (or these days, friends following along on Instagram) most frequently request.Thus, I’ve learned this key to dinner success: It’s not about how long you took to make the meal, or how well-seasoned the chicken is. It’s about that bag of frozen peas I was saving for a moment like this.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Carey Polis"]}