{"id": "7b789ffd3c5a890b18690dabcf9b8c7f", "url": "https://www.bonappetit.com/story/belgian-endive", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Endive Is a Chip and a Salad Green at the Same Damn Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEndive Is a Chip and a Salad Green at the Same Damn TimeDelicious and versatile, endive is the unsung hero of the crisper drawer. What can't this mellow, irresistibly crunchy veggie do?By Alex DelanyJanuary 23, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailThe Belgian endive looks like a tulip, sounds like a fancy gardening tool, and tastes better than both. It also happens to be an incredibly versatile vegetable, the kind that, once you've learned its joys and pleasures, you'll find yourself buying reflexively whenever you're shopping for produce.Endive is part of the chicory family along with our good friends radicchio and escarole. But while chicories have a reputation for being bitter, sometimes aggressively so, endive is mellow, refreshing, and easy to love. Sure, there’s an extremely mild bitterness, but its leaves have a high moisture content that keeps the astringency in check, meaning the endive tastes crisp, fresh, and clean when compared to other, more intensely flavored chicories. And it has a sturdiness and crunch that makes it a beautiful blank canvas for intense flavors like garlic, citrus, and anchovies.Our favorite use for an endive is as a chip. We're not saying they taste like Doritos or anything, but when it comes to vegetables, nothing can impersonates a chip quite like a leaf of endive. The slightly curved leaves make perfect vehicles to transport, say, a whole bunch of yogurt dip from the bowl to your mouth. They’re endlessly snack-able, and make a great addition to just about any crudités platter .Endive salad with walnuts and toasted breadcrumbs\nChristopher BakerBut endive is so much more than a bunch of chips posing as lettuce. A single head of endive makes for an ideal Personal Salad—the perfect thing for when dealing with a whole head of lettuce just feels like too much for a solo dinner. Just peel off as many leaves as you want, toss it with a bracing, garlicky vinaigrette, top with some toasted nuts and cheese, and you've got yourself the salad of the year.But. That's. Not. All. Endive is a triple threat, like Lebron James on the basketball court or Beyoncé, just…generally. It also shines when quickly stir-fried, lightly braised, or even roasted. Since the leaves are quite thin, you don't want to cook it too long—it'll sog out after too much exposure to heat. But a quick bath in warm cooking liquid or a hot-and-fast sauté will do you just fine.The best part? These little guys last forever. You know how you can buy cabbage, forget about it in the crisper, and come back three weeks later to find that it is still totally edible (after peeling off the nasty outer leaves)? Same with endive. Which is why you'll always find it waiting for us in the fridge, ready to turn a night of I-don't-have-any-food-at-home into a crunchy delight.Endive salad is a killer with a date night pork chop:Date Night Pork ChopRubbing a little honey across the surface of the pork before searing guarantees a shiny, caramelized crust. Pair that with a lemony endive and apple salad, and you've got the ultimate dinner for two.View RecipeExplore Bon AppétitBasicallyEndiveVegetableSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Alex Delany"]}