{"id": "7b7a0720258a5e979b62ee8a363ab7ad", "url": "https://www.bonappetit.com/recipe/lamb-shoulder-with-citrus-fennel-salad", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Lamb Shoulder with Citrus-Fennel Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueLamb Shoulder with Citrus-Fennel SaladBy Chris MoroccoFebruary 13, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintMarcus NilssonEmailPinterestPrintEmailPinterestPrintFor this lamb shoulder recipe, lightly scoring the fat cap across the top of the roast allows salt and flavors to penetrate even if you can’t season it a day ahead.Ingredients8 servings15½–6-lb. lamb shoulder (not tied)6garlic cloves, finely grated, plus 2 heads, halved crosswise2Tbsp. extra-virgin olive oil1tsp. crushed red pepper flakes1tsp. finely grated orange zest, plus one 3x1\" strip zest2Tbsp. finely chopped rosemary, plus more for serving1cup dry white wine6–8mixed small oranges (such as blood, mandarin, and navel), peeled, halved, sliced or torn into small sections1large fennel bulb with fronds, thinly sliced2Tbsp. fresh lemon juicePreparationStep 1Preheat oven to 300°. Using a sharp knife, score fat across the top of lamb shoulder to create a crosshatch pattern, cutting about ¼\" deep and spacing cuts about ¾\" apart. Season generously all over with salt and pepper.Step 2Combine grated garlic, oil, red pepper flakes, grated zest, and 2 Tbsp. rosemary in a small bowl. Rub all over lamb, working into score marks and anywhere there is an opening. Place lamb in a large cast-iron skillet or baking dish. (At this point the lamb can be covered and chilled up to 1 day if you want to break up the prep.)Step 3Arrange garlic heads, cut side down, around lamb and add strip of zest. Pour in wine and cover tightly with foil. Roast until meat is falling off the bone and fork-tender, 5–5½ hours. Keep covered and let rest 30 minutes.Step 4Gently toss orange pieces and fennel with lemon juice in a medium bowl; season lightly with salt.Step 5Tear the meat off the bones in large pieces and mound on a platter. Arrange citrus and fennel salad next to meat. Top meat with more rosemary and drizzle pan juices over.Step 6Do Ahead: Lamb can be roasted 1 day ahead. Let cool; cover and chill. Gently reheat, covered, in a 300° oven until warmed all the way through, at least 1 hour, before serving.How would you rate Lamb Shoulder with Citrus-Fennel Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitFennelVegetableCitrusFruitOrangeLamb ShoulderLambMeatMainDairy-FreeGluten-FreeNut-FreeHealthyishRoastEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}