{"id": "7b9271576900982e14730ba357dd2594", "url": "https://www.bonappetit.com/story/fadensonnen-baltimore", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "I’m Too Old For Shots But Not “Thimbles” of Liquor at Fadensonnen Baltimore | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’m Too Old For Shots But Not “Thimbles” of LiquorFadensonnen’s biergarten has tiny cups of aquavit, and I’m here for it. By Amiel StanekJanuary 14, 2020FacebookTwitterEmailPhoto by Matty TaeFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Let me get a shot of…These words crossed my lips countless—and I mean, countless—times over the course of my twenties. I first got a taste for shots when I worked at a bar in south Philly, where a few ounces of hard booze served as universally understood punctuation marks during a night of drinking. It was the exclamation point that solidified camaraderie between fellow service industry folks and the emphatic period that represented the end of the festivities and steeled one against the chilly walk home. They were symbolic. They were special. They were...perhaps less than advisable or responsible. They were really f#%ing fun*.But now that I’m on the other side of thirty, the idea of ordering a shot at a bar suddenly seems a bit...I don’t know, age inappropriate? Gauche? In poor taste? There’s certainly a time and a place, but those times and places have become fewer and further between. At this point in my life, I feel like I need some kind of special permission to throw back a bit of the hard stuff beyond a temptingly priced shot-and-beer special. And that, my friends, is exactly what the biergarten situated underneath Baltimore’s Fadensonnen has done so artfully.I visited the dark, cozy taproom back in November along with some college pals the night before a dear friend’s wedding. The mood was celebratory but restrained—anyone who has crossed the Grown Up Hangover Rubicon knows that getting too drunk the night before a wedding is a recipe for disaster. And at the end of the carefully curated list of beers, suddenly there it was, a bit of bar program genius: ‘WEE THIMBLE’ Chilled Vikre Aquavit, MN $2. What a positively intriguing suggestion!I mean, a “wee thimble”? What harm could such a diminutive, charming quantity of spirituous liquid possibly wreak on an otherwise-subdued evening? Plus, it’s aquavit—caraway-scented and assuredly Adult and Sophisticated, a far cry from the rounds of bottom-shelf bourbon and tequila I tossed back in my youth. And for two measly bucks no less?! The best bar menus are those that suggest exactly the thing you want but never would have thought to order, and this one had it in spades. Have a little bit more fun, why dontcha! Permission: Granted.I ordered my beer and a round of six “thimbles”—which were, indeed, tiny metal cups holding perhaps an ounce of liquor—for a crew of friends who had congregated around one of the propane-powered heaters outside. Everyone grinned conspiratorially as I doled them out, quietly reminiscing about all the times where these would have been bigger and the first of many for the night, and raised their cups to toast the bride and groom to be. We dispatched the aquavit, clean and cold and bracing, and let out a collective ahhhhhhhh. And we all had one more round of beers and headed back to our Airbnbs, feeling every bit our age, and no less fun for it.Go there: FadensonnenExplore Bon AppétitHighly RecommendRestaurantsBarsLiquorRead MorecookingYou Should Be Doing More ShotsBy Rebekah PepplerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-14", "author": ["Condé Nast", "Amiel Stanek"]}