{"id": "7bb81d0b1ff572e5a74d5bf189fb4512", "url": "https://www.bonappetit.com/story/secret-single-cooking", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "Cooking for One: The Meals We Make When No One Is Around | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersLifestyleSecret Single Cooking: The Meals We Make When No One Is AroundGo ahead and crumble that rice cake right into the peanut butter jar. We won't tell. By The Healthyish TeamMarch 31, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich FacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.There's secret single behavior (SSBs, if you will), and then there's secret single cooking—the kind of \"meals\" you make only when you know that no one is around to judge you. And while the BA Instagram feed might be filled with creamy pasta finding its best light, the truth is that in these socially distant times, we, like you, are home alone and secret single cooking like never before. And believe us when we tell you: It's not always pretty.\"Weird\" and \"cheese\" were two themes that came up over and over when we asked our co-workers what they make when they have a solo night—or a solo life—with no one to impress but themselves. One day, we'll get back to those elaborate dinner parties. But for now, we're leaning all the way in to secret single cooking—one random-leftovers-quesadilla at a time.1 / 14ChevronChevronExplore Bon AppétitHealthyishHealthyish Guide to Being AloneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "The Healthyish Team"]}