{"id": "7bb927d08b23770c8fb97894dc30d7aa", "url": "https://www.bonappetit.com/story/thirties-advice", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "“If I Could Do My 30s All Over Again, I'd...” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle“If I Could Do My 30s All Over Again, I'd...”We asked our very favorite people for their very best advice.By The Healthyish TeamJune 12, 2019FacebookTwitterEmailPhoto by Arthur ElgortFacebookTwitterEmailThis story is part of the Healthyish Guide to Your 30s, our best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.Let’s face it, we’re not going to make it out of this decade, or any other, without a few missteps. But, lucky for us, there are a couple billion people in the world who’ve gone through their 30s already. We found 19 of them, including some of our favorite chefs, actors, editors, and friends, and asked what they’d do differently if they could turn 30 again.I wish I would have eaten better and tried to be healthier! It’s astounding how poorly I ate considering I cooked at some of the best restaurants in the city. I’d stuff my face with family meal around four before service. Seven or eight hours later, a shift drink of beer would be followed by some sort of greasy burger, hot dog, or cheap (but oh so delicious) bodega sandwich, washed down with a few more beers. —Sohui Kim, chef/owner of The Good Fork and InsaDrink more water! I only recently started really drinking water—64 entire ounces on most days—which is standard healthful advice I'd categorically ignored in my 30s. It's made a huge difference on so many levels. My skin is less dry and not as sensitive and itchy in the winter. My nails seem to be splintering a little less. My digestive tract thanks me on a daily basis (or bugs me a little less). My eyes aren't red when I wake up. On days that I neglect the water drinking, I feel it. I don't let myself drink any caffeine in the morning until I slug back 20 ounces of lemony water first. Works like a charm. —Melissa Clark, food columnist for the New York TimesI would care less about what people thought of me. I used to let the fear of people's perceptions inhibit me and hold me back. I wouldn't let that happen now. —Audra McDonald, actor in Frankie & Johnny on Broadway / The Good Fight on CBS All AccessI would have switched from cocktails to red wine earlier. I'm a sucker for a margarita on the rocks with salt, and my go-to drink in my 20s and early 30s was a gin and tonic. But I realized through time, wisdom, and hangovers that I pace myself much better during a dinner party when I nurse a glass of wine. — Michelle Lee, editor in chief of Allure MagazineI don’t imagine many Healthyish readers want to hear about how I wish I took golf lessons in my 30s. But I guess my feeling is this: Whatever it is that you love to do, that you really want to get better at, do it now. Because if you’re thinking that you’ll have the time when you “settle down,” when you get a spouse and a house and kids and all that, you won’t. Your time is now—take it. —Adam Rapoport, editor in chief of Bon AppetitSpend less time worrying what other people think about you. You will have your good and bad moments, but keep an even keel. — Michelle Yeoh, actor, Crazy Rich AsiansMy first child was born when I was 31, and my second arrived when I was 37. I'm happy that the baby years are far behind me, but it's crazy that I spent my entire 30s parenting and building my career. There's no evidence that being a mom held me back professionally, but I think my husband and I missed out on some freedom—we would have traveled more, we would have stayed out later, we would have gotten the opportunity to be a little less responsible. — Carla Lalli Music, food director of Bon AppetitI had a hard time being present with my kids when they were young as it was right when the company was beginning to expand. I would come home and keep thinking about work or read reports. So I wish I would have been more present with my kids. That is one of my biggest lessons: Be present where you are. — Eileen Fisher, designerBreak up more. Seriously. Dump that boyfriend, get that divorce. You’re not even 40 yet! There’s plenty of time to find new love—why waste your 30s with the bad? —David Tamarkin, digital director of EpicuriousI would have gone back to cooking school for real and become a chef! I took a few classes while I was out of work with the twins, but ended up at Domino. —Stella Bugbee, editor-in-chief of The CutI would’ve slept more and spent more time doing activities that strengthen my body to avoid aches and pains. More yoga, more strength training, more stretching and regular physical therapy. — Niki Nakayama, chef/owner of n/nakaI would have answered fewer emails and spent more time with my children. It's not too late though—the last year of my 30s will be spent centering what matters most. —Leah Penniman, co-founder and co-director of Soul Fire Farm.Looking back, I wish I would have carved out a little more personal time. Opening my first restaurant in my mid-30s was both exciting and stressful and I poured everything into it. I think it's important to take some carved out, dedicated time each week to step back, refuel and recharge. — Nina Compton, Chef/Co-owner of Compere Lapin and Bywater American Bistro in New OrleansI wish I had traveled more. Travel is the key to understanding everything, especially home. As a chef that translates home-cooking techniques to restaurant cooking, my travels inform everything I do. —Alex Raij, chef/owner at Txikito, El Quinto Pino, La Vara, and Saint Julivert FisherieI would have valued my female friendships as much as my romantic ones: All of those women are still an essential part of my life. The men? Not a one. —Christine Muhlke, Bon Appetit editor-at-large and founder of Bureau XI would have proactively taken better care of my body. Cooking is extremely physical and very hard on your body as the years go on. I found pilates in my 40s and it has helped significantly, but I can only imagine how much better I would feel today if I had been doing it all along. —Missy Robbins, chef/owner at Misi and LiliaI would have had five kids! I have one—he is my inspiration and motivation and heart wrapped in one. Having more would have been so fun (and kept me even more so on my toes)! —Gabriela Cámara, chef/owner of Contramar and CalaWhat I would definitely do differently would be to commit to my love of dance, drag, kink, fashion, and art just as much as I committed to my work. I would find a better balance between my duty and the dance floor. —Ora Wise, activist, organizer, and cookIn my 30s (and 40s and a little less in my 50s) I was very driven and life was all about work, work, work. I’d have taken more time for mental health, and put more time and effort into creating and supporting friendships. — Liz Prueitt, co-founder of Tartine BakeryExplore Bon AppétitHealthyishGuide to Your 30sRead MoreLifestyleLauren Underwood Is Doing Her 30s Better Than Just About Anyone We KnowBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "The Healthyish Team"]}