{"id": "7bb93b59d44716b10929e85c0b88cb15", "url": "https://www.bonappetit.com/recipe/roasted-brussels-sprouts-with-gochujang-brown-butter", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Roasted Brussels Sprouts With Gochujang Brown Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueRoasted Brussels Sprouts With Gochujang Brown ButterBy Peter SomOctober 19, 20214.7(34)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, Food styling by Susie Theodorou, prop styling by Martha BernabeEmailPinterestPrintEmailPinterestPrintRecipe developer and fashion designer Peter Som didn’t grow up with spicy food. Cantonese dishes don’t have the heat of Sichuan or Hunan cooking, and it was only many years later, after he moved to New York, that Som came to appreciate the wide range of Asian cuisines that balance heat and sweet. The combination of Korean gochujang, maple syrup, and brown butter creates that ideal union in this side dish, a staple at his Thanksgiving table. If you can’t find gochujang (he likes the one from Mother-in-Law's brand), Som suggests using 2–3 Tbsp. Sriracha instead.For the rest of Som’s Thanksgiving menu, see his recipes for Asian Pear Salad With Peanut-Lime Dressing, Sweet Potato Tian, Dutch Oven No Mai Fan, Char Siu Wellington, and Milk Tea Bread Pudding With Crème Anglaise.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronGochujang$13 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMicroplane Grater$16 At AmazonSmall Saucepan$155 At AmazonMedium Skillet$60 At AmazonIngredients8 Servings3lb. brussels sprouts, trimmed, halved if large2Tbsp. extra-virgin olive oilKosher salt, freshly ground pepper½cup coarsely chopped walnuts (optional)6Tbsp. unsalted butter⅓cup gochujang (Korean hot pepper paste, such as Mother-in-Law's)2Tbsp. pure maple syrup3scallions, thinly sliced, divided½lemonFlaky sea saltPreparationStep 1Place racks in upper and lower thirds of oven and set a rimmed baking sheet on each; preheat oven to 500°. Toss brussels sprouts with oil in a large bowl to coat; season with kosher salt and pepper. Carefully (baking sheets will be hot!) divide brussels sprouts between baking sheets and spread out in a single layer; reserve bowl. Roast, rotating baking sheets top to bottom and front to back halfway through, until brussels sprouts are charred in spots and tender, 16–18 minutes.Step 2Meanwhile, if using walnuts, toast in a dry medium skillet over medium heat, tossing often, until fragrant and slightly darkened, about 4 minutes. Transfer to a small bowl and let cool.Step 3Cook butter in a small saucepan over medium-low heat, swirling occasionally, until milk solids are a deep amber color and butter smells very nutty, 5–8 minutes. Remove from heat and stir in gochujang and maple syrup. Season with kosher salt and pepper.Step 4Combine brussels sprouts, half of walnuts, and half of scallions in reserved bowl; add brown butter mixture and toss to coat. Transfer to a platter and scatter remaining walnuts and scallions over. Finely grate lemon zest on top; sprinkle with sea salt.How would you rate Roasted Brussels Sprouts With Gochujang Brown Butter?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleDelicious! Don’t leave out the lemon zest - it adds a fresh finish to a spicy/sweet/crunchy/gooey dish. Anonymous12/11/2021This recipe was so delicious that my guests were putting the extra sauce on everything and begging for more.  I added lemon peel and the juice of peel of half a lemon.  Didn't use all the sauce on the sprouts, seemed like too much but it was used up!! Have made it numerous times, with and without the walnuts.  It's a keeper! I air- fried the sprouts last time and worked well too.AnonymousLakeport CA12/7/2021My mouth had a party! I could taste the layers of flavors, the nutty butter, maple syrup, onion, toasted nuts, lemon zest and of course the gochujang. This was so, so, good. Every time a recipe calls for “roasted” my brain translates to burned and dried out so I covered the Brussel sprouts and baked on 375 for about 25 min. I chopped the pecans, finely chopped the onions (didn’t have walnuts and ate the scallions the night before) and once the gochujang was flavored and the butter separated I poured off most of the butter because it was too much; the nutty butter flavor remained. \n\nI put everything in a bowl and tossed! I'll make this dish for Christmas and will add more lemon zest. Again, so, so good!\nAndiWashington, DC12/4/2021Fantastic combination of flavors! I never thought of gochujian and Brussel sprouts, but when combined with the butter and maple syrup, my taste buds exploded and did the happy dance!DebbieKBarrington IL11/29/2021Absolutely delicious! Made these for thanksgiving this year, and they were a favorite of all who came. I did add a splash of rice wine vinegar to the sauce, and also used crushed peanuts instead of walnuts. Delicious and easy to make. LoulouChicago, IL11/26/2021This came together quickly on a weeknight and was well received. Subbed honey for maple in a pinch. Served with miso mashed potatoes also featured in this months issue. \n\nIf I could add one thing it would be crunch. Maybe crispy shallots on top or pork katsu on the side. CambroWestport WA11/18/2021Without a doubt, absolutely delicious.  Easy prep. The spice is subtle (I used Sirachi). Presentation is decadent.  I lined a no-rim cookie sheet with parchment.  Saves on clean up.  My test kitchen (my family) gave it 2 thumbs up for Thanksgiving.RedheadChicago, IL11/15/2021I followed the advice of previous reviews and added rice vinegar to the sauce. I also used extra lemon zest and extra scallions after combining the sauce and brussels. This was saucier than I was expecting but that's not a bad thing. I used Mother-In-Law's \"extra spicy\" gochujang and the sauce definitely had a kick but it wasn't too much. Will make again!Killer_BeetsAtlanta, GA11/12/2021Saw the previous review saying this recipe needed some acid so I mixed in some rice vinegar which also helped to thin the sauce a little. Never cooked brussels sprouts at this high of a temp but turned out great.AnonymousMorgantown, WV11/4/2021Made as written sans optional walnuts.  Taste buds wanted a touch of acid in the gochujang brown butter sauce so used a splash of Rancho Gordo pineapple vinegar but lemon juice or other would have worked too.  Used more lemon zest than specified to finish.  Will use more scallions next time.  Keeper.dimmerswitchBoise ID10/23/2021Explore Bon Appétitbrussels sproutVegetarianRoastgochujangSideThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Peter Som"]}