{"id": "7bbed49d9b28fd1e021478523e70d7f7", "url": "https://www.bonappetit.com/story/trader-joes-reviews-2020", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "I Solemnly Swear to Honestly Review Everything at Trader Joe’s in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesShop safely and smartly, my friends. By Alex BeggsFebruary 4, 2020FacebookTwitterEmailPhoto illustration by Walter GreenFacebookTwitterEmailTen days ago, at 7:54 a.m., I saw the line to get into Trader Joe’s. It stretched halfway down 21st Street in New York’s Chelsea neighborhood, and I joined it, which felt like the dumbest thing in the world. The crowd, the risk, the chaos. (This was right before social distancing was implemented.) Inside the store, the shelves were stocked and I grabbed the new snacks I set out to review every month–for entertainment purposes–alongside frozen broccoli, frozen cod, and orange blossom hand soap—for isolation purposes. One woman had a modestly filled cart that included three bags of elote chips (I salute you, lady). The bottled salad dressing was going fast. The frozen pizzas were depleted. When a shopper returned a carton of oat milk back to the display, I marveled at her self-knowledge: Nah, she realized, I don’t really need this. Imagine that moment of clarity. Employees were restocking shelves and shouting out cheers with a shock of high energy. My own cashier told me that “everything was going to be okay,” and he was convincing.These are strange times to humorously review cheese bites and trek mix. I want to distract you. I want to cheer you up. But please shop only when necessary and in off-peak hours (call your store to find out when that is). Wipe down shopping carts, wash your hands before and after shopping, and be mindful of other shoppers. Stock at Trader Joe’s is inconsistent across the country right now, but if you see that strawberry beverage, pick some up—your vodka needs it.Photo by Alex BeggsBreakfast stuffOrganic Oatmeal Cups, $1.69Start your quarantined morning with a shower, a good slather of moisturizer, a hefty serving of concern for mankind, and a cup of oats, lightly sweetened. These even have a sprinkle of flax and chia seeds, which makes this instant oatmeal slightly more filling than the plain ones. The rest of your day might derail into a “chip stash depletion,” but you started off on the right foot, at least.Organic Bran Flakes Cereal, $2.29These boring brown flakes are just the bare-bones energy provider this dystopian world can rely on once wifi runs out, snarling dog-owners patrol the streets, and the only show left on NPR is Will Shortz doing the weekend puzzle, but no one knows the answers. And they’re slightly sweet, like your text from March 11 telling someone “this’ll all clear up in a few weeks.”Photo by Alex BeggsSnacksChile & Garlic Cashews, $5.99Not that spicy and garlicky tbh, but a good friend to beer. Beware: the dry spice coating makes you cough, which is one way to trigger anxiety on a dime.Oven-Baked Cheese Bites with Black Summer Truffle, $2.99Love to review truffle-flavored cheese rocks while nurses are risking their lives for the sake of you and me. And look at me: I’m reviewing dehydrated cheese. The truffle’s intense. But so is THE ENTIRE WORLD AROUND US.Photo by Alex BeggsRandom spicesVegan Chicken-less Seasoning Salt, $1.99Is there normally chicken in spices????Everything But The Elote Seasoning Blend, $2.49This is one of the season’s most hyped new Trader Joe’s products. I can say that because I follow this kind of shit. The first ingredient listed is cane sugar, and the blend is sweeeeet, but then there’s powdered parm and a hint of spice, corn flour, and an overall MSG-like magic. I sprinkled in on popcorn and for a brief moment, allowed happiness in.Photo by Alex BeggsSweet thingsAlmond Flour Chocolate Chip Cookie Baking Mix, $4.99Chewy, nutty, and pretty amazing, all things considered! (A world in shambles.) Add a dash of almond extract, live large while life seems small.Crispy Coconut Rolls, $1.99These inch-sized roly-poly Thai cookies would be as deliciously surreal as a romantic dinner in a crowded restaurant, but the coconut either went rancid or the vacuum-sealed packaging is giving off a chemical aftertaste. Let me eat 17 more to decide how much I can really detect it.Photo by Alex BeggsSparkling tea, sureOrganic Sparkling Yerba Mate & Organic Sparkling Green Tea, $1.49This optimistic green tea “beverage” is more grapefruit-mint body wash than green tea, with a Listerine strip aftertaste. Still more flavorful than La Croix.The Yerba Mate flavor is better, almost peach Snapple-y. Tannic tea notes and bright orange. Drinking this makes me hopeful for summer, but maybe that’s just the caffeine jitters.Photo by Alex BeggsThing in a bagMiso Vegetables and Brown Rice Sauté Kit, $4.99A bag of shredded vegetables and a sweet miso sauce, plus an inexplicable brick of vacuum-packed rice, which I gave up and threw in the compost after I couldn’t break it up in the pan. Seriously, a brick.Photo by Alex Beggs...A Keto momentKeto Fudge BitesGreasy, chalky, chewy Tootsie Roll squares. The definition of “inessential.”Photo by Alex BeggsSad dinnersCorn Poblano Chowder, $1.99Chunky.Mandarin Style Orange Chicken Bowl, $3.99After nuking the plastic bowl for three minutes, my kitchen filled with the scent of McDonald’s chicken nuggets. But the actual chicken, nice fatty dark meat drenched in a syrupy orange sauce, was soggy and flabby. The baby food-sized cubes of frozen carrots and mushy peas made me feel helpless. Has it really come to this?Photo by Alex BeggsA snack and a bevSavory Banana & Nuts Trek Mix, $2.99There’s cumin or curry powder in here but I’ll never know what exactly, because the ingredients just say “spices.” Whatever, the spiced banana chips are amazing, and while the walnuts aren’t toasted and should be, I scarfed a bag of this and pretended our world was still trekkable.Sparkling Strawberry Juice Beverage, $3.99/4-packFAVORITE. This is not mystery-essence-flavored seltzer, but more of a Spindrift situation, with actual strawberry juice a.k.a. 15 grams of sugar. But who’s counting! We have more important things to count right now, like what’s left of our retirement savings. I mixed my beverage with vodka and felt a fruit punch rush of sweetness go straight to my heart, filling it with hopeful joy or some impersonation of it. And I’ll take all of that I can get.PreviouslyPhoto by Laura MurrayCHIPS N DIPDark Russet Potato Chips, $2.29Whispers into the dark: Utz...that you? Some secrets shall never be revealed, but let me reveal to you that these are Trader Joe’s best chip since elote corn dippers. They’re darkly fried, near-burnt kettle chips with a bubbled brown topography. The bag has a GIANT chip with the disclaimer: “enlarged to show texture.” It looks like a skin graft under a microscope. Ignore that; buy the chips.Jalapeño Artichoke Dip, $3.69THIS is what the people want. This is what the people need! Cream cheese, mostly, with a few shreds of artichoke and hot green pepper hither and thither. Despite inhaling the entire container, my esteemed culinary coworkers felt there could have been a bit more seasoning—MSG, onion powder, something—to amp up the flavor. But I have proof Christina Chaey bought another container last weekend anyway.Buffalo Chicken Dip, $4.99“There’s something weird about eating chicken...out of a hummus container,” said one taster when hoards gathered ‘round to try this creamy and barely spicy dip that yes, contains little chunks of cooked chicken. It had a strange, haunting power over us. Why was it so good? Was it...safe? Only later did we realize you’re supposed to heat the dip before serving. Guess I’ll have to buy more!Photo by Laura MurrayFrozen stuffOrganic Açaí Bowl, $3.99 This is a rustic ruddy burgundy/mauve cold sweet soup featuring a few frozen blueberries and stray strawberry coins. Not worth the plastic wrapping you have to murder if you ask me. (No one ever asks me.)Pappa al Pomodoro, $3.69 A soup made with blended bread, featuring a crusty piece of intact toast on the package. Misleading! Because what this pasta sauce-y soup needed was, actually, even more bread. The mushy nubs in the tomato soup nubbed me the wrong way.8 Mini Croissants, $4.49Throw these in the oven for 26 minutes and you’ll be blessed with butter-leaking croissants in a variety of lumpy slug shapes. Seriously, there’s enough grease here to repair every squeaky hinge in your house.Kale Gnocchi, $2.69 An inevitable follow-up to the confoundingly popular cauliflower gnocchi, these look like the severed fingertips of the Jolly Green Giant, say, if he got in trouble with the mob. And they taste like straight-up Miracle Gro. Concentrated plant flavor. A cream-based sauce is NECESSARY. Butter is NOT ENOUGH.Kunefe, $3.99 One of my favorite desserts in the world! Kunefe is a Middle Eastern dish with a bouncy cheese base encased in shredded phyllo, topped with honey/syrup and pistachio. This version is miniscule. The diameter of a corn tortilla. It served two people. Ideally, Trader Joe’s would start selling the shredded phyllo so I—ALL OF US—could make it in a much bigger dish.I Dream of Chocolate Cake, $6.99 Once you thaw this from the freezer, it’s a rectangular stack of chocolate goo. Do you see me complaining? The cake part is MOIST as it should be. There are spongy chocolate cubes on top that offer a textural thrill, and isn’t that what you wanted??Photo by Laura MurrayRandom SeasoningsOrganic Chili Seasoning Blend, $2.29Bitter aftertaste.Nori Komi Furikake Japanese Multi-Purpose Seasoning, $2.49Gets the job done.Photo by Laura MurrayETC.Peanut and Crispy Noodle Salad Kit, $3.99Evil salad kits! How annoying that this one is pretty good. The pre-shredded cabbage gets dry, but the peanut dressing is sweet and nutty, and there are crispy fried noodle tidbits. Hated how much I liked this. Hated!Barista Espresso Coffee Blend, $5.99Now you can make two-star hotel coffee at home. Tight.Glazed Chocolate & Sour Cream Glazed Donuts, $3.99Too dry, almost as if on purpose, so that they can soak up coffee in their thirsty crumbs. Chocolate is better, because they have more ridged edges for dipping.Overnight Oats, $1.99My review is me standing in front of my open fridge door, shaking my head.Toasted Granola Bark, $3.99A bag of granola bars, or as I like to call them, candy bars (I am fun to be around). One side is coated in chocolate to hide the drywall beneath.Read last year’s here!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-04", "author": ["Condé Nast", "Alex Beggs"]}