{"id": "7bc1018b844049c6cdf0a2fb3104b516", "url": "https://www.bonappetit.com/story/what-is-orgeat", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "What Is Orgeat Syrup, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Orgeat, Anyway?The secret to summery cocktails, year-round.By Antara SinhaAugust 10, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.That nutty creaminess that’s the signature of many Tiki-inspired drinks—like, say, a classic mai tai, refreshing Kona swizzle, or fruity, crowd-pleasing rum punch—likely comes from one superstar ingredient: orgeat. Pronounced “or-zha” or “or-zhat,” this milky syrup is mildly floral, not cloyingly sweet, and can add extra oomph when good ol’ sugar water falls a little flat. But what is orgeat, other than a fancy cocktail ingredient with a name that’s extremely fun to say out loud? Allow us to explain.What Is Orgeat?Originally made from grain—it got its name from the French word orge, meaning “barley”—orgeat syrup is now most traditionally made from a combination of almonds (and sometimes other nuts) and orange flower water. This nonalcoholic sweetener is typically made one of two ways: either steeping finely chopped nuts in a simple syrup, or making a syrup by adding sugar directly to a prepared nut milk that is then cooked low and slow. It’s a little viscous and a light beige to golden in color (depending on the blend of nuts used), and it has a subtle perfume from that orange flower water. Different brands and regional variations may also include warming spices like cinnamon and clove, or other flavorings like vanilla or rose water, or a blend of different nuts that may include hazelnuts, macadamia nuts, and pistachios. It’s versatile, delicious, and a worthy addition to your bar cart or pantry.Not all brands are created equal—some companies rely on artificial flavors or corn syrup to add bulk—so for maximum cocktail pleasure, be sure to grab the good stuff. We’re big fans of L’Orgeat, B.G. REYNOLDS Orgeat, and Liber & Co. Syrup, all brands made domestically from real cane sugar and other well-sourced ingredients.B.G. REYNOLDS Orgeat, 25.4 Fl Oz$28 at AmazonLiber & Co. Syrup, Almond Orgeat, 9.5 Ounce$18 $12 at AmazonHow to Use OrgeatThe most obvious way to enjoy this aromatic syrup is in cocktails. Having a bottle or two of orgeat on hand means an iconic mai tai or a warming Amaro cocktail is only a trip to the liquor store away. You can also add a splash to a tall glass of seltzer or tart lemonade for an easy, refreshing, and complex nonalcoholic cooler. But orgeat has potential beyond the wonderful world of cocktails and mocktails. It’s delicious drizzled over fresh summer fruit (especially stone fruit like peaches and plums), pound cake, or ice cream. Wherever you need a little floral, complex sweetness, orgeat can provide.Get the RecipeMai TaiEvoke the tropics with one sip of this classic cocktail. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Antara Sinha"]}