{"id": "7bc71fc0b8974f04b8dd2f6e611ccb96", "url": "https://www.bonappetit.com/story/khao-noodle-shop-beef-jerky", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "I Can't Go to Dallas to Eat Khao Noodle Shop Beef Jerky...But It Can Come to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Can’t Go to Dallas to Eat Beef Jerky at Khao Noodle...but It Can Come to MeLaced with lemongrass, garlic, and fish sauce, this jerky is my ultimate WFH snack.By Hilary CadiganNovember 16, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Back in June of 2019 (was that last year...or like five days ago? I could not tell you), I got to spend a long weekend gallivanting around the city of Dallas, our 2019 Restaurant City of the Year, eating everything I laid my eyes on in the name of journalism. There was a lot of impressive food there—that’s how it got named City of Year, after all—but one restaurant in particular lodged itself into my memory and has not left since, intervening apocalypse and all. That was Khao Noodle Shop (our No. 2 Best New Restaurant of 2019), where chef Donny Sirisavath pays tribute to his late mother with highly personal riffs on Laotian street food.It’s the kind of place where you want to bring a couple friends and order the entire menu to share family-style, from the hot bowls of noodles to an array of handheld snacks like fried shrimp bites, tapioca dumplings, and very addictive beef jerky. It’s the kind of place I dream about now, trapped in my 600-square-foot cell in Brooklyn remembering the days when we could fly across the country, pass around a communal bowl of sukiyaki, and reach our grubby little hands into the same jerky basket over and over without a care.So yeah, I can’t go back to Dallas or even share food right now. But lucky for me, Khao Noodle Shop now sells its jerky to-go—and ships it nationally.To make the stuff, Chef Sirisavath marinates hunks of Angus eye of round beef in soy sauce, garlic, lemongrass, cracked peppercorn, and brown sugar caramelized in fish sauce. Then he lays out the strips of beef on a drying rack, dehydrates them for four hours, and flash-fries each one. The result is a seriously moist and meaty bite drenched in salty-spicy flavor—eons away from the gas station beef jerky you’re probably used to (which, for the record, I also like).And while I miss the baskets themselves, and the communal tables, and watching Sirisavath and his team work in the open kitchen, this is the next best thing. It’s the desk snack I crave even when my desk is my kitchen table and an entire refrigerator’s worth of food sits just four steps away.Khao Noodle Beef Jerky$13 at Khao NoodleExplore Bon AppétitHighly RecommendDallasShoppingRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Hilary Cadigan"]}