{"id": "7bd8e4bb4be37253b3e78fe317e632ac", "url": "https://www.bonappetit.com/recipe/sesame-scallion-sauce", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Sesame-Scallion Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSesame-Scallion SauceBy Kat BoytsovaFebruary 12, 20194.2(5)Read ReviewsTriangleEmailPinterestPrintPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis fresh green sauce is more than versatile: drizzle it over eggs, toss it with salad greens, or use it as a marinade for shrimp. Use with Chicken and Cucumber Rice Bowls and/or Greens-and-Beans Sandwiches.IngredientsMakes about ¾ cup5scallions, trimmed1cup coarsely chopped parsley¼cup unseasoned rice vinegar2Tbsp. grapeseed or vegetable oil1Tbsp. toasted sesame oil1Tbsp. honey1serrano chile, thinly slicedPreparationStep 1Purée scallions, parsley, vinegar, grapeseed oil, sesame oil, and honey in a blender until smooth. Add half of chile and blend until incorporated; add water a teaspoonful or so at a time if sauce is too thick (should be the consistency of heavy cream). Taste sauce; chiles range in spiciness. Add more if desired, blending again to incorporate; season with salt.Step 2Do Ahead: Sauce can be made 3 days ahead. Transfer to an airtight container; cover and chill. Whisk to reincorporate before using.How would you rate Sesame-Scallion Sauce?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis sauce is life.  I made a tweak.  I added three cloves of garlic confit, a teaspoon of fish sauce, and salt to taste.  It’s next level.  #cookingwithtff Everyone raves about it.  I put it on everything!  I even put scallion sauce on my scallion sauce.  billy_thomNorwalk, CT6/22/2019The brightness of the rice vinegar & parsley balances perfectly with the nutty intensity of the sesame oil. I want to put this on everything!AnonymousBrooklyn, NY2/26/2019I made this with the big batch chicken thighs for a dinner party and everyone loved the sauce, myself included.  the rice vinegar added just the right amount of acidity. I used the whole serrano and the sauce still wasn't spicy, just had a nice serrano flavor.  I also thinned the sauce using a little extra grapeseed oil instead of water.AnonymousSanta Cruz, CA2/25/2019The flavors were all wrong for my taste. :( The consistency of the sauce didn’t turn out like I thought it would, but I blame that on my poor blender and using crystallized honey.Anonymous2/20/2019Explore Bon AppétitCondimentSalad DressingSaladSauceMarinadeScallionOnionVegetableParsleyHerbs & SpicesQuickDairy-FreeGluten-FreeVeganVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}