{"id": "7be007221b87f31aa077f064e02485b2", "url": "https://www.bonappetit.com/story/coconut-floss", "year": 2019.0, "month": 6.0, "day": 5.0, "content": "Cocofloss Turned Me Into a Daily Flosser | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Coconut Oil Floss Turned Me Into a Daily FlosserI'm never lying about my flossing habits again.By Aliza AbarbanelJune 29, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I used to lie to my dentist. In my defense, I’m pretty sure everyone lies about flossing, because it’s the most tedious act of self-care on the planet. That is, until Cocofloss entered the oral hygiene game.Created by a practicing dentist and her artist sister, Cocofloss is coated in coconut oil and gently flavored for an all-around better flossing experience.  I'll be real: Luxury dental floss is a luxury indeed. But after I saw several glowing Sephora reviews from dental hygienists, I needed to try it for myself. My gums need all the help they can get.The tropical packaging and fresh coconut scent were admittedly very cute, but for once, the actual feeling of flossing won me over. That's thanks to the addition of coconut oil, a natural antimicrobial that soothes while removing slippery plaque and sticky food scraps. The post-flossing clean mouth feeling is nice, but the smug sense of self-satisfaction that comes from daily flossing is the best feeling of all.—Aliza Abarbanel, assistant editorBuy it: Cocofloss, $9All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingRead MoreLifestyleA Tool to Clean (Like Really Clean) Your TongueBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-29", "author": ["Condé Nast", "Aliza Abarbanel"]}