{"id": "7be75808b06c1084fb6dfeafd0921f49", "url": "https://www.bonappetit.com/story/just-vegan-egg", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "The Vegan Eggs Substitute That's So Good I Feel Guilty Eating It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Vegan Egg Substitute Is So Good I Feel Guilty Eating ItI had to check the label twice to make sure what was on my plate didn’t come from a chicken.By Kyle BeecheyFebruary 12, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailThe egg: versatile, protein-rich, great at any meal, for a snack, and don’t even get me started on its power as a leavener, binder, and emulsifier. You'd think I’d be a two-egg-a-day woman, but the truth is I haven’t had the pleasure of cracking one in a decade. I’ve been a vegan since 2009, and I miss eggs more than anything. I’ve always been a savory- over-sweet breakfast person, but, without eggs, what’s left? I’m plenty familiar with tofu scrambles and chickpea flour omelets, decent visual doppelgängers that don’t really approximate the real thing. And don’t talk to me about savory oats.Then, a few months ago, my favorite deli began churning out these amazing vegan breakfast sandwiches with something called a JUST egg. I had to know the deal, so I ordered some JUST for myself.My \"egg\" arrived in a 12-ounce bottle, frozen and nestled in dry ice. Thankfully it was 100-percent gimmick-free: no carton or artificial shell. The color was the appropriate yellow. I pulled up a suggested recipe and started with a Sunday morning mini scramble. My pan was hot, greased, and ready. I put in a quarter cup and instantly it adhered to the pan just like an egg! The yellow liquid bubbled, changed color, and even stuck to the sides where I hadn’t oiled. I finished my eggs with a sprinkling of sulfur-y Kala Namak salt. How did it taste? Have you ever eaten an egg? I had to check the label twice to make sure what was on my plate didn’t come from a chicken.Vegans, rejoice: You too can make a soy-ginger dinner scramble.\nNope, the ingredients are all plant and 98-percent of them are water, mung beans, and canola oil. The real revelation here is that mung bean protein, when isolated from the rest of the bean, tastes and scrambles just like an egg. Welcome to 2019, a time when a vegan frittata is totally possible.Okay, so JUST eggs could compete against any omelet or scramble but what about in secondary uses like French Toast or in a nice egg wash over a (vegan) turnover? Done and done. Perfectly bouncy, crispy, toasts emerged from the pan, and the turnovers I whipped up were golden brown. Another little bonus about this egg is that, nutritionally, it's pretty close to the original chicken version.JUST has yet to conquer a few of eggs’ greatest gifts. It isn’t advisable to go baking cakes, fussing with creme brûlées, or stirring it into salad dressings. But I have faith that day will soon come. In the meantime, I can look forward to working on my French omelet technique and resurrecting breakfast for dinner, which ten-year-old me was super-into. Scrambled JUST eggs, a side of (mushroom) bacon and (coconut) buttered toast. Don’t @ me; it’s delicious.Buy JUST Egg in select stores and online at Jet.com, $9.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishVeganEggShoppingRead MoreLifestyleThis Vegan Creamed Spinach Recipe Will Fool ALL the Dairy Lovers at the TableBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kyle Beechey"]}