{"id": "7bfc4f81ee7b9e1976523ec814caf7fc", "url": "https://www.bonappetit.com/story/drew-barrymore-pilar-valdez-rebel-homemaker-cookbook", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "How Drew Barrymore and Pilar Valdes Wrote Their Cookbook, 'Rebel Homemaker' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Drew Barrymore and Chef Pilar Valdes’s Friendship Culminated in a CookbookThe pair discuss their friendship, kitchen preferences, and their new book, Rebel Homemaker.By Nico AvalleDecember 9, 2021FacebookTwitterEmailPhotography by Graydon HerriotFacebookTwitterEmailDrew Barrymore didn’t always love to cook. When she first lived alone, at 14 years old, she stuck to instant ramen, boxed mac and cheese, and egg-in-a-hole toasts. But as an adult, sharing food with her friends and loved ones has become one of her favorite things, and her close friend and personal chef, Pilar Valdes, is a big reason why. The pair met in the midst of major life transitions, and they found solace and inspiration together in the kitchen. Now their professional and personal relationship has culminated in a new cookbook, Rebel Homemaker: Food, Family and Life, a collection of recipes and stories from Barrymore and Valdes. Read all about it (or listen to their appearance on our podcast, Food People, below.ContentThis content can also be viewed on the site it originates from.This interview has been edited and condensed for clarity.How did you two meet?Drew Barrymore: I want to hear Pilar’s perspective, just out of curiosity, Even though I feel like I know what she’s going to say. I was living in a rental apartment, I was getting divorced, I was really lost and extremely, honestly, emotional and raw and vulnerable and unhappy. And when all your plans blow up in your face, especially when there are kids involved, those are the highest stakes of your life. And so that’s where I was at when I met Pilar.Pilar Valdes: Drew always refers to that time in her life as a “great transition,” on multiple levels. And I think I was also going through a very big transition. I have a catering company called Kickshaw Cookery, and a few years prior, my business partner left for Texas to be closer to family. At the time I was kind of reeling a little bit under the weight of running the business on my own. And I’ve always worked best in community, so I told myself, “I’m gonna pause and step back a little.”It was around that time, when I was trying to figure out what to do with my cooking, when one day I woke up to an email—I think it was like 4:30 in the morning, which is usually when I get up for my kitchen shifts anyway. The subject line was, you know, “Chef with Drew Barrymore.” And I literally thought I was being punked. But, sure enough, you were looking for [a personal chef], you were moving to New York, and I was just like, “This is bananas and so outside of what I even would have been considering. But I’m just gonna say yes. Let’s just see where it goes.”How do you two cook together?Valdes: Drew has one of the most impressive cookbook collections I’ve ever seen, so we will literally just lay out the cookbooks on the kitchen island, and all they’re dog-eared, and we’ll flip through them, taking inspiration from different recipes, being like, “Oh,” we’ll say, “maybe we can do a fully Thai menu today.” Or we’ll find something like an Ina Garten dessert and decide to make it for the kids.Barrymoore: I love food from around the world and learning about food from around the world. I also love experimenting, and so it’s been so fun to come to Pilar and say, “What if we tried this? What if we did that? I’ve always loved this combination.” And through her, I felt like I could spread my curiosity and culinary wings, and it’s just not something I would have done by myself or on my own. I think I’m someone who, for better or worse, doesn’t have the capacity to sit around and be content. I’m always gonna want to carry something to the next level.Valdes: One of the things I think folks should know about you is that you have an incredible palate.Barrymoore: Really?Valdes: And an incredibly wide-ranging palate. So as a chef, that’s a really, really fun thing to cater toward because it sort of gives you room to play and try new things all the time. And so it was always like this really wonderful challenge.When and how did you know you wanted to write a cookbook?Valdes: I feel like Drew threw out the idea of a cookbook fairly early on after I’d met her. But at the time it was just this little spark of an idea. Drew does that occasionally. She’ll have a little dream that she’ll sprinkle here and there and kind of walk away and sort of see how it settles.Barrymoore: And after everything we cooked, and especially if we liked it, I’d ask Pilar, “Did you write it down? Did you write everything down, Pilar?”Valdes: I’d be like, “Uh, no.” I’m a very intuitive cook, so maybe I would write down the name of whatever I made. But sometimes, you’re using whatever you have on hand, you’re being flexible to what’s available in the kitchen you’re in, and you’re swapping things out here and there. But Drew really started to drill it in me to get into the habit of keeping track of things to prepare for the potential of a writing opportunity.Why write a cookbook now?Barrymoore: Pilar and I were already kind of rubber-hits-the-road working on The Drew Barrymore Show and figuring out what we wanted to do culinarily speaking with the series. So when the opportunity to write the book came in our laps, we were like, “All right, we can do this too.” But we were in the height of the pandemic and it got very daunting and overwhelming, very fast.Valdes: I mean, seriously. Leave it to Drew to launch a show and a cookbook in the middle of the pandemic. They were definitely intense times, especially because this is our first go at a cookbook, and to do that when we couldn’t even be in the same room as a lot of the team was a little daunting.Barrymoore: I’d been offered to do a few cookbooks over the years, and I always said, “Oh, no. I would not be the person you want for this endeavor.” I felt (a), ill-equipped, (b), like I would be creating imposter syndrome for myself, and (c), worst of all, like I didn’t want to be some lifestyle expert who is polished on the cover of books. I believe in people when they really are who they are, and to me, chefs are very authentic people. I just did not feel I belonged in that world.So when I met Pilar and this ember turned into a flame and the opportunity came around again, it was very different for me that time. We had been in the kitchen for a few years at that point. I had a point of view. I thought it would be amazing to document this. Obviously, I must have subconsciously known that the whole time because we did document it.Valdes: That’s also the thing about the book: There’s so much there. We really had to narrow down the recipes, but I think what we chose were mainly recipes from this home.Barrymoore: They’re what we make. That’s true.Explore Bon AppétitCulturePodcastsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-09", "author": ["Condé Nast", "Nico Avalle"]}