{"id": "7c06ad4fddaa7aef4a1edff2d4ff0591", "url": "https://www.bonappetit.com/story/never-fail-winter-squash-carbonara", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "When Winter Gives You Squash, Make This Carbonara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Winter Gives You Squash, Make This Carbonara RecipeLooking for a silky, ultra-creamy pasta sauce with a solid serving of vegetables? Start peeling some winter squash!By Elaheh NozariJanuary 18, 2019FacebookTwitterEmailPhoto by Christina Holmes, Food Styling by Rebecca Jurkevich, Prop Styling by Kaitlyn Du RossFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I was raised to be suspicious of creamy food, a fact that I blame partly on growing up in a household that adhered to a “heart-healthy” diet, and partly on my sensitive stomach, which straight up rejects anything with heavy cream in it.And that's a shame, because eating a bowl of creamy pasta in your pajamas is one of the only good things about winter. The good news? This winter squash carbonara recipe is every bit as rich, silky, and substantial as a classic alfredo or stovetop mac and cheese, but with no dairy in sight. (Okay, it does involve a little bit of Pecorino at the end, but that kind of cheese doesn't make my stomach hurt, and is totally optional.)You really only need squash, onions, chicken stock, and pasta to make this dish—everything else is a nice-to-have. I know this because I’m an infrequent grocery shopper, and more than once this winter I’ve found myself with nothing in my kitchen but a squash, an onion, and half a carton of chicken stock.This recipe might lack the main ingredient of traditional carbonara (eggs), but it does maintain the spirit of the dish—a velvety, silky texture that I didn’t realize a humble vegetable like winter squash (I like kabocha best) was capable of producing. I know for a fact that kabocha squash (and maybe chicken stock) is responsible for making the sauce so addictive because I have made it multiple times without the called-for pancetta, once without garlic, and another time without sage, but every single time I've used kabocha. And every single time it has had same irresistibly creamy consistency. Kabocha for the win!The only remotely hard part is peeling and cutting the squash, which you should get out of the way at the beginning. (Putting it in the microwave for 30 seconds will soften the skin, making it easier to cut and peel. Who knew?) You’re supposed to start off by heating pancetta and sage in the skillet before anything else happens, but if you don’t have those ingredients you can just cut to the chase and throw in the squash, onion, and garlic. After 8-10 minutes, or when the smell of sautéed onions has permeated the room and the fibers of your clothes, add chicken broth, bring it to a boil, then let the whole thing simmer until the mixture looks soft. You want the chicken stock to reduce so that the flavor concentrates, so leave that lid off. (Word to the wise: Don't add salt until the chicken stock has reduced to where you want it, otherwise your sauce will end up too salty.) At this point, your roommates will come out of their rooms and ask what smells so good. Squash sauce!Kabocha squash is the unsung hero of winter vegetables.\nGetty/kittimagesThe key to making this faux carbonara recipe so smooth isn’t cream, eggs, or butter—it's a blender. Once the squash is soft and about half of the broth has boiled away, get out your blender—an immersion blender will work, too—and start puréeing the mixture. (I typically work in batches to avoid squash exploding out of my blender, which is a real evening-ruiner.)Season the sauce with salt, give it another buzz, and taste—it's so good that you'll consider eating it on its own, sans pasta. But once you get it bubbling in a skillet, and toss it with al dente pasta and a splash of salty, starchy pasta water, you'll be glad you waited. Look at that! You have successfully turned a kabocha squash into the most luxurious of carbonaras. Serve it in a big bowl with grated Parmesan, and feel a whole lot less sad about winter.Get the recipe:Winter Squash Carbonara with Pancetta and SageView RecipeExplore Bon AppétitNever FailWinter SquashWinterPastaCarbonaraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Elaheh Nozari"]}