{"id": "7c084f331baa2f6dbd478b319d4a464f", "url": "https://www.bonappetit.com/recipe/banana-leaf-snapper-with-chickpeas-and-coconut-rice", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Banana Leaf Snapper With Chickpeas and Coconut Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueBanana Leaf Snapper With Chickpeas and Coconut RiceBy Marcus SamuelssonDecember 1, 20204.4(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWrapping a whole snapper in banana leaves keeps the fish super moist—and turns the dish into a total showstopper. Banana leaves will lend a sweet, slightly floral flavor to the fish while it cooks, but if you can’t find them, wrapping each fish in parchment paper will still keep it from drying out.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’Ingredients8 ServingsCoconut Rice3cups white jasmine rice, rinsed1½cups unsweetened coconut milkKosher saltSnapper25-lb. or four 2½-lb. head-on whole fish (such as red snapper or black sea bass), cleaned1lb. package fresh or frozen, thawed banana leaves (optional)Kosher salt1lime, thinly sliced into rounds6garlic cloves, thinly sliced13\" piece ginger, peeled, cut into matchsticks1small handful cilantro sprigs1small handful mint springs2cups unsweetened coconut milkChickpeas and assembly½cup unsweetened coconut flakes¼cup extra-virgin olive oil315.5-oz. cans chickpeas, rinsed2jalapeños or serrano chiles, seeds removed, finely chopped2garlic cloves, finely choppedKosher salt1tsp. ground coriander1tsp. ground turmericJuice of 1 lemon2Tbsp. unseasoned rice vinegar¼cup coarsely chopped cilantro¼cup mint leaves, torn if largeLime wedges (for serving)PreparationCoconut RiceStep 1Combine rice, coconut milk, and 3 cups water in a medium saucepan, season lightly with salt, and bring to a boil over medium-high heat. Reduce heat to low, cover pan, and cook rice until tender, 17–20 minutes.Step 2Remove pan from heat; let coconut rice sit (still covered) 15 minutes. Fluff rice with a fork, then cover and keep warm until ready to serve.SnapperStep 3Preheat oven to 400°. Place each fish on a banana leaf or two (you many need to use a few, overlapping as needed, depending on the size of the fish; you just need to make sure each fish is enclosed when wrapped) or 2–4 pieces of parchment paper, depending on the size of the fish. Season fish inside and out with salt, then divide lime rounds, garlic, and ginger over each fish. Stuff cavities with cilantro and mint, dividing evenly. Pour some coconut milk over each fish, then wrap up in banana leaf or parchment to make a packet.Step 4Divide packets between 2 large baking sheets, arranging seam side down, and bake fish just until flesh is cooked through and flakes easily with a fork (open a packet to check), 15–20 minutes if using 2½-lb. fish or 25–40 minutes if using 5-lb. fish.Chickpeas and AssemblyStep 5While the fish is roasting, toast coconut in a dry large skillet over medium heat, shaking pan often, until golden brown, about 4 minutes. Transfer coconut to a medium bowl and set aside.Step 6Return skillet to medium-high heat and pour in oil. As soon as oil shimmers, add chickpeas and cook, stirring often, until golden brown, about 3 minutes. Add jalapeños and garlic and season with salt. Cook, stirring often, until chiles and garlic are softened and chickpeas are a little crisp in spots, about 4 minutes.Step 7Sprinkle in coriander and turmeric and cook, tossing, until turmeric turns chickpeas a deep golden hue and mixture is fragrant, about 30 seconds. Add lemon juice and vinegar and season with more salt if needed. Transfer to a serving bowl and fold in cilantro and mint. Top with reserved toasted coconut.Step 8Open up banana leaves and transfer fish to a platter. Transfer warm coconut rice to a serving bowl. Serve fish with chickpeas, coconut rice, and lime wedges alongside.How would you rate Banana Leaf Snapper With Chickpeas and Coconut Rice?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI was able to use fresh banana leaves, and the recipe turned out very delish! Highly recommended!AnonymousTampa, FL1/25/2021This recipe ingredients call for rice and coconut milk, but the preparation also calls for water.Anonymous1/8/2021Explore Bon AppétitSnapperFishSeafoodChickpeaBeanVegetableRiceRice & GrainsCoconut MilkOther IngredientsMainDairy-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}