{"id": "7c0a18fdf296c0a12a8c384bacecf1fb", "url": "https://www.bonappetit.com/recipe/arroz-con-gandules-rice-with-pigeon-peas", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Arroz con Gandules (Rice With Pigeon Peas) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesArroz con Gandules (Rice With Pigeon Peas)By Rick MartinezDecember 9, 20193.7(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintPernil without arroz con gandules is like turkey without stuffing—the arroz completes any holiday meal in the Greater Antilles (especially Puerto Rico, Cuba, and the Dominican Republic). This Puerto Rican version uses many of the same ingredients from our pernil, with the addition of smoked ham hock. If you have more time, keep the ham hock simmering for another hour or longer for even more flavor and super-tender meat. We call for canned gandules because they’re easier to find, but if you can find frozen, use those; they will have better flavor and texture. Simply let them thaw before proceeding.Ingredients6–8 servingsSofrito2ripe plum tomatoes, cored, coarsely chopped (about 1½ cups)1medium onion, coarsely chopped (about 1 cup)2Cubanelle peppers, seeds removed, coarsely chopped (about 1 cup), or 1 medium green bell pepper, ribs and seeds removed, coarsely chopped1medium red bell pepper, ribs and seeds removed, coarsely chopped (about 1 cup)1large bunch cilantro, coarsely chopped (about 1 cup)1head of garlic, cloves separated, peeledRice and Assembly1smoked ham hock3cups homemade chicken stock or low-sodium chicken broth¼cup extra-virgin olive oil21.4-oz. packets Sazón con Culantro y Achiote (such as Goya)4tsp. Diamond Crystal or 2 tsp. Morton kosher salt1tsp. freshly ground black pepper2cups medium-grain white rice, rinsed, drained¼cup coarsely chopped jarred alcaparrado (olives, pimientos, and capers), drained115-oz. can pigeon peas, rinsed, drainedCilantro leaves with tender stems (for serving)PreparationSofritoStep 1Purée tomatoes, onion, Cubanelle peppers, bell pepper, cilantro, and garlic in a food processor until smooth. Scoop out ½ cup sofrito and set aside. Reserve remaining sofrito for another use (you can use it for the pernil).Step 2Do Ahead: Sofrito can be made 3 days ahead. Transfer to an airtight container, cover, and chill, or freeze up to 3 months.Rice and AssemblyStep 3Bring ham hock and stock to a simmer in a medium saucepan over medium-low heat, cover, and cook until ham hock is tender, at least 1 hour or up to 2.Step 4Heat oil in a large saucepan over medium-high. Cook reserved 1 cup sofrito, stirring occasionally, until beginning to brown and most of the liquid is evaporated, 5–8 minutes. Add Sazón, salt, and pepper and cook, stirring, until fragrant, about 1 minute. Add rice and olives, pimientos, and capers and cook, stirring often, until some grains are translucent, about 3 minutes. Add ham hock and stock (you should have 3 cups; if not, add water or more stock to get you there). Scatter pigeon peas over. Bring to a boil, then reduce heat to medium-low. Cover saucepan and simmer until rice is tender and liquid is absorbed, 20–30 minutes.Step 5Remove pan from heat, transfer ham hock to a plate, and fluff rice with a fork. Cover pan and let sit 15 minutes. Shred meat from ham hock, cover loosely, and let sit until ready to serve.Step 6Transfer rice to a platter. Top with reserved ham hock and cilantro.The arroz with cooked ham hock, before it's shredded and plated.\nPhoto by Laura Murray, food styling by Yekaterina BoystovaHow would you rate Arroz con Gandules (Rice With Pigeon Peas)?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis turned out great!  Now I have to get creative with all the leftover sofrito.AnonymousChicago, IL11/17/2020I'm going to completely agree with the previous comment. What makes a dish truly Puerto Rican are the inclusion of culantro (typically known as \"recao\" amongst Puerto Ricans or \"Chinese coriander\" in Asian markets) and ají dulce, the small sweet chili peppers. The steaming of the rice with the banana leaf adds great depth. Anatto seeds are steeped in lard or oil for color and flavor, sazón packets in this application are lazy. Also, these types of rice dishes in Puerto Rico always utilize short or medium-grain rice, never long grain. Puerto Rican recipes are hardly ever written about on these platforms, so it's important that it's represented accurately. AnonymousSanturce, Puerto Rico4/26/2020As with the recipe for pernil, the sofrito is missing two key ingredients. Add 6 - 7 sweet chili peppers (capsicum chinense), seeded and finely chopped and 3- 4 culantro leaves (eryngium foetidum), coarsely chopped.  These two DO make a big difference.\nAlso, if you have access to a bodega or any other Latin American market, try to get a plantain leaf to place over the rice before covering the saucepan.  This will add a nice layer of flavor.\nAlex IthierPonce, Puerto Rico12/15/2019Explore Bon AppétitPuerto RicanCaribbeanRiceRice & GrainsPigeon PeaBeanVegetableSideDairy-FreeGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-09", "author": ["Condé Nast", "Rick Martinez"]}