{"id": "7c12412a820aa7e1a7277c836d3a0361", "url": "https://www.bonappetit.com/story/buy-nothing-group", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "This Online Buy Nothing Group Taught Me the Joy and Solidarity of, Well, Buying Nothing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Online Group Taught Me the Joy and Solidarity of Buying NothingI found abundance when I freely let go of what I no longer needed.By Iona BrannonFebruary 16, 2021FacebookTwitterEmailIllustration by Silvia TackFacebookTwitterEmailWhen was the last time you borrowed a cup of sugar or a stick of butter from a neighbor? The gesture sounds so nostalgic yet feels so foreign to many of us, especially amid the isolation of the pandemic. But in my Los Angeles neighborhood, these things flow from household to household with ease. Many items I own, including my favorite cast-iron skillet, were gifted by my neighbors through a local Buy Nothing group, a movement built on the idea that abundance comes when we freely let go of what we no longer need.I had just moved into a new neighborhood when the pandemic hit. Los Angeles shut down. I was furloughed. My husband was an essential worker, and suddenly, I was home alone all day, every day. I began to join Facebook groups in my neighborhood, longing for some sense of community. That’s how I found the Buy Nothing group.Buy Nothing was originally started in 2013 when Rebecca Rockefeller and Liesl Clark started a gift economy to live more sustainably and to lower reliance on consumerism in their community in Bainbridge Island, Washington. Now, volunteers start up and run their own neighborhood Buy Nothing groups, which have spread to 30 countries. Since the beginning of the pandemic, my local group grew to more than 1,300 members (in a neighborhood of 20,000 people). Even with contactless drop-offs and pickups, it offers a sense of community that’s hard to find right now.Walking to collect or deliver items was a crucial way to support my mental health in a time when I couldn’t find the motivation to exercise. My life felt out of control, but the sunshine on my face reminded me of the vitality right outside my four walls. I got to know the friendly pitbull who lived two blocks down. I used Google Maps less often. Slowly, I began to recognize the most active neighbors in the Facebook group. During pickups, I saw their front yards, their herb gardens, their handwritten scribbles on paper bags. I used their home-grown spring onions in my salad, their passion fruit in my smoothies, and their sourdough starter in my bread. It’s a strange sort of intimacy: I felt like I knew these people even though we hadn’t met face-to-face.I’ve since moved on from that neighborhood, and my new home doesn’t have a Buy Nothing group...yet. As I establish roots in my new community, I hope to bring the joy of the gift economy here as well.If you’re thinking about joining your local Buy Nothing group (find one via this group listing!) or starting your own, here are a few tips to set you up for success:Go ContactlessWhenever possible, try to reduce your physical contact with other members throughout the pandemic. Be specific about when and where you’ll leave things for pickup. Is it to the right or to the left of the porch? Adding a photo always helps. Text your neighbor when you’ve picked something up or dropped something off to reduce the chances of a mix-up.Be PatientIf you’re giving something away that doesn’t have to be consumed immediately, try to wait for at least 24 hours before choosing a recipient to allow more people to put their name out there.Choose ThoughtfullyAsk a fun question or look for a new member you’ve never noticed before. Oftentimes, if the gift is expected to have a high response rate, givers will ask people to choose a number and then pick the winner through a random number generator online.Offer More Than Just StuffTime and skills count as gifts! My neighbors offered their knowledge in the form of sourdough Zoom workshops, free breathwork classes, and manual labor. Someone even created a “tea corner” in her backyard where we could go for an hour or two to enjoy a cup of tea and a change in scenery.Be PromptIf you’re receiving something, be sure to pick up the items during the requested time frame to respect your neighbor’s time. Plus, fresh bread and warm brownies don’t taste as good when they’re cold.Keep Allergens in MindDo you have cats at home that might have gotten fur on the items? Are there nuts in your baked goods? List exposure to any common allergies that your neighbors might want to know about.Give OftenThe idea of receiving free things is enticing, but once you begin to meet the needs of those within your community, you may find as I did, that the true gift is in the giving. The Buy Nothing philosophy is about cultivating a spirit of generosity and abundance, building connections, and collaborating with your hyper-local community.Explore Bon AppétitHealthyishTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-16", "author": ["Condé Nast", "Iona Brannon"]}