{"id": "7c1546e6f1ed2b793a96d6e752a4433e", "url": "https://www.bonappetit.com/story/greek-frappe", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Greek Frappés Are My Caffeinated Cool-Off | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGreek Frappés Are My Caffeinated Cool-OffThe original frappé might have been a mistake, but this easy version is delicious on purpose.By Rossi AnastopouloJuly 6, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Rebecca JurkevichFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I was growing up, working at my church’s annual Greek festival was nonnegotiable. If I wasn’t frantically slapping together orders at the gyro booth, I was sweating onstage in a dance performance. If I wasn’t dancing, I was scooping endless baklava sundaes. If I wasn’t scooping, I was hiding from my yiayia so she couldn’t set me up with an eligible Greek boy.But the only place I really wanted to be was the frappé tent. In there my aunts and cousins wielded milk frothers like wands, conjuring plastic cups of creamy, frothy, ice-cold coffee to soothe festivalgoers from the South Carolina summer heat.A little over a year ago, when the concept of whipped coffee arrived right in time to distract homebound Americans from the terror of the burgeoning pandemic, my mind was immediately blown by this culinary magic trick. But then I quickly realized dalgona coffee—popularized after South Korean actor Jung Il-woo ordered the drink from café owner Leong Kam Hon on television—was cut from the same cloth as my beloved frappé.Whipped coffee has long been enjoyed in countries across the world. In India and Pakistan, the drink is known as beaten coffee, or phenti hui coffee, among other names. For me and other Greeks, it’s instantly recognizable as frappé, a milky, foamy, iced coffee beverage served throughout Greece and at Greek-American festivals and restaurants.The frappé reportedly originated by accident. In 1957, Nescafé salesman Dimitrios Vakondios was at the Thessaloniki International Fair and craving a coffee. He snatched a shaker meant to make a children’s chocolate drink, popped in his instant coffee instead, and produced what would eventually become the frappé. Nescafé ultimately seized on the drink, and by the ’80s it was promoting the frappé in its advertisements. The frappé became popular across Greece, found in just about every café and taverna, and has come to embody the Greek way of life: Relax, take things slow, and enjoy where you are.Since my hometown’s Greek Fest only comes around once a year (and trips to Greece even less frequently), I had to learn to make frappés for myself at home. Thankfully, it’s just as easy, if not more so, than any other home coffee preparation method.To make one, add about 2 teaspoons instant coffee (Nescafé is, clearly, the best choice) and 3 to 4 tablespoons or so of cold water to a cup or jar. Add a spoonful of sugar if desired. Use a milk frother to whip until thick, foamy, and light brown. Fill a tall glass halfway with ice, then pour the mixture over the ice. Top with cold water until the drink reaches the top of the glass. You can also add a splash of milk if you’d like (which I always do).If you don’t have a milk frother, never fear! You can also shake the instant coffee and water in a cocktail shaker or closed jar until foamy.You can customize the drink with milk or sugar to suit your preferences. In general there are three ways to order it: sketo (plain, without sugar), metrio (medium, 1 to 2 spoonfuls sugar), and glyko (sweet, 2 to 4 spoonfuls sugar). At home, it’s even easier to tweak sugar and milk amounts to your taste until you land on just the right drink.Frappés can be enjoyed anytime of day, but I like them in the afternoon, sitting outside if I can, closing my eyes and imagining the Mediterranean sun on my face. They’re also great for watching the sunset, when you can linger with your drink as the sky slowly dims. Or, of course, hiding behind the baklava sundae tent in the sticky Low Country heat, praying your Greek grandmother doesn’t find you before you finish your drink.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rossi Anastopoulo"]}