{"id": "7c3dfa2da21eba5ce6b0ea8551145831", "url": "https://www.bonappetit.com/recipe/mixed-grain-and-coconut-porridge", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Mixed Grain and Coconut Porridge Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueMixed Grain and Coconut PorridgeBy Chris MoroccoJanuary 9, 20184.7(3)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintHot tip: Make porridge on the weekend. Reheat this in the time it takes to make instant.Ingredients4 servingsPorridge113.5-ounce can unsweetened coconut \tmilkKosher salt1cup mixed whole grains (such as black barley, rye, farro, black quinoa, and/or spelt)¼cup toasted unsweetened coconut flakes1tablespoon pure maple syrupRaisins and Assembly½cup raisins3tablespoons pure maple syrupPinch of kosher salt3bags Earl Grey teaBee pollen and toasted unsweetened coconut flakes (for serving)PreparationPorridgeStep 1Spoon 2 Tbsp. cream off the top of coconut milk into a small bowl. Whisk in a pinch of salt and set aside.Step 2Bring grains, coconut flakes, maple syrup, a pinch of salt, remaining coconut milk, and 4 cups water to a boil in a large saucepan over medium-high heat. Reduce heat and simmer, stirring occasionally, until grains are chewy-tender and most of the liquid has been absorbed, about 1 hour.Step 3Do Ahead: Porridge can be made 4 days ahead. Let cool; cover and chill.Raisins and AssemblyStep 4Bring raisins, maple syrup, salt, and 1 cup water to a simmer in a small saucepan over medium heat. Cook until raisins are plump and about half of the water is evaporated, 12–15 minutes. Add tea bags and let raisin mixture cool.Step 5Divide porridge among bowls and top with reserved coconut cream. Remove tea bags from raisins and spoon raisins and some of their syrup over porridge. Sprinkle with bee pollen and coconut flakes.Step 6Do Ahead: Raisin mixture can be made 2 weeks ahead. Cover and chill.How would you rate Mixed Grain and Coconut Porridge?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleEasy and healthy recipes. Thanks for sharing recipes. I have also created few healthy recipes from  True Elements Multigrain OatmealAnonymous7/16/2020Really tasty! I make this on the weekend and am able to get 6-7 small portions out of it to eat during the week. Good with just banana coins or layered with chia pudding :)AnonymousMichigan3/15/2020Explore Bon AppétitPorridgeCoconut MilkOther IngredientsRaisinDried FruitFruitBarleyRice & GrainsFarroQuinoaSpeltEasyDairy-FreeVeganVegetarianHealthyishSimmerBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}