{"id": "7c3f8f9310fdfb1630c56a66e7bd7077", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/shin-udon-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Udon Shin Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoShin UdonThis udon will ruin you for all other noodles. So long, ramen. See ya, soba.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for the last udon you will ever need. Maybe you haven't thought of udon, always overlooked for sexy ramen or faithful soba, as something you could love. But at Shin, that squiggly, chewy noodle that you’ve only eaten as an afterthought is better than any other you’ve slurped. How did you ever ignore such beauty before? And will you ever know this kind of love again?ORDER THE: zaru udon—cold noodles served with a dipping sauce—for the purest experience. Or get the niku udon, with thinly sliced beef and  a soft poached egg in savory broth, for a warming option on a chilly night. But if you want to feel decadent, get the carbonara-inspired bowl that comes topped with butter, pepper, Parmesan, and a big slice of bacon tempura (that’s right: bacon that's been battered, fried, and taken to a new level of crispiness).THE VIBE IS: intimate, to say the least. Shin is not much more than a sliver of a shop, with only a short counter and a couple of small tables. While you might want this interlude to last, remember that this is still a Tokyo noodle shop and you were once one of those people waiting in line outside. Don’t linger too long because everyone else needs a taste too.PRACTICAL STUFF: Open Sunday to Thursday from 11 a.m to 11 p.m., and Friday and Saturday from 11 a.m. to midnight. Closed during the New Year’s holiday. The menu is available in Korean and English, and the staff only speaks limited English. The nearest subway station is Shinjuku.Photo by Xavier Girard LachaîneUdon in the making.\nPhoto by Xavier Girard LachaîneRamen? I don't know her.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}