{"id": "7c42c03792313da306be87ee0f3d5a14", "url": "https://www.bonappetit.com/recipe/spiced-eggs-with-tzatziki", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Spiced Eggs With Tzatziki Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueSpiced Eggs With TzatzikiBy Ochre Bakery, Detroit, MISeptember 17, 20194.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintWe can’t call these just scrambled eggs. At Ochre Bakery in Detroit, No. 4 on our Hot Ten list in 2019, they soft scramble eggs with turmeric and serve them with tzatziki; a big pile of greens; a very generous serving of very good butter; two holey slices of country bread; and a tiny bowl of cumin seeds, Aleppo-style pepper, and flaky sea salt. A quick word to the wise: Preground curry powder can go musty quickly. If your jar isn’t fresh, replace it for the sake of these buttery, fast-scrambled eggs.Ingredients4 servings2tsp. cumin seeds1Tbsp. flaky sea salt2tsp. Aleppo-style pepper1cup plain whole-milk yogurt½cup finely chopped English hothouse cucumber1garlic clove, finely grated1Tbsp. finely chopped mint, plus leaves for serving1¾tsp. kosher salt, divided8large eggs¼cup heavy cream4Tbsp. unsalted butter2tsp. curry powderParsley leaves with tender stems and dill sprigs (for serving)PreparationStep 1Toast cumin in a dry small skillet over medium heat, tossing, until slightly darkened and fragrant, about 2 minutes. Transfer to a small bowl; let cool. Mix in sea salt and Aleppo-style pepper; set aside.Step 2Mix yogurt, cucumber, garlic, chopped mint, and ¾ tsp. kosher salt in a medium bowl; set tzatziki aside.Step 3Whisk eggs, cream, and remaining 1 tsp. kosher salt in another medium bowl until very well combined. Heat butter in a medium nonstick skillet over medium until starting to foam. Add curry powder and cook, stirring, until fragrant and darkened in color, about 10 seconds. Pour in egg mixture and let eggs cook, undisturbed, until edges have just set, then scramble, tilting pan and turning eggs over onto themselves, until just cooked through, about 2 minutes.Step 4Transfer eggs to a plate. Spoon reserved tzatziki alongside. Top with mint leaves, parsley leaves, and dill sprigs; sprinkle reserved spice mixture over.Step 5Do Ahead: Tzatziki (without mint and cucumber) can be made 1 week ahead (the garlic flavor will intensify as it sits). Cover and chill.How would you rate Spiced Eggs With Tzatziki?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangle Very good recipe. The salt in the eggs can be halved at least. Otherwise a flavorful and inventive breakfast. RobPWashington DC12/25/2021This is so delicious! It's simple and fresh while also filling. As a vegetarian, I am always looking for meals that leave me feeling satisfied but also light, and this one is it!Isabelle Minneapolis, MN11/14/2020I made this for brunch today and it was so so good. The eggs are fluffy, rich, and perfectly spiced. The tzatziki is fresh and herby, the spice mix is great (although you might want to reduce the salt in it a bit if you want to use a lot of it, since the eggs and tzatziki are already well salted). I served it with sourdough toast and more fresh herbs and some salad greens and it was honestly perfect. It made me wish that I lived in Detroit so I could get this from the restaurant, but making it at home is the next best thing for sure. abbyrnkn4422AL9/22/2019Explore Bon AppétitMiddle EasternEggAleppo-Style PepperHerbs & SpicesYogurtOther IngredientsQuickWeeknight MealsMainGluten-FreeVegetarianKetoHealthyishBreakfastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}