{"id": "7c5bc8f3ac5fec7915b664affb60e0de", "url": "https://www.bonappetit.com/recipe/crispy-green-rice-pilaf", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Crispy Green Rice Pilaf Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Green Rice PilafBy Molly BazMay 3, 20194.8(42)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintYou need day-old rice to make this vibrant, springy pilaf recipe, but it’s worth planning ahead. The precooked rice gets super crisp before it’s tossed with soft feta, crunchy pistachios and snap peas, and jammy golden raisins. It’s a true study in textures.Ingredients4–6 servings½cup raw pistachios4cups cilantro, mint, basil, and/or dill1(or up to 3) serrano chile, stems removed, split lengthwise¼cup fresh lime juice2Tbsp. white miso½tsp. kosher salt, plus more⅓cup plus 3 Tbsp. extra-virgin olive oil4cups cooked white rice, chilled overnight6oz. sugar snap peas3scallions¾cup crumbled feta½cup golden raisins1cup shelled fresh peas (from about 1 lb. pods) or frozen peas, thawedPreparationStep 1Preheat oven to 350°. Toast pistachios on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then coarsely chop.Step 2Meanwhile, blend herbs, one of the chiles, lime juice, miso, ½ tsp. salt, and 2 Tbsp. water in a blender on high speed until well combined. Drizzle in ⅓ cup oil and continue to blend until sauce is very smooth. Taste sauce for heat; if it seems mild, add another chile or two. It should be slightly spicier than you’re comfortable with since it’s going to get mellowed out by everything that it’s tossed with. Season with salt if needed.Step 3Heat remaining 3 Tbsp. oil in a large nonstick skillet over medium-high until very hot. Add rice, pressing down with a spatula in a single layer to create as much contact with surface of pan as possible. Reduce heat to medium and cook, undisturbed, until rice is deep golden brown underneath, 6–8 minutes. Season with salt.Step 4While rice cooks, thinly slice snap peas and scallions on a long diagonal and transfer to a medium bowl. Add pistachios, feta, and raisins and toss to combine.Step 5Add fresh peas to rice and continue to cook over medium heat, tossing often, until peas are just cooked through, about 2 minutes.Step 6Transfer rice mixture to bowl with vegetables and toss to combine. Drizzle in herb sauce, tossing again to coat well. Taste and season with salt if needed.How would you rate Crispy Green Rice Pilaf?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleThis is a variation (same sauce and technique) as another recipe on this site. I've made that one (sans raisins, feta and pine nuts) with nothing but veggies as a main course for 2. It's outstanding. I'll have to try this variation some time. SuzinsfSan Francisco3/23/2022I love Crispy Green Rice Pilaf and I will recomend Sinnara Parboiled Basmati Rice to make new dishes and cuisine. It is the best-parboiled basmati rice that I have ever tasted. I really like your blog and all the tips whichever you told to make a recipe. You can purchase the parboiled basmati rice from here. SinnaraNey York9/13/2021Great recipe for spring - or anytime.  Delicious!AnonymousSeattle WA5/2/2021This was a delicious way to use up a ton of leftover rice from takeout. It is bright and filling with a variety of interesting textures and great balance of flavors. I'd highly recommend it. AnonymousMaine3/22/2021I'd hold back on the lemon and reduce the oil but pretty good!Anonymous9/21/2020lovely - the sauce is to die for. i also make it to smother onto halibut and it’s absolutely amazing\n\ni recommend substituting cubed griddled halloumi for the feta. truly an inspired dish. thanks Molly!cforrest264141Boston7/18/2020Dang. This was amazing. The textures alone are a mouth adventure, and the flavors are so fresh and so bright. An awesome way to use seasonal farm box ingredients. Best thing I've made this season. AnonymousSanta Barbara, CA6/2/2020This dish is a roller coaster of flavour and texture. AnonymousSydney Australia5/30/2020This recipe is definitely being added to my go-to list. It came together easily, tasted amazing, and is the perfect side to just about any entree.amateur_bakesDallas, TX5/11/2020A classic recipe! The combo is great, but the sauce is to die for. I have only made it with cilantro, would recommend the miso-cilantro combo. Thanks Molly!alywooMontreal, Quebec5/4/2020this recipe is perfection—i wouldn’t change a single thing. i used 2 serranos, next time would bump it up to 2.5 or 3. will definitely be making this again! such good crunch. and will probably be making the sauce again on its own... delish. Anonymousmassachusetts 3/29/2020delicious!!!! super bright and punchy. niccsuxSingapore3/1/2020Ungodly. I make this every time I want to impress my mom. Requires a lot of moving parts, but worth it. Make it as spicy as you can handle.meghannashLos Angeles, CA11/7/2019This is a truly tasty dish. Everything comes together so nicely. Incredible sauce! \n\nThe method of cooking the rice made for the most beautiful, crispy caramelisation. I added some crispy egg plant cubes and served with baked salmon. Divine. Anonymousaustralia 10/28/2019Loved this! Used basil, cilantro, and mint and went heavy on the basil. Three in some asparagus, broccoli, and sautéed tofu.  Super easy, healthy, and delicious. AnonymousNew York6/12/2019Explore Bon AppétitPilafPistachioNutRiceRice & GrainsSugar Snap PeaPeaVegetableFetaCheeseRaisinDried FruitFruitCilantroHerbs & SpicesSpringWeeknight MealsSideVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Molly Baz"]}