{"id": "7c86e82bb6e9e325b30e908ecad7bb77", "url": "https://www.bonappetit.com/story/your-junk-drawer-has-got-to-go", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Your Junk Drawer Has Got to Go | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Junk Drawer Has Got to GoIT'S CALLED JUNK FOR A REASON, PEOPLE!By Alex BeggsApril 8, 2019FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGH, Prop styling by Elizabeth JaimeFacebookTwitterEmailAccording to the evolutionary biologists*, right after humans woke up with opposable thumbs, they used those thumbs to open a drawer in their kitchen and fill it with crap they didn’t need. Prehistoric paper clips and soy sauce packets and keys from bygone apartments and little bags of baby teeth (EW!) were stashed and forgotten. Then, once we developed a written language, we gave it a name: The Junk Drawer.And here I am a thousand (or whatever) years later to say: Enough is enough! It’s literally called a JUNK drawer. It’s full of JUNK. It’s a waste of SPACE. It doesn't matter whether you live in a shoebox apartment in New York or a suburban McMansion, ain't nobody got room for a drawer dedicated to useless things.The first step to ameliorating this desperate, depressing situation is to take stock of what is actually in this drawer. Open up! Do you see what I see? There are actually three categories of stuff in there:Actual garbage, like business cards, Ikea wrenches, and letters of disinheritance, which should be pitched or recycled immediately. Let! It! Go!Items that have another, more logical home. Stamps? Your desk drawer. Advil? The bathroom. Bloody knife? The river. Face it: These things ended up in The Junk Drawer because you were just too lazy to put them in their proper places. Shame!The true miscellany of life—the things that actually deserve space in a catch-all drawer. Toothpicks, charging cords, extra-flammable birthday candles. Those should be organized in old iPhone box tops or cute bins (hat tip, Kondo!) and Tetrised in a satisfying way.Fancy toothpicks: Now THAT belongs in The Drawer. Takeout menus, not so much.\nDanny KimAt this point The Drawer needs a new name. Something that signals the organized, in-control life you now lead. How about: “The Drawer of Things Not Used Very Often.” You think I’m joking, but I seriously have a drawer with this exact name in my humble home. The name caught on. It took a few weeks, but then again, evolution takes time. And there’s no going back.*Well, no, not really.This whole process will be much more bearable if you make a cocktail first:3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeHope you’re thirsty! Introducing Happy Hour with Al, Basically’s new no-nonsense cocktail column.View StoryExplore Bon AppétitBasicallyCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Alex Beggs"]}