{"id": "7c996268b008fcd453422c5d171e0380", "url": "https://www.bonappetit.com/recipe/sour-cherry-cheesecake", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Sour Cherry Cheesecake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueSour Cherry CheesecakeBy Yasmin KhanApril 20, 20213.9(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintIn her cookbook, Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, author Yasmin Khan celebrates the sharp, tangy cherry—a prized fruit in Turkey—by pairing it with a cake of baked yogurt and cream cheese. She uses frozen sour cherries for this recipe (they’re pitted, which saves time), but you can use fresh ones when they’re in season. To avoid a cracked cheesecake, don’t overwork the cream cheese mixture; be sure to line the baking pan; bake it slowly (if you know your oven runs hot, you can drop the temperature 25 degrees); and let the cheesecake cool gradually.Ingredients8 - 10 ServingsCheesecakeNonstick vegetable oil spray1½sleeves graham crackers (about 13)7Tbsp. unsalted butter, melted1lb. 5 oz. cream cheese, room temperature⅔cup plain whole-milk Greek yogurt, \troom temperature3large eggs, beaten to blend1cup sugar1Tbsp. all-purpose flourPinch of kosher salt1Tbsp. vanilla extract1tsp. finely grated lemon zest1Tbsp. fresh lemon juiceCherries and assembly14oz. frozen pitted sour cherries or one 24-oz. jar, drained½cup (or more) sugar1Tbsp. cornstarchspecial equipmentA 9\"-diameter springform panPreparationCheesecakeStep 1Lightly coat pan with nonstick spray and line bottom with a parchment paper round. Pulse graham crackers in a food processor until finely ground. (Or crush in a resealable plastic bag with a rolling pin.) Drizzle in butter; pulse to combine. Press into bottom of prepared pan, packing with a measuring cup. Chill until firm, about 30 minutes.Step 2Place a rack in middle of oven; preheat to 325°. Using an electric mixer, beat cream cheese and yogurt in a large bowl until smooth. Add eggs, sugar, flour, and salt and beat until just combined. Mix in vanilla, lemon zest, and lemon juice.Step 3Pour filling into pan and gently tap on counter to evenly distribute; set on a rimmed baking sheet. Bake cheesecake until filling is set but still wobbly in the center, 55–65 minutes. Turn off oven and prop door open. Let sit in oven 10 minutes. Remove from oven; let cool completely, 1–1½ hours. Chill until cold, 1–2 hours.Do ahead: Cheesecake can be made 3 days ahead. Keep chilled.Cherries and assemblyStep 4Bring cherries and sugar to a simmer in a medium saucepan over medium heat, stirring often, until cherries are thawed if frozen. Add more sugar if needed. Sprinkle cornstarch over and stir in. Simmer until thickened slightly, about 5 minutes.Step 5Spoon cherries and juices over cheesecake just before serving.Adapted from \"Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus.\" Copyright © 2021 by Yasmin Khan. With permission of the publisher, W. W. Norton & Company, Inc. All rights reserved.\n\nBuy it from Amazon or BookshopHow would you rate Sour Cherry Cheesecake?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is a very lemony flavored cheesecake--perhaps due to my Meyer lemons?  In my oven, it was already firmly baked and set at 55 minutes, no wobbly middle at all.  It didn't crack at all, but the flavor was disappointing.  Were I to make this recipe again, I'd put a bit of sugar in the graham cracker crust recipe, turn the heat down, use no lemon zest, and add some vanilla to the cherry topping. 3 stars only, not 5.AnonymousLawrence Kansas5/15/2021Explore Bon AppétitCheesecakeCakeDessertCherryStone FruitFruitCream CheeseCheeseNut-FreeBakingFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Yasmin Khan"]}