{"id": "7c9ed7223d54a731aff7caaf9567e4d7", "url": "https://www.bonappetit.com/story/minas-world", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "In Philly, Mina’s World Is the New Clubhouse for Coffee, Samosas, and Mutual Aid  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIn Philly, a New Clubhouse for Coffee, Samosas, and Mutual AidMina’s World is a community-oriented, QTPOC-owned and -operated coffee shop.By Emma OrlowSeptember 22, 2020FacebookTwitterEmailTiayrra BradleyFacebookTwitterEmailSonam Parikh grew up in her parents’ Bay Ridge corner store, a time pre-9/11 when, she says, “Brooklyn felt a lot more casual for Brown immigrant families.” But soon after the towers fell, her parents felt it was no longer a safe place for them to reside—and gentrification was well under way in the area, making their livelihoods untenable, forcing them to move out of the city. Parikh has thought about her parents’ business a lot—a community place where customers became her surrogate babysitters—as she launched Mina’s World, what she says is Philadelphia’s first-ever QTPOC-owned and -operated coffee shop.Named after Parikh’s cat that she parents with her partner and co-owner, Kate Egghart, the coffee shop doubles as a community hub. It’s a spot to find home goods made by local artists and pick up snacks and drinks that nod to Parikh and Egghart’s combined Indian and Korean roots (chai with rose syrup, yuja-cha, and samosas). Soon they’ll roll out a specialty drink inspired by the Brazilian heritage of Paula Cooke, their manager of operations. Handmade, thoughtful touches dot the space, from the daffodil yellow hand-tiling that Egghart helped design and inlay, to the custom cow print ceramic tip jar made by artists Bee Daddy & Sons with Scott Cooper.But Mina’s World is about more than just drinks and decor. It seeks to be an alternate kind of coffee shop in Philly: one that pays its employees fairly, has Black and Brown employees in managerial positions, prioritizes ethical sourcing when it comes to its coffee beans, and never turns away a customer (“While we only accept credit cards right now because of the pandemic, we heavily disagree with operating cashless. That rules out an entire group of people who probably need a hot meal more than most,” says Parikh, who currently gives free coffee and meals to those without a card on hand). These tenets seem basic, but they’re radical in an era where so many new coffee shops can feel generic and exclusionary, their sterile, modernist aesthetics attracting a mostly white, wealthy customer base.The West Philadelphia coffee spot—located on the corridor of 52nd Street—had been open only 18 days before COVID-19 shut down the city in mid-March. And though they weren’t able to use the space as a comfy, welcoming hangout spot for people of marginalized identities, the feeling of a more equitable form of community has remained palpable and pleasurable, as seen with their to-go baggies with Sharpie drawings of cats. “We don’t have any investors, so the odds are stacked so far against you running a business like this. But I would be a fool to think that I am generating this community myself. It takes a lot of trust and people to make this work,” she tells me. Below, Parikh breaks down how she and her team developed such a unique sense of place.The drinks start at $2.\nTiayrra BradleyThoughtfully sourced coffee with a message“I have worked in coffee since I was 18. Most of the workplaces were really toxic in the sense that the workers were not being paid well and the white ownership neglected to protect their Black and trans employees. I knew there needed to be a space where you could have an amazingly made cup of coffee that’s not whitewashed. We use Passenger Coffee, based in Lancaster, Pennsylvania, for both our high-quality beans and our chai—they source with integrity, making sure their farmers are consistently bought from and not just dropped after one big sale or crop. The whole point of Mina’s is empowering Black and Brown people, and that means those who are doing the labor are also treated with that same level of respect. We’re working all the time on making accessible price points. That’s why drip coffee is $2 a cup—we don’t make a profit from it.”Egghart helped design and inlay the cheerful yellow tiling.\nTiayrra BradleyA stocked community fridge“Inspired by other community fridge efforts, we have a fridge that anyone can take from outside of Mina’s World. As the hosts, we pay for the electric and for its upkeep. I’m a volunteer of the fridge, and that means cleaning it rigorously at night—but it’s an autonomous effort led by West Philadelphia for Philadelphia. We had to make a water-safe home for it, which involved fundraising and building out a hutch.“My father recently died of COVID-19—which is a very cruel, isolated way to die—but afterward, we found out what a food justice warrior he was; people showed up telling us how he used food to help others. As people growing up on food stamps, my family didn’t necessarily have the academic or social titles for something like naming what we were experiencing to be a community fridge, but we knew where to pick up donated items. I feel so lucky to continue that here.”A few of Mina’s World’s offerings: Yuzu honey iced tea, pistachio rose cookie, rose iced chai, brownies, green grape lemonade, and an oatmeal cream pie.\nTiayrra BradleySamosas and GF donuts“A lot of the baked goods available at Mina’s World are accidentally vegan. We have a whole cross section of customers and we didn’t want to emphasize the vegan-ness of things, but just leave it to be something natural without the label on the menu. We have oatmeal cream pies, pistachio-rose sugar cookies, and blueberry coffee cake from a local bakery called Crust. The gluten-free doughnuts are from OkieDokie.“We have a lot of things on our menu that we were once ridiculed for eating as kids, that we wanted to make relevant to the store and more accessible. I’m really excited about our samosas. We get them from this Auntie who makes them out of an Indian grocery store called International Foods and Spices. We’re also working with some food organizations to roll out a breakfast menu made from local ingredients in the next year.”A locally made coloring book available for purchase.\nTiayrra BradleyBooks from local authors“We’re selling Praise to the Lesser Gods of Love—it’s a poetry book by a local writer named Noor Ibn Najam, who impacts our writing community. We had a vision of having a library for people to flip through while they drank coffee and relaxed. Currently, we also have adult coloring books for sale that feature subjects like natural hair care.”Buy them: Book prices vary.Tinctures to improve your mood“We offer small-batch herbal tinctures from Root2Star herbals. We especially like the Tender Heart one which is for people experiencing grief, loss, and sadness—so relevant right now.”Buy it: Tender heart tincture, $12.Of course the merch includes a tote.\nTiayrra BradleyRep the space with limited-edition merch that you’ll want to collect“Part of being a small business owner is respecting and supporting local artists. We have tote bags and a few different T-shirts for sale that were made for Mina’s World as well as mugs, key chains, stickers, and planners. We’re hoping to have work from our employees featured too.”Buy them: Bayaht Ham’s Mina's World Shirt, $15 (a bulk of the sales go to Morris Home); Tote bags, $12 (made by local tattoo artist, Big Baby Pokes).Bring home a snack for later“Right now, we really love Palm Breeze Simply Natural, which supplies us with fresh-squeezed juice. We also have nori snacks and Nong Shim Shin Cup, a brand of Korean ramyun that’s prominently featured in mukbang videos. We offer it both as a dry packaged good or we’ll make it for people to-go—it’s a nice low-cost option.”Buy it: Palm Breeze juices, $6.50.Explore Bon AppétitPhiladelphiaHealthyishRead MoreLifestyleInside Queens, San Francisco's Expertly Curated Korean-American SuperetteGallery5 SlidesBy Elena KadvanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Emma Orlow"]}