{"id": "7cb8d9fc2bc06beb4b90d67ff54d64d3", "url": "https://www.bonappetit.com/recipe/glazed-and-flaky-apple-tart", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Glazed Apple Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueGlazed and Flaky Apple TartBy Claire SaffitzOctober 16, 20184.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you're the type who prefers desserts that go heavy on the fruit, this apple tart's for you. Halved apples (that's right, no slicing or dicing) are roasted with brandy and maple syrup, then arranged on a pastry base with almond streusel to add crunch and absorb any rogue juices. What you get is kind of like apple pie—if it were 70 percent fruit with the flakiest crust imaginable. Firm tart apples hold their shape even when cooked twice. You can make the dough and roast the apples up to 2 days ahead.Ingredients12 servings½cup sliced almonds6medium sweet-tart apples (such as Pink Lady, Honeycrisp, or Winesap)1lemon, halved½cup pure maple syrup¼cup brandy, preferably apple2tsp. vanilla extractPinch of kosher salt2Tbsp. raw sugar, divided1Tbsp. all-purpose flour, plus more for dustingShortcut Puff Pastry1large egg, beaten to blendVanilla ice cream (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Toast almonds on a rimmed baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool.Step 2Reduce oven temperature to 275°. Peel apples; cut in half. Using a melon baller or teaspoon, scoop out cores.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 3Rub cut sides of lemon all over apples, then place apples cut side down in a 13x9\" baking dish. Squeeze lemon halves over and add maple syrup, brandy, vanilla, and salt.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 4Cover tightly with foil and bake until juices are bubbling and apples are tender but still intact (poke through foil with a tester or toothpick to check), 60–80 minutes. Uncover and let cool. Increase oven temperature to 400°.Step 5Meanwhile, toss almonds, 1 Tbsp. raw sugar, and 1 Tbsp. flour in a small bowl; set aside.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Let puff pastry sit at room temperature about 4 minutes to soften slightly. Roll out on a lightly floured sheet of parchment paper, dusting with more flour as needed to prevent sticking and rotating once or twice, to a 16x12\" rectangle. Slide parchment paper with pastry onto a large rimmed baking sheet. Trim around sides to straighten and tidy edges, then cut off a 1\" strip from each side (you’ll have 4 strips).Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 7Brush around edge of rectangle with egg, then place strips on top, aligning with edges. Trim any overhang from corners. Brush rim you just created with egg and sprinkle with remaining 1 Tbsp. raw sugar. Scatter reserved almond mixture over pastry, staying inside the rim.Step 8Gently arrange apples on top of almond mixture; reserve juices left in dish. Chill tart 15 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 9Bake tart 20 minutes. Reduce oven temperature to 350° and continue to bake until pastry is deep golden brown and puffed, 45–55 minutes.Step 10Meanwhile, scrape reserved apple juices into a small saucepan and cook over medium heat, swirling pan often, until syrupy (you should have 2–4 Tbsp.), 6–8 minutes. Remove glaze from heat.Step 11Remove tart from oven and brush glaze over apples. Serve warm or room temperature with scoops of ice cream.Step 12Do Ahead: Tart can be baked 10 hours ahead. Store loosely wrapped at room temperature. Reheat in a 250° oven if desired.How would you rate Glazed and Flaky Apple Tart?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleMy apples turned to applesauce when baking. Delicious apple sauce, but applesauce nonetheless. Anonymous9/24/2020I don’t understand this recipe. Made exactly as written but in the end had delicious glazed apples sitting atop a dry bed of almonds. It’s missing a custard base or something. I won’t make as written again, but will adjust to get more moisture . renagleThe Hague4/15/2020This is my favorite apple dessert by far. I made it for New Years and everyone loved it. Baking the apples in the syrup mixture imparts so much flavor, but it doesn't make the tart too sweet. I ended up cutting the apples into 1/4\" slices and subbed apple juice for brandy and walnuts for almonds. Making puff pastry in advance or using frozen puff pastry saves time the day of. This is now my go-to holiday dessert!stesAurora CO1/4/2020Showstopper! This was the all time best dessert I’ve ever made. I made it for my aunts Christmas party and everyone loved it! The puff pastry was the hardest thing to make, but it still came out amazing! I’d definitely recommend doing everything separately the day before and assembling and baking the day you want to serve. Everybody said it is amazing because it wasn’t too sweet and it teases your tastebuds a little. I even ripped a hole in the puff pastry and it was super forgiving and I patched it up with some excess pastry. The apples were incredible, you could tell the brandy was there but it wasn’t overly boozy. I would 100% make this dessert again so good!margaux williamsBoca Raton, Florida12/25/2019Q: Short on time, have DuFour frozen puff pastry on hand. Will I rip a hole in the time space continuum and destroy life as we know it if I cheat? \n-Asking For A Friend AnonymousN.Y. 11/1/2019Curious if I can make this gluten free?AnonymousCalifornia10/23/2019THIS WAS ABSOLUTELY, INCREDIBLY AMAZING!!!! Honestly, I think it’s the best dessert/sweet thing I have ever made! Even better than BA’s apple cheddar pie I’d have to say, which I made this Thanksgiving. Like someone else said though, definitely make this on a night you’re making a simple dinner or a day in advance, because it takes a while. It’s SO worth it though, yum.AnonymousBoulder, CO12/25/2018I've never baked pastry before, but this recipe looked so good I had to give it a try. Much to my surprise it came out just like in the photos! And it was *delicious*, both fresh out of the oven as well as at room temperature the next morning.\n\nA few notes:\n\n- This recipe is pretty hard to time well and is a real oven & fridge space hog. I wouldn't recommend it as a dessert when you've got a lot of other food going in & out of the oven (cough, Thanksgiving). Make it on a night when dinner is otherwise very simple, or to bring as a guest when you really want to impress your hosts.\n- The homemade puff pastry takes some faith! It did NOT look good coming out of the fridge pre-folding (lumpy, sticky, falling apart). I used ample flour and did an extra round of letter-folds, and it was much smoother on the way back into the fridge. During the final rolling out I was much more confident with the look of the dough.\n- I found the half apples a bit hard to eat. Next time I might try cutting the apples after cooking into 1/4\" slices and layering those on the almond base.\n\nAs a go-to dessert, this doesn't have quite the bang fo the buck of a plain apple pie (or, even better, an apple slab pie). But we'll definitely make it again for special occasions or on a rainy day. I'm glad to have found this recipe – otherwise I never would have attempted to make a true pastry from scratch!AnonymousMassachusetts11/25/2018The only apple dessert I will ever want to eat again forever and ever, sorry pie. I can't express how impressed I was that I MADE PUFF PASTRY (yes, I kept squealing as I checked on the tart while it was in the oven) given that I'm not a huge baker and I'm not great at making pie crust. The Shortcut Puff recipe is easy to follow, and it just works. Other notes: I slightly overcooked my apples, but this was still totally delicious. I made the whole thing in one day, which is achievable, but I think next time I'll break up the steps over two days, making the crust and roasted apples on the first day and assemble/bake on the second. 10 OUT OF 10 WOULD APPLE AGAIN.christinachaey11/3/2018Explore Bon AppétitFruit DessertDessertTartAmericanFrenchEuropeanAlmondNutAppleFruitFallWinterBakingThanksgivingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Claire Saffitz"]}