{"id": "7cd19d0eb439354dd83c029c8bc2aa52", "url": "https://www.bonappetit.com/recipe/sunny-side-burger-with-salsa-verde", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Burger with Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSunny Side Burger with Salsa VerdeBy Jason MannJanuary 8, 20193.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhat’s better than a griddled burger with the crispiest exterior? One that comes sandwiched between a vibrant tomatillo salsa and topped with a runny fried egg. Most domestic grass-fed beef includes cattle that also eat some grain; the meat is not too lean or “grassy” and makes for a very satisfying burger. This recipe is from Farm Burger.IngredientsMakes 4Salsa Verde1lb. tomatillos, husks removed, rinsed1small onion, peeled, quartered3jalapeños, sliced in half lengthwise1Tbsp. extra-virgin olive oilKosher salt1cup cilantro leaves with tender stems2tsp. freshly ground black pepperAssembly20oz. grass-fed ground beef (20% fat)4Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper4soft sesame seed buns, split4large eggsPreparationSalsa VerdeStep 1Heat broiler. Toss tomatillos, onion, and jalapeños with oil on a foil-lined rimmed baking sheet; season with salt. Broil until blackened in spots and very soft, 12–15 minutes. Let vegetables cool slightly, then transfer to a food processor. Add cilantro and black pepper; pulse until coarsely chopped (3 or 4 pulses). Taste salsa verde and season with more salt if needed.Step 2Do Ahead: Salsa verde can be made 1 day ahead. Transfer to a small bowl; cover and chill.AssemblyStep 3Portion beef into 4 loosely packed balls (5 oz. each). Heat a large cast-iron skillet over medium-high until just beginning to smoke. Add 2 Tbsp. oil, then all 4 balls of meat. Firmly smash down on meat with a heavy metal spatula to create a craggy-edged 4\"-diameter patty; season with salt and pepper. Cook, undisturbed, until deeply charred underneath, about 3 minutes. Flip and season other side with salt and pepper; cook to medium, about 3 minutes. Transfer to a plate and let rest.Step 4Carefully wipe out skillet with a paper towel, leaving only a light coating of oil. Set skillet over medium heat. Working in 2 batches, toast buns, cut side down, until golden brown, about 1 minute. Transfer to a clean surface.Step 5Heat remaining 2 Tbsp. oil in a large nonstick skillet over medium. Crack eggs into skillet and cook until whites are just set and edges are crisp, about 4 minutes. Season with salt.Step 6Spread insides of both tops and bottoms of buns with a heaping tablespoonful of salsa verde. Place a burger on each bottom bun, top with an egg, sunny side up, and close burger.How would you rate Sunny Side Burger with Salsa Verde?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDo yourself a favor and make this like Farm Burger does - with bacon and pepper jack cheese.NorburyM in DenverDenver3/9/2021Explore Bon AppétitBurgerGround BeefBeefMeatTomatilloVegetableMainDairy-FreeHealthyishFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Jason Mann"]}