{"id": "7ce25f86d868b91d02a5f4498da020d2", "url": "https://www.bonappetit.com/recipe/tomato-salad-with-warm-basil-dressing", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Tomato Salad with Basil Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueTomato Salad with Warm Basil DressingBy Andy BaraghaniJuly 9, 20193.7(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintNot just for salad: Drizzle this savory infused oil over grilled vegetables, steak, or roast chicken.Ingredients4 servings½cup extra-virgin olive oil1large shallot, thinly sliced into rings3garlic cloves, thinly sliced¾tsp. crushed red pepper flakes3oil-packed anchovy fillets, chopped (optional)1cup basil leaves (purple or green)1½lb. heirloom tomatoes, some sliced, some cut into wedges2Tbsp. red wine vinegarKosher salt½lemonFlaky sea saltPreparationStep 1Cook oil, shallot, garlic, and red pepper flakes in a small saucepan over medium heat, stirring occasionally, until shallots and garlic begin to turn golden, 7–9 minutes. Remove from heat and mix in anchovies, if using (they’ll dissolve in the oil quickly), and basil.Step 2Toss tomatoes with vinegar and a pinch of kosher salt in a medium bowl. Transfer to a platter and pour warm dressing over. Finely grate lemon zest on top and sprinkle with sea salt.How would you rate Tomato Salad with Warm Basil Dressing?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI really enjoyed this recipe. I scaled a bit back on the amount of olive oil needed, used maybe 1/3, so I also scaled back the anchovies and other ingredients appropriately. I found the cute bought to coat all of my tomatoes perfectly. This dish gets soggy fast so make sure you eat it right away and/or pour the dressing last minute. I found this to be amazing toward the end of the summer. It packs a punch of flavor balanced by the oil and spicy, it’s a dish that rivals restaurants. LindseyDenver12/11/2021I love & find success with most BA recipes. \nI followed this to the “T”, &  I love anchovies.\nThis recipe missed the mark for me.\nFound that my homegrown basil was  overwhelming, while the anchovies were prominent they hinged on another overpowering ingredient.\nCordes Teri (Teresa)Toronto 9/21/2021I make *a lot* of BA recipes, but this one just did not work for me. I really can't put my finger on it...just weird. It seems that this is a personal taste/preference issue since others have raved about it. I love every ingredient individually, but together in this way, for some reason, they just didn't meld. I won't be making again. Bummed I used my good farmer's market tomatoes for this.SAArlington, VA6/20/2021This salad sounds delicious and I am going to make it one day!  However, I used the warm basil dressing for poached chicken and it was absolutely delicious.  I snuck the anchovies in there hoping my anchovy averse husband wouldn't notice.  He didn't and couldn't stop complimenting the sauce.  I have no doubt it would be equally as good on the tomatoes however it may be harder to sneak tomatoes by my husband who is also averse to them!Kim ISavannah, GA6/14/2021The salad is a keeper. The dressing is awesome. The lemon zest is the absolute perfect touch. Son, wife, and I loved it. Very simple to make. It was a great side dish with the grilled chicken wings with summer berry agrodolce. I am a super amateur and I pulled these off together on a work night.Chris McManamanSugar Land Texas6/10/2021I didn't have anchovies but the salad was still delicious.Anonymous10/5/2019All hail, Food Stylists! For the rest of us, this looks horrible. The basil disintegrates. The sardines do not disappear and add to the sad look of the basil. And it’s bland. AnonymousUAE9/4/2019This is an EXCELLENT recipe. We loved how it let the tomatoes shine and the dressing just took it over the top. I did add the anchovies (when my guests were not looking....) and everyone raved and begged to know what was in the dressing - when I revealed the anchovy add in everyone agreed you couldn't taste them but they did pick up a briny flavor that really boosted everything over the top. Thanks Andy!!stickyheelsDurham, NC8/18/2019Explore Bon AppétitSaladTomatoVegetableBasilHerbs & SpicesSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeNut-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}