{"id": "7ce90a61bef213feb860d2883808de83", "url": "https://www.bonappetit.com/story/9-pantry-staples-actually-do-go-bad", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Heads Up: These 9 Pantry Staples Actually Do Go Bad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking9 Pantry Staples You Probably Need to ReplaceJust because it doesn't have to be refrigerated doesn't mean it lasts forever. Here's what to replace when.By Jesse SparksSeptember 3, 2019FacebookTwitterEmailFacebookTwitterEmailPantries are culinary closets, full of things that were fresh and cool when you got them—things that you were sure would be fresh and cool forever. But guess what? Precious few things ever hold up for more than a couple of seasons. Just like shoulder pads, powder blue leisure suits, and low rise jeans, pantry staples—even the ones that seem like they should last forever—do go bad. That's why we've rounded up a list of the nine pantry staples that you should be replacing a lot more often than you already do. Let's take a look.FlourSure, all-purpose flour is shelf stable (meaning that it doesn’t require refrigeration). But you should really be replacing all-purpose flour every six to eight months—it'll go stale after a while, and the flavor will start to deteriorate, which isn't going to do your pancake game any favors. Instead of buying in bulk, pick up only as much as you'll use in a month or two. (Which is to say, if you only bake cookies in December, consider snagging a fresh bag for the occasion.)Whole grain flour is a different story altogether. To make all-purpose and other white flours, the more volatile parts of the grain are sifted out. Whole grain flour, on the other hand, is comprised of the whole kit and caboodle, which means that these flours are much more perishable, and will go rancid after one to three months at room temperature. To extend their life, we recommend sealing them in an airtight bag and storing them in the fridge or freezer.Baking SodaUnlike flour, baking soda doesn’t spoil—but it does lose potency, which can spell disaster for your cakes and quick breads. Baking soda can lose its ability to leaven in as little as six months, at which point it should be removed from service and relegated to cleaning and fridge odor-absorbing duty.If you’re unsure of whether or not your baking soda still has the get-up-and-go you need to make those muffins rise, just test it out: Add a spoonful to a bowl and slowly drizzle in an acidic liquid like vinegar or lemon juice. If the mixture bubbles vigorously, congrats! You’re the proud owner of potent baking soda. If it fizzes a little or not at all, it’s time to find a different use for it.YeastYeast is a living thing! And if it's dead, it won't produce an airy, well-risen loaf of bread. While unopened packages of yeast should be good for a year at room temperature, anything more than that is pushing it. Once the package has been opened and exposed to air, transfer it to the fridge, where the yeast inside will last for a few months. Unless you're a weekly bread baker, we recommend buying those little single-serving packets to avoid waste. And it's always a smart move to check your yeast before you use it. Sprinkle a little bit into a small bowl of lukewarm (not hot!) sweetened water—if you get some foamy bubble action, you're good to go.SpicesSpices don't go bad per se, but their flavor degrades over time in a pretty dramatic way. Whole spices will keep their kick longer than pre-ground spices will—eight to ten months for whole, around three months for ground—but, ideally, both should be bought in small quantities and replaced often. (Which is to say, you should go ahead and toss those dusty five-year-old jars of ground cumin and paprika...tonight!) Again, old spices aren't going to kill you, but they will make the flavor of whatever you're cooking duller and less vibrant.MolassesYou’ve seen this jar flying off the shelves during holiday cookie season: It’s the secret to the chewiest gingerbread and molasses cookies and a key component for recipes needing its particularly sweet, slightly bitter richness. But what happens after the tinsel goes back into the attic? Well, that molasses takes a long sabbatical in the back of your pantry. But it’s important to keep an eye on that jar throughout the year. An opened jar of molasses that’s been closed after each use can last a full year but not much more, and it's important to keep an eye out for any mold growing on the top—even if you see a few specks, you're going to want to pitch the whole thing. RIP, little homie.All the types of lentils—and what to do with them.\nPhoto by Chelsea KyleLentilsDried lentils tend to be popular in part because they don’t spoil easily. But that’s only when they’re stored in a cool, dry place where they won’t accidentally absorb moisture. And even that doesn’t mean you have a free pass: Use them in a year. The longer they sit, the more their texture will deteriorate and they'll take longer to cook.RiceRice is great because it’s cheap. But you might be better off avoiding that massive bag, no matter the bargain. Rice is typically best for the first three months. After that, the texture will start to change. The rice will harden and take longer and longer to absorb water.BeansDried beans typically kick the bucket after a year. If your dried beans seem to take forever to turn tender, that's probably because they're old (either you've been hoarding them, or you bought them from a grocery store that doesn't change out their beans often enough). We live by the “use it or lose it” mantra. If you haven’t cooked through most of your beans in the first few months, it’s a clear sign you’re overbuying.Even dried beans have an expiration date.\nVinegarsBecause of its inherent acidity, vinegar doesn’t technically spoil. But that doesn’t mean you’ll want to leave it hanging out forever. Over time, your vinegar will start to ferment, developing what’s called a “mother” (a slightly slimy growth that’s totally harmless), it might discolor or develop sediment, and the flavor profile could change. To slow down the fermentation, store your vinegars in the fridge from the get-go.And just like that, you’re a pantry makeover pro.With knowledge comes power:These Are My Favorite Lentils for Soup, Since You AskedI want a lentil that's going to stand up for itself, not turn to mush.View StoryExplore Bon AppétitIngredientsLentilBeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-31", "author": ["Condé Nast", "Jesse Sparks"]}