{"id": "7ceaf6bc161ae9f9b9020f4e4b50a74d", "url": "https://www.bonappetit.com/story/tools-that-make-cleaning-your-kitchen-suck-less", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "4 Tools That Make Cleaning Your Kitchen Suck Less | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking4 Tools That Make Cleaning Your Kitchen Suck LessCleaning your kitchen is the worst, but these tools make it a lot easier.By Jesse SparksApril 10, 2019FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGHFacebookTwitterEmailYou made it: Winter’s over! No more snow, no more dirty road slush that used to be snow, no more sunsets at 2 p.m.! Now’s the time to celebrate by hitting up the finally-green farmers' market and cooking up a storm. But here's the thing: It’s hard to cook when the remnants of yesteryear's meals are still crusted onto every surface of your kitchen. We’re not judging! We’re well-acquainted with messy counters, pasta sauce-spattered stove tops, and backsplashes that are mysteriously sticky. When it comes time to get our lives back in order and finally get around to that spring kitchen deep clean, these tools are our salvation.Photo by TED+CHELSEA CAVANAUGHToothbrushIf you're really doing this, the humble toothbrush is your best friend—she's the unsung hero of lost places and hard to clean spaces. (And no, we don't recommend you using one of your old ones. Gross.) A pack of cheap toothbrushes belongs in your kitchen-cleaning arsenal. Use them to get in all of those weird, small places your normal cleaning tools can’t reach. The corners of your rimmed sheet trays, those weird little indentations around sinks, the lids on glass jars and travel mugs, and the areas behind oven knobs where spilled pasta sauce goes to crust-ify all become newly accessible with your trusty toothbrush. And trust us: Once you start cleaning all of those hard-to-reach places, you’ll shudder when you remember a time when you didn't. The world is your formerly filthy and hard-to-navigate oyster!Buy It: 4 Colgate Toothbrushes, $7 from AmazonPhoto by TED+CHELSEA CAVANAUGHHand VacuumNo disrespect to your broom, but we're trying to get rid of crumbs, not rearrange them. A handheld vacuum is a bit of an investment, but it'll change your kitchen life forever. A Brad Leone favorite, this Black and Decker Dustbuster quickly sucks up bits of herbs, stray sprinklings of seasoning, and the debris hiding out beneath your toaster. It’s quicker and more efficient than kicking up dust. The best part? You can use it in all kinds of places where a broom or regular vacuum just can't reach: pantry shelves, the dark cabinets above your stove, and beyond. Just don’t forget to recharge!Buy It: Black+Decker Dustbuster Cordless Vacuum, $58 from Amazon.Photo by TED+CHELSEA CAVANAUGHPutty KnifeSteel wool can only do so much. When it comes to the burnt-on, impossible-to-dislodge bits clinging to your cast-iron pans and rimmed baking sheets, a sturdy putty knife and a little elbow grease should do the trick. Just make sure not to use it on surfaces that are delicate or prone to scratching, like glass dishes or enameled pans.Buy It: Wooden Putty Knife, $7 from Amazon.Photo by TED+CHELSEA CAVANAUGHBottle BrushThe kitchen is chock full of vessels with openings too narrow to fit your whole hand into, and for all of those things, there's the bottle brush. Carafes. Vases. Jugs. Water bottles and Thermoses. Use it to clean those bottles you’ve been using to store gingerade and batched cocktails. Give those workhorses the proper cleaning they deserve.Buy It: Oxo Bottle Brush, $9 from Amazon.BONUS: Skura Style SpongeOkay, we know we said \"four tools,\" but we couldn't resist an opportunity to plug our favorite sponge. A sponge is not a sponge is not a sponge, folks. This double-sided Skura Style sponge is our test kitchen's ride-or-die; it's long-lasting and made from a special antimicrobial material that won't start stinking after a few days of use. And you'll always know when it's time to swap it out—when the logos on the rough side fade, it's done all it can. A good sponge is worth its weight in gold. Go forth and scrub!Buy It: Skura Style Sponges 4-pack, $15 from Amazon.All products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Now that you’ve got the tools, put them to use:Your Junk Drawer Has Got to GoIT'S CALLED JUNK FOR A REASON, PEOPLE!View StoryExplore Bon AppétitCleaningToolsGet OrganizedBasicallyShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-10", "author": ["Condé Nast", "Jesse Sparks"]}