{"id": "7ced326ef2fc88efd523970bda9778be", "url": "https://www.bonappetit.com/recipe/risotto-with-mushrooms-and-thyme", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Risotto With Mushrooms and Thyme Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2020 IssueRisotto With Mushrooms and ThymeBy Carla Lalli MusicJanuary 30, 20204.6(36)Read ReviewsTriangleEmailPinterestPrintPhoto by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsEmailPinterestPrintEmailPinterestPrintThe Italian word for the ideal risotto texture is all’onda—literally, “like a wave.” Risotto should spread and move and undulate. If you can stand a spoon up in it, it needs more liquid. The long, plump grains of carnaroli make for a finished dish that’s more special (and more beautiful) than one made with shorter varieties of risotto rice such as arborio or vialone nano. This risotto—part of our BA’s Best collection of essential recipes—is great on its own, or matched with other seasonal ingredients.Ingredients8 servingsRisotto1Tbsp. kosher salt, plus more6Tbsp. extra-virgin olive oil½large white onion, finely chopped2cups carnaroli or Japanese sushi rice1cup dry white wine5Tbsp. unsalted butter, cut into pieces2oz. Parmesan, finely gratedAssembly¼cup extra-virgin olive oil1lb. mushrooms (such as shiitake, crimini, or maitake), trimmed, caps torn into 2\" piecesKosher saltFreshly ground pepper5sprigs thyme5garlic cloves, crushed2Tbsp. unsalted butter2Tbsp. white wine vinegar or fresh lemon juice1oz. Parmesan, finely gratedPreparationRisottoStep 1Combine 1 Tbsp. salt and 10 cups water in a medium pot. Bring to a boil, then reduce heat to medium to maintain a bare simmer.Step 2Meanwhile, heat oil in a 6-qt. Dutch oven over medium. Add onion and a pinch of salt and cook, stirring often, until onion is translucent and starting to soften, 6–8 minutes. Add ½ cup water and cook, stirring often, until water evaporates and onion is sizzling in oil and tender, about 5 minutes. Taste onion; if it’s still firm at all, add a splash of water and continue to cook until meltingly soft.Step 3Add rice and stir well to coat with oil. Cook, stirring constantly, until grains are translucent around the edges and make a clattering sound when they hit against the pot, about 5 minutes. (Coating grains with oil before adding any liquid helps the rice cook evenly so that the outside does not become mushy before the center is tender.) Add wine and another pinch of salt. Bring to a simmer and cook, stirring occasionally, until wine evaporates, about 2 minutes.Step 4Reduce heat to medium, then add hot salted water to rice in ¾-cup increments, stirring constantly and allowing liquid to absorb fully before adding more, until rice is al dente and suspended in a fluid, not-too-thick creamy liquid, 25–30 minutes. It should take 2–3 minutes for each addition to be absorbed; if things are moving faster than this, reduce heat to medium-low. Gradual absorption and constant agitation are key to encouraging starches to release from risotto, creating its trademark creamy consistency. You may not need all of the hot water, but the finished texture should be more of a liquid than a solid. Start checking rice about 15 minutes after the first water addition; the grains should be tender but not mushy, with a slightly firm center that doesn’t leave a chalky residue between your teeth after tasting. Do not overcook!Only add more liquid once the previous ladleful has been absorbed.\nStep 5Remove pot from heat, add butter, and stir until melted. Gradually add Parmesan, stirring until cheese is melted and liquid is creamy but very loose; stir in more hot salted water if needed. Taste and season with more salt.AssemblyStep 6Heat oil in a large skillet over medium-high until shimmering. Add mushrooms; cook, tossing occasionally, until they begin to soften and release some liquid, about 3 minutes. Season with salt and pepper; cook, tossing occasionally, until deeply browned and tender, 8–10 minutes. Add thyme, garlic, and butter and cook, tossing occasionally, until garlic softens and butter is golden brown, about 3 minutes. Remove from heat and add vinegar. Toss to coat, scraping up any browned bits. Pluck out thyme.Step 7Divide risotto among warm bowls. Top each with a few grinds of pepper and spoon mushroom mixture over. Serve with Parmesan alongside.How would you rate Risotto With Mushrooms and Thyme?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis was a delicious, creamy risotto, but definitely a high fat dish. I used shiitake mushrooms, but as many commenters noted, any of the jillion additions would work. I've used water instead of chicken stock before in making risotto; it's different but no less tasty.David WilczynskiManhattan Beach, CA11/2/2021Great recipe. I would double the mushrooms next time!KathrynBirmingham10/26/2021I didn't rate this because the webpage is forcing five stars or nothing...some kinda glitch.  If i did rate it would be three stars.  \n\nThe consensus was that this was pretty good/good.  We've never made risotto with just salted water.  We always use broth.  So, that was interesting and good.  We usually use salted water for the base of Pappa al Pomodoro.  The consensus is that we prefer Mushroom Risotto vs. Risotto with Mushrooms.  If we make again, we'll double the amount of mushroom topping.  We needed more. And yes, adding some pancetta would be a great addition!RonPReston, VA3/9/2021We LOVED this recipe! I used Arborio rice because that's what we had and I did adjust the olive oil and butter additions - cut by half - but otherwise adhered to the recipe. My husband and I enjoyed it as a main dish (there were leftovers, of course) with a salad. KathyLancaster, PA3/5/2021Amazing!!! I messed up on the first try because I wasn’t focused on keeping the liquids and consistency of the rice  in check at all the times, but despite my error, the risotto was slightly mushy but the taste was uncompromised. My family loved it, they didn’t know any different and I can hardly wait to make it again al’dente ❤️ Thank you Bon Appetit for sharing Victoria BealLos Angeles 12/5/2020Yep, this was awesome.  Everyone loved it, including 3 and 5 year old grandaughters and their 88 year old great grandmother.  Four adults and and three children consumed every bite - and two of those adults have tiny apetites. \n\nI followed the recipe to a T, opting for carnaroli rice and crimini mushrooms.  OK, a tiny deviation because I didn't have thyme sprigs, so I just put two or three shakes of thyme leaves, thinking that would be about the same amount of flavor as removing five sprigs.  The flavor of the mushrooms with the white wine vinegar mix in at the end, had just the twist of flavor that left everyone saying this was better than restaurant risotto. AnonymousVegas, baby9/3/2020Wonderful crowd favorite!! We doubled the mushroom portion and it was a hit. Garlic oil was a fun add!megnwallaceSeattle6/10/2020Best risotto I've ever had.  Since it is just my husband and me, I cut the recipe in half and we will easily get a second meal. I had some leftover shrimp that I had roasted previously and added it at the end of the cooking of the mushrooms to heat through. With the lemon, it was a nice combination.  I also drizzled a bit of truffle oil on the risotto before adding the toppings.  amschlenkLynchburg VA4/12/2020I just made this for dinner and reduced the amounts as there's only two of us (and I didn't want leftovers). \n\nCarla, I'm starving! The portions are tiny! \n\nIt is gorgeous, in fairness,  but that makes me even more distraught that I spent that long making dinner and it's not enough!\n\nRevise that it feeds 8 please!catherinekfIreland4/10/2020This was the creamiest risotto I've ever had. I may have added bacon .... but I think Carla would be okay with that. alexbeggsBon Appétit 4/9/2020I've made this three times now - and I used to think I didn't like risotto. The texture truly is beautifully wavey and the mushrooms make for a fantastic textural contrast. Made this for my mum on the weekend and she's begging me to make it again!zoe.bEdinburgh, Scotland3/26/2020Have not made yet but will. But please include nutrition info with all of your recipesAnonymousMaryland3/19/2020This seemed like a lot of steps for risotto at first... but the result was so yummy I totally did not mind. I used oyster mushrooms. It was delicious!!!Stacy HagarLas cruces, NM3/14/2020This recipe elevates the every day risotto to a new Flavor plain. We are those annoying people who flit from recipe to recipe, looking for innovative flavors. We do follow the recipe step by step and are faithful to the ingredients. Stills most recipes disappoint. Not this recipe!  Risotto is a favorite food and the preparation can be an almost Zen like experience. Pour, stir gently, relax, repeat. With decent results. \n\nIn this case, careful attention to the onion preparation and careful coating of the rice lead to rich well developed flavor that we are savoring days later. Note, we used cheap short grain rice, nothing special. christinencote9776Seattle3/4/2020This was fantastic. Don't let the need to stir every few minutes be a deterrent to making this, it was quite easy. The mushrooms are so savory and the vinegar adds a nice brightness. I made a broth with salted water, garlic, thyme, and the mushroom ends and used that in addition to the plain salted water. Added some extra depth of flavor this way. Definitely a great cold evening meal. Took me around 50 minutes end to end. msfay91987San Francisco3/2/2020Explore Bon AppétitRisottoItalianEuropeanThymeHerbs & SpicesShiitake MushroomMushroomVegetableCrimini MushroomMaitake MushroomRiceRice & GrainsStarterSideGluten-FreeNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Carla Lalli Music"]}