{"id": "7cef0e162758362fe78199d407447a12", "url": "https://www.bonappetit.com/story/room-temperature-meat-tempering", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "The Key to Juicy, Perfectly Cooked Meat? Let It Sit Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Key to Juicy, Perfectly Cooked Meat? Let It Sit OutThat's right: Letting meat sit out at room temperature before cooking it is a total game changer. And no, it won't kill you.By Claire SaffitzJanuary 22, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere are a lot of weird food phobias out there (alliumphobia, anyone?) and yet a quick google search turns up no term for \"fear of raw meat.\" This is shocking to me, because most people completely freak out when I tell them they should let their meat come to room temperature before cooking. I have friends who practically put on hazmat suits before taking raw chicken out of the fridge. But I'm here to reassure all the raw meat-phobes out there that if you’re buying good- (or even decent-) quality meat and practicing food safety common sense, then letting a piece of protein sit out on the counter for a little while won’t kill you. (Or at least the likelihood is very very small. The CDC reported just 13 cases of trichinosis in the US in 2015.) In fact, taking the chill off your roasts, pork chops, and even fish fillets before cooking will produce juicier, more evenly cooked meat.When it comes to quick-searing a relatively thin cut of meat, like a thin steak, it doesn’t make a lot of difference if the center is cold. But for thick cuts (like a big pork chop) or animals you’re roasting whole (like a chicken or turkey), a little tempering—i.e., letting it come up to room temperature—makes a big difference. Here’s the basic logic: If you’re trying to cook the inside of a piece of meat to a particular internal temperature, like 135° for pork or 160° for poultry, the center will come up to temperature faster if it starts at a higher temperature. If a tempered turkey is roasting In a 325°-oven, the thickest part of the breast will hit 160° before the meat closer to the surface has had as great a chance to overcook. It means more even cooking all the way through, and less time for the meat to lose moisture while cooking, making it juicier.You don’t have to go crazy waiting for hours until the meat is absolutely 72° and taking the internal temperature before you start cooking. That would take a really long time. Just take whatever you’re cooking out of the fridge and let it start tempering in whatever time you have. If you’re searing, as for a pork chop, thoroughly pat the meat dry so you start to develop browning on the surface faster.Keep calm, wash your hands, and everything is going to be just fine.\nPhoto by Alex LauLet's just be clear: We're not saying you should leave your pork chops on the table overnight, or out in the sun for hours and hours. We always advocate for smart food safety practices when it comes to handling raw meat to prevent food-borne illness. This means washing your hands before and after handling and avoiding cross-contamination by using only cutting boards designated for raw meat. Don't use tongs that have touched something raw to handle other ingredients without a thorough washing first. Get a good instant-read thermometer so you can make sure the meat is cooked to the right temperature. Then take a few deep breaths and don’t panic. Remember that no part of cooking should involve a hazmat suit.So relax, take those pork chops out of the fridge, and cook without fear:Date Night Pork ChopRubbing a little honey across the surface of the pork before searing guarantees a shiny, caramelized crust. Pair that with a lemony endive and apple salad, and you've got the ultimate dinner for two.View RecipeExplore Bon AppétitBasicallyMeatRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-22", "author": ["Condé Nast", "Claire Saffitz"]}