{"id": "7cf722c4338b26434a654e9533b4d227", "url": "https://www.bonappetit.com/city-guides/montreal/venue/larrys", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Larrys Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealLarrysA natural wine bar that also serves the best breakfast in Mile EndFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: because Larrys is our second home. This airy all-day, all-evening café makes almost everything in-house, from pastries to rillettes, and you’ll want to park yourself at the bar and make a day of it.ORDER THE: entire breakfast menu. It’s only nine items, so it’s not hard to order everything, especially the bite-size pikelets (English-style pancakes) topped with salted butter; the spoonable soft scramble; and all the house-made sausages, bacon, and thick-cut toast (available all together in sandwich form or separate for purchase at Larry’s butcher shop, Boucherie Lawrence). Buy the carré blanc (a.k.a. Pullman loaf) as a souvenir or a snack for the trip back home. Security may stop you to ask what that delicious buttery smell coming from your tote bag is. Just smile and nod.THE VIBE IS: compact yet welcoming. Expect to be squeezed into a table very close to strangers, but they’ll likely be charming residents of the neighborhood and offer you recommendations for local boutiques and hole-in-the-wall bars.PRACTICAL STUFF: Open every day 8 a.m. to 1 a.m.—Alyse WhitneyPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEBoucherie LawrenceAll the Mile End goods to smuggle back homeDrogheria FineRun, don’t walk to this Mile End window shop doling out perfectly tender gnocchiSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Alyse Whitney"]}