{"id": "7cf9f048297b4359a1b55fffbf3caa76", "url": "https://www.bonappetit.com/story/seedible", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "This Sesame Seed Butter Is Highly Snackable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIf You Like Tahini, You’ll Love SeedibleThis alternative to peanut butter is a little bit salty, a little bit sweet, and 100% nut-free.By MacKenzie Chung FeganJanuary 15, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!Tahini is often a great sub for peanut butter in cookies, brownies, smoothies, and sauces. But there’s one arena where tahini simply cannot measure up: straight out of the jar snacking. While even the most natural of peanut butters typically contain salt (and sometimes also a sweetener), the best tahinis are made from sesame seeds and sesame seeds alone. So unlike the peanut butter that someone has already gone through the trouble of pre-seasoning for me, you won’t find me greedily dipping a spoon into a tub of tahini. Tahini is an ingredient; peanut butter is a meal.Enter Seedible, a “sesame butter” that bills itself as a spreadable, spoonable alternative to peanut butter that isn’t forbidden at day care. It has all of the earthy, bitter notes that I love in tahini, and the additions of salt and date powder make Seedible a ready-to-eat, savory-sweet spread—no doctoring required. Although I’m Team Creamy Peanut Butter, I find myself gravitating toward Seedible’s crunchy variety, which contains whole sunflower seeds. Chocolate sesame butter is launching soon—my smoothies are quaking in anticipation—and all varieties are organic, gluten-free, vegan, and completely nut-free.Thanks to the addition of organic thickeners and emulsifiers, Seedible is also less runny than tahini and less inclined to separate in the jar. The texture still isn’t a perfect swap for a thick nut butter, especially a highly processed one, and my guess is that a Seedible and jelly sandwich left sitting in a hot lunchbox for hours would be something of a messy affair. But I’ve been storing my jar in the refrigerator, where it emerges thick enough to hold its own slicked onto apple slices or a piece of toast. Then again, who needs bread? I’ll eat it straight off a spoon.Photograph by Emma FishmanSeedible Organic Sesame Butter, Crunchy$10 at Bubble Goods$8 at Thrive MarketPhotograph by Emma FishmanSeedible Organic Sesame Butter, Creamy$10 at Bubble Goods$18 at Amazon (Pack of 2)Explore Bon AppétitHealthyishHealthyish Loves ItShoppingTahiniRead MorecultureI'll Never Run Out of Alt Milk Thanks to This ConcentrateBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-15", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}