{"id": "7cffdcc6284f0bed3778e6524f6a8aef", "url": "https://www.bonappetit.com/recipe/roast-chicken-with-crispy-potatoes-and-salsa-verde", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Roast Chicken with Crispy Potatoes and Salsa Verde Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDRoast Chicken with Crispy Potatoes and Salsa VerdeSponsored by The Home DepotFacebookPinterestTwitterEmail4 servingsAir fryers are exceptionally good at turning out perfect, crispy-meets-creamy roast potatoes.\nRecipe by Christina ChaeyPrintIngredients1 3½–4 lb. whole chicken, patted dry¾ cup plus 3 Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground black pepper1 lemon, halved½ cup flat-leaf parsley leaves with tender stems, roughly chopped¼ cup cilantro leaves with tender stems, roughly chopped¼  cup sliced chives2 Tbsp. mint leaves, roughly chopped¼  cup white wine vinegar1 small shallot, roughly chopped1 jalapeño, seeded and roughly chopped1 garlic clove, smashed1½ lb. small potatoes, halvedRecipe PreparationPlace a rack in middle of oven; preheat to 425°. Set chicken in a 12” cast-iron skillet and rub all over with 1 Tbsp. olive oil. Season generously with salt and pepper. Insert lemon halves into chicken cavity. Tie legs together with kitchen twine.Roast chicken in oven until skin is golden brown and crisp all over and an instant-read thermometer inserted into the thickest part of breast registers 160°, 60–80 minutes. Let chicken rest in skillet at least 15 minutes and up to 45 minutes before transferring to a cutting board and carving.Blend herbs, vinegar, shallot, jalapeño, garlic, and ¾ cup oil in a blender until mixture is still slightly chunky and you can still see flecks of herbs. Transfer salsa verde to a small bowl and season with salt.Set air fryer to 400°. Toss potatoes with 2 Tbsp. oil and season with salt and pepper. Add potatoes to air fryer basket and cook for 12-15 minutes, tossing every 5 minutes, until golden brown and crisp.Transfer carved chicken to a platter and arrange potatoes around. Serve with salsa verde.Sponsored by The Home DepotRelated VideoRoasted Chicken with Crispy Potatoes & Salsa VerdeGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitThe Home DepotSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["The Home Depot"]}