{"id": "7d20465ae374259f80d7debb7936dd1c", "url": "https://www.bonappetit.com/recipe/grilled-cauliflower-and-broccoli-with-lentils", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Grilled Cauliflower and Broccoli With Lentils Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGrilled Cauliflower and Broccoli With LentilsBy Rachel GurjarJuly 6, 20214.4(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Yudi Ela, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintLarge seasoned cauliflower and broccoli steaks are charred on the grill until crisp on the outside and tender on the inside, then topped with a bright and minty chutney dressing. You can also swap in other cruciferous veg like cabbage or broccoli rabe, both of which are excellent when grilled. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonBlender$32 At AmazonHeat Resistant Leather Gloves$22 At AmazonBBQ-AID All Angles Grill Brush$40Ingredients4 Servingsgreen chutney1bunch cilantro, tough stems trimmed, coarsely chopped1bunch mint leavesJuice of 2 limes½serrano chile2garlic cloves1tsp. cumin seeds1tsp. sugar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼cup extra-virgin olive oilLentils1cup French green lentils, rinsed1tsp. Diamond Crystal or ½ tsp. Morton kosher saltvegetables and assembly1medium head of cauliflower (about 1 lb.)1medium head of broccoli (about 1 lb.)Extra-virgin olive oil (for drizzling)Kosher salt¼cup unsalted roasted pumpkin seeds (pepitas)Cilantro leaves with tender stems and mint leaves (for serving)Preparationgreen chutneyStep 1Blend cilantro, mint, lime juice, chile, garlic, cumin seeds, sugar, salt, and ¼ cup water in a blender until smooth, about 1 minute. Transfer purée to a small bowl. Gradually add oil, whisking constantly until emulsified. Set chutney aside.LentilsStep 2Bring lentils, salt, and 2½ cups water to a boil in a medium pot. Reduce heat to medium, cover, and cook until lentils are tender and liquid is absorbed, about 30 minutes. Remove from heat.Do ahead: Lentils can be cooked 5 days ahead. Let cool, then transfer to an airtight container. Cover and chill.Vegetables and assemblyStep 3Remove toughest outer leaves from cauliflower (leave the tender inner leaves) and trim 1\" off bottom of stem. Resting cauliflower on crown and starting at stem end, cut lengthwise into thirds. Trim off outer edges of crown from both outside pieces to create three 1\"-thick steaks; reserve trimmed-off florets for another use. Repeat with broccoli. Arrange broccoli and cauliflower steaks on a large baking sheet; drizzle with oil and season both sides with salt.Step 4Prepare a grill for medium indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Place broccoli and cauliflower on grate over indirect heat. Cover and grill until tender, 15–20 minutes. Uncover and move steaks over to direct heat; continue to grill until they are golden brown and edges are charred, about 2 minutes per side.Step 5Arrange lentils on a platter and drizzle half of the chutney over. Place cauliflower and broccoli steaks on top. Drizzle with remaining chutney and top with pumpkin seeds and herbs.How would you rate Grilled Cauliflower and Broccoli With Lentils?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis is a great combination of flavors and the chutney is delicious!  I had a hard time grocery shopping, though, for heads of both broccoli and cauliflower that would yield 3 1-inch steaks.  We wound up with broccoli \"drumsticks\" and two cauliflower steaks.  Next time, I would just roast the broccoli and cauliflower in the oven - can get just as good of browning without drying out - and essentially make a grain bowl.Jackie MMadison, WI9/11/2021Explore Bon AppétitCauliflowerVegetableBroccoliGreen LentilLentilSideMainDairy-FreeGluten-FreeVeganVegetarianGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}