{"id": "7d22ebdcec032e99cb7132505bb5ae95", "url": "https://www.bonappetit.com/story/how-i-made-peace-with-silent-dinners", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "How I Made Peace with My Family's Silent Dinners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Made Peace with My Family's Silent DinnersWhy didn't my immigrant family's dinner table sound like the ones on TV?By Magdalena PuniewskaAugust 22, 2018FacebookTwitterEmailPhoto by Hulton Deutsch via Getty ImagesFacebookTwitterEmailI used to be ignorant of the silence. But the thing about silence is that once you become aware that it exists, it’s all you can think about. And even though it doesn’t make a sound, the silence somehow begins to ring in your ears, like tinnitus. And because tinnitus is uncomfortable, you try to fix it.The silence I’m talking about happens at my family’s table. You see, my parents prefer to eat without talking. No, they relish it. The clinking of silverware against the plate, the slurps, hiccups, and lip smacks, those sounds don’t need to be drowned out by words. For my parents, the table isn’t like a beer hall or a debate event or a speakeasy. It’s a place where one—quietly—consumes kotlety, potatoes, pierogi, pickles, bigos, and other Polish dishes that we’ve eaten our whole lives. And it’s all over in about ten minutes.I hated those silent dinners.Growing up, I felt strongly that meals—dinner in particular—had to be a garrulous affair, and TV was partly to blame. I watched a lot of it growing up because it helped me learn English, which was otherwise difficult to do in my immigrant household. TV families always had things to say during dinner. TV adults asked TV kids about their day and their classes and how their crush was doing at school. TV teens sometimes made radical statements about politics or the environment or that neighbor who looked at them funny. TV families always talked during dinner, and my family did not.If TV planted the seed, then my meals beyond our quiet table were like a heavy hand of Monsanto fertilizer. They started in high school, when some American families would ask me to stay over for dinner. (This really offended my mother who thought my absence was clearly and only a comment about her cooking. This was not the case.) Dinners at their homes were full of probing and problem-solving and lots of emotions. They seemed to be about the people as much as the food.The worst part for me was when these friends came over to my house and were met with silence at our table. I desperately tried to get my parents to please reveal something or ask or comment. Watching me flail, they would oblige, but always with a heavy sigh. It’s not that my parents weren’t interested in my friends. They always tried to get to know them after, once we’d finished our chicken breasts, pierogi, and garden salads—meals that were always a fusion of our Polish fare and things that my mother thought would be more “appealing” to the visitors—cleared the dishes, and sank into the couch in the living room. Then it was time to talk.I decided that I needed to reform my parents. Maybe they missed the dinner conversation portion of their citizenship classes? My first tactic was to be more like the person I wanted to eat with, which would hopefully inspire them to be the same. These people were engaging and asked many questions and gave many thoughtful replies. But my questions received terse responses and my comments were met with silence. “Can we talk about this later,” my father asked. “I’m trying to eat.” So, I became confrontational. “Why can’t we talk during dinner like the other people?” I asked. My father stared straight into the borscht he was slurping and chuckled. “It’s okay. We’ll talk after.”Sometimes your parents go home after a particularly hostile encounter\nat the grocery store and you can see them in the study, hunched\nover a cassette tape teaching them how to open their mouths and move\ntheir tongues in ways that will be easier for these people in the\ngrocery store to understand.I left home and went away for college and studied abroad and travelled and moved to New York City. After eating at many more homes and with many more friends and many more relatives, I realized that a lot of adulthood is about performance. We act when we’re at work, with friends, and when we’re eating at someone’s home or in a restaurant. When it comes to shared meals, a lot of Americans prefer performance over silence, which might come off as awkward or hint at social ineptitude. Many of these dinners I went to in high school were just performances, I realized now. When the guests weren’t around, a lot of those families probably ate in silence too.The thing about being an immigrant, or growing up in any minority group, is that people are always asking you to change something. Hey, you pronounced that wrong. Hey, try not to bring smelly things for lunch next time. Maybe you could take off that thing that you’re wearing as we don’t really put that on here. Sometimes it happens to you, and sometimes you see it around you. Sometimes your parents tell the school your name is Maggie, not Magdalena, because that would be a little easier, wouldn’t it? Sometimes your parents go home after a particularly hostile encounter at the grocery store, an encounter where someone told them they should learn (expletive) English, and you can see them in the study, hunched over a cassette tape teaching them how to open their mouths and move their tongues in ways that will be easier for these people in the grocery store to understand.I thought that if I could just teach my parents to speak during meals at home, they would do it when my friends came over so we would seem like a “normal” family and they would do it when we were eating at a restaurant, so the wait staff wouldn’t wonder why we ate so quickly. (Hungry? they would often ask.)But, after many years and dinners, I realized that my parents didn’t want to change. They had already changed enough. They changed their names and tidied up their pronunciation and adjusted what they brought for lunch. And if there’s anyone that should get that, it’s me.One night last year, we went to Cheesecake Factory, my parents' favorite restaurant because it’s like a “fancy diner”—their words—in that it offers almost anything you want, in very large portions. I forget the occasion, but it was loud. The clinking and slurping and dreaming and debating happening all around us made it impossible to converse. So we ate in silence, slicing away at our huge burritos and Greek salads and pot stickers that seemed to never end. A few weeks later, when someone asked me what we did, I realized that, just because we didn't speak at dinner, didn't mean we didn't celebrate; it didn’t mean we were any less together. In that quiet, we were still a family.I can’t say I’ve fallen in love with silent meals or that I’ve tried to institute them with my friends. (I promise I’m done with mealtime dictatorship). When I eat with friends, I love to talk. I love that the need for communication is sometimes so urgent that we speak with our mouths full and the food occasionally sputters out like confetti. But when the silence comes, as it always does, it doesn’t ring like tinnitus. It’s just a hum. And I can live with a hum. A hum is familiar—it reminds me home.Explore Bon AppétitHealthyishessayRead MoreshoppingI Eat Dinner at 4 p.m. and Trust Me It’s GreatBy Jennifer Still Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-22", "author": ["Condé Nast", "Magdalena Puniewska"]}