{"id": "7d35a2c373463213621acb7eb14338a5", "url": "https://www.bonappetit.com/recipe/slow-roasted-salmon-with-harissa", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Slow-Roasted Salmon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueSlow-Roasted Salmon with HarissaBy Molly BazMarch 20, 20185.0(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe first time we ran a recipe for slow-cooked salmon poached in olive oil, surrounded by fennel and citrus slices, and casually pulled apart, readers swooned. We swooned! It became an instant, oft-imitated classic. We’ve riffed on it ourselves, running flavor variations over the years, including this new one. The reason it has become such a staple: The low temp and abundance of olive oil make it nearly impossible to overcook. You’ll forget there’s any other way.Ingredients4 servings⅓cup extra-virgin olive oil¼cup harissa paste (our favorite is New York Shuk)1garlic clove, grated1lemon, halved12-lb. skinless center-cut salmon filletKosher saltMixed tender herbs (such as parsley, cilantro, dill, and/or chives; for serving)PreparationStep 1Preheat oven to 275°. Whisk oil, harissa, and garlic in a medium bowl. Pour half of harissa oil into a 2.5-qt. baking dish and swirl to coat. Thinly slice a lemon half and remove any seeds; scatter slices in dish.Step 2Season salmon on all sides with salt and place in dish. Pour remaining harissa oil over salmon, spreading evenly over flesh with a pastry brush or spoon. Roast 15 minutes. Remove from oven and baste fish with harissa oil pooled in dish. Return to oven and continue to roast until flesh flakes apart easily with a spoon but is not quite cooked through, 10–20 minutes longer.Step 3Use spoon to break up salmon into irregular pieces. Arrange salmon and lemon slices on a platter. Drizzle with any harissa oil left in dish, squeeze remaining lemon half over, and scatter some herbs around.How would you rate Slow-Roasted Salmon with Harissa?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI struggle to cook salmon so that it is neither overdone nor underdone. But not with this recipe. I halved the recipe and cooked it in one of those pyrex style glass storage containers. Partner who endures salmon, said this was the best salmon recipe I had made. I too used the Trader Joe's Harissa. Can imagine using same method with some other flavor combo.  Perhaps a curry/chutney/ghee?AgathaVirginia10/26/2021My wife and both loved this recipe for salmon and I made tabbouleh salad to go with it.  The combination was fantastic and I will defiantly make it again  RandiniAsheville, NC 5/9/2021Awesome weeknight meal! So easy and flavorful. The only thing I’d say is that it’s a little one-note, but if you’re looking for a reliable salmon recipe, this is it. I recommend using cilantro to add a little coolness, and Trader Joe’s Harissa paste has worked well for me after having trouble finding good Harissa at other grocers.Detroit, MI9/29/2020Great weeknight recipe (easy, quick, minimal mess). Trader Joe’s harissa paste was a good substitute for my usual NYShuk. Additionally, I made a little tahini greek yogurt sauce on the side (I’m weak when it comes to spicy food). If I make this for friends, I think I’ll serve with a basmati rice. Loved this and will make again soon. eerochkaChicago 12/20/2019I cook a lot of salmon and this is my favorite salmon recipe.\n\nSo good - not much more I can say about it.\n\nThis pairs really well with the black lentil and harissa veggie bowl recipedaubie77Boston, MA5/26/2019I made this for New Year dinner and it was sublime. Fish was moist, flaky and just with right amount of heat. Cilantro worked well. I served with rice and arugula-fennel salad. briggitaz1/10/2019Explore Bon AppétitSalmonFishSeafoodHarissaCondiments, Sauces & PastesEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Molly Baz"]}