{"id": "7d405e54e2a389a0da35dca6f9b60c6e", "url": "https://www.bonappetit.com/story/cheesy-croutons", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "There Are Regular Croutons—And Then There Are Cheesy Croutons | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Are Regular Croutons—And Then There Are Cheesy CroutonsI would do pro bono PR for these croutons.By Antara SinhaFebruary 18, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Thu BuserFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, cheesy croutons.I never thought I would become a strong advocate for keeping a large batch of homemade croutons on hand. A crouton spokesperson, if you will. In fact, I’d never given that much thought to croutons at all. Sure, they may be a nice textural addition to salads and soups (we’re huge fans of Crispy Gone Soggy around here), but they’ve never been top of mind.But the cheesy mustard croutons on Christina Chaey’s Creamy Cauliflower Soup changed my life mind. Those deserve more than a little hype.Instead of showering the cubed bread with dried onion or garlic powder (my default in the past) or taking a cue from the store-bought variety and turning to Italian seasoning, Chaey coats the croutons in Dijon mustard and shredded Gruyère or cheddar cheese before baking.Mildly tangy mustard and buttery Gruyère are a perfect croque monsieur–esque combination (and a nice change of pace from typical crouton seasonings). When the two team up, they can give any stale or past-its-prime bread you have on hand a new lease on life. That loaf in the freezer you’ve been meaning to turn into breadcrumbs for weeks? Drench it in cheese, butter, and Dijon, crisp it up, and it’s ready to boogie.Here’s how to make cheesy mustard croutons:Combine 1 Tbsp. extra-virgin olive oil, 1 Tbsp. unsalted butter, melted, and 1 Tbsp. Dijon mustard in a medium bowl and whisk to combine; season with salt and pepper. Add 5 cups country-style bread, preferably day-old, torn or sliced into 1\" cubes, and toss to coat in mustard mixture. Scatter ½ cup finely shredded Gruyère or cheddar cheese over, toss again to combine, then transfer croutons to a prepared baking sheet. Bake croutons at 350° until cheese is melted and crisp around the edges and croutons are golden brown and crunchy, 10–15 minutes, flipping once halfway through. Then it’s ready to shower over salads and soups galore.Of course you can use these as a topping on most creamy soups or hearty salads that play nicely with bold flavors and rich dressings, but that’s not all: These seasoned, flavor-packed croutons can also get folded into an eggy breakfast casserole in lieu of cubed bread or crumbled over firm whitefish like cod in place of breadcrumbs before baking. Or do what I did: Plow through half your stash by munching on them as a snack in the way you would cheesy crackers or chips. That’s it—I have officially made a full transformation into a crouton hype-person.Get your soupCreamy Cauliflower Soup With Cheesy Mustard CroutonsCauliflower shows its soft side in this velvety-smooth and just-rich-enough soup topped with cheesy, mustard-y croutons.View RecipeExplore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-18", "author": ["Condé Nast", "Antara Sinha"]}