{"id": "7d4d5a1482e616925242e6f0d00d5841", "url": "https://www.bonappetit.com/recipe/onion-dip-potato-chips", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Onion-Dip Potato Chips Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueOnion-Dip Potato ChipsBy Andy BaraghaniNovember 20, 20184.2(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe made these homemade onion-flavored chips to be even more addicting than the store-bought versions.Ingredients8 servings2Tbsp. onion powder1Tbsp. garlic powder¾tsp. crushed red pepper flakes½tsp. kosher salt18-oz. bag kettle-cooked salted potato chips¼cup extra-virgin olive oil⅓cup finely chopped dill1lemonFreshly ground black pepperSpecial EquipmentA spice millPreparationStep 1Preheat oven to 425°. Grind onion powder, garlic powder, red pepper flakes, and salt in spice mill until red pepper flakes are finely ground. Transfer to a small bowl and set aside.Step 2Spread out potato chips on a rimmed baking sheet. Bake, tossing halfway through, until deep golden brown, about 5 minutes.Step 3Transfer potato chips to a large bowl and drizzle with oil. Sprinkle reserved spice mixture over and add two-thirds of dill. Finely zest lemon over chips. Sprinkle with lots of black pepper and toss to coat (do all this while the chips are still warm so they absorb the flavors of the spice mixture). Taste and season with more salt if needed.Step 4Transfer chips to a platter and top with remaining dill and more black pepper.How would you rate Onion-Dip Potato Chips?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI don’t have a spice grinder so used the red pepper flakes whole and it worked out fine! I also didn’t have fresh dill so subbed less dry dill and it was still good, though I definitely want to try again with fresh dill! \n\nAfter making the chips, I also found myself craving a dip for them. I mixed together (all approximate) 1 cup plain Greek yogurt, 2 tbsp capers, 1 tbsp lemon juice, a drizzle of olive oil, some dill, garlic powder, and black pepper and it paired great with the chips! Will definitely make again AnonymousChicago, IL5/3/2020Delicious, easy, will make againAnonymous2/11/2019We loved this!  It turned a bag of chips into a party appetizer.  They were gone in minutes!Manhattan Beach, CA1/1/2019We loved this. Just added that little extra to plain chips.AnonymousSudbury, ON, CANADA12/30/2018This does not do anything to improve the potato chips right out of the bag.hegilliamWashington, DC12/27/2018Explore Bon AppétitEasyQuickSnackNut-FreeDairy-FreeGluten-FreeVegetarianVeganSuper BowlFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}