{"id": "7d7fda34816cdc58f57aca5c292ea37c", "url": "https://www.bonappetit.com/story/mashama-bailey-edna-lewis", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "I Was Searching for a Cook Who Looked Like Me—Then I Found Edna Lewis | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Was Searching for a Cook Who Looked Like Me—Then I Found Edna Lewis“Through Miss Lewis I realized that there was a history of black women, like me, in professional kitchens, and that I wasn’t alone.”By Mashama BaileyApril 6, 2018FacebookTwitterEmailEdna Lewis in Lahore, Virginia, 1975.© John T. HillFacebookTwitterEmailBefore she opened The Grey in Savannah (one of our 50 Best New Restaurants in 2015), chef Mashama Bailey had a career as a social worker. She quit, following her passion for cooking, and entered culinary school, where she discovered the recipes of Edna Lewis. Below, read Bailey’s chapter from Edna Lewis: At the Table with an American Original, an engrossing compilation of essays about the legacy of Edna Lewis, out April 18.Around the age of ten, I started cooking breakfast for my parents. I enjoyed the feeling of control I got from being in the kitchen. Breakfast, at the time, was the only meal I knew I could prepare independently. I liked standing at the stove stirring eggs in the pan or whisking grits into boiling water. We lived in Queens, New York, our kitchen was small, and there was not a lot space for many appliances. I would spread butter on sliced bread then carefully place it in the broiler. Sometimes we would eat our eggs with bacon and sometimes with leftover slices of ham.Despite the sense of satisfaction preparing food for others brought me, as it turned out, I wasn’t a very good cook back then. The grits would clump. The eggs would brown. The toast would always burn. My proud ten-year-old self would scrape the burned edges from the toast, then cut the slices diagonally so they would be easy to eat. I would put a slice of American cheese over the grits so that the lumps did not matter. As for the eggs, they tasted pretty good.My parents never told me that my breakfasts weren’t perfect. They always accepted my Saturday morning offerings with big smiles and great pride, and ate everything—even the charred toast. For years, I actually thought they preferred burned toast. I found out some years later that I had been mistaken.Despite the joy I found in the kitchen, I was never the cook of the family. Both of my grandmothers cooked very well, and my older cousin Alan would experiment at the stove to impress the family with all types of hotpot concoctions that he could think up. I was shy and stayed in the background, but somehow I always seemed to end up in the kitchen asking questions.I came from a working family. My parents were young, and both went to college after their children were born. I was the little mama, the oldest of three, and the support for my parents. I picked up my brother and sister from school and daycare. I made them snacks and helped them with their homework while we waited for our parents to come home. During the week my mother cooked quick meals like pasta with a salad or canned soup with sandwiches.But Sundays were different. On Sundays, she cooked all day.My mom was born and raised in Waynesboro, Georgia, a small town just south of Augusta. It was on Sundays that she reminded her young family where she came from. She would roast chicken and serve it with rice and gravy and greens. We ate glazed ham with sweet potatoes and cabbage. She didn’t bake, but there was always cornbread or biscuits on the table. And the real treat, fried chicken! She made the best fried chicken. She used a cast-iron pan and grease she had saved, to be used only for chicken. It was a meal that took hours, and we only had it sometimes. She would always make pan gravy, mashed potatoes, and sweet peas to go alongside the crispy meat. Really good fried chicken is still one of my favorite foods.Mom’s Sunday cooking—now that was food to me. Living up north, soul food and southern food were commonly considered to be one and the same. People think of soul food as BBQ ribs, macaroni and cheese, buttermilk biscuits, and sweet tea. Our Sunday dinners taught me about my family and what we ate, and helped me distinguish real southern from soul food. But I had no idea that there was so much more.In 2000, I decided to change my career path from social work to becoming a chef. My decision was prompted by a few work dinners where coworkers complimented me on my sweet potatoes and roasted chicken. With a half-cocked aspiration, I left my job in Brooklyn and decided to attend culinary school.The school I attended was French based, like all culinary schools at the time and the majority, still, today. I had chosen it because it was geared toward career changers and had an excellent work-study program. I also liked that the school took the view that French food was the mother of all professional cuisines, so my education’s foundation of principles, I thought, would be priceless.During the first phase of classes our chef instructor asked us to write an essay about someone who inspired us to cook. My mother, of course; so easy, I thought. I would interview her when I got home that evening. But our teacher insisted that it be someone professional, like Escoffier or James Beard. My dilemma was that the only chefs I’d heard of were the ones on TV: Julia Child, the Frugal Gourmet, and the Cajun chef Justin Wilson.I wanted to write about someone who looked like me, and like my mother and grandmothers. I began my search for a chef that I could admire. I started trolling around on the Internet without finding much on the subject of notable black women cooks. I searched at the public library, and after some digging, I found an article about a woman called Edna Lewis.Edna Lewis’s search for taste, as well as her story, stuck with me. A black woman from the South, Miss Lewis moved to New York to start a whole new life, first as a laundress, later as a seamstress and restaurant chef. She was never formally trained, but she had grown up cooking in rural Virginia, was hardworking, and loved wholesome food made with fresh ingredients. This sounded like many of the women in my family before me. As the opening chef at Café Nicholson in New York in the 1950s, she showcased simple food and was heaped with praise for it. Through Miss Lewis I realized that there was a history of black women, like me, in professional kitchens, and that I wasn’t alone.My cooking school was diverse. We had students from all types of backgrounds, but in class, African Americans were poorly represented. So I decided to tell my classmates about my discovery of Miss Lewis. Many of them hadn’t heard of her. My culinary instructor had, though, and told me about her cookbooks. In Pursuit of Flavor was the first cookbook of Miss Lewis’s that I read. I prepared her boiled Virginia ham recipe with mustard and rosemary for our final exam. I got an A−.Armed with my new base of French gastronomic knowledge and ready to pursue a career in fine dining, I spent the next few years bouncing around from restaurants to catering to personal chef work, trying to find out where I fit in in the culinary world and what was I going to do. Like most young cooks, I did not have a plan. And, like many of my planless peers, I decided to travel. I signed up for a stage at a cooking school at a château in France.Château du Fey was located ninety-five miles south of Paris in Burgundy. It had a garden that we could explore and pick from for both our guest and staff dinners. I learned about farming, different herbs, slow cooking, and preserving. I loved how people in the French countryside lived. It was a slower pace of life from that of New York City. Working people in France had afternoon breaks that allowed them to go home and care for their families. I realized that the only place in the States that seemed to have anything in common with the French lifestyle was the South.I was born in the Bronx, but the South has always intrigued and had a pull on me. As a kid, I would do almost anything to associate myself with the region. Growing up, I liked to say, “I’m one generation removed ‘southern.’” During my time in France, I started to reminisce about visiting my relatives in Waynesboro during summers growing up. We would sit out on the porch and watch the cars go by. A few times a week, someone would pull up in front of the house with bushels of all kinds of vegetables. They would bring my grandmother fresh butter beans, green beans, corn, and summer squash. She picked up samples of every fruit or vegetable to smell them before buying anything. My uncle could tell when a watermelon was ripe by balancing the straw from a corn broom straight across the fruit.I also started noticing similarities between French and southern food. At the château we made coq au vin, a braised bird cooked down in wine, onions, and bacon. The dish instantly brought me back to chicken and dumplings, just replacing the wine with a bit of broth and adding dollops of bready dough before cooking. In France we prepared a gratin of summer vegetables; at Grandmamma’s house, she made squash casserole. French cooking, I found, made sense to me because of the memories of southern food and culture it evoked. It was the sort of food I was not only interested in cooking but wanted to eat, too.I began to think of Edna Lewis again, and how she was always cooking in such a way as to get better flavor. Simple, pure food. The château had a ton of cookbooks, and I was surprised to find that they had all of Miss Lewis’s. I read The Taste of Country Cooking and was amazed to find how close the dishes were to the foods of my mother’s past. Blackberry cobbler, baked ham, green beans and pork, and sausage patties! These were the foods that my mother grew up eating!By the time I returned home to New York, I’d decided that I wanted to become a restaurant chef. I worked as a line cook for three years in some of New York City’s busiest restaurants, attempting to reinstate myself into the community. When I thought that I was ready, I applied to Prune in the East Village. I had heard that the chef there, Gabrielle Hamilton, was a legend in her own right. She had the reputation of being a badass with a serious perspective on food. Lots of people knew of Prune for its fantastic brunch menu, but I wanted to work there because I knew it was time to move my career to the next level. I was finally ready to become a sous chef, and I wanted to work with a chef who had a point of view, a voice, and something to say.I arrived at Prune right after Gabrielle completed her first book, Blood, Bones, and Butter. The restaurant was a hotbed for creativity. We all found ourselves buzzing around the tiny space, excited just to be there and ready to work.Working with Gabrielle and her staff, I noticed that there was an underlying theme threaded through every meal, from brunch down to our staff meals. It was “Cook what you want to eat!” I like to call that grandma cooking, this idea of providing people with a sense of time and place through food, reminding them of why they like a particular dish in the first place. Is it because strawberries are in season or because you can smell the sugar being stirred into the iced tea that took hours to make? Again, I found myself thinking of Miss Lewis.At that point, I began to understand why she had become such a recurring fixture in my life. It wasn’t because she looked like my elders; it was because she cooked like them. Miss Lewis cooked from her heart and with the support of all those childhood memories of taste. Her food had a sense of time and place. But above all, she cooked how she liked to eat. This is what I love about cooking and, I realized, why I wanted to become a chef: I want to preserve history and celebrate it one meal at a time.A few years later, I decided it was time for me to move South. With the help of Gabrielle’s recommendations and advice, I headed to Savannah, Georgia, and I opened my own restaurant, The Grey. At The Grey, we cook the kind of food I like to eat, the very sort of food Lewis, my mom, Hamilton, and all my women culinary influences have given me the confidence to cook professionally.Every so often, I open In Pursuit of Flavor. I boil some Virginia ham the way Miss Lewis says to, just so I can eat it with soft scrambled eggs, creamy grits, and toast that is the shade of brown the makes you remember why you love toast anyway. This breakfast is a far cry from the ones I made as a child, but it brings back memories nonetheless.Mashama Bailey is the chef and partner of The Grey, an award-winning restaurant she opened in late 2014 in a former Greyhound bus station in Savannah, GA.“It’s Not All Fried Chicken and Greasy Greens,” by Mashama Bailey, from Edna Lewis: At the Table with an American Original, edited by Sara B. Franklin. Copyright © 2018 by the University of North Carolina Press. Used by permission of the publisher.John T. Hill’s exhibition Edna Lewis: Photographs by John T. Hill is on view at Crook’s Corner in Chapel Hill, NC through May 7, 2018.Explore Bon AppétitBooksRead Moreculture17 New Spring Cookbooks We Can’t Wait to StainBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-06", "author": ["Condé Nast", "Mashama Bailey"]}