{"id": "7d850d7cc848c2e7cf3b8f0e5974a51c", "url": "https://www.bonappetit.com/story/never-fail-white-bean-chili-recipe", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "This White Bean Chili Recipe Is Sunday's Real Main Event | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Bowl I Care About This Sunday Is Full of White Bean ChiliI actually like watching football, but making this white bean chili recipe is the thing I'm really looking forward to.By Elyse InamineFebruary 1, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes—like this white bean chili recipe—that never, ever let us down.Let’s get one thing out of the way: I like football. Really! (Says the former ballet dancer who went to a school with no football team or general school spirit—shout out to NYU!) Growing up in the suburbs of Los Angeles, I attended USC football scrimmages (NOT EVEN THE REAL GAMES!) with my family. We watched the NFL combines as if we were on a Sopranos bender and the draft like it was the Oscars (my sister had to take notes). I know all too well the difference between offsides and false starts (and the hand signals!) and can yell at the ref like any other football lover.And yet, the only bowl I care about this Sunday is the one that's going to be full of Claire Saffitz’s white bean chili recipe. (Wait, there’s a game? Just kidding.) Of course, the Super Bowl is going down (L.A. represent!) and, yes, I’ll be screaming at the TV every so often with the rest of America. But honestly that’s just the backdrop to this Platonic ideal of chili, a white bean chili recipe so simple and perfect that it is destined to steal the show. I'll pass on watching a replay of the same play for the 1,000th time. I’ll be in the other room, helping myself to chili and all the fixings. It’s that good.I’ve eaten a lot of chili in my day. The canned stuffed heated up and poured over rice, Hawaii-style. This heavenly brisket and squash recipe. This very complex and complicated version. But this one from Claire is the Tom Brady of chilis. (Not a Patriots fan, but I just can’t deny Brady’s brilliance.) Every component of the recipe is calibrated for the most flavor and texture, like the ultimate fantasy team. Spicy chorizo stands in for boring ground beef. Lame kidney beans are benched for buttery cannellini beans. Red onions, instead of less-flavorful white ones, join the huddle. Using the chorizo fat to sizzle the aromatics puts the “special” in special teams. Simmered together with a whole head of garlic (!!), hand-crushed canned tomatoes, a little cumin and chili powder, it’s the most simple yet satisfying thing to eat, even if there isn’t a game on.Okay, this queso recipe is pretty non-negotiable too.\nLaura MurrayIt does require a little bit of planning ahead though—the beans need to be soaked overnight and all that simmering adds up to one and a half to two hours in the oven. But even if you forget, you can get around the soaking overnight and, plus, there’s a little game on that will keep you entertained until the real MVP appears: this glorious bowl of chili.Get the recipe:White Bean and Chorizo ChiliCrumble some chorizo, set your bean timer, queue up a movie, and win Sunday: Netflix and chili.View RecipeExplore Bon AppétitChiliNever FailWhite BeanChorizoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-01", "author": ["Condé Nast", "Elyse Inamine"]}