{"id": "7d98c67496fe75eaa9a9d887877c50e3", "url": "https://www.bonappetit.com/story/guide-to-miso", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "How to Cook with Miso, From Buying It to Storing It to Using It in Soups, Marinades, and Dressings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Find the Miso You Like Best, Taste It PlainThe world of miso is vast and varied—here's how to buy it and cook with it.By Katie OkamotoOctober 27, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailMiso contains multitudes. “When I meet somebody from a different region [of Japan], we always start talking about what kinds of miso soup they make,” says Naoko Takei Moore, an LA-based cookbook author who also sells artisanal miso in her donabe store, Toiro. “It’s fun. You get to learn about where they’re from.”“It depends on the climate,” says Ai Fujimoto of Omiso, a small-batch miso maker in LA known for its miso-dama, or ready-made miso soup balls, inspired by Southern California’s produce. “What you think is a ‘classic’ miso soup depends on where you come from. I’m originally from an area near Kyoto, and what my mom would make is probably very sweet for people from Tokyo.”Because of its centuries-long history in Japan, miso has developed into distinct regional styles with diverse flavors and colors—from intense dark reddish brown in the coldest, northern prefectures, to mild and pale in the warmer south. And this isn’t exactly a continuous spectrum: Aichi prefecture, where Nagoya is located, is known for its almost black Hatcho miso, while nearby Kyoto prefecture is known for very light Saikyo miso.The salty fermented paste dates so far back in Japanese cooking that even its origins are disputed—some cite evidence of early miso-like foods existing in Japan since the Iron Age (300 BCE–300 AD, give or take), while others think it came more recently from China, when Buddhist priests brought salted soybean paste to Japan during the Tang Dynasty (618–705 AD). Miso as we know it today traces back to at least the 900s, and probably to the 700s. Miso soup—eaten daily in traditional Japanese meals—became a samurai staple in the 12th century.What is miso?While miso has diversified since its earliest days, its basic methods haven’t changed a whole lot. It’s made by mixing cooked soybeans (although alternatives exist) with a grain (usually rice, but barley and soybeans are also traditional) that has been inoculated with Aspergillus oryzae mold a.k.a. koji—the same koji used in sake brewing—and adding salt and water, then leaving it to ferment. Miso is a living food and, when allowed to ferment naturally, expresses terroir, a unique flavor profile influenced by the combination of ingredients, climate, and time. (More on this in a minute.) This can yield a gorgeous complexity of aroma and flavor—including a variety of umami, sweet, and floral notes—alongside its earthy saltiness. The characteristics of a given miso paste will be imparted to the dish you use it in.Often, mass market miso rely on commercial koji and accelerated fermentation, along with flavor additives, so they can be more one-note (much like the difference between a low-intervention ‘natural’ wine versus mass-produced bottles). For quality miso, a good rule of thumb is to look for ingredient labels that list only water, soybeans, koji grain, and salt. Some labels will also list alcohol, which may be added for flavor or be a natural byproduct of fermentation. If there’s more than that listed, it’s probably not high quality. That said, while it’s worth seeking out miso without additives for the complex flavors and probiotic health benefits, a lot of grocery store miso does the job fine, especially if you plan to cook it for more than a minute (cooking for long periods kills the probiotics and removes some nuance anyway).What to look (and taste!) forIf you’re new to miso, you may need to buy some that you don’t end up loving, at least at first, before you figure out your preferences. “Because there are so many kinds, and every person has a different taste, you have to choose what’s good for your palate,” Moore says. “You kind of have to give it a try.”But if you’re looking for pointers, Moore says the best way to tell high-quality miso is to taste it plain (go ahead, eat miso from the jar with a spoon): “If you can eat the miso on its own, or as a dip with vegetable sticks, that’s good miso.” Look for a lasting finish. “And any good miso should have sweetness, which comes from the fermentation, and multi layers of umami.”When you’re navigating the miso aisle, consider color, koji type, and saltiness. These are the three characteristics usually used to describe miso, and they’ll tell you a lot about the flavor before you ever taste what’s inside.1. ColorColor is influenced by grain type and fermentation time. Generally, the darker it is, the more intense and salty the miso will taste. Yellow (awase) miso is the most common miso in Japan, and is probably the kind you’ve encountered in miso soup at sushi restaurants. From awase, it gets more intense, with red (aka) miso—dark brown miso with the saltiest, strongest flavors, often fermented for more than a year and made with soybean koji—and white (shiro) miso—usually cream to pale gold, with the mildest, sweetest flavors, fermented quickly, and using rice koji.In general, the darker miso, the saltier and more intense it will taste.\nPhoto by Alex Lau, Styling by Emily EisenOn the shiro side of the spectrum, you may have encountered Saikyo miso, a sweet, ultra smooth miso from Kyoto. Its delicate flavor makes it a classic pairing with white-fleshed fish, and in Kyoto-style miso soup. Moore says it’s also incredible mixed into a vanilla ice cream base, and she also uses it liberally in baked goods. I’ve sometimes spread a thin layer on toast under slices of cheddar cheese and apple. Because of its low salt content, Saikyo miso should be eaten within a few months of opening or it may spoil, unlike other varieties.2. KojiEach strain of koji brings its own flavor profile and fermentation speed. Depending on the vigor of the strain of koji and the climate where the miso is made, as well as the desired flavor and texture, miso may be left to ferment anywhere between three months to three years. (Omiso’s Fujimoto says she had to shorten her fermentation time in LA when she switched from Japanese koji to American koji, because the American koji is faster.)The vast majority of miso uses koji grown on white rice, which brings additional sweetness. You may also find miso made with brown rice koji, like the one made by Yamaki Jozo, which has a more nutty flavor (and darker color). Barley koji (mugi miso) imparts a malty aroma, and is common in the south of Japan. Soybean koji (mame miso) ferments for as long as three years, giving it a robust flavor, firm texture, and very dark color. The most famous mame miso is the dark chocolate-colored Hatcho miso, from Aichi prefecture.3. TasteThen there’s sweet (ama), amakuchi (mild), and karakuchi (salty). Most miso falls between five and twelve percent salt by weight, so even sweet miso is salty to taste. In general, the longer the fermentation, the saltier the miso—and the longer its fridge life. That said, while miso can safely last a long time in the fridge, it will begin to oxidize and change flavor after several months. So use it!Keep in mind that color, koji, and saltiness are not mutually exclusive—a miso may be a red miso and a mame miso, for example. And beyond these categories, you may also encounter miso described by its texture, from ultra smooth to chunky country-style (inaka) miso, and of course by regional names, like Saikyo and Hatcho. In this way, miso is once again a bit like wine—you can think of the same bottle as red, light-bodied, pinot noir, or Burgundy.As you get to know your tastes, play around with personalizing miso blends to tailor the saltiness and flavor to your mood and what you’re making. You may find that you like intense red miso with big-flavored ingredients, while delicate white miso won’t mask nuance. “When I make miso soup, I always blend two kinds of miso—it brings more depth and layers of flavor without adding anything different,” says Moore. “And that way you never get bored!”The most important lesson in cooking with miso—or honestly, cooking at all—is to taste as you cook. Especially if you haven’t used that same miso in the dish before, it’s best to add a little at a time. And the smoothest way to stir thick miso into a liquid is to blend your scoop with a little bit of that liquid first, to reduce the chance of clumps.How to cook with misoHere are some ideas for how to use it:1. In sauces and dressingsMake a sauce for simple steamed, grilled, or roasted ingredients, whether that’s fish, tofu, or vegetables (it’s especially good with charred shisito peppers). Thin the miso with sake, mirin, dashi, or citrus juice (or a combination!) to a desired sauce thickness and add any additional bright or hot notes like chile or citrus zest, then drizzle it on. Vegetables tossed in a sauce like this get even better if they’ve mellowed in the fridge for an hour before serving.Make kurumi-ae (walnuts) or goma-ae (sesame), a nutty dressing for simply steamed greens. Pound and mash nuts or seeds in a mortar and pestle with a generous scoop of miso, mix with a little bit of rice vinegar until creamy, then toss it through or drizzle it on top.Mix it into salad dressing. Miso is great with acids like rice vinegar or citrus juice, but its malty notes can also be great with apple cider vinegar. Depending on the salad you’re going for and the type of miso you’re using, you may find other vinegars work well too. Hatcho miso and balsamic?This asparagus gets marinated in a mix of mirin and miso before being grilled.\nLaura Murray2. In cures and marinadesBefore you broil, pan sear, or grill, use miso to marinate your fish or meat. This is known as misoyaki (grilled with miso) or miso-zuke (cured or marinated with miso). The marinade can be thinned with sake, mirin, or another liquid to the desired consistency and taste. The salt in the miso draws out moisture from the protein, yielding a tender, flavorful bite, and natural sugars in the miso caramelize with high heat.Use it to cure or pickle (miso-zuke). Wrapping ingredients in straight miso—or miso mixed with a bit of mirin or sake to make a miso-doko—draws out water, firming veggies to a pleasing crunch and imparting a layered saltiness that’s impossible to resist. Refreshing raw vegetables and even fruits—think cucumbers, radishes, apples, and pears—really shine as miso-zuke. Delicate foods like whole boiled eggs, green beans, and firm tofu are best left for just a few hours, then removed from their miso blankets, but hardy vegetables like sliced winter squash (blanch first), quartered root vegetables, and whole garlic cloves can pickle for up to several weeks—just start tasting after a week to monitor progress. Peel the vegetables or fruits you want to pickle (it's not required, but it helps the miso to penetrate), then cut into more or less uniform sizes of about 1–2-inch thickness minimum; if you try thinner cuts, know that they will get salty very fast and may lose their toothsome texture. Wrap them in miso, smoothing out any air bubbles, and leave them, covered, in the fridge, until ready. When it’s time, scrape off the miso, which will now be watery, and use it to make a sauce or miso soup later.3. In soups and stewsMake miso soup. Regional and seasonal varieties abound across Japan, so feel free to play with any kind of good miso here and develop your own take. Just remember that you don’t need to simmer and simmer miso—it’s best when added at the last moment, just before serving. “I always tell people to enjoy the smell, it’s like a flower opening in the soup,” says Moore. “[Miso soup] is like a flower blossom. You don’t want to kill that, that’s the golden moment for good miso, and that way, all the good flavors, enzymes, and [probiotic] actives in the miso are not killed by over-cooking.”Build complexity and body into stews, braises, and simmered foods. Miso is excellent in Japanese-style mapo tofu (mabo dofu), Japanese-style curry, donabe dishes, and braised vegetables and meat for a savory, cozy flavor.Use two kinds of miso the next time you make miso soup.\nLaura Murray4. To deliver salt and umamiIn Japanese cuisine, salty things are plain rice’s best friend, and miso is no exception. Take a page from Mika Hatsushima, who owns Brooklyn’s Rice & Miso, the beloved onigiri and lunch spot. Her brown rice onigiri fillings take full advantage of the umami-rich, nutty, salty more-ishness of miso. The signature onigiri uses miso paste mixed with natto, garlic, onions, and scallions, while her miso ground beef filling is simmered with ginger, mirin, and soy sauce. Simmer almost anything with miso, and it will be phenomenal on a bowl of short grain rice.On that note, try mixing it with other nutty grains. Fujimoto swears by a savory miso oatmeal. Or swirl some into savory rice porridge (okayu), risotto, farro salad, or wild rice.Add miso when your dish needs a little something extra but you don’t know what it is. “Wherever you want to add a little more salt, if you replace it with miso, it gives it layers of deeper, richer flavor” says Omiso’s Fujimoto. I grew up in a half-Japanese household, and my Spanish American mom has taken to putting it in tomato soup, which is honestly great.Use it in sweets. Because of its texture and nutty flavors, it’s great to experiment with in recipes that call for nut butters like blondies and cookies. Sub out a portion of the nut butter for miso—just be open to a very salty batch before you get the ratio right. (It’s a good idea to be more cautious at first, then ramp up from there.) It’s also excellent in anything where you’d want a salted caramel flavor—whether that’s cake, ice cream, or panna cotta. Hatsushima speaks very highly of it in Rice Krispies treats.“There are so many benefits in miso, and so much depth to the taste,” Hatsushima says. “Everyone should have it in the fridge.\"Katie Okamoto is a freelance writer based in LA. Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-27", "author": ["Condé Nast", "Katie Okamoto"]}