{"id": "7da8adb452cb6c0d528fb9f6512480d9", "url": "https://www.bonappetit.com/story/analytical-chris-morocco", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Chris Morocco Is the Most Analytical Member of the BA Test Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChris Morocco Is the Most Analytical Member of the BA Test KitchenHe keeps things precise, and it works every time.By Adam RapoportApril 2, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Chris MoroccoFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Of all the editors in the Bon Appétit Test Kitchen, Chris Morocco is the one you could imagine having aced his SATs. He approaches a recipe not so much as a meal in the making but as a vexing problem waiting to be solved.When tasked with giving readers a recipe for a “simple” roast chicken, he wrestled with how to achieve the crispiest skin, the juiciest white meat, done-enough dark meat and, because as if that weren’t enough, he also challenged himself to figure out how to cook the potatoes in the same skillet as the chicken itself—because why would you want all that salty, tasty chicken fat to go to waste?Want this letter before it hits the website? Sign up for our newsletter!Having made his skillet-roasted chicken several times over (and did you know that the original article featuring it got nominated for a National Magazine Award?), I can vouch for the fact that it is mind-bogglingly good while still, somehow, being simple.Sometimes I like to give Chris a hard time for being a bit too analytical, for pacing about the test kitchen like Professor Morocco, apron cinched, Sharpie and digital thermometer at the ready.And sometimes Chris gets back at me, proving that he can do basic too. Like when he realized that while our Lasagna Bolognese recipe is truly epic and delicious, it’s a smidge too epic. So he set out to make a more user-friendly BA’s Best Lasagna—not only creamy, rich and irresistible, but also eminently makable for the average home cook.Same goes for his Basic Bulgogi recipe, his at-home tribute to the Korean BBQ classic. Staying true to the original, he includes shredded pear in the marinade, but he also works to fast-track the entire process, including instructions to sear the the thinly sliced, marinated boneless short rib (or chicken breast, or pork loin) on your stovetop in case you’re not in the mood to fire up your grill.who can resist the spicy katsu sandwich?\nPhoto by Chelsie Craig, Food Styling by Pearl JonesOther Morocco hits (of which there are many) include his Spicy Sweet Sambal Pork Noodles, his Gluten-Free Carrot Cake and, God bless him, his Spicy Chicken Katsu Sandwiches.The only thing Chris does as well as develop recipes is talk about them. He’s a frequent, always-analytical guest on the Bon Appétit Foodcast, and you’ll always spot him in the BA Test Kitchen on our YouTube channel, hosting his own videos or popping into his colleagues’ with a well-timed assessment of their latest recipes.Oh, and in case you were wondering what he did with his spiffy SAT scores, he attended Oberlin College. No word on whether he held down a kitchen shift at the co-op.Get the recipes:Cast-Iron Roast Chicken with Crispy PotatoesLasagna BologneseBA’s Best LasagnaBasic BulgogiSpicy Sweet Sambal Pork NoodlesMolten Caramel CakesSpicy Chicken Katsu SandwichesExplore Bon AppétitAdam NewsletterRead MorecultureBon Appétit Used to Just Be a Magazine. Not Anymore.By Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Adam Rapoport"]}