{"id": "7db026be484b464c3c5bbb628a73a6d6", "url": "https://www.bonappetit.com/recipe/zucchini-lentil-fritters-with-lemony-yogurt", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Zucchini-Lentil Fritters  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesZucchini-Lentil Fritters With Lemony YogurtBy Sohla El-WayllySeptember 11, 20194.6(180)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThese crispy, crackly zucchini fritters take inspiration from the traditional Bengali onion snacks piyaju. Soaked and blended red lentils make up the batter, which is spiked with turmeric and chili powder.Ingredients4 servingsLemony Yogurt¾cup whole-milk yogurt2Tbsp. fresh lemon juice½tsp. sugarKosher saltFritters1cup red lentils (masoor dal)1medium zucchini (about 5 oz.)½medium onion, thinly sliced1¾tsp. kosher salt, divided, plus more½tsp. Kashmiri chile powder or ¼ tsp. cayenne pepper¼tsp. ground turmeric1cup parsley leaves with tender stems1Tbsp. finely grated lemon zest1cup ghee or neutral vegetable oilPreparationLemony YogurtStep 1Whisk yogurt, lemon juice, and sugar in a small bowl to combine. Season with salt and whisk again to combine.Step 2Do Ahead: Yogurt can be made 1 day ahead. Cover and chill.FrittersStep 3Rinse lentils, then soak in 2 cups water at room temperature at least 1 hour and up to 12. Soaking the lentils for this long will make them super-plump and tender, which in turn makes them a lot easier to blend.Step 4Meanwhile, trim ends of zucchini and cut crosswise into 3 pieces about 2\" long. Cut each piece lengthwise into ¼\"-thick planks. Stack a few planks and slice lengthwise into ¼\"-thick matchsticks (about the size of a skinny french fry). Transfer zucchini to a colander set in a medium bowl. Add onion and 1 tsp. salt to colander and toss to combine. Let zucchini and onion sit until about 1 Tbsp. liquid has released and the vegetables look wilted and soft, 30 minutes–2 hours (to maximize your downtime, do this while the lentils are soaking). Gently pat dry with paper towels to remove any excess moisture. The less moisture in the veggies, the less soggy your fritters will be, so be sure not to skip this step.Step 5Drain lentils and transfer to a food processor. Add chile powder, turmeric, and ¾ tsp. salt. Pulse, scraping down sides, until a purée forms. Transfer to a medium bowl and add zucchini and onion mixture, parsley, and lemon zest. Toss well with a rubber spatula to combine (it will look like too much vegetables for the lentils, but that’s just what you want).Step 6Heat ghee in a 10\" cast-iron skillet over medium-high until a small amount of batter added to the fat excitedly sizzles and sputters. Carefully drop ¼ cup batter into ghee, then flatten to a pancake with the back of a large metal spoon dipped into the hot ghee to prevent sticking. Repeat 3 times for a total of 4 fritters. Fry until deep golden brown on one side (look for the color of a well-fried falafel), about 3 minutes. Turn with a slotted spatula or large spoon and continue to fry until deep golden brown on the second side, about 3 minutes more. Transfer fritters to a wire rack set in a paper towel-lined baking sheet to drain. Season immediately with salt. Repeat with remaining batter (you should have 8–10 fritters).Step 7Transfer fritters to a platter. Serve hot with lemony yogurt alongside.How would you rate Zucchini-Lentil Fritters With Lemony Yogurt?Leave a ReviewTell us what you thinkReviews (111)Back to TopTriangleAbsolutely delicious! I think I made my veggies a little too big, so I will fix that problem next time, but otherwise these are incredible. JenOrlando, FL3/25/2022Great recipe but needed more spices... which I added, cumin, fennel, anise, coriander, chili flakes, as well as a jalapeno pepper...  Very good...thanks! Next time will chop a poblamo pepper & add that to the batter...\nJudithlexington MA12/12/2021 Great recipe and just made my “favorites” rotation. Lots of people saying that their fritters didn’t stay together. It’s important to use the red lentils. Also make sure you soak them long enough. I actually over soaked mine and the batter was perfect. I did add a little broth (maybe 1/2 cup) to them to make the batter come together a little creamier. Also, sweating the veggies and toweling them off is important. Anyway, these were absolutely delicious!!! Crispy and tasty! MarissaChicago, IL11/16/2021It was interesting to learn that I could make a batter with just soaked red lentils.  That was a plus. However, I can't join in the rave reviews given the amount of work these took and the outcome. I love Indian food and looked forward to making them. I followed the directions and they came out crispy, didn't fall apart. But they had little flavor, as some others noted. Many here may have doctored the spices as they went along, but I tried to stick to the recipe.  I ate them of course (and no doubt gained a pound); what's not to like about hot, crispy fried onions and zucchini! But I was disappointed given all the over-the-top reviews. Might try something similar with chickpea flour as someone recommended, and increasing spices. AnonymousDetroit, Michigan9/11/2021Meh. Turned out just like the pic. Easy peasy. Maybe try baking next time. MFBDenver, CO9/9/2021I have made pakoras (Indian style fritters) which are very similar to this. Instead of soaking/pureeing lentils you can use chickpea flour (besan). It’s vegan and saves time. You can add almost any type of spices and herbs. If you take single spinach leaves and drench  in the besan batter and fry them — they are fabulous. You can add red chili powder, asofetida, cumin seeds and/or powder, or fennel seeds and finely chopped cilantro. You can use almost any veggie dipped in the batter. Then fry in oil. Karen V California 9/8/2021So so good, even though I made a few major adjustments. My partner cannot have any allium, which in the past has restricted which recipes I use. I decided to go for it here and just leave out the onion and hope for the best. I had honestly expected them to come out pretty bland but with the expectation the lemon yogurt might make up for a bit, but this was not the case at all. I added a bit of smoked paprika and garlic/onion free chili powder along with the cayenne and they turned out so well. I only soaked the lentils for about 2 hours so they did fall apart a little bit, but not touching them as they do the first fry made things a lot better. Pretty easy and super tasty so will definitely be making again. catincbus8/20/2021Honestly these are borderline genius. Like we do not deserve Sohla. Even though it involves blending and frying, I still make it weekly since most of the prep can be done earlier in the day. Giving the lentils at least a couple hours to soak really makes the batter come out… fluffier? Worth it. AnonymousVancouver, BC7/30/2021This recipe is a freaking delight. I have made it 3x and it only makes me happy -- even though it means cleaning my food processor. That's high praise.Kelly481767/16/2021They got very crispy and I loved the big pieces! But they did not taste very much :((AnonymousStockholm, Sweden 5/31/2021Really good, held together well, tasty and crispy. Thank you!PatriciaNew Zealand4/24/2021This was my first time making them. I must say they were a hit. Wish I had doubled the recipe. I find it hard to find foods that I do not react to. Well this is one of them. So happy and so tasty. I really like the lemon aioli type sauce to go with them. I made it mine own by addeding a green chilli or two. Some cumin and didn't have the chilli powder called for in the recipe so I just added some regular chilli powder and some curry leaves. Plus the other spices called for in the recipe. Turned out yummy. I think someone on here said using gee takes to the next level. I will definitely try that next time. I found if you follow her instructions it turns out great. Oil needs to be hot before you add the fitters. Don't turn them for the 3 minutes specified in the recipe and they will turn out fine. I would only change that I would soak my lentils longer next time . Maybe over night. I think that may have been the problem of why one person on here could not get them to stay together. Soaking is key to get them to blend well.Anita RLakeview, Nova Scotia4/18/2021Made this on a snowy day in the mountains... best decision ever! Perfectly filling, perfectly crunchy, and so easy. 10/10 will be recommending this to any and everyone. KarolinaLake Tahoe, CA3/20/2021These were great! I've been waiting for a long time to make them and bought red lentils specifically for this purpose. The lentils make a delicious bready batter for the zucchini and onions and the spices and herbs are perfect. I accidently made the zucchini thicker than matchstick which made scooping them into the pan a little harder, so the fritters were fragile but still manageable. I refrigerated the leftovers, and reheated them in the oven at 425ish and they were still great!AnonymousNew York, NY1/22/2021These are the best fritters I've ever made! Follow the recipe exactly and you will have success. They are the crunchiest, most satisfying and HEALTHY thing you'll ever eat. My husband wants them every night. I had no problem with crumbling. Smoosh the top of the fritter with a fork once it goes in the oil, not too hard, just enough to pull the ingredients together a little. Don't be tempted to mess with them until ready to flip, around the 3-4 minute mark. Honestly, this is the most innovative and exciting and EASY recipe I've tried in a long time and I cook every day. Very satisfying, very delicious and will be on rotation forever! Thanks Sohla! You deserve this job at BA for this gem!!!FritterLovinHouseholdPortland, Oregon12/17/2020Explore Bon AppétitFritterIndianSouth AsianAsianSoutheast AsianZucchiniSquashVegetableRed LentilLentilYogurtOther IngredientsSnackStarterVegetarianNut-FreeGluten-FreeHealthyishDeep-fryRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-11", "author": ["Condé Nast", "Sohla El-Waylly"]}