{"id": "7db53725a9f9bd37d88ce83a58c2e8c1", "url": "https://www.bonappetit.com/story/dear-johns-culver-city", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Steak and Martinis Are Forever. Dear John’s Is Ephemeral. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSteak and Martinis Are Forever. Dear John’s Is Ephemeral.The Culver City restaurant has a two-year lease until the building is bulldozed. But that’s the whole point.By Alex BeggsSeptember 19, 2019FacebookTwitterEmailPhoto by Dylan + JeniFacebookTwitterEmailWhat would you do if you only had two years to live? That was the lease limit the owner of Dear John’s in Culver City gave longtime L.A. chef Hans Röckenwagner and his wife and business partner, Patti, before he planned to demolish the building. Their answer: Let’s drink martinis and eat steak every night!“When we announced the restaurant’s opening, we also announced the closing, and that was intentional,” Patti says. “We felt like we had nothing to lose. But we had everything to lose by not doing it.” And so they revived the place—a famous celebrity haunt in the 1960s nestled beside the studio lots—with fresh velvet curtains and new kitchen equipment. But above all, art. The walls are covered with vintage paintings from the gallerist Robert Berman. A poodle in front of a fountain has as many admirers as the restaurant’s crab Louis. A nude female matador reigns above the fireplace. The paintings warm up the dark 1,500-square-foot cavern, where it might be 5 p.m., 2 a.m., or midnight depending on how many martinis you’ve had. “It’s in a time zone of its own,” Patti says.The paintings warm up the cavernous room.\nPhoto by Dylan + JeniThe menu, a collaboration between Röckenwagner and Josiah Citrin (whose Santa Monica spot Mélisse temporarily closed in March for renovations), is so quintessential American steakhouse it could be a movie prop. The laminated ALL-CAPS list includes: Oysters Rockefeller. Prime New York strip. Creamed spinach. Lobster thermidor. Garlic bread. Frank Sinatra’s spaghetti and clams (it’s rumored the crooner performed at the restaurant back in its heyday). It’s one of very few restaurants in the city that holds the trifecta: a liquor, entertainment, and dancing license. The martini, if you’re wondering, is only spritzed with vermouth.And then they hired Hank, the spotless-tuxedo-wearing head maître d’, who’s fluffed more tableside Caesars than some chefs make in a lifetime. He raises the olive oil and allows it to aerate and emulsify. He cranks the pepper like a trained percussionist. “We didn’t have to teach Hank how to make a Caesar,” says Patti, “he embodies it.”When the lease expires in April 2021, Dear John’s will be bulldozed for a big new development. Don’t act surprised. Dear John’s is the spritz of vermouth in the background of your martini. Ephemeral.“This is the new business model—people don’t want anything for 100 years,” says Patti. “It’s a two-year pop-up party. There’s an immediacy, and that’s the allure of the place.” Liquor licenses might be forever, but restaurants come and go. Order the steak, get the side of garlic bread, and get swept up in it while you can.Explore Bon AppétitRestaurants + TravelCaliforniaHot 10 2019Los AngelesRead MorecookingAin't No Party Like a Shrimp Cocktail PartyBy Alison RomanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-19", "author": ["Condé Nast", "Alex Beggs"]}