{"id": "7db61e59e2ff5493475e54752e969938", "url": "https://www.bonappetit.com/recipe/pavochon", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Pavochon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssuePavochonBy illyanna MaisonetOctober 20, 20204.9(28)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrint“Pavochon, both the word and the dish, is one of Puerto Rico’s many Spanglish creations,” says writer illyanna Maisonet. “A mash-up of pavo for turkey and chon for lechón, it’s become the centerpiece of a Puerto Rican Thanksgiving. Come November, supermarket shelves across Puerto Rico hold all the classic components: cranberry sauce, stuffing, dinner rolls. The diaspora became accustomed to these items Stateside and brought them back to the island—which could be how pavochon was born.” Serve it with Maisonet’s Cornbread and Salami Dressing. Note: Achiote paste is essential for getting a deep burnished color and extra rich flavor all over the turkey.Ingredients8 - 10 Servings112–14-lb. whole turkey, neck and giblets removed, patted dry1lemon, halvedKosher salt, freshly ground pepper3Tbsp. unsalted butter, room temperature¼cup extra-virgin olive oil3Tbsp. achiote (annatto) paste2Tbsp. dried oregano2Tbsp. granulated garlic2tsp. ground cumin1large onion, halved5garlic cloves2celery stalksPreparationStep 1Using your fingers, gently separate skin from breast meat starting at neck. Rub outside of turkey all over with cut sides of lemon; set lemon aside. Season inside and out all over with salt and pepper (be generous with the salt). Rub butter over breast meat underneath skin.Step 2Mash oil, achiote paste, oregano, granulated garlic, and cumin in a small bowl to a smooth paste. Rub an even layer all over outside of turkey. Tie legs together with kitchen twine. Let sit at room temperature 2 hours, or set on a wire rack set inside a rimmed baking sheet and chill, uncovered, up to 2 days.Step 3If chilled, let turkey sit at room temperature 1 hour before roasting.Step 4Place a rack in bottom third of oven; preheat to 450°. Place onion, garlic, celery, and reserved lemon inside turkey cavity. Place turkey in a large roasting pan on top of a flat or V-shaped wire rack. Pour 1½ cups water into pan. Roast turkey, rotating once if it is browning unevenly, until skin is browned all over and beginning to crisp, 25–30 minutes. Reduce oven temperature to 350° and continue to roast turkey, basting with pan juices every 30 minutes, adding more water by ½-cupfuls if completely evaporated, and rotating pan if browning unevenly, until an instant-read thermometer inserted into the thickest part of breasts registers 150°–155° and thickest part of thighs registers 165°–170°, about 1½ hours longer. Transfer turkey to a cutting board; let rest 30–60 minutes before carving. (If making gravy, deglaze pan and use drippings.)How would you rate Pavochon?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleHard to believe that two professional chefs didn't know to remove pinfeathers BEFORE cooking.\n🙄TWAV8Rcoastal Alabama11/21/2021This was awesome! I halved the recipe and made it with a 5.5 lb. chicken.  Next time, I'll make the Turkey with some smoke chips on my Weber charcoal grille.  I found that I needed more oil in the rub.  It was very clumpy and hard to put on the bird in an even layer.  RonPReston, VA3/15/2021I made this turkey for Thanksgiving and it was sooo good!! Easy too! I love eating the leftovers cold from the fridge with my bare hands like a lunatic, it's that good. Just get the softest achiote paste you can find, mine was kinda hard so I had some big pieces of achiote on my turkey, or make the paste in a food processor so that it's homogeneous. Great recipe 10/10Laura ETijuana, México12/5/2020Explore Bon AppétitPuerto RicanCaribbeanTurkeyPoultryMainNut-FreeGluten-FreeKetoRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Illyanna Maisonet"]}