{"id": "7dd0bfefd132c057c8ac56dbc619fe85", "url": "https://www.bonappetit.com/recipe/chambery-cassis", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Chambéry Cassis Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueChambéry CassisBy Rebekah PepplerMarch 15, 20225.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joann Pai, Food and Prop styilng by Rebekah PepplerEmailPinterestPrintEmailPinterestPrintThe winey depth of crème de cassis (black currant liqueur) hums softly in the background of this sparkly crimson aperitif from Rebekah Peppler’s cookbook À Table. Be sure to seek out dry white vermouth, such as Dolin Dry Vermouth de Chambéry, which is pale and aromatic, rather than sweeter blanc, or bianco, vermouth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBar Spoon$10 At AmazonCitrus Juicer$7 At AmazonVegetable Peeler$10 At AmazonIngredientsMakes 13oz. dry vermouth½oz. crème de cassis or Chambord½oz. fresh lemon juiceChilled club soda (for serving)Red currants or orange twist (for serving; optional)PreparationStep 1Pour vermouth, crème de cassis, and lemon juice into a Collins glass filled with ice. Stir gently with a bar spoon or other long-handled spoon to combine.Step 2Top off glass with club soda and garnish with currants or an orange twist if desired.Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Chambéry Cassis?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious and so simple! Think this would be a great holiday aperitif - festive enough for guests, and with just enough alcohol to keep the cook in good spirits without being nap-inducing. I didn’t have Creme de Cassis, so used Chambord instead, and thought the dry vermouth and lemon juice balanced the sweetness perfectly.   Nice drink!SpatulaCity123Los Angeles3/25/2022Explore Bon AppétitDrinksCocktailDrinks AllCrème De CassisAlcohol & Other DrinksVermouthRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}