{"id": "7dd41e2d706d7c310e9a700325883791", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/ancestrale", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Ancestrale Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenAncestraleIn Vesterbro, a cool little wine bar (and a relief to your wallet)FacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for affordable bites and natural wine from a trio of young industry vets (108 and Studio) in a tiny space in a trendy neighborhood.ORDER THE: bread and cheese; potatoes with smoked hay powder; and bottles from from underground wine heroes like Gut Oggau, Frank Cornelissen, and Matassa. (There’s no wine list; choose a bottle from the back room or ask them for a glass of whatever’s open.) Each dish is ranges from $11 to $20—or order all from the very abbreviated weekly changing menu for $55—and there’s a daily happy hour, which offers a flight of three glasses for $16. After just a day in Copenhagen, this will feel miraculous.THE VIBE IS: candlelit Danish living room.PRACTICAL STUFF: Open Monday to Thursday, from 4 p.m. to 11 p.m., and Friday and Saturday, from 4 p.m. to midnight. Closed Sunday.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEDen VandretteGet your L’Anglore fix at this sunny Indre By wine barVinskabetIndulge your inner wine geek at this breezy Nørrebro bar.Ved Stranden 10Get lost in natural wines at this living room-esque Indre By barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}