{"id": "7de2ae3ec091e8a3193032d184efdfe9", "url": "https://www.bonappetit.com/story/chile-chicken-nachos", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "These Chile-Chicken Nachos Take Every Component Seriously | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Chile-Chicken Nachos Take Every Component SeriouslyThe chile-chicken nachos you’ll need at your Super Bowl party this year.By Alex BeggsJanuary 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailThere are impulse nachos—do I have chips? Do I have cheese?—and then there are Super Bowl nachos. Beautiful, loaded-up, fancy nachos with elaborate toppings, thoughtful construction, nay, architecture, and fresh cilantro sprigs dispersed just so. Just so... you can dive bomb into it with your greedy fingers.When nacho expert Rick Martinez was assigned to develop a recipe that excels in every category (the stakes were high—it’s nachos), he delivered. And yes, he was wearing his signature Lucha Libre apron while doing so.The Chile-Chicken ToppingThe nachos hinge on this chile-chicken recipe that you can steal and use for tacos, burritos, rice bowls, salads, whatever. A maxed-out chile sauce (ancho and chipotle in adobo) that the shredded rotisserie chicken soaks up, transforming into something that Kroger rotisserie oven never saw comin’. Hot, sweet, and smoky chicken that stays juicy thanks to chicken stock, especially since it’s going into the oven next. It takes 30 minutes to make the chile chicken, which you can do ahead, FYI.The chicken, ready for nachos (or whatever!).\nPhoto by Chelsie Craig, Food Styling by Kate BuckensThe Cheesy Corn ToppingThis is the sneaky best part. A corn salad with salty-crumbly cotija cheese, onion, and a poblano chile (or jalapeño). It brings a pop of sweet and acts as a sort of unexpected salsa that isn’t wet, and therefore won’t sog up your chips. Since it’s not corn season, you have Rick’s permission to use frozen corn, thawed and drained. Thanks, Rick!Photo by Chelsie Craig, Food Styling by Kate BuckensThe Construction ManualThis is a two-layer, two-sheet tray operation, as opposed to one tray of 50 layers. It’s easier to eat than the nacho mountain, and you can delay cooking so the second one goes in after the first tray is inhaled, ensuring “a hot, melty batch” right when you want it, which is the most sensual recipe instruction I’ve ever read. Riiiiick! You can assemble about an hour ahead and wrap the trays in Cling Wrap to really make sure you’ve concentrated all of your creative energy into the nachos before you. Now here’s the order you SHALL NOT STRAY FROM:Sturdy tortilla chipsChile chickenCorn salsaShredded sharp cheddarRepeatAfter baking, fresh toppings like radishes, cilantro, pickled jalapeños, more cotija cheeseThe cheddar (sharp to stand up to the spicy chicken) wilt melt and envelop everything, holding it all together under a cheese roof. It’s also your indicator for when to take the nachos out of the oven, when the cheese is bubbling and beginning to brown.Green pico de gallo!\nLinda XiaoThe Side SalsaKeep the salsa on the side (I repeat: NO SOGGY NACHOS). And sour cream, if you’re my dad and have never missed a sour cream opportunity. We have amazing recipes for smoky cashew salsa, pico de gallo, tomatillo-avocado salsa. Make ‘em ahead!Then Serve MoveWhen we tasted these in the Bon Appétit Test Kitchen (yeah, somebody’s gotta do it), we served them with tongs because too many people had colds and this was our attempt to not spread germs. It works great, though! So if you’re having a ton of germy people over, use this technique and give everyone their own little party plate of nachos. Aww!Get the recipe:Chile Chicken NachosGuarantee there’s always a hot, melty batch ready for your guests with this nacho construction strategy.View RecipeExplore Bon AppétitChickenNachosSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Alex Beggs"]}