{"id": "7de895421071a0ac4953a08e6f0f4b33", "url": "https://www.bonappetit.com/recipe/miso-pork-ribs-with-chile-honey-glaze", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Pork Ribs With Chile-Honey Glaze Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueMiso Pork Ribs With Chile-Honey GlazeBy The Wolf's Tailor, Denver, COSeptember 17, 20194.8(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThe Wolf’s Tailor in Denver, No. 10 on our 2019 Hot Ten list, is making us take back everything bad we ever said about fusion. There, it’s a thing of obsessive beauty. The glaze for these ribs combines Korean gochujang and Italian Calabrian chiles—a perfect example of chef Kelly Whitaker’s fearless blending of cuisines. Serve with a side of Sake-Braised Mustard Greens With Sesame and Rice Porridge With Dashi.Ingredients8 servings4racks St. Louis–style pork spareribs (8–10 lb. total)2dried shiitake mushrooms, finely ground in a spice mill, or 2 Tbsp. shiitake mushroom powder½cup red miso¼cup sunflower oil or other neutral oil2Tbsp. coarsely chopped oil-packed Calabrian chiles or 2 tsp. crushed red pepper flakes½medium onion, finely chopped½tsp. kosher salt3garlic cloves, finely chopped12\" piece ginger, peeled, finely grated⅓cup gochujang (Korean hot pepper paste)¼cup tamari or low-sodium soy sauce¼cup unseasoned rice vinegar⅓cup honeyNonstick vegetable oil spray or vegetable oil (for foil)6scallions, thinly slicedFried shallots (optional; for topping)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 300°. Pat ribs dry with paper towels. Sprinkle evenly on all sides with mushroom powder, patting to adhere, then rub miso all over to lightly and evenly coat. Wrap each rack in a double layer of foil, crimping edges to seal. Divide foil packets between 2 rimmed baking sheets (2 packets per sheet) and bake until meat is fork-tender at the thickest part but not falling off the bones, 2–2½ hours. Let cool slightly, then unwrap.Step 2While the ribs are baking, heat oil and chiles in a medium saucepan over medium-low, stirring often, until chiles darken in color a few shades and are fragrant, about 3 minutes. Add onion and salt and continue to cook, stirring occasionally, until onion is softened and translucent, about 5 minutes. Add garlic and ginger and cook, stirring, until fragrant, about 1 minute. Add gochujang, tamari, and vinegar and cook until thickened slightly, about 5 minutes. Remove pan from heat and stir in honey.Step 3Transfer mixture to a blender and purée until smooth and slightly glossy. Pour glaze into a small bowl or airtight container and let cool.Step 4Heat broiler. Line a clean rimmed baking sheet with foil and lightly coat with nonstick spray. Cut each rack in half (this will allow you to puzzle all the ribs onto the sheet) and arrange, meaty side up, in a single layer on prepared baking sheet; brush with glaze. Broil ribs until glaze is set and slightly darkened in color (watch them closely so that the glaze doesn’t burn), about 4 minutes.Step 5Transfer ribs to a platter and top with scallions and fried shallots (if using).Step 6Do Ahead: Sauce can be made 5 days ahead; cover and chill. Ribs can be baked 2 days ahead; let cool, then wrap tightly in plastic and place in an airtight container. Cover and chill.How would you rate Miso Pork Ribs With Chile-Honey Glaze?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThese are incredibly tasty, the right level of sweet, savory, and spicy. It is the perfect level of spice, not too much and not too little.  I subbed the mushroom powder for Trader Joe's Umami seasoning blend and used white miso instead of red. Would make again!ChanelNew York, NY1/26/2021Highly recommend! Super easy prep and a huge crowd pleaser. I didn’t have shiitakes but otherwise followed the recipe and it was still so good. Sweet, a little spicy, sticky, everything you want in ribs. I was running short on time so did 400° for 1h instead of 300° for 2h and they were perfect. RachelToronto, ON1/2/2021I was disappointed, maybe because I lead myself to believe that they would be out of this world  based upon the other reviews.  They were good, mind you, but, in my view, not worth all of the effort.   The sauce lacked depth.  I cannot put my finger on what else it needs.BarbaraSan Francisco, CA11/19/2020Just Wow. These were hands down the best piece of meat I've ever made in my life. I don't even like pork ribs, and these were amazing. Packed with flavor, the glaze finishes the ribs off perfectly. You would be remiss not to try these. AnonymousAustin, Texas9/24/2020Flavor bomb! This was crazy good. Perfect Sunday night dinner. We had white miso on hand and that worked fine. Added a little beer to the foil packet. Not sure if that actually does anything. Probably would cook lower and slower next time for a more tender meat. Served with white rice, sautéed shishito peppers with sesame oil, salt, and lemon squeezed on top. Also served with a 50/50 soy sauce-vinegar dipping sauce. Monica Pavs9/30/2019Explore Bon AppétitRibsAsianPork RibPorkMeatMisoCondiments, Sauces & PastesMainDairy-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "The Wolf'S Tailor", "Denver"]}