{"id": "7dfd33c2f97c7da91b176cdcfb8403a0", "url": "https://www.bonappetit.com/story/gaggia-classic-pro-espresso-machine-review", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "Bon Appétit Reviews the Gaggia Classic Pro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingDoes the Gaggia Classic Pro Espresso Machine Live Up to the Hype?One BA staffer drank an unholy amount of coffee to find out.By Jenna Adrian-DiazFebruary 22, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I came across the Gaggia Classic Pro espresso machine in the most dire of circumstances. It was my first day on the job here at BA, and my trusty drip coffeemaker simply stopped working just when I needed it most. I took it as a sign that it was, finally, time to seriously consider a home espresso machine.As a former barista I drink espresso daily and know what I like. Most days it’s an Americano (a double shot of espresso topped with hot water and a generous splash of cream) made at home. Occasionally I’ll opt for a cappuccino—espresso with whole milk frothed to the approximate texture of the heady foam atop a great pour of Guinness draught. I know the telltale signs that beans have been over-extracted (bitter and burnt espresso) and I notice when a cappuccino has been frothed so aggressively that the milk has practically evaporated.All this is to say that the semiautomatic Gaggia is a great espresso machine for someone like me who knows how they want their coffee to taste and isn’t afraid of a little espresso geekery. I appreciate the control I have over everything from the density and weight of the coffee grounds to the pressure used to froth milk. I didn’t want a machine with a touch screen or any “smart” features; I wanted to pull shots and steam milk by feel, learning the timing, texture, and temperature that was right for me. (Plus, in my experience with touch screen espresso machines in office kitchenettes and cafeterias, software or firmware issues can prevent you from actually using the machine, even if there’s nothing wrong with its mechanics. It’s frustrating enough to have to troubleshoot my laptop and its applications to do my job; I have no interest in having to contact IT about my morning coffee.)Machines intended for the home coffee enthusiast can cost as much as $10K (and by all means, if you can afford a La Marzocco, get a La Marzocco), but the Gaggia Classic Pro had the mix of specs and features I wanted for a price that was comparatively more reasonable. At $449, it’s still pricey, but after over a year of continuous use, it has proven to be reliable for morning Americanos, after-dinner affogato, and, with a little practice, a deliciously sippable espresso shot with picture-perfect crema.Gaggia Classic Pro Espresso Machine$449 at AmazonScore: 9/10Pros:A commercial-spec portafilter, filter basket, and steam wand keep the taste and texture of drinks consistent with what I’d order at my favorite coffee shop.Since it’s a semiautomatic espresso machine, I get to control everything from the size and weight of my coffee beans to the length of my shot pulls, but I don’t have to spend lots of time tinkering and calibrating the boiler and water pressure.This baby is analog: three simple rocker switches toggle on-off functionality for everything from the power to the steam wand, and there’s no touch screen or “smart” features that require a computer engineering degree to troubleshoot.Cons:The single-boiler design means that steaming milk can't be done concurrently to pulling a shot, and if—due to user error—a shot is pulled while the boiler is cycling off, the espresso could be slightly under extracted and lukewarm.The plastic accessories, like a tamper and coffee scoop that come with the machine, feel cheap and aren’t terribly useful.But first, here’s what you need to know about home espresso machines:There’s an entire internet subculture (and, obviously, an entire profession) dedicated to the “essentials” of brewing espresso, but even if you don’t want to fall down that rabbit hole it’s important to understand the very basics of the process if you’re shopping for a home espresso machine. Great espresso starts with fresh, whole coffee beans that have been roasted within the month—or preferably, the week—they’re being used. Weighing out whole beans to the industry standard of 18–20 grams for a double shot is key to getting a good extraction. Next, grind your weighed beans in a burr grinder preset to the fine, powdery consistency needed for a potent extraction of coffee. A more coarse-grind setting like you’d use for a drip machine will cause your espresso machine to spew grounds-filled, 200-degree water at you, so do not try it. Transfer your ground beans to the portafilter basket (a portafilter is the handled apparatus that holds the coffee grounds up to the machine’s group head, where pressurized hot water is applied to the grounds themselves). Throw your weight behind tamping them into a level, compact little puck, secure the portafilter in the machine, and you’re all set to get brewing. Still confused? Rest assured that, like any appliance, the Gaggia comes with a detailed manual full of step-by-step instructions on how to use it—and, unlike baristas in training, you won’t have to worry about being pop-quizzed on the process or the parts.The boiler of an espresso machine is responsible for heating the machine to the ideal temperature range for extracting espresso and steaming milk. These two temperature ranges are not the same, so higher-end machines often come with two boilers that allow you to pull a shot and immediately steam milk for a latte or cappuccino. As you might expect, those machines also come with a higher price tag. The single boiler design of the Gaggia keeps the cost lower than a double-boiler home espresso machine, but it can take a minute or two after frothing milk to lower the temperature enough to make another espresso drink. As someone who only occasionally indulges in a cappuccino or cortado, this barely impacts me, but it could be annoying for a household with two latte drinkers.The basics of the Gaggia Classic Pro:As far as actually good home espresso machines go, the Gaggia Classic Pro is fairly compact. It weighs a perfectly manageable 20 lb., which means moving it off of the counter for kitchen deep cleans is easy enough, whether or not I’ve been hitting Pilates on the reg (shoutout to Amanda’s arms sequence at New York Pilates; she does not mess around). And at about 14 inches tall by 8 inches wide and 9.5 inches deep, it preserves the already-limited counter space in my little galley kitchen. Those dimensions house the 72 ounce water reservoir and a little drip tray.The Gaggia’s portafilter has the reassuring size, measurements, and heft of the ones I used in my barista days—a big draw for me. Other consumer machines can, and do, make proprietary portafilters and filter baskets for use with their specific machines. This makes shopping for parts like additional filter baskets annoying and needlessly complicated. Whereas the Gaggia’s industry-standard portafilter comes with two different filter baskets: one is a standard basket with the capacity to hold about 18 grams of coffee beans ground to a fine, almost powdery density. I’ve never used the other, a pressurized basket intended for use with packaged Easy Serving Espresso (ESE) pods or the type of breadcrumb-textured, pre-ground coffee you’d use in your drip machine. Neither is for me—I generally find that pod coffee tastes stale, and I have a burr grinder with an espresso-fine grind preset that allows me to use the standard filter basket with the coffee of my choice—but if you like the convenience of ESE pods, they’ll work with the Gaggia.A coffee scoop, for use with the pressurized basket, comes in the box, as does a plastic tamper for use with the standard basket. I lost both shortly after unboxing the Gaggia—not a big deal because I never used that plastic tamper to begin with. It’s almost impossible to use it to apply the recommended 30 lbs or so of force needed to properly pack a firm puck of espresso grounds. I was thrilled to receive a hefty stainless steel one as a gift from my family and haven’t looked back.How do I make espresso with the Gaggia Classic Pro? Is it easy to use?My machine was more or less ready to use right out of the box. After giving the reservoir a wash and flushing the machine with water to clear any tasting notes evocative of the manufacturing process, I was ready to get brewing.There are three clearly marked rocker switches on the front of the machine, each with an indicator light below. The first switch toggles power to the entire machine. The second switch controls the water flow through the group head (for pulling a shot, flushing grounds from the group head, or purging the boiler). Once the boiler has heated to espresso-pulling temps, the indicator light below the second switch lights up and you’re ready to go. The boiler alternates between on and off cycles to keep a consistent temperature, so when it’s in an off cycle the indicator light will turn off too. If you’re not careful and pull a shot during one of these off cycles, the espresso can taste a little under-extracted (read: ever so slightly sour) and the temperature won’t be piping hot. The simple solution here is to simply not pull a shot while the second indicator light is off, but that’s too much to ask of myself in the morning. I do it all the time.The third switch gets the boiler up to temp for the steam wand for heating and frothing milk. Once the indicator light below that switch is on, you’re good to start powering up the pressure to the wand using the rotary dial on the top right side of the machine.In order to steam and heat milk to the recommended 140°–150° temperature range, the machine’s boiler needs to get much hotter than it does to heat water to that ideal 195°–208° range for pulling a shot of espresso. To make—but not scald—an espresso immediately after using the steam wand requires purging the boiler. That sounds complicated, but really it's as simple as placing a cup directly under the group head (sans portafilter), turning on the middle rocker switch as if you’re pulling a shot, then letting it fill up with the hot water. Once the cup is full, turn off that middle switch, pour out the water, and wait for the second indicator light to turn back on. As a bonus you’ll have a nice heated cup for that next espresso drink.I’ve never heard of Gaggia—is it a good brand?One supercool thing about Gaggia is that in 1936 the Italian espresso machine manufacturer developed the modern process of using water pressure, not steam, to extract espresso shots and patented it in 1938. In 1952 they launched their first home espresso machine, and the rest is history. In fact, if you don’t blink at all during the House of Gucci scene in which Patrizia Reggiani (played by Lady Gaga) discovers Pina the psychic on TV, you’ll see a Gaggia espresso machine parked on the kitchen counter of the apartment she shares with Maurizio (Adam Driver). Pop culture digressions aside, Gaggia has been doing this for a Very Long Time.Is the Gaggia Classic Pro worth it?Whether the Gaggia makes sense for you will, as always, depend on exactly what you’re looking for. Objectively, it’s a great machine that packs high-quality parts into a very compact package. I see a semautomatic espresso machine like the Gaggia Classic Pro as being ideal for the kind of person (me) who knows enough to be disappointed when their coffee shop drinks are under- or over-extracted.That kind of person will appreciate being able to dial in every element of their coffee drinks. There are better picks out there for the person who likes coffee that comes from pods (I may be…particular about making my own coffee at home, but when traveling, even I love a hotel room Nespresso machine; they’re quick, dependable, and don’t require any cleanup), or the person who wants to multitask while their coffee is being made. I also wouldn’t recommend the Gaggia for a large family of espresso fiends. An intergenerational household of four to six coffee drinkers, for example, will quickly run through the Gaggia’s 72-ounce water reservoir if they’re pulling shots and using the steam wand. They can also expect to wait around a bit for the single boiler to alternate heating and cooling for so many different drinks. But in my household of two, we both look forward to the five-minute process of making our own espresso drinks before getting on with our days, and the Gaggia is perfect.More highly-caffeinated content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThis Reusable Coffee Filter Means I Never Worry About Running OutThe Coffee to Water Ratio That Makes a Perfect BrewThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeThese Are the Best Drip Coffee Makers, According to a Highly Caffeinated BA StafferExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-22", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}