{"id": "7e01a45e2cabdfeb0a4fbf48dafe684a", "url": "https://www.bonappetit.com/story/sweets-for-diwali", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "It’s Sugar Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Sugar WeekFor Diwali at home, I’m going all in on sweets.By Sonia ChopraNovember 11, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.It’s Diwali this week, a holiday we honor in my family with lots of parties and lots of sugar. Diwali is a celebration of good over evil and light over darkness, but the joke is that really it’s a celebration of sweets. It’s rude to show up somewhere without a tray of mithai—the catchall term for a wide roster of sugary confections—and it’s even more rude not to accept one when offered, which creates a vicious cycle of glycemic overload for all involved.This year, without easy access to an Indian grocery store and without parties to host or attend, I’m kind of on my own. I’m thinking I’ll make tiny batches of mithai based on what I have around: apples from the CSA grated and mixed with coconut for apple burfi, condensed milk and milk powder cooked down for pistachio-studded peda, finely chopped dates and walnuts rolled together with ghee for ladoos. Want this letter before it hits the website? Sign up for our newsletter!Photo by Laura Murray, Food Styling by Susan SpungenBut if I get homesick, I’ll probably also try my hand at gajar ka halwa—a spoon-y, almost pudding-like carrot dessert that I love—or this cardamom-pistachio carrot cake inspired by it, both which can be found on Bon Appétit. On Epicurious, we curated 50-ish more recipes, both savory and sweet, including creamy cardamom kheer and sticky-sweet gulab jamun, desserts I’ve never made myself (yet) but that are synonymous with the festivities to me.I’m curious to know what sweets you make to celebrate special occasions. Are there any pastries, cookies, cakes, or other confections you turn to every year? If so, are you making them this year too, or are you changing it up in some way? I’d love to hear your stories. As always, I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-12", "author": ["Condé Nast", "Sonia Chopra"]}