{"id": "7e03f44ee57a645355bd195cee45767c", "url": "https://www.bonappetit.com/recipe/smashed-cucumber-salad-with-italian-dressing", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Smashed Cucumber Salad with Italian Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSmashed Cucumber Salad with Italian DressingBy Chris MoroccoMarch 20, 2018EmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintSmashing the cucumbers lets the crunchy veg soak up all the dressing—in this case, an easy Italian dressing of red wine vinegar, honey, and red onion.Ingredients4 servings 5mini seedless or Persian cucumbers or 1 small English hothouse cucumber (about 12 oz.)Kosher salt6Tbsp. red wine vinegar, divided1½tsp. honey, divided½small red onion, thinly sliced3Tbsp. extra-virgin olive oilFreshly ground black pepperFresh mint leaves (for serving)PreparationStep 1Gently smash cucumbers with a rolling pin or the back of a heavy knife just to break open. Tear into irregular 2\" pieces and place in a medium bowl; season lightly with salt. Let sit at least 5 minutes and up to 1 hour.Step 2Meanwhile, mix 3 Tbsp. vinegar, 1 tsp. honey, a generous pinch of salt, and 3 Tbsp. water in a medium bowl to combine. Add onion and toss to coat. Let sit until softened, at least 5 minutes.Step 3Whisk 3 Tbsp. oil, remaining 3 Tbsp. vinegar, and remaining ½ tsp. honey in a medium bowl to combine; season dressing with salt and pepper.Step 4Drain cucumbers, discarding any liquid they have released. Add to bowl with dressing and toss several times to coat. Drain onions; top cucumbers with pickled onions and mint leaves.Step 5Do Ahead: Onions can be pickled 3 days ahead. Cover and chill.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Smashed Cucumber Salad with Italian Dressing?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCucumberVegetableQuickEasySideDairy-FreeGluten-FreeNut-FreeRawVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}