{"id": "7e06f504105f52dae331adb0d14a5e19", "url": "https://www.bonappetit.com/recipe/garlic-bread-grilled-cheese", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "Garlic Bread Grilled Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGarlic Bread Grilled CheeseBy Meryl RothsteinFebruary 16, 20214.4(97)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintEven though we understand the impulse to want to start eating grilled cheese as soon as possible, don’t rush the cooking process. Moderate heat allows the cheese inside to fully melt without burning the outsides.IngredientsMakes 24Tbsp. unsalted butter, room temperature2Tbsp. finely chopped parsley½garlic clove, finely grated½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltFreshly ground black pepper4thick slices Pullman or other sandwich bread4oz. sharp cheddar coarsely gratedPreparationStep 1Mix butter, parsley, garlic, salt, and several grinds of pepper in a small bowl until well combined. Spread a generous amount of butter on one side of bread slices (about 1 Tbsp. per slice).Step 2Place 2 bread slices, butter side down, in a large nonstick skillet over medium heat. Divide cheese between bread in skillet (it’s okay if some cheese spills over onto skillet; it’s going to become crispy and delicious and that’s why we’re all here, right?) and top with remaining slices of bread, butter side up. Cook, checking after a couple minutes, until bread is golden brown and toasted underneath, about 4 minutes. (Don’t rush! Remember, lower and slower is better.) Carefully turn sandwiches over and cook until second sides are golden brown and cheese is melted, about 4 minutes. Transfer to a cutting board and slice in half.How would you rate Garlic Bread Grilled Cheese?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWell, this is very good. To make it great, the inside faces of the bread should be toasted, as well. I suggest the following changes:\nStep 2: Butter one side of each slice of bread, using a total of half the butter mix. Place the bread, buttered sides down, on the hot pan and move them around, checking underneath to see that they are browning evenly.\nStep 3: While the bread is browning, butter the sides facing up. Once the underneath sides are brown, flip over half of them so the toasted sides are up. Now put the cheese mix on those halves, then top them with the other halves, toasted side down. Now follow the directions in Step 2 above and you will have bread toasted on the insides as well as the outsides which gives you a much crispier version.Big GuyMalvern PA2/4/2022For years,  I have used a purchased garlic herbed butter, softened at room temp to spread evenly and cover the sliced bread edge to edge.   Tillamook Medium Cheddar, slices or grated. My Tip:  Use metal mixing bowl as a \"dome\" to ensure the cheese melts.  Fantastic.AnonymousSoCal3/2/2021why not just use bought garlic breadAnonymoustoronto, ca.3/2/2021butiful mouth watering made it for a family reounien evevery body loved it ❤️👍AnonymousBosten, mass2/22/2021I wish I could give more than five stars. I made this recipe for a quick Sunday lunch and it was a huge hit for the whole family! Even simpler than the recipe appears, and twice as delicious. I made extra garlic butter so I can make more later this week!AnonymousTexas2/21/2021Does grating (as opposed to chopping) the garlic make a difference?David RosenthalOakland, CA2/21/2021I’ve been making this for 55 years. It’s a winnerBruceOhio2/21/2021Explore Bon AppétitSandwichCheddarCheeseGarlicVegetableEasyQuickWeeknight MealsMainNut-FreeVegetarianSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-16", "author": ["Condé Nast", "Meryl Rothstein"]}