{"id": "7e0766ad870514342dc2656220697206", "url": "https://www.bonappetit.com/story/siesta-spring-cocktail", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "The Spring Cocktail You Need to Know: The Siesta  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Siesta Is Your New Signature Spring Cocktail, a Normal Thing to HaveGrapefruit. Lime. Campari. Tequila. There’s no use easing into spring. It’s here now.By Alex DelanyMay 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis cocktail is already lying to you. Your relationship is built on deception. Normally, I’d say run for the hills, but when it comes to the Siesta, you’re better off sticking around. Sure, siesta means an afternoon nap, but the Siesta is quite the opposite. It’s a cocktail here to raise you from the dead of winter, to shout through a bullhorn made from fruit, sunshine, and booze that it is, indeed, time to wake the hell up. There’s no easing into spring. Spring is here NOW.The Siesta is a citrusy, tangy tequila creation that receives little of the love that the world shows for tequila cocktails. It lives in the shadow of heavy hitters like the margarita and the paloma. No one yells loudly in a crowded bar, “You grab the tacos. I’ll grab the Siestas,” to their friend Kiley, who has already had two drinks too many. But they should. Oh, yes. They should.The base of the cocktail is tequila blanco (the clear stuff that tastes like sharp, vegetal agave, not old wooden barrels). I like the tequila blancos from Pueblo Viejo and Cabeza for a Siesta, but Andrew Knowlton also told me that El Tesoro Tequila Blanco is perfect for this cocktail. The high quality of the agave (and the clean, smooth flavor that comes with it) is definitely worth throwing down a couple extra bucks for a bottle.The Siesta’s parade of color and flavor comes from its secondary ingredients: Fresh lime and grapefruit juice, all acid and bright fruit, usher the dregs of winter right out onto the back patio. Simple syrup’s sweetness makes sure that citrus doesn’t get too rowdy, which it has been known to do. And the addition of Campari keeps the whole thing interesting, providing just a hint of herbal bitterness to keep you on your toes.Yeah. Sounds like a real party, right? Glad we’re on the same page. Here’s how I make my Siesta, based on a previously existing Bon Appétit recipe:Photo by Chelsie CraigFill a shaker with large ice cubes. (Any cocktail that contains citrus juice should be shaken, not stirred, so the juice mixes evenly throughout the cocktail.) Add 2 oz. tequila blanco, ¾ oz. simple syrup, ¾ oz. fresh lime juice, ½ oz. Campari, and ½ oz. fresh grapefruit juice to the shaker, cover, and shake for at least 30 seconds, until the shaker is cold as all hell. Remove the top and strain the liquid through a mesh strainer, into a glass. The Siesta is traditionally served in a coupe glass, but guess what? I don’t really like coupe glasses. I like glasses that feel like they’re not going to fall over. So pour it into any kind of cocktail glass you want.Add a grapefruit peel as a garnish. Most siesta recipes will use a lime wedge, but I prefer the extra dose of bitterness and aroma from the grapefruit rind.Spring cocktails don’t need to be delicate or floral. They don’t need to be poetic or precious or covered in cute herbal wreaths. The only thing a spring cocktail needs to do is remind you that there is life to live. And that after you finish your first, you better be in the act of making or ordering a second.Want something frozen? We’ve got that too:Frosé (Frozen Rosé)View RecipeExplore Bon AppétitSummer DrinksAlcoholicTequilaCampariLimeGrapefruitRead MorecookingThe Boulevardier Is Winter's Ultimate CocktailBy Alex DelanycultureIt's the Summer of FroséBy Alex Beggsculture9 Awesome Margarita Recipes to Quench Your Thirst for TequilaGallery9 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Alex Delany"]}