{"id": "7e173e1de315950d609620f24d1b9970", "url": "https://www.bonappetit.com/story/pineapple-tongue-burn-trick", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "A Trick That Keeps Pineapple From Burning Your Tongue  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Trick That Keeps Pineapple From Burning Your Mouth When You Eat a TonSave yourself with this little tip we picked up from the Netflix series Ugly Delicious.By Sarah JampelMarch 7, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou know how to pick a ripe pineapple. Congrats! But the real problem is that once you get your hands on that perfect specimen (and go through the trouble of breaking it down), you’re going to eat a lot more of it than you intended.Which is all fine and dandy until your lips start to tingle and your tongue starts to burn and you think you’ll never taste anything again. Next time, try this method from the Netflix show Ugly Delicious. In episode two (tacos!), René Redzepi of Noma fame is in Mexico preparing for his Tulum pop-up when a local man imparts a bit of cooking wisdom:  Soak the peeled pineapple in salt water to reduce some of the future irritation.His hand gesture means: Put that pineapple in some salt water.\nPhoto from Ugly DeliciousWhat’s the deal? Pineapple contains bromelain, a mixture of two protein-digesting enzymes (called proteases), a corrosive chemical that breaks down amino acids (that’s why pineapple is an effective and delicious meat tenderizer).When you eat pineapple, bromelain does this same protein degradation on your mouth. But don’t freak out just yet: Your body begins to regenerate any damaged cells, preventing any permanent loss. Because the bromelain dissolves the protective mucous that coats your tongue and the roof of your mouth, the acidity of the pineapple is particularly irritating. It’s the one-two punch of bromelain and acid that really drives the stinging sensation home.Does salt water render the bromelain ineffective? The trick seen in Ugly Delicious falls more into the category of passed-down wives’ tale than scientifically-proven method, but you can find testimonies on Reddit, on cooking forums, and in other nooks and crannies of the web, too.If your tongue is still a burning fire, there’s hope yet: Cooking the pineapple (grill it, roast it, or even blanch it) can remove most of the enzymes. Or pair the fruit with a creamy dairy product (yogurt, ice cream, crème fraîche). Not only will this taste very good, but it will also give the bromelain another protein to digest and help neutralize the pH.So go forth and eat as much pineapple as your little heart desires, fearlessly.Pineapple, we’re not scared of you!Coconut Chia-Tapioca PuddingIf you love the texture of chia pudding, it gets even closer to bubble tea with the addition of tapioca pearls here.View RecipeExplore Bon AppétitTropical FruitPineappleFruitVideoVideosRead MorerestaurantsUse Your Grill for Smoky Pineapple, Never Look BackBy Amiel StanekEverything's Right with this Upside-Down Pineapple CakeBy Rochelle BilowPhotography by Jonathan LovekinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Sarah Jampel"]}