{"id": "7e3345fe9fad3a161ac8aa11fa214831", "url": "https://www.bonappetit.com/story/how-to-make-stir-fry-basically", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "How to Make Stir-Fry Like Your Life Depends on It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Stir-Fry Like Your Life Depends on ItA foolproof formula for stir-frying your favorite (edible) stuff.By Alex DelanyMay 29, 2018FacebookTwitterEmailPhoto by Alex Lau, styling by Sean DooleyFacebookTwitterEmailStir-fry is the answer to the world's most important question: What the hell do I make for dinner on a Tuesday night? Knowing how to make stir-fry at home will save you when you're tired and can't think of spending any more than the absolute minimum amount of energy on dinner. It's quick, easy and highly customizable, which is why you should know the formula for making a perfect one every time.So here's how we do it. Get some white rice cooking—or cheat and pick some up from the takeout place around the corner—because this thing comes together way faster than you think, and you'll want a bed of the fluffy stuff to soak up all those delicious stir-fry juices. Let's get it.Slice Your ProteinSmall pieces of meat are key when it comes to a stir-fry. The thinner the meat, the more quickly it will cook, and as we know, a stir-fry is all about speed. Cut your protein—think sirloin steak, pork shoulder, or chicken thighs—against the grain as thinly as possible. Seafood is a strong move too—quick-cooking things like shrimp and scallops are delicious here, but can be left whole because they're so delicate.Coat the Slices in the Good StuffOnce you have those nice thin pieces of steak or pork or chicken, you want to hit them with the stir-fry trifecta: soy sauce, cornstarch, and neutral oil. The soy seasons the meat. The cornstarch—which may seem like a weird addition, but is completely crucial—encourages the meat to brown more quickly, and will also help to thicken your sauce later on. And the oil keeps everything good and lubricated. Toss your sliced meat so it’s evenly coated, and set it aside.Get Some Veggies in the MixWe could stop at meat. But where’s the fun in that? Let’s add some vegetables for color and health and flavor. We can’t just throw anything in the pan here though. Keeping with the whole quick-quick-quick theme, we want veggies that don't need a lot of pan time to get tender. Asparagus, snap peas, string beans, snow peas, greens, and bok choy are all great contenders. Stay away from denser stuff like carrots sweet potatoes, and cauliflower. Whichever vegetables you choose, cut them into evenly-sized pieces so they all cook at the same rate. This is also the time to add aromatics. Sliced ginger, smashed garlic, and/or big chunks of scallion will add some base flavor to your vegetable sitch.Sauce MovesA good stir-fry sauce will be sweet, acidic, salty, and pack a solid punch of umami. We like a mix of soy sauce, oyster sauce, mirin, and rice vinegar. It spreads the love between the flavors without overwhelming your stir-fry with any single one. Mix this thing up and set it to the side.Cook Your VeggiesNow things are actually going to happen. And they’re going to happen quickly. In a stainless steel skillet, heat some vegetable oil over medium-high heat for a minute or two. Throw the vegetables and aromatics in the skillet and cook them for about three minutes, shaking the pan and stirring often. You want to cook the vegetables just shy of being cooked through and remove them from the skillet.Cook Your MeatMeat time is now. In the same pan, add a little more vegetable oil. Lay the slices of meat down in a single layer, and leave them undisturbed for about three minutes. You want to get as much color on the meat as possible without overcooking it. Once the fat begins to render and the juices pool at the bottom of the pan, give the meat a stir and immediately add the vegetables back into the pan.Add the SauceThat sauce we made is finally getting its time in the spotlight. Pour the sauce into the skillet and stir the meat and vegetables together until everything is coated and the sauce has thickened slightly—two or three minutes, tops.Plate That Stir-FryWe’re in the home stretch. Season the stir-fry lightly with kosher salt (You already have salty soy sauce in there, so just a bit will do), and let it cool slightly. Slice some scallions. Scoop some white rice onto your plate and top it with a hefty portion of the stir-fry. Get some of that sauce at the bottom of the bowl and drizzle it over your rice. Top the whole thing with those scallions and maybe some sesame seeds if you’re feeling frisky. You did it. That is a stir-fry. Be proud of it. Smile at it. Hire a photographer to take photos of it. Hang the photos on your wall. Think fondly of your stir-fry every time you pass them. Never forget this moment.Want the whole recipe? Here ya' go:Steak, Snap Pea, and Asparagus Stir-FryYou can probably make it faster than you can say it.View RecipeExplore Bon AppétitBasicallyChickenVegetableStir-FryShrimpPorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Alex Delany"]}