{"id": "7e34c723e02611a1ef01bc50cbfa208b", "url": "https://www.bonappetit.com/story/animal-fats", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "My Fridge Is Full of Meat Fat, What About Yours? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Fridge Is Full of Fat, What About Yours?Carla Lalli Music on the merits of keeping jars of lamb, beef, duck, chicken, and bacon drippings at her disposal.By Carla Lalli MusicOctober 17, 2019FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Funny thing happened on Sunday. I was making soup—again—and when I reached into the fridge to get my carrots and greens, I realized I had jars of lamb fat, beef fat, and bacon fat at my disposal. There was no duck fat, because I used it up last week, and I was slightly disappointed in myself for not having chicken fat. It’s been a long time since I had to rely solely on olive oil, neutral vegetable oil, and butter to make a meal.As happy as my bountiful fat inventory makes me, I don’t go out of my way to render and stockpile animal fats (not that there’s anything wrong with that). It’s simply a fact that in my regular cooking life, these fats just…happen. The trick is knowing when to hang on to them.Let’s say it’s one of the very frequent nights when I decide to make a big pan of skin-on chicken thighs for dinner. Well, those puppies release a ton of fat as they cook, and when I transfer the thighs out of the skillet, I immediately strain the schmaltz into a clean heat-proof container, let it cool down, and then pop it into the fridge (labeled with masking tape and a Sharpie, of course). Straining the fat before storage is important: you need to filter out any bits of meat or seasonings, which could give the fat an off-flavor. But once refrigerated or frozen, that fat will keep for months and months and months.Want this letter before it hits the website? Sign up for our newsletter!Marcus NilssonThe beef fat I’ve got on hand almost definitely came from a batch of slow-roasted short ribs, which render an incredible amount of drippings during their extended oven time. Because the roasting temperature stays relatively low, the fat never reaches a smoking-hot temperature, which could compromise its flavor. It’s absolutely worth using again.I’m trying to remember the lamb roast that yielded my current jar of fat. It was probably a shoulder like this one, seasoned with garlic, lemon zest, crushed chile flakes, and rosemary, all of which will subtly infuse the drippings with additional depth.Reserved fat is only as good as what you do with it. In addition to using animal fat to replace olive oil in my every-Sunday-sofrito, I love to add a spoonful to a pot of beans and infuse the legumes as they simmer. You can also scoop some into salted boiling water before cooking grains the pasta-cooking method way—instead of just using salted water, you’re adding a little richness from the ground up. You can use a combination of animal fat and olive oil to roast vegetables (especially potatoes!), or you can cook anything the confit way: Place your ingredient of choice (garlic cloves, leeks, lemon slices, chicken thighs, duck legs, cherry tomatoes, salmon fillets, tuna steaks, carrots, etc.) in a skillet or oven-proof dish so that all the pieces fit snugly in a single layer. Add enough fat to cover, then cover the pan and place in a 300° oven until whatever ingredient you used is meltingly tender. Lift it out of the fat and eat right then and there, seasoned with salt and pepper and a dab of mustard or squeeze of lemon, or transfer to a clean container, strain the cooking fat over, and keep in the fridge for, like, ever.The point is: Fat is good. Fat is flavor. And some fat is even free! Use it freely and you’ll be a believer, too.Explore Bon AppétitCarla NewsletterDuck FatRead MorecultureFat Is Good, Headphones Are Bad—And More Essential Cooking Rules From Carla Lalli MusicBy Carla Lalli MusiccookingHam Hocks Are My Secret IngredientBy Carla Lalli MusiccookingIt’s Lamb Chops and Greek Salad for DinnerBy Adam RapoportcookingMy Mood Is Dark, But the Soup Is GoodBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-17", "author": ["Condé Nast", "Carla Lalli Music"]}