{"id": "7e3637afdf2e626e3203b29aecfe53f3", "url": "https://www.bonappetit.com/recipe/flatbread-with-avocado-and-scallion-salsa", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Flatbread With Avocado and Scallion Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueFlatbread With Avocado and Scallion SalsaBy Andy BaraghaniApril 14, 20204.5(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintPillowy flatbread is an optimal canvas for buttery avocados and a spicy salsa, but it can also be a vehicle for all kinds of dips and spreads. This is obviously a riff on avocado toast, but it’s 10x better because homemade flatbread beats toast any day.Ingredients8 servingsDough1½tsp. sugar1¼-oz. envelope active dry yeast (about 2¼ tsp.)2½cups (313 g) all-purpose flour½cup whole-milk plain Greek yogurt2Tbsp. extra-virgin olive oil2tsp. kosher saltSalsa and Assembly2tsp. coriander seeds2tsp. cumin seeds8scallions4Tbsp. plus 1 cup extra-virgin olive oil, divided, plus more for brushing1red or green chile (such as serrano or jalapeño), finely chopped1cup finely chopped parsley1lemon4medium avocados, pits removedSpecial Equipment:A spice millPreparationDoughStep 1Stir sugar into ¾ cup warm water in a large bowl. Sprinkle in yeast and let sit until foamy, about 10 minutes.Step 2Add flour, yogurt, oil, and kosher salt to sugar mixture and mix until a shaggy dough forms (don’t worry about any dry or unincorporated bits). Cover bowl with a damp kitchen towel and let sit in a warm, dry spot until doubled in size, about 1 hour.Salsa and AssemblyStep 3While the dough is rising, toast coriander seeds and cumin seeds in a dry medium skillet over medium heat, shaking often, until fragrant and slightly darkened in color, about 3 minutes. Transfer to a spice mill. Let cool, then coarsely grind. Set spice mixture aside.Step 4Place scallions and 1 Tbsp. oil in skillet, season with kosher salt, and cook, turning occasionally, until softened and deeply charred, about 4 minutes. Transfer to a cutting board; trim roots and discard. Finely chop scallions and place in a medium bowl. Add reserved spice mixture, chile, and parsley. Finely grate half of lemon zest into bowl, then cut lemon in half and squeeze in juice. Add 1 cup oil and stir well to combine. Season with kosher salt and let sit while you make the flatbreads.Step 5Turn out dough onto a lightly dusted surface and divide into 8 equal pieces. Form into balls and, working with 1 ball at a time, roll out into 6\" rounds about ¼\" thick.Step 6Heat 1 Tbsp. oil in a large skillet over medium-high. Working 1 at a time and adding remaining 2 Tbsp. oil as needed, cook flatbread until bubbles appear over the surface, about 1 minute. Flip and cook until cooked through, about 1 minute. Continue to cook, turning often, until browned in spots on both sides, about 1 minute longer. Transfer to a plate and wrap up in a clean kitchen towel to keep warm.Step 7To serve, brush each flatbread with oil. Coarsely smash avocados onto flatbread and spoon salsa over. Sprinkle with sea salt if desired.How would you rate Flatbread With Avocado and Scallion Salsa?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis recipe as a whole is a 3.5-4 out of 5, mostly because while delicious, the scallion salsa is VERY messy if you're not draining 95% of the oil off while scooping it. That being said, I come back to this flatbread recipe just about every other week it is just that good and easy to make.\n\nAlso add a fried egg on top and it's 10/10 brunch. Joe SWisconsin1/30/2022drastically reduced the oil here, but still enjoyed the recipe! the flatbread was, well it's flatbread–so it was delicious, but it was unique to me and i had to stop myself from eating them all. the yogurt i used was surprisingly coconutty(esti non-dairy) which lent an unintended flavor to them, but they were still tasty.wheres_the_vegNJ8/5/2020Made this as an appetizer while we grilled a whole bunch of stuff but these flatbreads turned out to be the hit of the day!! I would argue that the salsa could use way more lemon juice and probably about half the oil (these were a mess to eat, but luckily we were swimming too, so we just ate these and let 'em drip over the grass and then hopped into the pool ha!) The bread itself was absolutely DELIGHTFUL — beyond easy to make, fun to cook, so fluffy and chewy and just ahhhh delicious.Long Beach, CA7/15/20205-STAR FLATBREAD!!! Light & fluffy, and less-fussy than naan (which requires lidding while cooking). My toddler was coming back for pieces while I was batch cooking it! Per the reviews I didn't even try the above salsa situation but will likely make the flatbread again with something similar! Easton, PA7/10/2020Made this a couple of weeks ago - fabulous. I was thrilled to find that the dough came together perfectly for the flatbread, no muss, no fuss and no difficulty stretching it out. I will definitely be making this again. Anonymous6/29/2020Should have read reviews beforehand! Both my flatbread and salsa were too oily, would definitely cut back. Overall the dish was yummy but felt like a little too much time and effort for an ostensibly glorified avocado toast. AnonymousWashington DC6/20/20205 stars for the flatbread! The salsa was OK, but not my favorite. As suggested by others, I used less oil. Also used non-fat Greek yogurt for the bread with no problems!AnonymousChicago6/9/2020Made the flatbread with my sourdough discard and it was fabulous. I mean this in the best way possible that these flatbreads are the closest thing I've had to an HEB flour tortilla since I moved out of Texas. thank you andy!!!!!Anonymouswashington dc6/4/2020Flatbread was SO delicious (5/5)! My partner and I can not stop talking about how good it was and in what other meals we could eat with it. The salsa recipe is also really good, just not my absolute favourite spice profile. That said, it was simple enough and I ended up using leftovers of this salsa on eggs the next morning.maggiemay_canadaToronto6/2/2020Followed the recipe except used nonfat Greek yogurt (since it's what I had in stock) and was pleasantly surprised how easy it was to make the flatbread.  I was able to roll out the bread with a rolling pin no problem.  Just sprinkled some extra flour to prevent the dough from sticking.  The salsa itself was mediocre in my opinion.  I used 3/4 c oil and added lime juice for more acidity.  Overall, it was a great recipe and I've been eating the leftover salsa over hummus.  Delicious!  I'll definitely be making the flatbread again. stephw3Belmont, CA5/29/2020Super simple and delicious recipe to follow. Minimal effort and maximum reward. AnonymousAustralia5/23/2020The flatbread recipe is golden! I plan on using this recipe alone for future middle eastern and Indian inspired dishes. The only thing I did differently was that I used instant yeast instead of active dry, used the same measurements, and stirred the yeast into the sugar water mixture until fully combined. It came together beautifully! The salsa was lacking some flavor. I think the next time I make this, I will sautee some finely chopped garlic in with the spices and maybe add more lemon juice. I did not add salt because the bread had enough flavor that it balanced it out. Overall delicious recipe and will definitely make again!AnonymousNew York, NY5/22/20201) The flatbread in this recipe is INCREDIBLE - seriously I want to eat these for the rest of my life.  The tanginess from the yogurt was so addicting.  The toppings were awesome too.  Andy killing it as usual.\n\n2) THANK YOU THANK YOU THANK YOU for putting the weight in grams for the flour - seriously biggest pet peeve when that isn't in a recipe.  It should be a federal law that all baking/bread/etc recipes should have the weight instead of or with the volume measurements. It made me so happy that you had it! linkin22luke6400Denver, Colorado5/20/2020I particularly loved the flatbread recipe here. Very easy and flavorful, I mixed the dough and cooked it with a baby doing his best to make it a challenge. The results for both flavor and texture were more than I expected given how easy it was. I've made a lot of flatbreads and this one earned its place among my favorites. My partner raved about it too. I've recommended this to friends, and I'm off to make it again right now. AnonymousDenver5/18/2020Ugh, I'm writing this pretty frustrated. I totally butchered this dough recipe. In my opinion guidance on this part was not sufficient. My dough was super sticky and I did not know how / if to knead it or how to work it. Ofcourse my basic experience on making bread like stuff doesn't help but I feel the recipe fell short in this.hutsaniff0netherlands5/18/2020Explore Bon AppétitFlatbreadBreadAvocadoVegetableScallionOnionYeastOther IngredientsMainStarterSideVegetarianHealthyishBakingLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}