{"id": "7e38ea471d8716aeb90eb1711fe0abe7", "url": "https://www.bonappetit.com/story/dating-thirties", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Dating in Your 30s: A Conversation Between Two Writers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleTwo Writers on the Joys of Being Single, But Also Sometimes Dating, in Your 30sGlynmis MacNicol and Zan Romanoff debunk the myth that \"if you want to get married, you have to date like it's your job.\"By Zan RomanoffJune 12, 2019FacebookTwitterEmailIllustrations by Marylou FaureFacebookTwitterEmailThis story is part of the Healthyish Guide to Your 30s, our best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.I rarely proselytize about books; for the most part, I love what I love, and I don’t really care if anyone else is in it with me or not. But ever since I read Glynnis MacNicol’s memoir No One Tells You This last summer, I’ve been pressing my copy into other women’s hands or writing the title down in the Notes apps on their phones, saying, “No, seriously, you have to read it.”No One Tells You This chronicles the year following MacNicol’s 40th birthday, in which she tries to get her increasingly dementia-addled mother into a nursing home, help out her recently separated sister, and also sort out how she feels about having hit that big, round number without having obtained—gasp!—a husband or a child of her own.A decade her junior, I read the book at 31. I was—am—single. I would like to get married eventually, I think, but the older I get, the more I have to wonder: So what if I don’t? I’m not going to just like, perish off the face of the earth, right? Which means that maybe it’s not so crazy for me to turn some of the energy people expect me to spend on hunting for a partner toward making that life something I’m excited to keep living in, whether it ever includes a husband or not.So for Healthyish’s Guide to Your 30s, I wanted to talk to Glynnis about her book and her love life, and to have a conversation about how to approach dating without making it feel like it’s the most important thing a woman can be doing with her time. This is a conversation between two straight, white women, so there’s tons not covered here, but hopefully it will help you sort through how you think about your own love life in your 30s.Zan: What was the most recent date you went on, and how did it come about?Glynnis: When I'm traveling, I get on Tinder or whatever the dating app in Europe is and make dates with people. It’s a fun way to get to know a new city, partly because it's a lot less pressure when you're in another place. My life in New York has such deep grooves to it; if I wanted to change it, it would take so much effort. When you're traveling, you're out of those grooves, so there's much less pressure. It's just more exciting.But my most recent date was in America, in New York. It was a friend of a friend who I'd met at a dinner—it was one of those things where it's like, are we on a date? It was fine. We went on two dates, and it sort of petered out.I think in the last few years what I've realized about dating is that it's easy for me to see a date and understand that if I put some energy into it—tried a little harder, made it a little easier—I could turn some of these second and third dates into that. But I just see the big picture, and how much work that would take, and I don't want to take that energy and put it toward this.Zan: I sometimes have conversations with people where they're like, \"If you want to get married, you have to date like it's your job.\" And like... I have a job! I have a pretty demanding job that I love. Not only that, I have some fairly time-intensive hobbies that I care about, and beyond that, I have kind of a lot of friends, and making those relationships work takes time, too.So I go through these phases where I'm like, I'm gonna go on the apps and I'm gonna go on some dates. And every time, I go on three dates. It's whatever it is, five or six hours, all told. And I think, this is just not how I want to spend my time.So one of the things that I'm working on is recognizing that I've been the arbiter of my own time since I graduated from college, so for like a decade now. I know what I like and don't like! I'm allowed to say, I don't like doing this, and I don't want to!Glynnis: Does anyone like dating? At a certain age, when a lot of your friends have paired off and your social interactions don't bump you up against a variety of other people, you do have to make the decision to date.The thing is that that decision gets put up against all the other decisions you're making about how you want to spend your time. And that's when dating becomes a job, in the sense of: my job is writing. I prioritize my writing because it's what I like to do, it pays my bills, and this is how I prefer to spend my time.If being in a relationship was as important to me as my job, I would carve time out for it the way I carve time out for exercise, the way I carve time out for my friends. That’s a completely valid thing to do if that's your decision. For me it’s like, I don’t love shoes enough to go out shopping for them all the time, but if I see a pair I like somewhere, of course I’ll buy them. That’s how I feel about dating: If it happens, great, and if it doesn’t, that’s fine too.But then also if you are trying to date, you feel ashamed about that, because romance is \"supposed\" to happen magically. The fact that we shame women for thinking about it like that is also unfair.Zan: That’s the thing that makes dating different in your 30s, maybe. You get to this place where maybe you do need to make a decision about if you want to be in a partnership and maybe eventually get pregnant. And it's actually fine either way, but also, you'll get shamed either way. If you're not prioritizing dating then you're a shrew, and if you are then you're desperate.Glynnis: Absolutely.Zan: I think my feelings about marriage have also changed a lot since my friends started actually getting married. At first I found it kind of devastating; I thought, they're leaving me behind, because they have this perfect life now.But even friends who are in great marriages, stuff happens. I'd always paid lip service to the idea of \"oh, marriage is hard!\" but when your friends are actually in the shit, you're like, oh, marriage is hard. And going home alone is not the worst thing that could be happening to me, some nights. Glynnis: I don't idealize it; there's some really hard things to being alone. But there's some really hard things to being in a marriage. And thinking about marriage as a solution to a woman's life leaves no room for all the ways in which your life still needs to be satisfied even if you do get married. Because there's nothing you can do in life that's going to solve everything for you, including children and marriage.Particularly when we're so raised on storytelling, and everything being wrapped up at some point, it's easy to think: when does it get tied up so I can stop thinking about it? The answer is: when you're dead. That's when it's all tied up.Zan: That's what you're looking forward to! It's a really scary, really hard way to think about it, to think: There's not gonna be the moment that fixes, solves or changes everything.Glynnis: I still struggle with this. This idea that there's a solution has been so ingrained in women's heads in every way possible. The solution to your problem is to lose weight; the solution is to look younger. We are really programmed to think we are a problem and that the solution is out there if we can fill in the blank. There are no good stories about women's lives that are ongoing, that aren’t about the moment of walking down the aisle or having a baby coming down the birth canal.Zan: And there’s no good dating advice, really, either, right? If you want to do it, you should do it; if you don't, you don't. There’s nothing that will really make it easier or more fun. But maybe at least once you get to your 30s, you can really start understanding the social pressures that are shaping the way you’re making those decisions. And being able to step back and say: Do I want this? If I do, how do I want it to happen?Glynnis: We're in such a flux right now. Good luck out there, everyone! That's my dating advice. Good luck out there.Zan: I think that's exactly it. It's a mess. It's okay that it's a mess. You're probably not doing anything wrong. Glynnis: Every time I find myself feeling bad about my own life, I think about the centuries and centuries of women who would have committed murder to not have to go out on a date; to be able to have dinner on their own or have a paycheck that they didn't have to share, or have the amount of children they wanted or didn't want. This is becoming my only advice in life right now: Don't make decisions out of fear or shame. That's my dating advice. That's my life advice.Explore Bon AppétitHealthyishGuide to Your 30sessayRead MoreLifestyleSo Your Friends Had a Kid. Here's How to Hang Out With Them Even If They Eat Dinner at 5 p.m.By Meryl Rothstein and Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Zan Romanoff", "Julia Kramer"]}