{"id": "7e6aa55b5a1f3a0667637834bacf72db", "url": "https://www.bonappetit.com/recipe/fruit-tart-with-almond-crust", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Fresh Fruit Tart with Almond Crust Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFresh Fruit Tart with Almond Press-In CrustBy Chris MoroccoJune 8, 20184.4(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Chris Morocco, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThe key to the flavorful crust for this summery fruit tart is letting it bake until it’s really well-browned throughout, which might mean letting it get a bit darker than you’re used to.Ingredients8 servingsCrust1cup all-purpose flour½cup almond flour (we like Bob’s Red Mill Super-Fine Natural Almond Flour since it includes the skins for extra flavor, but you can sub with ½ cup all-purpose flour)3Tbsp. sugar1tsp. kosher salt2large egg yolks½cup (1 stick) cold unsalted butter, cut into piecesCustard and Assembly2cups whole milk1tsp. vanilla paste or 1½ tsp. vanilla extract4large egg yolks⅓cup sugar¼cup cornstarch¼tsp. kosher salt3Tbsp. unsalted butter, cut into pieces1pint fresh blueberries½pint fresh blackberriesPreparationCrustStep 1Preheat oven to 350°. Whisk all-purpose flour, almond flour, sugar, and salt in a medium bowl. Whisk egg yolks and 1 Tbsp. cold water in a small bowl.Step 2Add butter to dry ingredients. Rub butter into dry ingredients with your fingertips to create large, shaggy pieces of dough (the idea is to smash the butter into the flour, creating some pieces that are flat and thin and some that are large and irregular).Step 3Using a fork or your fingertips, toss egg yolk mixture into dough to combine. Knead dough in bowl with your hands until it starts to come together (it will still look a little dry; if it looks too dry and doesn't come together, add 1–2 Tbsp. more water, but only if needed).Step 4Turn dough out onto a work surface and knead 1 or 2 more times. Divide dough in half, stack 1 piece on top of the other, then press down firmly to smash both dough pieces together. Repeat several times until dough is well combined and becomes slightly sticky.Step 5Press dough into bottom and 1\" up sides of a 9\" springform pan or a 9\" tart mold. Prick dough all over with a fork. Freeze until very firm, 20–30 minutes.Step 6Bake crust until deep golden brown all over, 35–40 minutes. Let cool.Step 7Do Ahead: Crust can be baked 2 days ahead. Wrap very tightly with plastic and store at room temperature.Custard and AssemblyStep 8Bring milk and vanilla paste to a simmer in a medium saucepan over medium-high heat. Remove from heat.Step 9Meanwhile, whisk egg yolks, sugar, cornstarch, and salt in a medium bowl (start slowly—it won’t want to combine easily at first). Then vigorously whisk until mixture lightens in color to a very pale yellow and is very thick, about 1 minute (the sugar should be nearly dissolved). Slowly whisk in hot milk mixture. Return custard base to saucepan. Heat over medium and bring to a simmer, whisking constantly, until mixture is bubbling and thick with no cornstarch taste, about 3 minutes. Remove from heat. Add butter a couple of pieces at a time, whisking until fully melted before adding more, until all butter is incorporated. Transfer to a medium bowl and cover with plastic wrap, pressing directly against surface of cream. Let cool.Step 10Vigorously whisk cooled custard until smooth and slightly loosened. Spread inside cooled crust. Top with berries.Step 11Do Ahead: Custard can be made 4 days ahead. Keep chilled.How would you rate Fresh Fruit Tart with Almond Press-In Crust?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleWhile I really liked this recipe, I’d like to add a couple of thoughts.  The tart crust is crumbiernd brown which was probably the sugar and the almond flour, but I really did enjoy the taste.  The recipe is kid friendly with the use of hands so that was a big plus.  I like the custard, but I found three minutes was not nearly enough time to let have the cornstarch thicken the custard.  I kept it on low-medium and I’d say it needed between 7–10.  My pot is good so I avoided any real burning.  Nick ABaltimore, MD9/17/2021This recipe was fine, but not a notable improvement over a classic fruit tart. While my crust turned out fine, and not weak or sandy as others commented, it wasn't especially flavorful. I think a classic shortcrust tart crust and the addition of almond extract, instead of vanilla, to the custard, would be better. The custard came out nicely, but I think it would have been even better with scant 1/4 c. corn starch. Jessica M.Washington, DC7/27/2021I tried this recipe today and I'm not sure if it was the alone flour I used but the crust was extremely dry and very weak. It tasted like sand. The brand I used was blue almond. However, while I was making the crust, everything seemed fine. It was just after I baked it. I'd rate this recipe a 3 star as I personally didn't really like the custard either although the website automatically put my review as a 5 star and won't let me change it. :/AnonymousFresno, CA3/4/2021Love it! I had to add 45 grams of almond flour to get the right consistency, but I guess the AP is a bit different here in Sweden. This is the 4th time that I´ve made this and It's a perfect all year treat. Ale Stockholm, Sweden 2/13/2021I used this crust for another tart and it was absolutely delicious - buttery, crumbly (in the best way) and perfect for a curd topping. Will definitely make again. Madeline J. Oakland, Ca11/28/2020This crust is FABULOUS (whole wheat flour instead of almond)! I was concerned about the ability of the custard to bear the weight of the peach topping I used so followed the advice of 1___3___3 (posted on 7/4/20) and used their recipe for a cheesecake style filling, substituting almond flavoring for the vanilla and omitting the orange zest. The result, topped with peaches macerated in sugar, lemon and peach liqueur was amazing! 60559sumptionSedona10/4/2020This was republished in the Aug 2020 print issue, and I’m glad because I forgot to try it in 2018. Had fun making it today with my 12- and 7-year-old boys, and it turned out delicious and beautiful in a white scalloped tart dish. We made it as written except: (1) we only had blueberries (one pint); and (2) we found we did not need to fuss with the crust as much as the recipe called for. After working in the butter, it only needed a quick knead in the bowl and another quick mix with the egg yolk and it pressed into the pan perfectly (my little boy mostly did it with ease). I’ll definitely use the crust recipe again. A quick note: this is not a heavily-set, springy custard (for the lemon icebox and flan lovers out there), but instead is a smooth pudding-like custard. Lovely.  anderson_aNorth Carolina 8/16/2020This was great and fairly easy to make. I have a gluten free co-worker so I subbed 1:1 GF flour for the AP flour and still had a great flaky crust. I was a bit worried about how quickly the custard thickened. I think it was due to the amount of cornstarch. I was worried that the cornstarch flavor wouldn't be cooked out but it all worked out. Regardless, I think I will stir the custard over low heat next time to be sure. AnonymousSan Francisco, CA8/6/2020I let the fruit macerate while the custard cooled. An excellent showcase for all the late summer fruit. Anonymous8/5/2020This was a hit at our get together!  I used a 9” fluted tart pan with a removable bottom and extended the crust up to the full 2” sides. The ratio of crust to filling was perfect. I agree that the crust tends to get too brown and would cook 25-30 minutes instead of 30-35. I Increased the quantity of fresh berries and gently pressed them into the custard to control them when serving.  This brought the filling/fruit up to the Increased 2” level of the crust.  Yum!DianeimoPortland, Oregon7/26/2020Made this for our household's 4th celebration, arranging the fruit to look like a firework. Delicious! Flavors are great, I think the custard is perfect (good flavor, yet not too thick or rich), and the crust is magnificent. Do wish I'd read comments or had thought to cover the edges with foil - but nonetheless this was amazing. Will make it again in a future where I can share with my friends. :) AnonymousEdmonds, WA 7/5/2020Made this for 4th of July with blueberries and blackberries and they were hit with my family. Had to use only AP flour and a pie pan and worked with no problem! I'm definitely making it again for future parties and potlucks!ivanacheriSan Antonio, TX7/4/2020This recipe has such a perfect balance of conciseness and detail to ensure success when following it. I love you chris morocco!! I've made the crust twice and the custard once. The first time I used the exact quantities for the crust and custard in a 9\" springform and decided that, for this size, both were a little much: the crust (bless this recipe, it IS a great marriage of delicate +stable) was just too thick to structurally complement the Very delicate custard and fruit in each forkfull of tart; and the custard also barely fit into the 1\" tall sides of the crust when spread in.\nCustard in a fresh fruit tart is certainly showy and delicious, but structurally, with the fruit on top, will leave you with a rather messy slice. It's just extremely delicate even when chilled, and adjusting to over-thicken it makes it lose its delicate appeal.\nSo my adaptation on this recipe is as follows: make 3/4 quantity of crust recipe. Freeze as normal but bake only about 20min (a par bake... you'll see). Brush w some leftover egg white, bake 5 more min to set.\nPour orange-honey cheesecake style filling into crust (4oz neufatchel/cream cheese, 1/2C whole milk yogurt, ~1/3C gran. sugar, 2-3T honey, ~1T sour cream+1 shy cup milk [or use half+half], 1/4t salt, 1/2t vanilla paste, zest of one smallish orange). Bake @350F for ~30min until only a little circle of softness remains in the center. Cool 1hr room temp, then chill. Top w blueberries, blackberries, etc (I used wild blackberries and mountain huckleberries I foraged).\nI ditched the custard for the above reasons, although I wanna say chris's custard recipe IS excellent.. \nThis adaptation yields a forkfull with crust that's the perfect thickness, fragrant filling that preserves the creaminess and delicacy of custard while being more structurally adept to its pairing w fresh fruit, and not so overly flavorful to steal the spotlight, and ofc the fruit thats still the star of the show. \nOk this got way off the rails and is now a completely difference recipe but yup that's how I adapted chris's almost perfect fresh fruit tart to perfectly fit my preference. Sorry lol1___3___3Washington7/4/2020made it with mango and strawberries and it was a DELIGHT!!! Flaky crust + fresh fruit+ creamy, smooth custardy goodness = genius. Chris Morocco has done it againkatie_sewVancouver, Canada5/11/2020How should this be stored once completed? I'd assume fridge but just wanted to make sure!morgscooksalotBrunswick,GA4/15/2020Explore Bon AppétitTartDessertAlmond FlourFlourBlackberryBerryFruitBlueberrySummerVegetarianBakingFourth Of JulyMemorial DayLabor DayBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Chris Morocco"]}