{"id": "7e6e2d35e6ce76abea9b7ecfbdcbf3f0", "url": "https://www.bonappetit.com/story/food-editors-love-canned-cherry-tomatoes", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Canned Cherry Tomatoes Exist and Our Food Editors Love Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingCanned Cherry Tomatoes Exist and Our Food Editors Love ThemCherry tomatoes may be the greatest thing we've ever discovered in the canned foods aisle.By Elaheh NozariJanuary 30, 2018FacebookTwitterEmailFacebookTwitterEmailWe used to think there was no replacement for fresh cherry tomatoes, but then we discovered Mutti, a canned variety that puts them in a tomato category of their own. \"Cherry tomatoes are amazing, but you never see them canned,\" says senior food editor Andy Baraghani. So what's the deal with Mutti's canned cherry tomatoes, and how should you be using them?Plenty of recipes are made for canned tomatoes, like these wintery stews. The canning process gives fresh tomatoes a touch of salt and breaks them down so they easily meld into soups, sauces, and casseroles. But cherry tomatoes have two stand-out qualities: They're sweeter than other types of tomatoes, and they're smaller, so there's more skin to add a welcome texture to a dish like this chicken and tomato stew.Mutti, the Parma-based Italian company, also preserves plum and San Marzano tomatoes, but the cherries are a real discovery. They're grown in southern Italy and preserved at the height of tomato season, when the fruit is at its peak sweetness. Don't use them for a caprese salad; do try them out in your next tomato sauce. Other ways to play around with canned cherry tomatoes? Combine them with onion and olives for this easy pantry pasta, or cook them down with chicken broth as the base of this monkfish and cauliflower chowder. Yep, now that we've discovered you can buy amazing cherry tomatoes year-round, our winter cooking is about to get so much better.Buy Mutti Canned Cherry Tomatoes, $22.30 for a set of four 400g cans on AmazonUse those tomatoes stat!Chicken and Tomato Stew with Caramelized LemonCooking lemon slices to almost-burnt adds a layer of complex flavor to this comforting stew.View RecipeExplore Bon AppétitShoppingHealthyishTomatoCherry TomatoBA RecommendsRead MorecookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-19", "author": ["Condé Nast", "Elaheh Nozari"]}