{"id": "7e70a82becfb629b447a6b26a14c046a", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/den-vandrette", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Den Vandrette Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenDen VandretteGet your L’Anglore fix at this sunny Indre By wine barFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for wine and small bites from Sune Rosforth, the man who brought natural wine to Copenhagen (and Noma) decades ago. The spare, friendly space, located on Nyhavn Harbor just across the bridge that leads to Barr is the perfect place for a few snacks and carefully composed plates that lean very Danish (confit herring with rosemary mayo) to pair with the biodynamic wine list.ORDER THE: sourdough with fresh cheese and olive oil (add lumpfish roe in spring); “crisp” with smoked mackerel; and a bottle of anything from hard-to-get producer L’Anglore. Come summer, a grill has been known to appear on the large outdoor terrace across the street for the best kind of barbecues.THE VIBE IS: pleasantly chill, with off-duty chefs and natural-wine tourists geeking out in a brick-and-blond-wood room.PRACTICAL STUFF: Open for dinner Tuesday to Friday, from 4 p.m. to 11 p.m.; Saturday, from 1 p.m. to 11 p.m.; and Sunday, from 1 p.m. to 9 p.m. Closed Monday.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEAncestraleIn Vesterbro, a cool little wine bar (and a relief to your wallet) VinskabetIndulge your inner wine geek at this breezy Nørrebro bar.Ved Stranden 10Get lost in natural wines at this living room-esque Indre By barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}