{"id": "7e7764e0eec93ed44ae123297534c82d", "url": "https://www.bonappetit.com/story/easy-2-ingredient-chocolate-sauce", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "How to Make Chocolate Sauce with 2 Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 2-Ingredient Chocolate Sauce Will Make You Feel Like Willy WonkaDid we mention that it comes together in less than 5 minutes? You're welcome.By Alex DelanyJanuary 25, 2018FacebookTwitterEmailTuukka KoskiFacebookTwitterEmailChocolate sauce seems fancy. And to be clear, it can be, when drizzled over decadent French desserts with 73-step recipes. But that's not why you're here. You want to learn how to make chocolate sauce the Basically way, because you, too, are about that lazy life—but the kind of lazy life that involves pouring chocolate sauce all over ice cream on a Wednesday night. This life is attainable. You can live like this.You can make chocolate sauce in about five minutes. And hold onto your seats, because this is about to get a little wilder. You only need two ingredients to make it. Yeah. Five minutes and two ingredients. Sounds like you should be making chocolate sauce every night, just for the hell of it.Now, this isn’t hot fudge. We’re not cooking sugars or using a candy thermometer. Our quick chocolate sauce is more like ganache, the 50/50 mix of cream and chocolate that firms up at room temperature. To make this more of a sauce, we change the proportions to 1 part chocolate and 2 parts heavy cream, which gives it a rich, luscious, pourable texture. This means that it will never really set. It’s not going to harden perfectly around a pretzel or spread like frosting at room temperature. But you can spoon it over everything from sliced strawberries to store-bought pound cake, and feel like a king doing it.You can use whatever type of chocolate you like for this, just as long as it is less than 68% dark. For a sweeter version, use some good ol’ fashioned milk chocolate, and for something a bit more bitter and complex, go for a darker chocolate.There ya go.\nThe cooking process is simple. Pour the cream and chocolate into a regular, small sauce pan (not one of those fancy double boilers), and melt your chocolate over low heat. Once the chocolate starts to melt, stir it continually to make sure it spreads even throughout the cream. Since you’re using low heat, you won’t burn the chocolate, but you still don’t want to just let it go. The sauce will be loose coming straight from the pot; if you want it to be a little thicker, remove it from the heat for five minutes.This pound cake needs chocolate sauce. Now you know how to make chocolate sauce. The future is yours.\nHirsheimer & HamiltonGood news: You have options for what to do with this sauce. It works perfectly drizzled over a date night chocolate Dutch baby, and it makes an icing-free chocolate cake ten times as decadent. But in the true spirit of weeknight dessert, we love chocolate sauce as an add-on for store-bought goods. Letting this sauce rain down over ice cream, using it as a dip for shortbread cookies, or schmearing it across a slice of pound cake makes you look like you’re a damn professional. Don’t worry. We won’t mention the fact that you aren’t.Once you know how to make chocolate sauce, you're halfway to that Dutch baby...Chocolate Dutch BabyFaster than a soufflé, easier than a molten chocolate cake, and more delicious than both.View RecipeExplore Bon AppétitBasicallyChocolateSauceDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Alex Delany"]}