{"id": "7e7819341deac6a5a97222122495dc31", "url": "https://www.bonappetit.com/story/mother-grains-roxana-jullapat", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "The Most Exciting Cookbook of the Spring Is Roxana Jullapat's 'Mother Grains' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Most Exciting Cookbook of the Spring Is Roxana Jullapat’s Mother GrainsAll-purpose has its purpose, but Jullapat makes baking with ancient grains (spelt, sorghum, and buckwheat flours) more accessible and exciting than ever.By Alex BeggsJanuary 26, 2021FacebookTwitterEmailPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Roxana Jullapat, the co-owner of L.A. bakery Friends & Family, is a complete and utter grain head. We spoke for nearly two hours, and her energy and enthusiasm for really old wheats rubbed off on me like rice flour on a black apron. “Tell me more about barley!!!” “How exactly does buckwheat taste like RAIN?” “Ooh, purple cornmeal!” It went like that.The next thing I knew, I was flying through the aisles of my local bulk foods store, scooping up spelt flour, scouring the shelves for sorghum flour, and deliberating between regular and dark rye flour (go with both, figure it out later). I purchased multiple cornmeals.Ricotta Cornmeal Pound Cake—curd and cream optional.\nPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioSoon, I was cooking my way through her fantastic upcoming cookbook, Mother Grains: Recipes for the Grain Revolution, and preaching to anyone who would listen about the wonders of sorghum flour, or as Jullapat calls the thousand-year-old crop, “the grain of the future.”And that’s the funny thing about ancient grains, defined by their lack of genetic modification through the centuries: They’re old as sin, yet Jullapat’s book makes them feel modern and exciting.Mother Grains focuses on eight whole grains that are grown and sold across the U.S.: barley, buckwheat, corn, oat, rice, rye, sorghum, and wheat. Her recipes cover the grains in all forms: from sorghum syrup to toasted barley tea to a chewy kamut salad. I went straight to baked goods—what we featured in our February issue—familiar favorites given new life with speckled, yes nutty, whole grain flours. That was blueberry muffins then; this is blueberry muffins now: enhanced with nutritious, low-gluten spelt flour, both in the batter and in the crispy streusel topping. “The spelt brings a little bit more texture, but also a little bit more depth, more oomph, more dimension to your baking,” Jullapat says. I made them twice.Barley flour is the secret to these Macadamia and Brown Butter Blondies.\nIn the recipes we’re sharing from the book (see them all below), you can try blondies with malty, cereal-milk-like barley flour. Make the easiest shortbread ever with wheaty, historic einkorn. Granola scones: self-explanatory. Ricotta-cornmeal pound cake, heavenly. I baked the appropriately named Trouble Cookies with sweet sorghum flour, Heath bits, coconut, and cashews and took them camping, for sustenance. (Make sure to store all of your newly purchased whole grain flours in the fridge or freezer, though, as they tend to go rancid when not used frequently. Jullapat stores hers in zip-lock bags. I dig a stackable Cambro.)But say you’re not me, and you find my insistence on spelt flour to be a little annoying, or asking a bit much. I’ll let Roxana reply: “You have all these spices. You have two, three options of breakfast cereals. Yogurts, you might have two or three flavors. It’s the same with grains. And with more raw material, there’s more potential.” These grains are also more healthful than industrialized-up-the-wazoo all-purpose flour. They’re packed with vitamins and minerals and everyone’s favorite—fiber.These Blueberry Spelt Muffins are on repeat. \nPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioAs fun as Mother Grains is to bake through, it’s also educational and empowering. “I was struck by the fact that our conventional, global flour supply reflects only a handful of wheat varieties,” Jullapat writes in the opening pages. In each chapter, before she dives into the recipes, she tells the history of the grain and explains its nutritional and environmental benefits.When you buy heritage grains, especially from small producers, you’re not only supporting the local economy, but you’re also advocating for agricultural biodiversity and more sustainable farming methods. Like Maine Grains in Skowhegan, Maine, which mills certified organic and heritage grains “that are grown in rotation with crops that balance nutrients in the soil,” founder Amber Lambke says. Buckwheat is one of those bumper crops, feeding the soil after other crops have depleted it (use that as an excuse to make the buckwheat chocolate cake below). Sorghum can grow in hot, dry conditions requiring a lot less water and land space than other grains. “The restoration of grain growing in the northeast serves bakers, brewers, and chefs,” Lambke notes, “and is a step toward restoring balanced agricultural practices that leave the earth better than we found it.”But maybe the most convincing argument for baking with these whole grain flours is that they’re delicious. “The initial steps are very noncommittal: Just buy a bag of flour,” Jullapat says. We’ll help you figure out what to do with it.Mother Grains$40 at Amazon$37 at Bookshop1 / 7ChevronChevronRicotta Cornmeal Pound CakeView RecipeReady to buy some heritage grains? Right this way…Explore Bon AppétitCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-26", "author": ["Condé Nast", "Alex Beggs"]}