{"id": "7e7a2ac992aca2a4166d9cbde1c3961e", "url": "https://www.bonappetit.com/story/ahmed-errachidi-restaurant-guantanamo-bay", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "The Restaurant at Guantánamo Bay | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Restaurant at Guantánamo BayThe food was bland, sparse, sometimes nonexistent. But five years in Guantánamo Bay drove chef Ahmed Errachidi to create the most vital meals of his life.By Tim WildSeptember 21, 2020FacebookTwitterEmailIllustration by Derek Abella FacebookTwitterEmailThe way Ahmed Errachidi tells it, his career as a chef began with an act of protest. The daily staff meal at The Westbury, the London hotel where he worked as a kitchen porter, was always chicken thighs, baked dry and served without fanfare. So one day he complained to the head chef and received a curt reply: “Can you do better?”He threw the chicken, some olives, a few spices, and a lemon together and crossed his fingers. He needn’t have worried. The restaurant manager phoned the kitchen to say it was the best staff meal he’d ever eaten, and “Ahmed’s Chicken” became an immediate staff favorite. The head chef sensed his potential and started asking for help with vegetarian customers because Errachidi’s touch with spices and pulses made vegetable dishes luxurious and rich. Within a few weeks he’d swapped the sink for the stove full-time.Stirring that first dish, Errachidi had no idea just how much that urge to protest would shape the rest of his life. Over the phone from his home in Tangier, Morocco, he shared how wanderlust, curiosity, and concern took him from Morocco to London to Pakistan to Guantánamo Bay, where for five years he would experience extremes of hunger and suffering, see food used as a tool of coercion, and rely on his culinary imagination to keep hope alive. He’s not a big-name chef—he has no Michelin stars, no TV series, no cookbooks to his name. But Errachidi’s instincts around food and cooking became nothing short of a tool for survival.After his initial success at The Westbury, Errachidi became a part of London’s vast catering army. He went from one gig to another, with stints in several high-end kitchens along the way. While he always had a job, the financial pressure of living in London on a cook’s wage, away from his family in Morocco, began to weigh heavily. Back home in Tangier his newborn baby son, Imran, had developed heart problems (soon to be diagnosed as a blocked artery), and Errachidi worried he wouldn’t ever make enough in London to pay for his care. Sitting in a café before a shift one day, worrying about his future, he watched the planes fly into the World Trade Center. His family needed him and the world was turning upside down. It was time to go home.In his memoir, The General: The Ordinary Man Who Challenged Guantanamo, Errachidi explains how he returned to Morocco with a new plan to start importing silver from Pakistan. He traveled to Islamabad for a buying trip, meeting suppliers and discussing prices, and it seemed there was real profit to be made—maybe even enough to pay for Imran’s medical treatment. He watched the U.S. bomb Afghanistan on TV in his hotel room every night and, despite his son’s illness, despite the pressing need to start his business, the nightly parade of civilian injuries and suffering became impossible for him to ignore. He felt an unshakeable religious conviction to help his fellow Muslims, to get into Afghanistan and volunteer to help in any way he could—cooking, driving, anything. He crossed the border illegally a few days later and spent the next few months helping refugees in a series of convoys, moving from camp to camp, cooking for anyone who needed a meal. Until the night he was stopped at a checkpoint, arrested, and detained by Pakistani intelligence officers.After weeks of interrogation and beatings, he was blindfolded and driven to Islamabad airport. As he sat in the diplomatic lounge and listened to the sound of cash being counted out, Pakistani intelligence officers sold him to the CIA. He wouldn’t cook a meal, see a kitchen, or taste anything like restaurant food for the next five years.But even prison food would come to represent something much more than a meal. “The only thing that brings color and life to your cell is the food...a red apple...a banana…” recalls Errachidi over the phone. “To someone who is in isolation, it’s a source of comfort, proof that there is life out there. It's the only link between you and the outside world.” His review of a regular day’s fare at Guantánamo Bay is that it “wasn’t bad.” The men mostly received either a U.S. military MRE—Meal Ready-to-Eat, about 1,200 calories—or a portion of cooked food, always served cold. There was rice or pasta, sometimes with added meat or fish, plus a piece of fruit or an occasional cookie. Breakfast could be porridge or scrambled eggs with sliced bread, with cold tea or tap water to drink. Meals were served on paper plates, passed through a low, thin hatch in the cell door, and had to be eaten with plastic spoons. The spoons were issued with the food and had to be returned immediately afterwards, as the authorities were concerned they could be fashioned into weapons. The men hated the blandness of the food and the lack of variety, but it was good enough to look forward to, a highlight during the tedium of a normal day.For Errachidi there were very few of those normal days. In his first weeks at the base, he was convinced the interrogators would see that they’d made a mistake and let him go. As the endless rounds of identical questions continued, he realized he wasn’t getting out, and decided to thwart the authorities at every turn. That defiance—and the subsequent reputation it gave him among those incarcerated with him—meant he was in constant trouble. He estimates he spent four of his five years at Guantánamo undergoing some form of punishment.“If you did something wrong in their eyes, they would take your food and blanket away from you,” he says. “I was always punished like this.”The U.S. government prefers the term “single-celled detention” to “solitary confinement,” but soldiers and the incarcerated alike knew it simply as “isolation”: a tiny six-foot by eight-foot metal cell with a sliver of opaque glass for a window, furnished with a thin mattress, a toilet, and a sink. Prisoners in isolation were still allowed to talk to one another and receive regular meals. But even here, Errachidi continued to challenge the soldiers, and spent many nights in a special punishment cell, a plain metal box with a fan at head height. It had no window. No other prisoners were within earshot. It contained no furniture, mattress, or blanket. Clothing and sleep were forbidden. To add to the discomfort, food was used as a tool of intimidation. “They’d blow very cold air inside my cell,” he recalls. “I’m there in my shorts, no shoes, no trousers, no shoes, no nothing. I’m extremely hungry. I’m waiting six or seven hours for the food to come.”That food wasn’t much to look forward to. Punishment meant regular meals were replaced by two dry bars of baked mixed beans, two slices of bread, and two pieces of raw carrot and celery. Nearly naked and kept constantly awake, he was often forced to make a stark choice: go hungry, or freeze.“I chew my slice of bread with the baked beans, chew it, chew it, chew it, chew it. I’m dying to swallow it...but I make a mixture from the chewed food, like a cement, and block the ventilation,” recalls Errachidi.Hunger strikes were common at the base, too. Dozens, sometimes hundreds, of men would go on hunger strike, particularly when they felt their religious rights were being violated. One strike, prompted by the searching of the men’s Korans, went on for months.The strength of his protests and his ability to motivate and organize had made Errachidi a leader—nicknamed “The General” by his fellow prisoners. But hunger strikes were usually something he tried to avoid as an ulcer gave him crippling stomach pains without regular doses of Zantac. When he did join his fellow hunger strikers, the soldiers withheld his medication, or worse. One soldier would order him to the cell window, pull out a chocolate bar, and start slow dancing with it to torment him. “She would unwrap it slowly, while she's dancing, moving her body, and she would take it between her tongue,” Errachidi told me. “And I'm watching her. I'm in pain and I'm hungry, and she's doing this in front of me. She's torturing me with chocolate. She knows I'm on a hunger strike and she will do that in front of me each time.”But despite his years of punishment and torture, Errachidi refuses to condemn those who took part in it. It’s his belief that they’d never experienced any real deprivation, never had to dream of a hot meal or a glimpse of sunlight, and therefore didn’t know how much pain they were really causing.Errachidi was never given any idea as to when—if ever—he’d be released. Many of his fellow prisoners were in a similar state of limbo. With little sense of time, no amenities aside from their Korans and nothing to look forward to, the danger of hopelessness setting in was never far away. For the men in isolation—exhausted from protest, kept from sleeping, and surviving on punishment rations—the threat of despair was even greater.Prisoners on punishment had one small consolation: They could still talk to, and hear one another, from inside their cells. Errachidi’s desire to feed and care for people, to keep the men strong, drove him to cook with the best food he could think of. “I would say, ‘Imagine yourself being a guest in my house and I'm cooking beautiful dishes.’ And I would start describing them.” Every night, after the soldiers had left the block, Errachidi’s “restaurant” would open for business. He would announce a full menu with numerous courses and narrate the prep, cooking, and serving of each dish to every inmate within earshot. “The fish selection, all different kinds of salads. Things that we've missed so much.”He knew how much it meant to them. With little or no contact with the outside world or their families, thousands of miles from home and its comforts, these imaginary banquets became a vital source of nourishment. “Sometimes somebody will ask me, ‘Hey, Ahmed, can you tell us how to cook this dish?’ As if it's for real, as if they are tasting it,” Errachidi recalled.He would take his time, describing ingredients, aromas, and cooking techniques with as much detail and nuance as he could manage. Men would call for their favorites from Errachidi’s repertoire, or request a particularly beloved dish from home. It wove a spell, conjuring up an imaginary rush of flavor that could push the men out of their cells, settle them around a table, and let them feast in freedom. Errachidi knew it was a powerful tonic, but he also understood how hard they might land when the reverie wore off. “They all had a good time sitting around the table, eating all these beautiful dishes and desserts and juices and chocolates. Am I going to say, ‘Hey, it was only talk’? No. I have to find a way to bring them back to reality, to their cell, in a very nice, gentle way. I say to them, ‘Look, now we've eaten your starters, your main course, your dessert, your coffee...how about taking a nap?’ So this is how the party finishes.”On May 3, 2007, after over five years in prison, Errachidi was released from Guantánamo Bay and repatriated to Morocco, where he rejoined his family and learned, happily, that doctors had been able to treat his son’s heart condition without surgery. His British attorney Clive Stafford Smith, founder of legal human rights NGO Reprieve, had applied sufficient pressure to the U.S., both legally and in the media, to secure his release. The U.S. never charged Errachidi with any crime, never put him on trial, and never told him why he’d been imprisoned. He’s never received any compensation or acknowledgement regarding his incarceration.At first, freedom was hard to deal with. Years of cravings and hunger had taken their toll on his appetite, and he ate voraciously, gorging himself to sickness at every meal. Nor could Errachidi simply slip back into the routine of regular life in Tangier. His release caused a flurry of press coverage, book offers, and attention from around the world. All the while, he was struggling to adjust to a world of plenty. “There are so many things you haven't touched. I haven't seen a gas cooker for five years. I haven't touched wood for five and a half years. I haven't slept one night in a dark room for five and a half years.” After a few weeks, he began to stabilize. He and his family opened a restaurant called Cafe Terrasse Boulevard in Tangier, a few blocks from the waterfront. Thirteen years years later, Errachidi is still in the kitchen, serving continental breakfasts and traditional Moroccan dishes to tourists and locals.But the starvation, abuse, and deprivation have left their mark. He can’t stand to see waste in the restaurant. The sight of a bar of chocolate can trigger intense flashbacks of isolation and craving. But the memories are also a reminder of all that he has to be thankful for. “Sometimes, I have guests and it's a good table—friends and family—the table is full of food,” he says. “I remember that there's still a few people now in Guantánamo...I feel that I’m fortunate that I got my freedom back and I got my food back...I got everything back.”Tim Wild is a freelance food writer, podcast host, and author from the UK. This article was made possible with help from Reprieve, a legal rights NGO based in London.Explore Bon AppétitRestaurantsChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-21", "author": ["Condé Nast", "Tim Wild"]}