{"id": "7eaccb7c7e6b4d0a04a0903b7d8b419c", "url": "https://www.bonappetit.com/story/haenyeo-salad-dressing", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "I Love Haenyeo’s Salad Dressing So Much, I Asked the Chef How to Make It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Love Haenyeo’s Salad Dressing So Much, I Asked the Chef How to Make ItIt's a salty, sweet, perfectly balanced dream.By Emma WartzmanNovember 10, 2020FacebookTwitterEmailPhoto by Allie WistFacebookTwitterEmailThis is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.At Haenyeo, a Korean restaurant in Brooklyn, the best thing on the menu is the salad. Yes, chef Jenny Kwak knows her way around fish, which make appearances in many of the dishes. (The restaurant is named after the South Korean female divers on Jeju Island, whose livelihood is built around catching seafood off the coast.) And who doesn't love Kwak’s lauded rice cake fundido? (It started out as the traditional tteokbokki but morphed into a mash-up of that and Mexican queso fundido.)What I’m trying to say is that everything is really good. And yet whenever I go—or these days, order takeout—I can’t stop thinking about the salad. It’s simple, usually made with a mix of seasonal lettuces and sometimes an addition of watercress or endive. There’s almost always avocado and often tomatoes. But what makes it sing consistently is the apple dressing—salty and sweet, delicate and complex.Ostensibly for this column, but also for my own personal interest, I called Kwak to ask her how it’s made. The dressing is based on a common Korean dressing for watercress salad, which the chef has been making since basically forever.Typically, it’s a mix of soy sauce, raw pureed garlic, chile flakes, lots of sesame seeds, sugar, rice vinegar, and sesame oil. All strong flavors. “It’s delicious,” Kwak says, “but not mild at all.” This is the version of what she cooked for years at her mother’s restaurants, Dok Suni and Do Hwa, both now closed but New York City institutions back in their day.When Kwak opened Haenyeo, her first restaurant on her own, she knew she wanted to keep some of those core ingredients but make a slightly lighter dressing. The soy sauce and rice vinegar are still there, but she swapped a neutral oil in for the nutty sesame oil and left out the garlic and chile flakes. What maintains the depth of the dressing, without getting too loud, is Vidalia onion and Fuji apple, grated so they simply dissolve into the liquid.“Koreans use a lot of pureed fruits and onions, especially in meat marinades,” she explains, “And it’s also common in both Korean and Japanese cooking to round out the taste of soy sauce with onion to cut through some of the pure saltiness.” Kwak took these techniques and applied them to her dressing, yielding something that tastes so much more than the sum of its parts.So go to Haenyeo for the fish and the fundido, which definitely don’t disappoint—but really go for the salad, which exceeds all expectations.Go There: HaenyeoExplore Bon AppétitHighly RecommendRestaurantsBrooklynSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-10", "author": ["Condé Nast", "Emma Wartzman"]}