{"id": "7eac182678e941260f4adde59e33c041", "url": "https://www.bonappetit.com/recipe/lemony-tortellini-soup-with-spinach-and-dill", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Lemony Tortellini Soup with Spinach and Dill Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLemony Tortellini Soup with Spinach and DillBy Sarah JampelMarch 7, 20214.4(161)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Anyka BrownEmailPinterestPrintEmailPinterestPrintSpringy and light yet comforting and flavor-packed, this recipe takes its cues from avgolemono, a family of Greek soups (and sauces) in which broth is thickened with egg and lemon juice. Eggs and lemon is a classic pair that's also common in Turkish, Balkan, Arab, Italian, and Sephardic Jewish cuisine, among others. Since a good deal of the flavor in the final dish comes from vegetable broth, you’ll want to make sure you’re using one that tastes good to you: Homemade is ideal, but when that’s not possible, I like Better Than Bouillon. You can also use cartons of broth from the store or bouillon cubes—just follow the directions on the package. A good rule of thumb is to add 1 less bouillon cube than suggested, then taste before you add the final cube—some brands can be quite salty! (Though, if worse comes to worst, you can always dilute your soup with a little water.) While mature spinach retains a better texture, you can also use baby in a pinch.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBetter-Than-Bouillon Seasoned Vegetable Paste$6 At Amazon8-Inch Chef's Knife$47 At AmazonSalad Spinner$40 At AmazonIPOW Fine Mesh Strainers (Set of 3)$12 At AmazonDutch Oven$80 At AmazonMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonSpider$6 At AmazonSmall Bowl$13 At AmazonMedium Bowl$17 At AmazonLadle$8 At AmazonVegetable Peeler$10 At AmazonIngredients4 servings1bunch mature spinach (9–12 oz.)1small bunch dill1Tbsp. plus 1½ tsp. vegetable bouillon paste (preferably Better Than Bouillon) or 4 cubes bouillon or 8 cups homemade vegetable stock or low-sodium vegetable broth10oz. cheese, spinach, or mushroom tortellini1–2lemons4large eggs1tsp. freshly ground black pepper, plus moreKosher saltExtra-virgin olive oil and Parmesan (for serving)PreparationStep 1Prep your green things: Trim roots and leggy stalks from 1 bunch mature spinach (9–12 oz.). Wash well and spin or pat dry; coarsely chop. Coarsely chop leaves and tender stems from 1 small bunch dill to make ½ cup. Set a few tender sprigs aside for serving; reserve remaining dill for another use.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Bring 8 cups water to a boil in a medium Dutch oven or other heavy pot. Add 1 Tbsp. plus 1½ tsp. vegetable bouillon paste (preferably Better Than Bouillon) or 4 cubes bouillon (or follow the package instructions) and whisk to dissolve. (Alternatively, you can heat 8 cups vegetable stock or low-sodium vegetable broth if you prefer). Add 10 oz. cheese, spinach, or mushroom tortellini and cook 3 minutes (or according to package directions), then remove from heat. Using a spider, slotted spoon, or fine-mesh sieve, divide among bowls.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Cut 1 lemon in half and squeeze juice through your hand or a fine-mesh sieve into a small bowl. You should have ¼ cup; repeat with another lemon if you need a little more juice.Step 4Whisk lemon juice, 4 large eggs, and 1 tsp. freshly ground black pepper in a medium bowl or large measuring glass to combine.Step 5Return broth to a gentle simmer. Scoop out about 1 cup and very gradually drizzle into egg mixture, whisking constantly. (This step, called tempering, warms up the delicate eggs slowly so that they don’t scramble when you add them to the rest of the hot broth.) The egg mixture should be quite warm to the touch—if not, whisk in more broth.Step 6Whisking constantly, gradually pour warm egg mixture into broth in pot. Cook, whisking often, over medium heat, until slightly thickened, 5–7 minutes. (Do not let broth come to a full boil.) Taste and season with kosher salt and more pepper if needed. If your broth is really salty, you might need to add a bit of water to dilute the soup. Step 7Remove from heat and add spinach and chopped dill (the spinach will wilt immediately.)Step 8Ladle broth into bowls with tortellini. Drizzle with extra-virgin olive oil and shave or finely grate Parmesan over. Sprinkle with a little pepper and top with remaining reserved dill sprigs.Step 9Do ahead: Tortellini can be cooked 2 days ahead. Toss in an airtight container with a little oil to keep from sticking. Cover and chill. Broth can be made 2 days ahead. Let cool; cover and chill. Reheat very gently, stirring constantly to re-emulsify (it may separate in the fridge), before ladling over tortellini.How would you rate Lemony Tortellini Soup with Spinach and Dill?Leave a ReviewTell us what you thinkReviews (36)Back to TopTriangleSimply deliciousKBechtelNew Orleans3/14/2022What is wrong with BA!!??  I have been asking for a print button for years!  The refusal to make recipes easier to download and print is a mystery to me.  Very disappointed in BA all around.PRungeSan Francisco2/15/2022It was delish!  Separated a bit at the end even though I was constantly stirring - not sure how to prevent this.  Did I not temper my eggs well enough?  Looked okay to start before I added the spinach and dill. AnonymousBarrie, ON Canada1/27/2022Loved it on the second try! The first time I made it I thought it tasted too much of egg yolk and I added too much dill. I made it with brown organic eggs this time and it was completely transformed!! No metallic eggy after taste. I was also more careful with how much dill I put in. Added some leftover fresh basil as well. So simple and delicious, and just one pot!KaitlinChicago1/13/2022I'm about to make this but don't have any dill! Should I swap for basil and/or parsley? Or should I wait until I get some dill in the house.BenChicago1/10/2022I don't have ANY of their tools and it STILL, came out great.\n\nCan't believe it. Had my doubts. Didn't wanna. Don't have equipment. Small urban kitchen from 1950. Takes me 50 minutes to boil 8 cups of water ... but ... THIS. DISH. KILLS.\n\nSuper delicious. LOVE the lemon and dill. SLURPING broth.\n\nCHEAT: I took several bites before adding SRIRACHA. It didn't kill the flavor, I enjoyed the enhancement.\n\nTHANK YOU!@BugyackSalt Lake City, UT1/6/2022Fix your page! Reviews and recipe are printed over one another starting with instruction #8 - neither is readable! I came last week for this recipe and it was this way then - I thought it was just a glitch and would very soon be fixed. Evidently not, and I cannot believe NOBODY has reported this problem. I'd love to make this soup, but...Michelle Anderson, SC1/5/2022Really, really delicious. This soup has a nice clean flavor. I used homemade chicken stock that I had on hand, which might have affected flavor and texture slightly - but the lemon, spinach, and dill really shone through. The pre-made grocery store brand tortelloni was leveled up, and I loved the nutritional punch of the spinach. Really great and quick meal.Logan d.Alexandria, VA6/15/2021Loved it--used 2 bags of baby spinach, abt 16 oz, and the tempered eggs made a nicely thickened broth--not as thick as a roux, but a nice texture. A little more grated parm than called for, and mushroom tortellini. It was fast, simple, economical, and delicious.JanmausNC5/31/2021Delicious!  We loved this.  Used spinach tortellini.  I'm not normally a huge fan of dill but this was just perfect.  The flavor is balanced out so nicely between the lemon and the dill and the spinach.  I'd actually put more spinach in.  Will make this again.Jen M.Los Angeles, CA5/2/2021I want to clarify... I give MY version 5 stars. Theirs is probably a 3/5. \nI used no sodium added vegetable broth, subbed spinach with lacinto kale, added frozen spring peas and diced pancetta for some meat + salt. It was delicious for days. Katie NoelBurlington, VT4/28/2021Loved this soup, we have made it multiple time.Tricia KChicago,il 4/21/2021Wasn't a fan as others were. The family had one portion and didn't go back for more (which is usually the indicator for me that it wasn't that big a hit). The flavor wasn't rich to me, just kind of eggy and lemony but in a bland sort of way. It was also a little more labor-intensive than I thought it would be. Eh, well, win some, lose some!Curly ChefLawn Guyland, NY4/12/2021Delicious! I used more lemon and tortellini, and finished it off with a knob of butter. It was the exact creamy lemony flavor I wanted. AnnetteRaleigh, NC4/10/2021Loved this!!!!  This was really, really good and a hit with the fam. I used a 1 lb bag of mini frozen meat tortellini and 10 cups of liquid. It was enough for 5 generous bowls. This one is going on the regular rotation. Thanks again for another great recipe, Bon Appetit!CSToronto, ON4/6/2021Explore Bon AppétitSoupSoups and StewsPastaLemonCitrusFruitNoodlePasta & NoodlesSpinachLeafy GreensVegetableTortelliniWeeknight MealsMainVegetarianLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-07", "author": ["Condé Nast", "Sarah Jampel"]}