{"id": "7ebd7516a0cd1a99a0553e0a05633838", "url": "https://www.bonappetit.com/story/osento-bathhouse", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Meredith Talusan On How a Women-Only Bathhouse Helped Her Find Her Female Self | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Women-Only Bathhouse Helped Me Find My Female SelfMost of my friends knew I was trans, but, in the bathhouse, it didn’t matter.By Meredith TalusanMarch 13, 2018FacebookTwitterEmailIllustrations by Jonathan NiclausFacebookTwitterEmailMy favorite spot at Osento was at the edge of the warm soak near the wall, where I could look upon an entire room of naked women around me in various forms of relaxation, whether inside the water, lying on lounger chairs, or on their way to the dry saunas outside.It was not only the physical warmth that gave me peace, but the warmth of knowing I was welcome among them.I'm pretty sure that's why my best friend Anna brought me to the women’s only bathhouse in the first place, to reassure me of my place as a woman among women, at a time when I still didn't feel so secure.It was 2001, in San Francisco, and I’d just had genital surgery. For the first time in my life, the world perceived me as a woman both in and out of clothes. But everyone at the art school I attended for photography knew I was trans. I'd documented my transition in my work, so my interactions with my friends there were tinged with the shadow of my past.Anna was different. She was Dutch and blunt in her Dutchness, someone who didn't mince words and had no hesitation about pointing out that my instinct to take the lead in group projects or to need to win at arguments was because I’d been raised as a boy. But she also made sure I didn't feel left out because of it. That was how I wanted to be in the world, someone who came from my specific background and had my precise set of experiences, but didn't let those experiences compromise my womanhood.Osento occupied the bottom floor and backyard of a Mission row house—it was not gigantic but always felt ample. The layout was ideal in a way that I didn't have to think about: lockers moving onto showers, then a main pool area with a large warm soak that was the centerpiece of the place, along with the bracing cold pool that made you appreciate the warmth. There was a dark, quiet lounge area as well as saunas situated in the backyard.Osento made me feel as though going from man to woman really was like\nmoving to the opposite pole of a magnet.At the time, I only knew Osento as superior to the other major San Francisco bathhouse, Kabuki, because it was only open to women. This meant no need for bathing suits or trying to remember what day it was that Kabuki was single-sex. Osento closed in 2008, and it’s only from reading accounts online that I learned how it had been around since the 1980s, and that it opened during a time when that part of the Mission district was known for being a haven for lesbian women. It’s even described as a “dyke sauna” by at least one queer travel guide, which I was largely oblivious to when I went there.Before Osento, my main association with baths was as a gay man cruising in London bathhouses. The gay baths in New York, like St. Mark's, had already been shut down at the height of the AIDS crisis in America. Those men's spaces always felt so sexually charged, every interaction or touch tinged with erotic possibility. Osento felt radically different; it made me feel as though going from man to woman really was like moving to the opposite pole of a magnet, the way women looked and smiled openly at each other, unlike men's baths where a direct glance was a marker of desire. And I felt no hesitation about resting a head on Anna's shoulder or grasping the hand of any of a number of close friends, a marker of intimacy that felt taboo in men's spaces except as a precursor to sexual contact.Coming to Osento also made me feel good about my body, its history and specificity, even the broad shoulders and muscular back that societal cues kept encouraging me to hate. At Osento, there were all sorts of bodies, shorn of the clothes that marked class or affiliation except for tattoos, piercings, and the color of their skin. I’d heard it said that being in a nude space that isn't policed by mainstream beauty standards makes one realize how many types of bodies there are. But as a newly-transitioned woman, who had never been naked in a room full of other women, I wan’t prepared for how transformative the experience actually was. I saw such a range of body sizes and shapes that my compass for what a woman's body looks like was permanently reoriented.                                ***\nSix months after arriving in San Francisco, a month after my first post-transition boyfriend committed suicide, Anna and I moved into an apartment together, four blocks away from Osento. My insatiable grief, combined with the bath’s proximity, turned Osento from an occasional treat to an almost-weekly ritual. Anna and other friends—who knew how stalwartly I tried to be an exemplar of strength, an aggressive reaction to the stereotype of trans women as mentally weak—took me there so that they could console me with their presence, knowing not to say words that would have compromised my illusion that I was okay.It was alone in Osento’s sauna that I allowed myself to cry. I soaked in the pool and wept underwater, in the presence but out of sight of my closest friends. And, as I slowly healed, I understood the power of being in the presence of other women, without the need for words.Even though I was welcome at Osento, other trans women and femmes who did not have the money or inclination to get genital surgery were not. Knowing this taints my memories, but I also believe that my presence at Osento was still a movement forward, a way for cisgender women to understand trans women and femmes as more like them than they expected. The space adjusted to me as much as I adjusted to it. And, gradually, we came to understand that, more than any piece of anatomy, it’s an accumulated knowledge of what it means to live in the world as feminine that defines us as women.Explore Bon AppétitHealthyishessayRead MorecultureChatting With Meredith Talusan, Editor of New LGBTQ Site \"them.\"By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Meredith Talusan"]}