{"id": "7ec76404409b35400eb6a36c2f117ff9", "url": "https://www.bonappetit.com/story/strong-opinions-about-nachos", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "How to Make Nachos at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Four Strongly Held, Certainly Correct Opinions on NachosFrom the chips to the cheese.By Sohla El-WayllyJanuary 31, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina Boytsova FacebookTwitterEmailI’ve found my way into a life surrounded by food people, which often leads to intensely passionate conversations about nonsense: deep-dives on devil’s food cake, monologues on jammy eggs, and proclamations of love addressed to Popeye’s fried chicken sandwich. It was in the midst of one of these riveting discussions that I realized I have opinions—strong ones, and I’d venture to say, correct ones—about nachos. From the chips to the cheese, here's how I believe nachos should be composed and consumed:1. Now's not the time for flimsy chipsRemember, nachos are a finger food: Thin chips will drive you to fork nachos—even worse than forking pizza (looking at you, De Blasio). So find the thicc-est chips money can buy, something with integrity. They’ve got to have a hearty corn taste and be sturdy enough to handle the heft of whatever toppings you throw at (okay, on) them—chicken tinga, bacon-y refried beans, carne asada. (I like the yellow corn tortilla chips by Garden of Eatin’.) And even if you prefer minimal toppings, a thick chip stays crunchy longer.2. Queso is superior to broiled, shredded cheeseThe addition of hot melt-y cheese transforms a pile of chips (boring) into nachos (fascinating). Queso, homemade or not, is my cheese of choice. It stays saucy even at room temperature, which means I can eat at my typical snail’s pace and still get good nacho vibes. Shredded, broiled cheddar, on the other hand, congeals into a matted web that entraps chips, beans, and salsa well before I've made a dent in the sheet tray.Some of you are probably on team shredded cheese—and, fine, I get it. The chew and stretch of just-melted cheese, if you’re fast enough to catch it, is one of life’s greatest pleasures. For nachos, it’s best to stick with cheese that’s what I like to call “medium good.” The super fancy cage-aged stuff can’t take the heat and will break into pools of oil if you even look at it the wrong way. On the opposite end of the spectrum is packaged, pre-shredded cheese, which is coated in stuff that prevents it from fully melting. Avoid it. Regular old Jack, Colby and/or cheddar grated by your own bare hands is the only way to go.3. Go wide, not highA mountain of nachos might look fun—but at what cost?! Only the outermost layer gets topping love, while everything underneath is either naked and dry or sopping wet under the weight of it all.Nachos, like a California ranch-style home, should never be built more than two layers high. Spread the chips out wide on a rimmed baking sheet, evenly distribute cheese sauce and other hot toppings, like refried beans, then arrange just ONE (I mean it—one!) more layer of chips, cheese, and hot toppings. Save the cold stuff like salsa, guacamole, and sour cream for the end. If that’s not enough nacho for you, make two trays.4. Every chip should have something but not every chip should have everythingIf you’re too careful about even topping distribution, dropping sour cream on every chip, your nachos will turn into a big, sloppy mess. I don’t need every chip to have everything on it, but I want something on every chip. Toppings should be placed in little blobs throughout so that you can choose your own nacho adventure at every bite. Sometimes I don’t want a bean and I just want cheese, other times I need a big plop of guacamole. I want to be  free to build each chip to satisfy my ever-changing needs. My nachos of choice consist of two layers of chips dressed with queso and are finished with pockets of finely chopped white onion, pinto beans, tomato salsa, cilantro, and sour cream thinned with lime juice.If you want to level up and get really crazy, warm the chips and the plates to extend the lifespan of your nachos. It's not a requirement, but I will count it towards your overall nacho score.Queso, Not From a JarYou could be totally hammered halfway through the Super Bowl and still make this queso. It’s that easy.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-31", "author": ["Condé Nast", "Sohla El-Waylly"]}