{"id": "7ec8e34e52c6406df81314a902f1cc36", "url": "https://www.bonappetit.com/story/50-nominees-best-new-restaurants-2019", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Our 50 Nominees for the Hot 10: America’s Best New Restaurants 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsOur 50 Nominees for America’s Best New Restaurants 2019From a quirky hand-roll counter in Seattle to a Providence café making the flakiest baklava, these are the places we can't stop thinking about.By The Bon Appétit StaffSeptember 10, 2019FacebookTwitterEmailFacebookTwitterEmailThink it’s hard for Julia Kramer, BA’s deputy editor, to narrow down hundreds of meals in dozens of cities across America to a list of 10? Same here. That’s why we start by naming our 50 nominees, all of which are worthy of celebration in their own right. Check back on September 17 to find out which of these spots made it to the final Hot 10 list. (And while you’re thinking about it, save the date for our extremely epic Hot 10 party in NYC on October 19. Buy tickets now!)Photo by Noah FecksAddaLong Island City, NYPowerful, purposeful, firing-on-all-cylinders Indian hitsPhoto by Elizabeth CecilAleppo SweetsProvidenceBest-in-class baklava at a homey Syrian caféPhoto by Alex LauAtomixNew York CityThis is Korean-inflected fine dining at its, well, finest.Photo by Laura MurrayBalkan Treat BoxSt. LouisWood-fired flatbreads, sandwiches, and other extreme forms of deliciousnessPhoto by Jonnie SirotekBeckonDenverDuncan Holmes ups the ante with a chef’s counter next door to last year’s Hot 10 winner Call.Photo by Alex DelanyBenchwarmers BagelsRaleigh, NCEvery other bagel sandwich just became meaningless.Photo by Johnny AutryBenne on EagleAsheville, NCNew Southern with deep roots from chef Ashleigh ShantiPhoto by @rhodeisland_eatsBig KingProvidenceChef James Mark’s one-of-a-kind Japanese hideawayPhoto by Hayden SpearsBlood Bros. BBQHoustonStellar Texas ’cue with Chinese and Vietnamese influencesPhoto by Laura MurrayBungalow by Middle BrowChicagoA more fun place to drink interesting beer and eat interesting pizza there simply is not.By TaeSeattleA hand-roll counter with a surplus of personalityPhoto by Andy HimmelrichCall Your MotherWashington, D.C.The deli where a bagel should be followed up with a black-and-white alfajorPhoto by Alex LauCarpenters HallAustinThe plate-size cutlet says it all at this way-more-than-a hotel restaurant.\n[Ed note: Andrew Knowlton, BA's editor-at-large, is involved in the restaurant]Photo by Kevin KramerCentro and Popol VuhMinneapolisA Mexican restaurant for when you’re feeling fancy (Popol Vuh) and when you’re not (Centro).Chubby FishCharlestonDoes Charleston need another trendy seafood spot? Only if it’s as delightful as this place.Courtesy of Dacha DinerDacha DinerSeattleImmensely craveable Eastern European food (hello, beautiful khachapuri)Courtesy of DakzenDakZenSomerville, MAThe khao soi alone proves that America needs another fast-casual restaurant.Photo by Alex LauThe Elysian BarNew OrleansA magical hotel bar with a storied pastPhoto by Kate GrewalFadensonnen, Larder, and Sophomore CoffeeBaltimoreSorry, we’re not choosing a favorite among this trio of like-minded businesses: the bi-level biergarten and wine/sake bar (Fadensonnen), the earthy café (Larder), or the on-point coffee shop (Sophomore), united by a communal patio with picnic tables.Photo by Danielle AtkinsHathorneNashvilleWhere farm-to-table feels fresh as everCourtesy of Heirloom BrewshopHeirloom BrewshopRaleigh, NCSerene tea shop, for sake and Taiwanese fried chicken tooPhoto by Laura MurrayJeongChicagoHeartfelt, precise cooking with a Korean bentPhoto by Alex LauKhao Noodle ShopDallasFun-size Laotian noodles and snacks turn a strip mall into a destination.Photo by Alex LauKonbiLos AngelesIsn’t it nice when Japanese sandwiches this insanely popular are also this insanely good?Photo by Alex LauKopitiamNew York CityThe Malaysian coffee shop that has us craving nasi lemak day and nightPhoto by Jeff MariniKumiko and KikkōChicagoHighly personalized Japanese-style cocktail bar where every bite of food is transcendentLe Comptoir du VinBaltimoreTry and find a more charming French bistro and natural wine bar.Photo by Michael R. WilsonLeontiNew York CityStunning pastas in the kind of plush setting they just don’t make anymorePhoto by Jenny SathngamLineageMauiThe breezy restaurant that celebrates what locals in Hawaii eatPhoto by Emma FishmanLongovenRichmondTweezer food you’ll actually enjoy!Photo by Juli Leonard / The News & ObserverM TempuraDurham, NCA set menu dedicated to expertly fried tempura: Yes.Photo by Laura MurrayMatt’s BBQ TacosPortland, ORBreakfast tacos + serious barbecue = our happy place.Photo by Denny CulbertMolly’s Rise and ShineNew OrleansEpic breakfast and diner-style hospitality from the Turkey and the Wolf familyPhoto by Mia YakelNina & RafiAtlantaA chef from Jersey makes Detroit-style pizza in Atlanta—and it couldn’t be more natural.Photo by Michael Graydon + Nikole HerriottOchre BakeryDetroitAmbitious coffee, bread, pastry, and breakfast situations in the cheeriest caféPhoto by Alex LauPetra and the BeastDallasMisti Norris is the master of cured meats at this charcuterie-and-fresh-pasta haven.Photo by Jillian GuyettePizzeria BeddiaPhiladelphiaPizza saint Joe Beddia’s expanded digs live up to the hype.Photo by Rick PoonPorridge + PuffsLos AngelesWhere a bowl of creamy grains is the base for greatnessPhoto by Alex LauReunion Bread Co.DenverTwo words: churro croissant.Photo by Emma FishmanRoot Baking Co.AtlantaBecause if you’re milling your own heirloom grains, you should definitely be turning them into lamb shawarma pizza and morning buns.Photo by Julia KramerRosalita’s Backyard TacosNew OrleansWhy do tacos taste so much better eaten in an off-the-beaten-track alleyway?Photo by Emma FishmanSarvidaPhiladelphiaFilipino favorites served family-style in a setting that feels like homePhoto by Laura MurraySavage RestaurantSt. LouisNordic precision at a Midwestern chef’s counterPhoto by D.L. AndersonSister Liu’s KitchenDurham, NCUnforgettable dumplings, for carryout onlyCourtesy of Tacos OscarTacos OscarOaklandA colorful back patio made for sheer taco enjoymentPhoto by Marcus NilssonTailorNashvilleWhere Gujarat meets the Deep South—in dinner party form.Photo by Yahya NoorTawakal Halal CaféBostonThe Somali comfort food spot that should be your first stop off the plane.Photo by Aubrie PickVerjusSan FranciscoThe Quince team’s newest spot has all the wine we want to drink and all the pâtés and croquettes we want to eat.Photo by Marvin ShaouniWarda PâtisserieDetroitOutstanding pastries (both sweet and savory) as works of art.Photo by Alex LauThe Wolf’s TailorDenverHouse-made pasta and robata, so well executed that it works.Explore Bon AppétitHot 10 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-10", "author": ["Condé Nast", "The Bon Appétit Staff"]}