{"id": "7eec048f32f5445b8ab6390c6027f4ac", "url": "https://www.bonappetit.com/city-guides/new-york/venue/tanoreen", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Tanoreen Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkTanoreenThe bucket-list-worthy Middle Eastern destination in Bay RidgeFacebookPinterestTwitterEmailAlex Lau GO HERE: for an actually pleasurable group dinner. Tanoreen has been around since 1998 and serves a steady menu of Middle Eastern food meant for sharing. It's the kind of place you go to when you're forced to find a place for picky eaters, snobby eaters, and that one annoying friend who can never decide what he wants. Tanoreen is for everyone.ORDER: lots of dips to start, and definitely the fried brussels sprouts with pomegranate and garlic-panko breadcrumbs. For entrees, we particularly love the baked eggplant as well as the fetti, a combination of toasted pita, rice pilaf, lamb, and a yogurt-tahini sauce. You must get the knafeh, a rosewater-scented cheese and phyllo pastry, for dessert. We'll go on record saying it's one of the best desserts in New York, and worth the subway ridge to Bay Ridge if you're coming from Manhattan.THE VIBE: feels like the whole neighborhood is out to dinner, and they've brought friends. Chef Rawia Bishara often goes table to table in the dining room, chatting with customers and talking about her food. It's lively but not too noisy—just the kind of place you want to be in, even if the decor feels slightly dark and dated.PRACTICAL STUFF: Open every day: Tuesday to Thursday, from noon to 10 p.m.; Friday, from noon to 10:30 p.m.; Saturday, from 10:30 a.m. to 10:30 p.m.; and Sunday, from 10:30 a.m. to 10 p.m. Closed Monday. Reservations recommended!—Carey PolisAlex LauAlex LauWE ALSO LOVEWin SonTaiwan meets the American South in the heart of hipster BrooklynUncle BoonsBrave the spice at NoLiTa's best dinner-with-friends jointHart'sA super-tasty, postage-stamp-size escape in BrooklynExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Carey Polis"]}