{"id": "7f0aaeab5596d33bfd1bae77c18e43b5", "url": "https://www.bonappetit.com/recipe/blanched-and-squeezed-greens", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Blanched-and-Squeezed Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueBlanched-and-Squeezed GreensBy Christina ChaeyAugust 18, 20204.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintPrecooked, compact, and way more flavorful than store-bought frozen spinach, these portioned greens are ready to be thrown into soups and stews straight from the freezer or thawed in the fridge and tossed into omelets and pastas. Even simple side dishes of garlicky greens become infinitely faster when virtually all the prep work is done ahead of time.IngredientsMakes about 12 balls3large bunches Swiss chard, kale, mature spinach, collard greens, mustard greens, and/or broccoli rabe (about 3 lb.), ribs and stems removedKosher saltPreparationStep 1Working in batches, cook greens in a large pot of boiling heavily salted water just until wilted and bright green, about 20 seconds. Using tongs or a sieve, transfer greens to a colander set in a large bowl of ice water and let cool.Step 2Lift colander from ice water and drain greens well. Using your hands, squeeze out as much excess water as you can. Transfer to a cutting board and coarsely chop. Mold greens into small compact balls (about 1 oz. each), then squeeze out as much water as possible again (this will prevent ice crystals from forming on frozen greens).Step 3Place balls on a small parchment-lined baking sheet and freeze until solid, about 30 minutes. Transfer to a resealable plastic bag and close, squeezing out as much air as possible. Return to freezer.Step 4Do Ahead: Greens can be blanched 2 months ahead. Keep frozen.How would you rate Blanched-and-Squeezed Greens?Leave a ReviewTell us what you thinkExplore Bon AppétitSwiss ChardLeafy GreensVegetableKaleMustard GreensSpinachBroccoli RabeCollard GreensEasyQuickVeganVegetarianGluten-FreeDairy-FreeNut-FreeKetoHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Christina Chaey"]}