{"id": "7f1a17762a74857f9da0ead76f6cc01c", "url": "https://www.bonappetit.com/recipe/picadillo", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Picadillo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssuePicadilloBy Rick MartinezAugust 18, 20204.5(49)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“Every family has their own version of picadillo,” says Rick Martinez. “Some are spicy and some are sweet and include dried fruits as well as nuts. This one is inspired by a version found in San Luis Potosí in central Mexico with potatoes and poblanos. All you need are some fresh flour tortillas and you’ve got dinner, and any leftovers will make for an excellent breakfast taco the next day.”Ingredients4 Servings2Tbsp. vegetable oil, divided1lb. ground beef chuck (20% fat)½medium onion, finely chopped2plum tomatoes, cored, chopped1medium poblano chile, seeds removed, finely chopped3garlic cloves, finely grated1tsp. ground cumin½tsp. freshly ground black pepper1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus more1medium Yukon gold potato, peeled, chopped2cups chicken stock or low-sodium chicken broth¼cup chopped cilantroPreparationStep 1Heat 1 Tbsp. oil in a large skillet over high. Cook beef, breaking up with a wooden spoon, until browned but not completely cooked through, 5–7 minutes. Transfer to a medium bowl with a slotted spoon.Step 2Reduce heat to medium and add remaining 1 Tbsp. oil to skillet. Cook onion, tomatoes, chile, garlic, cumin, pepper, and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, stirring, until tender but not browned, about 5 minutes. Return beef along with any juices to pan and add potato and stock. Bring to a simmer and cook, stirring and scraping up browned bits, until potato is tender and beef is cooked through, 20–25 minutes. Season with more salt if needed.Step 3Mix in cilantro just before serving.Step 4Do Ahead: Picadillo (without cilantro) can be made 3 months ahead. Transfer to an airtight container and freeze.How would you rate Picadillo?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangleVery good.  My mother made it slightly differently, comino seeds with garlic, otherwise very similiar. SRTexas11/15/2021Love, love, love. This is the ultimate comfort food. I always use 2 poblanos and 2 potatoes, and add a Serrano pepper for heat. The chicken broth/stock you use will really change the salt content, so I start off with 1 tsp. This is such a simple and delicious recipe.AnonymousSan Francisco 7/21/2021Delicious dish but agree that modifications need to be made (less salt, less broth)JSChicago, IL4/19/2021Delicious and will make again! I was inspired by others' comments to make some tweaks -- added a tsp of cumin seeds at the start to the oil to deepen cumin flavor, added olives to the onion, tomato, pepper mixture, stirred in a Tbsp of tomato paste before adding back the beef , cut salt to half, used 1.5 cups of broth, while keeping other ingredients as listed. Like other reviewers commented, the recipe directions do not lead to a dish that looks like the photo (tomatoes will be cooked down, onion and pepper will be more finely chopped). Served with tortillas and sour cream. My family loved it! AnonymousNew York, NY2/28/2021DELICIOUS! It's rare that something so simple can be so life altering. Bumped up the poblanos and added an extra potato, plus some serrano but no other adjustments. It was perfect. Tacos don't feel right when its cold outside, but this does. So comforting and nourishing. Anonymous1/24/2021We thought this was great, if a little greasy.  Made some home made Sonoran tortillas to go with it.  I'm excited about leaving the leftovers in the fridge and seeing if there's a layer of grease to scrape off. Flavor was amazing though.Aja San Diegan in Austin, TX1/22/2021This is a great, versatile recipe. I have made it a few times -- as directed and modified with whatever I had on hand. Poblanos really add nice depth.Mark in PDXPortland, OR1/18/2021Easy, filling, but I felt it needed some tweaks. Double the cumin, poblano, onion and garlic. Added 2 tbls of tomato paste. Like others, cut back on the salt. Finished the dish with fresh lime juice.LynnWoodbury, CT11/20/2020I'm not vegetarian but made this with impossible beef ground round. Absolutely amazing. Highly recommended. AnonymousToronto10/13/2020This is really delicious! I would definitely dial back the salt, especially if you're using a storebought stock/broth that contains salt. I used 1 tsp of Morton and thought that was plenty. Like others, I had a lot of broth left after the potatoes were tender, so I just cranked the heat for about a five minutes to evaporate off the liquid. Goes very nicely with sour cream.AnonymousNew York10/8/2020I've made this twice and it came out great both times. However I did learn some things: using my larger cast iron pan over my non stick ceramic helped a lot with the time needed to reduce the broth. The first time when it says to simmer for 20-25 mins I lowered the heat, and ended up having quite a bit of broth left after 25 mins. Between keeping heat up and larger pan it fully evaporated the broth in 25 mins.  The first time I just let it simmer longer (25 more minutes) and it came out great as well.Michigan10/6/2020Made this pretty much as written though I simmered it for a little while longer to reduce the liquid. Served on flour tortillas with sour cream. It was very tasty.Anonymous9/30/2020Great flavor, and super easy to prepare on a weeknight!  The measurements for broth and salt were way too much, though.  I ended up pouring off a good deal of liquid after 25 minutes.  Next time, 1/2 cup of broth will be plenty, and I'll season with salt as I go.Anonymous9/25/2020This was pretty good. I used ground chicken due to a mix up at the grocery store (my fault). It was good. Served with rice and tortillas. Added jalapeño. I had to cook it for closer to 30 minutes for the potatoes to cook through and the liquid to evaporate. kagagnon10California9/21/2020DELICIOUS!!!  I added a chopped jalopeno, 2 tbsp chili powder, and a 3rd tomato, and served with rice, a cucumber-onion salad, and corn tortillas. Wow.  So simple, so delish!Willie J9/17/2020Explore Bon AppétitMexicanLatin AmericanGround BeefBeefMeatPotatoVegetablePoblano ChileChileYukon Gold PotatoQuickEasyOne-Pot MealsWeeknight MealsMainGluten-FreeDairy-FreeNut-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}