{"id": "7f37b9fff11a6cf2777c3ac0db492952", "url": "https://www.bonappetit.com/story/ashley-rath-the-grill", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "You Need to Know Ashley Rath, the Powerhouse Chef Behind The Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYou Need to Know Ashley Rath, the Powerhouse Chef Behind The GrillAt retro-opulent NYC restaurant The Grill, Ashley Rath is redefining Mad Men-era food and the kitchen culture that went with it.By Priya KrishnaFebruary 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAshley Rath does not like to talk about her success. In fact, she doesn’t like talking about herself much at all. She certainly doesn’t want to be the subject of a profile, and, yet, here she is, running the show as chef de cuisine at The Grill, the high-wattage revamp of gilded New York institution The Four Seasons, and one of the most talked-about restaurants in the city. Despite her modesty, Rath is churning pure magic out of the restaurant’s pristine, white kitchen. She’s responsible for that juicy, truffle-coated guinea hen that Pete Wells called “one of the most delicious things I’ve eaten this year” in his three-star review, the golden-brown crab cake, brimming with tender crab meat and crowned by crisp, golden potato medallions, and the club sandwich, a typically ho-hum country club staple elevated to something extraordinary with an oozy egg, crackly bacon, and crusty, platonic layers of house-made white bread.Rath is 29, with a loose ponytail, big, curious eyes, and an obsessive, hyper-organized personality. In this way, at least, she fits right in at The Grill, where pen lasers are used to perfectly align the silverware on each table. But, in other ways, she’s a surprising presence in a place whose menu and decor evoke the Mad-Men era of NYC restaurants, a time when you’d be hard-pressed to find a woman in the dining room let alone behind the stove.“When I walked in,” she says of her first visit to the mid-century-opulent space, “I was shaking. I couldn’t believe this was my kitchen. It was both satisfying and unnerving.”But even before The Grill, Rath had been a secret weapon for The Grill’s parent company, Major Food Group. She helped with the openings of two of the company’s other wildly successful spots, the coastal Italian restaurant Santina and the neon-clad bistro, Dirty French. She has already made an indelible stamp on the New York dining scene—and she’s only been cooking for seven years.The Grill's steak and anchovy tartare\nPhoto by Daniel KriegerRath, a Syracuse native, initially set out to do non-profit work, studying food sovereignty rights at St. Andrews in Scotland. But when a visa mix-up cannibalized the NGO job she had lined up in India, she ended up in New York, working for a corporate, Sodexo-run restaurant in Midtown. “I had no idea what I was doing,” she recalls. “I had no proper shoes, no knives, nothing.”She wasn’t even sure she wanted to stay in the profession. But then, “I remember one day we had this busy lunch push, and I got this huge adrenaline rush. Yes I was making coconut shrimp at a crappy place but I remember calling my dad and saying, ‘This is it.’”Her big breaks came from line cook positions at Atera, then run by ultra-disciplined chef Matthew Lightner, followed by Gramercy Tavern, where she received the basic culinary education she never had. In 2014, Major Food Group chef and restaurateur Daniel Haar called out of the blue to tell her about a sous chef job at soon-to-open Santina. Haar had met her when she trailed at now-shuttered Torrisi Italian Specialties, and he remembered her inquisitiveness and intensity.“She excelled and adapted and learned quickly,” Haar says. “She possesses maniacal drive to conquer projects.”“I don’t think there’s anything specific about me that people latch onto,” Rath says, characteristically, when asked how she managed to land positions at so many high-profile restaurants. “The way I see it: If you want it, you are going to work in a manner that runs around [the competition] because it’s your life. It’s your thing.”Rath ended up opening Santina and Dirty French within a year of each other. Then Haar asked her to join the opening team of The Grill, first as executive sous chef, then as chef de cuisine, where she has brought to life an exceedingly refined vision of classic Americana at a place where, yes, things cost a lot of money, but it’s hard not to be thrilled by the sparkle and singularity of the meal.When Rath first met with the team about the menu, “Mario [Carbone, one of the owners of Major Food Group] had this really kitschy idea of taking inspiration from Betty Crocker and Campbell’s cookbooks,” she recalls. Rath took all those recipes and updated them to suit her more edited tastes: the mayo-heavy Crab Louis became a lighter, more refreshing Crab Louis with Avocado, the cream-filled Chicken à la King became Chicken à la Queen, with a tangy, red sauce base.The Grill's Lobster à la Newburg\nPhoto by Adrian Gaut“I didn’t want to do anything that was precious,” Rath says. She wanted to make food that she would want to eat in this type of setting. “I like meat. I like fat. I like sauce work. I like the idea that you don’t get a composed plate: If you want potatoes, you have to order them on the side.”Rath is very aware that Major Food Group is a company owned by three men. She hasn’t had any female mentors as a chef, and she’s one of only a few women in the kitchen. But her one female line cook, Megan Holzapfel, says that Rath is “the first female chef I have worked for who really holds her own and takes charge, and who isn’t afraid to do her job with no apologies or tiptoeing around.”The ambience of The Grill is reminiscent of those age-old NYC restaurants whose clientele is still dominated by men in suits, with expense accounts, ordering prime rib and lamb chops. Rath once went out to greet a table of VIPs, and she saw the men do a double-take when she told them that she was the chef. Still, she insists, “I don’t feel my gender in any single way here.” To her, there’s no such thing as “male” food or “female” food. There is just good food, which she wants to provide to every guest who walks through the door.The Grill has been open for almost a year now, and Rath still spends the vast majority of her waking hours there, training staff, perfecting dishes, making sure the restaurant is not only keeping up with its exacting standards, but progressing. Meanwhile, she’s trying to buy her first apartment: a daunting task in NYC. She claims she has no aspirations of opening her own restaurant. “I like running other people’s shows,” she says, convincingly. “Some might call it self-deprecating, but I feel happy and satisfied here. And who wants to take on the financial burden of opening a restaurant in New York?”But Rath does plan to put her own mark on The Grill. She wants to hire more female cooks, and to be the female mentor she never had. And she wants to shape kitchen culture beyond gender, too. “I want a culture where it is not your life to be here, but you are providing life to the restaurant. We aren’t quite there yet,” she says. Her cooks work too many days a week. The quality of life at the restaurant isn’t as stable as it should be. The food needs to keep evolving. Thankfully, she says, hinting at a hidden swagger, “I expect to be here for a very long time.”Explore Bon AppétitHealthyishChefsNew York CityNew YorkRead MorerestaurantsabcV Is the Juice Bar and Cafe We've Been Waiting ForBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Priya Krishna"]}