{"id": "7f4bb96e846270148c6eb092eb6ab379", "url": "https://www.bonappetit.com/story/mushroom-stock", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Mushroom Stock Does What Meat Stock Could Never | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMushroom Stock Does What Meat Stock Could NeverSimple and streamlined, fast and flavorful, good hot or cold or frozen, and best enjoyed…pantsless?By Susan KimFebruary 21, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes and drinks we make with our eyes closed. Today, mushroom stock.A great man once said, “We’re riding the bus to Flavortown!” Indeed, Guy Fieri, indeed. And with this mushroom stock, it’s an express bus. Mushroom stock comes together fast, with only a handful of ingredients—and there are so many ways you can use it. Unlike a stock based on animal protein like chicken or beef, mushroom stock can be enjoyed hot or cold, making it endlessly versatile. I can channel a Laurel Canyon woman dressed in all white and just sip on the warm broth, feeling restored and hoping for peace for the world. But more often than not, on a sweltering hot summer day, I can hunch over my Brooklyn kitchen counter pantless, slurping somen noodles submerged in the icy stock. And this scenario is just as well-executed and satisfying with hot stock on a (slightly) less sweaty day.You only need a handful of ingredients to make a great mushroom stock. First up, mushrooms (to state the obvious), which can be fresh or dried. I always use dried shiitakes for stock-making, only turning to fresh mushrooms in the form of stems, which I’ve saved when preparing fresh shiitakes for other dishes. (I store them in a gallon ziptop bag in the freezer, next to the bag of Parmesan rinds.) But if you want to buy fresh mushrooms for the purpose of making stock, a mélange, like crimini and shiitake, will do. Whether using fresh or dried, just remember that the ratio of ‘shrooms to water is 1 lb. fresh mushrooms or 2 cups dried shiitake to 2 quarts water.The universal stock tenet applies to mushroom stock too: Scraps, like onion skins and butts and parsley stems, are your friends. So throw what you have in the pot. And whether or not you include veggie scraps, I advise that you add a sheet of kombu (a roughly 6\" piece will do) and a couple of peeled garlic cloves. If you eat fish, I also recommend adding 4 large dried anchovies (usually found in the freezer section of your Korean supermarket).Bring everything up to a boil together, then lower the heat and simmer for 30 minutes, until the dried mushrooms and kombu have plumped and the stock is deeply brown from its ‘shroom infusion. After that, kill the heat and cool to room temperature. Strain the stock through a fine-mesh sieve into a bowl, then season with salt, soy sauce, and a dash of fish sauce, if you like.Beyond sipping your broth straight or pouring it over noodles, here are some more applications: Sneak a little bit into a miso-based salad dressing. Use it to make risotto or polenta (if you have those Parmesan rinds, throw them in while the grains cook, too). At my pop-up Doshi, I bloom wakame seaweed in rice vinegar and add it to a seasoned mushroom broth along with slivers of cucumbers. I freeze it before serving to create an almost slushy experience. It's the perfect hot weather antidote—and meat stock certainly can't say that.Explore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-21", "author": ["Condé Nast", "Susan Kim"]}