{"id": "7f5d2ae38bb7e465e2ce78a6efc3824f", "url": "https://www.bonappetit.com/recipe/slow-roasted-onion-dip", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Slow-Roasted Onion Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSlow-Roasted Onion DipBy Andy BaraghaniJune 26, 20184.4(57)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintLike the one you make with the packet of soup mix, but with no weird chemicals and 1,000 percent tastier. While most dips like this require you to babysit caramelizing onions on the stovetop for what feels like forever, our (relatively) hands-off version lets the oven do most of the work. It's kind of counterintuitive, but you want to keep the onions and garlic in a mound on the sheet pan rather than spreading them out; this allows them to steam and soften without browning too quickly.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonSpatula$12.99 At AmazonMedium Bowl$17 At AmazonPlatter$29 At AmazonIngredients4 servings1½lb. mixed onions (such as sweet, yellow, and/or red)4garlic cloves, unpeeled¼cup extra-virgin olive oilKosher salt1½cups plain whole-milk Greek yogurt2tsp. fresh lemon juiceFreshly ground black pepper1bunch radishesPotato chips and cayenne pepper (for serving)PreparationStep 1Preheat oven to 400º. Peel and trim ends off 1½ lb. mixed onions. Cut in half lengthwise. Place halves cut side down on cutting board, then thinly slice.Step 2Line a rimmed baking sheet with parchment paper. Toss onion and 4 garlic cloves with ¼ cup oil and 2 Tbsp. water until evenly coated. Season with salt and toss again until well coated. Mound onions and garlic in center of sheet pan rather than spreading them out; this allows them to steam and soften without browning too quickly.Step 3Bake, tossing and stirring onions every 10 minutes, until all onions are golden brown and softened, 40–50 minutes total (some onions will brown more than others but that’s okay!). Let cool.Step 4Transfer onions and garlic to a cutting board and squeeze out garlic cloves from peel. Using the flat side of a chef’s knife, smash garlic cloves to a paste. Transfer to a medium bowl.Step 5Finely chop caramelized onions and transfer to bowl with garlic.Step 6Add 1½ cups yogurt and 2 tsp. lemon juice; season with salt and lot of pepper. Stir to combine.Step 7Cut 1 bunch radishes in half and arrange on a platter. Sprinkle dip with cayenne pepper. Serve radishes and chips alongside.How would you rate Slow-Roasted Onion Dip?Leave a ReviewTell us what you thinkReviews (28)Back to TopTrianglei've found my forever onion dip recipe. everything about this was perfection. the onions definitely took a lot longer than the recipe stated to get them close to the color in the picture, almost 2 hours. so freaking worth it. i mixed a red, yellow, and sweet onion for this. alyssawest long branch, nj1/20/2022We always caramelize onions on the grill in a cast iron skillet. Just be very, very careful when removing the screaming hot pan from the grill. A length of black iron pipe slid over the handle works for us. The onions get very brown, very fast, and the oil that they cook in is fantastic, also. foundrygirlSeattle, WA1/2/2022No. Just no. Those onions in the picture for the dip look anemic and not even what I would call “grilled,” let alone caramelized. I want jammy, sweet (without even adding sugar) onions where you start with a heaping pile and end up with scant little bowlful. I find nothing tedious about making them on the stovetop. I do it on medium heat for the first 10 minutes, covered. And then lower the heat and let them go for almost 2 hours, stirring every 15 minutes. Oh, and a bonus tip: making them in a cast iron skillet keeps your pan seasoned and slick as nonstick.Jacki GanschColumbus Ohio6/14/2021This looks wonderful and easy, and I do intend to try it, but... I'm looking at this for the 1st time in early June. Think I'll wait until at least Sept before I crank the oven to 400 for 50 mins.Dan WConnecticut6/7/2021SO good and easy. Highly recommend lizMontreal 11/21/2020I liked this recipe. I did the onions in a dutch oven on the stove top instead of in the oven, and let them go for almost 2 hrs. I feel like they're less work then doing them in the oven, tbh. Added more acid then called for. Will make again!AnonymousPhiladelphia10/6/2020Giddy up good! No alterations to the recipe except added some julienned zucchini and sweet peppers from the garden for dipping. Let it season for a few hours in the fridge. Made it to take to a gathering, about half of it made it there. RobustogolfKingston, Ontario8/24/2020Very tasty and easy to make. Onions worked in the oven but did take ~70 minutes. Amped up the lemon as others suggested and added some South African Smoke mix from Trader Joes and old bay for seasonings before letting it hang out in the fridge for a few hours (magic). Sprinkled chili powder and paprika on top to serve.honeysrirachapleaseBrooklyn8/22/2020I enjoyed it, i did 2 tablespoons of lemon and cooked the onions for about an hour.  I think the greek yogurt flavor was a little strong.Anonymousseattle, wa6/14/2020This was so delicious and so easy. I did have a few problems with my onions burning on the tips so I needed to toss more often. sarahmaeveHouston 6/4/2020Mine also turned out quite 'sweet'. I came around to the flavour, but it's definitely not anything like the MSG/salt punch you get from the soup mix kind of dip. Which is totally fine, of course. I roasted my onions and garlic for a bit longer than called for in the recipe until they looked like the gif, so I wouldn't be afraid to go a bit longer if yours still look very blond.AnonymousNew York4/22/2020effin bomb recipe. so simple but so satisfying. niccsuxSingapore3/1/2020Made this for a NYE party, and it was a huge hit. The AirBnb I was in didn't have real knives which was a struggle, but I made it work. Onions didn't get chopped as finely as I would have liked, but it was still pretty great. Served it with Ruffles :)AnonymousColumbia, SC1/11/2020Love this recipe and just made it for a 2nd time. I've made a couple modifications: \n1. Instead of a sheet pan, i'm using a Le Crueset 7\"x10\" rectangular dish. This keeps the onions piled together, and allows water/oil to stay in place. When I used the sheet pan it spread under the parchment paper and made a big mess. \n2. I used 2 cups of yogurt: Fage 5% is great!\n3. I increased lemon juice to taste... probably closer to 4/5 tsp\n\nEnjoy!MaineChef12312/31/2019This was a game-changing caramelized onion technique for me, but my Trader Joe's yogurt was just too sweet up against the sweet onions. I added a ton of pepper to counter it, but next time I'll do sour cream as the base instead. alexbeggsBon Appétit 12/11/2019Explore Bon AppétitDipCalifornia CuisineAmericanOnionVegetableEasySnackStarterGluten-FreeNut-FreeVegetarianRoastSuper BowlDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Andy Baraghani"]}