{"id": "7f72784b697e6b7319ad488e981786ee", "url": "https://www.bonappetit.com/story/creamy-ricotta-egg-sandwich", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "Expand Your Egg Sandwich Horizons with Ricotta and Focaccia | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingExpand Your Egg Sandwich Horizons with Ricotta and FocacciaAll kinds of creamy-tangy-custardy things are happening here.By Alex BeggsJune 21, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailMolly Baz’s eyes welled up and she let out a devastating uggggh. “I mourn the loss of the place every day of my life!” She was referring to the Brooklyn restaurant Saltie, which closed in 2017, and used to serve the famous Ship’s Biscuit breakfast sandwich. It was all creamy soft-scrambled eggs and oozing ricotta on “salty AF” focaccia, per Molly—a truly delicious mess. To pay homage to the gone-but-not-forgotten sandwich, she developed a recipe that nods to it, while adding a few other elements that make it something 🆕.Your base: FocacciaSelf-explanatory. Spongy. Salty. Airy.Layer one: RicottaTangy-creamy ricotta is near perfect already, but Molly adds a few cranks of shredded Parmesan to give it salty depth and a touch of funk. Oh, and some lemon zest and grated garlic for bonus points. (This is your microplane’s time to shine, people!) Think of the (best) sauce on a white pizza, it’s kind of like that.Layer two: Soft-scrambled eggsLow heat, custardy curds of eggs are what we’re going for. Like Saltie’s version. The soft fluffy eggs end up a similar texture to the ricotta, so they mix together harmoniously. Lovely.Zoomvision.™\nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaLayer three: Green onionsWe cut them all rustic to get bites of the sweet onion bulb here and the vibrant greens there. The bulbs get sautéed in butter before adding the greens with white wine vinegar and water, which will soak into the onions and turn them soft and jammy* (yes this is our favorite word lately). They end up sweet but acidic, with a nice spicy bite to stand up to the egg-ricotta business. Finally, we construct the sandwich open-faced to make it easier to shovel into your mouth. Thinkin’ bout u.Get the recipe:The Soft Scramble SandwichTo get the most flavor out of this open-faced breakfast sandwich, look for spring onions with round bulbs and very tender dark green stalks.View RecipeExplore Bon AppétitBreakfastEggRicottaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-21", "author": ["Condé Nast", "Alex Beggs"]}