{"id": "7f73b9e02e23dd482b020ecb4ef72807", "url": "https://www.bonappetit.com/story/coming-of-age-meatball-sub", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "You Only Get One Coming-of-Age Meal. Mine Was a Meatball Sub | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Only Get One Coming-of-Age Meal. Mine Was a Meatball SubThe first time I was permitted to stay home alone, it was just me, basketball, and the best dinner ever.By Adam RapoportFebruary 14, 2019FacebookTwitterEmailPhoto by George SilkFacebookTwitterEmailOkay, so I realize this might not be the most obvious opening line for an essay in a food magazine, but do you remember where you were when Lorenzo Charles grabbed a last-second air ball and dunked it, lifting one-in-a-million underdog NC State over Hakeem Olajuwon, Clyde Drexler, and the University of Houston in the NCAA men’s basketball championship game?I do. Spring break. 1983. I was sitting on one of those cheap fire-retardant sofas in a condo in Park City, Utah. By myself. I was 13 years old. And I’m pretty sure I had never been as happy as at that moment.Earlier in the evening, my parents announced that they would be going out to dinner and, if I wanted to, I could hang back and order takeout.If I wanted to. Ha! Are you kidding me?I was at that age where I was young enough to think that going on vacation with my parents was still cool (my older brother and sister, on the other hand, opted to stay home in D.C. that week), but old enough that I craved some me time.So, yes, you’re damn right I stayed home that night. And for my coming-of-age meal, I called the local pizza joint and ordered a meatball sub, a side of fries, and an extra-large Coke. I still remember peeling open the foil on the hero, the red sauce soaked into the soggy roll, the sheets of melted mozzarella cloaking the plump, moist meatballs. No disrespect to my mom, who is a legit home cook, but I had never tasted anything so satisfying.All these years later, that moment continues to resonate with me for two reasons, neither of which has anything to do with NC State coach Jim Valvano frantically running around the court, looking for someone to hug.For one, as I’ve mentioned in my editor's letter before, I still love to dine alone—with my thoughts, with my particular food proclivities (why, yes, I will eat that entire take-out container of chicken fried rice, thank you very much), and with no one to please but myself.Room service, anyone?\nPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ANNA BILLINGSKOGBut perhaps more significantly, I now have a son, who just turned 11. And for the past several years, my wife and I have taken him on a spring break ski trip to Jackson Hole, Wyoming.Last March, for the first time, Marlon started asking for “Home Alone” time. Simone and I weren’t sure what to do. Was he too young for us to leave on his own? What if we went out to dinner someplace really close by? He could just FaceTime us on his iPad if he needed to, right?Cautiously, we gave it a shot. We snuck out a few doors down, and we told Marlon he could order whatever he wanted from room service—which turned out to be a cheeseburger and fries, along with an ice cream sundae (smart kid).It all went off without a hitch—so well, in fact, that when we return to Jackson later this month, Simone and I might steal away to Teton Thai or Il Villaggio Osteria. Marlon will get his Home Alone time and we’ll get our dinner and cocktails, no babysitter required. What’s not to like?Well, maybe the notion that day by day, our cute little kid no longer wants to spend every waking minute with Mom and Dad. But I have to believe that years from now, Marlon will look back on these trips to Jackson, and he’ll remember some very specific things. Though probably not at all what Simone and I expect him to. Because, as any parent knows, we don’t get to control that. We just get to go on vacation with our kid. At least for a few more years, while we’re still cool enough for him.Explore Bon AppétitLetter From The EditorRead MoreNeed to Get Some Real Work Done? Have a Glass of Wine at LunchBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-14", "author": ["Condé Nast", "Adam Rapoport"]}