{"id": "7f7b9f50640b25f6967a05ef2b907ced", "url": "https://www.bonappetit.com/story/best-baked-goods-to-freeze", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Best Baked Goods to Freeze When You're Baking A LOT | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingI’ll Be Baking A LOT Over the Next Few Weeks—Here’s My Plan to Keep It Under ControlI'm giving myself one non-negotiable rule.By Sarah JampelMarch 18, 2020FacebookTwitterEmailFacebookTwitterEmailAmidst all of the strangeness and uncertainty of this time lies a relatively trivial catch-22: I’ve never had more time to bake but I’ve also never had fewer people to bake for.Typically I bake on the weekends, distributing what I’ve made to friends who come for dinner later in the week, sending stuff with my partner to his office, or foisting some on willing co-workers. But in this new reality, I find myself opening my pantry and considering the option of cookie dough on a Tuesday or a loaf of banana bread when I’m up at 3 a.m., thoughts racing. And though I’ll drop care packages at the doors of the other two apartments in our building and walk some cookies to friends in the neighborhood, my distribution pool has significantly shrank.Which is why, for my own sanity and for fear that I’ll eat a whole tray of brownies in the course of one virtual meeting (yes, that’s me you see snacking in the corner), I’m instituting a new rule for myself: I’m only baking what I can freeze. That includes the stuff that freezes well raw (like biscuits/scones, cookies, and—don’t judge me—choux pastry) or thaws nicely once baked (muffins, unfrosted cakes, brownies).If you’re in the same boat—itching to bake but worried about a spree that’s going to overload your kitchen table with piles of pastries, like that Christmas morning scene in Little Women— maybe these tips on what freezes well (and how to do it) will help. But if you only learn one thing, it should be this—in general, slice before you freeze so that you can grab a portion or two without having to thaw a big mass.Here’s what I'll be freezing:Cookie doughTo me nothing says self-care quite like baking off one singular cookie (if you don’t want to waste energy, do it while your oven’s still hot from making dinner, or use a toaster oven if you’ve got one).My general rule is that any cookie you can shape (so not macarons or Florentine or anything runny or super delicate like those)—whether it’s in a log or a ball—will freeze well. For scooped cookies (like chocolate chip, oatmeal raisin, double chocolate), freeze the balls on a baking sheet—they can be packed shoulder-to-shoulder since you’re not worrying about spreading as they bake. My freezer is tiny (and full), so I usually do this in batches using a quarter sheet tray. Once the balls are frozen solid, transfer to a resealable plastic bag (you can rinse it out and reuse it later) or a freezer-safe container. I bake them straight from frozen, knowing they might take a couple minutes longer in the oven.Slice-and-bake cookies, like these Roasty-Toasty Pecan Caramel Shortbread, will serve you well.\nPhoto by Laura Murray, Food Styling by Susan SpungenFreeze a slice-and-bake cookie (like shortbread) in its log shape. Let it thaw in the refrigerator before slicing, lest it crumble or crack. For cut-out cookies, like sugar cookies or linzers, freeze the dough after you roll it into sheets. Keep the layers separated by parchment, nestle them onto a baking sheet, and wrap the whole set-up in plastic wrap.Shaped biscuits and sconesOnce you’ve shaped them, freeze them on a baking sheet until solid, then transfer to a bag or airtight container. Since these rely on cold butter to rise and puff, they’ll benefit from going straight from the freezer to the oven. Save the final step of brushing with cream or melted butter for when you’re ready to bake.A good idea: a bag of Sour Cream and Onion Biscuits in the freezer.\nPhoto by Laura Murray, Food Styling by Susan Spungen Pie doughYou can freeze pie dough once you’ve rolled it out and transferred it to the pie plate, but I prefer to freeze it in a disc, wrapped in plastic wrap and sealed in an airtight bag. That way, I’m not clogging my freezer with a precarious dish or limiting myself—I can use that dough for galettes, hand pies, double-crust pies, etc. I let the brick of dough thaw overnight in the fridge, at which point it’s pliable enough to yield to a rolling pin.I’m planning to make a couple batches of Carla Music’s Flaky Pastry Dough so I can use it for savory dinner galettes. I also keep a pint container of pie scraps (a.k.a. the trimmings) in the freezer—sprinkled with raw sugar and baked straight from frozen in a 425°F oven, they’re the perfect not-too-sweet-but-very-buttery treat.There's a 0/100 chance that any of my galettes will look this good.\nPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiMuffins and loaf cakesFreeze these once they’re baked and fully cooled (otherwise, the heat from the wrapped cake will result in condensation and a gummy, wet exterior). I pile cool muffins into a tupperware or freezer bag so that I can grab a couple to temper in the fridge overnight (or at room temperature if I forget to do that).Sometimes I freeze loaf cakes whole, wrapped in a few layers to shield it from freezer burn. It's generally better to freeze \"naked\" loaves—save the glaze/frosting/icing for when you're ready to serve. Most often, though, I’ll slice the cake and freeze the individual pieces so that I can snag just one without having to wait for the whole mass to soften.For sake of neatness and deliciousness, it's better to freeze this carrot loaf unfrosted.\nPhoto by Chelsea Kyle, Food Styling by Pearl JonesBaked brownies and blondiesYou can freeze the whole block, well-wrapped, but—maybe you’re sensing a theme here—I like to slice it first so that it’s easier to grab one or two portions. I’ll happily eat brownies and blondies straight from the freezer (call me crazy), but you can thaw them to your heart’s content. Once thawed, warm it in the oven and top with a scoop of ice cream? Just a thought!I'll take a Camouflage Chocolate Fudge Brownie straight from the freezer, thank you. \nPhoto by Laura MurrayBreadMaybe you made focaccia for the first time? Congratulations! I am excited for you. Since it has a short shelf-life at room temperature, I like to store it in a plastic bag (again, wash it out and re-use it) for just a day or two before transferring it to the freezer. Since it has a tendency to dry out, I find it’s best to reheat it in a 300° F oven wrapped in foil (or in a covered oven-safe dish) until it’s warmed through. I’ll then uncover it to let it crisp up slightly. Perfect with soup! Or for sandwiches!Focaccia on demand!\nPhoto by Laura Murray, Food Styling by Susan Spungen One day, I’ll have friends over again and I’ll break it out of the freezer and we’ll all eat the focaccia with eggplant parmesan for dinner and I’ll make a peach pie for dessert. For now, though, I take small comfort in knowing that my freezer’s fully stocked with brownies and cookie dough, for myself today and for myself and my loved ones in the future.Explore Bon AppétitBasically BakingCoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-18", "author": ["Condé Nast", "Sarah Jampel"]}