{"id": "7f7d872de76cb47ce5de6e5c8612377f", "url": "https://www.bonappetit.com/recipe/chinese-broccoli-with-soy-paste", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Chinese Broccoli With Soy Paste Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueChinese Broccoli With Soy PasteBy Lisa Cheng SmithNovember 19, 20193.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintThe sweet and salty flavor of the soy paste really shines here, so use the best-quality one you can find. We like Yu Ding Xing’s glutinous rice soy paste. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 servings1lb. Chinese broccoli or broccolini, trimmed, cut in thirds crosswise¼cup soy paste (such as Yu Ding Xing)PreparationStep 1Set a steamer basket in a large pot filled with 1\" water, cover pot, and bring water to a boil. Add broccoli to steamer basket, cover pot, and steam broccoli until crisp-tender, about 5 minutes.Step 2Meanwhile, whisk soy paste and 2 Tbsp. water in a large bowl.Step 3Arrange broccoli on a platter and drizzle sauce over.How would you rate Chinese Broccoli With Soy Paste?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI'm unable to access other reviews. BA website is terrible.Anonymous1/16/2022Explore Bon AppétitChineseEast AsianAsianBroccoliVegetableQuickEasy5 Ingredients or FewerSideVeganVegetarianDairy-FreeNut-FreeHealthyishSteamLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}