{"id": "7f8e18fc89756efe4dd272275b24d848", "url": "https://www.bonappetit.com/story/eggplant-dip-for-dinner", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "This Eggplant Dip is Absolutely an Acceptable Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rent Week Eggplant Dip is Absolutely an Acceptable DinnerEmbrace the dip-as-dinner lifestyle, starting with this sweet and sour eggplant number.By Alex DelanyJuly 10, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailA dip is no fair weather friend. Dips have always been there for me. Summer party on the roof? Dips. In charge of the appetizer spread for any major holiday back at my parents’ house? Dips. A second date that somehow turned into me hosting cocktail hour at my place? Dips. Dinner on a Rent Week Tuesday night? You guessed it. Dips. I make dips more than I make anything else. I promise you that’s true.A dip can be anything you want it to be—and that includes dinner. And when you use a budget-conscious base—say...eggplant (which is, for the most part, unbelievably affordable)—it’s a Rent Week home run.Most minds turn to baba ghanoush when eggplant dip is mentioned. But mine goes to Sicily, and more specifically to the sweet-sour-bright-fresh Sicilian dish called caponata. If you’re familiar with the dish, you’ll know that it isn’t actually a dip, but as I do with almost any dish, I like to translate it into one, which is how we’ve ended up with a caponata-ish dip for this month’s Rent Week recipe.So first, throw on this Any Time playlist (good for any day of the week, any time at all and completely free of charge) that I made for you. Then, preheat your oven to 450°, and let’s talk eggplant.Eggplant is one of those vegetables with a seasonality that is often overlooked. Oh, there are eggplants at the store all year? That means they’re good all year, right? Nope! Very wrong. You should really only eat eggplant between July and October if you want superior flavor (not bitter) and texture (yieldingly soft but not spongy or seedy). We’re at the beginning of that season right now, so you’re in the clear.Use a fork to poke some holes in 2 large eggplants (or 3 medium eggplants) and place them directly on the grate of your oven. You can do this without worrying. Right on there. Trust me. This technique encourages even, expedited cooking by allowing the hot air circulate to all the way around the eggplant. Just make sure to put some sort of tray on the grate below to catch any drippings, unless you’re the type who likes smelly, smoky, burnt eggplant juice on the bottom of your stove (...who are you?). Roast the eggplants for about 30 minutes, rotating about 15 minutes in.While the eggplants cook, sauté some aromatics. Finely chop 1 large shallot and 3 cloves of garlic, and cook them until tender and just barely browned in a skillet with olive oil over medium heat. Remove the cooked shallots and garlic from the pan and save for later.Now, caponata is all about that beautiful Italian flavor known as agrodolce, literally translating to sour-sweet, so we’re going to season this dip accordingly. Mix 2 Tbsp. of honey (sweet!) and 5 Tbsp. of red wine vinegar (sour!) in a small mixing bowl. Finely chop 3 sprigs' worth of basil leaves, plucked from the stems. Save 1 basil sprig for garnishing the dip.Photo by Chelsie CraigTime to check on the eggplants. You’ll know that they’ve finished cooking when the skins look dried (and even burnt) and the body looks deflated and shriveled. Remove them from the oven, slice off the ends with the leaves, and allow them to cool until they're cool enough to handle.Peel the eggplant skin away with your hands, making sure to get as much of the flesh as you can into a large bowl. Season the eggplant with kosher salt and chile flakes, and add the vinegar-honey mixture, chopped basil, ¼ cup Greek yogurt, a couple glugs of olive oil, and the sautéed alliums into the bowl. And here’s where it gets a little messy. Use your hands to mix and shred the eggplant. Some people might throw this all in a food processor, but I like a less incorporated eggplant dip. (They call that rustic in restaurants, right?)Transfer the dip to a shallow bowl and top with olive oil, black pepper, flaky salt, and some more chile flakes. Pick some basil leaves and sprinkle them down upon your creation like some kind of artist.Crudités. Pita. Chips. Pita chips. Whatever makes you feel the most like a human being eating a totally acceptable dinner will do the trick. Know yourself. Know your dip. And know that if you embrace the dip-as-dinner lifestyle, it will never let you down.Not into dips? Get into crunchy vegetables instead.I Happily Eat This Crunchy Rent Week Veggie Recipe at Least Once a WeekSteamed rice topped with crunchy, gochujang-dressed veggies never leaves the menu.View StoryExplore Bon AppétitBasicallyRent WeekEggplantDipRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-10", "author": ["Condé Nast", "Alex Delany"]}