{"id": "7f996208c4de45c919077111bf9f1c32", "url": "https://www.bonappetit.com/story/best-chicken-to-buy", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "This Is the Best Chicken to Buy at the Grocery Store | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy the Best Chicken at the Grocery StoreOrganic? Cage-free? Air-chilled? What does it all MEAN?! Let's break it down.By Alex DelanyFebruary 20, 2018FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailThere you are again: standing slack-jawed and confused in the chicken section of the grocery store, squinting under fluorescent lights and shivering from the cold. How is it possible that there could be so many different kinds of chicken, each characterized by different incomprehensible words. Organic. Cage-free. Air-chilled. What does it all mean??At this point, we know that the best chickens are the ones that have the freedom to run around fields, eating worms and bugs and all that good stuff. They taste better, have more developed muscles, and a generally higher quality of life. If you can buy a top-notch whole chicken from your farmers market, specialty butcher, or trusted grocer, that's amazing. But they can get expensive, and sometimes you just want a damn chicken for dinner without all the work of hunting down the perfect bird.And that's why knowing what the words on the chicken packaging mean—and which ones don't mean anything—is important. It's the difference between a tasty whole roast chicken and a ho-hum one. Here's what everything on that grocery store poultry package means:OrganicThat familiar USDA Organic logo means that the chicken you're looking at was fed organic feed and at least had access to the outdoors. That's cool! As a general rule, we like to keep chemicals out of our food as much as possible, so we seek out organic chicken whenever possible. That's the way nature wanted you to enjoy chicken. Probably.Antibiotic-Free and Hormone-FreeHormone-free chicken doesn't really mean anything—the USDA actually prohibits the use of added hormones in poultry, so it's all supposed to be hormone-free. Antibiotics, on the other hand, are allowed, so that antibiotic-free designation means that you're not going to end up eating any weird chicken medication when you eat that chicken. If you see the USDA Organic label on an antibiotic free bird, you know it's an honest claim. Which is a good thing, we think. You're not a chicken! No chicken medication for you!Cage-FreeWhat do you think about when you hear the words cage-free? Chickens with great health insurance and paid maternity leave, running through sunny, sprawling fields? Probably. But guess what: Cage-free doesn’t actually mean anything. Most meat chickens (unlike egg chickens) don’t really live in cages, even in big factory farming operations where they're all cooped up in some scary windowless warehouse. That's still \"cage-free\"! This is a throw-away term.Free-RangeFreedom ain't free. Or guaranteed, if you're a chicken. Free-range doesn’t necessarily mean that your chicken was raised in a pasture (only that it had access to one). So this term could mean very good things for chicken...or kind of not that much at all. Again, it comes down to your trust in the person selling you the chicken.An air-chilled bird, looking real tasty.\nPhoto by Alex LauAir-ChilledYou should always buy air-chilled chicken. The process of air-chilling a chicken means that, after it was slaughtered and de-feathered and all that, it was cooled by hanging in open air, not by being submerged in cold water. The water-chilling process causes the chicken to take on added water weight, which ultimately dilutes the flavor of the meat—less than ideal. Air-chilled birds are going to have a lot more flavor, so that's kind of a non-negotiable.Kosher or HalalRegardless of your religious beliefs, you've probably eaten kosher or halal meat, and when it comes to chicken, kosher and halal birds are pretty easy to come by. Kosher and halal chickens are raised, slaughtered, butchered, packaged, and prepared in accordance to Jewish and Islamic (respectively) culinary laws. If you aren't at a specifically kosher or halal butcher shop, the distinction will be clearly labeled on the package. What's important to remember here is that the words kosher and halal are not necessarily an indication of quality on their own. Some might be better than your average bird, some might be just whatever, so it's still a good idea to read the other words on the package.NaturalNatural can mean whatever you want it to mean. There aren't any regulations on using the word, so it doesn't really tell you anything. The chicken was raised in nature? Natural. The chicken was raised on a diet of organic, handmade pasta? Natural. The chicken was born with a gift for basketball? A natural. This means everything and nothing at the same time.The Bottom LineIn the best case scenario, you're going to walk away from the grocery store with an organic, antibiotic-free, air-chilled, free-range chicken. But if your grocery store isn't packing that kind of heat, at the very least, you should buy air-chilled chicken. That's an absolute must for us in the wide world of chicken. Oh, and your whole chicken should clock in at between three and four pounds. That size gives you the best chance of success for a tender, flavorful, manageable bird. And that's what life's all about, right?And here's what to do with that bird:No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitBasicallyChickenroast chickenShoppingGroceryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-20", "author": ["Condé Nast", "Alex Delany"]}