{"id": "7fae6a2438da1dfeb7ec250a73aa3e0c", "url": "https://www.bonappetit.com/story/super-green-latte", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "This Super Green Latte Blend Is Just Like My Amma’s | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Super Green Latte Blend Is Just Like My Amma’sKola Goodies’s Super Green Latte mixes herbs and plants like gotu kola and moringa for the perfect morning boost.By Zinara Rathnayake August 6, 2021FacebookTwitterEmailPhoto by Emma Fishman, styling by Allie WistFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Some mornings I long for kola kanda. When I was a child, my amma would make this drink, a traditional Sri Lankan herbal beverage with a porridge-like texture and a rich, herbaceous taste. ”It gives you brain power,” she’d say, serving it with a piece of jaggery as a treat. But I’ve never attempted replicating my childhood morning ritual because, like most good things, making kola kanda takes time: Amma would boil rice, scrape fresh coconuts and squeeze their meat for milk, and blend and boil leafy greens like gotu kola, moringa, and curry leaves. So when I came across Kola Goodies’s Super Green Latte, I was thrilled. I finally found a piece of home.Super Green Latte is a powder blend of Sri Lankan kola kanda that mixes organic coconut milk powder, oat milk powder, gotu kola, moringa, and cinnamon. I confess: I had never come across a kola kanda blend before, so I was cautious about how it would turn out. But the Super Green Latte was exactly what I was looking for; it’s just creamy enough and tastes fresh. You don’t usually need any sweetener because there’s monk fruit sweetener in it. The oat milk powder is also a great substitute for rice and helps froth up the drink nicely.Like me, Kola Goodies founder Sajani Amarasiri grew up drinking her amma’s kola kanda at home in Colombo. “Amma told me when they were young, she’d watch grandma and learn how to make it,” Amarasiri says. “She would use a pestle and mortar for grinding. Back then they didn’t even have blenders.”But when she came to the U.S. at 19 for college, she couldn't find her family’s morning drink in stores. Ever since, she’s been trying to recreate it. The result is the Super Green Latte. “Gotu kola and moringa [are] the main heroes,” Amarasiri says of the herbs and plants in the list of ingredients, which taste slightly bitter and have a mild, grassy scent. “We got it sourced from Matale when we visited farmer families during [a] trip to Sri Lanka.”More than anything, I love how easy it was to recreate my amma’s traditional drink, especially for a nice energy booster in the morning. You just have to add two tablespoons of powder with a half cup of hot water, stir it well, then add another half cup of hot water. If you are looking for something creamier, substitute water with a half cup of warm coconut milk. The blend takes hours of labor out of the traditional process, and now when I’m homesick, I can make myself a glass of kola kanda anytime.Photo by Emma FishmanKola Goodies’s Super Green Latte$26 at Kola GoodiesExplore Bon AppétitShoppingHighly RecommendLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-06", "author": ["Condé Nast", "Zinara Rathnayake"]}