{"id": "7fb14d766cb4c36563f61c4e85b93349", "url": "https://www.bonappetit.com/recipe/roasty-toasty-pecan-caramel-shortbread-cookies", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "Roasty Toasty Pecan-Caramel Shortbread Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasty Toasty Pecan-Caramel Shortbread CookiesBy Molly BazMarch 1, 20204.3(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan SpungenEmailPinterestPrintEmailPinterestPrintThe deep, nutty flavor of these tender, buttery shortbread (the fourth recipe in the Basically Guide to Better Baking!) comes from pulverized pecans and store-bought dulce de leche, a confection of sweetened milk cooked down until it's the consistency of caramel sauce. You can find it in a can, near the evaporated and sweetened condensed milks, or in a jar, near the jams. We love the contrasting look of white nonpareil, but feel free to roll the dough in raw sugar or in whatever sprinkles you please. Questions about the recipe? Head to our baking forum and receive a response from one of us or a fellow baker. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketFood Processor$49 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSpatula$12.99 At AmazonParchment Paper$3 At AmazonSmall Bowl$13 At AmazonPastry Brush$9 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonWire Rack$23 At BA MarketIngredientsMakes about 24⅓cup (47 g) pecans1½cups plus 2 Tbsp. (188 g) all-purpose flour3Tbsp. sugar½tsp. kosher salt1cup (2 sticks) chilled unsalted butter, cut into ½\" pieces¼cup plus 1 Tbsp. store-bought dulce de lecheWhite nonpareil or raw sugar (for rolling)PreparationStep 1Place racks in upper and lower thirds of oven (or in middle of oven if you have only 1 baking sheet); preheat to 325°. Toast ⅓ cup (47 g) pecans on a rimmed baking sheet (on the upper or middle rack), tossing halfway through, until fragrant and golden all the way through (check by breaking one in half), 10–12 minutes. Transfer to a food processor; let cool. Reserve baking sheet. Keep the oven at 325° for baking the cookies.Step 2Pulse pecans until very finely ground (be careful not to go too far or you’ll have nut butter). Add 1½ cups plus 2 Tbsp. (188 g) all-purpose flour, 3 Tbsp. sugar, and ½ tsp. kosher salt; pulse once or twice just to combine, scraping down sides as needed.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3(PAUSE: Is your butter cold? It should be straight-from-the-fridge cold.)  Cut  1 cup (2 sticks) chilled unsalted butter into ½\" pieces, add to food processor, and pulse in 3-second-long bursts, scraping down sides as needed, until dough begins to come together in large clumps. Add ¼ cup store-bought dulce de leche and pulse until dough comes together into a single mass and no streaks remain.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Transfer dough to a sheet of parchment paper (plastic wrap also works here) and use your fingers to pat it down into a rectangle. Don't worry if it's a bit sticky—it's going to firm up when you chill it—but if you're having trouble, lightly flour your fingers. If the dough is still too sticky to work with, transfer it to the fridge for 10 minutes, or until firm enough to handle. Fold parchment up and over dough and use it to press and roll the dough into a 9\" log (about 2\" in diameter). A bench scraper will help you shape the dough into a straight, even log, but if you don't have one your hands will work just fine. Roll up tightly and chill 90 minutes, or freeze 20 minutes.Step 5Mix remaining 1 Tbsp. store-bought dulce de leche and 2 tsp. water in a small bowl; it should be a pourable consistency.Step 6Spread an even layer of white nonpareil or raw sugar on reserved baking sheet.Step 7Using a pastry brush, very lightly brush outside of chilled dough with the thinned dulce de leche (this will help the sprinkles to adhere).Step 8Roll log in sprinkles, pressing gently to help them stick, until evenly coated. Transfer log to a cutting board. Discard remaining sprinkles or save for another use; line 2 baking sheets with parchment paper (or just 1 if that’s what you’ve got).Step 9Slice dough into ¼\"-thick rounds with a sharp chef's knife, rotating log about a quarter of a turn after every 3 or 4 slices to ensure that all of the slices have a nice round shape.Step 10Place cookies on prepared baking sheets, spacing 1\" apart (if you have 1 only baking sheet, do this in batches, making sure to let the sheet cool between batches—running it under cold water will speed up the process). Freeze 30 minutes so dough can firm back up (this helps the cookies hold their shape when baked).Step 11Bake cookies, rotating baking sheets top to bottom and front to back halfway through (or just front to back if using 1 baking sheet), until golden brown around the edges, 20–24 minutes. Let cookies set up slightly on baking sheet, then transfer to a wire rack to cool  completely (cookies will firm up and get crispier as they cool).Step 12Do ahead: Log of dough can be made 2 days ahead. Keep chilled.How would you rate Roasty Toasty Pecan-Caramel Shortbread Cookies?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleDelicious cookies, toasty and crispy and not too sweet, but definitely taste indulgent. Came together super easy. Let them chill (both steps) a little longer than called for, because I was doing other things, and they turned out perfect. No spreading. The nonpareil gave a pleasant crunch around the outside. Used weights for all measurements, and used homemade dulce de leche. Will make again! JessJericho, VT12/2/2020This recipe does not work.  I have tried it 3 times.  First 2 times by measure, third time I weighed everything.  It still went completely flat.  Either to much butter or too much flour.AnonymousToronto, Ont. Canada 11/5/2020Ok so this was great when i made it the first time and great when i made them just this week but i didn't have pecans and dulce. I substituted Hazelnuts and Nutella. Im pretty sure i could swap for most nuts and most sugary goos and it would always work. Erin PereiraSOuthlake Texas4/19/2020Flavor: outstanding. Aesthetic look: 100%. Texture: brilliant! Technique: a little off.\n\nEven after freezing the cookies/tray for 60 minutes, I had major problems with spreading, as many others did in the reviews.\n\nAfter a few tweaks, here’s what cured the spreading issue: 300 degree oven, bake 8 minutes, turn the tray, bake another 4 minutes. Perfect cookies. EVVMinneapolis, MN4/19/2020Amazed at the depth of flavor in these with so few ingredients! Any tips from the BA team on why some of us using turbinado sugar are getting a flattened runny edge? taraIL618204/15/2020I have made these twice so far and they are quite good, but not my most-favorite cookie (but maybe they will be yours!) I definitely think they get better by the second day. Texture is great and quite flavorful. I used blue sanding sugar for the outside of mine. AnonymousSeattle, Wa4/14/2020Would make again\nAnonymous208504/13/2020These cookies have flavor depth. The pecans are toasty and the caramel is rich and the crumbly shortbread (melty crumbly, not dry crumbly) is rich and the nonpareils add a crunch. So easy and the dough freezes well to allow for pulling a few discs from the freezer to bake, so you have fresh cookies on demand -always a plus in these times. AnonymousPittsburgh4/11/2020I loved the flavor of these cookies, but probably would do a couple things differently next time. I couldn’t find the non pariel , so I used turbinado sugar to roll in. It ended up spreading and caramelizing on the sheet, so I probably should have just done the glaze and sugar on top rather than rolling it! Didn’t end up with very round cookies, so need a little practice on the rolling and cutting technique as well!AnonymousCincinnati, Oh4/5/2020This cookie recipe has earned a spot in my permanent rotation. They crumble beautifully and melt like butter in the mouth. I recommend making the dough recipe as is, and be sure to use a scale and the weight measure for your flour to ensure the right texture. I don't care for nonpareils, and so rolled the dough in finely chopped pecans. I found this to have the added benefit of further balancing the cookie's sweetness. Because they were so popular, I have repeated the recipe a second time, replacing the pecans in the dough and around the edge with lightly salted pistachios. Those turned out well too, and are particularly beautiful!\n\nFor those in possession of all ingredients except the dulce de leche: it's very easy to make your own with a pot of water, a can of sweetened condensed milk, and patience.AnonymousSeattle, WA3/31/2020Is it possible to use walnuts? I have lots of walnuts and no pecans. AnonymousOregon 3/23/2020These are delicious! Made them exactly as written and they turned out beautifully. Gave 4 stars as I’m not sure I would bother with rolling it in raw sugar again as they didn’t stick and ended up making caramel on the baking sheet, but otherwise would totally recommend. leebyresVictoria, BC 3/22/2020These cookies were super tasty. i swapped out the pecans for lightly salted pistachios and it work marvelously. im fairly certain that any roasted nut would be good in this recipe. I look forward to trying it with hazelnut and drizzling some chocolate on the top.  Anonymous3/18/2020Loved these cookies and they were a big hit with my coworkers. Will definitely be making again in the future. AnonymousMilwaukee, WI3/15/2020I baked these today and thought they were pretty good, but I definitely would do a few things differently if I baked them again. \nThis recipe looks like a bit of a riff on the gone-viral \" Salted Butter/Choc. chip shortbread\" cookie recipe by Alison Roman, which is now my only go-to for shortbread. I've done lots of different add-ons/flavors but the cold butter was a game changer for shortbread. \nThis recipe also uses cold butter and asks you to brush your dough roll with something and then roll it in something. For Roman's recipe this works beautifully, but to me in this recipe it's a mess. If I were to make them again I'd just cut the cookies, place them on baking sheets, brush the whole top with the thinned dulce de leche, and sprinkle demerara on top. Brushing and rolling meant only the sides had a thin, almost inperceptable bit of sauce and sugar. \nLike another reviewer, mine spread way more than expected and they were very cold when I baked them. They were hard to get off the parchment even after cooling and crumbled apart. I ended up doing something pretty decadent with them, though, to take them to another level: spread remaining dulce de leche on bottom of one and top with another to make a sandwich cookie. Oh, yeah.Anonymouswisconsin3/15/2020Explore Bon AppétitCookieDessertPecanNutDulce de LecheOther IngredientsSnackBakingChristmasBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-01", "author": ["Condé Nast", "Molly Baz"]}