{"id": "7fcbff761fa314c02252570c22017307", "url": "https://www.bonappetit.com/story/the-myth-of-the-perfect-job", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "The Myth of the Perfect Job | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Myth of the Perfect JobThoughts on career and mental health from Healthyish editor Amanda Shapiro.By Amanda ShapiroJuly 18, 2019FacebookTwitterEmailPhoto by Horst P. HorstFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Yesterday we published an essay from Ann Yang, the founder of Misfit Foods, about her decision to walk away from the successful company she’d run since she was in college. She wrote:I have depression, but I didn’t know that I had depression. The most important part of the previous sentence is that I didn’t know that I had depression. My life as an entrepreneur had not left space for me to think seriously about my mental health. And that’s what I want to talk about, how in the mythology of entrepreneurship—the intoxicating idea that you can build things and start things and be liberated from a “normal” day job—can bring on and normalize feelings of loneliness and stress.This mythology Yang talks about—the disconnect between what you think a job should look like and what it actually entails—is powerful, and it can happen in just about any career. When I was a freelance journalist, I expected to have multiple stories in the works at any given time, all of which would pay for my Brooklyn rent, my natural-wine-buying habit, and an occasional vacation.Ummm, no.For years I clung to this expectation, and I felt like a failure a lot of the time. At times I was definitely depressed. But the more I talked to other freelancers, the more I saw that no one had the Sex and the City journalism job I imagined. Everyone had side hustles, a day job, or a pipeline of parental funds. And this was true not just for writers but for freelancers of all stripes.For Yang, being raised by immigrant parents in a low-income home only made her expectations higher and the stakes feel greater. And it gave her a scarcity mindset—a sense that her work, her money, her business would never be enough—that she struggled to overcome.I’m really glad that Yang chose to write publicly about this struggle, because I think talking about it—on the internet, with your therapist, with friends, to your dog—is probably one of the best ways to reconcile your expectations with reality. And that’s probably a really helpful thing to do for your mental health.What Else I’m Reading, Listening To, and Thinking AboutIf you want to listen to people who have much more interesting things to say about mental health, I recommend Mad Chat, a podcast by Healthyish contributor Sandy Allen plus a lineup of amazing guests.And speaking of entrepreneurs who make it look easy, restaurant PR mogul Sue Chan is not only one of the most badass women in the industry, but also she has really good style.And speaking of nothing in particular, how badly DO I want to see Jennifer Lopez, Constance Wu, and Cardi B dancing, stripping, and racking up pyramids of cash from unsuspecting dudes? More than I want to admit.Stay cool with salad ramen.\nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaWhat I’m CookingWe published two standout recipes on Healthyish this week, both of which I’m planning to make at home immediately. Here in New York, where it’s currently 96 degrees, it’s a perfect night for Chris Morocco’s salad ramen, a bowl of chilled noodles topped with crunchy, fresh veg and a light citrus-soy-sesame dressing inspired by Japanese hiyashi chuka.And this weekend might be a good time to make a perfectly sweet-salty, ten-minute barbecue sauce (no sugar, ketchup, or soda!) and pour it on chicken, summer squash, and everything you grill. Were you looking for a cute, one-of-a-kind tray to serve all this good food on? We got you covered there too.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThese Restaurants Define New York for MeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-18", "author": ["Condé Nast", "Amanda Shapiro"]}