{"id": "7fdb0a2ff77a46cd4b178869cafeb75a", "url": "https://www.bonappetit.com/story/padma-lakshmi", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Padma Lakshmi Is Telling Stories for a Better World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePadma Lakshmi Is Telling Stories for a Better WorldFrom food justice to endometriosis activism, the author and television host is calling it like she sees it.By Mehreen KarimMay 27, 2021FacebookTwitterEmailPhoto by David Moir/Bravo/NBCU via Getty ImagesFacebookTwitterEmail“It’s so nice for me to finally have the community I wish I had in my 20s,” Padma Lakshmi says. It’s a sunny May day and amid her back-to-back schedule, the author, activist, model, and television host is reflecting on her recent A1 award from Gold House, a nonprofit that’s been honoring the 100 most culturally impactful Asian Americans and Pacific Islanders annually since 2018. “Of course it's nice to get the award,” she continues, “but I'm just really happy it exists at all.”Though, for most of us, we don’t need an award to recognize Lakshmi’s influence, particularly in the food space. Many of us know her as the vivacious and longstanding host of Top Chef, the empathetic and outspoken endometriosis activist, and the trailblazing producer of Taste the Nation—a Hulu series released last year to masterfully amplify the voices and untold stories that have shaped American food as we know it.No matter which direction you turn, you’ll find Lakshmi unapologetically shedding light on the people and stories most urgently deserving an audience, defending marginalized communities—especially in the face of this past year’s increased injustices against AAPIs—and cooking really, really good food. In the days after winning her Gold House award, I chatted with Lakshmi about her maternal role models, the highs and lows of life under lockdown, and what it was like eating her way across America.Did you have any particular role models growing up that influenced where you are today?I think my biggest role models were my mom and my grandmother. Those two women, beyond teaching me how to cook and both being excellent cooks, were huge influences on my life. They were both very independent women who tried to use their time wisely. I also looked up to Madhur Jaffrey when I was a teen. It was nice to see one brown face out there, but it had actually been kind of lonely in mainstream media for a long time—until recently.How did your mom and grandmother inspire your food and activism work?My mom did the work that nobody else wanted to do. She was an oncological nurse for years before going on to do AIDS and hospice work. By the time a case got to her desk, the patient had four months or less to live. That’s very, very taxing work because you get attached to all your patients. But I always appreciated how much empathy she had for others.My grandmother (who is going to be 90 this year!) was a very pragmatic woman. She started the first Montessori school in her region of India, took care of a huge household, and was always cooking. I never saw her sit down and I never saw her feel sorry for herself or complain. I once asked her, \"Are you happy?\" And she said, \"Well, for me, happiness is more of a verb. It's a state of being. When I feel like I've gotten all the things on my list done on any given day, I feel happy. When I don't feel happy is when I feel idle.\" I think that work ethic has been ingrained into me; to make your life worthwhile.In a year where you, among so many organizers and activists, were on the front lines of raising awareness about tragedies and social injustices, were there specific sparks of joy or moments of inspiration that have stuck with you?Professionally, I actually had a really good year because I was finally able to get Taste the Nation out there (that was a really, really hard show to even get green lit). I've been on TV for a really long time and it took me until now to get a second show that is completely mine and of my creation. It also feels good that our show was able to speak to this moment in society and to highlight food and people we don't really hear about that often, but who are very much American and very much part of the fabric of our lives.I remember watching the show and thinking, \"Did she produce this last week? How did she know that we needed to have a conversation on racial inequities in food media right now?\"Well, I think it's because maybe the mainstream public is only talking about all this stuff now. But for us brown folk, we've been talking about racial inequities; this is not an issue that started with George Floyd or anti-Asian hate crimes in Atlanta. This is an issue I have grown up with. I've been breathing and drinking and eating this issue ever since I was a little girl. I think the rest of the world was just really attuned to these issues all of a sudden, but it's not like racism wasn’t around earlier. I couldn't have ever predicted the atmosphere in which the show would have come out, but I'm glad that we were able to provide the show at the right moment, on the right topic, and with the right message.When you were producing Taste the Nation, how did you go about telling the stories behind what we know as “American” food?I wanted the people we featured to speak for themselves and decide what the narrative was going to be. It was important for me to cover Indigenous food because what was American food before you had foreign hands meddling in it? The Indigenous population in this country have a lot to teach us. And then I wanted the show to feature a good cross section of the immigration story in this country; Japanese food in Hawaii, Jackson Heights’ Indian community, and Wisconsin’s German food, for example.In addition to your advocacy for equity in food media, I’d love to hear more about your women’s health advocacy work and endometriosis foundation. Why and how did you get involved?You can't make great decisions when you're in chronic pain, your hormones are going crazy, and you just can't think straight. Endometriosis does a number, not only on you physically, but also emotionally; it really morphs and distorts your own relationship to your womanhood. So I started the Endometriosis Foundation of America when I was still in my 30s. I just noticed that there's hardly any funding for endometriosis research, yet nearly 200 million women suffer from it worldwide. I get it; it's not very sexy to talk about your period. But if I wasn't going to speak up about it, how was I going to raise awareness and money? The foundation experience also helped prepare me for working with the United Nations as their Goodwill Ambassador and with the ACLU on immigration and women's rights.It seems like at the core you’re all about raising awareness through storytelling. Was that part of the inspiration behind your upcoming and first ever children’s book, Tomatoes for Neela?Well, I've always wanted to write a children's book. This is just partly based on a story I used to tell Krishna, my daughter, when she was going to bed at night, but we just embellished it and embellished it. I wanted to teach her when vegetables grew because I realized she didn't know when she came home from her dad's asking for pomegranates in July or something. I thought tomatoes would be a great vegetable to start with because they're so ubiquitous in cooking and kids know about them. It also talks about farm workers and why we should be really mindful of where our food comes from and stuff like that. So it's just about trying to encourage kids to respect when things grow and to try to eat things in season—not only because they're delicious, but because they have more nutrition. It’s also about how to respect passing down recipes.How does it teach them about recipes exactly?At the end of the book I added in recipes that kids can make with their families. So it also helps families use recipes as a way to get their kids interested in food and also allows them to learn how to spell and practice writing without it being a whole paragraph. It's also an intergenerational story about a South Indian family, and I'm very happy about that too. It's just using a creative narrative arc to teach children some values around food and cooking and the practice of it all.What would you say to anybody who also wants to partake in telling the stories they're passionate about?I think...just do it. Do it in whatever small way you can. Nothing is too small or too big, it just matters that you take the steps to take the effort.Explore Bon AppétitPadma LakshmiInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-27", "author": ["Condé Nast", "Mehreen Karim"]}