{"id": "7fe66574ac252243db111d12f95a4db2", "url": "https://www.bonappetit.com/story/baked-chicken-wings-baking-soda", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Baked Chicken Wings That Are Actually Crispy? Just Add Baking Soda | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBaked Chicken Wings That Are Actually Crispy? Just Add Baking SodaIt's probably an ingredient you've never thought to rub on meat, but baking soda is the key to baked chicken wings with real crunch.By Kat BoytsovaJanuary 30, 2019FacebookTwitterEmailChelsie CraigFacebookTwitterEmailIs there anything better than crispy, saucy, fall-off-the-bone chicken wings? The kind that get deep fried and served up by the dozen at your favorite sports bar? I sure didn't think so. Which is why, when I was asked to develop a recipe for Basically Buffalo Wings, I truly never imagined being able to recreate anything nearly as delicious at home. I thought the deck was stacked against me.They were going to be baked chicken wings for sure—I am the kind of person who would rather chop 1,000 tear-jerking onions than deep fry anything at home. The grease splattering around on your favorite shirt and/or cat, the smell that doesn’t go away for days, and after all of that you have to figure out how to properly dispose of a vat of hot oil. No. Thanks.But after consulting a ton of recipes for baked chicken wings and lots and lots of testing, I proved myself wrong. With a little technique, I was able to make a version of Buffalo wings that required no frying but were every bit as satisfying as the restaurant wings I know and love. Baking the chicken on a wire rack set in a sheet pan helped a lot—it helped to keep hot air circulating around the wings, which crisped them more evenly without having to flip them halfway through. And starting the wings at a low temperature—which allowed fat in the chicken skin to render out and surface moisture to evaporate—before blasting them at a higher temperature was the one-two punch they needed to really get cracklin'. But it was the addition of one very unusual ingredient that really made the difference: baking soda. Regular old baking soda! Incorporating just a half teaspoon of the stuff into the mixture of kosher salt, garlic powder, and onion powder that I tossed the wings with before baking pushed them over the edge, yielding chicken skin that was uniformly browned and crunchy. Weird, right?A little baking soda goes a looooong way.\nChelsie CraigHere's why it works. Baking soda is alkaline, so it raises the pH level of chicken skin, breaking down the peptide bonds and jumpstarting the browning process, meaning the wings got browner and crispier faster than they would on their own. (If it makes you feel better, we don't really get what that means either, but it works!) The only challenge is that baking soda can have a intense and unpleasant flavor when used in large quantities, so you can only get away with using a very small amount. That meant that I had to figure out how to distribute that half of a teaspoon evenly over three pounds of chicken wings. The solve? Incorporating it into a larger quantity of a simple dry rub, which made dispersing it a breeze.Science is cool! And so are Buffalo wings! And so is making them at home with a minimum of fuss, maximum crispiness, and no splattering fry oil. Go forth and bake those wings!Get the recipe:Basically Buffalo WingsWant crispy-spicy chicken wings without having to deep-fry at home? We got you.View RecipeExplore Bon AppétitBasicallyChicken WingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-30", "author": ["Condé Nast", "Kat Boytsova"]}