{"id": "80137876cbef501738a355823810cb5c", "url": "https://www.bonappetit.com/story/real-friends-serve-roast-chicken-at-friendsgiving", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Real Friends Serve Roast Chicken at Friendsgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingReal Friends Serve Roast Chicken at FriendsgivingWhen it comes to serving up poultry to the crew on Thanksgiving, turkey is not the move.By Alex DelanyNovember 14, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou shouldn’t be serving turkey at your Friendsgiving. Before we get any further into this argument, I just want to admit that I am not even close to being a Turkey Guy. Besides a turkey club, I think it’s a food that possesses minimal worth. Yes, I am biased. But I also have the success of your Friendsgiving in mind, so hear me out. You should be roasting chicken at your Friendsgiving. Whether it’s one whole chicken or two, roasting chicken instead of turkey is going to make for a tastier, easier, more successful party. And yes, this is a party.Choosing chicken will help you out before we even step foot in the kitchen. Chickens, for the most part, are smaller than turkeys. I’m not sure if you knew that or not, but they are. You can look it up if you doubt my credibility on the subject. But I promise you that the whole chicken you buy at the grocery store or butcher shop will weigh less than a whole turkey. And that means it will be easier to carry, especially for someone like me. I don’t have a car. I live in a city. I walk and ride the subway. Which means there’s a zero percent chance that I will ever volunteer to carry a whole turkey anywhere. Do you want to be the person deciding whether or not it’s acceptable to rest your 16-pound turkey on the subway floor, four inches from someone’s gnarly running sneakers, because your arm is tired? No. You don’t. That’s a lose-lose scenario. Chickens get from point A to point B much more easily. Also: How many people are you feeding, anyway? Yeah: not enough people to necessitate roasting a 15-plus pound animal.It's also worth noting that whether you've roasted a bird before or not, a chicken is always less stress than a turkey. Less expensive. Less of a commitment. Less intimidating. Easier to schlep, but also easier to handle mentally.But that difference in size also means that roasting a chicken (or a couple chickens) will take far less time than roasting the traditional, gargantuan, colonial-era poultry. You can roast a single chicken in about 45 minutes. Two will take a little longer, since there’s more heat being conducted, but the chicken will still be ready to serve much sooner than a turkey. As someone who went four years with a minuscule oven, I cherish the fact that chicken gives you more time and oven space to devote to side dishes. The mashed potatoes. The biscuits. The sweet potatoes. The salads. The sprouts. The stuff that most people like way more than the turkey.Speaking of turkey, when was the last time you went to a restaurant and ordered turkey that wasn’t on a sandwich? Oh. Not in the last year? Not in the last decade? Never? And when was the last time you ordered chicken? Last weekend? This week? Last night? Yeah, that’s because more people like chicken than they do turkey. Because chicken tastes better.But why does chicken taste better? Well, there are a couple reasons. First, the ratio of skin to meat on a chicken is better than that of a turkey. Since a chicken is smaller, there’s going to be more crispy, brown, beautiful skin for every bite of meat. Part of the reason turkey breast can be so bad is that there’s never enough skin to go around. Less meat, in this case, is more.A roast chicken can look nice too!\nThe entirety of a chicken also cooks at the same rate. A turkey does not. The historical pitfall of the turkey is that the breast dries out in the time it takes the thighs to cook. And if you pull turkey out when the breast is perfect, the thighs will be undercooked. It’s a cruel paradox, and you can blame the massive size of the turkey for that. I'm not saying that it's impossible to make a good turkey, but it takes some practice, and it's just easier to roast a chicken so that all of it tastes amazing. And I don’t know about you, but I like to serve my friends food that tastes amazing. That’s called being a good friend.And if you follow the logic I’ve presented about chicken being better to turkey, that means the chicken leftovers will be better than the turkey leftovers. Chicken salad is better than turkey salad. Chicken stock is much easier to make, because you don’t have to use a 348-gallon pot. Chicken tacos are better than turkey tacos. Chicken soup is better than turkey soup, just as chicken fried rice is better than turkey fried rice. Your chicken choices will continue to pay off for days to come.But really, the reason you should serve chicken instead of turkey is that these are your friends. You don’t have to impress them. You don’t have to serve a massive, picturesque bird. They'll love you either way. They chose to spend time with you on the day (or a day surrounding the day) that’s all about showing thanks for the things you value in your life. This is about showing your friends that you’re thankful, and the best way to do that is show them a good time. Friendsgiving is about celebrating in the way your family wouldn’t. Crack the sixth bottle of wine. Put miso in your green bean casserole. Turn up whatever playlist is ripping through the stereo. Eat those special brownies. Talk about politics. Roast a couple chickens. Tell your friends you love them. This is your Thanksgiving. It’s all groovy.Want an easy roast chicken recipe? Yeah, you do.No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitThanksgivingroast chickenBasicallyEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Alex Delany"]}