{"id": "80206ae40de0377a54eeac4952a8f726", "url": "https://www.bonappetit.com/recipe/bitter-greens-with-cranberry-dressing", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Bitter Greens With Cranberry Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueBitter Greens With Cranberry DressingBy Jessie YuChenOctober 19, 20214.9(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrint“If tart-sweet cranberry sauce is a Thanksgiving staple, why not use it to dress a bright, vibrant salad? In this recipe endives and frisée are topped with a chunky, tangy dressing made from canned whole-cranberry sauce—a bracing foil to earthy bitter greens. Sprinkled with crunchy candied pecans and salty shavings of Manchego cheese, this fresh and lively side is the dream complement to what can otherwise be a rather heavy spread.” —Jessie YuChen, assistant food editorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronOXO Good Grips® Smooth Edge Can Opener$22 At AmazonBenriner Mandoline Slicer$80 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients6 Servings3Tbsp. raw sugar2Tbsp. pure maple syrup½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more1cup coarsely chopped pecans114-oz. can whole-berry cranberry sauceZest and juice of 1 lemon¼tsp. freshly grated nutmeg12Tbsp. extra-virgin olive oil, divided¼cup finely chopped parsley2Tbsp. finely chopped mint3Tbsp. white wine vinegarFreshly ground black pepper6heads of green and/or red endive, quartered2heads of frisée, torn or cut into size of quartered endive4oz. Manchego cheese, shavedPreparationStep 1Preheat oven to 350°. Mix raw sugar, maple syrup, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a bowl. Add pecans and toss to coat. Spread pecans out on a parchment-lined rimmed baking sheet and bake until sugar is bubbling, 6–8 minutes, then continue to bake 3 minutes longer to allow sugar to caramelize. Let cool; break into small pieces.Step 2Whisk cranberry sauce, lemon zest, lemon juice, nutmeg, and 5 Tbsp. oil in a small bowl to combine; season cranberry dressing with salt.Step 3Whisk parsley, mint, vinegar, and remaining 7 Tbsp. oil in a large bowl to combine; season herby dressing with salt and pepper. Add endive and frisée to bowl and toss to coat.Step 4Arrange salad on a platter and drizzle some cranberry dressing over. Top with Manchego cheese and candied pecan pieces. Serve with remaining cranberry dressing alongside.How would you rate Bitter Greens With Cranberry Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleLove love love this salad! Served it on thanksgiving and it was perfect with the other dishes. Just don’t toss it in the oil/vinegar too soon or it will wilt. Chef MimiOklahoma11/29/2021It was a great party in my mouth! Love, love, love it!Mie11/22/2021Why was this on a list of \"44 Vegan Thanksgiving Recipes Everyone Will Love\" if there's cheese in it?Anonymous11/21/2021Explore Bon AppétitThanksgivingEndiveChicoryLeafy GreensVegetableFriséeCranberry SauceVegetarianHealthyishDinnerSideSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Jessie Yuchen"]}