{"id": "80261e716ae206241b1858d1e40e49fe", "url": "https://www.bonappetit.com/story/haitian-food-montreal", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "All the Best Places to Eat Haitian Food in Montreal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAll the Best Places to Eat Haitian Food in MontrealFrom crispy pieces of delicious fried pork to piquant and flaky Haitian patties, here’s everything you need to eat in the City of Saints.By Terence TrouillotNovember 7, 2019FacebookTwitterEmailDominique LafondFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.In the summer of 2016, I drove up north from New York City with my parents, who are both Haitian and French-speaking, and a good friend to visit the francophone city of Montreal. One of our main objectives was to eat (and drink) well and plentifully, a goal I’m happy to say we accomplished with ease. The tone was set on our first night when we accidentally stumbled into the newly opened Agrikol, a hip and impressive Haitian restaurant in the Gay Village whose owners just happen to be the two founding members of the acclaimed Canadian indie rock band Arcade Fire.There we enjoyed modern interpretations of staple dishes I grew up eating, including accras, yummy fried malanga fritters, and griot, spicy, succulent fried pork, among other things. We also polished off a whole bottle of Barbancourt, Haiti’s best known rum, which makes it a little difficult to remember everything we ate. We went in hard! The experience was so amazing that I’ve wanted to take a deeper dive into the city’s Haitian food scene ever since.While nose-to-tail dining and ultra-heavy Canadian comfort foods might get the most press, Montreal has an incredibly diverse culinary scene, reflecting local immigrant enclaves originally hailing from Central America, Northern Africa, Portugal, South and East Asia, and the Caribbean. Montreal’s Haitian community is a thriving population that grew significantly in the 1960s and 1970s, when many of Haiti’s elite (doctors, teachers, etc.) fled to the French-speaking city to escape François Duvalier’s infamous dictatorship. Today the Haitian population in the greater Montreal area rivals that of NYC and Miami. As a result, Haitian culture, and by extension food, has had a strong foothold in Montreal’s cultural identity.Much like the Montreal food scene itself, Haitian cuisine is a great amalgamation of various cultures and influences, here namely French, West African, and Caribbean culinary traditions. In Montreal, Haitian food complements the bold and rich flavors in French Canadian cooking; you can also find fusion dishes you won’t get anywhere else, like griot poutine or a burger with fried plantain buns. In recent years, thanks to restaurants like Agrikol, it’s become quite the popular fare in Montreal, with new places popping up at a staggering rate.Growing up in a Haitian household myself, Haitian food is by and large my go-to comfort food. My childhood was all about cooking and eating with my family, which meant consuming a healthy dose of bannann peze (plantains that are pressed and double-fried with a touch of lime and salt), rice and beans, stewed or fried meats, and a ridiculous (even dangerous) amount of Scotch bonnet peppers. In other words, I know a good griot when I see it. Recently, I spent a weekend in the French Canadian city, scouring the streets (and my Google maps) to find some of the most creative, inspiring, and noteworthy options of Haitian cookery in town. From local favorites like Méli-Mélo market, which has some of the best pork in the city, to hole-in-the-wall joints like Merson’s Patisserie, which offers up what may be the best Haitian beef patties I’ve ever tasted, here is just a modest sampling of where to eat Haitian food in Montreal.7 Must-Visit Haitian Eateries in Montreal:Just ask for what you want.\nDominique LafondMarché Méli-MéloLocated on Jarry Street in Villeray–Saint-Michel–Parc-Extension (or Saint-Michel for short), this half food market, half take-out spot is home to some of the best Haitian food in the city. Celebrating its 35th anniversary this year, Méli-Mélo, which means hodgepodge, was first on everyone’s list when I asked my local friends about their favorite places. Opened in 1984 as a small grocery with select produce from Africa, South America, and the Caribbean, Méli-Mélo expanded as a casse-croûte—Québécois for snack bar or take-out spot—in 1989, offering up traditional Haitian dishes like lalo (beef and vegetable casserole made with jute leaves), lambi (conch), and poulet créole (stewed spicy chicken).But you’re here for one thing: the griot, juicy pieces of pork shoulder marinated in citrus and Scotch bonnet chiles before being simmered and lightly fried to crispy-on-the-outside, moist-on-the-inside perfection. The dish comes with pikliz, spicy pickled cabbage with, again, Scotch bonnet peppers, a spicy sauce ti-malice, and your choice of riz blanc (white rice) or riz collé (traditional Haitian rice made with red kidney beans). While I prefer the pared-down and relaxed environment of the original, head to Le Néo Resto Méli Mélo, a 60-seat eatery owners Jean-Marie Toussaint and Jean-Michel Baptiste opened in 2017 just north of the market, if you’re looking for more of a sit-down experience.640 Rue Jarry E, Montreal; 514-277-6409; open Monday–Saturday 8 a.m.–8 p.m.; Sunday 9 a.m.–6 p.m.At La Bonne Bouffe Créole, you'll want all of your big portion.\nDominique LafondLa Bonne Bouffe CréoleWith a name that means good Haitian food, La Bonne Bouffe Créole delivers just that: a humble assortment of solid Haitian bites in a no-frills setting. Situated in Hochelaga, a small neighborhood along the Saint Lawrence River, this small take-out restaurant offers all the traditional Haitian dishes like lalo, griot, and cabrit (stewed goat’s meat). If you’re smart, you’ll zero in on the beef options. Notably delicious is the légumes et boeuf, a beef ragout made with chayote, eggplant, cabbage and carrots—a comforting mix of richness and spice that’s ideal for the cold winter months. The tasso, fried lumps of tangy and spicy beef (in this case tongue), is another standout. Coupled with the pikliz, it’s out-of-control delicious, the perfect balance of fat, acid, and crunch. Like griot, tasso is marinated in citrus, giving the beef a sweet and tangy flavor; it’s also seasoned with a little bit of four spice, which is a mixture of white pepper, nutmeg, cloves, and ginger. Make no mistake, this dish is spicy. Proceed with caution.It’s also worth mentioning that La Bonne Bouffe Créole is known for incredibly large portions. Come hungry and wash it all down with a Cola Couronne, Haiti’s oldest and most beloved “fruit Champagne”-flavored soft drink (a nonalcoholic beverage that has absolutely nothing to do with Champagne and tastes kind of like cream soda).3715 St Catherine St. E, Montreal; 514-656-7347; open Monday–Saturday 11 a.m.–9 p.m.; Closed Sundays.To drink...\nDominique Lafond...and to eat.\nDominique LafondAgrikolThanks to the same delicious food, great music, and free-flowing rum that won over my parents and me a few years ago, Régine Chassagne and Win Butler’s Agrikol is still one of the more popular restaurants in all of Montreal. Chassagne, who was raised in Montreal by two Haitian parents, wanted to bring a taste of her own upbringing to the masses with a more sleek and modern aesthetic. Recently, Butler and Chassagne brought on board the young and talented chef Paul Toussaint, a native of Haiti and Montreal resident.Toussaint’s menu includes such Hatitian favorites as poisson entier frit (whole fried fish) and poulet à la noix de cajou, a traditional dish in the Cap-Haitien that consists of sautéed chicken and cashews. The lambi ak riz djon djon is a rich and citrusy stew of tender conch with earthy, savory Haitian rice made with dried black mushrooms from the Artibonite Valley (a.k.a. the truffles of Haiti) that go by the same name. Another highlight is Toussaint’s pain patate, a classic dessert made with white sweet potato and four spice. Here the gooey cake is covered with a sugar-cane syrup, macerated raisins, and a heavy dose of powdered sugar and whipped cream. It’s killer.You should be prepared to drink at Agrikol, specifically lots of rum. The restaurant has some of the finest rums from Haiti and elsewhere in the Caribbean, but go with the ti ponch, essentially a daiquiri made with clairin (unaged white rum, in this case Barbancourt), a touch of lime, and sugar-cane syrup. And be prepared for a wait. Agrikol is always busy, and only takes reservations for large parties. Luckily the restaurant has its own bar next door where you can enjoy a strong cocktail (or three) while you wait.1844 Rue Amherst, Montreal; 514-903-6707; open daily 5 p.m.–11 p.m.Plantains coming out of the fryer at Casse-Croûte Sissi & Paul.\nDominique LafondCasse-Croûte Sissi & PaulIf you’re in the mood for a homestyle meal, Casse-Croûte Sissi & Paul is definitely the place to go. Located in Saint-Michel, a predominantly Haitian neighborhood, this cozy little mom-and-pop shop is modest in its decor, with a number of Haitian paintings hanging on the walls, white tablecloths, and an assortment of throw pillows that cushion the banquets in the dining room. There’s also a TV in the corner of the main room playing Radio Telé Zenith nonstop, a channel broadcasting Haitian and Caribbean music, which keeps the mood lively. The service is exceptionally warm and friendly, as are the clientele—a mix of regulars and folks from the neighborhood.Here you’ll have a fairly straightforward Haitian meal with all the necessary fixins, like macaroni salad, fried plantains, a side salad, and of course pikliz. Go for the chicken with the riz djon djon, served with green peas and some extra crispy plantains on the side. Also order the kibbeh (or kibi) a Haitian croquette made from bulgur and spiced ground beef. Originally brought over by Lebanese merchants/immigrants who came to Haiti in the late-19th and early-20th centuries, kibbeh remains a very popular snack in Haiti. Sissi and Paul’s, like all traditional variations, are torpedo-shaped and incredibly addictive.2517 Jean Talon St. E, Montreal; 514-903-2517; closed Monday; Tuesday–Thursday 11:30 a.m.–8 p.m.; Friday–Saturday 11:30 a.m.–9 p.m.; Sunday 11:30 a.m.–7 p.m.The whole fish at Kwizinn.\nDominique LafondKwizinn Resto-Bar CréoleProbably the only other restaurant that can rival Agrikol in terms of ambience (and decibel levels—there’s a DJ booth at the front of the restaurant) is Kwizinn Resto-Bar Créole, which opened in 2017 on the Saint-Hubert Plaza in Montreal’s Little Italy. Along with his wife, Claudia Fiorilli, who runs the front-of-house, chef-owner Michael Lafaille offers an eclectic menu with great loads of creative dishes and a killer cocktail list.The staple menu item here, perhaps oddly, is Kwizzin’s naturally gluten-free burger: a behemoth slab of ground beef sandwiched between two large fried plantains. The unruly burger is a little intimidating, but it’s worth working through the mess. The plantain buns are seasoned with garlic for extra zip, and the patty is smothered with a spicy mayo, pikliz, and melted cheddar cheese. It’s fantastic. If you’re not feeling meaty, Lafaille’s menu also offers a great selection of vegetarian options, including a chayote gratin with mozzarella, Parmesan, and corn that’s as rich and insane as it sounds, and a ratatouille made from jute leaves, eggplants, and squash.Either way, be sure to order a glass of the kremas, a housemade digestif and Haitian favorite made from milk, coconut, nutmeg, anise, and of course rum. It’s stiff and sweet, and a perfect stand-in for dessert.6670 St Hubert St., Montreal; 514-379-6670; closed Monday; Tuesday–Thursday, Sunday 5 p.m.–10 p.m.; Friday–Saturday 5 p.m.–10:30 p.m.The pâté Haïtien (Haitian patty puff pastry meat pie) at Merson's Patisserie.\nDominique LafondMerson’s PatisserieOne of the more coveted food items in our household growing up was the pâté Haïtien or Haitian patty puff pastry meat pie famous for its crunchy crust and spicy fillings. It's closest (and much more ubiquitous) cousin is probably the Jamaican patty, which is similar and delicious in it’s own right, but different in a few key ways: Jaimacan patties are often bigger and the dough is colored with curry powder, giving it that recognizable yellow hue. Haitian patties aren’t hard to come by per se, but a truly exceptional one with a perfect laminated flaky crust and generously seasoned, well-portioned filling is, at least in my experience, pretty hard to find.Merson’s Patisserie in Saint-Michel may have the best Haitian patties I’ve ever tasted. The place is somewhat unassuming—a tiny storefront with a display case holding two lonesome birthday cakes —but do not let that deter you. You need to eat at least two of these exceptional patties, and take some home with you to stash in your freezer. The beef patty dough is incredibly crispy on the outside and soft and warm on the inside, and the filling—a creamy emulsified paste of ground beef and fat with just a hint of thyme and rosemary—sings with flavor and spice.3410 Rue Bélanger, Montreal; 514-728-4040; open daily 10 a.m–7 p.m.The buffet at Fourchette Antillaise.\nDominique LafondFourchette AntillaiseLocated in Ville Saint-Laurent, a borough just west of the city center (it’s well worth the trek), Fourchette Antillaise has a classic Haitian restaurant feel. It has a large menu with everything from salade Russe to three different types of cabrit and a whole selection of seafood including fried red snapper; big banquet-style service; a sort of upscale modern decor; and of course a buffet. One of the highlights for me was the poulet créole, fall-off-the-bone spicy chicken legs and thighs with tomato and red pepper sauce that reminded me of my mom’s chicken.On Saturdays only, you can find bouillon, a traditional beef and vegetable soup that’s hearty and savory, studded with boiled plantains and yams. It’s super basic but pure comfort, like the Haitian version of chicken noodle soup. Every Sunday, Fourchette Antillaise serves a brunch buffet for $24 (CAN) with all you can eat griot, riz collé, riz djon djon, poulet créole, and more. The best thing, however, is ratatouille or legim, a fiery dish made from eggplant, tomatoes, and onions that’s a little sweet and a little spicy. The restaurant can be a madhouse on Sundays, as many Haitian families will come in throngs right after church.5968 Rue de Salaberry, Montreal; 514-337-9393; closed Monday; Tuesday–Thursday 11:30 p.m.–9 p.m.; Friday–Saturday 11:30 p.m.–10 p.m.; Sunday 1 p.m.–9 p.m.Want more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Terence Trouillot"]}