{"id": "8029aee5a35421283ad81ee9c75db1ad", "url": "https://www.bonappetit.com/recipe/chopped-salad-supreme-with-kimchi-vinaigrette", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Chopped Salad Supreme With Kimchi Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChopped Salad Supreme With Kimchi VinaigretteBy Lauren SchaeferMay 25, 20212.9(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintSome version of this bright, super-crunchy salad has been on the menu at Kitty’s Market since day one—it’s the perfect foil to our rotisserie chicken. And it’s most fun to make during the summertime, when we get to mix up the exact combo of vegetables almost daily based on what local produce looks best. Quickly blanched pieces of asparagus, haricots verts, cauliflower florets, and even fresh shelling or fava beans can easily take the place of the broccolini. Raw snow or sugar snap peas, shaved summer squash, fresh corn kernels, and even thinly sliced baby beets are all fair game. (Just be careful with veggies that tend to expel a lot of liquid like tomatoes or cucumbers—they’ll taste great in the mix, but the salad won’t be able to sit out and marinate for as long without getting watery.) The one constant here is the punchy, funky blender dressing. With good kimchi at its base, the vinaigrette has enough complexity that all it needs is a little neutral oil to give it body and a splash of vinegar to sharpen it up. —Lauren Schaefer, Kitty’s Market, Hudson, NYThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonColander$11 At AmazonMedium Pot with Lid$155 At AmazonIngredients4–6 servingsKosher salt1bunch broccolini, stems trimmed, cut into 1\" pieces1cup Napa cabbage kimchi with juice¼cup grapeseed or vegetable oil2Tbsp. (or more) unseasoned rice vinegar2tsp. (or more) fish sauce3Tbsp. toasted sesame seeds2Tbsp. toasted sesame oil4small carrots (any color), peeled, thinly sliced4celery stalks, halved lengthwise, thinly sliced2small watermelon radishes or 4 hakurei turnips, trimmed, cut into matchsticks1cup cilantro leaves with tender stemsPreparationStep 1Cook broccolini in a medium pot of boiling generously salted water until tender but still bright green, about 2 minutes. Drain in a colander and rinse under cold running water to stop the cooking.Step 2Meanwhile, blend kimchi, grapeseed oil, vinegar, fish sauce, and 2 Tbsp. water in blender, adding more water a teaspoonful at a time if too thick, until mostly smooth and fluffy. Taste and add more vinegar and/or fish sauce if needed. Set kimchi vinaigrette aside.Step 3Stir sesame seeds and sesame oil in a small bowl to combine; season with salt. Set aside.Step 4Combine broccolini, carrots, celery, and radishes in a large bowl. Season lightly with salt and toss to combine. Drizzle reserved kimchi vinaigrette over salad and toss to coat.Step 5Transfer salad to a shallow bowl or platter and drizzle reserved sesame mixture over. Top with cilantro.How would you rate Chopped Salad Supreme With Kimchi Vinaigrette?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI really don’t get all the confusion in several of the reviews…you add water a teaspoon at a time for the vinaigrette, there are no strawberries in there, those are radishes, and yes, there is celery in the recipe!\nAnd it really is delicious!KLambNYC11/4/2021Totally delicious.  I wish I had thought of this.  Genius.Brushjlsolon, oh7/19/2021\nDid I see strawberries in the photo of the salad or was that in a dream. Ingredients list seems to be missing some items.\nNancy DeckerPhoenix Arizona6/23/2021I hate it when water is not among the ingredients, then instructions say \"add a ton of water\". Water is as important as the other ingredients.Linda6/18/2021Not sure I understand the comments in the reviews below this but after reading the recipe I can attest that there is celery stalks mentioned in the recipe itself.  As far as the vegetables mentioned to substitute for broccoli florets namely the corn, I think it should be up to the individual whether or not to \"blanche\" the corn or other vegetables mentioned that you may use in this recipe.  I haven't made this yet but after thoroughly reading the whole recipe and introduction I certainly will!  Thanks!Anonymous6/18/2021It’s confusing to me that the photo shows celery yet there is no celery in the printed recipe. This sort of poor organization does not inspire too much confidence in the rest of the support. AnonymousBaltimore6/18/2021someone seriously edit this webpage or hire me to do it. jfcAnonymousHamilton, ON6/4/2021y'all got an editor?\n\nIs the corn and squash staying raw???? There's none visible in the image (that also has carrots and celery?!?!?!!?!? hello?!)\nAnonymous6/4/2021I'm confused. There's clearly sliced celery in the photo, but none in the recipe? I don't mind either way but its throwing meAnonymous5/27/2021Explore Bon AppétitSaladCarrotVegetableCeleryRadishAsparagusCauliflowerGreen BeanSummer SquashSquashSummerQuickEasySideDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Lauren Schaefer"]}