{"id": "8033913c1097a419c03e32f6ebbb86ce", "url": "https://www.bonappetit.com/story/portland-maine-city-of-the-year-2018", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Portland, Maine, Is the 2018 Restaurant City of the Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsPortland, Maine, Is the 2018 Restaurant City of the YearFrom the butteriest croissants to outstanding pho, it’s never been a better time to hit up Portland, Maine.By Andrew KnowltonAugust 7, 2018FacebookTwitterEmailGreta RybusFacebookTwitterEmailFull disclosure: I’ve got a thing for Maine. I went to college there, I got married there, I regularly vacation there. And I’ve always believed that Portland has one of the more vibrant, compelling food scenes, thanks in no small part to all that pristine seafood and craft beer. I’ve written about the Forest City (who knew it was called that?) and its restaurants more than any other city besides New York. I even called it America’s Foodiest Small Town in a 2009 story (wow, that title didn’t age well). So, why should you believe me when I declare Portland our 2018 City of the Year? And after years of me talking about it, why now?For starters, it’s the sheer number of outstanding openings—from a tiny pastry shop that serves knockout Roman pizza to a Jewish-style deli that ranks up there with New York and L.A.’s best. And while you can still get an Instagram-worthy lobster roll and a dozen local oysters, you’re missing out if you skip the killer pho spot or the guy selling hand rolls out of a Yeti cooler.No, this year’s award isn’t a case blind favoritism. It’s simply because this always-tasty city has never tasted better. Want more proof? Here are 20 ways to binge your way through it right now.Start every day with a trip to Tandem Bakery. I find it almost impossible to order anything other than a biscuit slathered in butter and blueberry jam. Wait, I mean the sticky bun. No, the black sesame and banana tea cake. Then again, pretty much everything baker Briana Holt whips up is brilliant.Get a glass of on-tap Maine-made pét-nat Morphos, throw back expertly shucked oysters and baby scallops (when in season), and you could easily spend your entire afternoon at The Shop at Island Creek Oysters.Treat the high-energy Izakaya Minato like a sushi bar: Sit at the low-slung kitchen counter and ask chef-owner Thomas Takashi Cooke to give you whatever was swimming nearby yesterday (mackerel, uni, scallops). And when you’ve polished that off, order another glass of sake and a couple plates of JFC (Japanese fried chicken).Oysters, pét-nat, repeat at The Shop at Island Creek Oysters\nGreta RybusStay at the 15-room Francis Hotel set in a historic Victorian Mansion (I prefer the junior suite, room 303). At night I like to sip an old-fashioned in front of the fireplace, but the best reason to stay here might be the fact that it’s located directly across the street from Tandem Bakery (see No. 1).Forget trendy and head to Ruski’s Tavern, a neighborhood bar that is open from 7 a.m. (9 a.m. on Sundays) and serves just about every bar food you can imagine. The chili cheese dog will not disappoint. If this place ever dies, so too will Portland.Hit up the Jewish deli that’s worth its weight in legit bagels: Rose Foods. Yes, I just said that (it's on our Top 50 list!). And after you’ve loaded up on perfect Montreal-style bagels, crispy latkes, and a big bowl of matzo ball soup, be sure to purchase one of their soon-to-be-famous canvas totes.Rose Foods brings new meaning to \"power breakfast.\"\nElizabeth CecilOrder the funky, fresh pho ga at Cong Tu Bot on Portland’s restaurant row, Washington Avenue. Actually, everything I tried at Vien Dobui and Jessica Sheahan’s lively Vietnamese street food spot was brimming with herbs, heat, and soul.Try your best not to fill up on the standout small plates (see: house-made morcilla, cured local bluefish on smoked onions) at Spanish-leaning Chaval, or you’ll risk being too full to try Ilma Lopez’s desserts. She’s one of the most talented pastry chefs in town, just as skilled with the simple (sticky and addictive maple pie) as the ornate (Paris-Brest with cacao sorbet).Swing by Little Giant, the sophomore effort from the team behind local favorite Portland Hunt + Alpine Club, which gets clever with dishes like lobster chips with serrano ranch and Moxie-braised pork belly. The sister market next door sells local beers and groceries and daily specials (don’t miss Friday and Saturday’s roast chicken and biscuits).You need these turmeric-and-lemongrass-laced curry noodles at Cong Tu Bot.\nElizabeth CecilVisit the wine bar of my dreams: Drifters Wife (another Top 50 nominee!). Basically, I want the life of owners Peter and Orenda Hale. They’re constantly popping open bottles of chuggable natural wines from their wine shop and then skipping over to the dining room to feast on mussel toast with nduja and other seasonal plates from chef Ben Jackson. At least this is how I want to believe they live.Follow Mr. Tuna (a.k.a. Jordan Rubin) and his Japanese-style temaki hand rolls to whatever location he’s popping up at that day. Equipped with only a rice warmer, two Yeti coolers packed with his mise en place, and a cutting board, Rubin frequents breweries and special events serving impeccably fresh seafood. The spicy scallops and crab roll is a bar snack par excellence, but it’s the crab with yuzu mayo and avocado that convinced me to buy a Mr. Tuna T-shirt. I’ve got no problem being a walking advertisement for the guy.Learn why beer geeks get giddy about Portland. Every single day a new brewery opens somewhere in Maine. I’m kidding, kinda. My favorites (with tasting rooms, of course) include groundbreaking Allagash, Bissell Brothers, Oxbow, and Foundation, but newcomer Austin Street Brewery is getting the buzz of late.Explore the Public Market House—part mall food court, part restaurant incubator. The gem of the bi-level space is Maiz, which serves arepas sliced open like a pita and stuffed with ingredients like chorizo, avocado, and zingy chimichurri sauce.Mr. Tuna on the job at Goodfire Brewing Co.\nElizabeth CecilDon’t skip the city’s trailblazers. When I was in college in nearby Lewiston a couple decades ago, a big night out with the visiting parents meant dinner at Fore Street, which is still going strong. Add the reinvented Hugo’s and the locals’ beloved Back Bay Grill to the classics list.Ask yourself: What is Ten Ten Pié? A French bakery? Japanese market? Bento box cafe? It doesn’t matter—I’m a fan of baker Atsuko Fujimoto (that rhubarb tart!) and Markos Miller’s eclectic general store, whatever it is.Leave town! Biddeford is the best reason to drive 18 miles south. It’s home to one of the country’s best cookbook stores, Rabelais (say hello to Don and Sam for me) and upstarts Little Spruce Baking Co. and Elda restaurant. It’s also home to the Single. Best. Diner. On. The. Planet. Palace Diner. The flapjacks are towering, the burger is smashed and crunchy, and the tuna salad sandwich is quickly becoming a Maine icon.All the pastries at Belleville\nElizabeth CecilCarbo-load at Belleville, which is putting out the city’s best and butteriest croissants. Arrive at 11:30 a.m. sharp—that’s when the shop’s other signature dish, Roman-style pizza al taglio, is pulled from the oven with toppings like fig and rosemary or shiitake and Gruyère. They also play Rush!Discover my perfect hangout. Thanks to a tip from Kazeem Lawal of Portland Trading Co. (he plays the best vinyl) just up the street, I found out about a tiny pub called Maps with local craft beers, vinyl, and vintage, yes, maps. When lobster-roll-seeking tourists of the Old Port are too much, this is your safe place.Make room for Middle Eastern–inspired Baharat’s Turkish crab dip with house-made chips and takoyaki and okonomiyaki from Japanese comfort food spot Mami, which prove that you can go from great food truck to even better brick-and-mortar.Pull up a stool at tried-and-true DiMillo’s on the Water for the old-school wood bar, prime people-watching, and bacon-wrapped scallops.Check back Tuesday, August 14, to find out if Rose Foods or Drifters Wife made the Hot 10.Explore Bon AppétitPortland MaineRestaurants + TravelHot 10Hot 10 2018Read MorerestaurantsWhen There's Nothing in the Fridge, We Go to Hot SuppaBy Kate ChristensenrestaurantsAsk an Expert: What Is It Like to Work at a Clam Shack?By Maggie LangeLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Andrew Knowlton"]}