{"id": "80392db6b113971471a4627ee641a7a9", "url": "https://www.bonappetit.com/story/taco-bell-crunchwrap-supreme", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food Gods | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureTaco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food Gods and I Don’t Care Who Hears Me Say ItThrough life’s greatest, worst, and most hungover moments, this euphoric mash-up has been there for me.By Gabe BergadoFebruary 13, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI can willfully admit that the Crunchwrap Supreme has very little in common with anything my Mexican family would eat for dinner. But I goddamn love it.The Taco Bell staple tends to elicit polar reactions: In one camp you have diehard fans who see it as a divine mash-up of Mexican-food influences and on-the-go dining sensibilities sent down from the fast-food gods. In the other there are those who frown upon what they see as a bastardization of the foundation of a culture's cuisine. As a half-Mexican from Southern California whose grandmother always had beans on the stovetop and would feed me chile con carne until I was close to bursting, I am here to affirm those who have also found room in their hearts for the Crunchwrap Supreme. Your love is valid.From the outside, the Crunchwrap Supreme is an unassuming, hexagonal parcel wrapped in a browned tortilla. One bite into the invention and you will be exposed to its magic. The bottom layer is a base of TBell’s signature ground beef drizzled with nacho cheese sauce, a greasy goodness you’re more than familiar with if you’ve had any other menu items. At the center is a tostada shell with dual functions, providing that eponymous crunch while also serving as a divider to the top layer, a bed of iceberg lettuce, tomatoes, and sour cream. You’re able to get the best of both worlds with the first couple of bites. More often than not, as you get through the Crunchwrap, the tostada shell crumbles and two worlds start to blend into each other, making for a scrumptious hodgepodge of happiness. Its disc shape makes it easy enough to hold in one hand while the other guides Taco Bell’s Fire Sauce to dance around the edges. Crunchwraps are truly a marvelous feat of fast-food engineering. It’s like a delicious multilayer dip all held together by a tortilla. If perfectly made and eaten before it gets too soggy, you get a bite of every one of Taco Bell’s classic, delightful building blocks.Behold the beauty that is a Taco Bell Crunchwrap Supreme.\nPhoto by Laura MurrayWhile this piece isn't about the surely fascinating history of how the Supreme came to life, the important thing to know is this: More than 10 years ago the innovation teams at Taco Bell worked hard to marry the brand’s signature flavors with the portability needed by consumers on the go, giving birth to the Crunchwrap Supreme. It was initially introduced to Taco Bell’s menu as a limited-time offering during the summer of 2005. After fanfare, it returned as a permanent fixture in January 2006. Since then we’ve seen the Crunchwrap evolve into new iterations, such as the Breakfast Crunchwrap, the Triple Double Crunchwrap, and the latest version, the vegetarian Black Bean Crunchwrap Supreme.Back to the real story, how the Crunchwrap Supreme has popped up in my timeline. It has been such a constant in my life that I don’t even remember the first time I had one. Here’s what I can recall: using one to ask my prom date to the big dance during high school. Serving them alongside a gaggle of party packs at my 20th birthday bash, aptly themed Tacos and Tiaras. More recently, eating them on Friday nights watching RuPaul’s Drag Race on my couch alone because I’d rather hang out with my Taco Bell after a week of work than deal with another human being at a crowded gay bar. Countless hangovers soothed by fast-food euphoria. Taking boyfriends to TBell as a compatibility test, all of whom have also been fans but ultimately did not work out for other non-fast-food-related reasons. Boys have come and gone, but Crunchwraps are forever.Gabe, supremely psyched.\nPhoto by Laura MurrayWhat does it say that events big and small in my life can be told by Crunchwraps? Why does this item speak to me in such an intimate way? Growing up half-Mexican and navigating the world as biracial often reminds me of the sort of treatment that the Crunchwrap Supreme gets: an amalgamation of different things, unable to be put into a single box. The Crunchwrap Supreme proves that you can be a meld of various worlds and not only be accepted, but widely championed. Its history as a runaway sensation and its successful, sustained existence in the zeitgeist are almost a big F-you to all the rules that came before it.In some ways I feel like I am a Crunchwrap Supreme. In a figurative sense, sure. But more importantly, it was the greatest Halloween costume I’ve ever concocted.Gabe Bergado is the Entertainment Features Editor at Teen Vogue. He lives in New York City.Want More Stories From Taco Nation? Right This Way...How the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Why Korean Tacos Are Margaret Cho’s American DreamIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?There’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayWhy Are H-E-B’s Flour Tortillas So Dang Good?And so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Gabe Bergado"]}