{"id": "805d3da0a83e079037b8452591f92497", "url": "https://www.bonappetit.com/story/csa-tips", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "CSA Tips: How to Quit Your $12 Salad a Day Habit and Join a CSA | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Quit Your $12 Salad a Day Habit and Join a CSAI did it, and you can too.By Elaheh NozariJuly 27, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailI live in a tiny studio that’s eerily similar to my teenage bedroom, save for a bigger bed and no Jonas Brothers posters, and I eat Sweetgreen for dinner most nights out of pure laziness. I didn’t think I had a problem until a white baseball hat embroidered with a subtle green “sg” arrived in the mail—my reward for spending $1,000 on custom salads that average about $12 each (that’s without premium ingredients and creamy vinaigrettes).Thinking about how much that $1,000 would be worth after 20 years in a retirement fund, I realized I needed a lifestyle change. Stopping at Sweetgreen after work provided instant gratification, but making dinner, even if only for myself, would save me money in the long run and provide me with a home-cooked meal to look forward to at the end of the day. For those reasons, and because I hate making decisions in a grocery store, I decided to join a local CSA (community-supported agriculture).I used to think I didn’t have the life of someone who should join a CSA: I rarely cook for a crowd, let alone myself, let alone a pile of vegetables. Now, once a week, I go to a church near my apartment and pick up my share—$28 worth and three tote bags full of local produce that’ll get me through at least 10 meals. Every week presents a challenge to see how I can most efficiently use all the vegetables. After a few rounds of trial-and-error, I’m proud to say that my recent creations are infinitely better than my old standby bowl of kale and wild rice. Here’s what I’ve learned about how to make a CSA work for one person. (You can follow these guidelines for more people in your household too, though good luck getting your haul to last more than a week.)All salads worth eating begin in a salad spinnerAbout 50 percent of my weekly bounty is leafy greens—lacinato kale, Boston lettuce, arugula, spinach, Swiss chard, and collards—and my first instinct is to combine them into a salad. Since my kitchen is so small  (some might call it a kitchenette), I try to keep my equipment to a bare minimum. However, after attempting to wash, dry, and trim the greens a few times with my bare hands and a dish towel, I realized I needed a salad spinner to make the prep process less tedious, get the greens crisp enough to absorb dressing, and ultimately compete with Big Salad. (I don’t have room to store it though, so it sits on a stool like a piece of modern art when not in use.) After spinning, I distribute the greens into Ziploc bags and just like that, I have my own supply of pre-washed spring mix to use for lunch and dinner the rest of the week.Choose a grain and stick with itThe whole grain options are endless.\nDitte IsagerHave you ever stood in front of a display of Bob’s Red Mill products in the grocery store and became paralyzed with indecision about which grain, seed, or alt-flour will change your life? This exact situation has left me with barely empty bags of teff flour, kamut, and something called kasha. In my new life as an economical, budget-savvy home cook for one, I’ve decided to choose one grain to buy before going to the store and exclusively use it until the bag runs out. I went with bulgur for a reason I can’t remember, and I sprinkle a serving of it into whatever CSA-based dinner I’ve made because let’s face it, vegetables don’t keep you full through the night.Roast for an easy way outWhen I first joined my CSA, I was overly ambitious about the recipes I could make from the wildcard shares like eggplant, purple cauliflower, and beets. I’m not the kind of person who’s going to make baba ghanoush on a Tuesday night. Instead, I throw about two-to-three servings of any fibrous and root-like veggies in the oven with some olive oil and, 40 minutes later, they’re a beautiful, edible mess. I eat some of it that night, save the rest for lunch the next day, and repeat until my supply runs out.Tahini is a godsendOf all the nut and seed butters I’ve eaten out of the jar over the years, tahini has risen to the top as my partner-in-crime. I drizzle it over roasted vegetables, whisk it into a salad dressing with miso and rice vinegar, and dip carrots and cucumbers in it. It’s nutty and sweet with just enough bitterness that stops me from eating 10 tablespoons at once. Whenever I feel like I physically can’t eat vegetables for another day in a row, I whip up a tahini concoction and get a second wind.Finish the week off with a galetteCome the weekend, when the pickings run low and the reject vegetables are all that’s left, I turn to an old adage I learned from my French host mother when I was in college: Everything tastes better surrounded by pastry dough. (She didn’t actually say this but the dinners she prepared suggested as much.) I make a simple dough from flour, butter, and apple cider vinegar, roll it into a free-form galette, and fill it with whatever’s left over—potatoes, kale, chard, onion—and cheese, because no matter what you cook in cheese and pastry dough, you’ll still want seconds. Then I invite myself over to someone’s larger apartment, bring the galette as a party favor, and silently celebrate another week of making it through my CSA.Use this galette as your guide:Swiss Chard and Mushroom GaletteView RecipeExplore Bon AppétitVegetableSaladTahiniRead MoreLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-27", "author": ["Condé Nast", "Elaheh Nozari"]}