{"id": "806324264590e947ea0ae31ae5c24a1f", "url": "https://www.bonappetit.com/story/never-fail-brussels-sprout-vegetarian-tacos", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "These Vegetarian Tacos Are So Good, Even a Texan Can Love Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Vegetarian Tacos Are So Good, Even a Texan Can Love ThemI was born to love meat. (And do!) But these vegetarian tacos are too good to quit.By Alex BeggsApril 26, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.There’s a watermark on my Texas driver’s license that, when held up to the light, reads quite clearly: THIS LADY EATS BEEF. A smiling cow face flashes and winks at you. (The license is also expired, so maybe they don’t make ‘em like that anymore.) The point is, I eat meat. I love tacos. I cook a lot of meaty tacos.But I’ve got nothing against vegetarians. Some of them are even my friends! And I try to eat pretty \"green\" most of the week so as not to encourage too many cow fart ozone blasts on my behalf. Luckily, there’s a wide world of vegetarian tacos out there, which is great! However, none of them are even half as good as this recipe for brussels sprouts tacos with a spicy peanut butter sauce, which nearly knocked me off my horse when I made them for the first time this past winter.Thank you, chef Daniela Soto-Innes, for this beautiful, delicious recipe.We publish a handful of recipes from chefs throughout the year, but not as many as we used to. They can be...a challenge. Chefs are used to cooking in quantity, and having a team of cooks at their disposal to make multiple sauces and fancy components, so translating restaurant recipes to the home kitchen can be really tough. In most cases, our test kitchen is faced with a choice. They either modifying the recipe to within an inch of its life, thus creating something almost unrecognizable from the dish we were excited about in the first place, or they recreate it as faithfully as possible and it's complicated as hell. But this recipe is a unicorn: Somehow, Soto-Innes gave us something chef-y and layered and cool, but at the same time ridiculously easy to pull off.Cool and easy things you do:You make a vinaigrette. Cook down some fish sauce, add vinegar, scallions, ginger, salt. Put it in the fridge and go about your day.You make a spicy peanut butter sauce. Blend some peanuts with red pepper flakes.You fry brussels sprouts. In oil, until crispy and browned. (Some reviewers roast them at high heat, and that’s cool too!) Toss with spicy-sour vinaigrette.You keep some brussels sprouts raw. For texture!You remember to buy near ripe avocados. For garnish!You cut some onions, limes, and jalapeños and thoroughly wash your hands. More garnish!You assemble tacos. Tortilla gets a swipe of spicy peanut butter, add brussels, garnishes, etc. Pour beer.But this recipe is so much more than the sum of its parts. It's a creamy, nutty, spicy, tangy, hearty, just-as-craveable-as-meat taco. It has a feeling of lightness, because of the lack of meat and the color green, but it’s also incredibly filling from the rich peanut butter and avocado. You will feel full. You will feel innovative. You will make it again and again.Get the recipe:Brussels Sprout Tacos with Spicy Peanut ButterCooked and raw brussels sprouts are matched with a rich umami dressing and a spicy nutty sauce in this surprising but winning taco.View RecipeExplore Bon AppétitTacoBasicallyNever Failbrussels sproutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-26", "author": ["Condé Nast", "Alex Beggs"]}