{"id": "8077ed69da08d91f1395e536d7189bb1", "url": "https://www.bonappetit.com/recipe/all-american-cheeseburger-pasta", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "All-American Cheeseburger Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAll-American Cheeseburger PastaBy Amiel StanekSeptember 16, 20194.6(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWhether you know it as American Chop Suey, Chili Mac, American Goulash, or even D.I.Y. Hamburger Helper, this deeply flavorful, super-comforting pasta dish is greater than the sum of its humble parts. Taking the time to brown the ground beef well and cook out the tomato paste makes a huge difference. You’ll notice that none of the fat gets drained off after the meat is seared, which is intentional—there’s no other fat added here, so if you’re using a leaner blend of ground beef, you may even need to add a knob of butter or a drizzle of olive oil to compensate.Ingredients6 servings1lb. ground beef chuck (20% fat)Kosher salt1onion, chopped4garlic cloves, finely chopped¼cup double-concentrated tomato paste114-oz. can whole tomatoes, drained, crushed by hand¼cup pickled banana peppers or peperoncini, chopped1Tbsp. low-sodium soy sauce1tsp. crushed red pepper flakes1lb. ridged tube pasta (preferably cavatappi)8oz. sharp (but not aged) cheddar, coarsely grated (about 2 cups)3oz. Parmesan, finely grated (about ¾ cup), plus more for servingPreparationStep 1Heat a large Dutch oven over medium-high until hot. Divide beef into 4 large loosely packed balls and place in Dutch oven. With a sturdy spatula, aggressively flatten balls as though you were making smash burgers; season with salt. Cook, undisturbed, until patties are well browned and crisp on the bottom, about 4 minutes. Turn each patty, season with salt, and continue to cook until second side is well browned, about 3 minutes longer. Transfer patties to a plate and let cool slightly.Step 2Reduce heat to medium. Cook onion in pot, stirring often, until golden and browned around the edges, 10–15 minutes. (Some light scorching and sticking is okay here; don’t be shy.)Step 3While onions are cooking, transfer patties to a cutting board and coarsely chop.Step 4Add garlic to pot and cook, stirring, until fragrant, about 30 seconds. Using a wooden spoon or spatula, push onion-garlic mixture to one side of pot to make space, tilting pot if necessary to get some hot fat over to the empty side. Add tomato paste to empty space and stir in hot fat until fragrant and begins to darken, about 2 minutes. Add tomatoes, banana peppers, soy sauce, red pepper flakes, and chopped meat and stir everything in pot together. Cook, stirring occasionally, until sauce is simmering and flavors have melded, about 10 minutes. Reduce heat to low and keep warm until ready to use.Step 5Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until 1 minute shy of al dente (pasta will finish cooking in the sauce). Increase heat under sauce to medium. Using a spider or large slotted spoon, transfer pasta to Dutch oven along with 2 cups pasta cooking liquid. Stirring constantly, add cheddar and 3 oz. Parmesan a handful at a time, allowing cheese to melt and emulsify into sauce between additions, about 3 minutes.Step 6Transfer pasta to a platter. Top with more Parmesan.How would you rate All-American Cheeseburger Pasta?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleI made the beef, onion, garlic tomato mixture last night. It was so good by itself I dipped some garlic bread in it for a quick, late dinner. I still need to add the pasta, pasta water and cheeses. I’m worried if I salt the pasta water too much the whole thing will be way too salty, considering the cheeses. I will add a little. I must say the key to this recipe is cooking the tomato paste longer than you think! Creates such a robust flavor! Amiel, have you made this on video? I checked the Covid pantry clips, didn’t see it…sooo yummy!SYCAMOREGRAD Indianapolis, IN3/22/2022I used Glenn Muir fire roasted tomatoes and it seemed wasteful to just drain the tomatoes into the drain. It made for a great bloody mary to sip on while I cooked though!HeatherTBristol, CT12/29/2021This was so much fun to make! It was so DELICIOUS!! I loved the All American Cheeseburger Pasta and I will definitely make it again soon. Thank you so much for this recipe!Ashley L.California3/3/2021Can't even describe how GOOD and how much BETTER it is than the Hamburger Helper you're thinking of. Banana peppers are not optional! They add so much flavor. Loved this recipe so much, there was no leftover :)AnonymousSan Diego, CA8/6/2020Absolutely delicious! Only modifications from me were using Plant-Based ground beef from Target and Chickpea Cavatappi noodles. The recipe couldn't have come out better! Will absolutely make again.LeoneBolognaCharlotte, NC5/23/2020My kids are this up like they were being paid. For me it triggered memories of my own Hamburger Helper childhood although this was 1000% better.melissahdavisAlabama4/30/2020I never had anything like this before my fiance loved it and so did I ! \nI didnt have tomatoe paste but it still tasted good. \nHad it for lunch the following day and tasted better! EmigarPhiladelphia,PA4/15/2020Really, really, good. Substituted giardiniera for the peperoncini, and it was amazing.momerChicago1/20/2020This is really REALLY good. Comfort food at it's best! I like the slight heat that the red pepper flakes provide. A few other reviewers added less pasta water than recommended because it seemed like too much and all I have to say is trust the process! I actually did think it was very soupy at first and even partway through cooking & adding the cheese but it eventually all comes together to make saucy glossy deliciousness that perfectly coats the pasta. I would definitely make this again!AnonymousIndianapolis, IN1/15/2020Delicious recipe, and came together easily! I would definitely make this again. AnonymousVirginia1/13/2020Amiel, you’ve done it again. You sly fox. \n\nThough not the biggest fan of the original, this recipe had me salivating so much so, the very day I came across it, I had to have it. \n\nUsed a red onion. Ran out of red pepper flakes, subbed in some chipotle sauce, and a bit of mustard. \n\nIncredible. \n\nTomatoes, cheese, and beef. Oooh my. \n\nPerfect for lunches the next day. \n\n\n\n\n\n\nabyerlayChilliwack, BC Canada11/29/2019Hard to review.  YES, it did taste like a cheeseburger and my son-in-law described it as \"Glorifed Hamburger Helper\" but.... the taste probably due to the retained fat from the meat which does not appear very appetizing as I look at the leftovers today. I added some chopped crispy bacon on the top before serving because that's the way we eat a burger. Otherwise, too much pasta and not enough sauce, although I did not add all of the pasta water as so much was transferred with the pasta.  If I did make it again I would use a lower fat meat and double the meat/sauce amounts and add a smaller macaroni such as elbow.  I used less than 1/2 tsp of red pepper flakes and everyone agreed that no  more should be added.  The banana peppers added a lot and we added some more on top. I ended up adding the liquid drained from the tomatoes.  AnonymousAustin10/10/2019This recipe was everything I wanted it to be and more! The combination of banana peppers and sharp cheddar is perfect and delicious. The dish comes together easily and reheats very well. Great for leftover lunch. BMAlta001New York10/3/2019I made this exactly as written, and it's a solid recipe.  That said, I had high expectations for the 15-year-old twins and husband loving it.  It was okay taste-wise--nothing super special.  If I made it again, I think I'd use mozzarella instead of cheddar and use more Italian seasoning (oregano, basil).  No longer \"cheeseburger\" pasta, but it might be more flavorful. AnonymousSeattle, WA10/1/2019*This may be just me* but the 1 tsp of red pepper was way too much. All I could taste was heat. I wound up having to double the sauce (which honestly wasn't a bad thing afterwards, thankfully I get DiNapoli by the case) to tamp down the heat. Next time I'll probably stick to a quarter tsp. Amazing otherwise! Portland, Oregon9/30/2019Explore Bon AppétitPastaAmericanCavatappiPasta & NoodlesGround BeefBeefMeatCheddarCheeseEasyMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-16", "author": ["Condé Nast", "Amiel Stanek"]}