{"id": "807b66e0cca790389e6b0170883b2c44", "url": "https://www.bonappetit.com/story/japanese-sweet-potatoes", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Japanese Sweet Potatoes are the Best Sweet Potatoes—And I Don't Want to Hear Otherwise | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingJapanese Sweet Potatoes are the Best Sweet Potatoes—And I Don't Want to Hear OtherwiseWhite is the new orange.By Sarah JampelMarch 6, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailThe orange sweet potato has had its time in the sun. We've roasted it, we've \"loaded\" it, we've turned it into \"hummus\" (twice!). Some intrepid individuals have even disguised it as toast (the jury's out—I'm not convinced). That's all well and good, but I'd like to talk a little about the better sweet potato: the Japanese sweet potato.And if it's unnecessarily cruel and petty to rank one sweet potato over another—I have room in my heart, stomach, and kitchen for all kinds!—I'll just put it this way: I pick up four or five palm-sized Japanese sweet potatoes during my weekly grocery-shop. The Garnets and the Jewels appear only in the most particular of cases.Instagram contentThis content can also be viewed on the site it originates from.When I talk about Japanese sweet potatoes, I'm referring specifically to the Murasaki variety (available at Trader Joe's!), which have a deep magenta skin and white flesh that turns Champagne gold as it cooks. They're simultaneously drier and creamier than orange-fleshed sweet potatoes, which means that when you roast them at high heat (cubes, wedges, circles, or halves, simply coated with olive oil and salt and cooked between 425 and 450°), their edges get unbelievably crispy and burnished, belying the pudding-like centers. I find that orange sweet potatoes tend to sog out—at their best, they're fluffy and fall-apart tender, offering a mild, squishy relief in an assertive dish; at their worst, they're strangely wet and watery. Japanese sweet potatoes, on the other hand, are reliable in their ability to brown and char: If you're going to make sweet potato oven fries, look no further.But I also love to go solely soft and steam them in the Instant Pot, which takes about 8 minutes on high pressure. They're so naturally sweet—more of an earthy, chestnut-y sweetness rather than a sugary one—that the only adornment you need is a sprinkle of flaky salt, though I'm always even happier with a generous sprinkling of gomasio. Whereas steamed orange potatoes can be mushy, airy, or even stringy (I'm sorry but it's true!), steamed Japanese sweet potatoes are dense, luscious, and spoonable—the texture of a really cold cheesecake. My Strange Snack™ consists of a steamed sweet potato split down the center and spread with peanut butter (this brand and only this brand) and fig jam. I'll wrap it in parchment paper and break it out on the subway (sorry, Alex Delany) or when I only have a few minutes to scarf something down during a long day.I'll still use the orange sweet potatoes (not yams) if I'm making something mashed and potentially covered in marshmallows (or, preferably, spread onto bread), but when I want a portable snack, a crispy wedge, or a charred half, it's Muraski I turn to.Once you know Japanese sweet potatoes, it might be hard to return to the orange side. Don't say I didn't warn you.Explore Bon AppétitHealthyishSweet PotatoRead MorecookingI’m Never Not Making This Sweet Potato Dish AgainBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-06", "author": ["Condé Nast", "Sarah Jampel"]}