{"id": "807e3b41ad7e45aa5c382d828c3db734", "url": "https://www.bonappetit.com/story/gooseneck-kettle-feud", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "Some Small News of No Consequence | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSome Small News of No ConsequenceTidbits and silliness and pointless arguments from the week at the Bon Appétit offices.By Alex BeggsMarch 7, 2020FacebookTwitterEmailAntonin BorgeaudFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Belated postcard from ParisFlorence’s Paris apartment was filled with art and strings of colorful baubles. There was a miniature dollhouse kitchen scene displayed on a bookshelf; a huge oil painting consuming the entire wall of a teeny guest bathroom. So many DVDs! This was the first time I’d stayed in an Airbnb that was actually, clearly, someone’s home. So I kept joking that we’d return from dinner one night and Flo would be there, watching TV on the couch. Well...On my birthday, halfway through shaving my right leg in a luxurious Airbnb birthday bath, the doorbell rang. Assuming it was Bill (classic Bill) back from his run and too lazy to use the key, I ignored it. Until the door opened and a voice called out, “alooooooooo?” It was indeed Florence!!! She’d forgotten medication she needed, which happened to be in the bathroom where I was occupied in ze nude. So that—plus treating myself to a tortoiseshell hair comb with my name engraved upon it, and the big beans at La Buvette, and the blood sausage at Le Verre Volé, and a long lunch at the perfect restaurant Mokonuts—was the highlight of my trip to Paris.Back now!Want this letter before it hits the website? Sign up for our newsletter!Soooo what’d I miss?[Flips past 17 pages of gigantic world events.] What’s this? A Claire Saffitz cameo on Last Week Tonight with John Oliver!!! Yesss!The first thing I cookedWas Andy Baraghani’s caramelized cabbage (which SO MANY people are making!). It was ridiculously good. “I would not have imagined that cabbage could taste this good,” wrote Anonymous from Maryland. (That’s from the generous tomato paste + spice combo.) I loved it so much I had to ration it out in my lunch this week because overeating cabbage risks a gaseous condition I call “deflating mattress farts.” A nonstop stream of toots. Disturbing.Get the recipe: Fall-Apart Caramelized CabbageTrader Joe's store in New York City.Photo by Michael Brochstein/SOPA Images/LightRocket via Getty ImagesIn memoriamI was saddened to hear the news that the founder of Trader Joe’s, Joseph Coulombe, passed away last week. (Maybe some of you know about my life’s work reviewing the store’s new snacks, which comes from a place of love and devotion.) He wanted the store to be for “overeducated and underpaid people, for all the classical musicians, museum curators, journalists.” Gotta love that specificity. I’ll be raising a spicy cheese crunchy in his honor.In lady newsThis week, I read that the good martini restaurant Long Island Bar no longer calls their single-patty burger the “Ladies’ Burger.” Great, cool, fab. Alas, for every inch forward, a giant leap back, because I ALSO read that the new terrible bad restaurant from Mr. Salt Bae has a “FREE FOR LADIES” veggie burger that sounds like a crime against broccoli and gender discrimination laws.Get yourself a tube of almond pasteI baked the famous Chez Panisse almond cake following David Leibovitz’s recipe last weekend and it might be my new favorite cake in the world. It’s buttery, eggy, almondy moist sponge. It all happens in the food processor and I even froze a wedge of it for later. I love that about a cake: staying power.P&VLittle did I know when I invented a hard drink known as “hard prune juice” that Amiel Stanek was lightyears ahead of me. His recipe: drink half of a container of prune juice, then add vodka, give it a light shake to combine, and drink in a dark alleyway. “And you’re supposed to drink it FAST.” Noted.Read more: 17 New Hard Drinks the World Isn’t Ready ForEdit of the weekU got it, Meryl!!Tag of the weekUnnecessary food meme of the weekThis one really hit home.Unnecessary food feud of the weekPhoto by Ted CavanaughSarah Jampel asked the room: “People who have a gooseneck kettle, are you annoyed by how slowly it pours when you're using it for something other than coffee?” “It makes me feel fancy!” said Aliza Abarbanel. Amanda Shapiro is never annoyed by it, and, “it’s perfect for watering my plants.”Well I am annoyed! I use my kettle to make tea, instant oats, and to fill crusty pots with soapy water to soak; I switched from a gooseneck to this Cuisinart electric kettle that heats nearly instantly and I’m never going back. Jesse Sparks is with me: “Get a normal kettle and pour it slowly—it’s called mindfulness,” he said. Jampel is conflicted, as you can tell from the variation from lowercase to CAPS: “I’ve always wished that my neck were longer, so I admire them/they make me feel elegant,” she said. “I love the CONTROL they offer, but when you need to pour FAST, like when you’re soaking rice noodles, they are PAINFULLY slow.”Alex Delany uses his gooseneck for pour-over coffee and can’t fathom a situation in which he’d use it otherwise: “It’s not like you’re wasting years of your life because you have a gooseneck kettle,” he noted, gazing into both my past and future. Chris Morocco is obsessed with his: “Stagg is the best I have found. Annoying for tea because it comes out so slowly, still worth it.” (Maybe you’ve spotted the matte black kettle on his station in Test Kitchen videos.) Well this was a feud that didn’t really go anywhere. But some weeks are like that.Explore Bon AppétitBeggs NewsletterRead Moreculture17 New Hard Drinks the World Isn’t Ready ForBy Alex BeggscultureThere’s an Entire Industry Dedicated to Making Foods Crispy, and It Is WILDBy Alex BeggscultureIs It Ever Okay...to Bring 11 Items to the 10 Items or Less Aisle?By Alex BeggscultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-07", "author": ["Condé Nast", "Alex Beggs"]}