{"id": "808507033296d329e6dde07d710ba8e6", "url": "https://www.bonappetit.com/story/pulp-feud", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "My Favorite Farmers’ Market Challenge Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Favorite Farmers’ Market Challenge RecipeAnd I'm not the only one.By Alex BeggsAugust 17, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Challenge acceptedI made Chris’s eggplant and pork recipe from the Farmers’ Market Challenge last weekend and I can’t recommend it enough. But I wasn’t the only one who made it. Christal Yuen wrote about this recipe in (fittingly) The Greatist: “It’s got a kick of spice from the chiles, pops of crunch from the toasted sesame seeds,” she writes. “It tastes so good, it derailed my week.” Well, that last part is terrible news. You okay Christal? Was that you I saw listening to new Bon Iver on a park bench, crying and pointing at random strangers’ big dogs? Eggplant works in mysterious ways.Make it: Stir-Fried Eggplant with Basil and ChilesY’all are making Pop-Tarts?!Readers are actually making Claire Saffitz’s gourmet Pop-Tarts and it’s amazing.Speaking of aspirationsThe Coveteur visited Claire Saffitz’s kitchen, where she was casually making a layered funfetti cake, as one does. But my eyes were on those neat and tidy squeeze bottles of sherry vinegar and marsala wine, the evenly labeled HOMEMADE VANILLA, and the bounty of lemons. So many lemons, Claire! Whatcha gonna do with all those lemons?!I’ll have what Wishbone’s havingI had a fantastic Turkish meal at Lokanta in Astoria this week. The sweet, tangy, and creamy carrot and yogurt dip made me nearly lose my mind, until I tried the smoky but light and clean baba ganoush, the neon red muhammara (red pepper and walnut sauce), and baby lamb chops I ate like lollipops. Owner and one of New York’s finest characters, Orhan Yegen, was zooming around the restaurant checking on everyone, some of them friends and regulars, who he’d take a seat with, tell a wild story, sip some wine, and take a bite of whatever was being served—quality control. When a couple came in with a small, Wishbone dog who sat in his own chair, Orhan dropped off three menus.Want this letter before it hits the website? Sign up for our newsletter!Photo by Laura MurrayMUST readI almost missed my subway stop reading Hilary Cadigan’s story in our September issue about Gullah Geechee culture and the griot B.J. Dennis (learn what griot means when you read it), an absolute page-turner (or page-scroller) that widens your mind and makes your stomach desperate for this food. Hilary watches chef Gina Capers-Willis “stir a big pat of butter into creamy grits and then spoon smothered garlic crab on top. Ella [Gina’s mother] approves, giggling at my clumsy attempts to extract the sweet crabmeat as she chomps right through a claw with her 86-year-old teeth.”Read it: People Say Gullah Geechee Culture is Disappearing. BJ Dennis Says They're WrongCourtesy of Driscoll'sWhat will they pink up next?Driscoll’s announced a brand new rosé strawberry and raspberry this week and as someone generally interested in plant sex, I thought it was kinda interesting. In Peru, they’re breeding potatoes to be more nutrient rich for the sake of public health. In America, we’re breeding berries to be cuuUute. “These gorgeous blush-colored strawberries and raspberries are bred for their unique (and highly instagrammable!) color and aromatic flavor,” read the cheery press release. “Rosé Raspberries get their sunset coloring from their parents, the golden and red raspberries. As with the Rosé Strawberry, the flavor profile promises a sweet taste sensation.” SWEET TASTE SENSATION. When a berry hits my lips and I get that sweet taste sensation, oooEEE. My whole body starts to jiggle and wiggle. My eyes water happy tears. My wallet opens up as if by centrifugal force, BUY MORE BERRIES, it screams. THEY CUTE. Gotta check these out.Recipe comment(s) of the weekOn ratatouille pasta:On tomato toast:Crowdsurfing with croquemboucheWe sent the very funny, boneless wing-hating Jimmy O. Yang crowdsurfing with a croquembouche at Outside Lands last weekend, I guess?Freaky-deaky fan art of the weekUnnecessary food meme of the weekUnnecessary food feud of the weekWhen I mentioned I made this chia limeade last weekend (I loved it!), a discussion about ~textured drinks~ rang out. Specifically, orange juice with pulp. “No-pulp orange juice feels like drinking water,” said pro-pulper Rachel Karten. “I want to know I’m getting some fruit in there.” “If it doesn’t have pulp, it’s not fresh—and it tastes like mashed up vitamins,” declared Hilary Cadigan. Priya Krishna is “skeptical of all orange juice that isn’t squeezed in front of me.” Adam Rapoport said his son is staunchly anti-pulp, but he is fine with pulp, and then he told a short story about when Tropicana introduced “no pulp” in the olden days of yore. Okay. Emily Schultz calls pulp “icky” because it “gets in your teeth, you need to floss after, and no one likes the combo of orange juice and mint.” TRUE STORY, SCHULTZ! Christina Chaey is team pulp-less: “I like smooth soups, smooth peanut butter, smooth orange juice” and presumably, Santana’s “Smooth” ft. Rob Thomas. And we all know how Tony feels.Oh also, friends, I’ll be in Southwest Michigan this weekend. Any places I should eat, drink, or be wary? Let me know!Explore Bon AppétitBeggs NewsletterRead MorecultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggscultureCook the Cover! It’s FoolproofBy Alex BeggscultureA Summer Mood BoardBy Alex BeggscultureMake a Huge Pie This WeekendBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-17", "author": ["Condé Nast", "Alex Beggs"]}