{"id": "80997a6374af907840c425f80a3bbd02", "url": "https://www.bonappetit.com/story/kitchen-fear-love", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "In My Childhood Kitchen, I Learned Both Fear and Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn My Childhood Kitchen, I Learned Both Fear and LoveWhile surviving my stepfather’s abuse, I found unlikely solace in his cooking.By Hannah SelingerJuly 2, 2021FacebookTwitterEmailIllustration by Giovani RamosFacebookTwitterEmailR. stands at the stove, studying the contents of a wok. The oil has to ripple, he says, but not smoke. And there it is, glistening like a Maine pond on an August morning. Leaning down, he flicks the meat until it hits all the sides of the sloped pan, a plume rising from the center island, a hiss escaping, born of the marriage of oil and water. I am eight years old, enthralled by the foreignness of the experience, the purity of it. Purity is still a possibility. R. came into our lives in 1986. He’d been my mother’s high school sweetheart, then born-again lover after my parents divorced. They eventually married, and we moved out of our Brooklyn brownstone and into a house in Massachusetts. Before R., my mother and I had our own way of doing things and, despite her rigorous schedule as a public defender, she cooked dinner every night, mostly from a book called 365 Ways to Cook Chicken. Our food was ordinary: gelatinous Wishbone Italian dressing over iceberg lettuce; boxed rice pilaf plumped with bouillon; chicken breasts swathed in breadcrumbs and baked beneath pats of butter. We were not culinary explorers. What we ate was enough to feed us.But in our Massachusetts town, R. brought home ingredients I had never seen, like peanut and sesame oils for cooking and finishing, pink planks of pork foreign to my family’s Jewish table, or long-grain rice that came in a burlap sack and not in a microwavable bag. R. had been to many places. His adventures felt outsized and in the beginning, I wanted to know them all: his encounter with an upright cobra on the streets of Thailand, when he served in the Air Force; his college days skiing Alta; or his winding tales of Alice Springs, Australia, where he lived in his 20s, devouring pizzas topped with molten, runny eggs. These foods transported me to distant lands, away from the reality of life in that house. When he cooked, my narrow world cracked open. The possibility of more hopeful stories, elsewhere, sustained me. He was nothing like my father—a studious lawyer with an exacting, dark wit. R. was a towering, linear-thinking engineer. His working-class Catholic family was not 10 miles down the road, but R. had accrued a certain indefinable sophistication from his travels. And while I had no true sense of who he was (what he loved, where his passions lay, or even the nuances of his personality), his food revealed a world I never knew existed. A promise rose like vapor; his shiny wok held a million stories. It said, The world is so much bigger than this. It said, You can know the world too.I can’t recall exactly when the shift between us started. I remember mostly twinned moments: R. at the stove, tossing jewels of pork. R. wrenching me up the stairs by my hair when I was eight. There were midweek ski adventures to catch the fleeting fresh snow, our downhill runs punctuated by pliable disks of fried, butter-bathed dough sold on the slopes. And then there was the day he ripped the phone out of the wall and chased me out of the house, his anger so igneous that it inspired the person on the other line to come, unasked, to collect me.I didn’t know how to comprehend these wild vicissitudes. R. could be tender, in ways that smoothed over our fiery fights. Every other weekend, he drove me to Logan Airport so I could visit my father in New York. On our way back home, R. often pulled into Papa Gino’s, a New England chain that served my favorite pizza. We ate every slice of our pie, an act that defied our home’s “no junk food” clause. Holding this secret meant we shared something that belonged only to us, something other than the violence we also secreted away. However fleeting the gesture, back then I believed that R. loved me enough to stop for pizza. But our tenuous bond was just that. My siblings, born shortly after R. and my mother married, widened our family’s arc, disappearing me into the background. He worshipped his children, gave them love in a way I didn’t know he could, spun them around the room while the Hooters’ “And We Danced” blasted from the record player. A decade into my life, I already knew that an order had been established: them over me, their needs over mine. My mother may not have known our dynamics, though she seemed to understand R.’s temper and often encouraged me not to “push his buttons.” R. and I existed in this set of frenetic circumstances, seesawing between a shared sense of obligation and ambivalence. Yet, in the kitchen, there was mostly joy. I watched those cubes of pork take flight from his wok. I marveled at his stir-fries, and even the bold choice to serve springy ramen noodles as a side dish. These foods transported me to distant lands, away from the reality of life in that house. When he cooked, my narrow world cracked open. The possibility of more hopeful stories, elsewhere, sustained me. I may have felt invisible at home, but at school, I asserted my existence by acting out. I was a throbbing nerve center of a child, a girl who came home with straight A’s—except in the “conduct” category, where my chattiness and attitude earned me demerits. In the third grade, I kicked a substitute teacher and spent the afternoon in detention while my classmates went swimming at the Y. My therapist asked my parents to stop sending me. So did my summer camp. My problem was that I wasn’t able to articulate all that I’d lost: my home in Brooklyn, my father, the way my family once was. I spent years imagining an escape. My plan was to return to New York for college, an adventure and homecoming, but one that felt distinctly far-off—until one sticky summer morning, when I was 14. R. slapped me across the face in front of the babysitter. Before that moment, no one else had witnessed how he treated me. The truth suddenly snapped into focus. R. and I had vanished into something so dark and familiar, we didn’t know how else, or who else, to be. If I wanted to exist, I needed to leave. The purest agony of abuse is that you can hold both revulsion and love for the things that harm you. Love and abuse are vacuums, consuming one another. We love our abusers. We want them to love us back. However complicated and bittersweet, through R., I gained an appreciation for food that would last long after I left home. After college, I worked as a bartender, then as a captain, and, finally, as a sommelier, eventually landing at a buzzy, critically acclaimed restaurant. The chef orchestrated a culture of toxicity that reminded me of life in my childhood home. Sometimes my boss was kind, and I leaned into those moments, as I had so many times before. It surprised me how easily I reentered that familiar space. I was hungry, had always been hungry, for even the smallest acts of affection and approval.I still think, perhaps a little too often, of the dishes I loved at that restaurant: grill-charred sweetbreads with pickled chiles; chewy, spicy rice cakes slicked with ground pork sauce; pucks of salty-sweet pork belly floating atop pillowy buns; a flurry of frozen, shaved foie gras that warmed in the mouth. It’s possible, I’ve found, to keep affection and fear as paired emotions, to both appreciate a memory and revile its circumstances. It’s been a decade since R. was last in my life. But when I think of that time, pain is separate from the meals he set in front of me. Perhaps those were the only acts of love he could manage. Perhaps, too, what I needed he could never give me. Now, when I cook for my own willful young children, they want nothing to do with my culinary exactitude. Most nights, they ask for hot, salty pasta. My four-year-old often reminds me, though, that what I serve doesn’t matter. “You’re the best cooker, Mommy,” he says. And this isn’t because the pasta I make is any better than the millions of other pastas he’s ever eaten. My children seem to understand, already, that food can be a deliverance of love. At the table, they pick up rotini and fusilli with their bare hands, relishing each bite. It’s messy and wild and perfect. They finish everything as I watch, moved by the purity. The possibility.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-02", "author": ["Condé Nast", "Hannah Selinger"]}