{"id": "80b38a21113e41d13db39356ed3d4b01", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/japanese-ice-ouca", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Japanese Ice Ouca Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoJapanese Ice OucaLuscious Italian-style gelato meets uniquely Japanese flavors.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE FOR: Tokyo’s answer to the gelateria. The fact that the city does some of the best Italian food outside of Italy is not a secret. And while Neapolitan pizza is the most famous example, the artisans at Japanese Ice Ouca have taken the Italian philosophy of gelato and put it through a filter of local flavors. Creamy matcha is an obvious choice, but nutty hojicha (roasted green tea), black sesame, and Kyoto cinnamon cookie are flavors that you are unlikely to see elsewhere. Japanese fruits and vegetables are well represented by a rotating selection of sorbets. Every order is accompanied by a crispy wafer for scooping, and salty shio konbu for palate cleansing.ORDER THE: three flavors you like best. Cups come in four different sizes. Like any good gelateria, flavors rotate often, so availability may vary. Be sure to look for the seasonal specials, such as shaved ice in the summer and roasted sweet potato and milk ice cream in the winter.THE VIBE IS: clean and bright. Counters are made of blond wood and the staff wear crisp white uniforms. The shop is, like so much in the city, small, so patrons often spill out onto the sidewalk to eat their treats.PRACTICAL STUFF: Open daily. From March to October the hours are 11 a.m. to 11:30 p.m., and from November to February the hours are noon to 11 p.m. The menu is available in English, and the staff speaks some English as well. The nearest subway stop is Ebisu.Photo by Xavier Girard LachaîneThere’s not much room in the shop, but ice cream eaters spill into the nearby sidewalk.\nPhoto by Xavier Girard LachaîneThe flavors rotate with the seasons, so look for specials.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}