{"id": "80b6644e8ced7c723a1a8dacbc6be6f6", "url": "https://www.bonappetit.com/story/how-to-thicken-soup", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "How to Thicken Soup Quickly, No Cornstarch Required | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Thicken Soup Quickly, No Cornstarch RequiredThe savior for thin soup is something you definitely have in your pantry.By Molly BazFebruary 21, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food styling by Rhoda BooneFacebookTwitterEmailSoup gets the short end of the stick when it comes to quick and easy weeknight meal planning. You rarely see soup on a list of top meals to be made in under 30 minutes. You’ve probably learned that soups require lots of good simmering time for the ingredients to meld, and that the liquid should cook down until you’ve got something full bodied and delish. That’s only partly true.You’re right about wanting to spend time developing flavor, but equipped with the right ingredients, that doesn’t need to take hours to do. A good base of garlic, onions, and other potent aromatics can get you to flavor town in just a few minutes of simmering.But what about that whole full-bodied element? On a day like today (it’s currently sleeting cats and doggos in NYC), I crave a soup that is not only robustly flavored, but also thick and rich, with some heft to it. It’s that viscosity that gives a soup that satisfying stick-to-your bones feel, and enables it to hold its own as a meal. A brothy soup is great, but a brothy soup with a super sweet bod is even greater. There are many ways to thicken a soup—cornstarch, potato starch, flour, bread—but I’m here to introduce you to a lesser known technique. And it’s one that is equal parts delicious, nutritious, and functional.So what’s the trick to thickening on the quick? A handful of uncooked rice. That’s all folks, just a handful of white rice. Any kind will do: jasmine, basmati, short grain, long grain. When added to a brothy (or watery, even) soup, and left to simmer for 20-30 minutes, the rice breaks down, releasing its starch and thickening the liquid that it's cooking in. It’s a double whammy because you get that added rice-y flavor and bonus thickening, leaving you fuller and more satisfied. No need to make a slurry, or a roux, or to start Googling those words if you’ve never heard of them.No more weak sauce, watery weeknight soup, okay? Rice-thickened soup is here to save you.Well, well, well. Look who showed up:Chicken and Rice Soup with Garlicky Chile OilThis comforting, fried garlic-topped chicken soup tastes like it took hours to make but comes together in a flash.View RecipeExplore Bon AppétitRiceSoupBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Molly Baz"]}