{"id": "80bb8c0ad2165bf964d63db2cd4795e0", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/now-serving", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Now Serving Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesNow ServingChinatown’s darling cookbook (and ceramics!) shopFacebookPinterestTwitterEmailAdam AmengualGO: to the city’s best cookbook shop, curated by former Cut chef Ken Concepcion and his wife and make-up artist Michelle Mungcal. Now Serving also happens to stock the coolest ceramics (graphic Mt. Washington Pottery bowls, otherworldly Minh Singer dishes), indie food magazines, and actually useful cooking tools (J.B. Prince tweezers!).BUY: all the cookbooks you could ever want, whether it’s a new release from a buzzy chef or an rare, out-of-print classic. Now Serving probably has it.THE VIBE IS: homey. Basket-like lamps loom over tables filled with the most stylish kitchen gear, while a big fig leaf tree flanks tall shelves with indie food magazines and cookbooks you’ll actually want to cook from. When visiting chefs and cookbook authors host cookbook parties or panels at the shop, it feels like one big house party. (Check the site for upcoming events.)PRACTICAL STUFF: Open Monday to Saturday, 11 a.m. to 7 p.m., and Sunday, noon to 5 p.m. Closed on Monday and Tuesday.—Elyse InaminePhoto by Graham WalzerAdam AmengualWE ALSO LOVEPhilippe the OriginalDip to your heart’s content at this legendary Downtown L.A. sandwich shopTortoise General StoreVenice Beach's answer to cool Japanese designRiceBarEverything’s coming up rice bowls in downtown L.A.Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}