{"id": "80bdc759427727438c014cac8829cbc1", "url": "https://www.bonappetit.com/recipe/kaju-katli", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Kaju Katli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueKaju KatliBy Priya KrishnaOctober 20, 20204.7(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThis five-ingredient sweet is Priya Krishna’s all-time favorite, and it’s as good for a Wednesday-afternoon snack (keep some in your freezer!) as it is for a Diwali celebration. Priya first made kaju katli, also called kaju ki barfi, this spring, after finding silver leaf her mother brought to the U.S. from India in the ’80s. Then she read countless blogs in an attempt to perfect the recipe. The one she found most helpful was Cook With Manali; this version is inspired by Manali Singh’s recipe. Silver leaf, or varak, is usually available as thinly pressed sheets and can be purchased online ($10 for 10 sheets; amazon.com). Just make sure it’s specifically labeled as edible. You can also try swapping the cashews (that’s kaju in Hindi and Urdu) in this recipe for pistachios or almonds.Ingredients1cup raw cashews½cup sugar¼tsp. freshly ground cardamom2tsp. gheeVarak (edible silver leaf; optional)special equipmentA candy thermometerPreparationStep 1Place 2 large pieces of parchment (at least 12\" long) on a work surface. Pulse cashews in a food processor or coffee grinder to a fine powder. Set a mesh sieve over a medium bowl and sift cashew powder into bowl. Return any larger pieces still in sieve to processor and pulse again to break up further (but be careful not to turn into nut butter). Sift into bowl; set cashew powder aside.Step 2Heat sugar and ¼ cup water in a medium saucepan over medium, stirring constantly, until sugar is dissolved; stir in cardamom. Clip thermometer to side of pan and bring mixture to a boil (still over medium). Cook, stirring often, until thermometer registers 230°–235° (mixture should be syrupy but not thick), about 3 minutes.Step 3Reduce heat to low. Stir in ghee and reserved cashew powder. Cook, stirring constantly, until dough begins to pull away from sides of pan and form a mass in the center, about 3 minutes. Be careful, as the sugar will make the dough very, very hot. (You can check if the dough is ready by carefully scooping out a small spoonful and letting it cool until safe to touch. If you can roll it into a ball and it holds its shape, it’s ready.)Step 4Transfer dough to 1 sheet of parchment. Let cool until safe to handle (dough will stay hot in the center, so be very careful). Knead warm dough 1 minute, then top with the remaining sheet of parchment. Roll out to create an oval about ½\" thick. Peel away top layer of parchment and carefully apply silver leaf (if using) to surface. Using a paring knife and a ruler, cut dough into 1\"-wide strips. Then make diagonal cuts at 1\" intervals across the strips to create diamond shapes. Separate out individual kaju katli. (Save scraps for snacking on later.)Step 5Do ahead: Kaju katli can be made 1 month ahead. Transfer to an airtight container; cover and chill, or freeze up to 3 months.How would you rate Kaju Katli?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleCould you use coconut oil instead of ghee?Jerusalem ChickJerusalem Israel11/4/2021I wish I could post a photo because the turned out so beautiful! Thank you for sharing such a great recipe. Loved reading your story about Kaju Katli :)CPNY, NY11/22/2020Excellent end product. Clear excellent instructions. PBoTampa, Florida11/14/2020Any harm in topping with a thin layer of dark chocolate instead of silver?MSFDetroit11/13/2020Try chilling the cashews overnight (or you can pop in the freezer for 20-30 mins) before pulsing them in the processor. Will prevent the cashews from becoming too warm and becoming nut butter quickly. AlishaAstoria, NY11/11/2020Super straight forward and easy! For those who do not have a candy thermometer, my mom suggested the one string test: rub a little of the sugar mixture in on your thumb and pointer finger, pull apart and see if you can get a thin string to stay put. You want it to stay, and not be too thick. So just when it holds together it's done. AnonymousNew York, NY11/9/2020Explore Bon AppétitCandyDessertIndianSouth AsianAsianCashewNutFallSnackGluten-FreeHealthyishNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Priya Krishna"]}