{"id": "80bd85cccad5a931707cbd968debbcbe", "url": "https://www.bonappetit.com/story/never-fail-pork-ragu-over-creamy-polenta", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "This Pork Ragu Over Creamy Polenta Is My Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pork Ragu Over Creamy Polenta Is My EverythingI love all winter braises, but this is the one I make all. the. time.By Emma WartzmanFebruary 22, 2019FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I’m a big fan of pretty much any braise. It’s the most warming, flavorful, bang-for-your-buck way to eat in the colder months. But the one I make the most? The one that has been on repeat since I first tried it a few years ago? It’s this Pork Ragu Over Creamy Polenta.The formula for any braise is the same: generously salted and deeply browned meat, aromatics, liquid, and time. Generally, you’ll see stock or wine or even water as the liquid, but it was the tomato-sauce-as-braising-liquid part of this recipe that really won me over. (Or, more specifically, a can of whole peeled tomatoes that breaks down into a liquid it cooks—it's not much more complicated than that). It’s bright and acidic, the perfect foil to all those fatty, porky juices that get released as the meat breaks down into ultra-tender, shredded bliss. (Yeah, you want to make it already, don't you?!)The rest of the ingredients could not be more straightforward. There’s pork shoulder, the cheapest of the cheap cuts of meat, plus onion, garlic, and a mixture of hardy herbs. (The recipe calls for thyme, rosemary, and bay leaves specifically, though more often than not I just use whichever one happens to be in my fridge—no harm, no foul.) A can of tomatoes, a bit of tomato paste, a splash of red wine. Seriously: That's it! No obscure spices you have to hunt around for. No expensive hunks of meat. No prep bowls piled high with an array of elaborately chopped vegetables. You can probably get away without even making a shopping list!Now, about the whole time thing. There's about an hour or so of somewhat involved cooking on the front end, but once everything is simmering away in your Dutch oven you can set it and forget it. This makes it a great meal prep project for a lazy Sunday afternoon. You  can start the ragu around noon and then go do whatever productive things you're definitely doing on said Sunday, checking back in every so often to give it a stir, maybe add a splash of water, and to tell it you love it and can’t wait to eat it. Before you know it, you've got dinner and a week's worth of delicious, braise-y lunches.Canned tomatoes are kind of winter's MVP.\nPhoto by Alex LauBut my favorite thing to do with this pork ragu is to serve it for a dinner party. It is, without a doubt, the most universally crowd-pleasing dish I make on a regular basis. It looks way fancier than it is, with creamy polenta underneath and a sprinkling of Parmesan and some chopped-up parsley on top. It tastes comforting and indulgent without being a total gut-buster. It feeds a crowd without breaking the bank. What more could you possibly want from a dinner party main?If every last bite doesn't get completely devoured by your guests (highly unlikely), or if you did the whole meal prep thing, the leftovers are deliciously flexible. You can use it as a pasta sauce—just heat it in a skillet, toss in your cooked noodles and a splash of starchy water, and you've got restaurant-worthy pasta on a Tuesday. You can eat it spooned over scrambled eggs for an easy dinner. You mix it with boiled potatoes and crisp it all in a pan like a hash. You can pile it high between slices of bread and call it a sandwich. You can bring it for lunch with absolutely nothing extra at all and your co-workers will still be jealous. It doesn’t take much with something this good.Get the recipe:Pork Ragù over Creamy PolentaView RecipeExplore Bon AppétitRaguPolentaBraiseBasicallyPork ShoulderNever FailRead MorecookingBraise On! How to Transform Tough Cuts of Meat into a Feast, No Recipe RequiredBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Emma Wartzman"]}