{"id": "80cd8ea0a02b7b735558354cb9f8476e", "url": "https://www.bonappetit.com/story/corn-salad-with-hot-honey-dressing", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Eat This Corn Salad with Hot-Honey Dressing Outside in Your Shortest Shorts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEat This Corn Salad with Hot-Honey Dressing Outside in Your Shortest ShortsThis new recipe should be mandatory at every summer cookout.By Aliza AbarbanelJune 26, 2018FacebookTwitterEmailFacebookTwitterEmailA few weekends ago, I went upstate with a group of friends. We brought the necessities for outdoor life: bug spray, hamburger patties, and too much just enough beer. After bagels and a meandering “hike”, it came time to turn on the grill. This was the moment when I realized we were woefully underprepared.There were no sides. No kimchi slaw, no charred bean and pea salad. We didn’t even have an obligatory mayo-drenched pasta salad! Conveniently, I did have Bon Appetit’s summer grilling issue. Probably because I work there. I searched for a recipe that could be made with an understocked pantry and landed on this grilled corn salad with hot-honey dressing from B’s Cracklin’ BBQ in Atlanta.All we needed was: corn, limes, herbs, and chiles. The cilantro at the local market looked sad, so I subbed in mint because it was the perkiest bundle of herbs I could find. Then, we booked it back to the rental kitchen.Rosé sangria won’t hurt with this herby salad.\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaThey say a good leader is marked by their ability to deligate, and man, did I boss my friends around. We shucked the corn, buttered them up, and grilled until the kernels were tender and charred in spots, about 10–12 minutes. Somewhere around this time, an eggplant materialized, and a grilled eggplant Caprese salad shortly followed. So did a pitcher of sangria. (Turns out that cache of beer went surprisingly fast.)While a friend manned the grill, I whisked together a dressing from lime juice, honey, Sriracha, granulated garlic, and salt. Once the corn was cool enough to handle, we cut the kernels off the cob and added them into the vinaigrette.Next came the herbs, chile, and avocado, which get tossed together until everything’s coated. You know the rest of the drill: salt and pepper, cover tightly with plastic wrap, and chill. You’re supposed to chill for at least two hours to let the dressing marinate, but I won’t lie to you, we lasted about 45 minutes until digging in. I blame the sangria.At the risk of sounding too smug, I have to brag about how delicious this corn salad was with burgers. It was crunchy and fresh, with little bursts of sweetness from the corn kernels set over the top by that hot-honey dressing. The mint and lime cut through, providing some much-needed brightness, and I’m sure that cilantro would have worked even better. We ate it outside, gazing at mountains and basking in the satisfaction of a meal well made. I like to think this salad would taste equally good indoors, in my dark apartment kitchen set to the soundtrack of city traffic, but I haven’t tested this theory. I don’t want to ruin that moment.Get the recipeGrilled Corn Salad with Hot Honey–Lime DressingBright and light, this grilled corn salad with avocado will go with everything else at your summer barbecue.View RecipeAnother summer classic: Brad’s campfire ribsExplore Bon AppétitCornSummer SideshoneyRead MorecookingThis Spicy Kimchi Slaw Provides More Balance Than a Yoga ClassBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-26", "author": ["Condé Nast", "Aliza Abarbanel"]}