{"id": "80fcdd32c66ffc2c7717d9edeaf52f08", "url": "https://www.bonappetit.com/story/murrays-creme-de-cocoa", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "I Love Chocolate. I Love Cheese. I Love Chocolate Cheese. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Love Chocolate. I Love Cheese. I Love Chocolate Cheese.Murray’s Cave Aged Triple Crème de Cocoa is a pairing for the ages.By MacKenzie Chung FeganFebruary 14, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The cronut. Quesabirria. Pie milkshakes. Pizza bagels. The great food mashups of our era. To this, please welcome two Valentine’s Day heavy hitters, joined together in an unlikely union that really, really works: chocolate cheese.The pairing is not completely novel (just ask Ween). I like to add a little chevre to chocolate frosting to make it extra tangy, and in parts of Latin America, a cube of Edam or queso fresco is stirred into frothy hot chocolate. Also: chocolate cheesecake. But all these iterations require preparation. The fastest route to chocolate cheese is this Cave Aged Triple Crème de Cocoa, a limited-edition wheel dropping today at Murray’s Cheese.Photo courtesy Murray'sCave Aged Triple Creme de Cocoa$48 at Murray's Cheese (price per pound)Murray’s starts with unaged rounds of St. Stephen triple cream, a dense, buttery cow’s milk cheese from Four Fat Fowl in New York’s Hudson Valley. The wheels are sliced in half across the equator, and a thin layer of melted chocolate—a dark milk from French chocolatier Pralus—is poured on top. The halves are then put back together and the rounds spend two weeks aging in a cave, a romantic honeymoon period during which the chocolate and cheese get real cozy and familiar. The result is a cheese that, when sliced open, resembles a Morbier or Humboldt Fog—except instead of a horizontal vein of ash, it’s chocolate.The chocolate is a fruity, bitter foil to the richness of the triple cream, but it’s also measured and subtle, playing nice with both sweet and savory flavors. I tried it on Moonshot sourdough crackers with a swipe of strawberry, chipotle, and fig Trade Street jam. I paired it with black sesame crunchy butter on vanilla shortbread cookies. I wrapped it in Bayonne ham. I ate it cold from the fridge and heated in a cheese baker until slightly runny. I wondered how “limited” this limited edition was and if I could get my hands on several more wheels.Like Gwen Stefani and Blake Shelton, some initially perplexing couples end up making a lot of sense, if you think about it. Chocolate and cheese, I wish you many years of continued happiness.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-14", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}