{"id": "80fc9a07c7cee3e91f7fd184747d350e", "url": "https://www.bonappetit.com/recipe/muhammara-2", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Muhammara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueMuhammaraBy Kamal MouzawakSeptember 8, 20214.7(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintThis vibrant Lebanese muhammara recipe from Lebanese restaurateur Kamal Mouzawak is sweet, earthy, just a bit smokey, and ideal when eaten with fresh pita. While the dish originated in the Syrian city of Aleppo, variations on it are served across much of the Middle East. Cooks throughout the region sometimes use a chile paste called biber salcasi, a specialty of Aleppo and southeastern Turkey, that can be hard to find in the United States. We’ve subbed in mild chile flakes but you could use a chopped fresh red chile instead. For the most flavor, start with whole red bell peppers and broil them yourself as jarred ones won’t have as much flavor.Check out more of Kamal’s recipes for a truly flavorful Lebanese feast, like a smoky eggplant dip called moutabal and Seven-Spice Grilled Lamb Chops with Parsley Salad.Editor’s note: This recipe was originally published on April 16, 2019.Ingredients4 servings1cup walnuts3large red bell peppers½cup fine fresh breadcrumbs2Tbsp. extra-virgin olive oil2Tbsp. Aleppo-style or Maras pepper or other mild chile flakes1Tbsp. tahini1tsp. fresh lemon juice½tsp. paprika2Tbsp. pomegranate molasses, plus more for drizzlingKosher saltIngredient InfoPomegranate molasses, a thick pomegranate syrup, can be found at Middle Eastern markets, some supermarkets, and online.PreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown and fragrant, 8–10 minutes. Let cool. Pick out a few walnuts for serving and coarsely chop; set aside.Step 2Meanwhile, place a rack in upper third of oven and heat broiler. Broil bell peppers on a rimmed baking sheet, turning occasionally, until skins are charred and flesh is softened, 12–15 minutes. (Alternatively, you can char over a gas burner on medium-high, turning occasionally with tongs, 12–15 minutes.)Step 3Transfer bell peppers to a medium bowl and cover tightly with plastic wrap so that they steam, 10 minutes (this extends the cooking and also makes it easier to remove the skins).Step 4Remove skins from bell peppers (it’s okay if some bits don’t come off); remove and discard ribs and seeds. Pulse bell peppers, breadcrumbs, oil, Aleppo-style pepper, tahini, lemon juice, paprika, toasted walnuts, and 2 Tbsp. pomegranate molasses in a food processor until mostly smooth; season muhammara with salt.Step 5Transfer muhammara to a small bowl; drizzle with more pomegranate molasses and top with reserved chopped walnuts.How would you rate Muhammara?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI added a half teaspoon of cumin and made my own pomegranate reduction. I love this because it is natural and healthy...very little fat and flavor is fantastic. Lynn DDestin, Fl12/5/2021I haven't even made it but the ingredients are ringing my taste buds.  As an Egyptian i know hummus style and this one looks GOOD.MervetOlympia, WA12/1/2021HELLO, ive been spreading the goodnews of GODS kingdom, the paradise. the bible says we can save both ourselves and those who listen to us. and that it makes our hope more sure to speak to others about GODS kingdom to come. ive been asking folks to pray and spread this goodnews to everyone you see. ephesians chapter 6 says to open your mouth and speak with boldness about the paradise, GODS kingdom. revelation 21:3,4 has a happy ending for us im hoping you will read these verses in revelation 21:3,4. im so anxious to try your recipe it sounds very good especially with the pomagranite juice. yummy thank you denise kingMcminnville, Tennessee10/11/2021It was ok. My Syrian friend uses red pepper paste and cumin in his and I think it is far better than this version.AnonymousNY9/16/2021Delicious! But I'd love for Bon Appetit to move away from telling people to use plastic wrap or any single-use plastic when possible. Just cover the bowl with a lid or a plate. That does the trick! Nina VT8/8/2021Muhammarah is one of the very best foods that I have discovered in recent years. It was love at first bite. Sometimes for a potluck, I take a dish of it, plus my homemade hummus & baba ganoush, served with toasted pita chips- this trio is a hit. I have even used muhammarah as a pasta sauce, serving it over angel-hair pasta for an exotic touch that no one can identify.FranciscoTegucigalpa, Honduras6/10/2021I'm obsessed! I've made it 3 times in the last month. I put it on everything. So easy to make too! \nAlexandra Fort Collins, Co12/18/2020Did what I could with what I had: jarred roasted red peppers instead of fresh, and a tiny bit of molasses plus a touch more lemon juice in place of the pomegranate molasses. (Will get a fresh bottle of that for next time.) Delicious and gratifying.da midwest, ya hey6/6/2020I made this recipe for a friends get together tonight and it was a hit! Soooo delicious! The only thing different I did was instead of 2Tbls of mild chili flakes, I used 1Tbls of red pepper flakes. It had a pretty good bite, so might only use 1/2 Tbls next time but will most definitely make again! It was delicious!PeskywifeCalifornia 10/28/2019This recipe was amazing.  We made a meal for family with all the recipes in this issue - the Shish Taouk, the smokey eggplant dip, the lamb - all if it was amazing but the Muhammara was the hit.  Spicy, smokey and sweet - it's got all the deliciousness.  We charred the peppers on the grill outside the first time and inside on the gas stovetop the second time.  The first is faster and bit easier on the clean up - but both ways are equally yummy!  Finding the pomegranate molasses initially was a challenge but discovered it's also super easy to make so don't let that hold you back! AnonymousToronto, Canada6/15/2019Great balance of sweet, sour and spicy, all at once!  Super simple - just roast the peppers and toast the walnuts, then throw everything into the blender.  Don't skip the pomegranate molasses - it's fantastic!  (We'll be using the rest of the bottle for anything from pancake and ice cream topping, to glazes for other grilled meats!)TXHuskerTexas5/28/2019This is an easy, delicious spread. It is a bit spicy as directed, so tone down the chile flakes (or your alternative) if you don't like the kick. I would make this again to bring to work with some veggies.AnonymousSan Diego, CA5/20/2019This is a delicious spread that enhances chicken, meat, fish or vegetables. Even though roasting peppers is time consuming, the end result makes the effort worthwhile. AnonymousIsrael5/19/2019Explore Bon AppétitDipCondimentLebaneseMiddle EasternWalnutNutBell PepperVegetableStarterDairy-FreeVegetarianVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Kamal Mouzawak"]}