{"id": "8102eb66f9aea7543449b9d96998171c", "url": "https://www.bonappetit.com/story/what-together-means-when-were-apart", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "What “Together” Means When We’re Apart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat “Together” Means When We’re ApartIn our isolation, we need to think, more than ever, about community.By Amanda ShapiroMarch 19, 2020FacebookTwitterEmailPhoto by Peden & MunkFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,At the beginning of last week, BA staffers were working on a dinner party feature for the fall, sending writers on road trips, cooking and filming in the test kitchen, walking to Los Tacos No. 1 for lunch, and talking about our upcoming vacations.None of that is happening now. Instead, we’ve all been working at a dizzying speed to make our site, including Healthyish and Basically, as helpful, comforting, and relevant as possible considering where we’re at (home) and where you’re at (also home, I hope).In case you’re looking, we’ve got SO many recipe galleries: Beans! Canned tomatoes! Tinned fish! We’ve got encouragement for new home cooks. Eighty-nine(!) recipes that use only five ingredients. And all the comfort food our staff is making right now.Meanwhile, we’ve been talking to people in the restaurant and food world pretty much nonstop about how their lives have been affected by coronavirus. The owner of Rancho Gordo beans, an indigenous chef in the Twin Cities, a D.C. caterer, and so many more are creating an important record of the industry at this unprecedented time.Want to help these restaurants and their staff right now? We’ve put together a list of ways to do that, and we’ll be rolling out more suggestions in the coming days, weeks, and months. Need to order coffee? We got you covered. How about wine? We’re working on that too.Here at Healthyish, we’ve got 17 ways to feel better while stuck at home and 6 ingredients we’re doubling down on for mental and physical health. Remember chickpeas? Here are 29 healthyish recipes using them. Also did I mention Chris Morocco’s new Creamy-ish of Mushroom Soup? Kind of nonsensical name, really amazing (and vegan) recipe.Photo by Emma Fishman, Food Styling by Pearl JonesFor my part, I’ve been thinking a lot about how differently people respond to uncertainty and stress. For example, a lot of my co-workers—and so many others—are finding solace in cooking right now, whereas I’ve had trouble mustering the energy to turn on my stove. It’s a great irony, considering my recent dedication to #notmealprep, how little I want to cook now that I’m “supposed to.” I never did like being told what to do.So what am I doing? Honestly, working—because there’s a lot to do, but also because it helps me feel productive, distracted, and like I’m helping somehow. I’m walking my dog and dancing in my sweatpants and calling the people I love. Wondering if I should order some free weights for the weeks and months ahead. Wondering whether it’s a blessing or a curse to live alone right now. It feels like both, depending on the hour.Last night, I finally managed to roast a kabocha squash and sauté a can of white beans for dinner. I did it “with” two friends who FaceTimed me from their Williamsburg kitchen two miles away. We cooked and ate “together,” and I laughed more than I had in a week.We may be stuck inside, but we need to take care of each other more than ever right now. In our isolation, we need to think, more than ever, about community. We need to protect the most vulnerable among us—from infection, yes, but also from loneliness, depression, and fear.I said it last week and I’ll say it again: We’re in this together, even if we’re apart.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishSelf CareHealthyish NewsletterCoronavirusessayRead MoreLifestyleA Short List of Good ThingsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-19", "author": ["Condé Nast", "Amanda Shapiro"]}