{"id": "8108328c6ad443a57249b5a0fbcd65bb", "url": "https://www.bonappetit.com/story/new-burgundy", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "The New Burgundy Wines Are Not as Bougie as You Think | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe New Burgundy Wines Are Not as Bougie as You ThinkThe region that exudes exclusivity is actually home to many reasonably priced natural wine producers, including my current favorite, Vincent Thomas.By Marissa A. RossJuly 19, 2019FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.Burgundy just feels bougie. I always want to say it in “A Rich Person” accent, which is just a bad impersonation of Eva Gabor from re-runs of Green Acres. It’s one of those wine regions that only “wine people” seemed to “get”—a kissing cousin of Bordeaux that exudes exclusivity, luxury, and opulence even when it’s been featured on Viceland. But while there are plenty of highly coveted and expensive bottles out there for the NBA players, there is tons of fun and affordable Burgundy out there for the rest of us.A great example is Burgundian winemaker Vincent Thomas. Chances are you’ve seen his Domaine de la Chappe wines, with their personified labels depicting cartoonish yet charismatic characters like “Apoline.” Judging by her portrait, “Apoline” is a woman you want to have a glass with (I feel like she tells good jokes), but more importantly, this is an Aligoté—Burgundy’s second most popular white grape after Chardonnay—that you want to drink.Hazy and flaxen in the glass, it smells like barely budding grass and wildflowers coming in the car windows while driving through a canyon of salt. It goes down like limeade with a few melted ice cubes, with notes of dusty thyme and a lemon-squeeze finish. Light and sharp, “Apoline” is a perfect lunch date that I would also love to have over for dinner the next time we do roast chicken or one of those big summery salads. “Apoline” is versatile and food-friendly, but what I love most about it is it’s enjoyable to drink and reasonably priced (typically around $33/bottle). It’s Burgundy without the hemming and hawing of whether you should open it, without the need to wax poetic about over it. You can just fucking drink it.Between Thomas, Nicolas Vauthier of Vini Viti Vinci, and Julien Altaber—three natural wine favorites all producing bomb bottles you can nab under $40—Burgundy is primed to become the next Beaujolais. Beaujolais in recent years has been the region to roll off everyone’s tongue along with romantic professions for its beloved grape, Gamay. But there’s plenty of Gamay, Pinot Noir, Chardonnay, and Aligoté in Burgundy, all with that high acid and juiciness no one can get enough of. Not to mention Beaujolais is literally in Burgundy. (It’s a sub-region of the region of Burgundy.)This is total speculation, but part of me does wonder if the way Beaujolais’ low-alcohol bottles of glou-glou captured the hearts of the modern wine world after decades of decadence had any influence over its northern neighbors. Thomas himself is a younger, second-generation winemaker who took over his father’s nearly six acres of vines and began farming organically and making less traditional wines in 2003. But the bigger part of me believes there has always been lighter, unique, and affordable wines in Burgundy, and the American market is just now ready to simply enjoy Burgundy, rather than collecting it, revering it, or being intimidated by it.Regardless of how the bottles got on the shelves, all I know is that they are delightful and don’t cost an arm and a leg. And even when I’m a big enough baller to be drinking vintage Domaine de Chassorney in ensembles featured on @LeagueFits Instagram, it’s bottles like Domaine de la Chappe’s I’ll still be proudly pouring for my friends to have delicious fun with.Explore Bon AppétitHealthyishnatural wineWineUnfiltered TrendsRead MoreLifestyleI Shouldn't Be Writing About These New Zealand Wines, But I Just Can't NotBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-19", "author": ["Condé Nast", "Marissa A. Ross"]}