{"id": "812e3de47e357b48ebba58e41098f8e1", "url": "https://www.bonappetit.com/story/best-sleepytime-tea-brands", "year": 2021.0, "month": 7.0, "day": 5.0, "content": "The 8 Best Teas for Sleep According to a Very Yawny Bon Appétit Editor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Tried the Best Teas for Sleep and Here’s What I ZzzzzzzzzzzzzzYou’re getting very sleepy.By Alex BeggsJuly 29, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My speech was slurring, my tongue felt a little fuzzy, and I asked a room of my colleagues, “Why haven’t we ever discussed everyone’s favorite apple? Mine’s Winesap.” This was neither funny nor interesting. I put down my gigantic thermos of “Mother’s Little Helper,” a potent caffeine-free herbal tea by David’s Tea. But Mother wasn’t helping; she had me fucked-up on valerian.That was the last time I tested a sleepy-time tea at 3 p.m. on a Tuesday. On the one hand, an afternoon session seemed like the only way to determine the efficacy of the best teas for sleep. On the other, I was dozing off at work.The original Sleepytime Tea (you know the one, with the comatose bear in front of a precarious roaring fire), hit shelves in 1972. That thing sells over 4 million boxes a year—the people need their sleep. With herbal remedies (cough) becoming more and more mainstream, there are dozens of teas for sleep to choose from. And just wait until you hear about Ambien!Herbalists will note that different human bodies react differently to herbs: Some might feel energized by valerian tea, while others might conk out after a watery cup of chamomile. I kept that in mind—and so should you because this isn’t medical advice, dudes—as I sipped and snoozed my way through all the best teas for sleep. Some taste like gym socks, others like floral arrangements in a funeral parlor, and a few manage to have no flavor whatsoever.In this very unscientific test, I yawned my way through the workday to find the sleepiest and most delicious bedtime tea on the market, though, to be honest, some of those meetings were just very boring.Here we go.Pukka Night TimeI’m a fan of all Pukka teas, mostly because the name reminds me of the giant rabbit from Harvey, but also because they’re never bitter in the way bagged tea sometimes can be. They’re organic, too, which is a bonus because I like my herbs squeaky clean. The trick to getting the most flavor out of Pukka’s Night Time tea is to steep it for a longer period of time—up to 15 minutes—so that more of the licorice flavor comes out (in a lightly spiced way, not like the disgusting candy). Otherwise, the flavor is so low-key you can barely taste anything. The main ingredient is oat flower, which is relaxing and subtle. There’s also a hint of chamomile, but just barely. Tulsi, lavender, and limeflower are other players, but they’re all nearly invisible, like a mischievous rabbit who follows Jimmy Stewart around.Verdict: Easy to drink and perfect after a meal, when maybe you don’t want intense flavors chiming in. Combined with Seinfeld reruns and a few glasses of wine, I was asleep in three minutes flat. I will be drinking this again the next time I need a restful sleep.Pukka Night Time Herbal Tea$18 at Amazon (3 boxes)$5 at iHerb (1 box)Traditional Medicinals Nighty Night ValerianIf you’re really serious about getting a better sleep fast, you need to skip over the plain Nighty Night and hit the Nighty Night Valerian instead. It gets me every time. After a 10-minute steep, there’s a pleasant funky-earthy smell to this organic tea, with subtle notes of gym socks. But the scent is much stronger than the taste. This is a tea made from passionflower—an actual flower known to chill the nerves, not the name of a bath oil your mom bought from the last Avon lady on Earth. If you’re the kind of person who lies in bed thinking about those lost USPS packages, your cat’s fading eyesight, and what will happen to your health care in the near future, well, this is for you.Verdict: Legit. Despite the scent, the flavor is mellow and perfect if you need to unwind at the end of a long day overthinking how to respond to that one email. I would recommend it.Traditional Medicinals Nighty Night Valerian Tea$5 at Target$5 at AmazonDavid’s Tea’s Mother’s Little HelperThis loose leaf tea has an intense minty, citrusy, and medicinal flavor, which honestly just comes with the sleepy time territory. The valerian root is in full effect. As mentioned earlier, it fucked me up in the office, so I save this one for seriously stressful nights, like, say, when you know you need to write a long story about tea the next morning and have really procrastinated. The scent is pleasant but also very strong, so I store this tea away from other teas lest they all start smelling like lemongrass.Verdict: Seriously snoozy and will get you ready for a good night’s sleep—but not subtle in flavor. Doctor it up with honey to cut through the bitterness.David’s Tea Mother’s Little Helper$10 at Sips by$10 at David's TeaSteep Echo ReposeSteep Echos’ teas are made from olive leaves (cool!) and have obtuse one-word names like Hush and Ascent. The packaging is nicer than any wallpaper I’ve ever owned, and I’ve owned some nice wallpaper. The flavor is just lovely (chamomile flowers, lots of rose), matching the fancy-boutique-hotel-on-the-seaside vibes of said paper. Need I say more? The longer the steep, the more potent it becomes, so I’d recommend taking the tea bag out after 3–4 minutes.Verdict: This tea had a calming effect, but was not a get-thee-to-dreamtown sleep aid. I’d recommend it for late-afternoon stress, after your boss pulled you into his office to reprimand you for something that definitely wasn’t your fault. Or was it?Steep Echo Repose Tea$15 at Sips byGaia Herbs Sleep & RelaxThere’s a big warning in bold on this box: KEEP AWAY FROM CHILDREN. So you know it’s gonna be good. Sorry kids, stick to your sippy cups of scotch, this is adult tea that’s far from a placebo. Passionflower is really carrying the team, with lemon balm, licorice, and chamomile on the bench. With all those assertive ingredients, you would think that this tea for sleep would taste like...something. Anything. How can a tea taste like so much nothing? These are the stoner thoughts you’ll have when drinking this tea. If I had to say it tastes like something, I’d go with hay or the color beige. Unoffensive. I didn’t feel woozy or slightly dangerous the way I do sometimes with valerian teas. It’s good to switch things up before your body starts building up tolerances.Verdict: Very chill, but not chill enough. Is this the best tea for sleep? I don’t know, but it packs a good sleepy punch and the flavor of nothing continues to mystify me.Gaia Herbs Sleep and Relax Herbal Tea$5 at Pharmaca$6 at GaiaCelestial Seasoning’s Sleepytime ExtraIf your mom microwaved Sleepytime for you when you were young and she needed you to go to bed already for the love of god, you’ll recognize the huge, snoring bear on the box from a mile away. Celestial Seasonings tried to rebrand, and thousands of calls and emails cried out “UM, NO.” So they brought the bear back, and the world is a better place for it. The herbs aren’t organic, so the yogi-wellness gurus I consulted don’t adore this one, but I do—and I think you will too. They’ve managed to cook up a flavorful herbal blend that’s slightly sweet, minty, and chamomile-forward without any bitterness. Plus, it’s heavy on the most powerful ingredient of all: nostalgia. Well, nostalgia and valerian, which is what makes this Sleepytime EXTRA.Verdict: You can consider this one the Coca-Cola of sleepy teas. The flavor is comforting, powerful, and downright good. It’s a solid choice that checks all of the boxes and can be found at pretty much any grocery store—BOOM.Celestial Seasonings Sleepytime Extra$5 at iHerb$4 at TargetRebecca’s Herbal Apothecary Bedtime BlendThis was my first time as a human ever to consume catnip, which I knew had great reviews from my cat, Roger, but apparently is also a muscle-relaxing nerve-chiller. It’s a lemon balm tea with oatstraw, lavender, and skullcap, which came highly recommended from a flower-essence therapist friend of mine. True story, and real career. When steeped, this made a darker, gray tea that smelled like oatmeal and tasted very mellow, with hints of...hay? That was the most concrete thing I could put my finger on.Verdict: If you’re not a fan of chamomile/licorice/all those usual medicine flavors in most sleep-aid bevs, this is your cup of tea. As I drank it, I felt like I wanted something more, but maybe I’m just not appreciative of nuance. Snooze factor: It won’t knock you out right away, but it will give you a calm, relaxed energy. You could easily drink it during the day after a rough meeting or before that flower-essence therapist appointment.Rebecca’s Herbal Apothecary’s Bedtime Blend$26 at Rebecca'sHomestead Apothecary Dream TimePackaged in an open-shelf-friendly octagonal jar, there was a big, green dried hop (the stuff you make beer with) on the top of the tea when I twisted off the lid. What a nice touch! This is a very unique tea, with mugwort and hops, and I love anything that gives me Macbeth witch vibes. I used to make potions like this when we camped in the Michigan woods in my childhood, and this was the tea I was trying to make. Lots of dried pieces of actual nature, without the flavor of sticks, mud, and Off! Bug spray. After steeping the suggested 10–30 minutes, the tea still had only a hint of rose-chamomile flavor. To bring out the floral notes, cold-steep the tea before you leave for work in the morning and then strain it to reheat before bed. You can drink it more concentrated this way, which means less liquid before going to bed—if you’re working hard to go to sleep, you might as well try to stay asleep. A note that this tea used to be called Sweet Dreams, but now goes by Dream Time. Same witchy stuff.Verdict: Pleasant, neutral flavor. After having a cup at 3 p.m. on a Monday, I felt a little dizzy—this is definitely better for nighttime. Did it give me “epic dreamtime adventures,” as Homestead’s website promises? Not really. As someone who sometimes would rather not remember her dreams, that’s fine with me.Homestead Apothecary Dream Time Blend$11 at Homestead ApothecaryThis article was originally published in 2017.Explore Bon AppétitHealthyishShoppingRead Morecooking5 Healthyish Ingredients We're Sprinkling On EverythingGallery5 SlidesBy Nikita Richardson Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-02", "author": ["Condé Nast", "Alex Beggs"]}