{"id": "8132cd690d50ef47bd2fce903b35e1ab", "url": "https://www.bonappetit.com/recipe/tropical-babas-with-whipped-coconut-cream", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "Tropical Babas With Whipped Coconut Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTropical Babas With Whipped Coconut CreamBy Christian ReynosoDecember 23, 20213.6(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintBabas are delightfully airy French yeasted cakes that are drenched in boozy sugar syrup. This recipe takes the classic dessert into tropical territory with a sauce made from fresh pineapple and good aged dark rum and big dollops of whipped coconut cream to finish. Be sure to get your coconut cream in the freezer first thing. The colder it is, the easier it is to scoop out just the cream top, which will naturally firm up and separate from the small amount of coconut water at the bottom of the can. The coconut water can dilute the cream, making it difficult to whip to the desired texture. —Christian ReynosoAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMuffin Pan$10 $9 At AmazonWire Cooling Rack$17 At Bon Appétit MarketWhisk$10 At AmazonMedium Bowl$17 At AmazonCan Opener$14 At AmazonIngredients8 servings113.5-oz. can coconut cream (preferably Thai Kitchen or Let’s Do…Organic)4Tbsp. unsalted butter, room temperature, plus more for pan2tsp. active dry yeast¼cup (25 g) plus 2 Tbsp. granulated sugar2cups (250 g) all-purpose flour½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more3large eggs2½cups ½\" pieces fresh pineapple1½cups aged dark rum1cup (packed; 200 g) light or dark brown sugarMaraschino or other preserved cherries (for serving)PreparationStep 1Place a medium bowl in freezer. Open can of coconut cream and chill in freezer until coconut cream is very cold but not frozen solid, about 30 minutes. (Alternatively, chill in the refrigerator overnight.)Step 2Place a rack in middle of oven; preheat to 350°. Butter 8 cups of a standard 12-cup muffin pan. Combine yeast, ¼ cup (25 g) granulated sugar, and ¼ cup lukewarm water in a medium bowl and let sit until foamy, 5–10 minutes.Step 3Whisk flour and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large bowl. Add eggs to yeast mixture and whisk until incorporated, about 1 minute. Gradually stream into dry ingredients, mixing with a wooden spoon until a thick and sticky dough forms. Add 4 Tbsp. butter and mix until combined and dough is smooth and elastic. Spoon about ¼-cupful (about 70 g) dough into each cup of prepared pan. Using wet fingers, lightly smooth top of each scoop of dough. Loosely cover pan with plastic wrap and let rise in a warm, draft-free spot until dough is nearly doubled in size (it should almost reach the top of the pan), 30–60 minutes.Step 4Meanwhile, bring pineapple, rum, brown sugar, and a pinch of salt to a simmer in a large saucepan over medium heat, stirring to dissolve sugar. Remove pan from heat and cover to keep sauce warm.Step 5Remove plastic wrap from dough and bake babas until puffed and golden brown around the edges, 15–20 minutes. Transfer babas to a wire rack and let cool slightly.Step 6Uncover sauce (reheat if needed; you want it to be warm). Working with 2 or 3 babas at a time, add to sauce and turn to coat on all sides. Transfer babas back to wire rack.Step 7Take coconut cream out of the freezer. Carefully scoop just the cream into chilled bowl, leaving the watery liquid at the bottom of the can behind. Add remaining 2 Tbsp. granulated sugar and vigorously whisk coconut cream until no lumps remain and soft peaks form.Step 8To serve, tear a baba in half and place on a small plate. Spoon more sauce over insides of cake (you want to really soak it), then top with a big dollop of whipped coconut cream. Garnish with cherries.Do ahead: Babas can be baked 1 day ahead; store airtight at room temperature. Sauce can be made 3 days ahead; transfer to an airtight container and chill. Reheat before soaking babas. Coconut cream can be whipped 8 hours ahead; transfer to an airtight container and chill.How would you rate Tropical Babas With Whipped Coconut Cream?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis didn't work that well for me. The rum sauce and was good but a little strong. The whipped coconut cream was amazing. The real problem was the cake. \n\nThe recipe states to mix 1/4 cup of sugar plus 1/4 cup of water with the yeast. I thought that would be so much sugar that it would inhibit the yeast growth which it did. There was no apparent yeast activity after leaving it for 20 minutes. I was able to try again with less sugar initially in the water and then added the remaining sugar later in the recipe. \n\nThe amount of dry mix to liquid in the recipe made a very thick dough which was not very mixable. The resulting cakes were tough, dry and not very flavorful though the rum sauce and whipped cream helped. \n\nI think the recipe could be improved by using cake flour (less gluten and more tender), a higher moisture dough, and baking powder leavening instead of yeast. The yeast didn't add much flavor here because of the short rise. Basically switch to something more akin to a pound cake ratio. AnonymousMD1/2/2022Explore Bon AppétitDessertBakingCakePineappleFruitRumAlcohol & Other DrinksYeastOther IngredientsCoconut MilkFrenchEuropeanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-23", "author": ["Condé Nast", "Christian Reynoso"]}