{"id": "813957875b1201e60a8ad9b76d67e5c2", "url": "https://www.bonappetit.com/story/tucson-travel-guide", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Where to Eat in Tucson, Arizona's Desert Jewel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhere to Eat in Tucson, Arizona’s Desert JewelBetween velvety mole, a bounty of mesquite smoke, and Sonoran Desert views, Tucson deserves your undivided attention. By Jackie TranFebruary 18, 2022FacebookTwitterEmailSaguaros and cholla in Saguaro National Park in Tucson, AZ on December 17th, 2021Photograph by Cassidy AraizaFacebookTwitterEmailI’ve spent the past three decades savoring Tucson’s distinctive combination of aromas and flavors. First comes mesquite—the robust, earthy smoke from this native wood triggers memories of impromptu bonfires and family gatherings with grilled skirt steaks. Second, thin, lardy Sonoran flour tortillas, which make all other tortillas feel like dry, puffy flatbread. Then there are the roadside burritos: Never bursting with fillers, they showcase tender grilled or braised meats that you dress according to your taste. (For me that means just a spritz of lime, a pinch of onion and cilantro, and a touch of fiery chile de árbol salsa.) This mountain-ringed desert city is home to a diverse population of Native communities, immigrants, and college kids. Strolling downtown you might spot a day-tripper from Hermosillo slurping a bowl of miso ramen at a picnic table or a Vietnamese guy in a cowboy hat (me) sipping mezcal cocktails at a dimly lit bar. Whatever you’re seeking, you’ll probably find it here—and then some.Photograph by Jackie Tran for Tucson FoodieThe EssentialsWhen to Visit: Spring. The weather isn’t triple digits yet, so you can soak in the clear skies and blooming desert flowers. September also works beautifully with lush post-monsoon greenery.Where to Stay: The Downtown Clifton, a hotel with a notable in-house restaurant and bar, is walking distance to Tucson’s cocktail corridor on Scott Avenue.What to Bring Back: Monsoon Chocolate bars and bonbons, flour tortillas from Tortilleria Doña EsperanzaPhotograph by Cassidy AraizaCoctelería La Palma Mariscos y MasDespite the fact that Tucson is in the desert, fresh Mexican seafood is readily accessible due to the city’s proximity to the Sea of Cortez. Order a platter of aguachile to embrace the natural sweetness of plump Mexican shrimp with serrano peppers, creamy avocado, and cooling cucumber in a limey salsa. 5 Points Market & RestaurantThis neighborhood brunch spot serves breakfast (I’ll occasionally indulge in a 10 a.m. mezcal cocktail with my egg sandwich, just because I can) and irresistible daily baked goods such as rye sourdough sticky buns with a hazelnut, apple, and cardamom filling and brown sugar caramel. Even salads stand out thanks to super fresh produce from local vendors. Shop the market for products to take home, like prickly pear nectar from Arizona Cactus Ranch and mesquite chocolate chip cookie mix from AZ Baking Company.Ruiz Hot Dogs Los Chipilones in Tucson, AZ on December 16th, 2021Photograph by Cassidy AraizaRuiz Hot Dogs Los ChipilonesTucson’s beloved Sonoran hot dog is wrapped in bacon and topped with diced tomato, raw onion, grilled onion, pinto beans, mayo, mustard, and green salsa on a slightly sweet bun. With so many toppings, execution varies dramatically. While El Güero Canelo was the place that earned the James Beard America’s Classics Award, Ruiz is my favorite thanks to its toasted (rather than steamed) bun and Goldilocks-perfect ratio of toppings. Bonus points for the blistered yellow pepper on the side. The Citizen HotelThis self-described wine hotel features complimentary daily tastings on the mezzanine, a collab with Sand-Reckoner Vineyards, which is based in Willcox (the heart of Arizona’s blossoming wine scene, where more than 20 wineries take advantage of the area’s ideal elevation, climate, and soil to grow 74 percent of the state’s grapes). The historic building, which once housed Tucson’s first newspaper press, features only 10 rooms, all named after wine varietals that thrive in the high Sonoran Desert Region. And yes, there are wine caddies in every bathtub. Photograph by Jackie Tran for Tucson FoodieLa InditaWhile Arizona has two of the largest Native American reservations in the country (the Navajo Nation and the Tohono O’odham Nation), only a handful of eateries offer Native American cuisine. At La Indita matriarch María García shares recipes from her and her husband’s Tarascan and Tohono O’odham heritages. The velvety chicken mole sings with both fruitiness and bitterness from Chiapas cacao beans. The Tarascan taco features an unusual blend of spinach and nuts yet feels nostalgic at first bite. Beans and red chile beef top crispy-chewy fry bread for the massive Indian taco. Sushi on OracleFor years I stayed away from this restaurant because of the uninspired name—it’s a sushi restaurant on Oracle Road. Upon my first visit I realized how grave my mistake was. The lo-fi hip-hop, jazz covers of Ghibli soundtracks, and selection of Japanese craft beers immediately set it apart from anything I’d encountered. While master sushi chef Yoshinobu “Yoshi” Shiratori is the head honcho, I ended up a regular because of the friendly Navajo sushi chef, Tommy Begay III. I tend to go during off-hours so I’m less of a distraction when I ask Tommy questions about what ingredients he’s been experimenting with, like house-made yuzu kosho and smoked salmon. There’s no avant-garde fusion here, though, just superb sushi in a chill environment that embraces both the old school and the new. Barrio CharroNationally acclaimed Tucson legends Don Guerra and Carlotta Flores come together to pay homage to heirloom White Sonora wheat, one of the oldest varieties in America. Guerra’s fresh-baked bread (which draws lines around the block at his bakery) combines effortlessly with Flores’s Northern Mexican family recipes (her Tia Monica invented the chimichanga) in a powerhouse lineup of excellent sandwiches. If you don’t mind sending bread through an airport scanner, absolutely take a loaf home with you—they freeze quite well.The Mercado San Agustin in Tucson, AZ on December 19th, 2021Photograph by Cassidy AraizaMercado San AgustinExplore a wide collection of restaurants and shops in this open-air Spanish colonial-style courtyard or down the block in the market’s shipping-container annex. Seis Kitchen reaches beyond Sonora to a variety of Mexican regions; all dishes are made from scratch, including its Yucatán-inspired poc chuc, the only chicken taco I’ve ever loved. La Estrella Bakery bakes traditional pan dulce daily; grab a pumpkin empanada (available year-round!) to go and pair it with a superb cup of coffee from Presta Coffee Roasters down the hall. On Thursdays there’s a farmers market rich with local produce.Photograph by Jackie Tran for Tucson FoodieNoodleholicsThis is my personal favorite restaurant in town; it has a noodle bowl for all of my moods: spicy Sichuan beef soup when I’m feeling feisty, vinegary dry Guilin rice noodles when I need to cool down, and sizzling garlic noodles when I can’t make up my mind. I’ll also occasionally indulge in a crispy half duck and sides of addictive chili oil dumplings, salt and pepper wings, and potent garlic cucumbers. No gimmicks here, just delectably slurpable Chinese food in a contemporary fast-casual environment. El Taco RusticoA few years ago I ventured for the first time to Tucson’s Tohono O’odham Swap Meet, a sort of outdoor flea market bursting with Mexican street food options. Then I went back again, for eight consecutive weekends. While I made it a point to try different food stands each time, chef Juan Almanza’s open mesquite fire never failed to lure me in. The swap meet sadly closed at the start of the pandemic, but Almanza happened to sign the lease for a brick-and-mortar restaurant weeks before the closure. Try the slow-grilled carne asada; the costillas, aromatic with mesquite-singed beef; or the tripas, with their tender chew, addictive crunch, and house red salsa. Last but not least, the quesabirria—unctuous cuts of beef braised all night in an intensely fragrant chile broth, which comes full circle as the dipping jus for these crispy cheesy tacos.Apple cobbler in the wood fire oven at the Cowboy Cookout at Tanque Verde Ranch  in Tucson, AZ on December 15th, 2021Photograph by Cassidy AraizaTanque Verde RanchIf you want a quintessential Southwestern cowboy experience, this dude ranch provides it with unmatched polish. While it’s a popular spot for weddings and private dinners, you can also pop by for prickly pear margaritas in the saloon or join the outdoor Cowboy Cookout on Wednesday and Saturday nights for grilled meats and live country music. Stay the night if you want first dibs at riding a horse among the saguaros in the morning. Lodging ranges from cozy salas to luxurious haciendas with fireplaces and sweeping views of the surrounding mountainsPhotograph by Cassidy AraizaTito & PepWhenever friends ask me where to take out-of-towners, I point them to this cozy neighborhood restaurant. While the menu features influences ranging from Japan to the Levant, the flavors are distinctly Tucson thanks to the mesquite-fire-centric kitchen and hyper-local ingredients like quince from Mission Garden, a local living agricultural museum. Order all the small plates to share and definitely save room for the sublime passion fruit panna cotta.TumericoI’m not a vegan or vegetarian, but I am a loyal customer at this excellent plant-based Latin restaurant. When I arrive, chef Wendy Garcia regularly greets me with a hug. Her warmth and vibrance come through in her fiery jackfruit al pastor tacos, red chili nopalitos, and huevos rancheros. The ever-changing blackboard menu has never disappointed me—and I’ve yet to find a better hangover cure in town.Explore Bon AppétitRestaurantsTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-18", "author": ["Condé Nast", "Jackie Tran"]}