{"id": "8147874319a2a721ba8808e2c51589cd", "url": "https://www.bonappetit.com/city-guides/new-york/venue/don-angie", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Don Angie Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkDon AngieCheeky Italian-American in the West VillageFacebookPinterestTwitterEmailAshley Sears GO HERE: for chefs Angie Rito and Scott Tacinelli’s playful take on red-sauce nostalgia.ORDER THE: vegetables. Sure, the lasagna and black-sesame-striped caramelle are all over the Internet, but the sleeper hits here are the carb-less ones. We can’t get enough of the scallion pancake-like garlic flatbread; crunchy chrysanthemum salad speckled with sesame and Parm; antipasto salad (think Italian sub in salad form!); barbecue calamari with pepperoni fried rice; and Roman pasta-inspired grilled orata alla gricia.THE VIBE IS: old-school cool. A warm, pinkish light and less-than-ideal acoustics lend a club-like vibe, but the beautiful black marble bar, with rounded, meandering edges, mean more space to hang out at the bar and chat with your friends as you wait for a table.PRACTICAL STUFF: Open for dinner every day: Sunday to Wednesday, from 5:30 p.m. to 11 p.m., and Thursday to Saturday, from 5:30 p.m. to midnight, but the bar opens at 5 p.m. Reservations can be tough, so book ahead through Resy at least a few weeks out.—Elyse InamineAshley SearsLiz ClaymanAshley SearsWE ALSO LOVEBuvetteTrès West Village, with hints of ParisLiliaA special occasion spot that changes the pasta paradigmBemelmans BarFlawless cocktails in a flawless Upper East Side roomExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Elyse Inamine"]}