{"id": "814e27dc69786c3eaa300c49a03a2f21", "url": "https://www.bonappetit.com/story/dulce-de-leche", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "What is Dulce de Leche?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Ingredient That Takes Shortbread From Meh to MarvelousIt's better than butter and sugar. (Yes, we said it.)By Emma WartzmanMarch 3, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Typical shortbread cookies are good. They’re crumbly, sandy, and tender thanks to butter and sugar that have spent quality time together, and the best specimens taste as if they’re barely bound by flour, dissolving when take a bite. But Molly Baz’s Roasty Toasty Pecan-Caramel Shortbread Cookies are great. And the reason, my friends, is  dulce de leche.What is dulce de leche? A South American confection of sweet milk cooked down until it's the color and consistency of caramel sauce or butterscotch, it's both sweet and fatty, meaning that it can take the place of most of the sugar and some of the butter in Molly's shortbread. To prevent the cookies from being too saccharine, Molly reduced the amount of granulated sugar to 3 Tbsp. And while, in her words, “there’s still a ton of butter,” the dulce de leche also stands in for some of the fat.Ultimately, swapping out most of sugar and a portion of the butter with deeply flavorful dulce de leche preserves that defining shortbread texture while adding a little je ne sais quoi, a.k.a. a can’t-put-your-finger-on-it complexity. Simply put, dulce de leche has a lot more going on than straight sugar and butter: As the sweetened milk reduces into the coppery brown sauce, a series of chemical reactions (known collectively as the Maillard reaction) occur between the proteins and carbohydrates in the milk. The Maillard reaction is a big part of what makes browned food—from olive oil-fried eggs to grilled bread to roasted vegetables—taste more delicious and intense. And, in these cookies, the toasted pecans, which mimic the buttery, caramel-y notes in the dulce de leche, certainly don’t hurt either.For something like alfajores—the South American sandwich cookie filled with dulce de leche from which Molly drew inspiration—you want as high-quality a product as you can find. There’s a whole layer of dulce de leche in there after all! These cookies, however, can handle a jar or can that’s on the less expensive side of the spectrum. “I would opt for really high-quality butter over really high-quality dulce de leche,” Molly says. “Here, it's meant to blend into the background. It’s only ¼ cup total, so don’t fret. You’re not tasting it straight.”That being said, dulce de leche-loving test kitchen manager Gaby Melian warns that you should check the ingredient list—certain brands swap out sugar for corn syrup which, as she puts it, “yuck.” Once you know the confection is made with sugar, though, you’re good to go.In a pinch, you also could make your own. Submerge a can of sweetened condensed milk in a pot of simmering water for two to three hours, depending on how dark you want it. But don’t stray away from the stove and definitely don’t lie down for a nap. You need to take care to make sure that the can is fully covered the entire time (otherwise, it could explode).Then again, you could probably make a trip to the grocery store and back (multiple times!) in two to three hours. But to each their own! As long as you make these cookies, we certainly don’t care.Get the recipe:Roasty Toasty Pecan-Caramel Shortbread CookiesStore-bought dulce de leche and pulverized pecans give this tender, buttery shortbread a nuttiness and depth of flavor you can’t quite put your finger on. We love the contrasting look of white nonpareil, but feel free to roll the dough in whatever sprinkles you please.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-03", "author": ["Condé Nast", "Emma Wartzman"]}