{"id": "815351c1d510955d0b85f3ae7817d5b8", "url": "https://www.bonappetit.com/recipe/hungarian-mushroom-soup", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Hungarian Mushroom Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHungarian Mushroom SoupSpiced with Hungarian paprika, dill, and thyme, this comforting soup is just what you need when winter seems to go on forever, and ever, and ever…By Hetal VasavadaFebruary 28, 20214.3(68)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintA few years ago I visited the Alaska State Fair and ate my way through a variety of comfort foods, including Hungarian mushroom soup, or gomba leves. It’s a mushroom-heavy soup spiced with Hungarian paprika, dill, and thyme. This soup just hits the spot on a cold night. There are a number of variations that include pasta, turnips, soup dumplings, and more. This recipe, however, is a simple version that includes milk for a creamy, rich texture. Feel free to substitute the paprika with garam masala and a pinch of turmeric and chili powder for a spicier Indian-style soup. You can also use plant-based butter and vegan sour cream to make this soup vegan. —Hetal VasavadaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At AmazonDutch Oven$80 At Amazon8-Inch Chef's Knife$47 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWooden Spoon$6 At AmazonSpatula$12.99 At AmazonWhisk$10 At AmazonLadle$8 At AmazonIngredients6–8 servings4medium yellow or white onions (about 1½ lb.)2lb. mushrooms (crimini and/or shiitake)2medium carrots (about 12 oz.)6garlic cloves2handfuls of parsley leaves with tender stems½cup (1 stick) unsalted butterKosher salt4tsp. Hungarian sweet paprika, plus more for serving4tsp. dried dill or ¼ cup fresh dill2tsp. dried thyme or 2 Tbsp. fresh thyme6cups low-sodium vegetable broth2cups whole milk¼cup all-purpose flour¾cup sour cream, plus more for servingFreshly ground black pepperPreparationStep 1Prepare your ingredients. Chop 4 medium yellow or white onions (about 1½ lb.) into ¼\" pieces. (You should have about 4 cups.) Gently clean 2 lb. mushrooms (crimini and/or shiitake) with a kitchen towel or paper towels. Remove and discard stems; slice caps ¼\" thick. Peel 2 medium carrots (about 12 oz.). Cut in half lengthwise, then cut those halves in half lengthwise (you’ll have 4 long spears per carrot). Cut crosswise into ¼\"-thick pieces.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Smash, peel, and finely chop 6 garlic cloves. Finely chop 2 handfuls of parsley leaves with tender stems until you have ¼ cup; set parsley aside.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Melt ½ cup (1 stick) unsalted butter in a medium Dutch oven or other heavy pot over medium heat. Add onion and a pinch of kosher salt (this will help the onion release water and cook more quickly) and cook, stirring occasionally with a wooden spoon, until onion is softened and browned, about 10 minutes. Add mushrooms and carrots to pot and cook, stirring often, until mushrooms start to brown, 12–16 minutes. Add garlic, 4 tsp. Hungarian sweet paprika, 4 tsp. dried dill or ¼ cup fresh dill, and 2 tsp. dried thyme or 2 Tbsp. fresh thyme and cook, stirring often, until fragrant, about 2 minutes. Step 4Add 6 cups low-sodium vegetable broth and bring to boil over high heat. Reduce heat to medium-low and simmer, uncovered, 10 minutes.Step 5Whisk 2 cups whole milk and ¼ cup all-purpose flour in a small bowl or measuring glass to combine. Pour into soup and stir well. Bring to a boil over high heat. Reduce heat to medium-low and simmer until soup is thick enough to thinly coat spoon, about 8 minutes. Remove from heat.Step 6Mix ¾ cup sour cream and 2–3 Tbsp. broth from soup until loose, then add to soup and stir well to incorporate. Season with salt and freshly ground black pepper.Step 7Ladle soup into bowls and top each with a dollop of sour cream, some reserved parsley, and a pinch of paprika.Do ahead: Soup (without sour cream and toppings) can be made 3 days ahead. Let cool; cover and chill. Reheat before adding sour cream as directed.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Hungarian Mushroom Soup?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThis was delicious, hearty and very flavorful. We loved it. Definitely will make it again.M. HargateCleveland1/3/2022I'm a novice chef and this was really good!! Followed the recipe exactly except that I halved it and didn't add any salt to the onions or to taste at the end - it was perfect! I would leave the carrots out next time though, the mushy texture didn't add anything for me. Anonymous12/25/2021Super delicious. I didn’t have any dill unfortunately, but it still turned out great. If you’re sensitive to spice, perhaps start with half of the paprika and add as needed - it’s pretty spicy. It paired really well with yeasty dinner rolls and extra sour cream. MelissaGreenville, SC12/23/2021The other review is a bit odd, definitely don't add less broth! Based on the image, it's already a bit thicker than it usually is in Hungary. However, all the components are legit, I expect this soup to be delicious. And no, you can't just skip onions in a Hungarian recipe, onion is pretty much the foundation of all Hungarian cuisine :D I wouldn't use shiitake though, the standard Hungarian mushroom used is csiperke. Gabor VBudapest, Hungary12/19/2021Really liked this recipe.  I'll make it again. Delicious.  The instructions didn't mention adding the parsley, so eventually I put that in the pot.  I also added Mrs. Dash, and T. Joe's Umami seasoning.  I'm sending the recipe to a few friends who I think will like making and eating this.cheryl hIrvine, CA6/5/2021Loved this recipe!! Took me so long to prepare but it was so creamy and delicious. Freezes well too so I would make a big batch to save for later. Jennifer ILos Angeles 5/1/2021OHHHHHHHH... Thank you for this recipe - the videos really help.  \n\nNot only have I found a delicious soup that I want to keep making (and perfecting) but also, as a basic skills cook, now feel like I have also learnt some additional cooking techniques.\n\nEnjoyed this cooking tutorial and for me the flavours blended really well.   Used dried tarragon as had no dill so also added a smidge of fennel seed and turned out really tasty and would happily serve to friends and family.    \n\nFantastic to find a recipe that works for me!  THANK YOU  X  Will be back for more XAJLincoln - UK3/30/2021This is really good.  I followed the recipe.  I would suggest adding less vegetable broth or at least add four cups and add more if it seems it needs it later.  Still, I will definitely make it again.  Definitely better to add more vegetables than less; everything cooks down.  This may just be a personal preference as I like my soup substantial and not too soupy.  Really, really good.  Served with sliced French bread with butter.Phil Thompson  Effingham, Illinois3/19/2021I really want to make this, but I cannot eat onions or garlic and every BA recipe includes onions and garlic but this is one of the worst I've seen. There is absolutely no way that I can modify this one. I'm really sad, Hungarian mushroom soup was a staple in my college town and I have so wanted to make it for myself to bring back the memories.Mari K-CGrand Rapids, MI3/5/2021Is the parsley only garnish at the end of is the 1/4 added to the soup?Anonymous3/1/2021This soup is delicious!   I diced the mushrooms as I’m recovering from surgery and can’t chew.  Turned out SO good.  I will definitely keep this recipe and will be making this again. SOC Oakton, VA2/28/2021Explore Bon AppétitSoupSoups and StewsHungarianEastern EuropeanEuropeanMushroomVegetableOne-Pot MealsEasyWeeknight MealsMainVegetarianNut-FreeBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-28", "author": ["Condé Nast", "Hetal Vasavada"]}