{"id": "8158fd0614924dbf9b4a42843c6a47e9", "url": "https://www.bonappetit.com/story/goomas-french-toast", "year": 2020.0, "month": 7.0, "day": 1.0, "content": "This Simple French Toast Recipe Has Just Five Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere's French Toast, And Then There's Gooma's French ToastCrispy edges and custardy middles, with just five ingredients.By Paul WangJuly 7, 2020FacebookTwitterEmailPhoto and Food Styling by Paul WangFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I like to believe that I have a grandma for every place I’ve called home. A grandma, in the non-biological sense, is someone who welcomes you into her kitchen, feeds you, and teaches you her recipes.A couple of years ago, I met my “Oklahoma grandma” while working at Nonesuch in Oklahoma City. She goes by “Gooma,” a nickname that was given to her by her family, and lives in Stratford (population 1500), where she is a beloved small-town hero. She makes everyone feel like they’re part of the family, so much so that everyone in town calls her Gooma. It’s safe to assume she has at least 1000 grandchildren, myself included.Instagram contentThis content can also be viewed on the site it originates from.Over the past few years, I’ve had the opportunity to get to know Gooma, share many special meals, and learn a few of her recipes. But during my last visit to Stratford, Gooma blew my mind with her French toast. I watched as she gently dipped strips of bread into a batter and fried them, all without missing a beat of conversation.One bite and I was hooked. Gooma’s French Toast is the best French toast I’ve ever eaten. Crispy on the outside and sweet and custardy on the inside, it’s flavor and texture heaven. Gooma was happy to share her recipe with me, and to my surprise, it was incredibly simple. It requires only five ingredients including the oil you fry them in (and no milk or sugar!). Done deal. I make this recipe all the time at home—one of Gooma’s grandkids is someone dear to my heart, and I like to make this for him to remind him of home.Here’s how to make it: Take 6 slices of white bread and cut them into thirds so that they are in strips (this will give you more crispy corners, and everyone loves crispy corners). Next, make the batter: In a shallow baking dish, whisk 3 large eggs, 1 cup of orange juice, and a splash of vanilla extract (approximately 2 teaspoons) until well combined.In a non-stick skillet, heat ½ cup vegetable oil over medium heat. (I know this is a lot of oil, but we are frying the French toast. And trust me, it’s worth it.) Working with a few pieces at a time, dip bread strips into the egg batter and coat both sides. Pick up the bread and let the excess batter drip off, and  move quickly so the bread doesn’t become oversaturated with batter.Immediately transfer to your pan and begin frying. (I like to fry 5-7 pieces at a time so the pan is not overcrowded.)Fry for about 2 minutes on each side, or until golden brown all over, then transfer to a paper towel-lined plate or a cooling rack set over a baking sheet.Gooma serves her French toast hot, with warm maple syrup, peanut butter, and a pile of bacon on the side. She often puts out a fresh batch on the table as soon as you’ve finished the previous batch—a true labor of love! You can also sprinkle cinnamon sugar on top or serve the French toast with your favorite jam and fresh fruit.I cannot emphasize how delicious and simple this recipe is. I feel the love and acceptance of Gooma every time I make her French toast. Thank you for taking me in, Gooma.Paul Wang was one of the opening chefs at Nonesuch, BA's best new restaurant of 2018. He is currently working as a private chef in Seattle.Explore Bon AppétitIt's That SimpleBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-07", "author": ["Condé Nast", "Paul Wang"]}