{"id": "815ee3853778c52c7ea5e0efe4818dfb", "url": "https://www.bonappetit.com/story/al-ameer-dearborn-michigan", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "I Go to Dearborn, Michigan, Just For This Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Go to Dearborn, Michigan, Just For This LunchAl-Ameer makes my ideal meal: kebabs galore, falafel, creamy hummus, and fluffy rice.By Alex DelanyOctober 16, 2019FacebookTwitterEmailPhoto courtesy Al-AmeerFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.For me, a trip to Detroit means a trip to Dearborn, Michigan. Sure, there are plenty of good diners and pastries and and hot dogs and coffee shops and beers and pizza in Detroit proper. But take a 20-minute drive up north to the city of Dearborn and you’ll soon understand why. Really, it all comes down to one of my all-time favorite lunch spots, Al-Ameer.Al-Ameer looks and functions like a diner. But instead of a hodgepodge mix of American breakfast items, deli sandwiches, and the inexplicable presence of Italian-American specials (why do all diners have spaghetti and meatballs in a terribly sweet red sauce?), Al-Ameer serves top-notch Middle Eastern classics. When you walk into the homey restaurant, you don’t smell bacon and eggs. It’s cumin and cardamom and olive oil and toasted flatbreads. And it’s enough to make your mouth water.Chefs Khalil Ammar and Zaki Hashem’s plastic-coated menu is large and its contents seductive: dips and skewers and sandwiches and fresh fruit juices. But my heart lies with three menu items in particular. The tabbouleh is herb-heavy, with plenty of bright lip-smacking acidity. The ful mudammas, boiled-then-mashed fava beans, is punched up with garlic, salt, and lemon juice and invites dip after dip of toasted pita. But the real monument is simply called the Combo Platter: a massive plate filled with a tawook kebab (grilled chicken), a cumin-and-coriander-loaded kofta kebab (ground lamb), a tender shish kebab (grilled steak), a couple of delicately spiced falafel balls, feathery rice, and smooth olive-oil-laden hummus.It is a lot of food. And it’s meant for one. I suggest you take your time with it. Sit and watch everyone else in the restaurant. Old-school car dealership owners, neighborhood families, cool kids from downtown. Everyone is here for the same reason you are: impeccable, accessible Middle Eastern food. And here’s a bonus tip: After you’ve digested, head down the main street, past the halal butchers, gas stations, and corner stores, to Shatila Bakery for the most perfect baklava and an ice cream. After all that, you may even decide to leave the car, and walk your way back to Detroit.Go there: Al-AmeerExplore Bon AppétitHighly RecommendDetroitRestaurantsHummusKebabRead MorerestaurantsThe Share Plate I Can’t Share in Traverse City, MichiganBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Alex Delany"]}