{"id": "816136f1b804077cc84ff24ae127c270", "url": "https://www.bonappetit.com/story/no-recipe-smoothies", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Leave the Smoothie Recipes at the Door and Improvise | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYou Don’t Need a Recipe to Make a Damn Good SmoothieThe BA Test Kitchen’s Smoo Crew shows us the way.By Aliza AbarbanelMarch 22, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailWe’re always down for a smoothie, but now feels like an especially good time to keep the blender close by. That’s because homemade smoothies are a highly riffable way to hit our 5-a-day using leftover odds and ends (that’s you, splotchy bananas and half-empty cans of coconut milk), mixed frozen fruit, and whatever fresh produce you have in the fridge. Just a little of each can go a long way toward something delicious.But there’s an art to improvising. That’s why we reached out to the Bon Appetit test kitchen’s resident “Smoo Crew,” Molly Baz and Sohla El-Waylly, to get their tips for smoothie success. Read on, and blend away.Molly Baz, ½ of the Smoo Crew, pouring up a vibrant Greeña Colada.\nGo easy on the ice.  As ice melts into water, it dilutes flavor. Ward away Watery Smoothie Syndrome™ by using a ratio of 25% ice to 75% other ingredients. If you’re worried about lukewarm sludge, store those fruits, dates, and nuts in the freezer to get that right chill. Bonus: They’ll stay fresher for longer, too.Raid the spice cabinet. Deploy the full strength of your pantry to keep things interesting, even if you’re working with the same ingredients as yesterday. Add fiery grated ginger or a sprinkle of turmeric to tropical fruits; pair baking spices like cinnamon, nutmeg, and cardamom with bananas. “Vanilla is always great but have fun with rosewater!” Sohla says. “Try a splash of orange blossom water and honey for a floral vibe, and citrus zest is always a good idea.” (Just avoid anything that skews too savory, like cumin and paprika!)Don’t forget fat. A bit of healthy fat adds richness and keeps you fuller for longer. Try a handful of nuts, a scoop of tahini or nut butter, a dollop of yogurt, a splash of coconut milk, or even fresh coconut. Got some leftover buttermilk? Throw it in too.Add something sweet. Balance out the big flavors from hearty nuts, earthy greens, tart fruits, and other mix-ins with dates, dried apricots, coconut sugar, or a drizzle of honey.Yes, you still need salt. “Smoothies need salt, just like anything else you cook,” Molly says. Top off your blender with a big pinch of salt to make all the flavors pop. One sip, and you’ll become a believer.Create a theme. Even before you begin, take stock of what ingredients you have on-hand. Gather everything on the counter, so you don’t forget about that bag of mango stashed wayyy in back of the freezer, and make a plan for combining complementary flavors. Not sure where to start? Molly and Sohla like to channel their favorite cocktails, desserts, and breakfast foods. Here are three recent favorites to inspire your own riffs:The Greeña Colada: Pineapple + banana + kale + cashews + coconut milk + nutmeg + vanilla + ice + saltCarrot Cake Smoo: Carrot juice + cashews + coconut milk + dates + grated nutmeg + banana + vanilla + saltPB&J: Peanut butter + frozen raspberries and blueberries + dates  + vanilla extract + almond milk  + ice + salt + banana (optional)Explore Bon AppétitHealthyishSmoothieRead MorecookingAll the Ways to Make Oatmeal Taste Actually AmazingBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-22", "author": ["Condé Nast", "Aliza Abarbanel"]}