{"id": "816146225b9f80a16e8fd45d2ee9dc82", "url": "https://www.bonappetit.com/story/the-cheese-thing-never-fail", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "\"The Cheese Thing\" Is Very Much a Thing, and Our Editor in Chief Is Obsessed with It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking\"The Cheese Thing\" Is Very Much a Thing, and Our Editor in Chief Is Obsessed with ItIt's an unholy combination of cheese, pasta, and tomatoes, and you probably need it today.By Adam RapoportApril 20, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down. This week: a recipe for The Cheese Thing, the gooey baked pasta dish that editor in chief Adam Rapoport just couldn't live without.“WHY HAVE YOU NEVER MADE THIS FOR ME!”That’s my wife shouting at me. I wouldn’t say she was angry exactly. More like...dismayed.I had just piled her a plate full of The Cheese Thing, a molten casserole of gooey cheese and sweet canned tomatoes with crisp, almost-singed penne points poking out of all the saucy goodness like the bows of sinking battleships taking their last gasps.The Cheese Thing and I go way back. And the honest answer to her question is that, well, I had forgotten about it. But one Sunday morning last month, I woke up with an implacable craving for something cheesy, tomatoey, pasta-y, ever-so-slightly sweet. It was a familiar longing, and I could almost taste it in my mouth. And then, like a half-asleep Homer Simpson, I heard myself whisper those words. “Cheese...Thing.”So I texted my good friend Mitchell Davis, Cheese Thing caretaker and long-time James Beard Foundation honcho, for the recipe. He grew up eating his mom’s version of the casserole in the 70s, and he still bakes it to this day.There it is, folks. The Cheese Thing.\nPhoto by Chelsie CraigAs he wrote in a 2013 blog post—which is also where you can find the full recipe—it serves 1 to 8, depending on his mood and degree of self control on any given day. “I like it before it’s baked, once it’s baked, after it’s cooled to room temperature, chilled the next day, reheated to a crisp in a frying pan the next night, any which way.”The reality is, The Cheese Thing is kind of like macaroni and cheese for dummies. You don’t have to bother making a béchamel or grating nutmeg or finding a quality gruyere at your supermarket. You just cube up a bunch of cheddar cheese—8 ounces of mild and 8 ounces of extra-sharp; don't even think about using all of one or the other—and mix it with canned tomatoes, a dash of salt and sugar, a healthy amount of butter, and cooked-then-drained penne pasta. Stir it all together and pour it into a buttered 2-quart casserole dish. And really, that's the extent of the cheffing you're doing. Into a 400°F oven it goes.What emerges 50 minutes later—crispy and gooey and slightly charred on top and a little bit sweet—is absolutely addictive. Some bites are saucy with that milky, liquified mild cheddar; others reward you with pungent pockets of semi-solid extra-sharp. (That's why you can't just use one or the other!) And you just keep going back and forth, back and forth between those flavor sensations. Bite after bite. And once you finish your first serving, you don't bother putting seconds on your plate—you just start fishing forkful after forkful straight from the baking dish, starting with those almost-burnt edges and working your way in.I guess what I'm saying is that, if you're wondering whether Mitchell is exaggerating when he says the recipe feeds between 1 and 8, you should just make the thing and see for yourself. I'd say not at all—and so will you.Check out Mitchell's blog for the full recipe for The Cheese Thing.And this baked pasta dish definitely doesn't suck, either:Baked Pasta With Sausage and Broccoli RabeThis weeknight-friendly pasta uses one skillet, one pot, and plenty of cheese.View RecipeExplore Bon AppétitBasicallyNever FailMacaroni and CheesePastaCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-20", "author": ["Condé Nast", "Adam Rapoport"]}