{"id": "8169d51a237411f9e23e8b52155fec1f", "url": "https://www.bonappetit.com/recipe/corn-and-hominy-pudding", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Corn and Hominy Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueCorn and Hominy PuddingBy Amiel StanekOctober 19, 20214.6(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food styling by Susie Theodorou, Prop styling by Sophie LengEmailPinterestPrintEmailPinterestPrint“I vividly remember the time a visiting Southerner brought a dish of corn pudding to our Thanksgiving dinner. I was young, skeptical of additions to the holiday buffet, but became an enthusiastic convert: Dairy-rich and custardy, flecked with sweet corn, it felt like some kind of Turkey Day missing link. In this version the eggy pudding stays classic while other elements gesture southwest, with hominy adding chew, peppers offering warmth, and funky, crumbly Cotija turning the savoriness up to 11.” —Amiel Stanek, contributing editorAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBox Grater$13 At Amazon3-Qt. Baking Dish$17 At AmazonLarge Skillet$84 At AmazonIngredients8 - 12 Servings6Tbsp. unsalted butter, plus more for pan2bunches scallions3poblano chiles, seeds removed, finely chopped2jalapeños, seeds removed, finely choppedKosher salt1½cups canned or cooked hominy, drained1½cups fresh or frozen corn kernelsFreshly ground black pepper4large eggs, beaten to blend2cups heavy cream1½cups sour cream1½cups grated Cotija cheese or finely grated Parmesan, dividedPreparationStep 1Preheat oven to 325°. Butter a shallow 3-qt. baking dish. Remove green parts from scallions and thinly slice; set aside for serving. Thinly slice remaining white parts. Heat remaining 6 Tbsp. butter in a large skillet over medium. As soon as butter stops foaming, add white parts of scallions, poblano chiles, and jalapeños and season with salt. Cook, stirring often, until very soft and liquid is almost completely evaporated, 10–12 minutes. Add hominy and corn to pan, season with salt and pepper, and cook until mixture is heated through and dry, about 4 minutes. Transfer vegetable mixture to a shallow bowl or rimmed baking sheet and let cool. (It doesn’t have to be room temperature; it just shouldn’t be so hot that it will cook the eggs in the custard.)Step 2Combine eggs, cream, sour cream, and 1 cup grated Cotija cheese in a large bowl; season with salt and pepper and whisk vigorously until mixture is smooth and foamy. Add hominy mixture and stir to combine; scrape into prepared baking dish. Bake pudding until mostly set but still a bit wet and jiggly in the center, 35–45 minutes; remove from oven.Step 3Heat broiler. Sprinkle remaining ½ cup grated Cotija cheese over pudding and broil until completely set and browned in spots, about 2 minutes. Let cool 15 minutes, then top with reserved scallion greens and season with more pepper. Serve warm or at room temperature.How would you rate Corn and Hominy Pudding?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleDelicious and rich! Was the favorite at Thanksgiving and can't wait to make it again for Christmas. Poblanos and jalapenos added warmth and savory - total comfort food. Meg BNashville, TN12/20/2021This was easy, and delicious, it's very rich!!! AnonymousDenver12/4/2021Explore Bon AppétitSideCornVegetableVegetarianHominyRice & GrainsCasseroleThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Amiel Stanek"]}