{"id": "817cd23b2f729a0da92d9e4e5940aef2", "url": "https://www.bonappetit.com/story/cannabis-terpenes", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "I Take Cannabis Terpenes Instead of Smoking Weed, and Here's Why | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy I Take Cannabis Terpenes Instead of Smoking WeedThe non-psychoactive aromatic compound could become the biggest thing in wellness since CBD.By Zan RomanoffJuly 11, 2018FacebookTwitterEmailIllustration by Bryan FountainFacebookTwitterEmailI stopped smoking weed my senior year of college. I woke up one February morning, mouth still fuzzy, lying on top of my covers with my winter coat, scarf, and boots still on— I’d been too disoriented to get them off the night before—and thought, you know what? I don’t have to do this.  As a result I’ve spent most of the past decade politely but firmly passing on joints, and, more recently, edibles and vape pens, sitting on the curbs outside of dispensaries while my friends picked up pre-rolls and loose flower with their medical recommendations.It feels like a waste of an L.A. address sometimes, my 420-free lifestyle, but recently I’ve been exploring products that contain little or no THC—the stuff that gets you stoned— but instead feature non-psychoactive compounds, which have benefits all their own. You’ve read about CBD, which is being used to treat seizures in children with epilepsy, and which some people take to help deal with anxiety and insomnia. But there’s another marijuana component that’s now being touted for its potential health benefits, and that’s terpenes.Terpenes are aromatic organic compounds: The types and amount of terpenes in different strains of cannabis can determine how that strain will taste and smell, and, some claim, how it will affect your mood. (It’s hard to say whether or not this is true since scientists face massive roadblocks when trying to do clinical trials on a plant that’s still federally illegal.) Some of the most common cannabis terpenes are myrcene, linalool, pinene, limonene, humelene, and caryophyllene.Terpenes are found in plants other than cannabis too: pinene and limonene, for instance, are present in abundance in their namesakes, pine needles and lemons. And terpenes are a major component of one of the most common wellness products out there, essential oils. Some people claim that, much like essential oils, cannabis terpenes are capable of everything from calming to energizing to reducing inflammation to improving mental focus. Again, it’s hard to come by human studies on the specific effects of marijuana terpenes, but some research on non-cannabis terpenes suggests that certain strains do have anti-inflammatory and neuroprotective effects.There are no doctor-recommended dosages for terpenes, so if you want to start taking them, you’re on your own in terms of figuring out what will work for you and how much to take. There are some basic guidelines: Linalool, also a major component of lavender, is calming and soothing, where pinene and limonene are thought to be energizing. Pinene may help dilate your lungs, which could make it an ideal ingredient in a pre-workout drink.If you want to experiment with terpenes, concentrates are available from tons of online retailers, among them Global Cannabinoids, LA Refinery and Denver Terpenes. Because they’re derived from plants, they can help bring out the flavor in food and drinks in addition to their supposed therapeutic benefits. Be careful, though: The concentrates you’ll get are, well, concentrated, and they’re dispersed via eyedropper for a reason: One drop is usually enough.If you want to try a pre-fab product, the downtown Los Angeles bar Prank has a menu of terpene-infused cocktails and kombuchas available. They’ve also released a line of bottled kombuchas and terpene chocolates this month, which they’ve made specifically to give you particular effects throughout the day. There are seven varieties of the chocolates, including Senor, which taste like Junior Mints made energizing by pinene, and Senorita, a white chocolate version with a limonene-infused custard center.The team at Prank likes to work with terpenes because it’s an easy way to introduce folks like me, who are cannabis-shy, to the effects of the plant without any associated stoner stigma. “When people ask us, ‘are these marijuana terpenes?’ We just go, ‘doesn't matter,’” explains Dave Whitton, Prank’s owner. “Because it doesn't matter. We're continuously trying to educate, to get away from the huge red flag behind the marijuana plant. We want to make sure we’re moving into a different area, where people are realizing, Wow, everything inside of this plant is extraordinary.”His chefs and bartenders have also had fun playing with the unique flavor profiles that terpenes offer—though, again, because of their concentration, Whitton cautions moderation when experimenting with them. “That’s the key to this stuff: It’s going to destroy whatever you put it in if you don’t know how to use it,” he says. Other professionals who know their way around a terpene dropper are private chefs like Aaron Ziegler of Bull & Dragon and Holded Jagger’s Altered Plates, who use terpene as a component in their weed-infused dinners.I recently stopped by Prank’s bar for a midday terpene-infused kombucha called Cross-fizz, which I hoped would help me breathe easily through a yoga class, and then teaching writing later that night.Did it work? Hard to say. Much like essential oils and many non-Western herbal medicines, terpenes are recommended in small doses over long periods of time. They’re about cumulative benefits, not quick fixes. A single glass of infused kombucha may offer brief respite, but the true power apparently comes only after weeks or months of regular ingestion.What I do know was that the drink was delicious—a little smoky, a little sweet—and that it was nice to sit still and pay attention to what was going on in my body. Was I breathing? I asked myself. Was I calm? I took a long, slow inhale at the top of my glass and thought about all of the little terpene molecules telling my body to relax, chill out, de-puff, and de-constrict. It was, if nothing else, a very soothing way to spend an afternoon.Okay, before we all go ahead and de-constrict with cannabis terpenes, consider consulting a medical practitioner and double-checking marijuana prohibition in your area. While cannabis terpenes are generally not known to produce negative side effects, everyone’s experience is unique.Explore Bon AppétitHealthyishCannabisTrendsRead MoreLifestyleHow Drinking CBD Cocktails Really Makes You FeelBy Kelly DobkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-11", "author": ["Condé Nast", "Zan Romanoff"]}