{"id": "817f438e00bd9a9f62bd07d5a2b5fed5", "url": "https://www.bonappetit.com/story/green-widow-hot-sauce-poor-devil-pepper-co", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "My Favorite Green Hot Sauce Is Very Much Alive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Favorite Green Hot Sauce Is Very Much AliveSo alive that it lives in the door of my fridge.By Aliza AbarbanelNovember 22, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Lately, I’ve been getting my kicks from hot sauce. My fridge door overflows with bottles of vinegary Valentina, chunky sambal oelek, and Siete’s neon orange habanero hot sauce, and I love all my spicy children equally. But lately, I’ve been playing favorites with Green Widow. The aptly named green hot sauce from Hudson-area fermenters Poor Devil Pepper Co. is raw, herbaceous, and decidedly alive.Green Widow is part of a renaissance of probiotic hot sauces hitting the refrigerated section—and yes, these unpasteurized sauces do have to stay in the fridge all the time. Just like Greek yogurt or kimchi, each bottle is packed with good-for-you bacteria that can’t survive on the shelf.All of Poor Devil Pepper Co.’s hot sauces start with locally grown peppers and vegetables, which are blended down, mixed with salt, and sealed in an anaerobic environment. The microbes naturally found in vegetables kick-start the fermentation process, which continues for a few months until the mixture is ready to be blended, strained, and sold. (Poor Devil is currently working on dehydrating the leftover mash into zero-waste chile flakes, hopefully to be sold in 2021.)As an editor at Healthyish, I obviously love eating hot sauce in the name of gut health, but the real benefits of fermentation come down to flavor. Raw hot sauce has a crisp, flavorful finish that lets the natural vegetal flavor and heat shine through. Mild, it’s not. Green Widow is fierier than any jalapeño-based hot sauce I’ve tried, with a lingering heat that plays off warm, earthy cumin and bright lime juice. “Fermentation shows the true power of a jalapeño,” says cofounder Jared Schwartz, who notes that using unseeded peppers and not cooking down the sauce adds to the final punch.Over the past few months, I’ve added Green Widow to everything from breakfast sandwiches to fish tacos, and recently, I’ve taken to adding a few dashes to simple bowls of brothy beans. It adds a fresh vegetal flavor when my fridge doesn’t have any herbs to spare—a welcome bit of brightness when the sun sets at 4 p.m.Green Widow Hot Sauce$7 at Poor Devil Pepper Co.Explore Bon AppétitHighly RecommendHot SauceShoppingCondiment/SpreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-23", "author": ["Condé Nast", "Aliza Abarbanel"]}