{"id": "81898b61fe4a5fd4635536ff73ffeb1b", "url": "https://www.bonappetit.com/story/learning-to-ride-a-bike", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Learning How to Ride a Bike Eased My Chronic Anxiety | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLearning to Ride a Bike Eased My Chronic AnxietyAt 25 I didn’t think much about my health until it got in the way.By Dana HeywardMarch 31, 2021FacebookTwitterEmailIllustration by Cindy EchevarriaFacebookTwitterEmailAt 25 years old I thought I could teach myself how to ride a bicycle. My first attempt: scooting up and down a dead-end Brooklyn street on a Citi Bike one late August morning. With the exception of a few delivery trucks, the streets were empty, just as I’d planned. There I was, a grown woman waddling around on a bike, gripping the handlebars for dear life. For a good hour I pushed off the pavement, trying to keep my balance. But my feet never fully left the ground. I couldn’t muster the courage. I couldn’t let go.Despite growing up just outside NYC (where I enjoyed your average active suburban childhood), before that day I had never even been on a bike. Since moving to Brooklyn two years ago, I took the train, Ubered, or walked to get around the city. But once the pandemic made public transportation no longer a safe option, I suddenly had the urge to get out and learn how to ride.For weeks I’d watched bikers effortlessly weave through traffic and park paths on their own. There seemed to me more of them, too, particularly women. Perhaps they were seeking refuge from the enclosed spaces of the subway or their own apartments. Or they were just looking to soak up the warmer weather in a socially distanced way. My piqued interest stemmed from something else, though: I wondered if cycling could help me cope with a deeper issue I'd been facing.The piercing body aches first swept over me in mid-April. Some days I felt too nauseous to eat, other days I was so lethargic my body felt tethered to my bed. I swallowed supplements to sleep, guzzled Pedialyte to help boost energy, and popped Tylenol every six hours to subdue the pain. By then New York state had reported more confirmed COVID-19 cases than any country in the world. Mobile morgues could be seen parked across the city, as hospitals and funeral homes could no longer keep up with the death toll. I hadn’t lost my sense of taste or smell, but the fatigue was so overwhelming I convinced myself I’d contracted COVID-19—because what else could it be?Before the pandemic I didn’t think much about my health until it got in the way. I don’t have any preexisting conditions; like a lot of young people in the city, I buried myself in work, trying to carve out a life here. When it came to wellness, every few months, I’d cut down on my coffee intake between the occasional lazy attempt at yoga. So when my body started telling me something was wrong, the new uncertainty swallowed me up and spat me out—into sterile doctor’s offices and Zoom medical appointments. We ran diagnostics and checked vitals. Each time I defended the reality of my symptoms, as if on trial, and each time doctors returned, negative results in hand. They said there was nothing wrong with me. In their eyes I was a young Black woman with no medical history of note. With some stress-reducing exercises, they told me my symptoms would pass soon. But “soon” turned into several agonizing months.Then, in early August, I found myself wheezing in a surprisingly quiet Brooklyn emergency room. I rarely ask for help in my personal life and was embarrassed to be in the ER during a global pandemic, but I desperately needed answers.I had hoped that by taking on this skill, I could regain a sense of control over my body. Finally, after hours of tests, I was told I was having a panic attack, due to chronic anxiety. I had never dealt with anxiety to the point where it manifested in me physically, but the culmination made sense. I’d recently lost my service industry job and was unsure of when or if I’d ever go back to work. My dad had spent the better part of spring in and out of the hospital, battling COVID-19. Pandemic-induced fears had engulfed my reality. Now, with a diagnosis, a sense of relief washed over me—my pain was real.A week later I kept thinking about what an ER nurse had suggested: “Try focusing your mind on something different.” Which is how I found myself scooting around on that Citi Bike on the dead-end street, quite literally going nowhere on my own. So I decided to sign up for a free bike-riding class at Shirley Chisholm State Park—a former landfill turned dreamy landscape in southeast Brooklyn. I had no idea who might be joining me there. When I arrived I found instant comfort seeing my classmates: an older woman in her late 50s taking the course for the third time, along with a pair of sisters in their 40s and one of their daughters. We were all Black women, ready and willing to learn.At the edge of Brooklyn, on a picturesque summer day, the five of us strode around on pedal-less bikes, trying to find our balance. After 30 minutes our instructor put the pedals back on, and one of the sisters immediately took off. The older woman slowly but surely found her footing too, and we all cheered her on as she rounded her first turn. I, however, did all the wrong things: braking instead of pedaling, falling instead of self-correcting, looking at my feet instead of the path ahead. I ran into a bush and left covered in bruises. I had hoped that by taking on this skill, I could regain a sense of control over my body. Instead, a familiar fear washed over me; despite how much I longed to feel strong again, I only felt more disconnected.By my second class, though, I decided to give myself some grace. Then something in me suddenly clicked: push, lift, find the pedals, cycle—that’s all I had to do. Suddenly I was biking down an asphalt strip, turning for another lap. My grip loosened, and I could feel the sun on my skin. I even closed my eyes. At that moment I felt boundless.I’m not vying for a spot in the Five Boro Bike Tour just yet. But lately I’ve graduated from practicing loops in the park to carefully moseying down bike lanes on the street. My partner also surprised me with my very own blue vintage Schwinn on my 26th birthday. With each ride I can find parts of myself threading together—some familiar, some new. Biking requires focus, but there’s also a mindless quiet that comes, once you’ve settled in—a kind of freedom. This doesn’t mean my anxiety has simply evaporated for good; I’m still working on that. I now see, though, that I needed to disconnect in order to feel connected again. And while my body certainly doesn’t feel brand new, it’s finally starting to feel like mine again.Explore Bon AppétitHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-31", "author": ["Condé Nast", "Dana Heyward"]}