{"id": "81957c204eef81abc59736f4098271d6", "url": "https://www.bonappetit.com/recipe/peperoncini-chicken", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Peperoncini Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssuePeperoncini ChickenBy Grant MeltonAugust 10, 20214.8(107)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintThis one-pan chicken dinner gets two times the flavor from using both the peppers and the pickling liquid in a jar of peperoncinis. The chicken roasts in the spicy pickling liquid, while the potatoes cook away nestled among the bright, yellow peppers. Once the potatoes are done, just toss them together with crisp, raw vegetables for warm potato salad vibes. —Grant MeltonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksTongs$13 At AmazonLarge Bowl$18 At AmazonIngredients4 Servings2lb. skin-on, bone-in chicken thighs (6–8)1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided¾tsp. freshly ground pepper, divided3Tbsp. extra-virgin olive oil, divided1lb. fingerling potatoes, halved lengthwise10peperoncini, plus ½ cup brine2garlic cloves, finely grated1tsp. dried oregano½medium red onion, thinly sliced3celery stalks, thinly sliced (about 1 cup), plus celery leaves for serving2Tbsp. chopped parsleyPreparationStep 1Preheat oven to 425°. Sprinkle chicken thighs all over with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and ½ tsp. pepper. Coat a large cast-iron skillet with 1 Tbsp. oil. Arrange chicken thighs, skin side down, in pan and place over medium heat. Cook, undisturbed, until skin underneath is browned, 14–16 minutes.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Meanwhile, toss potatoes, peperoncini, garlic, oregano, remaining 2 Tbsp. oil, ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and ¼ tsp. pepper in a large bowl. Set aside.Step 3Turn chicken over. Add potato mixture to pan, arranging snugly around thighs. Pour peperoncini brine around edges of pan and give pan a shake to evenly distribute. Transfer skillet to oven and roast until chicken is cooked through and potatoes are tender, 40–45 minutes.Step 4Remove skillet from oven and transfer chicken and peperoncini to a plate. Place skillet over high heat and cook potatoes, stirring often, until coated in drippings and glossy, about 4 minutes. Remove from heat and stir in red onion, sliced celery, and parsley.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Place chicken and peperoncini on top of vegetables and scatter some celery leaves over.How would you rate Peperoncini Chicken?Leave a ReviewTell us what you thinkReviews (43)Back to TopTriangleMy family thought this was delicious!Benedetta Michigan3/4/2022Simple. Quick. More tasteful than my ex-mother-in-law.....What's not to like? Seriously! It's very good! Can't imagine changing anything about the recipe.Austin LoneStar3/1/2022I just cooked this last night.  I modified the recipe by using chicken breasts and marinating the onions and celery in a bit of the peperoncini juice beforehand.  This was very easy and tasty.  I can see coming this often on weeknights.AnonymousNYC2/20/2022Our family loved this.  It's easy, it's delicious and it's good enough for company.  You know they like it when everyone goes back for seconds.  I wouldn't change a thing.  We liked the crispy veggies on top.  MarciaOlympic Peninsula, WA2/8/2022Everything I have ever dreamed of and more! BananaicaRoanoke, VA1/30/2022Overall I liked it but I found half an onion basically raw was a bit too much for me, would cut back a bit on that next time. David PSan Francisco1/19/2022So good! This is now on my regular rotation.  I double the number pf peperoncinis and add the onions to the pan half way through cooking time so they get a little crispy and caramelized.  Omit the celery altogether, just a family preference.  Otherwise, I follow the instructions exactly. Stacey DNew Hampshire1/14/2022This was so yummy!  I always modify recipes, and did with this one too, and it was deliciious!  I used suggestions from others and will make this again, including adding more peperoncini.  It was spicy, but good for us.  These were my changes:   used  baby red, purple & white potatoes - quartered (for more browned surfaces); 2-3x more garlic (we love garlic!); twice the peperoncini & the brine; 1 thinly sliced large leek; about 1/3 lb. quartered large crimini mushrooms;  and white wine.  I tossed the leek with the potatoes, spices & oil and added to cook in the oven.  The mushrooms and purple onion I tossed with a little more oil, oregano and salt & pepper and set aside to cook after taking out the chicken.  I added about 1 cup white wine, though the flavor before was already yummy, just because we like that wine flavor.  Also, a little more brine.  Cooked enough to cook mushrooms and soften red onion.  Definately a make again. Thanks to all for the suggestions! DebbieCalif.1/7/2022I really enjoy making this but what I enjoy even more is when I serve it to my partner he absolutely raves about it he thinks so much effort and time goes into it and truly after you've made it a couple times it's really really a simple dish. Rather than removing the chicken at the end what I have found is that I take the fingerling potatoes out right before the dishes done and I put them in the frying pan I used to fry the chicken originally and get them crisped up because I had moved everything else into a nice casserole serving dish when it was in the oven. I also add just a tiny bit of chicken stock because he likes to the juices so much and I find for myself it cuts through the strong flavor as I get older I cannot handle any spice at all just none so unfortunately is one this dish is one I myself and unable to enjoy but I'm always proud of myself when I make itRyan XoDenver12/12/2021This is one of the best tasting dishes I’ve ever cooked. Have made it 5+ times in the last 2 months and it never disappoints. The potatoes come out tasting more delicious than any potatoes I’ve ever eaten. I have yet to find anyone who doesn’t absolutely love this. Enjoy. Adam GelvanBeverly Hills, CA11/21/2021This is a bomb recipe — made it twice in less than two weeks. It’s so easy and so good and damn — a winner. bobbi11/21/2021I'm making this dish for the 2nd time and each time I do it a little differently. Neither my partner nor I are big fans of celery so I omitted it. Instead I combined potatoes, carrots, sliced leeks. onions and garlic. and tossed that with Olive oil salt and pepper. Then proceeded with the recipe as written, adding a little white wine for additional flavor. At the end I sprinkled chopped parsley and chopped celery leaves over the top.  The sliced leeks were absolutely delicious in the dish and I would highly recommend using them.Scott RClearwater Fl11/17/2021Making this tonight for a second time.  so good!  I'm omitting the celery (personal preference) and adding the onion to the pan with the potatoes so they get soft and caramelized.   I'll also double the peperoncinis because my family likes them. YUM!StaceyDBedford, NH11/15/2021Absolutely delicious. Followed the recipe exactly and I was so happy with how it turned out. Sara CBrooklyn, NY10/26/2021All I have is boneless skinless breast how can I keep them from getting dry in this recipe?AnonymousMichigan10/25/2021Explore Bon AppétitChicken ThighChickenPoultryPotatoVegetable Fingerling PotatoSpringSummerOne-Pot MealsEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Grant Melton"]}