{"id": "81a7bf34c047e2ebd63566051b81067d", "url": "https://www.bonappetit.com/story/pittsburgh-greens-and-beans", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "To Understand Pittsburgh, You Have to Understand Greens and Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTo Understand Pittsburgh, You Have to Understand Greens and BeansOne city’s humble, but indisputable, iconic dish.By Melissa McCartApril 16, 2019FacebookTwitterEmailPhoto by ERIN KELLYFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.At Sienna on the Square, it’s a one-pot meal with fennel sausage and pork belly. At Sarafino’s in Crafton, it’s not complete without banana peppers. And at the Enrico Biscotti Co., kale is the star of the dish. Each place seems to have its own iteration, but among them is a universal truth: It’s not a red sauce joint in Pittsburgh without beans and greens.The combination of greens and beans can be found across cultures, but scarola e fagioli, traditionally made with cannellini beans and escarole, has been embraced by Italian-Americans in Northern New Jersey, parts of Philadelphia, and, most notably, Pittsburgh. It’s thought to have been brought from Southern Italy, where many of Steel City’s immigrants came from between 1880 and World War I.Like Sunday sauce, greens and beans can stir up an argument over the “right” way to make them. Beans from a can won’t do: They have to be soaked and then simmered in aromatics. As far as greens, escarole is traditional, though many stateside cooks add spinach for a layer of sweetness. The next step is to heat some olive oil in a pot over low heat with a couple garlic cloves, maybe a whole chile pepper. Once the olive oil is seasoned—smell that garlic—in go the greens to sauté, then the cooked beans and their liquid are added. When it’s time to serve, the greens and beans are ladled into bowls—always in a shallow pool of their broth—then dressed with more olive oil and a sprinkling of hot pepper. And don’t forget the bread (of the generic Italian variety, obviously).Or at least, this is one method. Plenty of restaurant chefs and home cooks would disagree with it, since, of course, their way is the best way.Longtime Pittsburghers trace favorite versions back to Sunday suppers with grandma at the stove. “My grandmother used to add lettuce to the mix,” says Jonathan Vlasic, the chef-owner of Alla Famiglia, in the hilltop neighborhood of Allentown. Over the years, Vlasic and his wife, Brandy, have more than doubled the size of the restaurant, which is now a 250-seat dining experience featuring tableside cooking and a $68 veal chop.Despite the upgrades, greens and beans have remained on the menu since the place opened in the ’90s. Vlasic’s rendition calls for both escarole and spinach. He uses navy pea beans for “a better mouthfeel,” he says. And as for that liquid, “You don’t want it sitting in a pool of sauce, but you kinda want sauce. You’ve gotta get that viscosity that comes from the starch of the beans and the reduction of the chicken stock.” The essential ingredient, he admits, is generous portion of house-made sausage. “Everyone wants meat,” he says, which is the most significant way he strays from the roots of the dish. Historically, this is cucina povera; meat was too expensive. Around Pittsburgh, it’s now a common addition.Over on the North Side at Legends Eatery, chef-owner Dan Bartow, originally from Long Island, NY, didn’t grow up eating greens and beans, but he inherited the dish by marrying into a Pittsburgh family. His restaurant—a cheery yellow dining room with fewer than 50 seats—hosts a roster of regulars, including Patricia Rooney, the wife of the late Dan Rooney, former owner of the Steelers. At the front corner near a stained-glass window, a plaque commemorates the Rooney family table.Since opening 17 years ago, Bartow has prepared his wife Zoe’s version of greens and beans: a mix of cannellini beans, spinach, romaine, and escarole. The dish is sautéed in a pan and served most often with a split link of house sausage, garnished with roasted red peppers. It’s a dish thick with bean water, olive oil, and grated Parmesan. Usually served as a side for dinner, the dish is also a hearty main course for lunch.Over the years, Bartow has updated his menu. He’s dropped pasta e fagioli—he says it’s “old-fashioned”—though it’s available to those who ask. But he’ll always serve greens and beans. “If I didn’t serve them here,” he says, “there’d be hell to pay.”Melissa McCart is the restaurant reporter and dining critic for the Pittsburgh Post-Gazette and an editor for Mark Bittman on Medium.com.Explore Bon AppétitRed SauceItalian AmericanPittsburghRestaurantsRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Melissa Mccart"]}