{"id": "81a806c68b219effb6814ce9d657b0a2", "url": "https://www.bonappetit.com/recipe/slow-cooked-collard-greens-in-olive-oil", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Slow-Cooked Collard Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2017 IssueSlow-Cooked Collard Greens in Olive OilBy Claire SaffitzDecember 3, 20214.6(8)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintHearty collard greens require little more than heat and a bit of time to become incredibly delicious. (Or even just a sharp knife, if you want to serve them raw.) In the American South, where they are a culinary icon, collard greens are commonly cooked over many hours, mingling with smoked pork or turkey and tinged with vinegar, but there are countless preparations from communities around the world.This collard greens recipe leaves out meat and goes heavy on garlic for flavor. The greens need to cook for at least an hour, but you can leave them unattended for most of that time. The finished dish will present you with plenty of potlikker, the earthy broth the greens and aromatics leave behind from all that simmering. Serve with crusty bread or cornbread for soaking up those flavorful juices, or reserve the liquid to sip on the next day as you would a broth.If you want to get ahead, you can make this recipe a day or two in advance of serving and store it in the refrigerator. Just heat it up on the stove until it’s warmed through. Collards can also be made in an Instant Pot in about 30 minutes or less.Editor’s note: This recipe was originally published October 16, 2017.Ingredients4 servings ½cup extra-virgin olive oil, plus more for drizzling8garlic cloves, thinly sliced½teaspoon crushed red pepper flakes2bunches collard greens, ribs and stems removed, leaves torn into 2-inch piecesKosher salt1tablespoon (or more) apple cider vinegarGenerous pinch of sugarPreparationStep 1Heat ½ cup oil in a large saucepan over medium. Cook garlic and red pepper flakes, stirring often, until garlic is golden, about 4 minutes.Step 2Add collard greens to saucepan a handful at a time, stirring until each addition is wilted before adding the next. Season with salt and add 1 cup water. Bring to a simmer, then reduce heat so mixture is at a very gentle simmer. Cover and cook, occasionally removing lid to stir, until greens are tender and very dark green, 1–1½ hours.Step 3Let cool slightly, then stir vinegar and sugar into greens. Transfer to a serving bowl and drizzle with more oil and a splash more of vinegar if desired.How would you rate Slow-Cooked Collard Greens in Olive Oil?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI can only find pre-cut collards on a bag. How many cups would you say equals 2 bunches?DebbieLand O Lakes, Fl1/6/2022I use orange juice instead of water.AnonymousRio Rancho, New Mexico.12/31/2021This was unexpectedly delicious!  The olive oil cooked into mine, so adding more at the end was necessary. And the soupçon of vinegar, mmm.RosieDayton10/29/2021I've made this several times and loved it. Excellent as written, but also delicious with tweaks for different flavor profiles (e.g., black mustard seeds & cumin seeds for Indian style collards). The garlic cooks in the olive oil pretty quickly, so you need to have all the collards ready to go from the start. AnonymousDC10/19/2019wayyy too much oil. came out very oily at the end, even without drizzling more. i would cut oil in half next time. otherwise everything else tasted great. would also do more than 2 bunches of collards at a time, as they reduce like crazy—there were barely 3 portions in the pot by the end. AnonymousLos Angeles, CA9/22/2019Explore Bon AppétitCollard GreensLeafy GreensVegetableSideVegetarianVeganDairy-FreeGluten-FreeNut-FreeKetoHealthyishBraiseThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-17", "author": ["Condé Nast", "Claire Saffitz"]}