{"id": "81b6b5e73366f935af8fd86cf66cdee1", "url": "https://www.bonappetit.com/story/dominique-fishback", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Dominique Fishback on Giving Up Meat and Seeing Her Brooklyn Neighborhood Change | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle‘The Deuce’ Star Dominique Fishback on Giving Up Meat and Seeing Her Brooklyn Neighborhood ChangeFishback also stars in The Hate U Give, in theaters October 5th.By Zan RomanoffOctober 5, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmail“Eating would be the worst part of my day,” Dominique Fishback says. It’s a sun-drenched Thursday morning in Los Angeles, and, in between bites of a gloriously runny egg sandwich, the actress is recalling growing up in the Brooklyn neighborhood of East New York in the early ’90s, when her options were limited to bodega bites and fast food.“I knew that I wasn't eating well,” she continues. “I wouldn't eat for a while, then I'd get so hungry I'd be like, ‘I'm just gonna go get a Philly cheesesteak,’ and I’d crash into what I was trying to avoid.”Dominique Fishback first left East New York to attend Pace College in Manhattan, where she discovered foods like Pinkberry for the first time (“It changed my life,” she says. “I was trying to get my cousins from East New York to travel, but they were not going to go to Manhattan for frozen yogurt.”)Shortly after she graduated, her acting career took off—catch her reprising her role as Darlene, a ’70s-era sex worker, in the second season of HBO’s The Deuce, as well as in the film The Hate U Give, out today. During filming, she had the opportunity to eat almost anything (well, as long as it was being provided by on-set catering), but still wasn’t feeling good about her choices.Fishback shooting hoops at a court by her apartment in Bed Stuy.\nSo she became pescatarian. “I was such a fast food girl, so people are really, really surprised by that,” she says now. “I had Big Macs all the time.”These days, she’s into fresh fruit, and the vegan Jamaican food at Bed Stuy’s Natural Blends, which does some of her favorite dishes, like curried chicken—without the chicken. “The tastes and the flavors that I was craving, I thought I couldn't have anymore, Fishback says. “But it's not true.”The travel her job requires—she just spent a few weeks on the road, first in France then in Canada promoting The Hate U Give— has also helped expand her palate beyond what her old neighborhood could offer, and she has mixed feelings about that.The dearth of culinary options in minority neighborhoods is a systemic issue that Fishback addressed in her one-woman show, Subverted, in a segment on imprisonment. “To be imprisoned isn't necessarily being behind bars,” she explains. “But in these neighborhoods, you have a certain radius that you go about, and these are the food options: Chinese, the corner store.”The Hate U Give is about a young black girl named Starr (played by Amandla Sternberg) who witnesses a police shooting of a close friend, so it’s no wonder that Fishback has the opportunities of the larger black community on her mind these days. She’s grateful to to have seen so much more of the world, but she looks back with frustration at what her neighborhood used to look like, and how it’s changing as more affluent and white folks move in. “Now there's a Planet Fitness, like we ain't never wanted to get fit before,” she says. “Now there's a VisionWorks. You don't think we needed glasses before?”And she’s still trying to figure out how to navigate her success as an actress. “It's hard for friends who are not where they wanna be at when I'm like, ‘I didn't book nothing up ‘til the end of this year.’ And they're like, ‘but you're on this show!’” Fishback says.“But a show isn't forever, and one show doesn't make your career. So I always approach everything like, What's the next thing? How do I create longevity in my career?”When she’s not working, Fishback decompresses with one of her first loves: basketball. She first played football in middle school, and she was the only girl. It was only when the coach cancelled practice one day and Fishback found herself in the gym idly shooting hoops that the basketball coach spotted her talent. “She was like, ‘Fishback, you want to be on the basketball team?’ I was like, ‘I don't play basketball. I play football.’ She was like, ‘You could learn.’” And that was that.These days, she can’t fit in as many pickup games as she’d like, so if she’s feeling antsy she’ll go to the gym. “I'm trying to find a routine that I like, but I don't really have one,” she says.Given how hectic her schedule is, the pace of the news cycle, and the toll it can take on the black community, Fishback is careful to tend to her mental as well as her physical health. “The building I live in now had a rooftop. I can just go sit up there and clear my mind and think and thank god and write and be at peace, which is a nice thing,” she says. “I've never felt at peace, really. In East New York, I had experiences there that eliminate peace, you know?”She also goes to therapy and encourages her family members to go too. “Cause you don't realize how much you carry, and it influences all the choices you make,” she says.Ultimately, though, one of the most important things to Fishback is having a voice: not just waiting for parts to come to her, but writing plays like Subverted and feature scripts that allow her to express herself in her own words. “It's hard when I see the news and something that I wrote three or four years ago is still relevant, but at least I know that as an artist, I gave my contribution and I will continue to do that,” Fishback says. “Right now, I'm trying to keep moving and keep happy.”Explore Bon AppétitHealthyishCelebritiesInterviewsRead MorecultureNicole Byer Is #VeryFatVeryBrave, Thank You Very MuchBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-05", "author": ["Condé Nast", "Zan Romanoff"]}