{"id": "81b8a433deea821b0dcd5da07dce54a5", "url": "https://www.bonappetit.com/story/dont-throw-out-fennel-fronds", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Fennel Fronds Are Delicious! Stop Throwing Them Out! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon't Throw Out Those Fennel Fronds! They're Tasty!You can use fennel fronds like any tender herb. And if you already bought the fennel, they're free!By Alex DelanyJuly 25, 2018FacebookTwitterEmailFacebookTwitterEmailWho doesn't love a deal? Free stuff! 2-for-1! Fifty percent off! Less money! More happiness! Savings are exciting! Free stuff is the best!Which is why fennel fronds are also the best. Fennel fronds come free with every fennel purchase you make. They’re a built-in deal that you don’t even have to negotiate. Instant savings!Okay, let's slow down for a minute. You might be thinking: Excuse me? Fronds? What in tarnation are those?Fronds are those cute frilly green leafy things attached to the stalks that grow out of a fennel bulb. They kind of look like fresh dill, and they have a texture that’s light and feathery. If you tickled someone with fennel fronds, they’d probably giggle. And then tell you to stop.The flavor of fennel fronds is very similar to the bulb that they come with. Fennel tastes a bit like licorice, equal parts bright and vegetal, and when you roast or caramelize fennel, it develops a natural sweetness that balances out its bitterness. The fronds boast that same anise-forward flavor, but taste more...green, if that makes any sense, with a more delicate texture.If you're making a fennel salad, mix the fronds right in there too.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiRemoving the fronds from the stalks is as easy as it sounds—just pull 'em off!—and incorporating them into dishes, especially dishes where you're already using fennel bulb, is a no-brainer. We use them in the same way we’d use other fresh, soft herbs like parsley or dill. You can mix chopped fennel fronds into pestos, salsas, stocks, curries, and vinaigrettes for an added hit of freshness. You can use them to top yogurt dips, eggs, stir-fries, toasts, and seared meats. And they're delicious when tossed into green salads or strewn on top of roasted vegetables.There are a ton of ways to take advantage of the delicate flavor that fennel fronds have to offer. It really doesn’t matter what you do with them, as long as it’s something. We just want to make sure you’re not missing out on nature’s finest deal: fennel fronds.You can also stir them into olive oil to make fennel oil, like in this recipe:One-Skillet Lemony Chicken with Fennel and TomatoesThis simple, satisfying one-skillet chicken recipe leaves you with a ton of sweet, sweet pan juices—plenty of crusty bread for sopping it all up is non-negotiable.View RecipeExplore Bon AppétitBasicallyFennelherbIngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Alex Delany"]}