{"id": "81bb6f29d6333abd09437c053eb57bc1", "url": "https://www.bonappetit.com/story/whole30-side-effects", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "The Whole 30 Side Effects You Need to Know About  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBefore You Go Paleo, Keto, or Whole30, Think About These Side EffectsRegardless of whether you call it a diet or a lifestyle, rigid food rules can have unintended consequences.By Natalie ZisesAugust 26, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailI didn’t become a binge and eating psychology coach because my relationship to food has always been smooth sailing.Since puberty, I was on a constant mission to lose weight. In middle school I saw a nutritionist; in highschool, I tried Weight Watchers; when I was 17, I bought Adderall off a classmate to suppress my appetite during the day, only to binge on “Cookie Cereal” (literally chocolate chip cookies in milk) at night; and when I worked in restaurants, an average shift would include snacks all night and end with a 2 a.m. burger, salad, and skillet cookie.Then I discovered Whole30. It drew me in with the rigidity. The hard and fast rules. The promise that “This is not a diet! It’s a reset!” The day I began Whole30, I got out of bed, used eyeliner to draw a 30-day countdown on my mirror along with some inspirational “You got this!” language, and carefully planned my upcoming meals. The thing about diets is that the first day is the best day. All the promise of control, the body you want, and the high of “a plan” giving you a false but very comforting sense of security.The 30-day eating plan that founder Melissa Urban urges is “not a diet” was strict, harsh, and for me, miraculous.Fifteen days into the program, I felt like a new person. I was lighter and more energized, I slept soundly, and I was much more mindful of what I was eating each day. But when the 30 days were up, I binged like it was Christmas morning (or Yom Kippur Break-Fast, in my case).I did Whole30 five or six times. Each time, within a day or two of finishing, I felt like a total failure.A year later, when I started my eating psychology coaching practice, I realized I wasn’t alone. A common unspoken side effect of the “miraculous” Whole30 is that it often ends—either by day 31 or way sooner—with bingeing. Eight out of nine of my clients who identified as having weight and health issues told me they’d experienced heavy binges after the 30 days were up.Turns out that, regardless of whether you call it a diet or a detox or a reset, controlling your food with rigid rules just doesn’t work if your goal is to lose weight.Recent studies show that there is no evidence that weight loss programs help people to lose weight in the long term. The rate of failure, defined as either gaining weight or not losing weight, is around 95 percent (some say higher), and attempting weight loss is actually a strong predictor of weight gain. In other words, the more you try to drop pounds, the more likely you are to gain them.Not only does dieting lead to weight gain, it’s also a common precursor to eating disorders, especially in young women. In a study done in 1991 over the course of three years, 14-year-old girls who dieted at a “severe level” were 18 times more likely to develop an eating disorder than those who didn’t. And those who dieted at a “moderate level” were five times more likely to develop an eating disorder.Many proponents of paleo, keto, or Whole30 will say ad nauseam that these are lifestyles, not diets, but if an individual engages in these eating habits with a dieting or weight-control mindset, they do in fact become diets. Whole30 founder Melissa Urban may not be trying to lose weight, but the reality is that most of us attempting to manipulate our food, especially women, are doing so with a desire to alter our appearance, often through weight.Isabel Foxen Duke, a diet recovery coach and creator of the Stop Fighting Food movement, believes that bingeing is a direct and inevitable outcome of restriction and real or perceived deprivation. That means that whether you’re eating the pizza or not, if you’re harboring guilt about it, chances are you’re going to find yourself bingeing. In fact, Foxen Duke renamed the term bingeing as “reactionary eating,” noting, in her Stop Fighting Food Masterclass,  that binges always happen in reaction to diet culture.Through my work as an eating psychology coach, I’ve seen that we can’t undo the cycle of dieting and weight gain until we understand what’s underlying our constant desire to drop pounds. At its core, dieting is a coping mechanism, and not a healthy one. We’re not born wanting to change our bodies, but billions of dollars are spent telling us that we should.I’ve come to believe that, to end the diet-binge cycle, there has to be an inherent acceptance of the bodies we’re in. We don’t have to love it, but we can start with accepting it. Geneen Roth, who’s written numerous books about body image and dieting, says in her book, Women, Food and God, \"If you try to lose weight by shaming, depriving and fearing yourself, you will end up shamed, deprived, and afraid. Kindness comes first. Always.\"Stress messes with our body’s ability to tell us when we’re hungry and when we’re full, so the more we worry about diet and weight, the harder it is to hear those biological signals. I believe that finding self-acceptance and reducing rules and restrictions around food is the only long-term solution.For me, the first step toward getting off the Whole30-binge cycle was simply bringing attention to my obsession. As Roth writes, \"If you pay attention to when you are hungry, what your body wants, what you are eating, when you've had enough, you end the obsession, because obsession and awareness cannot coexist.\" The more awareness we bring to a moment, the more we can understand the wisdom behind the binge: what it’s in reaction to and where it came from.Explore Bon AppétitHealthyishSelf CareessayRead MoreLifestyleIs Your Wellness Practice Just a Diet in Disguise?By Melissa A. FabelloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-26", "author": ["Condé Nast", "Natalie Zises"]}