{"id": "81c23f358d1aa5fd00bcac32cbc03264", "url": "https://www.bonappetit.com/story/watermelon-salad", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Watermelon Salad Is the Way to Make All Watermelon Taste Amazing, Even the Meh Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese 3 Ingredients Make All Watermelon Taste Amazing, Even the Meh StuffIf your watermelon is a bit lacking in the flavor department, here's how to save it.By Carey PolisAugust 6, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneFacebookTwitterEmailWe all have the same summer watermelon dreams: a slice so ripe that the juice drips down your arm and you don't even care. But sometimes you get a watermelon that's a little paler than it should be and it tastes like well, not much. It's fiiiiine, but it's not the fruit you've been dreaming about since you emerged from your winter cocoon.That's when it's time to make a five-minute watermelon salad with lime dressing and peanuts. You stir fresh lime juice, fish sauce, and sugar together then pour it over some watermelon cubes. (The recipe also says to add hand-scrunched basil leaves to the dressing but I... didn't.) Toss salted peanuts and basil on top, then drizzle with olive oil and sprinkle with flaky sea salt. Done.The dressing punches up even the least flavorful watermelons—the lime enhances the fruit's flavor and the fish sauce adds saltiness with a little funk (it's only one tablespoon, so it's not overbearing).Now for something very important I need to get off my chest: Can we all calm down a little about watermelon and feta salad? Why is it always a \"thing\" on mediocre restaurant menus? Too often, the feta turns soggy from the watermelon juice and everything becomes the same uniform texture of \"too mushy.\"I'll take this watermelon salad over that version any time: The peanuts offer a much more intense crunch, and instead of relying on feta for tanginess, the lime juice and fish sauce take center stage. I'm usually not one to take an anti-cheese stance, but this salad is an exception.Get the recipe:Watermelon with Lime Dressing and PeanutsThe jagged, irregular chunks of fruit in this salad recipe make it clear that something unexpected is about to happen.View RecipeExplore Bon AppétitSaladSummerWatermelonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-06", "author": ["Condé Nast", "Carey Polis"]}