{"id": "81c65f7930d38ec688e5338098a445b0", "url": "https://www.bonappetit.com/recipe/frozen-greek-yogurt-blackout-pie", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Frozen Greek Yogurt Blackout Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrozen Greek Yogurt Blackout PieBy Chris MoroccoOctober 2, 20184.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Drew Aichele, Prop Styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintThis no-bake pie is incredibly easy to make and will keep for over a week in the freezer. Don’t be alarmed by the amount of olive oil in this recipe—it gives the filling its semifreddo-like texture and balances the chocolate flavor.Ingredients8–10 servingsCrust1sleeve graham crackers (9 standard-size ones; about 5 oz.)¼cup old-fashioned oats2Tbsp. Dutch-process cocoa powder2Tbsp. light brown sugar1tsp. kosher salt6Tbsp. unsalted butter, melted (or more; see note below)Filling and Assembly4oz. bittersweet chocolate, coarsely chopped (about ¾ cup)½cup extra-virgin olive oil, plus more for drizzling2¼cups whole-milk Greek yogurt, divided½tsp. kosher salt, plus more3large egg whites½cup (packed) plus 1 Tbsp. light brown sugar, dividedCocoa nibs (for serving; optional)Special EquipmentA 9\"-diameter standard pie dishPreparationCrustStep 1Break up graham crackers and transfer to a food processor. Add oats, cocoa powder, brown sugar, and salt. (Alternatively, you can finely crush graham crackers in a medium bowl with a smaller bowl into very fine crumbs, then combine with remaining ingredients. The oats can be pulverized with a spice mill or mortar and pestle.) Pulse until finely ground, then add butter and pulse until combined. The crust should hold together when squeezed, but break apart when firmly poked with a finger. Add 1 more Tbsp. melted butter if needed to get crust to come together.Step 2Press crust into bottom and two-thirds of the way up the sides of pie dish in an even layer. Freeze 10 minutes before filling.Step 3Do Ahead: Crust can be made 1 week ahead. Cover with foil and keep frozen.Filling and AssemblyStep 4Melt chocolate and ½ cup oil in a small saucepan over low heat. Let cool slightly. Transfer to a large bowl, then add 1½ cups yogurt and ½ tsp. salt and stir to combine.Step 5Using an electric mixer on medium-high speed, beat egg whites in a medium bowl until white and foamy, about 1 minute. With the mixer running, gradually add ½ cup brown sugar, then continue to beat until stiff peaks form, about 3 minutes longer. Add one-third of meringue to chocolate mixture and fold in thoroughly but gently with a large rubber spatula (this will help lighten it so that the rest of the meringue will be easier to add without deflating it). Add remaining meringue and fold in until no streaks remain. Transfer to prepared crust, keeping filling inside edge of crust and mounding into center if needed. Freeze pie until firm, at least 3 hours. (To freeze overnight, let it sit at room temperature 30 minutes to temper before serving, which will make it easier to slice.)Step 6Combine remaining ¾ cup yogurt, 1 Tbsp. sugar, and a pinch of salt in a small bowl. Dollop yogurt mixture onto pie or onto slices before serving. Drizzle with oil, then sprinkle with cocoa nibs (if using).Step 7Do ahead: Pie can be made 1 week ahead. Cover and freeze. Yogurt topping can be made 1 week ahead. Cover and chill.How would you rate Frozen Greek Yogurt Blackout Pie?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis is one of my go-to dessert recipes. The taste and texture are fabulous! When I am out of a quality olive oil, I use unrefined, virgin coconut oil, which works perfectly as a substitute and imparts a just a hint of coconut. I also found that I prefer baking my crust for 12-15 minutes before freezing and filling.Mica JaneSanta Fe, NM12/5/2020chocolate and yogurt just don't matchxiaoyaahNew York10/9/2019This pie went together beautifully and while the texture of the filling was lovely,  it  tasted completely of olive oil. Perhaps it was the type I used - but if you make this be sure your olive oil is very mild.  You may also  wish to reduce the amount somewhat.  Nobody finished their dessert which rarely happens with anything from Bon Appetit.MorticiaCooksToronto6/18/2019Really delicious. I would maybe use a little less olive oil the next time I make it but it was a hit!AnonymousUS/Germany6/16/2019I stored in the freezer between eatinggassStuttgart, Germany6/8/2019This pie is awesome. I hate whipping egg whites, so I omitted them and just made the yoghurt part of the pie. It is still delicious. Slightly salty, creamy, with a lovely note from the olive oil. I recommend!gassStuttgart, Germany6/8/2019Is this to be stored in the fridge or freezer between eating?? AnonymousMissoula,MT3/18/2019Explore Bon AppétitPieDessertFrozen DessertAmericanGraham CrackerOther IngredientsChocolateYogurtVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Chris Morocco"]}