{"id": "81d2f8a9249d2a9a0cdb024a16f9a8ea", "url": "https://www.bonappetit.com/story/mamajuana-cocktail", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Mamajuana Is a Low-Effort Cocktail Project That Pays Off Big Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMamajuana Is a Low-Effort Cocktail Project That Pays Off Big TimeAssemble this traditional Dominican bottle-infused cocktail once. Drink it all year long.By Carlos MatiasFebruary 26, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThe airport officer opened my luggage and told me it couldn’t go, pointing to the glass jug full of roots and herbs. He continued to inspect my bag and spotted the 300 Dominican pesos (about $5) I had placed next to the container, anticipating this scenario. He grabbed the money and sent me on my way. I’ve learned that influencing an airport official at Punta Cana International is usually easier than finding the traditional ingredients for mamajuana in the U.S.Often referred to as Dominican Sangria, mamajuana is an infused and aged DIY cocktail made with tropical bark and herbs—bohuco pega palo, alo de Brasil, and uña de gato, to name a few. Sure, you can purchase packaged mixes of the ingredients on Amazon and Etsy, but since I can’t vouch for their quality or authenticity, I use my own mix of star anise, hibiscus petals, allspice, cinnamon sticks, dried basil leaves, whole cloves, chicory root, eucalyptus, and ginger to approximate the flavors. As long as it’s stuffed in a jug and steeped in aged rum, sweet red wine, and honey for at least a few days or up to several months, the results will resemble the amber-colored, dessert-rum-flavor of the local recipe. It’s an excellent post-dinner digestif, nightcap, or last-minute hosting cocktail (when that becomes a thing again)—and it’s the only thing that gets me through New York’s cold, harsh winters.My memories of strange brown stuff in clear bottles go back as far as I can remember. I recall conversations and parties quickly forming whenever there was a bottle around. It turned domino tables into stages, my cousins into professional merengue dancers, and made an excellent chaser for my favorite uncle’s stories. My family rarely left me out of the action because tradition took precedence over underage drinking rules. “Give him a little. It’s not alcohol; it’s mamajuana,” my aunts would tell my parents.Photo by Emma FishmanAccording to my grandmother, it’s the only flu vaccine she trusts, my cousins take shots of it before going out into the night’s cold, and Porfirio Rubirosa, the Dominican James Bond, drank it because he believed it increased his libido. I can neither confirm nor deny either of these claims, but I can attest to the fact that (contrary to my aunts’ assertions) the sweetness of the honey and spiciness of the herbs mask a high alcohol content that will sneak up on you if you’re not careful.But the mamajuana wasn’t always a boozy cocktail. Its roots can be traced back to the Taínos, the Caribbean’s indigenous people, who used the same mix of herbs to create a medicinal tea before European explorers added alcohol to the elixir. It was later banned under Rafael Trujillo’s oppressive regime in the mid-1900s when the dictator discovered it was being used as an aphrodisiac. This only added to mamajuana’s mysticism and popularity.The traditional formula varies from family to family, and even among family members, so recipes serve more as guidelines than directions. Depending on the mix and how long you let it sit, the taste can range from piney and woody to spicy and sweet, with hints of earthy cinnamon or licorice-like anise. It can go down smooth like a sip of wine or leave your tastebuds with a potent reminder, like a shot of absinthe. When I can’t travel to get the ingredients locally—or don’t feel like risking a run-in with law enforcement—I make my own using ingredients I can find Stateside. After a few undrinkable batches, some trial and error, and endless phone calls to my relatives, I perfected my version. Here’s how I make it:Add 5 whole anise stars, 5 allspice berries, 8 hibiscus petals, 5 cinnamon sticks, 6 dried basil leaves, 5 whole cloves, 2 tablespoons chicory root, 4 eucalyptus leaves, and a 2\" piece of ginger root (cut so it fits through the mouth of the bottle) to a large glass jug or empty 750-ml liquor bottle. (The traditional recipe calls for curing the bark and herbs in wine first to get rid of the bitterness, but you can skip that step here). Fill the bottle with 1 part light or dark aged Dominican rum (I favor Brugal Añejo dark rum, but a lesser aged rum will result in a sweeter mamajuana with less complexity), 1 part red wine (I like Malbec), and 4 Tbsp. honey. You can adjust the ratios to make it as sweet or as potent as you want. Let the ingredients steep for a month, shaking the bottle every few days to encourage extraction, and adding more wine and/or rum to adjust the flavor to your liking. You can start the process over with the same bottle of herbs until they start to lose their flavor.Some of my family say it doesn’t live up to their versions, while others argue they can’t tell the difference. One thing we do agree on is another round.Carlos Matias is a writer living in New York. Mentally, he resides on a beach in the Dominican Republic, where he spends his days drinking mamajuana.Explore Bon AppétitFirst PersonCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-26", "author": ["Condé Nast", "Carlos Matias"]}