{"id": "81ddce51ba6a0954daf802686ed574f9", "url": "https://www.bonappetit.com/story/dash-rapid-egg-cooker", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "This Egg Cooker Makes Boiled Eggs At the Press of a Button | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBoiling Eggs Isn’t Hard, But This Egg Cooker Makes It Stupid EasySet it and forget it.By Nico AvalleMarch 7, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’m bad at boiling eggs. That’s embarrassing to admit because what I’m saying is that I’m bad at timers. Our recipe for jammy eggs is fewer than 100 words, and a lot of those words are about putting a pot of water on the stove. The only real step is waiting patiently for 6½ minutes, but still, I pull my eggs from the ice bath only to find chalky yolks or unset whites and—when I return to the dining room—a group of friends who expected much more out of ramen night.They make it look so easy.\nSure, my colleagues in the test kitchen make boiled eggs out to be a science, but they did not consider that I am bad at science. But that’s okay! Just because one aspect of cooking (even a really, really easy aspect of cooking) eludes me, it doesn’t make me a bad chef. It just means I need some help—and for me, that help comes from a little machine called the Dash Rapid Egg Cooker.The Dash is a mini steamer, and it’s as simple an appliance as can be. It has one button that might as well just say EGGS, and for less than $20, it allows even the most timer-averse cook to attain jammy perfection every single time. To use it, just add water to the reservoir, place up to six eggs on the tray, cover, and press the button. A few minutes later, the Dash will sing a song to let you know it’s (literally) out of steam, and voilà—perfect boiled eggs. No tricks, no secrets, no science, that’s the whole thing.Dash Rapid Egg Cooker$20 at Amazon$20 $18 at TargetI know single-use appliances can be a tough sell, but this one is smaller than a lot of my food storage containers. It’s also freaking adorable—an essential quality in any niche kitchen tool—available in a whole slate of pretty pastel colors and shaped like a twee UFO from planet Egg. Above all else, it’s just so easy to use. You adjust the firmness of your yolks by tweaking the amount of water you add with an included measuring cup, which has labels for Soft, Medium, and Hard. I’ve found that by slightly under-filling the cup, I can skip the ice bath entirely and let the eggs cool inside the Dash, which means no more empty ice trays at cocktail hour.In my kitchen, the Dash Rapid Egg Cooker has turned boiled eggs into the no-stress topping and ingredient I’ve always wanted them to be. I can turn it on when I start making instant noodles for a more filling snack. I can make potluck-ready quantities of deviled eggs without throwing away a shameful amount of duds. Most important, it lets me focus on the parts of cooking I’m good at—and the parts that actually interest me—and that’s the kind of convenience I’m willing to pay for.Put an egg on it:Thai Basil Sauce Noodles with Jammy EggsThese noodles hit every note we look for in a satisfying dinner: Herbaceous, saucy noodles, fresh crunchy toppings, and a jammy egg on top. It's really worth seeking out grassy, spicy Thai basil for the the three-ingredient basil sauce.View RecipeExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-07", "author": ["Condé Nast", "Nico Avalle"]}