{"id": "81e1f491c3dc682c42b97714d4ef57f3", "url": "https://www.bonappetit.com/story/canned-cocktails-to-drink", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Wait, Which Canned Cocktails Are Actually Good? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWait, Which Canned Cocktails Are Actually Good?We tasted a ton so you didn’t have to. Here’s what you need to know, and the cans to buy.By Alex DelanyNovember 14, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhat would it take for me to like a canned cocktail? That’s a question I—a human being who very much enjoys making, drinking, and toting can-less cocktails—have been asking myself a lot lately. If you’ve been paying attention to the shelves at your liquor store, millennial-targeted TV spots, or Instagram advertising campaigns, you’ve probably noticed that there are a ton of canned cocktails entering the market right now. Maybe you’ve even tried a few. But after months of asking myself that question on repeat, I decided to find out.So a group of BA editors got together to taste through many different canned cocktail flavors from many different canned cocktail companies. And while we did, we kept three questions in mind: Is this good? Does it hold up to its original? And most importantly, Would I recommend it to a friend? In the end, we came away with a short list of specific cans that we felt fit the bill, as well as three essential takeaways:Still (not bubbly), juice-less canned cocktails tend to be more truthful to their can-less iterations. Across the board, cocktails that included only liquor and some sweetening agent tasted closer to the real-world version of the cocktail than cocktails with carbonation or other non-booze ingredients. Basically, the less going on—like in an Old Fashioned or a Manhattan—the less of a chance it’s going to taste terrible.Canned cocktails with citrus juice post a higher risk. Fresh citrus juice is one of nature’s most brilliant flavors. But the longer it sits, the worse it tastes. Bright, tart notes can quickly turn to soapy, bitter, drink-ruining ones. If you’re buying a canned cocktail with big citrus flavors, like a Paloma or a Margarita, do so with caution.Just because it looks cute, doesn’t mean it tastes...cute. There are a lot of canned cocktail companies that have figured out how to brand and market a canned cocktail. There are far fewer that have learned how to actually make a good one. Don’t be fooled by cute illustrations, unless you’re just buying cans with the sole intent of keeping them on your photogenic bar cart.Okay. You’ve taken notes. Good. Here are the canned cocktails we loved the most from the brands we felt delivered consistently across their respective portfolios:Photo by Alex LauTip Top Old FashionedTip Top’s canned version of the classic whiskey-sugar-bitters cocktail was developed by Miles Macquarrie of Kimball House in Georgia. The can hits the stiff, simple, whiskey-forward note with a subtle touch of orange, derived from bitters, not citrus juice. This is equal parts grandpa’s study and trusty dive bar. Which is exactly what you want from an Old Fashioned.Photo by Alex LauBelle Isle Blood Orange Moonshine and SodaIf you’re thinking of light, refreshing, spritzy flavor, you might not be thinking of moonshine. But this Richmond, VA based distillery delivers one of the cleanest canned cocktails we tried. And while it does have citrus flavor, it comes from the blood orange moonshine, not fresh citrus juice, which means you don’t get any bitter, soapy flavors. Just clean fruit and energetic bubbles, not unlike a vodka soda.Photo by Alex LauCardinal Spirits Vodka SodaIndiana-based Cardinal Spirits goes one step simpler with a vodka soda that’s just house-distilled vodka and sparkling water. While you could certainly drink this straight-up, we loved it with the addition of fresh juice. A spritz of grapefruit, orange, lime, or lemon all work nicely. Though a bit of tropical fruit puree or some muddled berries probably wouldn’t be too bad either.Photo by Alex LauSlalom Fox Colorado MuleDitch the festive copper mug, and just drink this mule right out of the can. The ginger flavor from the syrup is clean and spicy. The lime juice holds it’s brightness. And the bourbon provides a layer of deep, warm flavor that makes this Colorado-made mule perfect for a fall afternoon spent on a mountain or a boulder or a small rock—or maybe just a slab of cement in your driveway.Photo by Alex LauPampellone French 75All of Pampellone’s canned cocktails are made with a sparkling wine base, and while they don’t quite adhere to the classic versions of the cocktails in terms of ingredients, they absolutely deliver on flavor. The French 75 doesn’t have any gin, but it is hit with Meyer lemon and elderflower, which lend a citrusy, botanical backbone that gets lifted up with sparkling acidity from the wine. If you’re into a spritz, this is your move.Photo by Alex LauCutwater Spirits MargaritaMaking a good margarita is incredibly easy. Making a great one is tougher than you’d think. Making a great canned margarita is another thing entirely. It’s all about balance, and Cutwater’s floral-forward, house tequila, cane sugar, lime juice, and barely noticeable touch of orange flavor run in perfect harmony. We’d recommend dipping the lip of the can in a bit of water and rolling it in some salt before opening. Just because your drink comes in a pop top doesn’t mean you should skimp on the proper finishing touches.Photo by Alex LauEmpirical Spirits Minor ThreatRemember when I said the more complicated the cocktail, the more risky the flavor? Well, turns out that’s not the case when the cocktail is from Empirical Spirits. This Copenhagen-based distillery uses their Koji spirit—made from barley koji, pilsner malt, and saison yeast (yeah, pretty cool)—as alcoholic component in this canned cocktail. Each release of Minor Threat has a different flavor profile, but whether it’s laced with tart rhubarb, jasmine tea, and orange blossom like the fruity, acidic, floral iteration above or runs with notes of oolong milk tea and gooseberry like its predecessor, Empirical’s limited-edition offerings have the best chance of blowing your mind.Want a...bottled cocktail? Here ya' go.It’s Called Spaghett and It’s Now My Favorite Summer CocktailI ordered this drink based on the name alone. How could you not?!View StoryExplore Bon AppétitCocktailproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Alex Delany"]}