{"id": "81fa672e83d5e579a2e2da5ca3f7f704", "url": "https://www.bonappetit.com/story/why-im-slowing-down", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Why I’m Slowing Down | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy I’m Slowing DownRestaurant recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroFebruary 28, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Early last week I woke up with a screaming back ache—a type of pain I've never felt before. After a lot of hours spent in doctors' offices and MRI machines, I found out that I herniated a disk. Not great, but not a life sentence either. I was ready to take the drugs, start the physical therapy, and get back to my walking/running/biking/dancing life, but my back had other ideas. It's been a sloooow couple weeks, and I mean that very literally. No gym, no bike, no running,  even if the train is pulling into the station and I'm on the wrong side of the turnstile. Walking is okay, so I've been doing a lot of that. And while I'm itching to run around again, I'm forcing myself to stay with the slowness and lean into the calm so I can actually heal. But OMG it's hard.The already iconic French-ish Onion Soup\nPhoto by Alex Lau, Food Styling by Susie TheodorouWhat I'm Eating NowA few months ago I told Chris Morocco that I wanted to create a Healthyish recipe called \"French-ish Onion Soup.\" He went into mad-scientist mode, as he does, and the result was the most popular Healthyish recipe we've ever posted. But this soup is more than a pretty face. It's rich and caramel-y and savory with just enough cheese to feel like you're pampering yourself.Nothing much else is happening in my kitchen, TBH. Last weekend I was in Philadelphia, where I drank a tahini milkshake from Goldie, a thing I'd been dreaming about ever since Alex Delany mentioned it two years ago. I also had a great dinner at Sarvida, the follow-up Filipino spot from the owner of Perla. Tomorrow I'm flying to Amsterdam for an actual vacation. I think I forgot what that word means, but I'm excited to find out. Any food recommendations? DM me or let me know at healthyish@condenast.com.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleMy Favorite Healthy Restaurants Are BarsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-28", "author": ["Condé Nast", "Amanda Shapiro"]}