{"id": "8206b98c8834d208720f1728a3915e66", "url": "https://www.bonappetit.com/story/climate-activism", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "So You Want to Be a Climate Activist? Start Here. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSo You Want to Be a Climate Activist? Start Here. Because we can’t stop climate change with tote bags and reusable straws alone.By Aliza AbarbanelFebruary 20, 2020FacebookTwitterEmailFacebookTwitterEmailIn It’s Getting Hot in Here, Healthyish assistant editor (and aspiring low-waste disciple) Aliza Abarbanel walks us through one thing we can do each month to adapt our lifestyles and pantries for a pre-apocalyptic world. Up next: Finding the type of climate activism that fits your priorities.Up to this point, I've focused this climate column on changing my lifestyle—tracking my trash and composting my coffee grounds. These actions have felt empowering, but they haven’t exactly felt influential. (Remembering to bring my own reusable produce bags is manageable; getting the U.S. to rejoin the Paris Agreement, less so.)But between the increasingly dire climate studies, the ongoing global climate strikes, and the all-consuming Democratic primary, which carries remarkable weight for the future of American climate policy, I’ve been wanting to do more. And I’m not alone. There finally seems to be a sense of collective urgency around environmental issues. According to the Environmental Voter Project, 14 percent of registered voters list “addressing climate change and protecting the environment” as their top priority, up from an estimated 2–6 percent in the 2016 presidential election. (Okay, 14 percent is not exactly an overwhelming majority, but I’ll call it progress.) The 2016 general election presidential debates went by without a single question on climate policy, but this year, both CNN and MSNBC held climate town halls with democratic candidates. Just yesterday, a climate journalist moderated a presidential debate for the first time.“This moment feels like no moment I’ve really experienced before in my time as an organizer, as an activist, as a community member, as a mother,” says Eva Hernandez-Simmons, deputy national program director for the Sierra Club, a grassroots environmental organization with over 3.8 million members. “This is the year we really need folks to come together and build the power that’s essential for creating systemic change.”So, for this month’s climate challenge, I decided to look beyond personal choices and toward collective action, a.k.a working alongside others to make change via protests, strikes, and political campaigns. If quitting plastic straws changes the way we as individuals interact with the earth’s resources, collective action works to create large-scale change. There are hundreds of organizations doing this work, making the landscape difficult to navigate without a compass. So I decided to make one.The problem:We can’t stop climate change with tote bags and reusable straws alone. We need to achieve net-zero greenhouse gas emissions fast, build up renewable energy systems, and support climate refugees—which requires new laws and national initiatives. The world, and the United States specifically, is far from making the structural changes needed to meet this crisis. But we’re in an election year, which climate action organizations are using as an opportunity to push everyone from prospective city councilors to presidential hopefuls to prioritize climate change.The challenge:There are countless ways to advocate for the climate issues that matter most to you, from helping set up a local composting program to knocking doors for climate-focused candidates. There’s a lot to consider, so this month we’re finding a way to get involved that works for our values and our schedules.Step 1: Write down the issues you care about most I know, I know. I always advocate for making lists. But I’m not ashamed of repeating myself, because I’ve found organizing all my thoughts in one place is the easiest way to assess my ideas and turn the strongest ones into action.Start by writing down all the climate-related issues you care about: building renewable energy systems, banning single-use plastic, building resilience in frontline communities. All of the above made it onto my own list, plus one major bullet point: The Green New Deal, a resolution to achieve net-zero greenhouse gas emissions through a federal jobs program employing millions of Americans to overhaul the nation’s energy systems and infrastructure. The non-binding resolution is currently stalled in Congress, but versions of it live on in the platforms of many Democrat presidential candidates.Step 2: Find a group that shares your prioritiesNow that you’ve written down your areas of interest, narrow down the scope by asking yourself a few questions: Do I want to focus on one issue or several? Act locally or nationally? Wade into the upcoming presidential election? There are no right answers here, just the right level of involvement for you.If you’re reluctant to plunge into the political deep end, search for local groups running neighborhood cleanups or community compost programs. To focus on policy, look for a local chapter of a nationwide climate action organization like Sierra Club, Sunrise Movement, or Food and Water Watch.I decided to maximize my time by volunteering for candidates who support the multifaceted The Green New Deal. I wanted to focus on ambitious climate policy that imagines a bold future, tackling income inequality and racial discrimination while preserving our planet's future. And while I usually approach new activities with enthusiasm, only to overcommit, I decided to make a manageable goal of doing one activity a month. Hopefully, I'd do more.Step 3: Build momentumStepping outside of your routine and actually attending a meeting can be the biggest obstacle. Skip the temptation to put it off (and keep putting it off) by making a plan to attend one meeting. If you need a little extra help holding yourself accountable, invite a friend to join you.After reviewing my own goals list and my larger political priorities, I decided to volunteer for the presidential candidate whose climate policy has earned endorsements from Sunrise Movement and Zero Hour: Bernie Sanders. So on a concerningly unseasonably warm January afternoon, I walked around my neighborhood collecting signatures to get Bernie on the New York ballot. Approaching strangers on the street is not my ideal activity, but I had a good pick-up line: Wow, can you believe it’s January? Do you want to support a candidate who supports the Green New Deal?Not everyone I spoke with agreed with me. But it felt good to be talking about issues that mattered to my community, and that made each conversation feel worthwhile. At the end of the day, I blocked out time on my calendar to do it again. A week or so later, I learned we hit our petitioning goal.Why it works:“The climate crisis is real and huge and one of the most daunting issues facing us today, but every day I see how individuals coming together around shared values with a shared purpose can make huge change,” Hernandez-Simmons. “Despite all these roadblocks at the national level, I’m seeing really powerful climate action at the local and state level, whether that’s folks getting involved with our Ready for 100 campaign to get cities and states to commit to an equitable 100% clean energy future or working to get more electric vehicles on the road.”The legacy of collective action appears throughout history, from the labor movement to fossil fuel divestment. As an individual participant, I’ve also found that advocating for big-picture change helps refocus my perspective on the climate crisis. Instead of berating myself for forgetting my tote bags at the grocery store (or glaring down the person behind me who appears intent on triple-bagging their chips), I think about fixing the government plastic subsidies and corporate carbon footprints that got us here in the first place.“The best way to handle the fear and anxiety about the crisis is to confront it in community with other people,” says Sara Blazevic, co-founder and managing director of Sunrise Movement. “The burden can be a little less heavy if it’s shared with other people, coupled with committing to fighting for one another and the world we want and need.”Explore Bon AppétitHealthyishIt's Getting Hot in HereessayRead MoreLifestyleHow to Stop Making Excuses and Start Composting AlreadyBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-20", "author": ["Condé Nast", "Aliza Abarbanel"]}