{"id": "82084a1d569d235b23fe8ea0646d4b0b", "url": "https://www.bonappetit.com/story/mezzaluna", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "My Mezzaluna Is Essential for Pesto, Salsa Verde, and Sofrito | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Won’t Make Pesto (or Salsa Verde, or Soffritto) Without My MezzalunaIt’s faster than a conventional knife and gentler than a food processor.By Ameer KotechaSeptember 9, 2020FacebookTwitterEmailPhoto Courtesy of HIC KitchenFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!When I first saw Nigella Lawson use a mezzaluna to chop up a mountain of parsley without breaking a sweat, I rushed out to get my own. The crescent-shaped curved blade is often used in Italy for pesto and soffritto, the small dice of carrot, onion, and celery that is the base for so many soups and stews. I use mine to dispatch herbs, garlic, ginger, nuts, and anything else that I want either roughly chopped (done in seconds) or finely minced (more like a minute). It works a dream for the likes of salsa verde— the whirring blades of a food processor can create heat that dulls the vibrant taste of herbs, but a mezzaluna preserves every bit of fresh flavor.Mezzalunas come in a variety of sizes (if you want to impress your mates by slicing up a pizza like a pro, opt for a larger one), with one or two parallel blades. The latter will give you twice the number of chops in the same amount of time, but you risk getting bits of food stuck between the blades. For me, the traditional single-blade ones are best.Operating a mezzaluna is simple: Grab the two handles and rock back and forth while the curved blade does its thing, gliding over the board. It makes a pleasing whooshing sound when seesawing—somewhere between a rocking chair and a samurai’s sword. Your fingers will be tucked safely away too, as you use both hands to grasp the sturdy handles instead of guiding the blade as you might with a conventional knife. In other words, they are foolproof—which is useful when you want to keep all your fingers intact.HIC's Mezzaluna$7 at Amazon$7 at Bed Bath & BeyondExplore Bon AppétitHealthyish Loves ItPestoToolsHealthyishShoppingRead MoreshoppingThese Chic Water Glasses Pull Double Duty for DessertBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-09", "author": ["Condé Nast", "Ameer Kotecha"]}