{"id": "8209691647e1b9badf56f00ab37ab61b", "url": "https://www.bonappetit.com/story/black-bean-soup-in-instant-pot", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "Instant Pot Black Bean Soup So Fast You’ll Never Go Back to Canned Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingInstant Pot Black Bean Soup So Fast You’ll Never Go Back to Canned BeanSpicy, creamy, and ready in a jiffy.By Alex BeggsOctober 29, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailI caught Carla Lalli Music weighing a handful of Fritos on a digital scale in the test kitchen. She held them out to me in her palm and cried, “This? This is a serving size of Fritos!” It was approximately seven corn chips, and it was the saddest thing we’d ever seen. And then we ate the whole bag, piled on bowls of creamy, chipotle black bean soup that she’d just made in an Instant Pot.It’s the reason we’re gathered here today, to celebrate this new recipe that utilizes one of a pressure cooker’s best features: turning dried beans into soft ones in 20 minutes (as opposed to two to three hours it takes on the stove).There’s always that moment with Instant Pot recipes when your whole body just wants to dump everything in the pot, close it, and call it a day. But if you want a soup with real flavor, ya gotta build it. Carla’s Instant Pot black bean soup recipe begins with cooking bacon on the pot’s sauté function, then sweating some onions, carrot, and garlic, before adding some chipotle chiles in adobo, spices, a pound of dried beans, and water. The chiles, cumin, and salt make this an incredibly well-seasoned and spicy soup, and we loved it, but you can use just one chile, and less salt, if you’d prefer something milder.A note on timing: I’d estimate there’s 15 minutes of cook time before you close the pot, around 20 minutes to build pressure depending on the machine, 20 minutes cook time under pressure, and 10 minutes to naturally release pressure. Still, it’s a lot of soup, for a very low cost, in an hour! Isn’t pressure cooking fun?!When the beans are done, use an immersion blender right in the pot (or use a regular blender) to purée the soup into a smooth consistency. Then top each bowl with sour cream, onions, lime juice, cilantro, and Fritos, obviously.Get the recipe:Instant Pot Black Bean SoupThis black bean soup is seasoned with a heavy hand. If you are salt- or spice-averse, decrease the amount of salt to 1½ tsp. and use 1 chipotle chile with 1 tsp. adobo sauce instead.View RecipeExplore Bon AppétitInstant PotBlack BeansSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-29", "author": ["Condé Nast", "Alex Beggs"]}