{"id": "820c6f078e6fa976359c8560dfe055b8", "url": "https://www.bonappetit.com/story/baking-fail-troubleshooting", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "3 Reasons Why Your Baking Fail Is Probably Not Your Fault | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopeffed it up3 Reasons Why Your Baking Fail Is Probably Not Your FaultChances are you didn't do anything wrong, and a few small adjustments will fix everything.By Claire SaffitzMarch 9, 2018FacebookTwitterEmailFacebookTwitterEmailRaise your hand if this has happened to you in the kitchen: You are attempting a baking recipe—a cake, let’s say—and you meticulously read, reread, and follow all the steps. You cream the butter and sugar in the mixer for a full five minutes until it’s definitely \"light and fluffy.\" Your eggs are completely room temperature. You’re extra careful not to over-mix the batter when you add the dry ingredients. Your cake pan is thoroughly buttered and floured. Your oven has been preheating for ages. Then after 30 minutes of peeking through the oven door, you realize it's happened again: That cake is burnt around the edges, and almost certainly raw in the middle.If this happens to you on the regular, you may have come to the unfortunate conclusion that you’re just not a good baker. But it's not true! There may be very real reasons that your baked goods are not turning out, and they could have absolutely nothing to do with you. Good bakers aren't born—they're made. And with enough practice and experience, you'll be able to identify the factors that determine whether a given baked good succeeds or fails. Let's troubleshoot all the ways your baking game can be derailed by outside forces and what you can do to counter them.This Is the Only Cake Pan You Need to BuyThe cake pan to beat all cake pans? It's aluminum, light-colored, and definitely round. Here's our recommendation.View StoryMaybe Your Pans SuckIf the above problem has happened to you, I’d bet money that you were probably using a dark pan, or one with very thin sides, or both. I have a couple of flimsy dollar store pans that have a dark coating, and when I compare the cakes that come out of them to those made with my heavy-duty, slightly more expensive light-colored aluminum pans, darker pans always produce poor results. That’s because dark pans absorb and distribute heat more quickly than lighter ones, so batter sets and browns more quickly, leading to uneven baking and potential burning. If you’re baking in dark pans, drop the oven temperature by 25°F and check for doneness earlier. The same is true if you’re baking in glass. Glass takes longer than metal to heat up but it also retains heat longer, so it actually bakes things more efficiently. This can also lead to over-baking, so it’s also best practice to drop the temperature and keep a watchful eye on the oven.3 Steps to Take So Your Oven Won't Betray YouView StoryMaybe Your Oven SucksMany ovens—especially shitty NYC apartment ovens like mine that are little more than glorified tin boxes—have hot spots. You know this if you bake a tray of cookies without rotating the pan halfway through: the cookies on one side come out pale while the ones on the other side are nearly burnt. To become a proficient baker, you have to get to know your oven. Even though the knob says it’s 350° does not mean the internal temperature is anywhere close to that. Get an oven thermometer so there’s no question about accuracy. If your oven has crazy hot spots, try rotating pans at least once during baking. You can also go to a home improvement store and purchase unglazed ceramic tiles—which are very inexpensive—and place them on the floor of your oven to better diffuse and distribute heat. I did this in my oven and it absolutely makes a difference. Also, other than rotating a pan now and again, resist the urge to open the oven frequently, as this can lead to dramatic temperature swings, which never helps.Baking Soda vs. Baking Powder: What’s the Difference?Keep messing up your baked goods? This article is for you.View StoryMaybe Your Baking Powder and/or Baking Soda Is ExpiredIf you have an issue with the rise (or lack thereof) of your baked goods, expired baking soda or powder might be the culprit—especially if you don't bake often and those guys have been sitting around for a long time. Even though they have long shelf lives, chemical leaveners will lose potency over time. If the only box of baking soda you have around is the one that's been absorbing odors in your fridge for the last few years, it's probably a good idea to get a new box just for baking.Niiiiiiiice and even—that's what you're looking for.\nPhoto by Alex LauOK, It Might Also Be Your FaultIf you've got great pans, a fancy oven, and fresh chemical leaveners and your cake is still burnt, well, then you're probably looking at a case of user error. Which is OK! There are a lot of parts of any given baking recipe that seem like they wouldn't make a difference, but are actually totally crucial. Here are a few things you could have overlooked:Always use liquid measuring cups to measure liquid and dry measuring cups to measure dry. Especially when measuring flour, accuracy is important, so using only dry measuring cups—or better yet, weighing on a scale—is key. In the Bon Appétit test kitchen, we prefer the “spoon and level” method, meaning we spoon the flour into the measuring cup (rather than using the cup to scoop directly) and then level it off with a bench scraper or other flat-edged tool.Always bake in the center of the oven. A pan placed too close to the bottom of the oven will receive more heat radiating from the oven floor, baking it faster from the bottom. The reverse is true of something baked on the top rack. Always bake in the center for the most even baking and browning all around. If you have to bake on two racks at once—two baking sheets of cookies, for instance—make sure to rotate the pans halfway through. But in order to get the most even baking possible, you need to swap the top and bottom sheets and rotate each pan 180° as well.Only bake one type of thing at a time. Even when it seems like you're killing two birds with one stone, baking multiple recipes at the same time in one oven presents a tricky balancing act. Having more than one thing in there affects bake time and temperature, plus it adds moisture to the environment and blocks heat flow, so things just don’t turn out as reliably as they would on their own. Best avoided.Now, how about some apple butter spice cake?Apple Butter Spice Cake with Cinnamon CrumbleCINNAMON. CRUMBLE.View RecipeExplore Bon AppétitBasicallyEffed It UpCakeBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Claire Saffitz"]}