{"id": "8211b03b36a35f8f4456e9ee645f7381", "url": "https://www.bonappetit.com/recipe/sweet-cinnamon-tamale", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Sweet Cinnamon Tamal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueSweet Cinnamon TamalBy Daniela Soto-InnesJanuary 8, 20194.8(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintTamales are traditionally wrapped in individual corn husks and steamed, but baking a single large-format tamal in a foil-covered pan set in a roasting pan of hot water produces a similarly tender texture. The result is a moist, barely sweet cake with pudding vibes. We used Bob’s Red Mill masa harina for this tamal recipe—it has a more pronounced corn flavor than other brands.Ingredients8 servings Nonstick vegetable oil spray1½cups masa harina (masa flour), preferably Bob’s Red Mill1tsp. baking powder1tsp. kosher salt1tsp. ground cinnamon, plus more for serving4ears of corn, husked, kernels removed, or 4 cups frozen, thawed¾cup (1½ sticks) unsalted butter, room temperature½cup raw or demerara sugar1tsp. vanilla extract1cup crème fraîche⅔cup crumbled queso fresco, plus more for servingPreparationStep 1Preheat oven to 325°. Lightly coat an 8x8\" metal baking pan with nonstick spray. Whisk masa, baking powder, salt, and 1 tsp. cinnamon in a medium bowl.Step 2Pulse corn kernels in a blender or food processor until very coarsely puréed, just a few seconds should do it.Step 3Using an electric mixer on medium-high speed, beat butter and raw sugar until pale and slightly fluffy, about 3 minutes. Beat in corn purée and vanilla. Reduce speed to low and beat in dry ingredients; mix until batter is smooth, about 2 minutes. Scrape into prepared pan and cover tightly with foil. Set baking pan inside a large roasting pan; pour in boiling water to come halfway up sides of baking pan.Step 4Bake tamal until top springs back when lightly pressed and a tester inserted into the center comes out clean, 75–85 minutes. Let cool slightly in pan before serving.Step 5Mix crème fraîche and ⅔ cup queso fresco in a small bowl. Scoop tamal onto plates and top with crème fraîche mixture, more queso fresco, and a dusting of cinnamon.How would you rate Sweet Cinnamon Tamal?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis tamal is really tasty. I like that it isn't too sweet, and because of that it is great for snacking on. I had my eye on this recipe for a while because I had never made anything like it. What better time to try it out than during a pandemic when we are all stuck at home. I didn't have the ingredients for the creamy topping so used whipped cream - I think the salty cheese would have paired better.AnonymousVancouver, B.C.4/28/2020Rock ‘n roll. This is delicious! Quite filling. Nice and comforting. Would be great anytime of year, even for a grilling night. Made it with frozen corn. Perfect amount of sweetness. Also delicious without the creme fraiche. I made myself a piece too large to eat. You do not need much to feel fulfilled. Yum. AnonymousMinneapolis, MN3/25/2020This was great! Just don't expect an American dessert. It's not as sweet a typical American dessert. I didn't have creme fraiche so I used 2/3 cup sour cream and 1/3 cup vanilla yogurt. I thought it was sweet enough but the rest of the family sprinkled extra sugar in top too. Very moist. Tastes like you would expect a sweet corn tamale to taste. Anonymous5/6/2019I made it with frozen corn and it was incredible. MOIST. (Also so good for breakfast, not too sweet, great with coffee.) I loved the sour crème fraîche and salty queso fresco mixture, but if that's too cheffy, obviously vanilla ice cream would work too—but that element feels essential if you're making for dessert. Otherwise the tamal would start to get one note, which is corn-corn-corn. But seriously. Making this again and again and again.  alexbeggsBon Appétit 4/1/2019Explore Bon AppétitPuddingDessertCakeMexicanLatin AmericanMasaRice & GrainsCornVegetableQueso FrescoCheeseCinnamonHerbs & SpicesNut-FreeGluten-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}