{"id": "821952a854241d10813e97a58174393a", "url": "https://www.bonappetit.com/story/maggie-flores-joes-bakery", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "On the Clock at Joe’s Bakery with Austin’s Most Beloved Waitress | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsOn the Clock with Austin’s Most Beloved WaitressJoe’s Bakery opened 56 years ago. Maggie Flores has been waiting tables there for 48 of those years.By Mike SutterJune 6, 2018FacebookTwitterEmailPHOTO BY MATTHEW JOHNSONFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Maggie Flores starts her shift at Joe’s Bakery at 5:15 in the morning.She makes coffee two pounds at a time and pours the first cup for one of the cooks. Four creams and one Sweet ’N Low. The kitchen’s grilling bacon, lining up tortillas, getting ready for the doors to open. Nobody speaks. It’s a ritual silence, lost in routine.The first ticket chatters at 5:57. Game time.To tell the story of Joe’s Bakery in Austin is to tell the story of Maggie Flores. The bakery opened 56 years ago. She’s been waiting tables there for 48 of those years. Both are woven into the fabric of their East Austin neighborhood, bound together by hot coffee, breakfast tacos, and pan dulce.For now, being a neighborhood icon comes down to filling salsa cups. Flores transfers gallon jars of jalapeño verde into plastic thimbles with snap-on lids for carryout orders.For Regina Estrada, the granddaughter of founders Joe and Paula Avila, the salsa ritual framed her introduction to Flores. She was maybe seven or eight. Flores remembers, too. “I would just tell her, ‘Be very careful, baby girl, with your hands. And don’t touch your eyes.’”A serious breakfast spread.\nPHOTO BY MATTHEW JOHNSONCome 10 a.m., it’s crowded at the kitchen pass. There’s tension, a competition to grab plates first and fast. When you depend on tips to make a realistic wage, that’s the way of things. But there’s also dancing, little hip checks when disco hits the jukebox. “Last Dance,” then “We Are Family.”Flores weaves her way to the dining room, laden with two hot plates on one arm, a tortilla warmer and a taco plate on the other. All of her tables are full.  She can juggle three coffee cups at a time, on saucers, filling them one over the other with a deft sleight of hand at the industrial urn, never turning off the spigot.“I can tell by the way they hold the cup if they need more coffee,” she says. “They say, ‘Oh, Miss Maggie, you read my mind.’”Flores works the ordering terminal like a pro, but she’s more at ease writing orders on a pad. Her elegant print has a decided 20-degree tilt, like words spoken in italics for emphasis.Come on in.\nPHOTO BY MATTHEW JOHNSON“He didn’t have to ask me twice”East Austin is a place on a map, but it’s also a charged code phrase for “the other side of town,” a cultural and economic divide sharpened by the building of Interstate 35 through Austin half a century ago.The Avilas opened Joe’s Bakery on East Seventh Street the same year the interstate was dedicated, in 1962. Just in time, you might say, to give East Austin a place to call its own.“When the restaurant was really coming in, in the ’60s and ’70s and even the ’80s, that was during the time Austin was the most segregated, the most divided,” Estrada says. “It truly was a place that belonged to the neighborhood and to people of color.”The Flores era at Joe’s began in the mid-1960s—nobody’s sure of the exact year. That’s when the late Joe Avila hired her. She was 17 or 18 at the time, working for a cross-town rival called La Ronda.“She was a good waitress,” says Avila’s wife and cofounder, Paula. “Some of these waitresses now, they have to run all over the place. But she was always real calm.”Flores left Joe’s and went back to La Ronda for a few years. But Joe Avila couldn’t let the story end there, according to his daughter Rose Ann Maciel. He went to steal her back.Imitating Joe Avila in big stentorian tones, Flores recalled him saying, “Maggie, are you ready to come back with me?” Ready to trade her night shifts for the gentler morning routine at Joe’s, her decision wasn’t that tough, really.  “He didn’t have to ask me twice.”Even as the neighborhood around Joe’s has changed—it’s on the eastern edge of an expanding gentrification curve—the underlying creed has not.“Everybody’s been welcome at my bakery all the time,” Paula Avila says. “Anybody, any color.”Flores makes coffee two pounds at a time.\nPHOTO BY MATTHEW JOHNSON“They sit wherever. But they ask for me”It’s a breezy weekday morning in the 60s, but Joe’s Bakery is filled with the hot noise of people. By 10:30 the wait for tables is four parties deep.For Flores, it’s just another shift. And before it’s over, more than 75 people will rotate through her world, and she through theirs.“They sit wherever. But they ask for me,” she says.She can’t—or won’t—single out her most famous customer. But the parade of dignitaries has included farm labor activist Cesar Chavez and legendary University of Texas football coach Darrell Royal. Not to mention politicians, athletes, and musicians.“To me, they’re all favorites,” Flores says.Former Texas state senator Gonzalo Barrientos walks in, still a striking figure at 76. The lion of East Austin politics for ten years in the Texas House and 21 in the state Senate, he sums up Flores in three words: “Family, stability, smile.”“The more you get to know somebody, the more you feel like family,” Barrientos says. “That’s her.”Raymond Limón, 70, comes in with his daughter, Michelle Chavez. His daughter’s been coming to Joe’s since she was ten. She’s 43 now, working through a big bowl of caldo.“She knows what we want before we even sit down,” Chavez says of Flores.Tom Hatch has been a regular since 1972. The man who sometimes rides his bike here at age 73 is a world-class architect who designed the first wave of Whole Foods Markets.Flores and the staff treat him like royalty. Because, as it turns out, he crafted the 50th-birthday redesign of Joe’s Bakery a few years back that included counter seating up front.Next to Hatch is Orangerine Barrs, a convivial man of 80 in a sharp windbreaker. He’s a Flores fan. “She’s got a personality that’ll grab you,” he says. “No matter who you are, no matter your color. It’s all the same.”Benny Perez has been a customer since 1971, the year he danced with Flores at a club called the Latin Quarter. “I’m the one who flirts with her,” says the 66-year-old City of Austin mechanic. No matter how busy the restaurant gets, he’ll wait for a table in her section.This isn’t a part-time hobby for a bored retiree. This is Flores on her feet five days a week from dawn through lunch rush. At 69 she’s as much a working waiter as any 20-something with farm-to-table tattoos. It’s been a busy shift, but she won’t talk about the day’s take. “I do okay,” she says.It took knee surgery after a fall in 2011 to slow her down, but even that was only a few months. Day to day, her restorative secret is a power nap after her shift ends around 2 or 3.Well, that. And a cold Miller Lite. In a can, if you please.Flores chatting with customers.\nPHOTO BY MATTHEW JOHNSON“15 percent of forever”Flores was married, but that was years ago, and her two grown sons live in Austin. She has five grandchildren, including an eight-year-old granddaughter who staged a practice interview for this story.She asked: “Maggie, how long have you worked at Joe’s? And how old are you now?” Kid has a future. Those are the first two questions any reporter would ask.Flores will turn 70 on October 1, with no plans to hang up her apron.“I’m going to stay there until Regina or Rose Ann tells me, ‘Okay, Maggie, that’s it. You can do it no more,’” she says.A 2007 newspaper article about Flores and other career Austin waiters hangs above one of her tables. She does a happy dance when new customers see it. “15 percent of forever,” the headline says.That’s about how long Maggie Flores has been part of Joe’s Bakery.Mike Sutter is the restaurant critic for the San Antonio Express-News and editor of the website FedManWalking.com. Maggie Flores served him his first-ever bowl of menudo ten years ago.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsAustinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Mike Sutter"]}