{"id": "82205634152c62458c569ec8787c03fb", "url": "https://www.bonappetit.com/recipe/ba1-steak-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "BA.1. Steak Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueBA.1. Steak SauceBy Chris MoroccoJune 2, 20204.8(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSweet, salty, tart, spicy, and goosed with secret sources of umami, steak sauce may be the ideal foil for a sizzling slab of red meat. We took the lead of chef Chris Shepherd, who serves a homemade version at Georgia James, his Houston steakhouse, and whipped up a signature steak sauce of our own. It’s big on flavor, free of weird preservatives, and comes together in about a minute flat. Welcome to the world, BA.1. Ingredients4 servings  Sauce2Tbsp. balsamic vinegar2Tbsp. Worcestershire sauce2Tbsp. ketchup1Tbsp. extra-virgin olive oil1Tbsp. vinegar-based hot sauce (such as Frank’s or Crystal)1tsp. Dijon mustard1tsp. honeyKosher saltPreparationSauceStep 1Whisk vinegar, Worcestershire sauce, ketchup, oil, hot sauce, mustard, honey, and 1 Tbsp. water in a medium bowl to combine; season with salt.Step 2Do ahead: Sauce can be made 2 months ahead. Store airtight at room temperature.How would you rate BA.1. Steak Sauce?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSimple and incredibly delicious! SymoneMemphis TN12/11/2021Absolutely delicious!   This is our go-to !   Also  excellent in a mayo/horseradish slaw dressing!!!!!  ⭐️⭐️AnonymousPalm Springs, CA7/17/20212 fast, 2 easy to be so delicious.  I like!!!AnonymousSouth Milwaukee, WI 7/13/2021So simple, we love it!ButtonMakerBoston, MA6/25/2021I've made this a few times... it's now a staple in our house.MegRhode Island3/14/2021Very sweet and more ketchup flavored that I'd expected.  Anonymous8/22/2020Explore Bon AppétitSauceCondimentAmericanQuickEasyGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}