{"id": "822b7431935fd8bf31ac36b568c889fa", "url": "https://www.bonappetit.com/story/apartment-smells-chicken-soup", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "My Apartment Always Smells Like Chicken Soup from El Gran Castillo de Jagua | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Apartment Always Smells Like Chicken Soup from the Restaurant Across the Street...and I never want that to go away.By Tyler KordJune 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Most people look at the schools or the crime rates when moving to a new neighborhood, but I have a much more specific noodle-y focus: chicken soup. My father’s mother, Clara, died before I was born, but apparently she made a mean chicken soup. My Midwestern mother Betty’s version of that Jewish Hungarian chicken soup had a lot less schmaltz and chicken feet, but holy s**t was it delicious. We ate it whenever anyone in the family felt even remotely ill or just for the heck of it because we all loved it so much. And then we ate it every night for the rest of the week because my mom made so much of it at a time. When I want to feel taken care of, I eat chicken soup.This woman knows she's in the right place.\nPhoto by Alex LauWhen I lived in the predominantly Polish neighborhood of Greenpoint in Brooklyn, I could find a bowl of chicken soup that tasted an awful lot like my mother’s, and I ate it every Saturday. But when I moved to the border of Clinton Hill and Fort Greene (still Brooklyn) almost 17 years ago, I never quite found my soup. There was wonton soup from the Chinese place on the corner, tomato rice soup and avgolemono from the diner (there was also chicken soup at the diner, but I haven’t had real chicken soup made with real chicken stock at a diner maybe ever)—all of which were delicious, but not what I was looking for.Ten years later, I moved again, to Prospect Heights to move in with my then-girlfriend, now-wife/eternal queen of my life/mother to my Baby of the Year 2017. This time, I didn’t have to look far for my soup. The first time I spent the night at her place, we turned out the lights and I immediately asked, “What is that amazing smell?”“Oh, sorry, that’s the restaurant across the street, it makes the whole apartment smell like chicken.”The steam table.\nPhoto by Alex LauI love Katherine for so many reasons, but I would be lying if I left “apartment smells like chicken soup at all times” off of the list. The soup from the restaurant across the street tastes like maybe the broth starts out with a little chicken base or bouillon, but after several hours of letting bone-in chicken pieces, carrots, potatoes, and yuca hang out with it in the steam table, that broth is rich, bright yellow, and exactly what I need. Some noodles—which have also been in the steam table that whole time—are present but don’t have much texture left, and I love them for who they are all the same. Then there’s some toasted and buttered bread on the side for dipping. I could eat that soup once a day for the rest of my life.The chicken, sans soup. Still good.\nPhoto by Alex LauAnd look at this! I’ve ranted about soup for so long that I haven’t even talked about the mofongo or the fried calamari or the oxtails or the cassava with pickled onions or the soupy rice or the other six ways that they will cook a chicken for you. (The soupy rice really is something special, and all of the chicken is wonderful, though the white meat tends to get pretty dry in the steam table by the end of the day, which most of their customers and I are into but I feel like it should probably be pointed out for the Bon Appétit crowd.)Definitely my favorite restaurant.\nPhoto by Alex LauAnd I haven’t said a single word about the beans and rice! There are three kinds of beans and three kinds of rice and every combination is absolutely delightful, and sometimes I just go there and eat beans and rice with a couple of fried eggs or a side of avocado! And if you ask for a side of avocado, they will cut the most perfectly ripe avocado in half and give it to you! And they make a salsa verde that, if I ask for it in Spanish, they look confused and eventually ask if I want the green sauce, and if I ask in English, they look even more confused, but it is so incredibly delicious that I don’t mind at all. Oh, and it’s called El Gran Castillo de Jagua and it is my favorite restaurant.Tyler Kord is a chef and the author of A Super Upsetting Cookbook About Sandwiches.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Tyler Kord"]}