{"id": "823b600abe0112c9101635583780a300", "url": "https://www.bonappetit.com/story/wine-beer-cider-bluring-lines", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "It’s Getting Harder to Tell the Difference Between Wine, Beer, and Cider—And We’re Into It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Getting Harder to Tell the Difference Between Wine, Beer, and CiderAnd we’re totally into it. Welcome to the weird and wonderful culture shift that’s changing the way we drink.By Alex DelanyMay 2, 2019FacebookTwitterEmailPHOTO BY ALEX LAU, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIFacebookTwitterEmailI used to be a beer guy. Don’t get me wrong, I’m still a beer guy, but I used to be just a beer guy. I made it a mission to familiarize myself with style guidelines and tap lists. I cemented my identity as a beer guy. But then I tried cider. And everything changed.On a trip to Vermont a few years ago, I was introduced to Fable Farm,1 and I pulled a U-turn on the whole “cider is just sweet boozy apple juice” thing. The stuff I drank from the 750-ml bottle was bone-dry. It was made from wild apples, unfiltered, labeled “apple wine,” and tasted the way I wished wine did—equal parts fruit, acid, and funk. I like cider now, I thought, as the course of my drinking life was silently altered.If something like this weird cider existed, I reasoned, there ought to be wine that followed suit. And after learning of the style from BA’s wine columnist Marissa Ross, I ended up purchasing a bottle of pét-nat from Oyster River Winegrowers. The bottle was sealed with a crown cap instead of a cork. The pink label looked hand-drawn. And the wine itself tasted like the softly carbonated unfiltered ciders I’d been exploring. I was a late adopter, but hey, I eventually made it to the world of natural wine. And it was then that I started to notice that as the wine, beer, and cider that I drank got more rebellious, they also became more and more similar to one another.Pét-Nat: A naturally sparkling wine that is bottled before fermentation finishes. The last bit of yeast activity carbonates the wine in the bottle, creating softer bubbles than those in Champagne. Can be cloudy, bready, and casual in the most drinkable way. Oyster River Winegrowers Morphos Rosé Pét-Nat, $20\nPhoto by Alex LauUnfiltered: Where most industrialized drinks pride themselves on clarity, unfiltered beverages, like this beer-wine hybrid, typically contain sediment—fruit, hop, or yeast particles that give the liquid a hazy appearance and a ton of flavor. Tired Hands Brewing Co. Frequency Illusion: Skin Contact, $20\nPhoto by Alex Lau“Give me something fun to drink.” That’s what I say when I walk into a bottle shop with an obscure selection or a bar I’ve seen importers posting about on the internet. I want something that will excite me, that will pull me further from what I used to know as wine, beer, and cider. And in return, I get wines that taste like sucking on grape and cherry Jolly Ranchers at the same time. I get still, fruitless beers that drink like I’m eating honeydew while lounging on a bed of hay. I get bright, floral ciders with flavors of lemon rind, ginger, and apricot. A co-ferment of beer and blueberry juice that tastes like a savory Lambrusco? That’s what gets me out of bed in the morning. (Just kidding. It’s my job.)The wines, beers, and ciders I used to drink were all about controlled fermentation. A specific yeast was added to produce a predictable product. The common thread that runs through what I drink now is that they’re fermented with wild or natural yeast, organisms that deliver livelier, more complex flavors than industrial yeast. It’s what makes these drinks so anarchic. At their purest form, they’re fermented spontaneously without any added yeast at all. The entire process is left up to the yeast and bacteria on the fruit or in the air. It makes these drinks taste like they’re alive.Still: Beer isn’t always effervescent. And neither is cider. Some producers skip a secondary fermentation in the bottle, which carbonates the liquid. The lack of bubbles makes beer or cider drink more like a wine. Jester King Brewery Spon Still, $25\nPhoto by Alex LauCo-ferment: A blend of two liquids—e.g., apple and grape juice—fermented in the same vessel, like this hybrid of malt base and blueberry juice. Tastes like more than the sum of its parts. Tired Hands Brewing Co. Frequency Illusion: Bluecrop, $20.\nPhoto by Alex Lau“As we embrace more natural and spontaneous ferments and an ever-increasing hybridization of wine, beer, and cider, we’ll see the lines of each beverage become increasingly blurred until there’s nothing left but a tapestry of existence swaying in the life-giving breeze,” waxes Tired Hands Brewing Co. founder Jean Broillet, whose beer-wine hybrids are almost as poetic as his view on the industry.American producers are defying the categories in which their products have lived for decades. Brewers are obsessed with grapes, adding them to beers to make fruity, high-acid ales. Winemakers don’t care about clarity, leaving wines unfiltered. Cider producers are using wild apple varieties without names. None of them are fulfilling old stereotypes, of the Teva-clad craft brewer or the Robert Parker–obsessed winemaker. And they’re all working in small batches, offering the chance to take more risks. People are doing whatever they want, and it’s translating into drinks more thought-provoking and progressive than anything we’ve had before. If I say, “Give me something fun to drink,” I’ll get it.But most of the time I don’t even need to say anything. I can just look at the bottles. If they’re adorned with an especially rad label...if they’re sealed with a crown cap...if they look murky or possess an unexpected hue...if they’re fermented with wild yeast...if they’re bottled by a small producer...if they’re made from apples or grapes or malt, I’m in. Because I’m not a beer guy anymore. I love it all.For the naturally and spontaneously fermented bottles we’re stocking—and re-stocking—read on below1 / 17ChevronChevronPhoto by Alex LauFable Farm Fermentory LeoWine-cider blend; $22\nA blend of Vermont apple and grape wines, this could be confused for the most perfectly balanced sparkling orange wine you’ve ever had. It’s got great fruit, funk, tannin, acid, and a nice mineral backbone. fablefarm.orgExplore Bon Appétitnatural wineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-02", "author": ["Condé Nast", "Alex Delany"]}