{"id": "82415419b55d580cb2a5f4ac77d2b4c7", "url": "https://www.bonappetit.com/story/how-to-make-whipped-cream-with-a-mason-jar", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "How to Make Whipped Cream Without a Mixer or Whisk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Whipped Cream with a Mason Jar and Be Everyone's HeroBecause sometimes there are Whipped Cream Emergencies, and you need to be prepared.By Amiel StanekJune 13, 2018FacebookTwitterEmailPhoto by Alex Lau, styling by Sean DooleyFacebookTwitterEmailOkay, okay: I acknowledge that the mere idea that there is such a thing as a “whipped cream emergency” is more than a little absurd—a First World Problem par excellence, about as silly as an “unripe avocado crisis.” Nevertheless, there are times when you find yourself staring down a beautiful bowl of cut summer fruit, or a crackly-edged berry galette, or even a simple yogurt cake, and think to yourself, “Damn, wouldn’t this just be so much better with a fat dollop of homemade whipped cream on top?” Under normal circumstances, in your own kitchen perhaps, this presents no problem: You’d empty a pint of heavy cream into the bowl of your stand mixer, or break out your trusty hand mixer, or do some arm stretches and get ready to whisk some up by hand. But what if—heavens forbid—you find yourself in the crappy kitchen of a vacation rental, or at the home of your friend who doesn’t cook, and there is no mixer or even whisk to be found? Starting to feel like a “whipped cream emergency,” isn’t it? What then??Well, you make Emergency Whipped Cream, that’s what.First things first: You’re going to need very cold heavy cream. As in, not the pint you brought home from the store and left in the shopping bag by the door and totally forgot until now to put in the fridge. As in, not the half and half in the fridge door you’re wondering if you can use instead of proper heavy cream. Very. Cold. Heavy. Cream. If you pull it out of the back of the fridge and it still feels kinda luke, put it in the freezer for 5 minutes or so until it’s nice and frosty.Next, you’re going to need a suitable vessel. You want a tall container with at least a 4-cup capacity and a tight-fitting lid—a plastic quart container, quart-sized Mason jar, or large cocktail shaker will all work. Whatever you’ve got, go ahead and pop it into the freezer for 5 minutes, too—you want both the vessel and the cream to be chilly AF.That guy on the left will do nicely.\nChelsie CraigCream and container good and cold? Great. Time to make Emergency Whipped Cream. Pour about 1 cup of heavy cream into your at-least-4-cup receptacle of choice. Don't be tempted to put more in; you need to leave plenty of headspace. Secure the lid. Now comes the fun part: Shake the hell out of it. (Note: If you went the plastic quart container route, you’re going to need to hold the lid down with your thumbs as you do this.) Shake! Shake! Shake! Harder is not necessarily better—you want to shake confidently, at a pace you can keep consistently without having to stop. Listen closely to the sound the cream makes as it gets pummeled back and forth; over the course of a couple of minutes, it’ll progress from a glug-glug-glug to a deeper whump-whump-whump, and that’s your cue to stop. Open the container and take a peek. Does it look loose, like not-whipped cream? Close the lid and keep shaking! Does it look like soft, beautifully aerated whipped cream? Well then you just made Emergency Whipped Cream my friend.How cool was that?? If you’re so inclined, use a spoon to gently fold in a teaspoon or so of powdered sugar or maple syrup and a small pinch of salt, or gussy it up otherwise with whatever spices or flavorings you’re interested in. (Personally, I like the contrast that unadulterated, au naturel whipped cream lends to something sweet, but you do you.) Bring your container of creamy, fluffy good-good to the table, spoon a generous cloud over everyone’s dessert, and watch the crowd go wild. Crisis: averted.Now that you know how to make whipped cream, put some on top of this chocolate-Nutella sitch:Chocolate Nutella PuddingThe only acceptable reason to use the drool-face emoji.View RecipeExplore Bon AppétitBasicallyWhipped CreamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-13", "author": ["Condé Nast", "Amiel Stanek"]}