{"id": "8241a4cd3ab88574f8e02ef8c8003467", "url": "https://www.bonappetit.com/story/sesame-la", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Take a Tour of Sesame LA, the Homey Superette in L.A.’s Chinatown | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTake a Tour of Sesame LA, the Homey Superette in L.A.’s ChinatownThe neighborhood market sells produce, Asian pantry items, and dishes prepared by owner Linda Sivrican's extended community.By Esther TsengAugust 27, 2021FacebookTwitterEmailFacebookTwitterEmailWelcome to Shop Tour, where we introduce you to some of our favorite new independent retailers and share the stories behind the beautiful products they stock.When perfumer Linda Sivrican found the sunny little storefront on N. Hill Street in L.A.’s Chinatown, she imagined it as a temporary site from which to launch a fragrance collaboration with a local chef. But then she expanded her vision. “I thought, Let me do something fun that the community could really embrace,” Sivrican says. “That’s why I turned it into a market.”Photo by Alex LauNow Sesame LA is a neighborhood superette that doesn’t simply feed the community; it engages it as well. The rotating roster of dishes, such as pickled eggplant and vegan duck noodle soup, is prepared by Asian elders in a kitchen run by Sivrican’s mother, Judy Mai Nguyen. Some dishes are made by Buddhist monks and the proceeds are donated to their temples. A curated selection of Vietnamese candies and snacks line one wall while Asian condiments, both familiar and artisan, line another. Produce is sourced from local regenerative farms.“I wasn’t expecting our story and my mom’s food to resonate with so many people,” Sivrican says. But it has. “It’s given us an opportunity to celebrate our culture.”Artisanal condiments such as sakura blossom shoyu and whiskey-laced garlic black bean sauce are interspersed with longtime favorite kitchen staples such as Mazola oil and Sriracha.\nPhoto by Alex LauHa Truong, 78, is the kitchen’s most senior member and Nguyen’s first recruit. She presents Sesame LA’s sweet and savory vegetarian stew, a collaborative effort between the two cooks, made with lotus root, braised seitan, and quail eggs and garnished with cucumber slices.\nPhoto by Alex LauMade with agar and seaweed, these vegan jellies are slightly chewy and seasoned with coconut, pandan, coffee, and a variety of other flavors.\nPhoto by Alex LauUt Pham, 65, does kitchen prep and makes vegan jellies, or thạch. She says she enjoys her time in the kitchen: “It’s relaxing! I’m learning many things; we all work together and get along well.”\nPhoto by Alex LauMagnolia Blossom purple snow peas, Sunny Side Up chrysanthemums, Phoenix nasturtium, and Beauregard snap peas are all sourced from Girl & Dug Farm in San Marcos, CA.\nPhoto by Alex LauJudy Mai Nguyen, 72, is Sivrican’s mother and leads the off-site kitchen where an ever-changing variety of dishes is created by a group of her friends.\nPhoto by Alex LauThe large vegan and vegetarian selection in Sesame LA’s display case is an extension of Buddhist philosophy, which strives to cultivate compassion for other living beings.\nPhoto by Alex LauJennifer Pham, 60, is a close family friend to the Nguyens and helps prepare dishes such as pickled vegetables, vegan fish paste, and beef bourguignon.\nPhoto by Alex LauA veteran of Vietnamese restaurants, Nguyen draws upon her experience at the legendary Brodard in Orange County, CA, to create these beautiful summer rolls.\nPhoto by Alex LauMaster Thien Tue, 50, of Pho Linh Buddhist temple in Garden Grove, CA, cooks various vegan dishes for Sesame LA, such as fried spring rolls with taro, carrots, and wood ear mushrooms. A portion of the proceeds from her dishes is donated to Pho Linh temple.\nPhoto by Alex LauA vegan soup made with fresh asparagus, organic bunapi mushrooms, and algae vermicelli, or tóc tiên.\nPhoto by Alex LauSivrican’s stepfather, David Nguyen, 74, delivers prepared foods like his fried sesame balls from the kitchen to the store three times a week.\nPhoto by Alex LauJudy Mai Nguyen’s vegan pickled mustard greens “offer the perfect combination of acid and sweet,” Sivrican says. She will often suggest substituting local, smaller batch ingredients for the ones her mom has been accustomed to using; both are often pleased with the results. “So you have an older generation of women using new ingredients and discovering new things. It’s joyous for me to see that for them too,” Sivrican says.\nPhoto by Alex LauIt was Sivrican’s cousin’s idea to hang family photos in the store. “I wasn’t sure about it at first, but once I started looking through our family albums, I realized I wanted to share them with everyone,” Sivrican says. Photos include Judy Mai Nguyen and her mother in Vietnam, Sivrican herself, and her cousins in áo dài, traditional Vietnamese dress. The black-and-white photos are of Sivrican’s grandparents and their friends in Vietnam.\nPhoto by Alex LauEdible nasturtium and calendula blooms, plus chrysanthemums are folded into these beautiful summer rolls, or gòi cuốn. Sivrican and her mother, Judy Mai Nguyen, experiment with rolling different ingredients—chosen for their unique flavor combos and stunning presentation—into transparent rice paper.\nPhoto by Alex LauExplore Bon AppétitShop TourCultureLos AngelesTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-27", "author": ["Condé Nast", "Esther Tseng"]}