{"id": "8242a99f8b0d11b8b5eb2c13033cc0fc", "url": "https://www.bonappetit.com/story/cuisinart-food-processor-origin-story", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "The Origin Story of the Cuisinart Food Processor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow a Single Appliance Made Americans Better Cooks“The greatest food invention since toothpicks” has lived up to its promise.By John BirdsallMarch 23, 2021FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.At the end of the 1960s, the kitchen counters of bougie gourmands in America displayed two appliances: the blender and the stand mixer. Together, they could take on just about any recipe the nation’s prevailing cooking gurus—Francophiles like James Beard, Julia Child, and Craig Claiborne—would ask of the home cook: crepe batter, gazpacho, brioche, hollandaise. But in 1971, a retired MIT-trained physicist and amateur gourmet named Carl Sontheimer, a man with the curious look of a hulking, mischievous elf, was to radically transform the American kitchen for decades to come.At 57, after a career filled with patented inventions and the launch of three electronics companies, Sontheimer and his wife, Shirley, traveled to France to ponder what was next. At a housewares show in Paris, Sontheimer paused before a demonstration of the Magimix, a home version of the Robot-Coupe, the clunky industrial blender-slicer-grater-kneader-chopper introduced by French inventor Pierre Verdun in 1963. Sontheimer signed a deal to distribute a version of the Magimix in the United States, modified for Americans.Peppering Robot-Coupe’s engineers in France with endless queries, Sontheimer tinkered for a year and a half, adding a heavier top, honing the design of the blades and slicing discs, and lengthening the feeder tube to reduce the risk of shredded fingers. (“That machine gave me the horrors,” Sontheimer once recalled of Verdun’s French original. “It was totally unsafe.”) In January 1973, at the National Housewares Show in Chicago, Sontheimer unveiled his baby, with a name he borrowed from a line of fancy French pots and pans he’d already been hawking around the country through newspaper classifieds: the Cuisinart. With its double aura of aspiration and panache, it was the perfect name. (And apparently not a copyright issue; by 1976, Sontheimer had gotten a trademark for the name from the U.S. Patent Office.)With a retail price of $175, the Cuisinart was shockingly expensive. By contrast, a top of the line 14-speed blender cost $35 in 1973; a decent stand mixer was $40. Yet perhaps this was part of the appeal; Sontheimer hoped to land one of his machines in the kitchen of every American cook with means, the kind of well-heeled fan who subscribed to Gourmet and wouldn’t miss a Wednesday night episode of The French Chef for the weekly gorging on Julia. “He knew he had a gem,” says Carl Jerome, Beard’s assistant in the 1970s, “and if he played his cards right, he could make this the next blender.”Sontheimer’s opening gambit was to win over Beard, Child, and Claiborne, who together had immense powers of persuasion over America’s home cooks. So he gave them free machines, of course, but was also genuinely kind and naturally charming. Plus, having grown up in France (Sontheimer’s father was an American executive stationed in Paris), he spoke their culinary and cultural language—and even sent Claiborne recipes from rare, old French cookbooks in his collection, a gift from one gentleman gourmet to another. He also had an instinctive grasp of the power of exclusivity in luxury branding. By limiting the number of retailers to basically two—Williams-Sonoma in San Francisco and Bloomingdale’s in New York—Sontheimer made the Cuisinart an aspirational appliance for many Americans. (So much so that in the early 1980s, the U.S. Justice Department charged Sontheimer’s company with price-fixing after it refused to supply machines to retailers offering Cuisinarts below the suggested price. The company pleaded no contest and paid a settlement.)In a 1973 column syndicated in newspapers around the country, Beard called the Cuisinart as “necessary as a good stove.” Jerome says getting one of the first machines was a big deal to him. “He liked being the one who introduced it to the food world—it pumped up his ego and his public image.” Meanwhile, Julia hauled her newly indispensable bone-white-and-oyster-gray model to cooking demonstrations around the country. In 1976, her longtime friend and assistant, Rosemary Manell, became the first instructor to offer a whole cooking class devoted to the machine, a sign that some had acquired a Cuisinart as an object of kitchen-counter status, without knowing what the hell to do with it. (“A lot of people who own the machine seem a bit wary of it,” Manell told the New York Times.)Beard and Jerome put together a spiral-bound recipe booklet, with guest contributors including Marcella Hazan, Madhur Jaffrey, Simone Beck, and Jacques Pépin, that came free with every Cuisinart. “It has been heralded from Boot Head, Maine, to Eureka, California,” wrote Claiborne—with only slight satirical exaggeration—“as perhaps the greatest food invention since toothpicks.” Sontheimer’s charm offensive had worked.Ironically, the Cuisinart would help make the old guard of culinary experts—the same ones who argued for the food processor as a kitchen essential—passé. In the late 1970s and early 1980s, American culinary magazines, newspaper food sections, and the Great Chefs TV cooking series anointed restaurant chefs as the new stars of the kitchen, younger and more dynamic than Beard, Child, and Claiborne. Meanwhile, many home cooks who’d become comfortable with the Cuisinarts on their counters were ready for new challenges. And while these home cooks were unlikely to have a restaurant’s battery of carbon-steel knives, heavy-duty mandoline slicers, and copper saucepans, they probably had a food processor—some version of Pierre Verdun’s original invention—in common. A Cuisinart gave kitchen amateurs both the machine power and the confidence to take on sexy nouvelle cuisine dishes, from Paul Bocuse’s fish sheathed in potato scales to Michel Guérard’s pear soufflé, with a vast, sludgy river of emulsified vinaigrettes and baba ganoush in between. The success of Cuisinart helped propel a trend that had begun in the 1960s, of affluent Americans cooking for entertainment and self-expression. By eliminating the drudgery of handwork, the machine made cooking for pleasure an option for anyone who could afford one, “a hobby,” Claiborne wrote, “to be ranked with other indoor sports.”By the early 2000s, a new kind of self-expression in the kitchen—one emphasizing simplicity and tradition—challenged the status of the food processor as essential. “Pounding,” wrote Alice Waters in 2010 about making pesto in a mortar and pestle, “is more fun than flipping a switch.” By then, cookbook authors like Judy Rodgers, Grace Young, and Paul Bertolli had been urging home cooks to unplug and invest in good knives, a well-made wok, and an old-fashioned crank-handle food mill—tools newly burnished with the kind of status Carl Sontheimer’s miracle machine once had.Should you still buy a food processor? Here’s why we think so…Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "John Birdsall"]}