{"id": "8251edc4652659b5f97e9e124586acf3", "url": "https://www.bonappetit.com/story/trader-joes-pork-gyoza", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "I Lived Off Trader Joe’s Pork Gyoza When I Was 22 and on a Tiny Budget | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Lived Off Trader Joe’s Pork Gyoza When I Was 22 and on a Tiny BudgetI still love these dependably salty and juicy dumplings a decade later. By Christina ChaeyJanuary 28, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Eight years ago, when I had just moved to New York for my first job and had a minuscule budget for groceries, I would walk three miles every Sunday to the Trader Joe’s in Cobble Hill, Brooklyn, in search of sustenance and a way to save on subway fare.It was here in the cramped-yet-still-manageable freezer aisle (Cauliflower Gnocchi had not yet been invented in 2012) that I found solace in Mr. Joe’s Pork Gyoza Potstickers. For $2.99, I got a bag of 20 dumplings that were always dependably salty and juicy, stuffed with pork and cabbage and seasoned with green onion, garlic, and ginger. They got me through countless meals during my twenties, and over the years, I perfected my pan-frying method, fanning out the dumplings in a nonstick skillet with a couple tablespoons of water and a small slick of oil, then covering them with a lid so they would steam-fry over medium-high heat until the bottoms were browned and crisp. Dipped in a mix of soy sauce and sweet rice vinegar, they were my cure-all for colds, hangovers, break-ups, days playing hooky from the job I hated so much.A bag full of porky, juicy goodness\nPhoto by Emma FishmanI stopped making my six-mile round trip to Trader Joe’s years ago, and these days I’m more likely to make my own dumplings. But the other week I passed by the TJ’s in Union Square and decided to pop in on a whim. While everyone else was elbowing each other over the last bags of—what else?—Cauliflower Gnocchi, I made out with a couple of bags of frozen gyoza. I took them home, fried them until crisp, dipped them in soy sauce and vinegar—and they were every bit as delicious as I remembered.Get them: Trader Joe’s stores nationwideExplore Bon AppétitHighly RecommendTrader Joe'sShoppingRead MorecultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-28", "author": ["Condé Nast", "Christina Chaey"]}