{"id": "825d6a6248239778ddff75864c0df668", "url": "https://www.bonappetit.com/story/yogurt-marinating", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Yogurt Marinating Is the Best Marinating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYogurt Marinating Is the Best MarinatingWhy would you rub yogurt all over a piece of meat? Because it's delicious, that's why.By Alex DelanyJanuary 29, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailMarinating meat in yogurt will change your life. Well, maybe not change your life but...at least how you think about marinating. Don’t believe me? Read on, dear reader.Yogurt tenderizes meat much more gently and effectively than regular marinades. While acidic vinegar- or citrus-based marinades can toughen proteins like chicken breast to a rubbery consistency, yogurt slowly tenderizes them, resulting in meat that can practically be pulled apart by hand. Yogurt marinades are highly effective when left on proteins for an elongated period of time (in the 12 hour ball park), but they work well in short-term scenarios too.That’s because yogurt marinades also create a uniquely-textured and flavorful crust around proteins, regardless of marinating time. Like all marinades, yogurt will be the first thing to cook when your meat is exposed to heat. The sugar in traditional marinades is the first thing to caramelize, but in yogurt, it’s dairy that caramelizes initially. Instead of a crispy, golden brown texture, you’ll get something else entirely. Sure, you’ll still have crispiness, but there will be an underlying softness (almost like a layer of insulation) from the caramelized dairy proteins and sugars. It makes a piece of tender, juicy meat that much more special.Our favorite cooking method for yogurt-marinated proteins is grilling—there's something incredibly alluring about the combo of caramelized yogurt and smoke—but a high-heat oven roast or pan sear will also get the job done. It’s really up to you (and, you know, the weather).And if you’re wondering what yogurt to use, we can help. Plain, unstrained yogurt is best (You definitely do not want any vanilla in there.). You can use Greek yogurt, but since it contains less moisture, you’ll need to loosen it with a little lemon juice or vinegar to properly coat your protein.You can marinate a whole chicken in yogurt. \nChristopher TestaniNow, you just need to decide what flavor profile you’re going for. Mixing in some ginger and lemongrass works beautifully. Taking a more Middle Eastern route, with cumin, ground chiles, garlic, and fresh herbs, is always a solid move. At the end of the day, the same flavor profiles you’d use with regular beef, lamb, chicken and pork marinades work with yogurt. And if your friends need convincing, don’t bother trying to use words. Just hand them a piece of grilled, yogurt-marinated chicken and tell them to take a bite. Trust.Yogurt. Marinated. Lamb. Chops. Right. Now.Spiced Marinated Lamb Chops with Garlicky YogurtThese quick-cooking lamb chops make dinner feel instantly fancy.View RecipeExplore Bon AppétitChickenYogurtMarinadeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-29", "author": ["Condé Nast", "Alex Delany"]}