{"id": "825d1b31a565c41402e09575c6399849", "url": "https://www.bonappetit.com/story/keep-calm-cooking", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "A Recipe for When You Want to Stop Worrying | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingA Recipe for When You Want to Stop WorryingKeep calm and keep cooking.By Adam RapoportMarch 11, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling by Yekaterina BoystovaFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If it gets to a point where we’re all holed up in our homes for a few weeks, we’re going to need something to do. And, I imagine, if you’re the type who subscribes to this newsletter, that might mean cooking.In days like these, the best kind of cookery is project cookery—the more time a dish requires the better. Whatever it takes to not fixate on the steady crawl of coronavirus updates.To be honest, I’m already at that point. So this past Saturday afternoon, I set out to make Amiel Stanek’s French Onion Beef Noodle Soup. It’s a riff on Taiwanese beef noodle soup, infused with the irresistible sweetness of five pounds (!) of caramelized onions.Start to finish, it took me about four hours. Nothing terribly complex or deft. But it means patiently searing off three pounds of bone-in short ribs, gradually sweating down a mountain of sliced white onions till jammy and tawny, and sizzling a medley of ginger, garlic, scallions, star anise, coriander, and cloves in the fat rendered from the ribs.Want this letter before it hits the website? Sign up for our newsletter!Because there are so many assertive flavors contributing to the assembly of the dish, it doesn’t require that cherished, rich homemade chicken stock you’ve got stowed away in your freezer. Twelve cups of water will do.It’s a sweet, fragrant soup, fortified by the shredded beef ribs, and then given further substance by the last-minute addition of store-bought fresh ramen noodles (which, I’ll just say, are pretty much the best thing to hit supermarkets this past decade).None of us know how the next few months will play out, but we’ve all been here before, to some extent. As Carla Music pointed out last week in her newsletter, we have weathered blizzards and hurricanes and power outages by turning to our stoves to feed ourselves and those in need. And we’ll do it again, if need be. We’ll keep calm and we’ll keep cooking.Get the recipe:French Onion Beef Noodle SoupThis super-savory dish draws inspiration from Taiwanese beef noodle soup, then gilds the lily with a Dutch oven’s worth of sweet, slow-simmered onions.View RecipeExplore Bon AppétitAdam NewsletterCoronavirusRead MorecookingFrench Onion…Beef Noodle Soup?By Amiel StanekcookingThe Creamy-Sour Soup I Need On All Sick Days (And Winter, In General)By Priya KrishnacultureSoups, RankedBy Alex BeggscultureMake Black Bean Soup and Then (Easily!) Clean Your Dutch Oven This WeekendBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-11", "author": ["Condé Nast", "Adam Rapoport"]}