{"id": "825e6377c0a647e605fa1fb81dd0d990", "url": "https://www.bonappetit.com/story/lessons-che-fico", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "3 Lessons I Learned Cooking at Che Fico, One of America's Best New Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopbest-new-restaurants3 Lessons I Learned Cooking at Che Fico, One of America's Best New RestaurantsOlive Garden is an inspiration, vegetable juices are your friends, and more.By Chris MoroccoAugust 31, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailMy dad had a wildly embarrassing habit for a while, that luckily only came out when he was traveling abroad. When trying to decide what restaurant to eat in, he would boldly stride in to the kitchen of every possible contender and have a look around. So perhaps it is genetic that I have always been transfixed by observing kitchens in their prep and service modes. My dad, while completely inappropriate, was actually onto something. Perusing a menu can only tell you so much, whereas seeing what goes on behind the scenes can speak volumes.A crostata good enough to convert a dessert skeptic.\nPhoto by Alex LauWhen I walked into Che Fico, one of our Hot 10 best new restaurants of 2018, to report the recipes for the package, I was stunned by how many things were happening under one—albeit large—roof. Homemade pastas, pizza good enough to warrant its own restaurant, a walk-in charcuterie aging room, and desserts that would prove good enough to win over sweet skeptics such as myself. My first stop that day was the pastry station, where pastry chef Angela Pinkerton’s day was well underway. First, she blew my mind by making flaky pastry dough for Grapefruit-Orange Crostatas unlike anyone else.Pastry pro Angela Pinkerton (in back) gets in on the tasting with chef David Nayfeld (in blue shirt).\nPhoto by Alex LauIt wasn’t until returning to the restaurant that evening for dinner to taste the desserts I had watched Pinkerton prepare, that I realized why I liked her style so much. Salt. Every dessert had a savory element to it, from the gloriously salty Chocolate Budino (that also features bright green Olio Verde olive oil and salty-sweet candied walnuts on top) to the flaky, salt-strewn citrus crostata that blurred the lines between sweet and savory. It was more than just salt, though. There was a crispy fried tuile alongside mint gelato and cacao nibs decorating the ends of small, ethereal cannolis. Each dessert had an edge that pulled it back from being simply sugar.The flaky salt on top of the budino just an indicator of the complex flavors to come.\nPhoto by Alex LauNext, chef David Nayfeld led me through the Chopped Salad. He casually name-dropped Olive Garden's chopped salad as something he was nostalgic for. He used to riff on it for family meals at Eleven Madison Park in New York City, where he used to work. While the salad at Che Fico would be unrecognizable to most Olive Gardonians, it strikes a similar balance of tart, sweet, and spicy in the Italian dressing.The salad includes: sweet and bitter lettuces, cured salami, caciocavallo cheese, chickpeas, shredded smoked ricotta salata, dill, roasted kabocha squash, sautéed Brussels sprouts, and a good deal else. The real surprise, though, was how Nayfeld treated the glaze-y juices still clinging to the squash and Brussels sprouts. See, the dressing is fairly straightforward, as far as things at Che Fico go anyway: garlic and chile flake-infused olive oil, red wine vinegar, mustard, salt and pepper. But unlike “Italian” dressings that invariably include some form of sugar, Nayfeld saves all the pooled juices that accumulate in the cupped sides of roasted squash wedges, and in the sides of the sauté pan used to glaze brussels sprouts. Those juices balance all the sharp, salty, and peppery flavors.In this pasta, the nduja’ is key.\nPhoto by Alex LauFinally, Nayfeld demo’d the Spaghetti with Lobster Pomodoro. The eye-opening moment when watching the dish come together was when Nayfeld added nduja to the freshly picked lobster. He methodically tossed it into the nearly finished sauce, letting it melt and emulsify into the liquid rather than cooking it hard and letting it separate into its component parts of fat, meat, and chiles. He explained that he wanted to keep a rusticity to the sauce, and instead of using lots of pasta cooking liquid to create pools of liquid on the plate, he preserves the emulsion of the nduja to bind the sauce and pasta instead.I left Che Fico with the second half of my Ode to Judy Rodgers pizza, draped with sharp arugula and ricotta salata. It sat cold in my backpack until my flight the next morning, when I pulled it out somewhere above Wyoming. And it was still incredible.Get all the recipes from our 2018 Hot 10:1 / 15ChevronChevronSwiss Chard–Tahini DipView RecipeExplore Bon AppétitHot 10 2018Hot 10Restaurants + TravelRead MorecookingThe Secret to the Drifters Wife's Crispy-Skinned Roast Chicken Involves Salt and... Scuba DivingBy Molly BazSpaghetti with Lobster PomodoroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-31", "author": ["Condé Nast", "Chris Morocco"]}