{"id": "827fb6ac55ca2650a54c164d881dfbe4", "url": "https://www.bonappetit.com/story/essential-cocktail-gear", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "All the Gear You Need to Make Killer Cocktails at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Gear You Need to Make Killer Cocktails at HomeYou need more than just a shaker—but not that much more. Here's our list of essential cocktail gear.By Alex DelanyFebruary 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailSitting down at a cocktail bar, you might notice that the bartender has quite the toolkit at their disposal. Strainers of all shapes and sizes. Knives, spouts, wands, lighters, and custom aprons. It's all very impressive. But like any professional, they've got all the bells and whistles because it's what they get paid to do. You, on the other hand, are probably not a professional bartender. Which is fine! Neither are we! That's just the truth.But we do like to make cocktails at home—we just do it without the fancy kit. If you're itching to make a Negroni or an Aperol spritz at home, all you need are a few essential pieces of bar equipment. Here's what you need to make bar-worthy cocktails at your place.Photo by Chelsie CraigDouble Rocks GlassThe rocks glass is the workhorse of the cocktail world. So many cocktails (including a bunch that aren’t supposed to) get served in a rocks glasses in bars across the world. If you were to order any booze “on the rocks,” you’d get it in a rocks glass. And the same goes for an Old Fashioned or a Negroni. For your home bar, a good rocks glass should be durable and hold 10 ounces of liquid.Buy It: Set of 6 Yarai Double Rocks Glasses, $31 on Cocktail KingdomCollins GlassYou might confuse the Collins glass for a regular old water glass. And if you used it as one, no one would be mad about it. The Collins glass is a tall, straight-sided cocktail glass, named after the Tom Collins cocktail, which is always served in one. We like to use them for anything from a spritz to a paloma, but regardless of what goes in one, you want your at-home Collins glasses to hold 12 ounces of liquid.Buy It: Set of 6 Buswell Collins Glasses, $19 on Cocktail KingdomCoupe GlassWhoever invented the martini glass was a sadist. What a terrible design for a vessel that’s supposed to keep liquid inside of it. The coupe glass, on the other hand, is perfect. This stemmed glass is great for martinis but can also serve as a champagne (or whatever bubbly wine you’re buying) glass in a pinch. Make sure that your coupe glass holds between five and seven  ounces of liquid.Buy It: Set of 6 Leopold Coupe Glasses, $35 on AmazonPhoto by Chelsie CraigShakerThe 2-piece metal Boston shaker is the most theatrical piece of equipment in the cocktail world and definitely an essential for at-home production. The best (and simplest) version of a cocktail shaker will consist of two metal halves, one larger and one smaller, that lodge into each other. As advertised, booze and ice get thrown in the shaker and tossed around to properly combine the different ingredients into one tasty drink.Buy It: Set of 2 Weighted Koriko Shaking Tins, $16 on AmazonHawthorne StrainerYou’ve definitely seen a Hawthorne strainer before. You might just not know that it’s called a Hawthorne strainer. This is the quintessential bar strainer, fitted with a spring that gets it snug up to the edge of your cocktail shaker as you pour your cocktail through it. You can use any number of cocktail strainers for different things, but if we’re talking essentials, the Hawthorne strainer is what you need.Buy It: Stainless Steel Hawthorne Strainer, $4 on AmazonBar SpoonIf you think the bar spoon is just a really long spoon, well, you’re mostly right. This elongated spoon is used to mix stirred cocktails like the Martini, the Old Fashioned, and the Negroni. But the other strength of the bar spoon, apart from its length, is the curve of the bowl of the spoon, which tucks into the sloped edge of a mixing glass for easy stirring.Buy It: Viski SS-TRU-4364 True Fabrication Barspoon, $8 on AmazonMixing GlassIf you really wanted to use a pint glass as a mixing glass you could. But stirring a cocktail in a pint glass is much tougher than it seems. The portion of the mixing glass where the walls meet the base is curved, giving your bar spoon a track in which to slide around the glass. This makes stirring your negroni infinitely easier (and tastier). Make sure to get a mixing glass with a spout, so you can pour drinks easily.Buy It: Stemmed 30 oz. Mixing Glass, $10 at Bar ProductsPhoto by Chelsie CraigSilicone Ice TrayNot all ice is created equal. And neither are ice trays. A silicone ice tray makes popping out cubes super easy, and a larger square mold will give you ice that melts slowly and evenly. You can grab a couple different sized trays, but a one and a quarter inch ice cube is versatile enough to solve most of your ice-related problems.Buy It: Set of 2 Tovolo Ice Trays, $12 on AmazonY-PeelerIf you’ve been reading this website for a minute, you probably already have a y-peeler for peeling vegetables. But the y-peeler is also the perfect tool for creating cocktail garnishes. Running it down the side of a lemon, lime, orange, or grapefruit will give you a strip of citrus peel that adds flavor, aroma, and color to your cocktails.Buy It: OXO Good Grips Y-Peeler, $10 on AmazonMini Measuring CupBartenders use two-sided jiggers to measure liquids behind the bar, but at home, we like an OXO mini angled measuring measuring cup. Jiggers aren’t uniform in size and are usually hard to read. We love the OXO liquid measuring cup because it holds up to 2 oz. and is easily legible from the top and side. Looks like you're all set. Cheers!Buy It: OXO Good Grips Mini Angled Measuring Cup, $4 on AmazonNow that you've got the gear, let's make some drinks!3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeHope you’re thirsty! Introducing Happy Hour with Al, Basically’s new no-nonsense cocktail column.View StoryExplore Bon AppétitBasicallyCocktailAlcohol & Other DrinksShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-08", "author": ["Condé Nast", "Alex Delany"]}