{"id": "82a2c30151d36c6dab06b76890081849", "url": "https://www.bonappetit.com/recipe/crispy-black-rice-and-chinese-sausage-dressing", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Black Rice and Chinese Sausage Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Black Rice and Chinese Sausage DressingBy Molly BazNovember 16, 20194.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWild rice stuffing is rarely anyone’s favorite on the Thanksgiving table. For this version, we swapped in nutty, chewy black rice, took a tip from fried rice and crisped it up in the pan, and added lap cheong, a cured Chinese pork sausage with a maple-y sweetness. (If you can’t find lap cheong, a maple-cured pork stick works as a substitute.) With crunchy peanuts, tender-juicy celery, and floral Fresno chiles to boot, it’s a riot of textures and sweet-and-savory flavors that still plays nice with the rest of the spread. Now that’s a side we can get behind for the holidays, or really, anytime of the year—especially when it’s topped with a fried egg.Ingredients8–10 servings as a side or 4–6 servings as a main2red Fresno chiles, finely chopped¼cup unseasoned rice vinegar2Tbsp. white miso1Tbsp. pure maple syrup7Tbsp. neutral oil (such as grapeseed, canola, or vegetable), divided4cups cooked black rice, chilled until cold (from 1½ cups raw)½tsp. kosher salt, plus more6oz. Chinese sausages (lap cheong; about 6), thinly sliced on a diagonal3celery stalks, sliced on a diagonal into ¼\" pieces, plus leaves for garnish6oz. shiitake mushrooms, stems removed, sliced ⅛\" thick½cup roasted salted peanuts, choppedPreparationStep 1Whisk chiles, vinegar, miso, maple syrup, and 1 Tbsp. oil in a small bowl to combine; set aside until ready to use.Step 2Heat 2 Tbsp. oil in a large (at least 10\") nonstick skillet over medium until shimmering. Add chilled rice and press into a flat, even layer. Cook, undisturbed, until underside is very crisp (take a peek and give it a feel; it should be crackly), 7–8 minutes. Break it up into a few large pieces, turn, and continue to cook until crispy all over, 3–4 minutes longer. Season rice with salt, then toss to break up crispy bits. Transfer to a large bowl.Step 3Cook sausages, sliced celery, and 1 Tbsp. oil in same skillet over medium heat, stirring occasionally, until sausage and celery begin to brown in some parts, and celery is crisp-tender but not floppy, 3–4 minutes. Transfer sausage mixture to bowl with rice.Step 4Heat remaining 3 Tbsp. oil in same skillet over medium until very hot, about 1 minute. Add mushrooms and toss once or twice to coat in oil. Season mushrooms with ½ tsp. salt and cook, undisturbed, until browned underneath, 4–5 minutes. Toss and continue to cook, tossing occasionally, until softened and browned in more places, 3–4 minutes longer.Step 5Return rice mixture to skillet and cook, tossing occasionally, until warmed through, about 1 minute. Remove skillet from heat, stir in rice vinegar dressing and peanuts, and toss again to coat. Taste and season with more salt if needed.Step 6Transfer rice mixture to a platter. Garnish with celery leaves.How would you rate Crispy Black Rice and Chinese Sausage Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was a stunner, made as a veggie main and worked out great! Black rice was delicious. Added some extra veg (shredded Brussels sprouts, bit of ginger) and used beyond for the sausage so not 100% true to the recipe, but the fresno / vinegar / maple mixture with the black rice is what I think we're really talking about! Great flavor combo, peanuts totally worked too. Great leftovers next day too. kmarxmarxchicago, il7/10/2020Add lottts of celery!  So good!  \nI've made this with honey instead of maple and also got tasty results.  Meatless sausage breakfast patties actually worked well as a replacement for the meat but I think it could easily be made vegetarian by just using way more mushrooms as well.  \n\nAdded fresh grated ginger to the sauce and probably wouldn't make it without the ginger going forward.  I've added mandarin oranges or egg yolk to this and both are good additions!AnonymousColumbus1/3/2020I am obsessed with this. So yummy with the crisped rice and fatty sausage. Found it at my local Asian market!AnonymousBrooklyn11/26/2019Explore Bon AppétitStuffingSausageMeatShiitake MushroomMushroomVegetableRiceRice & GrainsFallSideMainDairy-FreeThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-16", "author": ["Condé Nast", "Molly Baz"]}