{"id": "82abb5e28c90df77a739abd6c7f61479", "url": "https://www.bonappetit.com/story/chianti-soaked-italian-restaurant", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Scenes From Camille's in Providence, a Chianti-Soaked Italian Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsScenes From a Chianti-Soaked Italian RestaurantFriday night at Camille’s, a Providence, Rhode Island, red sauce legend more than a century in the making.By Molly BirnbaumApril 16, 2019FacebookTwitterEmailPhoto by Joe St. PierreFacebookTwitterEmailIt’s 6 p.m. on Friday, and George Kilborn Jr. stands behind the reservation station at Camille’s. Opened in 1914 in Providence, Rhode Island, in a former mansion on Federal Hill, the city’s Little Italy, it’s one of the oldest restaurants in town. It’s also one of Providence’s most iconic, known for its permanent menu of gnocchi alla vodka and veal Parmesan; rumored mob connections; and celebrity sightings—politicians, power players, Frank Sinatra, Diana Ross. Kilborn, a soft-spoken restaurant careerist who’s been running the front-of-house here for nearly two decades, oversees it all. We tagged along with him on one of the liveliest nights of the week as he worked the room.6:15 p.m.“Georgie!”An older woman with a dyed brunette bob and a red cardigan lined in sequins emerges from the restroom. Kilborn gives her a hug as she makes her way to the lounge.“She’s still coming in?” whispers John Conti, a maître d’. Margie Bajakian is 85.“Every Friday,” Kilborn says. “She missed two weeks and we were worried, but it was just because she had a cold.”Margie settles herself into a seat at the corner of the long dark wood bar, where a statue of a busty woman in a low-cut red dress presides over the liquor selection. She orders the zuppa di cozze, a wide, flat bowl of soup filled with mussels, lardons, caramelized onions, and roasted garlic. “I don’t like to get the fattening stuff,” she says.She started coming to Camille’s in the 1970s but stopped when she got married and had kids. About five years ago, she picked the habit back up again. It became crucial, she explains, especially after the loss of her son.“Everyone said, ‘Your son died, why are you going out?’ And I says, ‘It’s because I can’t take it if I stay home.’ I was so depressed,” she explains. “They were so good to me. George is so nice. John is so nice. I love everyone here.”George Kilborn Jr. ready to greet guests at his station.\nPhoto by Joe St. Pierre6:45 p.m.A middle-aged woman sits at a four-top covered in a crisp white tablecloth with her two teenage daughters. Rhiannon Tronzo is finishing her gnocchi with a pink vodka sauce. Just two weeks earlier she had come here with friends and family to celebrate her 16th birthday.“It felt like we were walking onto a movie set,” she says, gesturing around the windowless dining room decorated with mirrors and bright glass sculptures. Until about 20 years ago, small booths lined the walls, each with thick curtains to make them private.“Deals were made in those alcoves,” Kilborn says.Angela and Angelo Ruo (“Yes, those are really our names”), Camille’s regulars of 25 years, remember other details: “Friday nights were for girlfriends, and Saturdays were for wives.”Camille’s, set in the same former mansion since 1914.\nPhoto by Joe St. Pierre7:30 p.m.Down the hall, the coat check begins to fill up. At the door sits Cynthia Henley, a woman in a fuchsia dress who has worked at Camille’s for 34 years. “I was the first person of color in the front-of-house in all of Federal Hill,” she says. “There still aren’t many people of color in the front-of-house.” She was hired because the woman who had the job before her gave away a mink coat by mistake. “It was a long time ago, and it really was almost shocking for the guests to come in and see a person of color. They couldn’t believe it.”As guests shed their layers, Kilborn eyes a woman wearing leopard-print athletic leggings, a matching leopard-print sweatshirt, and leopard-print heels festooned with pink pom-poms. Guests used to dress up to come to Camille’s, he remembers. The restaurant was an occasion spot. It was considered elegant, fancy, and with a dress code to match. But that’s all changed. “We do still ask them to take off their hats,” he says, and sighs.9 p.m.All reservations have been seated, and the eight-piece Down City Band eases into its set in the lounge. The room—a bar, white leather booths, and an open space for dancing—is practically vibrating. Guests, most over the age of 40, stream in through the front door and go straight for the bar. A woman in a red strapless dress and fur coat hands Kilborn a large bottle of gin (“she’s a liquor rep,” he explains) and heads in to dance.Clockwise from top left: Prosciutto-wrapped halibut, fried calamari, and shrimp in Sambuca-butter sauce.\nPhoto by Joe St. Pierre10:30 p.m.Kilborn and maître d’ Conti sit down at the two-top closest to the entrance and order dinner as they do every Friday. Kilborn eats shrimp cocktail and grilled salmon over vegetable risotto. “Sometimes I try to be good,” he says.“I grew up down the street,” Conti says over his beet salad and veal Parm. “This was my favorite restaurant to go to with my friends. I got engaged here. My son’s communion celebration was here. When my father passed, we came here. It’s near and dear. I’ve known everyone for years.”Kilborn faces the kitchen, Conti the dining room. They both have a clear view of the door, just in case.12 a.m.The band plays its last song. The lights come up. The guests trickle out. Kilborn restocks the wine closet and makes his final rounds. After a lap around the dining room, he heads home, the restaurant properly put to bed.Molly Birnbaum is a writer based in Providence, Rhode Island, and editor in chief of America's Test Kitchen Kids.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRhode IslandRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Molly Birnbaum"]}