{"id": "82b6fed1415d4c8f5e3b431e5a5bca8f", "url": "https://www.bonappetit.com/story/roasted-squash-tahini-recipe", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "This Roasted Squash Recipe Is the Ultimate Vegetarian Main | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Roasted Squash Recipe Is the Ultimate Vegetarian MainCrispy fried eggs and salty-sweet tahini sauce make for a plant-based dinner that really satisfies—no late night snacking required.By Meryl RothsteinJanuary 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI need more vegetarian meals in my life. For reasons ethical, environmental, and healthful, I’ve been trying to find more plant-based meals that I love. But also ones that keep me full. And, if I’m being honest, ones that keep my husband full, because most of my home-cooked meals feed him too, and a disappointing number of my vegetarian dinners have sent him rummaging through the snack cabinet by 9. So I was excited to take on this roasted squash recipe, decked out with tahini-honey and crispy fried eggs which sounded not only tasty but also hearty enough to satisfy my cabinet-rummaging husband.I decided to double it because I had a feeling it would make good lunch fixings. (I was right. More on that later.)First up was toasting the farro, a nice step that a) makes your house smell like popcorn and b) adds a nice depth and nuttiness to the finished dish. Then I sliced up the acorn squash, which I was glad to see in the ingredient list instead of impossible-to-cut butternut squash. Had I been a more resourceful cook, I would have saved and rinsed the seeds, and roasted them with spices for a Healthyish snack. Sadly I was not that resourceful cook.While the squash and onion did their thing in the oven, I made the sauce. Tahini is one of those things I didn’t cook with that much a year ago, and now cannot stop cooking with, so any dish with a tahini sauce is one I’m interested in. Last up are those crisp-edged fried eggs, one of my favorite finishing touches of all time.The verdict: delicious. The salty-sweet sauce was a nice balance to the nutty farro, and those jammy roasted onions were nicely lightened by a flurry of fresh herbs. It also qualifies as the kind of dish that, as mentioned previously, can be oh-so elusive in my house: a filling vegetarian main that left neither of us craving a snack later. And, it turns out, a filling vegetarian lunch, too: I turned the leftovers into several days of take-to-work lunches, which I never got tired of and kept me full for hours. It’s great as is—though I did swap the fried eggs for jammy soft boiled ones for the sake of portability—but also the various components can be used separately. That sauce is delicious on simply-cooked chicken thighs (we can't be vegetarian every night, can we?) and the roasted squash and onions will lend heft to a simple green salad. A win on all counts.Get the Recipe:Roasted Squash and Grains with Tahini-HoneyMake a double batch of the tahini-honey sauce at the beginning of the week to use on salads, as a dip for crunchy vegetables, or drizzled over seared salmon.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanWinter SquashTahiniEgghoneyFarroRead MorecookingThese Rice Noodles in Cashew Sauce Are Easier Than Ordering TakeoutBy Julia BlackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Meryl Rothstein"]}