{"id": "82b855c25ebda4193389ab99bcac207c", "url": "https://www.bonappetit.com/story/kemar-wynter", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "For Brooklyn Artist Kemar Wynter, Caribbean Food Is a Way Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor Brooklyn Artist Kemar Wynter, Caribbean Food Is a Way HomeThrough paintings like Macaroni Pie and Auntie Del’s Stew Peas, he holds the dishes (and their chefs) dear.By Julie PooleAugust 25, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailDuring his junior year as an art student at SUNY Purchase, Kemar Wynter was supposed to pick an area of focus. At first, he couldn’t think of anything. Then, it clicked: He’d focus on home. As one of four Black students in a cohort of 22, several hours from his home in Flatlands, Brooklyn, he yearned for that welcoming feeling of being in the kitchen, surrounded by family, with the smell of comfort foods and traditional Jamaican dishes filling the room.As a kid, Wynter would rush home from school for Friday night dinners and head straight for the kitchen, where his aunt would put him to work peeling carrots, stirring pots, and marinating meats. What began as a childhood obligation morphed into a lifelong passion. He was drawn to the experimental process of cooking, which required a balance of careful attention and self-trust. From age eight he fixated on macaroni pie, a family staple he then spent 18 years perfecting, tweaking the recipe until it was just right. In Wynter’s family, written recipes didn’t exist. He learned by watching his aunt and mother cook, absorbing the basics and then moving on to more advanced techniques.Likewise, Wynter’s jubilant and motion-filled abstract paintings—with titles like Macaroni Pie, Auntie Del’s Stew Pea, and Aunt Pearline’s Potato Salad—are the result of diligent growth and iteration. Each layered surface is made from oil pastel, charcoal, and metal grommets on paper—and fills a gallery space with a brothy light so rich you can feel its warmth fill your chest. For Wynter, food is a multisensory experience directly linked to his early childhood spent in Crown Heights, an adulthood spent exploring the five boroughs, and his Jamaican heritage.When we chatted via Zoom, Wynter was taking a break from shipping his paintings to various galleries around the world the day after the close of his first solo show, “Portions.” He talked about the importance of archiving history, how his practice has evolved over the pandemic, and his favorite vegan cookie in New York City.“Portions” was my first solo show and it focused on… generosity and being able to give myself [to others]. I’m making paintings about food and these pieces on the wall—these are the portions of myself I’m sharing with people. Within the idea of generosity, there’s also a level of care, and also control and power, to designate who gets what. The painting is a gift, an homage to the dish, the chef, and the moment. But to get to my internal dialogues surrounding the [piece], you have to put in some additional work. I want my non-Black viewers to work for their meal.In the last year plus, I’ve seen so much social media posturing of solidarity… but where is the actual labor being executed amongst so-called allies? There’s a lot of coding that I placed within the text for each of the paintings, thinking of the ways in which, for me, as a Black individual, I have to constantly change the way that I speak to other people just as a way of navigating the precarity of the world—knowing that the way that I speak in certain contexts can be the thing that determines the level of care that is presented to me or the access to opportunities that I have.Each of my paintings are titled after food… and sometimes relate to specific people in my life. I think it’s important to hold on to that notion of lineage. I was the first person in my family who was born in the U.S. So I see myself as a record keeper and I think of my practice largely as a form of archiving—both of my family’s recipes and the stories attached to them. I’m a child of immigrants, so I feel a responsibility to hold these dishes dear. In a generation or two, if these recipes are lost, what is my attachment to Jamaica? Where is my family’s heritage? If my kids and grandkids come to me for fast food before they ask me to make them a pot of oxtail, I put that failure on me.This last year has really reset... my practice. Before COVID-19, I was working [at a gallery] down in Chelsea, doing three-hour commutes round trip alongside an eight-hour workday. I really didn’t have much time for a studio practice. Once the pandemic hit, I was working from home during the day to about 6 p.m. Then I’d take an hour or two off to eat or make dinner, to catch a breath and decompress for a little bit. After that, from 8 p.m. to 4 a.m., I would work in my home studio—a small cubby room—before going to sleep and waking up at 9:55 a.m. to start work. I did this every single day for months. It was a lot, but I made well over a hundred pieces of art last year.I figured I needed to make as much stuff as possible… and not take my art practice for granted. In the last year or two, I’ve had to confront mortality, whether it be Black people getting killed left and right [or] COVID-19. I came to this decision that I don’t really have the time or the opportunity to not fully commit to just making things, because I could go any day.I will never give up… Seitan Rising’s vegan salted miso chocolate chip cookies. You have to pull up early to get them but, lord, there is nothing greater in terms of cookies in New York City. I never had a sweet tooth growing up, but now I love a good dessert. I rarely find myself [in the area], but if I’m close I will always cop a slice of the dairy-free chocolate cake at L.A. Sweets NY on Malcolm X.I think about food as I work because it… helps to keep the dish and the moment in mind. When I get into the studio, I keep lots of water, tea, and minimally sweetened drinks on hand—flavored seltzer is my high favorite. I also keep a bag of baby carrots around too, as the gnawing helps me think in the slower moments.Living in New York has shown me there’s a lot of kinship… within cuisines. I eat a lot of Jamaican food, because I grew up with it, but I also enjoy Korean food, Taiwanese food, and Syrian food. [All the cuisines here seem to kind of] bump up against one another. It’s a really exceptional thing to commune over their parallels and idiosyncrasies.Explore Bon AppétitPerson of InterestCultureInterviewsRead MorecultureFor Ceramist Stephanie Shih, There’s No Such Thing as Art Without ActivismBy Leah BhabhaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Julie Poole"]}