{"id": "82bcad5ae8c8731c36e6eceb062987f1", "url": "https://www.bonappetit.com/story/a-summer-of-diy-eating", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "A Summer of DIY Eating | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Summer of DIY EatingTravel suggestions, recipe recommendations, and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroJune 27, 2019FacebookTwitterEmailPhoto by Alex Lau, Styling by Andy BaraghaniFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,One nice thing about coming back from Southeast Asia: the humid weather in New York feels positively temperate compared to the heat-stroke-inducing climates of where I was. One not nice thing about coming back from Southeast Asia: jet lag. First I didn’t sleep for three days (let’s blame all the Vietnamese coffee coursing through my bloodstream); now I can barely stay up past 9 p.m.But being a little sleepy is a small price to pay for a much-needed vacation. I won’t bust out the slide projector and give you the full travelogue, but I will tell you about Hanoi, where I did the most (and best) eating, from breakfast chao suon (rice porridge with ground pork) to dessert chè (milky soups and drinks topped with sweetened beans, jellies, corn, and seeds).My favorite thing about eating in Hanoi was how DIY every meal was. I rarely found myself with a composed plate of food; most dishes required at least some assembly. Take Cha Ca La Vong, a Hanoi specialty of turmeric-fried white fish that’s heated tableside and served with tiny bowls of rice noodles, chiles, cilantro, and Nuoc Cham. Or Bun Cha, a lunch staple that comes as a set with rice noodles, fresh herbs, perhaps some pickled vegetables, and a bowl of grilled pork patties and pork belly in a sweet, tangy, fish-sauce-y broth. Even the famous egg coffee—egg yolks whipped with sweetened condensed milk and dolloped into a glass of Vietnamese coffee—involves some personal choice: Do you stir the sweet, foamy egg into the gunpowder-strong coffee or let it rest on top as you sip?My first night back, I found myself making mushroom larb for three, and I had to laugh as we filled our little cabbage cups with sticky rice, larb, chiles, and squeezes of fresh lime. Clearly I hadn’t tired of choose-your-own adventure food. I’m eyeing another of my favorite larb recipes next, along with these Sambal Shrimp Lettuce Wraps, this version with spicy steak, and about a million taco recipes. There’s more assembly-required eating in my future...even if my vacation days are maxed out.And, while I was gone, Healthyish went on! We launched a new column called Unfiltered from BA wine editor Marissa Ross (first up, an ode to a New Zealand natural wine). Stephanie Ganz wrote about meal-planning as a way to conquer her existential dread. Fariha Roísín talked to Alex Koones, founder of the supper club Babetown, about creating a space for New York’s queer community to eat together. Allison Gibson went deep with the women living their best #vanlife, and we gave you not one but three summer-barbecue-friendly healthyish recipes: Sweet and Spice Grilled Summer Squash, No-Brainer Corn Salad, and Lentil Burgers. They’d make a great dinner served all together, but don’t let me plan your menu. It’s the summer of DIY eating after all.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterVietnamesevietnamessayRead MoreLifestyleI've Been Missing the KitchenBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-27", "author": ["Condé Nast", "Amanda Shapiro"]}