{"id": "82bd52844459d8af578ec27ac6050b9f", "url": "https://www.bonappetit.com/recipe/easy-sheet-cake-with-chocolate-cream-cheese-frosting", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Easy Sheet Cake with Chocolate-Cream Cheese Frosting Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEasy Sheet Cake with Chocolate-Cream Cheese FrostingBy Claire SaffitzApril 10, 20184.2(105)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintMeet your new favorite birthday cake.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit Market13x9\" Baking Dish$20 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonElectric Mixer$40 At AmazonCake Tester$3 At AmazonWire Rack$23 At BA MarketSpatula$12.99 At AmazonIngredients12 servings1¾cups (3½ sticks) unsalted butter, room temperature, divided, plus more for pan3¼cups all-purpose flour, plus more for pan2cups granulated sugar1Tbsp. baking powder1¾tsp. kosher salt, divided½tsp. baking soda2large eggs plus 5 large egg yolks1¼cups buttermilk, room temperature2Tbsp. vegetable oil1Tbsp. plus 1 tsp. vanilla extract, divided6oz. cream cheese, room temperature2cups powdered sugar¼cup unsweetened cocoa powderSprinkles (for serving; optional)PreparationStep 1Place a rack in center of oven; preheat to 325°. Smear room-temperature butter all over bottom and sides of a 13x9\" baking dish (metal or glass is okay) with your fingertips. Sprinkle a light dusting of flour into pan, then shake pan to coat all over; tap out excess flour.Step 2Whisk 2 cups granulated sugar, 1 Tbsp. baking powder, 1 tsp. salt, ½ tsp. baking soda, and remaining 3¼ cups flour in a large bowl.Step 3Whisk 2 eggs, 5 egg yolks, 1¼ cups buttermilk, 2 Tbsp. oil, and 1 Tbsp. vanilla in a medium bowl until smooth.Step 4Cut 2 sticks butter into 1\" pieces and add to bowl with dry ingredients. (Now's a good time to make sure your butter is really at room temp—as in, you should be able to make an impression in the butter with your finger. If it's too firm, you won't be able to properly incorporate it into the flour.) Using an electric mixer on low speed, slowly increasing speed to medium, beat until butter is worked into dry ingredients and mixture looks like coarse meal, 4–5 minutes. There shouldn't be any dry flour or visible chunks of butter at this point.Step 5Make a well in center of flour mixture and pour in half of buttermilk mixture. Starting on low speed and slowly increasing to medium, beat until all of flour mixture is hydrated.Step 6Add remaining buttermilk mixture and beat on low speed until liquid is incorporated. Increase speed to high and beat until mixture is satiny smooth, light, and thick, about 1 minute.Step 7Scrape batter into prepared pan and smooth into corners in an even layer.Step 8Bake cake until top is golden brown, firm to the touch, and a tester inserted into center comes out clean, 45–55 minutes. Transfer to a wire rack and let cool completely.Step 9Make icing while cake cools. Using electric mixer on medium-high speed, beat 6 oz. cream cheese and remaining 1½ sticks butter in a medium bowl until light and fluffy, about 2 minutes.Step 10Add 2 cups powdered sugar, ¼ cup cocoa powder, and remaining ¾ tsp. salt and beat again, scraping down sides of bowl, until completely smooth.Step 11Add remaining 1 tsp. vanilla and continue to beat until fluffy and lightened in color, another minute.Step 12Smooth icing over top of cooled cake (it should not be at all warm to the touch, or else the icing will melt).Step 13Top cake with sprinkles, if desired. Cut into pieces and serve.Step 14Do Ahead: Cake can be baked and frosted 2 days ahead. Chill until icing is solid, then cover with plastic wrap and keep chilled. Bring to room temperature before serving.How would you rate Easy Sheet Cake with Chocolate-Cream Cheese Frosting?Leave a ReviewTell us what you thinkReviews (72)Back to TopTriangleI loved this recipe and will definitely make it again. The texture and butteriness of the sponge was perfect - the flavour was biscuity and it reminded me of a classic, squidgy chocolate chip cookie. I had to convert it to UK measurements but it still turned out very well - even when I under-measured my baking tin and it overflowed into the oven (whoops). Somehow the cake was salvageable and the icing covered a multitude of sins. The frosting is one of the best I’ve tried and I’ll be using it in place of traditional buttercream icing in other baking recipes. Thanks Claire! NardwickEngland, UK1/14/2022Overall, the cake was ok; Not too sweet and the icing was a good compliment with it's slightly tangy sweetness (but not too sweet). I baked the cake in a glass 9x13 and had to cook it a bit more, which made it a touch dry. I also found it a bit dense. Not sure if I overworked the batter, but I was using a handheld mixture and I was finding it a bit thick to mix. It's a bit of a shame when mixing for just a minute more can change the texture. It would be nice to have a foolproof method for something like a birthday cake. I'm thinking of Chris Morrocco's chocolate cake recipe, but not sure how it would do in a 9x13. I might make it again, but with 25% more icing. I found the ratio was 95% cake 5% icing. I would also get a metal pan to make sure it cooks the same. In summary, not a bad cake, but not amazing. Lots of mixed feelings. AdèleMontréal, Canada11/22/2021For those planning on making cupcakes- this makes at least 36 cupcakes.   Make sure each cupcake tin is only 1/2 filled, and do NOT tempt fate and just 'top them off', or risk what I've done a few times already- a beautiful puffy sheet cake topping to my cupcake tray :/. \n10/10 recipe, now if only I can get my cupcake game in order.  (This time, I used a 1/4 c. Ice cream scooper, leveled off, to measure each cupcake. That was TOO MUCH.)Cupcake fiendNew York7/4/2021Delicious. I just made this for my nephew’s high school graduation. It was a big hit. Many many thanks to Nicole from Seattle for pointing out the ambiguous butter measurement, keeping me from making the same mistake. I think basically tries too hard to be different from the rest of the magazine, and as a result can produce sloppy recipes. Regardless, this cake was buttery, vanilla-y, super moist, and the frosting was sublime. Together they made an elevated version of a bakery classic. I made it gluten free by substituting rice flour for all purpose flour with no other additions/substitutions. Yum.EleniCleveland, OH6/2/2021This cake was great! I only wish the cake ingredients were listed separately from the frosting because I did put in all the butter at once into the cake batter because I was not paying enough attention. Yes I did think it was a lot of butter and yes it did make the consistency of the batter weird but it did take me until the cake was all baked and I went to make the frosting to realize what had happened. But now I can say that the cake is still delicious and fluffy even with almost twice the intended amount of butter!NicoleSeattle, WA1/22/2021So not only was this recipe fabulous it actually does very well when you need to up size it. I baked this cake for a coworker who was leaving us and i think i tripled it to accommodate our full sheet pan. Anyway everyone loved it and i have passed on the link to more than one of my coworkers to try at home. ClaireVancouver,BC Canada12/23/2020The cake is delicious but my friends and I all tasted and found no significant difference in this and boxed yellow cake mix. So for the level of effort and time required, it would be better off to use the boxed stuff if no one can tell the difference. The icing was pretty good though. If you are wondering whether or not to use the full 8-oz block, I'd say go ahead. I used the exact 6 oz and found myself wanting a little more cream cheese flavor / tang. Thao NguyenWichita, KS12/12/2020I made this recipe and it was a SUCCESS. Loved the texture of the cake: it is incredibly moist, super tender, not too sweet and taste like a good vanilla cake.  One thing tho is that it kinda smells like cornbread (which is weird, because I know there’s no corn in here lmao) but it tasted good nonetheless. \n\nThe frosting was amazing as well. Love the tartness from the cream cheese, it definitely balances the sweetness out and makes for a better icing. It was super easy to do as well.\n\nI did use the full amount of salt in the frosting and half amount on the cake as I was using table salt instead of kosher and neither of them came out too salty. Both were good balanced.\n\nMade this cake for my boyfriend and he loved it so much he didn’t wanted to give me an extra slice. This will be in my recipe route whenever I need a birthday cake!Luis Millán Guadalajara, JA.11/22/2020I never leave reviews but I had to leave one after seeing all the negative reviews here. \n\nI did not make the frosting since I wanted a yellow sheet cake to decorate like an American flag, so this is a review for the cake itself. It is DELICIOUS and gets even more delicious the day after it's made. The cake is buttery and moist. It does not, however, have the fluffiness that only comes with cakes made out of oil. If you like that kind of cake, you will not like this one. However, if you like very flavorful cakes that aren't just a vehicle for overly sweet frosting, this is wonderful. I made a simple cream cheese frosting without cocoa to be the white background of my flag cake and it complemented the cake really well. \n\nThis is definitely going to be my go-to yellow cake, birthday cake recipe going forward.AppleSisterLos Angeles, CA, United States11/10/2020This recipe was such a disappointment.\nI am a more than competent baker and followed it to the letter even to the point of having the video up and duplicating each step since it was a different technique than I had ever done before.  The texture was dry, another reviewer said cornbread like and that is about right, only with less flavor.  We cut one piece, took a couple of bites and dumped the rest.DonelleandrussSpokane, wa10/4/2020This recipe did not turn out well at all. The cake tasted more like cornbread than cake. It wasn’t exactly dry, but it wasn’t sweet enough to taste like cake, which I think made it seem crumbly, hence the cornbread comparison. I probably could have lived with that but the big clunker was the frosting. The kosher salt in the frosting was unpleasantly crunchy, and far too salty for a cake. The frosting tasted neither like chocolate nor cream cheese. Note: I used unsalted butter for both the cake and the frosting. If this was supposed to be a play on sweet/salty, it failed to bring enough sweetness to contrast the salt and the overall impression was savory. AnonymousKings Park, NY8/22/2020Really classic cake; taste is very classic, white cake with chocolate frosting, what more could you ask for except maybe some good ice cream on the side XD. It was perfect for my mothers birthday. Super retro and fun because it was made with love and brought back good memories. Thanks Claire. apalafo6San Mateo, CA7/12/2020This was my first attempt at a cake from scratch in hopes of graduating it to a layered birthday cake for my grandma. And lemme tell ya I loved it!  I can't stop eating it.  I ate six pieces in a day I'm genuinely worried for my health.  It's gotten to the point that I can't look at the pan in fear that I'll want another piece.  When I wake up in the morning it's the first thing I think about.  The frosting's perfectly tangy and sweet and chocolate-y.  The cake is sweet and tender and stays pretty moist if you don't happen to finish it the day it's made.  Just cover it.  Also don't let me fool ya I still haven't finished it in three days despite my monster cravings, so yea, the recipe makes nice amount of cake.  I made it a second time and made a careless mistake of putting all the butter in the cake, but it only came out a little dense not too bad tho.  So if you wanted to know you can add up to a 1-1/4 cup butter and you'll still be a note-worthy baker at the book club.  As for your arteries I cannot say...happy baking y'all!Ivonne ValenzuelaShreveport, LA6/1/2020Loved it. Very fluffy, moist but rich cake, with frosting that kind of reminds me of chocolate soft-serve ice cream in both flavor and texture. I thought the saltiness was just right; I used salted butter and just a little less kosher salt than the cake and frosting called for. I also made it into a layer cake with two 9-inch round pans lined with parchment, filled about halfway, and made 3 cupcakes with the left over batter. If making a layer cake like this, I would definitely make sure not to fill the pans more than halfway, as mine domed quite a bit. Thank you, Claire! Ruby VaughnProvidence 5/31/2020I've been making yellow cake for years, using different recipes (my mom's, Baking Illustrated, trying a few of my own) and this is one might replace them all. I didn't have buttermilk, so I used 1 overflowing Tbsp of lemon juice in a liquid measuring cup and poured in whole milk until it reached the 1 1/4 c mark. When my buttermilk substitute didn't look curdled after 5 minutes, it made me wonder if my lemons weren't acidic enough, so I threw in an extra 1/2 tsp of white vinegar to the egg and milk mixture just to be safe. This is the only modification I made, and the cake turned out near perfect (moist, fluffy, super tender). Despite the rave reviews for the frosting, I actually didn't love it because I thought the cream cheese made it too sour. If I could rate the cake recipe separately, I'd give it 5 stars.AnonymousChicago, IL5/26/2020Explore Bon AppétitCakeDessertAmericanCream CheeseCheeseButtermilkOther IngredientsCocoaEasyNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-10", "author": ["Condé Nast", "Claire Saffitz"]}