{"id": "82c3db0c03e9217c203c6a64e46e37ea", "url": "https://www.bonappetit.com/story/golden-brown-chicken-skin-hack-honey", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "The Hack for Golden Brown Chicken Skin? It Involves Bees | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Hack for Golden Brown Chicken Skin? It Involves BeesHere's how to get deeply-browned chicken skin in a hurry.By Alex DelanyMarch 20, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailA perfectly roast chicken with crispy, golden brown skin has been a symbol of home cooking excellence for...well, at least since Julia Child told us so. But sometimes achieving that most-desirable of hues can be a little easier said than done, especially when we're relying on the indirect, ambient heat of an oven—rather than the direct heat of a grill or a hot skillet—to get us there. If only there were some kind of hack that would ensure perfect skin every time, a trick that would produce chicken skin so golden that you could probably take it to one of those CA$H 4 GOLD places, and they’d be like, “OK. Here’s some cash.” Well, friends, there actually is. And whether we're working with a whole bird or a sheet pan full of thighs, it's a technique we turn to again and again.First things first: What's happening when chicken skin browns? Well, when any ingredient is exposed to high heat, the first thing that happens is surface moisture evaporates. Once enough water evaporates, something called the Maillard reaction starts to take place, whereby naturally occurring sugars and proteins begin to caramelize and are transformed by heat and time into a crazy array of complex and irresistible aromas. (If you really want to go deep on the science, check out this article.) It's what makes a crusty-seared steak so incredibly delicious, or a crackly French fry so much more tasty than a boiled potato. And it's what makes perfectly roasted chicken feel like the ultimate weeknight luxury.With enough time and high enough heat, you don't need any additives to get the kind of deep coloring you're after. But there are certain times where, for one reason or another, you really need to jumpstart that Maillard business—say, when you're roasting chicken and a few other dinner components together on the same sheet pan. The secret? Honey. Incorporating something sweet like honey into your marinade or glaze, or even just brushing a very thin layer of the stuff on the outside of your chicken increases the sugar content that the heat is coming in contact with, getting you deeper color in a hurry.But it’s not just honey. And it’s not just chicken. Adding sugar of any sort to meats across the board will help get more impressive browning, whether it’s something with a tad of sweetness, like soy sauce, or something with a high sugar content like maple syrup, agave, or pomegranate molasses. Sauces with high sugar content like barbecue sauce, ketchup, or hoisin sauce also work well when brushed over proteins. It’s a one-two stroke of color and flavor.A honey glaze makes browned chicken thighs crisp up reeeaaal nice.\nPhoto by Chelsie CraigAnd yeah, we have the recipes to back it up. A date-night pork chop that browns up super quick, leaving the inside juicy and pink? That'll do. How about a hoisin-glazed pork chop, because you can't have enough pork chops in your life? In there like swimwear. A roast chicken that’s just waiting for a little brush of honey? You betcha. Some crispy chicken thighs with garlic-honey. Uhhhhh...yeah. We’ve got those too.But here’s the thing: the best part about this information is that you don’t need a recipe to use it. You can just add a little bit of sugar to the marinades, glazes, and proteins you already love to cook. We’re just here to help you get more from it. Kind of like that CA$H 4 GOLD spot you sold the chicken skin to. More gold. More dollar bills. More life.So. About that sheet pan dinner:Chipotle-Rubbed Chicken Sheet-Pan DinnerSweet-spicy chipotle chicken, zippy roasted tomatillo salsa, and spice-rubbed squash all on one sheet pan.View RecipeExplore Bon AppétitBasicallyChickenroast chickenhoneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Alex Delany"]}