{"id": "82c7b1c6e0b49f90fc06caeb4f2cd1e3", "url": "https://www.bonappetit.com/story/black-lentils", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "Black Lentils Are the Best Lentil for Meal Prep, Period | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBlack Lentils Are the Best Lentil for Meal Prep, PeriodThey're fast, they're versatile, and they're the meal prep hero we need right now.By Aliza AbarbanelJanuary 4, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWe're calling it: 2019 is the year lentils will finally get the respect they deserve.  Too often, these humble legumes are overlooked in favor of crispy chickpeas and creamy cannellini beans. Lentils may not have glory, but they do have a few tricks up their sleeve. Their small stature means they cook much faster than beans, plus they can be repurposed in a wide range of weeknight meals without making you feel like you're eating the same old thing.We love all kinds of lentils, from red to green, but black lentils are in a league of their own. These glistening, bead-like beauties are basically the caviar of legumes—they even look like it when cooked, which is why they’re also called beluga lentils. Black lentils are beloved  because they only need to be boiled for about 20-30 minutes until they’re tender yet toothsome, and they've got a thicker skin that helps them hold their shape better than red or green varieties. Plus they keep in the fridge for several days, making black lentils a true meal prep hero for vegetarians and omnivores alike.Where do I find them?Black lentils can be commonly found at Whole Foods, as well as online grocery sources like Amazon and Instacart. Keep an eye out in the bulk bin aisle at natural foods stores and South Asian grocers to stock up at a discount. Cooked black lentils are available in cans and some refrigerated aisles, but they’ll have a shorter shelf life than dry lentils. If you can’t get your hands on any black lentils, sub in green French ones, which hold their shape better than brown or red varieties.How do I use them?Black lentils are deliciously rich and earthy, and they can take on a wide range of flavors. Start building layers of flavor by simmering dry lentils in stock, or doctor up plain water with a halved onion, some crushed garlic, or a bundle of herbs. Once the lentils are tender, dress them with red wine vinegar or spices sizzled in ghee.  Try combinations like cumin, coriander, and mustard seeds, or red pepper flakes, lemon juice, and peanuts sautéed in olive oil.With a batch of cooked lentils prepped, you’re halfway to a world of seriously excellent dinners. Scatter them across a loaded sweet potato, replace whole grains for a sturdy legume-based dinner bowl, or use them to bulk up a leafy salad. Cooked black lentils can also be puréed, roasted, and otherwise repurposed into a wide array of savory snacks. Blend them into a creamy, herby dip or quickly marinate 'em in spiced vinegar and pair with crunchy vegetables to upgrade any crudités plate. The options are endless—well, at least until those lentils run out.Load up a sweet potato with lentils:Loaded Sweet PotatoesWe like to roast the sweet potatoes ahead of time then rewarm them by flattening and crisping them in a skillet until lightly charred.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanLentilPantry ObsessionLegumeRead MoreLifestyleThe 7 Healthyish Ingredients We're Going to Be Using Nonstop This YearGallery7 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-04", "author": ["Condé Nast", "Aliza Abarbanel"]}