{"id": "82cce9e3f6bc02de191625438f8de0cd", "url": "https://www.bonappetit.com/recipe/crispy-skin-salmon-with-miso-honey-sauce", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Crispy-Skin Salmon with Miso-Honey Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy-Skin Salmon with Miso-Honey SauceBy Lauren SchaeferNovember 4, 20184.6(84)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirEmailPinterestPrintEmailPinterestPrintQuick cooking, not-too-expensive, and super satisfying, salmon fillets are a weeknight dinner slam dunk—and our go-to method for making them is pretty much un-mess-up-able. The key is starting the fillets skin side down in a not-preheated cast iron skillet, cranking the heat, and letting the skin slowly render and crisp. (Kind of how we did in our recipe for Coconut-Curry Braised Chicken Thighs, remember?) This ensures that the flesh cooks gently (and mostly on one side), so that all it needs is a quick flip and another minute or so to get you to a perfect medium-rare. (Yeah, you really shouldn't be cooking your salmon all the way through.) And if you're not the kind of person who keeps miso paste on hand at all times, well, the salty-sweet sauce that goes with the fish is going to be the thing that changes your mind. It's the kind of umami-packed powerhouse ingredient that makes throw-together sauces taste like they took forever to make, and we like to add a dab to everything from soups and stews to marinades and salad dressings when we want a kick of salt and flavor. Cook up a proper pot of rice, and dinner is served.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketSpoon$24.69 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonWhisk$10 At AmazonSmall Skillet$40 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEACast Iron Skillet$30 At AmazonFish Spatula$14 At AmazonPlatter$29 At AmazonIngredients4 servings12\" piece fresh ginger2Tbsp. white miso1Tbsp. vegetable oil1Tbsp. unseasoned rice vinegar1Tbsp. honey1Tbsp. sesame seeds3scallions44–6-oz. skin-on salmon filletsKosher saltPreparationStep 1Start by assembling the honey-miso sauce: Peel 2\" piece ginger with a spoon. (We find that a spoon is better for navigating the bumpy exterior of a knob of ginger than a vegetable peeler, but you do you.) Finely grate ginger with a Microplane into a small bowl.Step 2Add 2 Tbsp. miso, 1 Tbsp. oil, 1 Tbsp. vinegar, 1 Tbsp. honey, and 1 Tbsp. water to the bowl with with the ginger. Whisk to combine and set aside. This is a great all-purpose sauce, so making extra wouldn't hurt! Use it to top grain bowls, roasted vegetables, or any other simply-cooked protein.Step 3Heat a small skillet over medium. Toast 1 Tbsp. sesame seeds, tossing frequently, until seeds are a light golden color and slightly fragrant, about 2 minutes. Seeds you toast yourself are always going to be more flavorful than the ones you buy already toasted, but we won't judge if you don't feel like going the extra mile.Step 4Trim the root ends from 3 scallions and thinly slice crosswise.Step 5Lightly season the flesh of 4 salmon fillets on all sides with salt. Place pieces skin side down in a cold—as in not preheated; you don't have to refrigerate it or anything—cast-iron skillet. (This might seem a little weird, but trust us—the skin will render nicely and get way more crispy this way.) Heat skillet over medium and let the salmon cook undisturbed for 5 minutes.Step 6Press down lightly on flesh with a spatula to ensure all parts of the skin are making contact with the pan. At this point it should be opaque at least halfway up the flesh side. Continue to cook skin side down until fish is mostly opaque and skin is crispy, about 5 minutes longer. If the skin is still sticking to the pan at this point, don't try to un-stick it—you'll know that it's ready to flip when it releases on its own.Step 7Using a fish spatula, gently flip the fillets, then remove the pan from the heat. Continue to cook off-heat (the pan will still be plenty hot) until flesh is juuuuuuuust cooked through, about 1 minute longer for regular-sized fillets, but very thick ones might take up to 3 minutes more—you can use a fork to flake the fish slightly to check for doneness; you're looking for the inside to be still a little pink and translucent.Step 8Spoon miso-honey sauce onto a platter. Place salmon fillets skin side up on top of the sauce. Sprinkle with toasted sesame seeds and scallions. Et voila! Dinner is served.How would you rate Crispy-Skin Salmon with Miso-Honey Sauce?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangleThis is my new go-to! I didn’t make the sauce, just used the cooking method and the salmon was amazing!!!AnonymousAustin, Tx1/10/2022Didn’t work. Salmon was not cooked. Anonymous1/9/202210/10 recipe. This is the only way I’ll make salmon moving forward. Incredible! AnonymousColumbus, OH12/28/2021One of my favorite methods of cooking salmon.  And I love the Sauce! I Mae double!Deb OlsonWadsworth, IL11/25/2021This is a fantastic salmon recipe - yields perfect, restaurant-crisp skin every time. The sauce wasn’t my favorite, but we keep coming back to this page for the salmon alone! ClaireLos Angeles11/17/2021I can't eat salmon without this wonderful sauce. My daughter makes the sauce and my husband the salmon and I eat it.  Always special.\nThanksLindaDallas, TX5/30/2021The sauce was a problem for me: The miso flavor overpowered every other taste/ingredient. Way too strong. Full disclosure: My ginger was frozen (by me), but seemed fine as I grated it. The miso was in my fridge for months...but I don't think it goes bad. It was hard to mush into a tablespoon measure. Is it possible I used too much?  First I strained finished sauce to get out lumps of miso; next I added a bit more honey; next I added a splash of warm water (my sauce was thicker and darker than in the video). Ok, then I felt desperate and added a tsp of sesame oil. The sauce is okie doke now. But not what others have raved about. I haven't cooked the fish yet; but will follow directions to the letter and hope the mix of salmon and sauce brings the magic together.  Kirsten Lagatree074245/16/2021This recipe was delicious, however my skin came out overcooked and charred on two of my thicker filets. I went by the recommendation in comments to flip when they were cooked 75% of the way up. For me, this took 20ish minutes and the skin started to smoke which prompted me to flip; unfortunately they were burnt at the thicker ends. Next time I'll stick to the recipe and begin checking for the skin releasing after10 minutes regardless of opaqueness, and finish on the flesh side. The parts that were golden were delicious though after pulling at 130ish in thickest part. The sauce is awesome and I'll definitely be trying again.JBDana Point, CA4/9/2021The sauce was fantastic and the skin was delicious. Just be careful with the cooking time. I'm a COMPLETE beginner and the salmon did not cook all the way through, mostly because the fillets were uneven in density. The comment below re: waiting until the salmon is 75% light pink all the way up is important. I only noticed that the fish was undercooked once I placed it on the sauce, so I had to put it back in the pan and it never cooked as well as I expected it to.AnonymousNew York, NY3/2/2021I'm speechless. This recipe is utter perfection! The crispy skin is honestly mind-blowing. \n\nI actually managed to nail this recipe using a stainless steel pan and the 'start from cold' method. I added in a very small drizzle of neutral oil around the edges of the fish once I had laid it down, and had no issues with the skin sticking. It released nicely from the pan once it was ready! EmmaToronto, Ontario, Canada2/18/2021Yup. This was great. I was suspect. But it turned out perfect! Was easy and quick to cook. Robbin RaeLos Angeles, CA1/29/2021The miso sauce is amazing, just be sure not to skimp on the fresh ginger. Also this method of cooking salmon is absolutely foolproof. Flip the filets over when they're white about 75% of the way up, turn the oven off. Don't worry, the fish won't be raw! The dish is great wish a side of soba noodles :)RoseBrooklyn, NY1/21/2021This method for cooking salmon in a cold cast iron pan has changed my life. Won’t do it any other way. Crispy skin, not overcooked or dry. Miso sauce is also 💯 on anything. Caitlin0Brooklyn, NY9/15/2020A fish recipe so easy a non-fish cooker (I guess not anymore...) can cook! Verified weeknight dinner status too.ALeeksmaToronto, Ontario8/15/2020I made this recipe and my boyfriend absolutely loved it (I did too, for the record). Perfectly crispy skin and the miso honey glaze is addictive.Hilary AdamsFairfax, VA8/6/2020Explore Bon AppétitSalmonFishSeafoodMisoCondiments, Sauces & PastesGingerHerbs & SpicesEasyQuickWeeknight MealsMainDairy-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-04", "author": ["Condé Nast", "Lauren Schaefer"]}