{"id": "82cce7e7aa59652f10aad6e8d004db62", "url": "https://www.bonappetit.com/story/yishi-taro-oatmeal", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Oatmeal Is Boring, But This Taro Bubble Tea Oatmeal Is Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOatmeal Is Boring, But This Taro Bubble Tea Oatmeal Is EverythingIt's sweet, nutty, and \"functional,\" and I can't get enough.By Alex BeggsJuly 16, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I never have the same thing for breakfast two days in a row. I have a short attention span and a need for novelty (today was toast with mackerel, yesterday was fried bulgur with turkey bacon, wow). So when the PR team behind Yishi’s Taro Bubble Tea Oatmeal was like, do you want to try these new ~functional~ oats, I was like, YES.And I’m glad I did, because it’s delicious. The base is a combination of organic gluten-free oats, flax and hemp seeds, and almonds, all ground to a sandy powder that makes the texture of the oatmeal creamy and able to cook quickly. There’s some crunch from the seeds, but I add extra chia seeds for even more protein and texture.In the taro version, there’s powdered black tea (which helps you focus/stay alert because you’re, well, caffeinated), powdered taro root, blueberry powder (antioxidants), powdered coconut milk, and stevia extract, so everything is officially plant-based. It’s sweet, nutty, and earthy thanks to the taro. If you’re already a taro lover, you don’t need convincing. You’ve wanted this all along.Because it’s mid-July, I like to make it as overnight oats, but you can also pour hot water over it, stir, wait a few minutes, and eat. Sometimes I cheat the “overnight” part and stir it together an hour before eating—though it has a slight powdery texture when you do that because the ingredients haven’t had time to dissolve. Impatient me doesn’t care!However, there’s no boba in the oatmeal. Founder Lin Jiang realized it just couldn’t work. “I actually tried it in my kitchen with dried, quick-cooking tapioca pearls,” she told me via email. “It didn’t cook that quickly, and in the meantime, I had to add a lot to the recipe to make them noticeable, and that added a lot of carbs on paper.” (Yishi is aiming to be lower in carbs, with more nutrient-dense ingredients than your usual brown sugar-cinnamon stuff.) But the flavor is so reminiscent of bubble tea, I’m happy.Yishi also makes a Matcha Latte flavor that I love topped with strawberries, Sweet Osmanthus (great with blueberries or bananas), Toasted Black Sesame (I didn’t get to try but sounds amazing), and Red Bean Berry (ditto). They’re all inspired by Lin’s mom’s black sesame cereal:“My mom would grind black sesame, black soy, walnut, almond and mix them up with some sort of grain like rice or barley because oats were not common in China when I was little,” said Lin, who grew up in Qingdao. “She would cook them into a warm bowl of black sesame cereal that’s sweet, toasty, and nutty. It was my favorite food growing up and later on I realized that it was also so nutritious.”Buy the pouch for a good $deal$, or pick up a pack of the individual cups if you’re stashing them at your desk or in your camping box. They’re also selling little sample pouches if you’re on the fence.Photograph by Emma FishmanYishi Taro Bubble Tea Oatmeal$8 at Amazon$8 at Yishi FoodsExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-16", "author": ["Condé Nast", "Alex Beggs"]}