{"id": "82e7a6f377376a99a89764c5c77032f6", "url": "https://www.bonappetit.com/story/why-is-salting-eggplant-a-thing", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Why Is Salting Eggplant a Thing? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Is Salting Eggplant a Thing?Is this a useless piece of tradition passed down from generation to generation? Or are we doing this for a reason?By Alex DelanyAugust 8, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailIf you want to know why salting eggplants is a thing, you have to care about history. Welllllll, that’s not totally true. You just have to care about the history of the eggplant—the Treaty of Ghent and the Jurassic Period and the Industrial Revolution are kind of irrelevant in this situation. The thing is, we salt sliced eggplant before cooking because of what the vegetable used to be like. Confused? Allow us to explain.The first time someone ever cooked an eggplant, it was a much different vegetable than the one we're familiar with. Sure, the shape and color and size were probably different than the eggplants we eat now, but the most noticeable difference was the flavor. Once upon a time, eggplants tasted incredibly bitter, and salting them before cooking helped to draw out and eliminate some of that astringency. But things have changed.These days, that overwhelming bitterness has been bred out of eggplants. You might still catch a hint of it every once in a while, but for the most part, the eggplants we know today don’t need the same kind of help mellowing out. Which, as you have probably gathered, means we don’t have to salt eggplants in order to get rid of bitterness because, well, there isn't that much to get rid of. Fun!So, are there any other reasons to salt eggplants? Well, besides the fact that someone’s great grandparent told us to do it, we sometimes salt eggplants to help remove some of the excess moisture that's trapped in the vegetable. Generally speaking, when we apply heat to raw ingredients—be it a vegetable, piece of bread, or slab of meat—we're hoping to get water out of something, thus concentrating its flavor. Salting the cut side of an eggplant before you cook it helps draw out water—we won’t go into the specific science, but it involves words like “osmosis” and “ions”—and jump starts that process. Not only that, it helps to season the eggplant from the inside out, which means the creamy interior will taste every bit as delicious as the browned, caramelized exterior that you sprinkled with salt right before cooking.We can guarantee these eggplants aren't gross. Because we salted them.\nPhoto by Caleb AdamsThis is all to say: Salting eggplant is a good idea, but isn't strictly necessary in the way that it once was many generations ago. Rushing to get your stuffed eggplant dinner on the table before your friends walk through the door? We officially give you permission to go ahead and skip that step. Have a bit more time on your hands and want to go the extra mile? Just do it! Whether you're working with slices or chunks, all you have to do is generously season the exposed areas of the eggplant with kosher salt, and place them on a plate or sheet pan lined with paper towels to help soak up the moisture that comes out. And if you really want to go the extra-extra mile, you can arrange the salted pieces on a paper towel-lined baking sheet, place another layer of paper towels over them, and place another baking sheet over top, and weigh that down with a few heavy cans from the cupboard. That’s professional caliber stuff. The extra weight will force more moisture from the eggplant, and the paper towels will absorb it quickly. Bingo. Bango.You might still be thinking, Ugh, history is boring. And that’s fine. You don’t have to care. But while you’re over there, content in your apathy, we’ll be sitting over here, eating eggplant Parm and eggplant stir fry and stuffed eggplants that are as meaty and delicious as they possibly can be.About that stuffed eggplant...Stuffed Eggplant with Crispy BeefCustardy eggplant, sweet-tart pomegranate, creamy garlic yogurt, and crispy beef—eggplant naysayers, we're coming for you.View RecipeExplore Bon AppétitBasicallyEggplantSaltRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-08", "author": ["Condé Nast", "Alex Delany"]}