{"id": "82e911634605084d20d7e0b4a75979e1", "url": "https://www.bonappetit.com/story/melamine-plates", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Melamine Plates Are the Take-Anywhere Plates I'm Using Instead of Disposables | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Take-Anywhere Plates I’m Using Instead of DisposablesThey’re beautiful. They’re practical. They come in designs with FLAMINGOS.By Sarah JampelJuly 1, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I may have a…how should I say it…small ceramics “problem.” Let’s just say that I had to buy an additional shelving unit to house all of my second-tier dinnerware when my collection got a little unwieldy. But my loyalty to stacks and stacks of heavy, hand-thrown plates and shallow bowls is tested in the summertime, when I’m eating outside as much as possible and I turn to melamine plates.I love melamine plates for two primary reasons. The first is an intellectual affair: Because melamine plates are lightweight and virtually indestructible, I can quite literally throw a few into a beach bag or park bag or carry-on (why not!) without fear of them chipping or cracking or weighing me down. And because they’re relatively inexpensive, even if one were to get damaged in some sort of freak accident, I wouldn’t be too devastated.These John Derian plates are our creative director Michele Outland's favorite.\nPhoto by Chelsie CraigThe second reason I love melamine is a matter of the heart: They come in such fun designs. They’re covered in the sort of bold, busy, and outright loud patterns and colors that my meek self would never commit to for my everyday table settings but can gladly embrace in the season where people wear blindingly white pants and drink neon cocktails. Look at the flamingos!For their practicality and their beauty, melamine plates have replaced disposable ones in situations where I might, in the past, have turned to paper or plastic (shame on me!). Even when I’m not dining (a.k.a. eating) outdoors, I still use my melamine plates when I’m feeling whimsical or hosting a friend (or toddler) who I don’t exactly trust with the nice ceramics. (Just kidding—I’d never do that.)Buy them:Femke Zwaan Bamboo Melamine Dinner Plate, $14 at AnthropologieCamp Melamine Blue Speckle Dessert Plates (set of 6), $50 at Food52Fête Melamine Dinnerware, from $28 at Food52Floral Print Melamine Plates (set of 4), $68 at Food52John Derian Melamine Rose Plates, $9 at John DerianAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingPicnicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-01", "author": ["Condé Nast", "Sarah Jampel"]}