{"id": "82efdeae994446bffae966661cadd4c7", "url": "https://www.bonappetit.com/recipe/bas-best-carrot-cake", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "BA’s Best Carrot Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2016 IssueBA’s Best Carrot CakeBy Claire SaffitzPhotography by Alex LauMarch 8, 20224.2(85)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintCarrot cake may be one hotly contested dessert, but we can all agree that the best carrot cake recipes turn out moist layers that are warmly (but not overly) spiced. Ideally, those layers should be studded with a few choice ingredients to keep the texture interesting; and they must be hidden under a layer of cream cheese frosting so thick someone might mistake the dessert for a cheesecake.To achieve our dream carrot cake, we stripped the dessert of all nonessential ingredients. Crushed pineapple? Gone. Coconut? No more. The two add-ins we left in the mixing bowl: golden raisins and toasted walnuts. Plumped with rum, the raisins add pops of juicy sweet flavor throughout the layer cake. Strongly anti-raisin? Leave them out if you must. We found the walnuts key, however, for the texture they add to the tender crumb (pecans make a worthy substitute).We streamlined the spices, too, but turned up the volume on each for maximum impact without muddied flavors. Cinnamon and ground ginger take the lead (2 teaspoons each), while a whisper of nutmeg (just ½ teaspoon) adds woodsy, floral balance that beautifully complements the earthy sweet carrots. When selecting your carrots, opt for medium-size ones (larger carrots can be starchy and bland) and shred them on the small holes of a box grater or with the grating disc of a food processor—large shreds of grated carrot may not soften adequately in the time it takes the layers to bake.Editor’s note: This recipe was originally published in our May 2016 issue.Ingredients12  ServingsCakeNonstick vegetable oil spray½cup golden raisins (optional)3tablespoons dark rum (optional)1cup chopped walnuts1pound carrots, peeled, coarsely grated1cup buttermilk, room temperature2½cups all-purpose flour2teaspoons ground cinnamon2teaspoons ground ginger½teaspoon freshly grated nutmeg2teaspoons baking powder1½teaspoons kosher salt¾teaspoon baking soda4large eggs, room temperature1cup granulated sugar¾cup (packed) dark brown sugar2teaspoons vanilla extract¾cup vegetable oilFrosting and assembly12ounces cream cheese, room temperature¾cup (1½ sticks) unsalted butter, room temperature1teaspoon vanilla extractGenerous pinch of kosher salt4cups powdered sugarCandied Carrot Coins (optional)PreparationCakeStep 1Preheat oven to 350°. Lightly coat two 9\"-diameter cake pans with nonstick spray. Line bottoms with parchment paper rounds; lightly coat rounds with nonstick spray. If using raisins and rum, heat together in a small saucepan over low just until warm, about 2 minutes. Remove from heat and let sit until liquid is absorbed and raisins are plump, 15–20 minutes.Step 2Meanwhile, toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes; let cool. Combine carrots and buttermilk in a medium bowl.Step 3Whisk flour, cinnamon, ginger, nutmeg, baking powder, salt, and baking soda in a large bowl. Using an electric mixer on high speed, beat eggs, granulated sugar, brown sugar, and vanilla extract until pale and thick, about 4 minutes. Reduce speed to medium-low and gradually stream in oil. Add dry ingredients in 3 additions, alternating with carrot mixture in 2 additions, beginning and ending with dry ingredients; mix until smooth. Fold in raisins, if using, and walnuts with a rubber spatula. Scrape batter into prepared pans.Step 4Bake cakes, rotating pans halfway through, until a tester inserted into the center comes out clean, 35–45 minutes. Transfer pans to a wire rack and let cakes cool 10 minutes. Run a knife around sides of cakes and invert onto wire rack; remove parchment. Let cool completely.Frosting and assemblyStep 5Using an electric mixer on high speed, beat cream cheese and butter in a medium bowl until smooth, about 1 minute. Beat in vanilla extract and salt. Reduce speed to low and gradually mix in powdered sugar. Increase speed to high and beat frosting until light and fluffy, about 2 minutes.Step 6Place 1 cake, domed side down, on a platter. Spread ¾ cup frosting evenly over top. Place remaining cake, domed side down, on top. Spread top and sides with 1¼ cups frosting and chill 30 minutes to let frosting set. Spread remaining frosting over top and sides, swirling decoratively. Top with Candied Carrot Coins, if desired.Nutrition Per ServingCalories (kcal) 810 Fat (g) 44 Saturated Fat (g) 16 Cholesterol (mg) 125 Carbohydrates (g) 100 Dietary Fiber (g) 3 Total Sugars (g) 75 Protein (g) 9 Sodium (mg) 600How would you rate BA’s Best Carrot Cake?Leave a ReviewTell us what you thinkReviews (54)Back to TopTriangleFollowed the recipe, made a batch of muffins and a cake. But after rising nicely in the oven, they punctured like a balloon, became flat and rubbery.  Threw all of it in the bin, which I never do. Sorry.AnonymousSweden2/25/2022Light and delicious! I made it in a 9 x 13  pan.\nBut, um, I didn’t add the buttermilk: you forgot to include it in the procedure for mixing the liquid portion.\nI suspect it would have been a little heavier with the buttermilk.\nWill try your recipe again!Roger CarrotWinnipeg1/17/2022The cake was moist and flavorful. The cream cheese frosting didn't work at all. It was much too sweet and too thick to whip properly--it kept getting stuck on and climbing the mixer blades, though I followed the instructions to a T. I'd make this again but use a different frosting recipe.Tia S.Washington, DC11/11/2021This came turned out absolutely delicious! Loved the addition of nuts into the cake as well as the spices. Like most American desserts I knew I had to cut down the amount of sugar - with that adjustment it was absolutely delicious. I also used 1/2 whole wheat and 1/2 all purpose flour. Super moist- will definitely make it again. On a side note why do American recipes always have so much sugar? AnonymousPortugal 10/1/2021I have made this carrot cake twice now, both times for my husbands birthday. We love it so much I'll probably never go looking for another! I followed it exactly except for omitting the walnuts with beautiful results.. including the carrot coins :) \nWe love the cream cheese icing but have also made it with buttercream icing which is equally delicious. ms maryTulsa, Oklahoma4/9/2021So obsessed with this recipe! I halved the recipe, made it in a loaf pan, and skipped the icing. I also added HELLA more walnuts and cut down the sugar slightly after reading the comments. Next time I skip the icing I think I'll use all the sugar in the recipe to make it more sweet.AnonymousWashington, DC11/29/2020While the cake itself was excellent, I cut the sugar A LOT and it was still pretty sweet. I kept the cup of white sugar and ditched the brown sugar. Of course, I'm aware that American recipes are usually awfully sweet, so if it looks like too much sugar, it is. I didn't add the walnuts to the cake, as that speaks to me more of a bread than a cake, but the raisins were a lovely, yummy touch. There seemed to be an unusual amount of cake batter at the end, and it was - I filled two cake tins and then filled nine cups of a muffin tin as well. The frosting was also way too much, and I was glad I'd only put in ca. 3 cups instead of four of the confectioner's sugar. As I don't want to be making nine extra cupcakes whenever I bake a cake, I'll look for and try out a smaller recipe. ThorunnReykjavík, Iceland11/16/2020This was delicious!! Wow the cake itself was so moist and I could eat the cream cheese frosting with a spoon. I didn't use the rum and golden raisins but this cake was incredible without it. A must eat/bake!Veronica Montreal11/8/2020Delicious. I cut all the sugars in half and it was great. Pretty sure this counts as a vegetable :)AnonymousMaryland6/25/2020This is definetly a good carrot cake recipe, and is very feasable to whatever changes you may need to make. I didnt have buttermilk, so I just added a milk and lemon mixture. I also didnt have any ginger, or nutmeg so i just doubled the amount of cinnamon, and it still turned out pretty good. The cream cheese frosting wasnt the best, it was a bit too sweet for my liking, but im sure this can be fixed by adding less of the sugar. I also beat this with my hand mixer rather than the reccomended stand mixer, and it wasnt hard to do at all! I would reccomend if you like \\t carrot cake!Lucia CWisconsin6/21/2020I've never made carrot cake (or any cake, successfully)  before, but this recipe turned out exactly as I'd hoped. I used dates instead of raisins, a bit of cardamom, and about 1/4 of chopped candied ginger.  The cake itself cools to be perfectly level, which I appreciate. It is a dense & moist cake.  I fed it to three different carrot cake lovers, 2/3 thought it was fantastic, the last one preferred fluffier cake but still thought it pretty good. roofbatSan Francisco6/12/2020I tend to reduce the amount of sugar and tweak certain ingredients in recipes but this one is just perfect as it is! By far my family and friends' favourite! Thank you for the lovely recipe. For all that have yet to try, try it, it's amazing!Anonymoussingapore6/10/2020This recipe suggests America has free health care. \nUsually cooking more on the healthy side, I thought I’d give this a try as a treat, but it didn’t end up being enjoyable. Definitely too sweet, the frosting way to heavy. The texture came out kind of rubbery but improved over night. \nI liked the soaked raisins and selection of spices and will work them into future recipes. AnonymousGermany6/7/2020eh. like two other reviewers, i found this cake to be strangely gummy, dense, and bland despite following the steps to a T. Anonymous6/7/2020Absoloutely INCREDIBLE! It was the *perfect* carrot cake. Just a note for further recipes, it would be really great if the ingredients were also in grams, especially for things like walnuts and raisins.AnonymousSouth Africa6/1/2020Explore Bon AppétitCakeDessertCarrotVegetableRaisinDried FruitFruitCream CheeseCheeseButtermilkOther IngredientsBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-04-19", "author": ["Condé Nast", "Claire Saffitz", "Alex Lau"]}