{"id": "82f694cebe774859e44dfc2f9f642e5b", "url": "https://www.bonappetit.com/story/magna-kusina-sisig", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "The Key to Supernaturally Creamy Sisig at Magna Kusina? A Little Thing Called “Pork Mayo” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Key to Supernaturally Creamy Sisig? A Little Thing Called “Pork Mayo”At Portland, Oregon’s Magna Kusina, chef Carlos Lamagna will show you the light.By Hilary CadiganFebruary 24, 2020FacebookTwitterEmailPhoto by Dina AvilaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Ask chef Carlo Lamagna what’s in the sisig at Magna Kusina, his homey new Filipino restaurant in Portland, Oregon, and he’ll point to the rather cryptic menu description: “pork bits, egg, chile.”Push him further and he’ll tell you that it’s Filipino headcheese: all the edible parts of a pig—roasted, simmered, and hand-chopped. “When I was living in the Philippines, I used to go hang out at bars and clubs at a young age—don't ask—and this was a very common dish served alongside a cold beer,” he says. “Some cultures have bar snacks. Filipinos tend to take it to the next level.” Once he became a cook, he consulted with some friends from Pampanga, where sisig originates, to come up with the perfect recipe.“But which parts of the pig, exactly?” you’ll persist.He’ll wait, watching you pierce the golden egg yolk so it flows over that crispy-fatty meat melange and melts like hot butter on your tongue. Only then, as you’re leaning back against your chair with silent satisfaction, will he divulge: The secret is what he calls pork mayo, a.k.a. poached pig brain. Chile-laced, soy-salted, and supernaturally creamy, it transforms an already rich dish into something otherworldly. But by this time you’re too busy mopping it up with sticky rice to ask any more questions.Go there: Magna KusinaRead MorerestaurantsI’ll Always Save Room For This Flaky Malaysian RotiBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Hilary Cadigan"]}