{"id": "82f700f42a913c09352ac481507aaf4b", "url": "https://www.bonappetit.com/recipe/salmon-tacos-with-pineapple-chile-salsa", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Salmon Tacos With Pineapple-Chile Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueSalmon Tacos With Pineapple-Chile SalsaBy Christina ChaeyJanuary 4, 20224.8(25)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe ginger-garlic paste that gives this salmon a caramelized coating was directly inspired by Chai Pani chef Meherwan Irani, who uses the South Asian staple as the batter for his crispy masala fish. You can also use it as a marinade for chicken or a base rub for braised meats or add a spoonful to a mirepoix.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonMini Tongs$20 At Williams-SonomaMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonIngredients4 servings12\" piece ginger, peeled, finely grated2garlic cloves, finely grated2tsp. New Mexico or Kashmiri chile powder1tsp. ground coriander1tsp. ground cumin4Tbsp. fresh lime juice, divided3Tbsp. grapeseed or vegetable oil, divided1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more11½-lb. skinless, boneless salmon \tfillet, cut into 2\" pieces½small red onion, finely chopped2serrano chiles, finely chopped2cups chopped pineapple (from about ½ medium pineapple)½cup chopped cilantro, plus leaves for servingLime wedges and toasted corn tortillas (for serving)PreparationStep 1Stir together ginger, garlic, chile powder, coriander, cumin, 2 Tbsp. lime juice, 1 Tbsp. oil, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a medium bowl to create a paste. Add salmon to bowl and toss until evenly coated. Let salmon sit at room temperature 15 minutes to marinate.Step 2Meanwhile, mix red onion, chiles, pineapple, ½ cup cilantro, and remaining 2 Tbsp. lime juice in a medium bowl to combine; season with salt. Set pineapple-chile salsa aside.Step 3Heat remaining 2 Tbsp. oil in a large nonstick skillet over medium-high. Add salmon and reduce heat to medium. Cook, undisturbed, until opaque all the way through and a browned crust forms underneath, about 5 minutes. Turn over and cook until second side is browned and flesh easily flakes with a fork, about 3 minutes. Transfer salmon to a plate and flake into large pieces with a fork; squeeze a couple of lime wedges over.Step 4Serve salmon with pineapple salsa, cilantro, tortillas, and more lime wedges to build tacos.How would you rate Salmon Tacos With Pineapple-Chile Salsa?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSo...... Swapped tortillas for a quinoa base, served the crispy marinated salmon on top, poured greek yogurt & lime mixture, garnished with the salsa, swapped pineapple for tomatoes and cucumbers added roasted corn, avo and green onions. It. Was. Bomb! And healthyish!Daniela V.Mexico City, MX3/8/2022Delicious and easy enough for a weeknight dinner. Made twice in one week!Jamie Australia1/31/2022Fantastic and easy! This recipe was quick to put together and incredibly tasty. The heat from the salmon marinade didn’t come through and the heat from the chiles in the salsa was mild once put together in the taco. I would highly recommend! AshMonroe, WA1/19/2022Delicious! Easy and fantastic.AnonymousToronto, ON1/10/2022Put this one together without the Chilies.  Still had awesome flavor and easy to prepare.  There were no left overs.  Chef ScottKissimmee, Florida1/7/2022This was delicious and just what we wanted for dinner!  So easy to prep and flavourful, nice that the fish isn’t breaded .  You really get to taste all of the components. I’m still in search for a good tortilla  brand but thats the only item I need to change up.MarnieErin, ON1/7/2022Explore Bon AppétitDinnerMainQuickEasyWeeknightHealthyishGluten-FreeDairy-FreeNut-FreeTacoPineappleFruitSalmonFishSeafoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}