{"id": "82feee1cd20e33899f96ba36407f22b4", "url": "https://www.bonappetit.com/city-guides/montreal/venue/au-pied-de-cochon", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Au Pied de Cochon Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealAu Pied de CochonGet your fill of foie gras and other Quebecois luxuries at this Plateau legendFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: because Au Pied de Cochon is a temple of excess. Chef Martin Picard put Quebecois food on the map, and his nephew now runs the kitchen, but the near-religious devotion to gluttony still remains.ORDER THE: tender duck magret, bechamel-covered tomato tart, lobster poutine (because if you must have poutine, this is the place), and the iconic Plogue à Champlain, a buckwheat pancake layered with melted cheese, roasted potatoes, bacon, and a quivering slab of seared foie gras finished off with a drizzle of maple syrup. For foie gras lovers, this is the top of the mountain: There’s a whole section devoted to it on the menu, and some of the perfectly cooked lobes are so large they can be carved like a roast.THE VIBE IS: fun and lively, but with many diners focused on the serious food and wine, the decibel level stays reasonable. The staff is hospitable, knowledgeable, and proud to show off their native cuisine—keep an eye out for adept waiters nimbly preparing dishes tableside.PRACTICAL STUFF: Open Wednesday to Sunday 5 p.m. to midnight. Closed Mondays and Tuesdays. Reservations recommended: For small parties of three or fewer, try to snag seats at the bar for a view into the kitchen. For larger parties, you’re better off taking the table in the back adjacent to the wine cellar with drying hams hanging among the bottles.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEL’ExpressWhen you want the French bistro classics, you go to this Plateau institutionPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauSchwartz’sA must-visit sandwich institution still slinging smoked meat in the PlateauExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}