{"id": "831a49caa7e9d54b96e48ef6c276e35d", "url": "https://www.bonappetit.com/story/chimichurri-and-cow-tales", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "How to Cover Your Tracks with Chimichurri | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cover Your Tracks with ChimichurriRead about it in senior editor Alex Beggs’ weekly newsletter.By Alex BeggsAugust 6, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior editor Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Ch-ch-ch-chimichurriSo much better than a Chia Pet. We had an “analytics” meeting this week and discovered that one of the most popular recipes on the site that readers find through Google is this classic chimichurri sauce. I have big plans to make it this weekend to accompany all of these steaks my great aunt froze that are currently thawing just for me. Family! We’re going to grill them and douse in this parsley-packed chimichurri because I have no idea how long they’ve been in that freezer.Want this letter before it hits the website? Sign up for our newsletter!Photo by Peden + MunkTime’s running OUT!This is the time of late summer we all feel a sudden urge to cook like crazy. Produce comes and goes so fast you wonder if you really ate enough rhubarb (you didn’t). This roundup of the staff’s summer bucket list recipes got me extra intrigued about these grilled clams—cooked in a cast iron on the grill with a brothy tomato sauce to dip (grilled) bread in. See the whole bucket list here.Speaking of overripe produce on your counterDid you see this launch this week?Via PaneraWhat is this?Panera announced a Double Bread Bowl option for Philly locations and it makes me want to punch my fists into the warm soup and wear it as a muff.A must-read interviewWith cookbook author Virginia Willis:“I don’t want people to look at the news and see those angry faces and Dixie flags in Charlottesville, Virginia and think everyone in the south is like that. I know this is a cookbook, but this cookbook is the way I can express that.”Claire’s biggest successRecreating Oreos—to a T. She did it! The journey is something to behold. Watching Claire succeed fills my heart with warmth and joy, or maybe that’s all the Oreos in my arteries. There’s a cameo in the episode of our beloved mail manager, Gary, who has to deliver packages of dairy-free cashewgurt and other bulky press mail day-in and day-out and yet he’s never not smiling. Gary tried to avoid the camera, but they came right toward him. “It tasted just like the real thing,” he told me. Watch it here.SURPRISE MAILThen Gary had a surprise package for me. A secret admirer sent me a bulk box of 36 Cow Tales, my favorite candy ever. They’re long, soft caramel tails with a cream filling that dissolves in your mouth as you chew chew chew like a cow in deep thought. This is the BEST DAY OF MY LIFE.What’s up, unnecessary food feud of the weekChicken butts. An unnamed staffer confessed that she hard-boiled some eggs in the same pot she was making lentils. “Is that okay?” She asked. “Or is it gross because the egg...came out of the chicken’s....” Cloaca. That’s the hole the egg (and everything else, sorry to inform you) comes out of. And sure, it might land in some coop poop but I’m sure it’s cleaned off by the time it gets to your kitchen, plus just rinse it?! Everyone agreed that multitasking boiling eggs while cooking other things is fine. It’s FINE. We didn’t really feud over this so much as spend 11 minutes talking about chicken butts. Just look what MyPetChicken.com has to say!Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-06", "author": ["Condé Nast", "Alex Beggs"]}