{"id": "8339b10340c92aaca3a3e7550edee634", "url": "https://www.bonappetit.com/story/whats-for-dinner-omelet", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "This Omelet Solves Your “What’s For Dinner?” Problem Once and For All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Omelet Solves Your “What’s For Dinner?” Problem Once and For AllAll you need is eggs, ricotta, bacon, mushrooms—and about 15 minutes.By Carla Lalli MusicFebruary 28, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The problem with standing up most of the day cooking food for other people to taste, and tasting food that other people have cooked, is that when I get home I don’t always feel like cooking. But a girl’s gotta eat! Even with my job in the Bon Appétit Test Kitchen, I still have the “what’s for dinner?” problem.The answer, as always, is eggs. Eggs are everything: they’re inexpensive, high in protein, tasty sweet or savory, and done in minutes. They are a perfect, whole food, they are filling, and they are our heroes. Yes, we eat them in the morning. But since everyone likes saying “breakfast for dinner,” I would like you to make a folded, stuffed, and loaded omelet tonight.Want this letter before it hits the website? Sign up for our newsletter!Selling point No. 1 one: Bacon is involved. Cooking bacon is the first step in the recipe, and when you set those crisped-up pieces aside, you use the rendered fat left in the pan to cook some chopped mushrooms. Salty, crunchy, earthy, and bouncy: Mushrooms and bacon are a power duo, two culinary greats with a lot of love for each other.Photo by Ted CavanaughSelling point No. 2: Ricotta is on the scene. When I was developing this recipe, I wanted to add something cheesy and melty in the omelet’s center, ideally something that would soften even when subjected to the moderate heat of softly cooked eggs. I originally looked to cream cheese to find some ooze, but it cooled things down too much and stayed pretty firm. I then switched to ricotta, folding it into the cooked mushrooms, along with some Parmesan, which created a creamy, slightly salty, savory filling that surrenders blissfully when warmed.Selling point No. 3: the eggs make the meal. For dinner, I wanted the heft of a three-egg omelet, but I didn’t want to go to the trouble of making two omelets, one after the other. Even though they’re quick to cook, someone will get a not-quite-hot omelet, and I don’t want that someone to be me. So I devised this monster of a six-egg omelet that can be cut in half, since by now my husband has certainly arrived home from work and he’d love to get in on some dinner action, “if you’re making!” To make this omelet-for-two, the heat is moderate, and the mixing is swift. As soon as the underside is set and large curds form, the ricotta-mushroom mixture is spooned on top, then the still-crisp bacon. Instead of rolling, which is cumbersome and annoying to do, fold this omelet in half like a taco before sliding right out of the skillet and cutting it in half. If it were my A.M. meal, some buttered toast would be just the thing. But to make this more dinner-ish, it’s paired with some tender lettuces and herbs that have been dressed with a simple vinaigrette.One pan, four strips of bacon, a handful of mushrooms, six eggs, some ricotta. It doesn’t sound like much, but 15 minutes later, it adds up to dinner.Get the recipe:Omelet With Bacon, Mushrooms, and RicottaDon’t sweat rolling this into a perfect omelet; just top the cooked eggs with mushrooms and ricotta, and fold like a taco.View RecipeExplore Bon AppétitCarla NewsletterOmeletRead MorecookingWhen Life Gives You Avocados, Make WaterBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-28", "author": ["Condé Nast", "Carla Lalli Music"]}