{"id": "8364032f8a6b4dbbfe7fc2d96a52eb6d", "url": "https://www.bonappetit.com/story/celebrity-cooking-videos", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Watching Celebrities Cook Is the Only Thing Calming Me Down Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWatching Celebrities Cook Is the Only Thing Calming Me Down Right NowOur favorite stars—just like us!—are fumbling around in the kitchen.By Marian BullApril 1, 2020FacebookTwitterEmailIllustration by Zak TebbalFacebookTwitterEmailI’m currently on Day 14 of quarantine, and all my house rules have gone out the window. I make my bed only when I want to, do work on whatever soft surface feels most appealing. Most notably, I’ve become as lax about my own screen time as I imagine desperate parents around the country have become about their childrens’.Which is how I came to spend at least half an hour the other day watching Florence Pugh talk about soup into a front-facing camera, sticking a chef’s knife into roasted hunks of butternut squash, extolling the virtues of chorizo (which she pronounces the Castilian way, choritho), and sipping from a large glass of white wine while the sun was still up.Celebrities, I’ve learned through this experience, are “just like us!” in at least one crucial way: They, too, are going insane. And while we’re used to seeing celebrities broadcast every inch of their lives—I’ve watched Busy Phillips exercise more times than I can count—seeing them in the kitchen is, for the most part, new. It’s adorable and reassuring and almost obvious that we should all choose the same outlet right now: cooking.These people, in their multiple-bathroom houses, need something to do, some way to perform, and a phone in the kitchen provides that. Which is why we have Mindy Kaling making “cakey, dense” chocolate chip cookies (a genre I didn’t know people liked), and Natalie Portman awkwardly chopping beets. Amid a sea of professional chefs extolling the virtues of dried beans, and (very helpful!) food websites soothing me with endless slideshows of glazed meats, the at-home celebrity cooking video has quickly become the most entertaining form of quarantine food media I’ve seen.Charli XCX, queen of bops, has also taken to her kitchen amid workout sessions from Diplo and chats with Rita Ora broadcasted over Instagram Live. Charli, bare-faced and messy-haired, peels carrots very much not like a professional, makes no claims about connoisseurship, and seems to be doing this to share her “technique” as much as to keep herself sane.As she cooks, we see the stacks of Annie’s Mac and Cheese behind her, her incredibly regular plastic cutting board, her imperfect knife skills. (On another Instagram Live video—yes, I know, I have a problem—she told DJ Zane Lowe that she’d only started cooking four months ago.) Her video is endearing and entertaining in the way that a child making up a dance is: it’s unscripted, unedited, intimate, and incredibly regular. Plus, it is always a treat to hear someone say the word “coriander” in a beautiful British accent. Stay til the end, and you get to watch her licking melted chocolate from a spoon while listening to “Nothing Compares 2 U.” From a certain angle, it looks like performance art, but it’s mostly just a human trying to cope.Voyeurism is, of course, a big part of this. I have relished the glimpses Pugh gives of her country kitchen while extolling the virtues of an immersion blender, the cute little bumble bee apron she wears (marry me!), the range stove that might be bigger than my actual kitchen. And this is a far more accurate portrayal of what celebrities eat than anything I’ve ever read in a magazine. (See also: Lizzo, making chilaquiles, making me want to make chilaquiles.)Instagram contentThis content can also be viewed on the site it originates from.Even the more polished versions of the form are endearing. Take Jennifer Garner, who has long made what you might call “nerdy short form cook-alongs,” making English muffins from the (very good) Huckleberry cookbook. (I assume these are filmed by an assistant, who I hope is getting hazard pay.) She is so meticulous and her kitchen is so whitewashed she looks like she is auditioning, successfully, for the role of a Nancy Meyers heroine. (It tracks. ICYMI, Garner and the Barefoot Contessa are tight.) All I want as I watch her bake, while my bedtime comes and goes, is for her to tuck me in and give me a warm glass of milk.Of course, celebrities are nothing like us. They have better access to testing and medical care, they have assistants to refill their Home Edit-organized pantry when they run out of buckwheat flour, and they’re probably not too worried about paying rent right now. But watching them act quote-unquote normal in believable ways is a soothing balm right now.As cabin fever fully consumes me, I’m less interested in professional instruction; I want to yell at my favorite pop stars for not cooking their onions long enough before adding other ingredients to the pot (sorry, Charli), and I want to lull myself into oblivion as they prattle on about how many garlic cloves you should mince for your squash soup. Saying “we’re all in this together” often feels like a false platitude, especially where the megarich are concerned, but it’s nice to know that we’re all struggling in some of the same ways right now: manically, in the kitchen, with a knife and a pot and a phone.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-01", "author": ["Condé Nast", "Marian Bull"]}