{"id": "836c0679223d37272d496e1ae73e042e", "url": "https://www.bonappetit.com/story/atlanta-halal-meat-and-food-iftar-box-ramadan", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "The Iftar Box at Atlanta Halal Meat & Food Is Full of Family Favorites | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Iftar Box at Atlanta Halal Meat & Food Is Full of Family FavoritesFather-son duo Ahmed and Farhan Momin draw inspiration from their Indian American family for the post-fast meal during Ramadan.By Sonia ChopraApril 23, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Dish Decoded we break down all the components, stories, and techniques behind a restaurant’s...well...dish that we’re obsessed with right now.The way Muslims break their fasts during Ramadan varies across families, communities, and cultures, but one thing that’s common is for restaurants around the world to offer set carryout meals called iftar boxes: neatly packaged dinners for people who are fasting to pick up, take home, and eat for iftar, the post-fast evening meal.“Ramadan is a time for reflection,” chef Farhan Momin says. “It’s a very spiritual month, and it’s very humbling.” Farhan runs Atlanta Halal Meat & Food, a butcher shop and takeaway spot, with his father Ahmed, and this year for Ramadan, they’ve created an iftar box filled with foods inspired by the dishes that their Indian American family enjoys together. Available for local pickup, the box includes a rotating selection of iftar dishes, including the sandwich Farhan invented when he was reheating food his parents dropped off in his college dorm and the Medjool dates the Momins traditionally use to break fast each evening.The Dates“Dates signify a blessing from God,” Ahmed says. “Breaking your fast with one gives you energy for the evening prayers and subsequent feast,” Farhan adds. This box comes with Medjool dates—which Farhan loves for their rich taste and high sugar and vitamin content—plus seasonal fruit.The Nimbu PaniWhenever Farhan tells people he’s fasting during the Muslim holy month, he gets the same follow-up question: “Not even water?” Drinking anything is prohibited until iftar, so the Momins wanted to offer something that is easy on the stomach after a day without food or beverages. Enter their nimbu pain (top left corner), a lemonade spiced with black salt and cumin.The SamosaSamosas are a must at iftar parties Farhan has attended. One big samosa, filled with potatoes and peas and served with cilantro and tamarind chutneys, is nestled in the box.The Nihari SandwichOne time in college, Farhan left some nihari—a slow-cooked meat dish—on the stove for too long, and it shredded apart. So he took some bread “and treated it like a sloppy Joe,” he said. “It was delicious.” Now on the menu at Atlanta Halal Meat & Food, it’s become a best-seller. So naturally it’s part of the iftar box.The Kheer“Kheer is just quintessential to Ramadan for us,” Farhan shares. This cardamom-y rice pudding (top right) is served for dessert at least a few times during Ramadan in the Momins’ household. “After fasting you want something a little sweeter, and kheer is very good because it is filling and cooling,” Ahmed explains.The FaloodaTake a scoop of kulfi; add rose syrup, milk, agar-agar jellies, vermicelli, and basil seeds; and you get this falooda (bottom right corner). “It’s a delicious, high-calorie way to cap off your fast,” Farhan says of the dessert.Explore Bon AppétitDish DecodedRamadanRestaurantsAtlantaRead MorerestaurantsEverything About Brandoni Pepperoni’s Pizzas Scream Los AngelesBy Elyse InaminerestaurantsThe Long and Winding Road to Richmond's Most Ambitious New Restaurant—in One DishBy Elyse InaminerestaurantsEverything That Goes Into a Hot, Luscious Bowl of Mohinga at Brooklyn’s RangoonBy Hilary CadiganrestaurantsAt Charleston’s Jackrabbit Filly, Here's How to Eat Your Weight in LuckBy Jenny LiaoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-23", "author": ["Condé Nast", "Sonia Chopra"]}