{"id": "8376bbd4ecba6bdc2a375548e55481e8", "url": "https://www.bonappetit.com/story/veggie-packed-steak-stir-fry-recipe", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "This Stir-Fry Recipe Keeps Weeknights Crispy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Veggie-Packed Steak Stir-Fry Recipe Keeps Weeknights CrispyBig flavor, big texture, and it's ready in a flash.By Jesse SparksMay 29, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailIf there’s one thing I hate, it’s soggy stir-fry. I need texture! I need crunch! When I'm served a less-than version, it's just kind of hard to find the will to keep chewing. So I was thrilled when I saw this stir-fry recipe boasting crisp asparagus, crunchy snap peas, and a whole smattering of things to chomp on. It forced me to get myself to the store to stock up on a few pantry staples—cornstarch, rice vinegar, soy sauce, mirin—but now that I'm pretty much obsessed with this stir-fry method, I know I'll be putting all of those things to good use on the regular. That's to say: If the ingredient list looks suspect, just trust. You'll reach for those bottles again and again, and your pantry will be better for it.As with any stir-fry recipe that isn’t a shameless vehicle for reusing leftovers, there is a bit of prep work involved. But the cool thing is that almost all of the chopping and peeling and mixing happens on the front end, and the standing-over-the-hot-stove part is kept to a bare minimum. To get through the prep, the key is to become a master multi-tasker. While trimming the ends of those snap peas, I caught up with some old friends on the phone. While slicing stalks of fresh asparagus and scallions into one-inch chunks, I sipped a little pre-meal drink. I stared into space and pondered the wonders of the universe. We could all use a little more time to think, right? Meal prep as meditation.During that spacey time, I got a pot of rice going so it would be ready at the same time as the stir-fry. (Adulting!) After a year of being a broke postgrad under my belt, making rice is second nature.A rice cooker is kind of a lifesaver.\nAs I sliced steak into thin strips and swirled together a sauce, I remembered one of the commandments of stir-frying: Thou shalt not mix wet meat with hot oil. If you’re trying to fry anything that hasn’t been thoroughly patted down, you’re gonna have a bad time. It’s the equivalent of texting your ex: Everything’s gonna blow up and you’re gonna get burned. (And I can’t pull off the Michael B. Jordan in Black Panther look. I tried.) So I made sure to dry off that hunk of sirloin steak with paper towels before slicing it as thinly as possible and tossing it with cornstarch, soy sauce, and a little bit of oil. Onwards!Now: skillet time! Stir-frying is like ASMR for me—it’s suuuuper satisfying to hear that sharp sizzling when all the veggies hit the pan. Smelling that bright ginger, sharp shallots, and distinct asparagus aroma coming together into a deeply savory bouquet, I realized the beauty of this simple little number. When that skillet starts smoking and those aromatics fill the air, it really smells like you know what you’re doing (even if you're half checked out).\nOnce the veggies took on a little bit of color—but well before they got soggy—I took them out of the pan and added the sliced steak in a single, spread-out layer so that there was as much contact with the pan as possible, and made sure not to move it until it started to brown and get crispy. Then the veggies went back in the pan, along with a pungent combo of oyster sauce, soy sauce, and rice vinegar.As the sauce bubbled away and reduced, I stole a spoonful of the liquid to taste: rich with steak juices but tangy enough from the ginger and vinegar to keep it from tasting too gravy-like. (Another quick splash of vinegar could definitely wake things up if the flavor were to go too dark.) Admittedly, I found myself craving a little heat—I’m a staunch believer that hot sauce, gochujang, and chile flakes make any situation better—but I held back this time around. (Next time, I'm adding some for sure.)And just like that, it was ready. I piled a bowl full of fluffy rice, spooned a hearty portion of stir-fry on top, and sprinkled some thinly sliced scallions over the whole thing. After one flavor-packed bite, I was already plotting my next skillet conquest—as you should be, too. Go forth, be merry, and keep it crispy.Get the recipe:Steak, Snap Pea, and Asparagus Stir-FryYou can probably make it faster than you can say it.View RecipeExplore Bon AppétitBasicallyStir-FrySteakAsparagusSugar Snap PeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Jesse Sparks"]}