{"id": "8379e94f25c6ba2e80161250c5daab50", "url": "https://www.bonappetit.com/recipe/cucumber-and-onion-salad", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Cucumber and Onion Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueCucumber and Onion SaladBy Tom CunananMay 21, 20194.7(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintCool, crunchy, and a bit sweet, this salad from Tom Cunanan of Bad Saint in D.C. is meant to quench the fire from all the other dishes on the table.Ingredients8 servings6Persian cucumbers, thinly sliced½small red onion, thinly sliced1tsp. kosher salt, plus more¼cup unseasoned rice vinegar2tsp. sugarFreshly ground black pepperFresh mint leaves (for serving)PreparationToss cucumbers, onion, and 1 tsp. salt in a medium bowl. Let sit until cucumbers begin to release liquid. Gently press down on cucumbers to force out more liquid, being careful not to break apart. Remove from bowl, shaking off liquid, and place vegetables in a clean bowl. Toss with vinegar and sugar; season with salt and pepper. Top with mint.How would you rate Cucumber and Onion Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCucumberVegetableWeeknight MealsSideDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}