{"id": "838901e5002e791c4ca6b69723be76d0", "url": "https://www.bonappetit.com/story/at-land-dobbs-ferry-new-york", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "This Shop Makes Me Want to Move to Westchester and Subsist on Mushroom Coffee Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Shop Makes Me Want to Move to Westchester and Subsist on Mushroom Coffee AloneEverything at At Land, from the delicious drinks to the jumpsuits, is just perfect.By Chris MoroccoNovember 4, 2019FacebookTwitterEmailPhoto Courtesy At LandFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Have you ever walked into a store and wanted to leave your old life behind and become the person you would be if your life was full of the things in that store? I hadn’t until I walked into At Land in Dobbs Ferry, New York. After a Jersey Ice Cream Co. Instagram post tipped us off, my family stopped by, but secretly I expected the letdown that normally follows breathless coverage by design blogs. This was different. Even the hardware on the front door was different, a sleek-yet-robust handle that managed to feel substantial yet only required a fingertip to turn. Once inside, soaring ceilings, thick wood beams, and a tranquil glow settled around impeccably curated clothes and home and kitchen goods.Surrounded by objects that seemed to float a few inches above the shelves, my family became a slightly better version of ourselves. My kids seemed adorable, completely unlike the hellions who made me pull the car over on the Henry Hudson Parkway just hours earlier and threaten them with military school. They sat in the light-filled cafe area, watching a show about LEGO ninjas, while my wife perused the racks of dresses and jumpsuits from designers like Rachel Comey and Ilana Kohn.You can't go wrong with the mushroom matcha, mushroom coffee, or golden milk\nPhoto Courtesy of At LandI hung out by the coffee bar, surreptitiously trying to decode their homemade formulation for mushroom coffee. It was so good I didn’t even miss the extra dose of caffeine that my normal afternoon pour-over provides. Equally good were the golden milk, rose cocoa, and frankly every other drink on the menu. The fact that all the drinks are vegan is almost an afterthought—and quickly forgotten after tasting how thoughtfully crafted they are.The most remarkable thing isn’t that this store exists. It is that it manages to be so cool, while falling outside the gravitational pull of New York City and “upstate,” in the vast stretches of flyover country (a.k.a. Westchester) that most New Yorkers dismiss. The owner, Melissa Lauprete, gave us untold numbers of recommendations for restaurants and hikes in the area, acting as a de facto ambassador for life just outside the city. Her impeccable taste (and the dream of a house with a yard) now keeps us coming back every few weeks for mini escapes from our city lives that always include a walk around the farm at Stone Barns and occasionally an open house. Somehow, committing to leave the city for good always manages to feel a couple years away, and we inevitably slink back to our lives in the city. In the meantime, At Land keeps us believing that a better us is at least possible.Go there: At LandExplore Bon AppétitHighly RecommendShoppingNew YorkTeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-04", "author": ["Condé Nast", "Chris Morocco"]}