{"id": "838c767314a0c6c4acb210b4e8cf00c0", "url": "https://www.bonappetit.com/recipe/baked-potatoes-deluxe", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Baked Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueBaked Potatoes DeluxeBy Alison RomanAugust 13, 20195.0(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Alison Roman, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese are impossibly fluffy on the inside and shatteringly crispy on the outside. To make that happen you need to rub them with oil (but don’t wrap them in foil!). And don’t cut them open until you’re ready to eat: If you do, the steam will escape, and they’ll cool down, meaning the butter won’t melt when you put it on—a true tragedy! This is one of the sides from Alison Roman’s “Steak House Night in America” menu, alongside: Martini Bar, Low-and-Slow Rib Roast, The Greatest Creamed Greens, and Upside-Down Apricot Tart.Recipe adapted with permission from Nothing Fancy: Unfussy Food for Having People Over by Alison Roman (Clarkson Potter, an imprint of Penguin Random House, LLC). Copyright © 2019. Ingredients8 servings8medium russet potatoes (about 9 oz. each), scrubbed, patted dryVegetable oil (for potatoes)Kosher saltFreshly ground pepper2cups sour cream1cup finely chopped chives and/or scallions1cup finely chopped dill and/or parsley1cup (2 sticks) unsalted butter, room temperature1–2oz. jar trout or salmon roe or caviarFlaky sea saltPreparationStep 1Place a rack in middle of oven and preheat to 500°. Prick potatoes all over with a fork (this allows the steam to escape, which helps the insides of the potatoes cook evenly and the skins crisp).Step 2Working one at a time, drizzle a bit of oil over each potato and rub all over with your hands to cover in a thin, even layer; season with kosher salt and pepper. Set potatoes directly on oven rack and bake until the outsides are deeply browned and crisp and the insides are very tender (a paring knife inserted into the flesh should meet no resistance), 60–70 minutes.Step 3Using tongs or oven mitts, transfer potatoes to a platter. Set out along with bowls of sour cream, chives, dill, butter, roe, sea salt, and pepper—and whatever else you feel like—and let guests slice open and top to their hearts’ content.How would you rate Baked Potatoes Deluxe?Leave a ReviewTell us what you thinkExplore Bon AppétitPotatoVegetableCaviarFishSeafoodRusset PotatoEasyWeeknight MealsSideGluten-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Alison Roman"]}