{"id": "838f6878137a93ad4d9992ada4fd8291", "url": "https://www.bonappetit.com/story/baked-oatmeal", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "This Baked Oatmeal Is Endlessly Customizable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Baked Oatmeal Is Endlessly CustomizableNo more breakfast burnout.By Sara ForteSeptember 17, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailWe’re in our third year of getting kids out the door for school early with a decent breakfast, hair brushed, clothes on, lunches packed, waters filled, and it still feels hard—most days it feels like prodding cattle to get them out the door. Preparing breakfast in advance feels like gifting myself an easier morning, and while muffins, granola cups, and batched breakfast burritos all make their weekly rounds, baked oatmeal assembled at the start of the week is a crowd-pleasing family favorite.It can be mixed up the night before and baked off in the morning so it’s fresh from the oven, but little is compromised by making it in its entirety and reheating individual servings through the week. Originally inspired by my friend Heidi Swanson, who layers her version with bananas and blueberries, I change out the produce and spices endlessly and it works every time.While this recipe is a nod to the beloved morning glory muffins, with all that amazing texture and sweetness from raisins and “health” from shredded carrots, I’ve had great success making it with chunks of summer peaches and almond extract stirred in and slivered almonds on top; blueberries with lemon zest and poppy seeds; and roasted strawberries and cocoa powder, a version inspired by chocolate-covered strawberries. My kids especially love it when I stir in some peanut butter to the wet mix and add dates, bananas, and a handful of chocolate chips.For your own version of this endlessly customizable morning savior, stick to the recipe ratio of oats, egg, and milk (regular or plant-based) and then add in your favorite seasonal fruit, nuts or seeds, and a well-paired spice—cinnamon seems to be the house favorite for breakfast goods, but vanilla, cardamom, or nutmeg would all make welcome additions. For a bonus healthy oomph, I’ve even added flax meal or protein powder on occasion as well as grated and water-wrung-out zucchini. As long as you don’t leave out the oats and milk, this recipe is wildly forgiving.The best part: It tastes just as good the next day after reheating, so go ahead and prep a pan that can get you through a couple of mornings. If you have a house full of hungry people or happen to be the freezing type, double the recipe and bake it in a 13x9\" pan. If you’d like it to be tender again, you can reheat your portion in a 300° oven or toaster oven for 15 minutes, or microwave a single serving for a minute with a splash of milk to rehydrate.We all have those kitchen burnout moments sometimes, but we can’t go starting the day with one. Make this baked oatmeal once, eat it a few times, and follow the blueprint to change it throughout the seasons for an excellent make-ahead breakfast that will never let you down.Get the Recipe:Morning Glory Baked OatmealThis warm and cozy baked oatmeal studded with carrots, apples, and raisins is the make-ahead breakfast situation your busy mornings need.View RecipeExplore Bon AppétitcookingMeal PrepRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-17", "author": ["Condé Nast", "Sara Forte"]}