{"id": "83a71fe9170718f3bdb194b028c69306", "url": "https://www.bonappetit.com/story/caramelized-onion-and-squash-tart", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Butternut Squash Tart Is the Vegetarian Stunner Your Thanksgiving Table Needs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Caramelized Onion and Squash Tart Is the Vegetarian Stunner Your Thanksgiving Table NeedsIt's got a shatteringly crisp crust with plenty of pronounced nutty flavor. And just look at that swirl.By Chris MoroccoNovember 14, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmail“Nobody puts Baby in the corner.”It’s the line that Patrick Swayze delivers to Jennifer Grey’s stunned family in Dirty Dancing, but they might as well have been talking about America’s attitude toward the Thanksgiving turkey. Nobody puts turkey in the corner; it holds court in the middle of the table like a football center at the line of scrimmage.Well, I think turkey belongs in the corner, if it makes the roster at all. I'd rather eat just about anything else at Thanksgiving: stuffing, Burnished Potato Nuggets. Even cranberry sauce sets off a frisson of festive joy. But what deserves that primetime position? May I submit: this classy-as-hell Squash and Caramelized Onion Tart.Rings of shaved winter squash, red onion, and sweet potato, set on top of caramelized onions and cheddar, and a shattering crisp crust with pronounced nutty flavor thanks to whole-grain flour. It's a holiday centerpiece with serious wow. And, unlike some vegetarian mains that end up being a meal unto themselves (I'm looking at you, casseroles), this savory tart plays nicely with the rest of the Thanksgiving menu.I know it's a hard sell, replacing turkey for tart, so consider that the two could easily co-exist. For vegetarians—or turkey skeptics like me—this squash tart is way more appealing than any shrink-wrapped, fake-meat thing you could buy. The vegetables go crispy-jammy against the caramelized onions, while the cheddar (and just a hint of mustard and cayenne) give depth and a touch of sharp flavor to the base. It's as decadent and indulgent as any gravy-drenched turkey could be.You don’t need an '80s movie montage of kitchen prep to make it happen (though if you want to have a flour fight set to upbeat music, please record and send my way). The caramelized onions can be made up to 1 week ahead, and you can assemble the dough for the crust several days in advance. Just roll it out and place it into a tart ring when you're ready to bake, brush it with mustard and cayenne, layer on the caramelized onions and cheese, then arrange the squash, sweet potato, and red onion like it's craft night at Marge's. Serve, eat, and repeat. No turkey required.Things fall a tart:Squash and Caramelized Onion TartFor a vegetarian main that can hold its own at the center of the table, this tart makes a very convincing argument.View RecipeExplore Bon AppétitHealthyishThanksgivingVegetarianRoasted VegetablesTartOnionRead MoreLifestyleThis Vegan Creamed Spinach Recipe Will Fool ALL the Dairy Lovers at the TableBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Chris Morocco"]}