{"id": "83b3757715bf960cca5527b6d75398a4", "url": "https://www.bonappetit.com/recipe/chile-vinegar", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Chile Vinegar Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueChile VinegarBy Tom CunananMay 28, 2019EmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintYou will find some version of this condiment, a sharp, bright finisher that is like a squeeze of lime juice on steroids, on nearly every table in the Philippines. It perks up everything here, and frankly, just about anything you grill.IngredientsMakes about 2 cups1oz. red Thai chiles (about 20)6garlic cloves1scallion, white and pale green parts only1½cups cane vinegar (such as Datu Puti) or unseasoned rice vinegar1Tbsp. kosher salt1tsp. black peppercorns2tsp. sugar½small red onion, finely choppedPreparationStep 1Blend chiles, garlic, scallion, vinegar, salt, peppercorns, and sugar in a blender until finely chopped. Transfer to a nonreactive bowl and mix in onion.Step 2Do Ahead: Vinegar can be made 2 months ahead. Cover and chill.How would you rate Chile Vinegar?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleShould chilies be used whole or should stems be removed?DavidInverness, CA12/29/2020Explore Bon AppétitCondimentFilipinoSoutheast AsianAsianThai ChileChileVegetableDairy-FreeGluten-FreeNut-FreeVeganVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-28", "author": ["Condé Nast", "Tom Cunanan"]}