{"id": "83b41d95269e3c2b7da696d90d09bd4e", "url": "https://www.bonappetit.com/recipe/super-refried-beans", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Super-Refried Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueSuper-Refried BeansSeptember 22, 20205.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrint“There are lots of different kinds of refried beans throughout El Salvador, but in some mountain towns, you’ll get these amazing, really dense beans,” says chef Anthony Salguero of Popoca in Oakland. “My cousin calls them triple-fried, but it’s more like a thousand times fried. You just keep adding fat until the beans are thick enough to stand up on a plate, which is very common as part of a Salvadoran breakfast, with tortillas, eggs, fried plantains, avocado, and queso. They’re often made with lard, but I make mine with olive oil. It’s a little healthier, plus I’m cooking in California, so I try to be respectful of vegetarians who come in.” Serve these very rich beans in modest dollops with sour cream and avocado for scooping up with thick Salvadoran-style corn tortillas.IngredientsMakes about 4 cups16garlic cloves, smashed315-oz. cans black beans, rinsed¼cup lard, duck fat, schmaltz, or extra-virgin olive oil1jalapeño, split lengthwiseKosher salt1cup extra-virgin olive oil, dividedSour cream, sliced avocado, and warmed corn tortillas (for serving)PreparationStep 1Pulse garlic in a food processor until very finely chopped. Scrape into a small bowl. Pulse beans and 3 Tbsp. water in processor (no need to clean) until a coarse paste forms, about 2 minutes.Step 2Heat lard in a large nonstick skillet over medium. Cook garlic, stirring constantly, until lightly golden around the edges, about 3 minutes. Immediately add beans, jalapeño, and a big pinch of salt and cook, stirring and folding in beans with a heatproof rubber spatula, until incorporated and beans turn a shade darker, about 10 minutes.Step 3Reduce heat to medium-low, add ¼ cup oil and cook, stirring often, until oil is absorbed and beans start to dry out at edges, about 5 minutes or so. Continue to cook, adding remaining oil by ¼-cupfuls every 5 minutes and stirring occasionally, until very thick and dark, 15–20 minutes. Discard jalapeño. Season with more salt if needed. Serve with sour cream, avocado, and tortillas.How would you rate Super-Refried Beans?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleAbsolutely delicious! I didn't use about a 1/4 cup of the olive oil. Next time I might use even less since it's maybe a bit too rich for a weekday meal. AnonymousBrooklyn, NY9/6/2021In El Salvador, we use red kidney beans, not the black beans the recipe calls for. Most cooks add green bell pepper, instead of a jalapeño, and a pinch of cumin. If using olive oil instead of lard, we add an equal amount of butter, for added flavor.AnonymousEl Salvador10/10/2020This is a simple but delicious treat for breakfast!AnonymousLondon10/6/2020Got the magazine yesterday, saw this, made it today. It's wonderful! I'm really happy and vampire-proof. \nFriends, splurge on the good olive oil. Always, but especially here. jonkmartin703587Indianapolis,IN9/26/2020Explore Bon AppétitSalvadoranCentral AmericanLatin AmericanBlack BeanBeanVegetableEasySideGluten-FreeVegetarianNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}