{"id": "83b6bdcaf1e13bda24e5fd8ef6e1511d", "url": "https://www.bonappetit.com/story/how-many-bottles-of-wine-dinner-party", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Wine Calculator: How Many Bottles of Wine Does Your Dinner Party Need?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWine Calculator: How Many Bottles of Wine Does Your Dinner Party Need?We’ve done the math—there’s a chart and everything.By Marissa A. RossOctober 14, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis wine calculator is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.How much wine is “enough” wine for your dinner party? Here’s a handy drink calculator for you—actually, it’s solely a wine calculator. Most people would say that the dinner is the most important part of a dinner party, but I would argue it’s having enough wine. It starts conversations, complements dishes (you didn’t burn), and keeps the party going. You can pull a Tim Allen and turn a turkey into a wildfire, and no one will care if there are plenty of bottles to go around.How many glasses are in a bottle of wine?To start, you need to know how many glasses are in a bottle of wine. This seems obvious, but considering we’ve all had nights where a whole bottle of red wine equals two very large mason jars of Cab Franc while hate-watching Love Actually, it’s important to break it down.A bottle of wine is 750 milliliters, which works out to approximately 25 ounces. The suggested serving size of wine is five ounces, which would mean each bottle has five glasses. If you want to stick to that math, that is perfectly fine, although, personally, I don’t believe five ounces is a glass of wine. I think it’s a joke. Who pours exactly five ounces of wine? No one. If you work from the five-glasses-per-bottle logic, you almost always come up short. According to my very professional opinion, a 750-ml bottle of wine works out to be about four glasses of wine, and two chugs straight from the bottle you are awarded as the dinner party host.What's that funky orange wine they’re drinking? Read more about it here.\nPhoto by Alexandra GavilletWhat is the alcohol content of a bottle of wine?This isn’t an alcohol calculator in terms of ABV, but real quick, here’s a crash course on wine alcohol by volume. The average glass of wine contains around 11% to 13% alcohol. But you might serve a bottle containing 5.5% ABV (might be a sparkling wine or a rosé) or over 20% ABV (probably a sherry or port). It depends. If a wine has higher degrees Brix, or sugar levels, it will usually have higher alcohol levels. It’s got to do with what kind of grapes are used in the fermentation process during winemaking.So how many bottles of wine do you need for your party?Okay, back to the main topic. Using the above information, I say you need at least one bottle of wine per guest. Think about it—you have a glass before dinner, a few at dinner, another after dinner. Boom, that’s a bottle right there, and that’s being conservative. But that’s just me, and it’s not my dinner party. To find out exactly how many bottles you need, we’re going to do a liiiittle math.Since you already know how many glasses are in a bottle of wine, there are two other variables you must know in order to solve this ancient and universal equation.First, how many guests are coming?Check the group text and count ’em up. Always add two extra people because you never know who is going to surprise you with a new boyfriend or when that notoriously flaky friend you still love and always invite will actually show up.Second, how many glasses of wine will each guest drink?None of us here are psychic, but we can use this chart I made to predict how many glasses of wine your guests will consume based upon the duration of your dinner party and their love of wine.We're definitely not talking about bottles of beer here.\nBy Marissa A. RossOkay, so what is the formula for the number of bottles of wine? Pull out your phone’s calculator app (or, uh, an actual calculator) and do this math: Number of Guests × Number of Estimated Glasses Per Guest ÷ 4 = Number of Bottles NeededAnd voilá! Glasses will be full, guests will be happy, and you won’t run out of wine and haphazardly open that bottle you’ve been saving with a note attached that says, “DON’T OPEN ME, YOU’RE DRUNK!” Cause you will regret that shit.This story was originally published December 5, 2017.The One Dish for Every Dinner Party:Explore Bon AppétitWinePartyDinner PartiesEntertainingRead MorecultureThere's No Place Like Lou Wine ShopBy Marissa A. RossrestaurantsWe Couldn't Be More Thrilled That Sweet Berry Wine Is Now a Real WineBy Marissa A. Rossculture6 Bottles of Syrah That Prove It Isn't as Big As You ThinkBy Marissa A. RosscultureHow to Successfully Pack Wine in Your SuitcaseBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-05", "author": ["Condé Nast", "Marissa A. Ross"]}