{"id": "83cd8698fc533676cf0c22500ed5c66c", "url": "https://www.bonappetit.com/recipe/butternut-squash-coconut-and-ginger-muffins", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Butternut Squash and Coconut Muffins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueButternut Squash, Coconut, and Ginger MuffinsBy Anna StockwellNovember 12, 20214.3(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintLike the best possible Morning Glory muffins but with grated butternut squash instead of carrot. Butternut squash season starts in early fall. Look for very firm and heavy squash with fresh-looking stems. The skin should be smooth and unblemished. Size doesn’t make a difference in flavor, but squash with long necks are generally easier to peel and break down.IngredientsMakes 1 dozen2large eggs10Tbsp. unsalted butter, melted⅔cup buttermilk2tsp. grated peeled ginger (from one 2\" piece)⅔cup plus 2 Tbsp. (packed) light brown sugar2cups all-purpose flour2tsp. baking powder¼tsp. baking soda1tsp. ground cinnamon1tsp. kosher salt2cups grated (on large holes of box grater) peeled butternut squash (9 oz., from about ¼ of a large squash)¾cup unsweetened shredded coconut¾cup coarsely chopped pecansPreparationStep 1Preheat oven to 375°. Line a standard 12-cup muffin pan with liners. Whisk eggs, butter, buttermilk, ginger, and ⅔ cup brown sugar in a medium bowl. Whisk flour, baking powder, baking soda, cinnamon, and salt in a large bowl. Mix egg mixture into dry ingredients with a wooden spoon or rubber spatula until just combined. Mix in squash, coconut, and pecans.Step 2Divide batter among muffin cups, filling to the brim (about ½ cup batter per muffin). Sprinkle remaining 2 Tbsp. brown sugar on top.Step 3Bake muffins, rotating pan halfway through, until golden brown and a tester inserted into the center comes out clean, 30–32 minutes. Let cool in pan 5 minutes, then transfer muffins to a wire rack and let cool completely.Step 4Do Ahead: Muffins can be made 3 days ahead. Store airtight at room temperature, or freeze up to 2 months.How would you rate Butternut Squash, Coconut, and Ginger Muffins?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleNice! I followed the suggestion to add in some crystallized ginger (about 1/4 cup); I also substituted about 1/3 cup of grated carrot for some of the squash because I turned out not to have quite enough squash, and substituted apple sauce for half of the melted butter. I cooked them about 36 minutes because the batter is indeed quite moist. The results are very good.Brooklyn MomBrooklyn, NY12/29/2021These were tasty but very dense and not as interesting as I'd expected given the squash and coconut.Liz12/1/2021These are delicious. The fresh ginger and coconut combo are such a nice change from other muffins. I used a different squash (Zucchino Rampicante, cured for winter) and subbed out half of the butter for coconut oil. Made 16 muffins, and will definitely make again.BethPleasanton, CA11/16/2021These are so delicious!! Super moist and not too sweet, and very easy to make. Definitely recommend following the other commenters’ advice and throwing the squash in the food processor instead of grating it. I cut a portion of my squash into ~1” chunks and then processed them until they were finely chopped. So much easier than grating and I like the distribution you get in the muffins. Next time I might lightly toast the pecans just to get a nicer flavor out of them. The only issue I had was that the muffins stuck to the paper liners, so I might also try just spraying the muffin pan instead of using liners next time.SoapnanaChicago, IL1/10/2021These were so yummy! I also used a food processor like some people recommended. Didn't have pecans but used walnuts, and added dates. Also added some maple syrup for taste and texture as well as a bit more buttermilk, and had enough batter for 16. Did 1/2 brown sugar, 1/2 coconut sugar. Forgot to add brown sugar on top but made a coconut curry frosting which was yummy!Brenda11/16/202010 Tbsp of saturated fat. AnonymousDenver, CO11/13/2020What would the recipe look like for gluten free?|\nCandia, NH4/11/2020I made my own version of these.  Added 1 c. grated apple, 1 c. grated zucchini, 3/4 c. raisins, and 3/4 c. candied ginger chips to recipe.  Didn't change anything else.  Made 2 dozen muffins.  Delicious.drfoheadPhiladelphia10/26/2019Is there anyway to cut the fat down in this recipe?  Ten tbs of butter is almost one per muffin.cfranceFrance and Florida10/18/2019I made these because I had coconut flakes and squash left over from another recipe and was very surprised at how delicious they are! The flavors are very subtle and not at all over powering. The texture is dense but perfect. Like other reviewers I used a food processor to make the squash pieces much smaller than a box grater (plus it was way easier than shredding by hand). Only about 1/4 of a good sized squash is needed. I will be making these again!AnonymousNew York10/25/2018My family loved these muffins. I thought the flavors were perfectly balanced and the coconut provided a wonderful aroma and toothsome quality.  These are especially good if you don't like overly sweet baked goods for breakfast. I foresee making these often. Linda SSan Francisco, California10/21/2018It's not a bad muffin, but not a memorable one. This is supposed to be another take on the \"morning glory\" muffin, which uses carrots and this one uses squash because it's fall now, I think. Carrots and the butternut squash have subtle flavors when they have to compete with brown sugar. I'm not sure when I won't find carrots at my grocery store, so for that reason I can't see the point in using the squash unless I feel seasonally festive and want to deal with a more difficult food than peeling and shredding a carrot. And they both seem to have the same texture. Additionally, I don't see how the coconut flakes contribute other than texture-wise. To be honest, if I just added more squash instead of the coconut I wouldn't have noticed a difference.  Unfortunately, this is not a keeper. Anonymousminnesota10/16/2018This recipe is so wonderful, but I want others to know of some necessary adjustments. Throw the butternut squash in your food processor or Vitamix. Having a finer mince on the squash contributes to a dense yet delicate crumb. Also, the brown sugar measurement should note that the additional 2 tablespoons should be separated​ for topping. The instructions said to just add the brown sugar to the wet mixture, not indicating that some should be for topping.  The flavor is so balanced, unusual, with a PERFECT crumb. Moist, dense, yet not heavy. This recipe actually made more than a dozen for me, but NO COMPLAINTS! angie.stefanecDenver10/15/2018So easy and delicious, these muffins got raves all around. Making a second batch now! 1/4 of a butternut squash is the perfect amount. AnonymousSan Diego10/14/20189oz seemed like way more than 2c of butternut squash.  would stick to volume measurement.  also might recommend food processor for very shredded squash vs. box grater for nicer texture.  we found the squash a bit too intact but the flavors were very nice.Anonymousdenver10/10/2018Explore Bon AppétitMuffinPastriesDessertAmericanButternut SquashSquashVegetableButtermilkOther IngredientsGingerHerbs & SpicesCoconutFruitFallBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Anna Stockwell"]}