{"id": "83d0b9c4494fff68a3ea1e043b27abc0", "url": "https://www.bonappetit.com/story/haley-henry-boston-wine-bar", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Haley.Henry Is Pouring the Most Interesting Wine in Boston | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Wine Bar That’s Pouring the Most Interesting Stuff in BostonAt Haley.Henry, Haley Fortier is championing female winemakers and serving some of the most fun-to-drink wine in the city.By Elyse InamineSeptember 10, 2018FacebookTwitterEmailHaley Henry Wine BarPhoto by Jon PackFacebookTwitterEmailIn Boston, a city known for its oyster bars and Red Sox and, let’s face it, a lot of big-box bars with big-screen TVs, there lies one of the most charming natural wine bars—that also happens to be championing female winemakers. Haley Fortier, 40, opened up Haley.Henry two years ago, and she still works the door of her bar this cool summer evening. Tonight, she’s got a Bowie-esque coif and a purple blazer fit for Prince. From inside, the mumble rap melodies of Famous Dex and Tyler the Creator welcome me, along with the promise of funky, weird wines I can’t find anywhere else in the city.The 680-square-foot space feels intimate and chill, like hanging out at your artist friend’s Bushwick apartment. There’s a small counter and a couple induction burners for cooking and an upstairs loft for wine storage. Fortier only features small-batch wines, a.k.a. made in fewer than 5,000 cases at a time. (To better understand this figure, an estimated 415,000 cases of David Beckham favorite, Whispering Angel Rosé, were produced in 2016.)The woman behind the bar, Haley Fortier\nPhoto by Jon PackBefore getting into wine, Fortier was many other things. She was a records-shattering high school soccer player, a winter sports photographer, and a corrections officer at the Boston city jail. But after breaking up fights and keeping an eye on high-profile inmates for six years, she decided to go into restaurants. “I’m a people person,” Fortier tells me with a shrug and a smile.She was a server at Chart House on Boston’s Long Wharf, a national steakhouse chain, then worked her way up over four years to help manage the restaurant’s wine tastings. In 2008, she joined the opening team at Sportello, chef Barbara Lynch’s pasta-powered restaurant. Under the guidance of Cat Silirie, Sportello’s executive wine director, Fortier immersed herself in the world of Italian wine and was first introduced to natural wine via a memorable bottle made by Arianna Occhipinti, a groundbreaking winemaker in Vittoria, Sicily. She became obsessed.“I like big, bold, dirty wines,” Fortier says, with a laugh. She read everything Alice Feiring, a respected, yet controversial wine writer and advocate of natural wine, wrote (The Dirty Guide to Wine, Naked Wine). Almost four years ago, she first hatched the idea for Haley.Henry, named after herself and the son her dad never had (a family inside joke, since he has five daughters). It would be a haven for natural wines, made mostly by women, and tinned fish, somewhat of an obsession of hers after a trip to Portugal. So Fortier cashed in her savings, and with longtime Sportello customers who’d chipped in as investors, she turned an old cupcake shop in retail-crammed Downtown Crossing into Haley.Henry. She blindly emailed a favorite tinned fish producer, Da Morgada, and ended up becoming a distributor in the U.S.Precious tins of fish\nPhoto by Jon PackWhen I visited recently, I tried a wine that stopped me in my tracks: the 2017 Old Westminster Winery pét-nat from Maryland. “Yes, Maryland!” my mind-reading server said as I pointed to the menu. It was tiny-bubbled and almost creamy, the perfect thing to sip while snacking on a few salty sardines and griddled tuna belly sandwich.This past summer, Fortier did the the whole building-your-own-bar process over again for her newest wine bar, Nathálie, which just opened in Fenway. It’s double the size of Haley.Henry and features even more female winemakers, closer to 50 percent of the wine list. That’s intentional for Fortier, who has been mulling over ways to make her industry more inclusive of people like her: female, gay, experienced, ambitious.“We’ve been having this conversation about equality for a long time now, and a part of me feels as though the more we talk about it without action, the more we keep ourselves pinned down,” she says. “Why wouldn’t we make it normal to focus on female winemakers? The more we do, the more realistic it becomes. Five years from now, my hope is that we aren’t still talking about the inequality of the sexes. It’s nonsense.”Busy as usual at Haley.Henry\nPhoto by Jon PackThe sometimes unusual, or unexpected wines can be an uphill battle for some customers, but Fortier and her team draw them out of their comfort zone by being engaging and as helpful as they can.“We’ve had a lot of customers come in who aren’t familiar with natural wines, or they think wine is precious or pretentious,” she says. “So we just talk to them. What a novel concept! But by the end of it, we’ve gotten them to at least appreciate what we’re doing, found something they like, or,”—she kids—“opened their eyes to a variety of wines that they absolutely hate.”But so far, it seems like people are starting to geek out on these natural wines, much like Fortier did years ago.“We didn’t have any natural wine bars before in Boston, and we need it because you can get classic wines anywhere,” Fortier continues. “So when our customers come in, don’t look at the wine list, and ask for something interesting, we know we’re doing something right.”Pairs well with natural wine:Explore Bon Appétitnatural wineBostonWine BarsRead MorerestaurantsGeneral Life Advice from the Owner of Portland’s Finest Dive BarBy Marnie Hanelculture“Orange Wine” Needs to Go Away—Hear Me OutBy Marissa A. RosscultureHow to Get the Most Out of Your Somm ExperienceBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-10", "author": ["Condé Nast", "Elyse Inamine"]}