{"id": "83d3ee55d4182d1b65d19b12f8fd828a", "url": "https://www.bonappetit.com/story/bow-market-somerville", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Food Halls Give Me Anxiety, But Bow Market Is So Damn Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFood Halls Give Me Anxiety, But Bow Market Is So Damn GoodI’ll make an exception for this spot in Somerville, Massachusetts.By Emily SchultzJune 5, 2019FacebookTwitterEmailPhoto by Emily TirellaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Crowded spaces aren’t my strong suit. I’m way too short for overpacked concerts, and overwhelming food halls with hungry tourists and long lines make me break out in a cold sweat. But there’s one place that’s got all the makings of these environments, but is so the opposite that, surprise of all surprises, I’d spend my whole day here if I could.Instagram contentThis content can also be viewed on the site it originates from.I’m talking about Bow Market in Somerville, Massachusetts, a new-ish strip mall–ish joint that’s the perfect amount of busy: buzzy, without being jam-packed. It helps that the setup is a two-story ring of 30+ small, separate establishments—each with its own real door!—surrounding a central courtyard where you can take your food to-go. Oh, and the food! There’s bimbimap from Perillas, natural wine from feminist bar Rebel Rebel,  crunchy bar pizza from Hot Box, fluffy pierogies from Jaju, or fancy chocolates made with fresh, local ingredients from Gâté Comme des Filles. There’s literally something for everyone—including even normal food hall haters like me.Go there: Bow MarketExplore Bon AppétitHighly RecommendBostonRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-05", "author": ["Condé Nast", "Emily Schultz"]}