{"id": "83dd26f0d7a1854316813f0d2d43b123", "url": "https://www.bonappetit.com/story/get-your-global-fix-from-our-favorite-healthyish-restaurants-on-caviar", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Get Your Global Fix From Our Favorite Healthyish Restaurants on Caviar | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredGet Your Global Fix From Our Favorite Healthyish Restaurants on CaviarBy Caviar July 17, 2018FacebookTwitterEmailcaviarFacebookTwitterEmailRemember the ancient days of takeout and delivery, when, after hours of rifling through paper menus, debating over pizza or Chinese, one would (gasp) call to order? Then wait a lifetime to receive food that was, at best, mediocre? Today, it’s not enough to settle for tepid takeout and delivery. We want fresh! Organic! Variety! Give me whole foods or give me death! We deserve more.Thankfully, the great minds at Caviar understand the plight of ordering in across America—and they’ve partnered with Healthyish-recommended restaurants to satisfy far-flung cravings with fresh, globally inspired dishes. So whether you’re road-tripping, traveling for work, or live in a food mecca like Chicago, D.C., L.A., Manhattan, or San Francisco, next time you’re up for some exceptional ordering in, go fresh and global from one of these restaurants.Get Your Asian-Inspired Fix From Coast to CoastTakorean, D.C.CaviarWhat’s not to love about hybrid cuisine? That’s the sentiment at TaKorean in D.C., where Korean tacos are crafted from scratch with bold and bright (read: healthful!) ingredients. Think Bulgogi on a soft corn tortilla, topped with kimchi, lime crema, and sesame seeds. Not to be outdone in The District, however, CHIKO rises to the occasion with a modern marriage between Korean and Chinese flavors. Caviar favorites include Orange-ish Chicken and Pork and Kimchi Potstickers. Yes, please, thank you.In Chicago, Asian flavors take a slightly different turn at Urbanbelly, where chef Bill Kim relishes in unpredictable dumpling combos like sweet potato and maple, but also serves up cross-continent favorites like pho, ramen, and bibimbap. At honeygrow, stir-fries go mainstream with six specially curated combos and build-your-own options featuring crossover ingredients like freshly made whole-wheat noodles, all-natural roast chicken, sesame garlic, coconut curry, and lemon miso tahini.If you’re still dreaming of your last trip to Thailand (or the one you’ll take someday), you’ll love the Thai street food options at Night + Market, where chef Kris Yenbamroong serves celebs and civilians alike his authentic and unique Thai combos. Sure, you could order a slam-up Pad Thai, but when Pork Toro—grilled fatty pig neck with chili dip—is on the menu, we suggest throwing caution to the wind.Pretend You’re on the Mediterranean Coast with These Fresh Middle Eastern PicksDune, Los AngelesCaviarThe pita sandwich is having a moment. Perhaps because of its easy-to-carry nature, or its ability to host a variety of ingredients. Whatever the reason, we’re grateful. In San Francisco, Souvla fills fluffy pitas with naturally raised meats (though there are bright and beautiful salads, too), inspired by traditional Greek souvlaki joints.Down south in L.A., Dune is on their way to dominating the sandwich game with their not-so-tiny house-baked flat breads stuffed and overflowing with everything from pasture-raised lamb to pickled beets. Only a few miles away, chef Josef Centeno keeps handheld deliciousness alive at BäcoShop, where he pulls inspiration from all over the globe to produce his signature bäcos: fresh, homemade flatbread folded over grilled meats, veggies, and sauces with aromatic spices.There’s no denying that California is king when it comes to fresh, no-fuss food to go, but that’s not to say New York City is lacking. At Jack’s Wife Freda, where an eclectic menu reflects the influence of South African and Israeli cuisine, healthy options abound—or not. Maya’s Breakfast Bowl mixes eggs with red quinoa, kale, and spaghetti squash, while Jack’s Burger goes all-in with grilled tomato and fried onion. It’s all good, no matter how you slice it.The Freshest Evolution of On-The-Go American CuisineFarmbird, D.C.CaviarThanks be to wellness trends for popularizing the protein and vegetable plate, a favored menu item by those of us eschewing less healthy on-the-go options. At RT Rotisserie in San Francisco, chefs-owners Evan and Sarah Rich—who you may know from their buzzed-about restaurant, Rich Table—see to it that you can get a good ole half or whole chicken made with free-range Rocky birds from Petaluma and a side of seared broccoli with chimichurri. Or you could opt for the less wholesome (but equally delicious) Sally Hurricane’s Southern Fried Chicken Sandwich with charred cabbage, pickled onions, and chipotle yogurt on a brioche bun.The chicken trail continues in D.C. at Farmbird, where everything is prepared from scratch, and birds are humanely raised on an all-veggie diet without growth hormones or antibiotics. From sandwich to salad, you’re guaranteed grilled chicken with an inventive twist. Thanks to spots like Left Coast in Chicago, healthful eating is always exciting with bowls, salads, grains, and wraps carefully crafted to ignite taste buds and change the perception that good-for-you-foods are boring. Here, they’re anything but.Over in Manhattan—a place that prides itself on having figured out nearly everything—the proteins, veggies, and beautifully tossed salads monopolize the menu at Dig Inn, where mindful sourcing comes first and farm-fresh ingredients reign supreme. For an all-out dose of feel-good food, look no further than Blake Lane.  This Upper East Side joint turns out gorgeous bowls, sandwiches, and entrées that are organic and local when possible, and largely vegan and gluten-free, though fresh tuna poke, wild cod tacos, and grass-fed hanger steaks are available for pescatarians and carnivores. With the eat-fresh movement and a welcome global influence, delivery has never looked better than it does today.Caviar is an easy way to order meals from the best local restaurants across the U.S. Customers can order food for pickup or delivery ahead on the web, or instantly from Caviar’s free mobile app for iOS and Android.Explore Bon AppétitSuperpoweredRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast"]}