{"id": "83e8a6254238a5c09bd3670dc7882b1b", "url": "https://www.bonappetit.com/city-guides/montreal/venue/arthurs-nosh-bar", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Arthurs Nosh Bar Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealArthurs Nosh BarThe Saint-Henri Jewish(ish) deli with lines out the doorFacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: early, especially on weekends. This is the place for people who are serious about brunching but require actually good food versus the unlimited mimosas and pale omelets that plague too many spots. Arthurs Nosh Bar fills up quickly with a mix of girlfriends catching up over brunch, young families, and out-of-towners in the know. On nice days, snag a seat outside if you can.ORDER THE: latke smorgasbord—a rainbow of a plate filled with scrambled eggs, gravlax, Israeli salad, an excellent challah roll, and of course, latkes (with both applesauce and sour cream!). It’s everything you want for breakfast and brunch combined. If you keep staring at the sprinkle cookies on the counter, give in. While sprinkle cookies are never the best cookie out there, these taste like a slightly better version of the too-crumbly ones you remember eating as a kid.THE VIBE IS: Brooklyn meets Montreal meets Russ & Daughters. It’s a bright white space with a lot of small, subtle nods to current restaurant design trends—think marble countertops, pickle jars placed just-so on shelves, and a letter pegboard announcing various drinks on offer.PRACTICAL STUFF: Open every day: Monday to Friday 8 a.m. to 3 p.m. and Saturday and Sunday 9 a.m. to 4 p.m.—Carey PolisPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEElenaPizza and natural wines go hand in hand at this Saint-Henri pie shopOlive + GourmandoCarb up at this charming Old Montreal brunch standbyLoïcAll roads (and great pét-nat) lead to this Saint-Henri wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Carey Polis"]}