{"id": "83eb14dd033fcb76f85fac8f3f1d546a", "url": "https://www.bonappetit.com/recipe/peaches-and-tomatoes-with-burrata-and-hot-sauce", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Peaches and Tomatoes with Burrata and Hot Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssuePeaches and Tomatoes with Burrata and Hot SauceBy Chris MoroccoJuly 10, 20184.9(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Alison Attenborough, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintTake your peaches to dinner: Combine them with a zippy dressing and a creamy cheese and serve with grilled wings or pork ribs.Ingredients4 servings2Tbsp. extra-virgin olive oil2Tbsp. mild hot sauce (such as Crystal or Frank’s)2tsp. unseasoned rice vinegar2tsp. honeyKosher salt3ripe peaches or nectarines, cut into wedges2large ripe tomatoes or 1 lb. mixed tomatoes, sliced18-oz. ball burrata or fresh mozzarella, torn into large piecesTarragon sprigs (for serving)Flaky sea saltPreparationStep 1Whisk oil, hot sauce, vinegar, and honey in a small bowl until honey is dissolved; season with kosher salt. Toss peaches, tomatoes, and half of dressing in a medium bowl; let sit 5 minutes.Step 2Transfer fruit salad to a platter. Top with burrata and drizzle with remaining dressing. Scatter a few torn tarragon sprigs over and season with sea salt.How would you rate Peaches and Tomatoes with Burrata and Hot Sauce?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThe hype is real! I made this exactly as the recipe was written, and WOW. My Dad and I ate the whole thing, and he's 96! I would only say to dress it lightly,  so you don't lose the fresh tomato and peach flavors, with the dressing taking backstage but not by much. Which left me with enough dressing for another one this week! Mary KayPrairie Village, KS8/16/2021This is amazing. I used half Sriracha and half Jamaican hot sauce. Tore up fresh mozzarella into bits, and added some fresh basil with my fresh tarragon from the garden. This is my new taste of summer. Absolutely delicious!Barbara ZWashington, DC8/11/2021Great salad and great way to use up the bumper crop of tomatoes I have this year--I could eat this every day. I had halloumi on hand so I fried and used that instead of mozz or burrata, and I think it came out just as nicely. A hit.AnonymousBurlington, VT8/19/2020OH ME OH MY!!!  This is so yummy!  It’s the 2nd of 3 BA peach recipes I’ve made today that I have put in my calendar to have again next summer.  Not sure I will wait that long!AnonymousAlbuquerque NM8/16/2020this salad was FIRE. The dressing was so creative and amazing, and everything was perfectly balanced. Will definitely be making this again!AnonymousSouth Carolina8/3/2020Love this easy, delicious salad. I went into it cautiously optimistic and was blown away. The sweet and savory flavor combo is AMAZING!!! AnonymousPortland, OR8/12/2019Loved the recipe! As one of the reviewers before, added also melon and used tabasco. In Germany have not yet found burrata in the supermarket, so used just a nice fresh mozzarella, not as creamy but also good. AnonymousHannover, Germany10/14/2018I really, really, really enjoyed this ridiculously easy salad. It is a crowd pleaser, too and even by a 3 and 1 year old. Good flavor, not spicy at all.Buffalo, NY9/4/2018It would never have occurred to me to make a salad like this one but I loved it.  If you have leftovers, it wilts/softens a bit the next day but the flavors are even better...had some leftover rice and laid this over the top of it for a better desk lunch than most have.  :)AnonymousHouston8/19/2018This is hands down the best late summer salad I’ve ever made. I made it for a dinner party and it was completely gone by the end of the night. Here are some substitutions I made because I didn’t have all the ingredients on hand and it still tasted delicious.\n2 tsp rice vinegar -> 2 tsp white vinegar + 1/2 tsp sugar\n2 Tbs mild hot sauce -> 18 drops of original Tobasco\nThought I’d share just in case someone ends up in the same situation.AnonymousSalt Lake City8/16/2018This is ridiculously delicious! Yes! cookndc8/9/2018yum.\nAnonymousAtlanta8/8/2018This recipe is perfect as is!! I wouldn’t change a thing. It is Delicious and a show stopper. Everyone loved it. We had some leftover watermelon and added it to the left-overs the next day which was delicious too.AnonymousAR8/5/2018This salad is sensational.  It has wonderful flavor, looks and tastes great.  I used Gochugang hot sauce , as well as using fresh basil leaves instead of tarragon.  Fantastic.  It also kept well overnight and was delicious the second day. It's a keeper and a repeater.AnonymousLA8/3/2018Made it for company and it was a big hit. I used small hierloom tomatoes with wonderfully ripe (but not overly ripe) peaches. AnonymousGeorgia 8/3/2018Explore Bon AppétitSaladPeachStone FruitFruitTomatoVegetableBurrataCheeseSummerQuickEasySideGluten-FreeNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Chris Morocco"]}