{"id": "83ede3129c97146b6788a1f5dad4ee7b", "url": "https://www.bonappetit.com/recipe/sticky-and-spicy-baked-cauliflower", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Sticky and Spicy Baked Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueSticky and Spicy Baked CauliflowerBy Christina ChaeyJanuary 4, 20223.0(100)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintNo need to deal with a pot of hot oil to get crispy battered cauliflower. These oven-baked florets come out crackly and just rich enough before getting bathed in a sticky-sweet gochujang glaze.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronTongs$13 At AmazonWhisk$10 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonChef's Knife$34.53 At AmazonIngredients4 servings1cup (125 g) all-purpose flour½cup cornstarch2tsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1large head of cauliflower (about 2½ lb.), cut into large florets¼cup gochujang (Korean hot pepper paste)3Tbsp. soy sauce2Tbsp. pure maple syrup2Tbsp. mirin2tsp. unseasoned rice vinegarSteamed rice, toasted sesame seeds, and thinly sliced scallions (for serving)PreparationStep 1Preheat oven to 400°. Whisk flour, cornstarch, baking powder, and salt in a large bowl to combine. Whisk in 1 cup water to create a thin pancake-like batter (you may need to add more water to achieve the right consistency). Using your hand or 2 forks and working one at a time, dip cauliflower florets into batter, letting excess drip back into bowl, and divide between 2 parchment-lined rimmed baking sheets. Bake cauliflower until edges are just beginning to turn golden brown, 20–25 minutes.Step 2Meanwhile, whisk gochujang, soy sauce, maple syrup, mirin, and 1 cup water in a medium bowl. Pour sauce into a skillet large enough to hold all of the cauliflower florets (a 12\" skillet should do it) and bring to a simmer over medium heat, whisking occasionally. Cook, whisking, until sauce is thick enough to coat a spoon, 8–10 minutes. Stir in vinegar and remove pan from heat.Step 3Using tongs, transfer cauliflower to skillet with glaze and toss until florets are evenly coated in sauce.Step 4Divide rice among shallow bowls and spoon cauliflower over. Top with sesame seeds and scallions.How would you rate Sticky and Spicy Baked Cauliflower?Leave a ReviewTell us what you thinkReviews (35)Back to TopTriangleThis was fantastic. In can't stand the people that say, \"Well, I substituted X ingredient and it didn't turn out\" or \"What does coating a spoon mean?\" or \"it took longer in my oven\". Well, maybe your oven isn't calibrated, that's what oven thermometers are for. Substitute ingredients are your own risk. Nothing wrong with that, but don't complain of our doesn't work out. Sheesh.Leland WitterRaleigh, NC2/23/2022I have never made a recipe from BA that I didn't like to some degree.  Except...for this one.  The sauce was watery and never thickened it was was supposed to (thick enough to 'coat a spoon' whatever that means). The sauce tasted weird, and the cauliflower batter was rather odd tasting too.  I sat down to eat this and couldn't eat more than 4 bites. I couldn't believe it, I read over the recipe 5 times to see if I did something wrong? Nope.  Shockingly badRedwood City, CA2/21/2022I love the idea but had difficulty with the execution. The batter turned out more like for a corn dog, even though I added some extra water. The sauce was good, although I substituted sriracha for the Korean paste.AnonymousYpsilanti, MI2/17/2022Fantastic veggies!  We loved this. I had to  break off the excess batter from around the cauliflower  that continued to drip out in the oven which wasn’t great. I added fresh green beans and sliced mushrooms to the sauce, then the cauliflower. All in all 👍🏼👍🏼Jackie Michigan 2/9/2022I agree with other reviewers. There's no point in going through the batter step. Just cook the cauliflower however you'd like and pour over the sauce. Meg2/9/2022I recommend skipping the batter and just baking the cauliflower before tossing in the sauce.  We liked it very much.D DriscollRumson, NJ2/2/2022This is was a rare disaster for Bon Appétit, the batter was thick and stodgy , even with additional water, the baking time and temp were off and the sauce was meager and unimpressive. We had a few bites and tossed the rest. AnonymousWilson WY2/2/2022Hate to say it, but, this was terrible. Don't make this recipe.LC2/1/2022The sauce was tasty and the edges of the cauliflower were slightly crunchy, but to get that bit of crunch I had to up the temp to 425F for the final 5 min + add another 5 minutes of cooking time. So, it was OK and didn't take too long to make, so not bad for a weeknight vegetarian meal. Robin F.Toronto, Ontario1/31/2022Do they test these recipes before they publish them? I saw this in the magazine and it looked good so I made it. When I sat down to eat it..I had like 2 bites and then it went straight in the trash. I looked up reviews to see if I was alone and quickly found out I wasn’t. Such a waste of time and money. 0/10. Liz H1/31/2022Not sure why these reviews are so bad… I thought this was tasty, and didn’t have to modify a single  thing abd turned out great AnonymousDallas1/29/2022Disappointing. I adjusted batter mixture as others suggested, but at the end of the day, not worth the effort. If I were to make again, I'd suggest the following: replace 1/2 cup of the flour with panko and increase water to 1 1/3 - 1 1/2, bake in 425 if not 450 degree oven with convection on. Add starch /water slurry to the sauce to achieve 'glaze' status. Don't glaze florets in sauce, rather use as dipping sauce at table. BooradleySan Francisco, CA 1/29/2022This recipe is borderline inedible. I started having my doubts when applying the flavorless Elmers glue-like coating to the cauliflower. I did somehow miss the cooking down of the sauce and simply combined it, so I can’t say for sure how that might’ve changed the flavor, but it just tasted weird. This is the first time I’ve ever made a BA recipe that I threw away after choking down a few bites. Life’s too short to try this!!Ann T.Greensboro, NC1/26/2022Followed the tips to reduce the sauce, followed the tips to add more water for a runnier batter. The baker cauliflower came out of the oven crispy and the sauce reduced properly. BUT the sauce was not good. Not making this again. SvetlanaScottsdale 1/26/2022I don't know why this has such a low rating! I found it really tasty and good and pretty low fat / cal to boot! Its a little like a vegan General Tso's chicken. Yes, I needed more water for the batter, but any cook worth their weight should be able to figure out how to adjust a recipe to get the right consistency. AnonymousNYC1/26/2022Explore Bon AppétitDinnerMainEasyWeeknight MealsVegetarianHealthyishVeganCauliflowerVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}