{"id": "83f48a3ab0a4ada02026148b8ff753bb", "url": "https://www.bonappetit.com/story/baked-kale-recipe", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "How to Make Kale Chips Like It’s 2014 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Kale Chips Like It’s 2014The fastest way to eat an entire bunch of kale by yourself.By Sarah JampelFebruary 17, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, how to make kale chips.If a friend were to text me asking “How do I make kale chips?”—and, to be clear, I know exactly which friend this would be—I would say: “tear kale, toss with olive oil and salt, bake at 350 until crispy, 12–18 mins.😘” That cheeky little kiss signals the end of the conversation because this gal’s got things to do and, more importantly, there really isn’t much more to it than that.Making kale chips is incredibly, almost unbelievably easy, which half explains their enormous popularity. (The other half: “health.”) Sure, kale chips may have peaked eight years ago (seriously, they did), but so did I. I’m still living in 2014 and wearing the same pajamas to prove it. And I must say that while the pajamas have seen better days, kale chips have aged well.Kale chips are so light and crispy they’re barely there, ephemeral in the sense that they’re papery and fragile, threatening to dissolve into a million pieces if I grasp them with too much force. That makes me feel powerful! I can bite into them with gusto (crrrunch!), but they also dissolve on the palate like a Listerine strip. They’re satisfying and salty—at least the way I season them—and, in testing these methods, I unwittingly ate an entire bunch of kale in about 30 minutes while standing at the kitchen counter.But as tasty as kale chips can be, don’t be fooled: Kale chips are not chips in the same way that zoodles are not noodles, cauliflower rice is not rice, and spaghetti squash is not spaghetti. As long as you go into your kale chip journey with the expectation that they can supplement your tortilla chips but never replace them, your expectations can be met.Ready? Here’s how to make kale chips:Start with 1 big bunch of kale—that’ll fill up two baking sheets, which is probably all your oven has room for. Both curly kale and Tuscan (a.k.a. lacinato) will work. Some people prefer curly kale because the leaves’ ruffles get extra crispy in the oven; I usually have Tuscan kale around, so that’s what I use most often, and I also find that it crisps more evenly because it’s flatter and easier to dry completely after washing.Strip your kale leaves from the stems, then tear into pieces a little larger than bite-size (say 2-3\"), knowing that they’ll shrink as the moisture evaporates. Wash those pieces and dry them thoroughly—excess moisture is not your friend here, as it can cause the kale to steam rather than crisp. A salad spinner is your friend here.This is how to strip leaves from stems in no time.\nTransfer your kale to a large bowl and add about 1 Tbsp. olive oil and a big pinch or two of salt (I usually go accidentally overboard here—take heed). Now’s also the time to add other ground spices of your choice: dried harissa, ground cumin and coriander, a pinch of cayenne, garlic and onion powder, nutritional yeast, za’atar—anything that tastes great on popcorn will be appropriate. Use your hands to get the leaves well-coated, but no need to really massage them—all that bruising can actually render your kale chips more bitter.Spread your oiled, seasoned kale out on two unlined baking sheets so that they’re in a single layer, with as little overlapping as possible. If the kale is piled up, it will steam and wilt rather than dry out, so work in batches if you need to.Now bake your kale until it’s crispy. This language is purposely vague—you can bake the kale at any temperature between 250°, as in this recipe from Dan Barber, and 375°, as in this recipe from Heidi Swanson. I made two sets of kale chips side by side—one at a lower temperature, one a higher—and couldn’t discern any significant difference between the two. It probably goes without saying that kale baked in a cooler oven will take longer to crisp—about 30 minutes at 250° as compared to about 15 minutes at 350°—but might do so in a slower and thereby more even fashion. Whether you go low and slow or hot and fast, check the leaves halfway through and flip any heftier leaves. Any thicker, heftier pieces might have to stay in the oven longer to get brittle and crisp.Once your kale is hot out of the oven, you have another opportunity to add flavor, this time in the form of ingredients that would have burned in the oven, like lemon zest, grated garlic, or Parmesan. (Keep in mind that all of these ingredients will introduce moisture, which will make it harder for your chips to stay crispy over several days.) Let your leaves cool completely, then store for up to 2–3 days in a partially closed container at room temperature.To use up your chips, crush them into vinaigrette, toss them with noodles or pasta, pulverize into mayonnaise, mix into a salad for textural intrigue, or simply snack by the handful. However you enjoy them, promise me you’ll play “Happy” by Pharrell at least once as you’re doing it—it is 2014 after all.Explore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-17", "author": ["Condé Nast", "Sarah Jampel"]}