{"id": "83ffbd15efd3ec1b5f32c1a6255c9280", "url": "https://www.bonappetit.com/story/eko-kitchen-food-security", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "“I’m Cooking the Way That Nigerians Always Do When They See Their Community in Need” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersrestaurants“I’m Cooking the Way That Nigerians Always Do When They See Their Community in Need”Simileoluwa Adebajo started feeding the food insecure at her SF restaurant Eko Kitchen, and she's not going to stop even once the pandemic is over.By Simileoluwa Adebajo, as told to Brittany HutsonSeptember 30, 2020FacebookTwitterEmailPhoto by BEAU GAINESFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.When I opened Eko Kitchen in San Francisco a year ago, people came for the experience, not just the food. Here, they got Nigerian music. They saw the work of Nigerian artists. They learned how to cook Nigerian food through my classes at the restaurant. When my team and I got the stay-at-home order in mid-March, we thought things would be back in a month. That wasn’t the case.Restaurants have always been born out of a chef or an owner’s passion for food and their desire to share that. But we’re living in times where people cannot afford food or don’t have access to it. As a restaurateur, I realized I needed to step in to fill the gap. The federal government wasn’t going to do it. So during the shutdown, I connected with a nonprofit called SF New Deal, and I started cooking meals for them to distribute to the homeless and the elderly.Jollof rice with grilled chicken and plantains and ewa oloyin (honey bean porridge) with fried plantains.\nPhoto by Andria LoNow we’re working with a city program that feeds those who have the COVID-19 virus. So far, 8,000 meals have gone out of my kitchen. The menu varies between American food, like chili, and classic Nigerian food, like ewa oloyin, which is honey beans stewed with refined palm oil and shredded coconut. It’s very, very good. One time a man called to thank us because he hadn’t had a meal in three days. That made me feel like what I’m doing is worthwhile.Food insecurity was already a problem, and it will still be when the pandemic goes away. I see Eko Kitchen as one solution. Without COVID, my business wouldn’t have pivoted in this direction, but I’m making sure that giving in this way is built into our business model going forward.My goal has always been to shine a light on Nigeria, our culture, and our food. Feeding the most vulnerable is part of that. In Nigeria, wealthier people host soup kitchens. What I’m doing here is similar: I’m cooking the way that Nigerians always do when they see their community in need.Explore Bon AppétitCoronavirusChefsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Simileoluwa Adebajo", "As Told To Brittany Hutson"]}