{"id": "84128d4e60235cbb61cb59ac398316d4", "url": "https://www.bonappetit.com/story/three-things", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Three Things That Are Helping | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThree Things That Are HelpingI’ve been trying to bring softness to my daily life wherever possible.By Amanda ShapiroApril 16, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’m seeing a lot of old photos pop up on Instagram these days, all of us trying to remind ourselves that there was a time before social distancing. Part of me wants to roll my eyes...it’s barely been a month, and most of us have been sitting at home, glued to our Zooms and our FaceTimes. And while all the nostalgia is perfectly understandable, it’s all too easy to drown in it, the same way it’s easy to fixate on the future: When is this going to be over? When can I stop bathing in Purell? When can I sit at a bar and order a gin martini, extra olives, again?The reality is that, while most of the world might be on pause right now, our lives are still happening. Our bodies aren’t storefronts that we can lock and board up until it’s over. And, for better and for worse, time keeps passing.“Live in the present” is a terrible cliché even when the present is going well. So I would never say it, but I do want to share a few things that are helping me stay where I am—not in the past or the future, but here, in my sunny apartment full of plants and cookbooks, across from a hospital, in Brooklyn, New York.1. Cooking without recipesI’ve been leaning into improvisational cooking more than ever these days, with no one but myself to judge the results. Last week I roasted a whole fish for the first time—a little branzino I named Sir Francis, which I stuffed with lemon slices and dill and doused in olive oil and salt. I put the whole roasting pan on the table and ate the entire fish myself, no plate necessary. The whole situation made me laugh...and laughing felt great.My other meals have fit into one of a couple rubrics. There’s The Bake, which is a very loose shakshuka: some combination of onions, garlic, shallots, and/or anchovies, stir-fried in oil in a cast iron, plus greens (spinach, kale, collards) cooked until wilted down, beans (canned or cooked), and canned tomatoes (whole, crushed, or sauce) or coconut milk. I crack a few eggs on top and bake at 350 until the eggs are set and the whole thing is bubbling.Then there’s The Roast: two sheet trays filled with whatever I have on hand: chopped vegetables, cubed tofu, cooked or canned beans. I’ve been using a technique from this Smitten Kitchen recipe, which has you preheat your oiled sheet trays in the oven before dumping the vegetables onto the hot trays to cook. My vegetables come out extra crispy this way (it works especially well for eggplant and mushrooms), and my tofu gets that golden exterior that usually only comes from frying.2. Slowing downI’ve been trying to bring softness to my daily life wherever possible: not setting alarms in the morning, not keeping to a strict exercise routine, lying in sunny spots like I’m my dog, dancing alone in my bedroom, coloring, and other, um, solo activities. I feel like I’m teaching myself how to rest, which is something I’m always nagging my busy-bee mom to do but am equally bad at myself. Especially when I wasn’t feeling well, I was constantly puttering: making tea and stock, steeping herbs for steams, trying to keep the dishes from piling up. It took me a while to realize that sometimes doing nothing is the best way to take care of yourself.3.Building new routinesAmid all the softness, some new patterns have naturally emerged. I do one chore-type thing each morning—maybe it’s watering the plants or doing those dishes I left from the night before or putting in a load of laundry. And at the end of the work day, I pick a transitional activity—an old strategy I dusted off from my freelance days. Sometimes it’s a walk or a workout, other times it’s a phone call or a cooking project. (Let’s be honest, sometimes it’s blasting my favorite sad-song remix and cry-dancing.) On Sundays, I walk to Hart’s, where I pick up a pack of ground lamb or some homemade ricotta or whatever else I ordered ahead (I’m going for the whole chicken this weekend). And every day, I talk to my mom. Sometimes we’re chatty, sometimes we’re tired, sometimes one or both of us are in tears. And sometimes, as Phillip Picardi writes in this beautiful essay about calling his own mom, “we are both quiet, going about our routines, comforted just knowing that a person we love is on the other side, healthy and doing their best.”Call someone you love,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleWhat I Wish I Did Before I Got SickBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-16", "author": ["Condé Nast", "Amanda Shapiro"]}