{"id": "84227e6eadc29e820822003e7aad8524", "url": "https://www.bonappetit.com/story/best-chocolates-to-buy-online", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "The 17 Best Chocolates to Buy Online Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Best Chocolates to Buy Online Right NowWhether for a special occasion or any old Tuesday, these are the milks, darks, and even whites you need.By MacKenzie Chung FeganFebruary 2, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Are you eating chocolate right now? Do you want to be? The best chocolates—from lacquered, hand-painted bonbons to single-origin, small batch bars—are a mere click away.The BarsjcocoThis Seattle chocolatier made me question my commitment to dark chocolate. I did not expect mango plantain milk chocolate (flecked with crunchy bits of plantain chips) and cayenne Veracruz orange white chocolate (salty with just the right amount of heat) to be my favorites in its 10-bar sampler set, but here we are! Every day an opportunity for growth! For every three ounces of chocolate sold, jcoco donates the cost of a meal to partner food banks in Washington, California, and New York, so do a good deed and buy in bulk.Buy it at jcocoPhoto by Chelsie Craig, Food styling by Pearl JonesTony’s ChocolonelyDutch chocolate brand Tony’s Chocolonely is something of a contradiction. On the one hand, its zany 1960s circus packaging screams “Hey, our brand is wacky!” On the other, its mission is dead serious: ending child labor and slavery in the chocolate supply chain. At a whopping 6.35 ounces, the bars are enormous compared to most of the others on this list. I chopped up its milk caramel sea salt bar and folded it into Claire Saffitz’s Malted “Forever” Brownies (a very good idea) and hid its dark milk pretzel toffee bar from my partner (I apologize, Margaret). Buy it at Amazon or Thrive MarketRaakaMost chocolate is made by roasting fermented cacao beans, but Raaka’s single-origin bars are entirely unroasted. This makes for a brighter, fruitier chocolate—think about the difference between a lightly roasted coffee and dark French roast—that lets the raw ingredients shine.Buy it at Amazon or Food52Madhu ChocolateThis Austin bean-to-bar company mashes up Colombian chocolate with South Asian flavors like vanilla fennel, saffron milk, and masala chai.Buy it at Madhu ChocolateOmnom ChocolateEach offering from this Icelandic bean-to-bar company comes wrapped in paper patterned with a different animal—unicorns for the Caramel + Milk, swans for the Lakkrís + Raspberry (a licorice lover’s dream), and aggro crows for the charcoal-hued Black N’ Burnt Barley, which tastes like boricha and is every bit as metal as it sounds.Buy it at AmazonAlter EcoAlter Eco’s chocolate is good—you’ll find its Brown Butter bars stashed all around my house—but its commitment to sustainable farming practices is what makes this my go-to grocery store choice. Its recently launched foundation is helping cacao cooperatives in Ecuador and the Dominican Republic transition to a system of regenerative agroforestry, so that farming can be part of a diverse forest ecosystem rather than driving its destruction.Buy it at Amazon or Thrive MarketCasa Bosques’ hoja santa bar, a collaboration with chef Elena Reygadas\nCasa Bosques ChocolatesOnce you see the packaging on Casa Bosques single-origin bars, it will come as no surprise that founder Rafael Prieto’s day job is running a design studio. The core collection includes collaborations with Mexican culinary luminaries like Elena Reygadas and Enrique Olvera, and upcoming flavors from its limited-edition Laboratorio series include Parmigiano-Reggiano and castile flower with pistachio.Buy it at Casa Bosques ChocolatesThe Bonbons and TrufflesFormosa ChocolatesOakland-based psychiatrist turned chocolatier Kimberly Yang crafts artful, brightly colored bonbons that are almost too pretty to eat. The blood orange speculoos truffle features layers of citrusy ganache and hazelnut praliné studded with those buttery spiced cookies you get when you fly Delta. The coffee caramel, which looks like a cappuccino cup for dolls, has a perfectly bitter edge thanks to Taiwanese coffee and sugar that’s just on this side of burnt.Buy it at Etsy or Formosa ChocolatesLa Maison du ChocolatIt doesn’t get classier than La Maison du Chocolat, whose ganaches, pralinés, and truffles have been handcrafted on the outskirts of Paris since 1977. Buy it at Food52 or Saks Fifth AvenueMidunu ChocolatesGhana-born, New York–raised Selassie Atadika lived in 41 African countries during her time working for UNICEF as a child protection officer and emergency specialist. Now, she’s paying tribute to the diverse flavors of the continent through her truffles, which come in flavors like Cape Malay curry, Ethiopian berbere, and Moroccan mint tea and are made from single-origin Ghanian cacao by an all-female team of chocolatiers.Buy it at Midunu ChocolatesDelysia ChocolatierIn the hands of someone less skilled, green chili queso or chicken fried steak truffles would be gimmicky at best and downright disgusting at worst. But Austin chocolatier Nicole Patel manages to pull it off, concocting savory-sweet truffles that are more than just novelty. Her Taste of the South collection includes both more traditional options like mint julep and banana pudding as well as a Frito pie truffle, which features a corn chip center and a cheese, chive, and ghost pepper ganache that did not come to play.Buy it at Delysia ChocolatierVesta ChocolateNew Jersey–based spouses Roger Rodriguez and Julia Choi Rodriguez create single-origin bars, vegan barks, and “functional” white chocolate bars made with superfoods and antioxidant-rich ingredients like Diaspora Co. turmeric. But the bonbons, which might include flavors like milk and honey, salted caramel, and spiced maca, are really where it’s at.Buy it at Vesta ChocolateStick With Me Sweets’ box of 24 bonbons, all of them mine\nPhoto by Evan SungStick With Me SweetsThese are the chocolates that haunt my dreams. Everything that Susanna Yoon and her team make is exquisite, from the shiny, jewel-like bonbons to the Betterfinger bars which, unlike Bart Simpson’s candy bar of choice, don’t get stuck in your teeth. The bonbon collections come disguised in a box that looks like a book—handy if you decide you’re not in a sharing mood.Buy it at Stick With Me SweetsExquisito ChocolatesWhile many of Carolina Quijano’s single-origin chocolate bars are simple by design, made with only cacao and unrefined cane sugar to highlight the chocolate’s terroir, her bonbons and barks nod to the company’s home in Miami’s Little Havana, incorporating flavors like plantain and locally grown guava. There are also, crucially, chocolate-coated potato chips.Buy it at Exquisito ChocolatesThe OthersPure Chocolate by JinjiChocolatier and nutritional health counselor may not seem like professions that go hand in hand, but Baltimore-based Jinji Fraser has carved out an extremely delicious niche. Her confections may be free of dairy, gluten, and refined sugar, but you won’t miss them. The chocolate-covered, peanut butter ganache–filled Turkish figs are absolute mad genius sorcery.Buy it at Pure Chocolate by JinjiAndré’s Confiserie SuisseThis third-generation, family-run confectioner in Kansas City, Missouri, makes “old people” chocolates, and I mean that in the best possible way. The chocolate-enrobed orange peels, roasted almonds, and marzipan sticks are absolute classics that need no improvement.Buy it at André’s Confiserie SuisseChe Fico GiandujaSan Francisco’s Che Fico (one of BA’s top 10 restaurants of 2018) does wonderful things with chocolate—like this chocolate budino with candied walnuts that we lost our minds over. But if you don’t want to bust out the Silpat and make caramel, Che Fico’s gianduja is the instant chocolate fix you need. What is it? Nutella, more or less, but made with really good chocolate from Guittard and no palm oil. Spread it on toast slicked with salted butter, fold it into homemade Rice Krispies Treats, or, if you are me, eat it right off the spoon.Buy it at Che Fico AlimentariExplore Bon AppétitShoppingValentines DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-02", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}