{"id": "84304d8260fd1382f01055d5b907d15f", "url": "https://www.bonappetit.com/recipe/grilled-red-snapper-with-green-beans-and-lime", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Red Snapper Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Red Snapper with Green Beans and LimeMay 21, 20194.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWe're flipping the script and marinating after grilling. Inspired by the technique called escabèche, where cooked fish and meat are preserved in an acidic mixture, we're cooking first, marinating second—in this case, fillets of snapper in limey fish sauce. Make sure to buy skin-on fillets: The skin not only protects the delicate fish from overcooking but also gets deliciously crispy on the grill.Ingredients4 servings3Tbsp. plus ¼ cup extra-virgin olive oil, divided; plus more for grill1small shallot, thinly sliced into rings4Tbsp. fresh lime juice, divided½tsp. plus 1 Tbsp. light brown sugarKosher salt, freshly ground pepper4skin-on red snapper fillets (about 5 oz. each)8oz. green beans, trimmed5tsp. fish sauce2Tbsp. crushed salted, dry-roasted peanutsPreparationStep 1Prepare a grill for medium-high heat; lightly oil grate. Mix shallot, 1 Tbsp. lime juice, and ½ tsp. brown sugar in a small bowl to combine; season with salt and pepper. Set aside.Step 2Pat fish dry with paper towels and season all over with salt and pepper. Toss green beans with 1 Tbsp. oil on a rimmed baking sheet; season with salt and pepper. Grill beans, turning often (be careful not to let them fall through the grate), until softened and charred in spots, about 2 minutes. (To keep the green beans from falling through the grate, place a wire rack crosswise on the grill to create smaller squares and extra insurance.) Transfer to a platter. Pat fish dry again and rub fillets with 2 Tbsp. oil. Gently place on grate, skin side down, and grill, undisturbed, until flesh is opaque except for the thickest part, 6–8 minutes. Carefully slide a thin metal spatula underneath fillet, trying not to tear skin, and turn over; grill 1 minute longer. Place, skin side up, on platter with green beans.Step 3Whisk fish sauce, remaining ¼ cup oil, remaining 3 Tbsp. lime juice, and remaining 1 Tbsp. brown sugar in a small bowl until sugar is dissolved. Drizzle over fish and beans and scatter shallot mixture over. Let marinate at least 15 minutes and up to 2 hours. Cover and chill if holding longer than 30 minutes. Bring to room temperature before serving.Step 4Top with peanuts just before serving.How would you rate Grilled Red Snapper with Green Beans and Lime?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWe’ve made this a few times already, it’s now a favorite staple whenever we see Red Snapper at the fish market. Today we bought 2 whole Snappers, the fish monger filleted them.  Dang!  It’s marinating now.   Can’t wait.  \n\nSusan and Don11/8/2020Was able to get a whole red snapper from a local seafood restaurant (Seawolf has incredibly fresh market fish for anyone in North Brooklyn!) Only had to adjust grilling time since we weren't cooking fillets and this recipe is so incredibly easy and delicious. I'm sure you can sub out the snapper for another white fish, but the flavors of the fish sauce work really great with the snapper. Highly recommend! skskskBrooklyn, NY5/18/2020Explore Bon AppétitEscabècheSnapperFishSeafoodGreen BeanVegetableLimeCitrusFruitQuickMainGluten-FreeDairy-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast"]}