{"id": "8433804d8e84b59e173efb362b4e42d3", "url": "https://www.bonappetit.com/recipe/sweet-potatoes-with-maple-tahini", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Sweet Potatoes With Maple Tahini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueSweet Potatoes With Maple TahiniBy Sophia RoeDecember 1, 20204.3(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintChef Sophia Roe, the host of Counter Space on Vice, has some sweet potato intel: Keep your baking sheet in the oven as it preheats so the sweet potatoes start to sizzle and crisp as soon as they hit the pan, cutting down on cooking time. The next time you scan the bins of sweet potatoes at your grocery store or farmers market, look for the variety known as Okinawan (or sometimes Hawaiian) sweet potatoes. They have beige skins and intensely bluish-purple flesh that’s dry and starchy and ideal for roasting or frying. If you can’t find Okinawans, look for other tan or purple-skinned varieties such as Japanese sweet potatoes.Ingredients4 Servings2½lb. Okinawan or Japanese sweet potatoes (about 5 medium), scrubbed, cut into ¼\"-thick wedges4Tbsp. avocado or vegetable oil, dividedKosher salt, freshly ground pepper½cup tahini2Tbsp. Champagne vinegar or white wine vinegar1Tbsp. plus 1 tsp. pure maple syrup2tsp. finely grated lemon zest1Tbsp. fresh lemon juice3Tbsp. pine nuts¼cup chopped dillFlaky sea saltPreparationStep 1Place racks in upper and lower thirds of oven and set a rimmed baking sheet on each; preheat oven to 375°. Toss sweet potatoes in a large bowl with 2 Tbsp. oil; season with kosher salt and pepper. Carefully spread out half of sweet potatoes in a single layer on each baking sheet. Roast, turning halfway through, until golden brown, 30–35 minutes.Step 2Meanwhile, whisk tahini, vinegar, maple syrup, lemon zest, lemon juice, remaining 2 Tbsp. oil, and 2 Tbsp. water in a small bowl; season maple tahini with kosher salt and pepper.Step 3Toast pine nuts in a dry medium skillet over medium-high heat, tossing often, until golden brown, about 2 minutes. Transfer to a small bowl and let cool.Step 4Spoon some maple tahini into shallow bowls or onto plates and arrange potatoes on top. Scatter dill and pine nuts over and sprinkle with sea salt.How would you rate Sweet Potatoes With Maple Tahini?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleAll I could taste was the white wine vinegar. It was way too over powering. Either cut out the vinegar or add way less. AnonymousTampa, FL11/17/2021This was really tasty! Were the sweet potatoes crispy? No, but still very good. I had some halloumi I needed to use so I threw that in as well and it worked great! Will definitely make again.KatieVancouver, Canada10/14/2021Why it  always says “crispy sweet potatos”?  You cannot make them crispy ever... the type of starch\nAnd fibre they have cannot do this possible At least  once they are  dehydrated previously and cook in the oven drizzled with lot of oilXiomara Canada1/21/2021Wow wow wow!!!! I’m not usually a potato fan, but I am now! These are delicious and super easy to follow for us non experienced cooks. Ngozi Lagos, Nigeria12/31/2020Delicious! Followed recipe exactly, using a mix of Japanese and purple sweet potatoes, and it was so good. The sauce is addictive. However, I will add less lemon peel to the sauce next time because it was a bit overpowering. Also, if you have leftovers, don't reheat the sauce because it falls apart! Let it come to room temp.AnonymousLongmont, CO12/26/2020Explore Bon AppétitSweet PotatoPotatoVegetableTahiniCondiments, Sauces & PastesEasySideDairy-FreeGluten-FreeVegetarianVeganHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sophia Roe"]}