{"id": "844638cc098c67a5a6c573cd41b52954", "url": "https://www.bonappetit.com/story/tostitos-salsa-con-queso", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "I Can’t Help But Absolutely Demolish a Jar of Tostitos Salsa Con Queso | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can’t Help But Absolutely Demolish a Jar of Tostitos Salsa Con QuesoThis queso has some bite, is velvety smooth, and refuses to ever congeal.By Adam RapoportApril 21, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.We’ve got a recipe on Basically called Queso, Not From a Jar. The implication, I guess, is that something from a jar can’t be that tasty—and that a homemade version of queso must be inherently better for you, right?Well, consider that the Queso, Not From a Jar recipe starts off by calling for half a pound of American cheese...and I’ll just leave it at that. Queso is queso, and if you try to make an all-natural version with real cheese, good luck. (Just ask Sohla El-Waylly, who tried in vain when she developed this recipe.)So that brings us to Tostitos Salsa Con Queso (from a jar). Yes, I scolded my 12-year-old when he brought it home from the grocery store. I told him that we don’t eat stuff like that in our house. And then I proceeded to heat some up in a little pot and absolutely demolish it with him.The queso is “Medium,” thanks to the addition of real jalapeños along with chopped red peppers and tomatoes. (There’s also something called sodium hexametaphosphate in the ingredient list, but what did you expect? It’s in a jar.) So, yes, this queso’s got some bite, and it’s velvety smooth, and it absolutely refuses to ever congeal. I like it warm with a bowl of chips, but I’ve also spread it on a skillet-toasted tortilla when assembling a breakfast taco.Just to make sure I wasn’t losing my mind, I texted Alex Beggs, our resident snack expert. She wrote an entire feature story on crispy foods and, in the name of research, visited the Frito-Lay headquarters in Plano, Texas. Beggs texted back immediately: “Yes, it’s certifiably good.”And there you have it.Buy it: Tostitos Salsa Con Queso, $4 at TargetAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingCondiment/SpreadRead MorecultureI Put This Condiment on Everything When I Can't Be Bothered to Make a SauceBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-21", "author": ["Condé Nast", "Adam Rapoport"]}