{"id": "8449971cb8d4b1c4520818f4f8698ea9", "url": "https://www.bonappetit.com/story/how-to-buy-pork-ribs", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "The Types of Pork Ribs and How to Buy the Right Ones | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy the Right Kind of Pork RibsBecause there's still time for one last barbecue.By Sarah JampelAugust 21, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailSo you want to make Molly Baz’s Sticky-Sweet Five-Spice Pork Ribs but you can’t pick out a St. Louis-style rib in a line up. Fortunately for you, pork ribs are fairly interchangeable (see: our Best-Ever Barbecued Ribs will work with any variety of rib you come across!).But before we get to swapping one type of rib for another, let’s break down the three pork ribs you’re most likely to find:From top to bottom: St. Louis-style, baby back, spareribs.\nPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolSpareribsPictured at the bottom, these are the ribs that come from the belly (as in, the underside) of the pig. The rest of the belly meat is cut away, often used to make bacon, pancetta, or other cured pork products, but the spareribs retain a fair amount of porky, succulent meat.St. Louis-style ribsPictured on the top, these are simply spareribs spiffed up—as in, the hard breastbone and chewy cartilage has been removed. Compared to spareribs, St. Louis-style ribs are uniform in shape (a beautiful rectangle!) and a little easier to work with. They’ve got less meat than baby back ribs (we’ll get to those next) but that meat is fattier. And because they’re thinner and flatter, they also brown more evenly.Baby back ribsThese are the small ribs pictured in the middle. But they’re not from baby pigs! I repeat: not from baby pigs. Whereas spare ribs come from the belly area, baby back ribs are taken from around loin, the muscle that runs along the pig’s back on either side of the spine. They’re curvier and shorter than spareribs (hence, the diminutive “baby”) with lots of lean meat both between and on top of the bones. Because they’re smaller than spare ribs, they’ll take less time to cook. They also come with a higher price tag. (After Andy Baraghani professed his love for fattier, more flavorful St. Louis-style ribs, I asked him why anyone would call for baby back ribs instead: He said it was because they’re “the chic rib.” Do what you want with that information.)Okay, but what if you can’t find the type of rib that the recipe calls for? Don’t freak: Any of these three varieties of pork ribs will work great. You’ll want to adjust the amount of salt depending on the weight of the racks (figure one teaspoon kosher salt per one pound meat) and keep a close eye on the cook-time: Baby back ribs will cook more quickly, whereas spareribs will need more time to get tender. And if you want to feed the same number of people with baby back instead of St. Louis-style, you’ll likely need to buy twice the number of racks (as is each baby back rack is so much smaller). Since, um, eating fewer ribs isn’t really an option.No matter which type of rib you get your hands on, cook it low and slow for super tender meat and don’t forget a sticky, spicy-sweet glaze.Rib ready:Sticky-Sweet Five-Spice Pork RibsLacquered with a tangy, garlicky hoisin glaze, these ribs are impressive without being burdensome: There's no grilling or marinating—just two hours in the oven followed by a quick broil.View RecipeExplore Bon AppétitPorkRibRibsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-21", "author": ["Condé Nast", "Sarah Jampel"]}