{"id": "845749a1b469acbbe36cd167a8c9c423", "url": "https://www.bonappetit.com/story/payroll-protection-program-restaurants", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "The Paycheck Protection Program Is Complicated For Restaurants. One Chef Explains Why. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsPPP Is Complicated For Restaurants. One Chef Explains Why.The Paycheck Protection Program (PPP) is a lifeline for restaurants. But it’s also a big risk. Mason Hereford, the chef and owner of Turkey and the Wolf in New Orleans, is wondering if he should take it.By Mason HerefordMay 18, 2020FacebookTwitterEmailCourtesy of Turkey and the WolfFacebookTwitterEmailWhen the Paycheck Protection Program (PPP) was launched in early April, it was meant to help small businesses get back on their feet by offering a forgivable loan to pay for two month’s worth of payroll, rent, and utilities. However, given the rules for how the money could be used, chefs and restaurant owners found the program to be deeply flawed. Still, in desperate need of funding, many applied for the loan, hoping that the rules would change. Mason Hereford, the chef and owner of Turkey and the Wolf (a Hot 10 alum) and Molly’s Rise and Shine (a Top 50 nominee) in New Orleans, was one of more than 1.6 million small businesses whose applications were approved. Here, Mason breaks down why PPP doesn’t work for restaurants, what changes would be necessary for the loan to work, and what that means for restaurants like his in the future. —Elyse InamineMan, I miss my fucking job. The people I work with are my best friends. I know I’m lucky. And I know it sounds like bullshit, but having fun with each other and translating that into a good time for our guests is the most important part of the job. This is easy for me to say because I work with a bunch of people wiser and more talented than I am, but knowing how to support them ain’t as obvious as it used to be. My restaurants are closed, just like thousands of others. So what do I do? I’m writing an op-ed. Go figure.I’m on my computer constantly these days. I sit in on Zoom meetings with the Independent Restaurant Coalition (IRC). I do daily calls with the Hospitality United Alliances (HUA). Sometimes, these calls go on for hours—they can feel more like a workaholics support group. We’re consumed with figuring out how to make positive changes for the little guy restaurants. We’re wondering how to keep everyone in a job. We’re trying to survive to pay our bills. We’re trying to understand what the Paycheck Protection Program (PPP) is.Before PPP came out, I was obsessed with figuring out how to get in line. I emailed a dude at the bank every couple of days, just reminding him, Hey, I’m here. I heard it was first come, first serve, which was terrifying. I realized, Wait, this might run out. Then it did. Somehow, I was approved for a PPP loan a few weeks ago. The bank told me I had 10 days to sign.I didn’t know what to do with the thing. I’d spent so much time learning about PPP and I felt strongly that it wasn’t right for me. I thought I’d have to cut everyone’s pay to make it work, so my intention was not to take it. I wrote an email to my staff: PPP is out, you’re fucking in. This thing is confusing and full of red tape. I ain’t touching it.I’m privileged to have a badass named Margaret as my accountant. She studied every sentence of that bill and attended an unreasonable number of webinars to learn how to interpret its limited language. If you don’t follow the rules to the letter, you have to pay back whatever the bank doesn’t forgive in two years. Keep in mind, the loans I used to open my restaurants have 10-year terms. Restaurants can handle those. But taking on a loan that you have to pay back in two years with a whack-ass, COVID-19-depressed business model is a set-up for failure. I’m worried about the tons of mom-and-pop restaurants out there who have a handful of employees and no badass accountant. This stuff is fucking dense. If you slip up, you can owe a lot of money when you don’t really have it.Another hurdle is that 75 percent of the loan has to be spent on payroll and the remaining 25 percent on rent and utilities. That’s not such a problem if you’re open. But it is if you’re closed like us. You have to re-hire your staff, starting right when you get the money—not whenever you’re ready to use it. And you only get eight weeks to spend those PPP funds, if you want them forgiven. But after those two months, I may not be ready to open and I won’t have any income to keep running the business, so we’ll be back at square one.The bill is also designed so your staff makes at least 75 percent of what they made before. The loan is 2.5 times payroll, but you can calculate payroll three different ways. Each way results in a different number, which leads to a different loan size. Unemployment from the federal government is $600 a week, plus whatever your state offers. In Louisiana, that adds up to $847 a week. For some restaurant workers, going back to work could mean making less than unemployment. A lot of businesses I’m talking to are committed to matching unemployment because not doing that just sucks. It’s not the employees’ fault that there is a better financial option for them than returning to work. I’m glad there is one. But it just presents a unique issue with the bill, which was meant to get people off unemployment. No one wants to take a pay cut to go back to work and risk their health.But if you want the loan forgiven, you have to hire back 100 percent of your staff at once. So you’re asking them, please come back to work to make takeaway meals or help with upkeep of the restaurant, maybe take a pay cut, and, at the end of eight weeks, we don’t know if you will have a job for two reasons. Either we won’t be ready to open, so you’re going to be laid off again and have to fight your way back through the unemployment system. Or we’ll be ready to open, but because of future mandates saying we can only operate at a limited capacity, some jobs won’t be available. That’s a raw deal for the staff.Alex LauThat’s pretty much what I told my team. I was so frustrated by the terms of the loan that I told them I wasn’t going to take it, unless the rules changed. Everyone who responded was cool with it. They were like, Thank you for not fucking us.A couple hospitality groups have been advocating super hard to change guidance on how to use PPP. They’ve been lobbying to have the rules changed to better serve the needs and vulnerabilities of our industry. One change is the start time for the eight weeks. If your clock could start when you’re able to open, instead of when you get the money, that would give restaurants a chance to access its intended benefits. Another improvement would be flexibility on how to spend the funds. If you could use the loan to pay for the things you need—instead of just payroll, rent, and utilities—that would be huge. You could invest the money into reopening and figuring out how to make sure all the jobs still exist on the other side.The big thing the hospitality groups are asking for right now is a restaurant stabilization fund, which would take restaurants’ unique business needs into account. It would be a fund that does not require restaurants to take on new and potentially crippling debt. A fund we could use flexibly to cover what we owe our vendors and to survive months of decreased sales. A fund that would be just as accessible for real small business owners, mom-and-pop places with fewer than 50 employees and less than a million dollars a year in sales. Updates to the PPP will help restaurants, but they’re an eight-week fix to a multi-year problem. The stabilization fund is the real fix.Everyone keeps using the word “pivot.” And we’ll have to pivot to ride this thing out. Everyone will. This is the busy season for New Orleans, with Jazz Fest and college graduations. This is when you’d make half of your yearly income, just in these two months. Restaurants lost that. I worry so much about the restaurants that give our city its character. Seeing what’s happening in our bank accounts and our buddies’ bank accounts, I can’t imagine how restaurants can start back up without something from the government to get them back to where they were before. The idea of New Orleans without its restaurants is the saddest fucking thing.To break even at Turkey and the Wolf, we have to serve 300 customers every day. On good days, we serve more, which is where our profits come from. We will have to figure out how to hit those numbers, if we want to keep every member of our team employed. So my wheels are spinning. I’m wondering if we can add more services. I’m thinking we can turn Turkey and the Wolf into a breakfast place in the morning. I’m wondering if we can get a couple pizza ovens at Molly’s and become a to-go pizza place at night. Maybe the city will finally let us serve booze there, despite our zoning. We just want so desperately to keep the whole team intact. We have no plans to fail. But we do know that we’re at the start of an uphill battle that could go on for a couple of years.So, how do we rejigger the restaurants we dreamt of opening? How do we make people excited about to-go food? How can we continue to put having fun over sales, when dropping revenue could cost someone their job? Turkey and the Wolf ain’t shit without fun.I ended up signing this PPP thing early last week. I did it because Margaret, my savior, figured out how everyone on our staff can make a fair amount more than unemployment. Since our rent and utilities at both restaurants are less than 25 percent of the loan and there is nowhere in the guidance that says we can’t pay our employees more than the allotted 75 percent, we figured we’d pay our people as much as possible even though we’re not ready to open. They will need a nest egg to depend on for the next few months while we figure out how to get everyone back to a livable number of shifts.So I sent out another email: Hey, get ready—we got some options for you, only to find out at the end of last week that the Treasury Department might come out with new guidance at any time, which could make the PPP more sustainable for restaurants. Now we’ve decided to hold off on our plan. Thankfully, my staff is very patient with me.The reality is that the PPP wasn’t designed to deal with the long-term economic crisis businesses are facing. It was just supposed to get us through eight weeks. The pandemic is likely to hang around a lot longer than that. So, we’re waiting, listening to updates from Congress, talking to chefs on HUA calls, supporting each other, and trying to sort it all out. But I realize that waiting for more guidance in itself is a privilege. It means you got away with halting payments to your landlord, or that last payroll didn’t wipe you out, so you don’t need to use the loan immediately. But for a lot of restaurants, spending the money immediately is a matter of life or death. Now, I’m just hoping their interpretations of the bill’s language doesn’t hurt them and that the improvements we’re advocating for can be applied to their situations retroactively.Before all this, we were always chasing the party, another excuse to celebrate together. There was always something on the horizon, the next good time. That’s what restaurants are for so many people: a good fucking time. I love them fiercely and I worry about their future constantly. I want them to survive this.Explore Bon AppétitRestaurantsCoronavirusChefsRead MorecultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-14", "author": ["Condé Nast", "Mason Hereford"]}