{"id": "845cd9527d7ddbde47c163a4170ac29b", "url": "https://www.bonappetit.com/story/never-fail-marinated-zucchini", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "This Marinated Zucchini Situation Is My Favorite Thing About Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Marinated Zucchini Situation Is My Favorite Thing About SummerAnd it'll be yours too pretty soon. Of all the dishes I've been looking forward to these last nine months, this marinated zucchini is number one.By Emily SchultzMay 31, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Not that I'm looking for another job or anything, but if I saw a listing for the role of Ambassador of Summer, I'd apply in a heartbeat. My resume would enumerate my many qualifications. My ability to quickly bounce back from a sunburn. My proficiency in eating ice cream three times a day. My beach cooler-packing prowess. And last—but most certainly not least—my 26 years of experience loving summer vegetables. From the first snap pea spotted at the farmers’ market until pumpkin season rolls around, you’ll find my kitchen overflowing with colorful fruits and veggies, tomato juices running down my chin and fingers stained red from cherries and strawberries. I just. Can't. Get. Enough.And as much as I love slathering a fresh piece of toasted sourdough with mayo and slices of ripe heirloom tomato and calling it dinner, there are times when I’d like to put in a little more effort, like when I’m entertaining friends on a roof or inviting myself to my mom’s beach house. That’s why Molly Baz’s marinated zucchini with ricotta and hazelnuts has become my go-to dish when I’m trying to be my true summer self while still impressing people. Deeply-charred summer squash, a zippy dressing, fluffy clouds of ricotta—what's not to like? All that, and a shower of herbs and nuts, too.Green or yellow, it doesn't matter—all summer squash love this marinated zucchini treatment.\nI’ve applied the simple tricks Molly has taught me through this recipe to other recipes, like salting the zucchini to extract excess water and then searing it in a ripping hot pan to get it all caramelized. And there are endless riffs that can be made to this recipe, too. If I impulse-buy basil I can tear that over the whole dish instead of mint. If I have walnuts but not hazelnuts, no big deal! Just make sure to serve the marinated zucchini with bread that's hefty enough to make it feel like a vegetarian main, and plenty of WAJU margaritas and ice pops to make it a proper summer meal. That's some good advice! I’ll just go ahead and update my Linkedin status to Ambassador of Summer now, thank you very much.That marinated zucchini recipe? Right this way...Marinated Zucchini with Hazelnuts and RicottaZucchini is anything but boring when bathed in a kicky vinaigrette.View RecipeExplore Bon AppétitNever FailBasicallyZucchiniRicottaHazelnutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-31", "author": ["Condé Nast", "Emily Schultz"]}