{"id": "8464ed082460107fdc79ccfb23b48af1", "url": "https://www.bonappetit.com/story/wine-soaked-weekend-in-the-loire", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "My Totally Racous, Très French, Super Wine-Soaked Weekend in the Loire | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Totally Racous, Très French, Super Wine-Soaked Weekend in the LoireAt an epic gathering of natural winemakers in France’s verdant river valley, I slurped oysters and downed magnums and got a sense of what makes this community, and its wine, so special.By Amiel StanekDecember 13, 2019FacebookTwitterEmailIllustration by Edward SteedFacebookTwitterEmailLet's get one thing straight: I know very little about wine. I drink a lot of it, sure—the natural stuff more specifically, which as far as I understand it is a loose, poorly defined term that more or less refers to wine made by small producers without the addition of weird chemicals and with the addition of eye-catching labels. But compared with the friends and sommeliers whose oenological ramblings I excitedly nod along to, I often feel like a poseur. I know my way around a wine list, but at the end of the day, I’m a sucker for bottle art. I will always order the hypebeast wine I recognize from Instagram. I use the word funky too often. My wife, Lauren, and I went to a hip wine fair once and bought a poster we had seen in hip wine bars and hip wine stores because we thought it looked cool, not because we knew anything about “Catherine et Pierre Breton,” the French winemakers whose names were scrawled across the bottom. It hangs above our dining room table, and when we’re having our Wine Friends over, I’m always nervous someone will ask me about it, the same way 13-year-old me prayed older kids wouldn’t see my Sex Pistols T-shirt and ask questions about a song that wasn’t on the greatest hits album.Which is why it felt exceedingly trippy to find myself standing in a small warehouse in the middle of the Loire Valley of France at three o’clock in the morning watching an apparently legendary 60-ish vigneron named Pierre Breton dancing to Blue Suede Shoes by Elvis, ruddy-faced, eyes closed, a pint of foamy draft beer in hand and a big cigar clamped tightly between his teeth.How the hell did I end up here?Illustration by Edward SteedLast November, at a Bon Appétit pitch meeting, I threw a (wobbly) Hail Mary that went a little something like this:“So, two Decembers ago, when Lauren and I went to Paris, we were hanging out with Belle”—a former BA staffer who turned me on to natural wine—“and we wanted to go to the Loire Valley to visit a winemaker and then it turned out that all of the heavy hitters”—I do believe I used the words heavy hitters to refer to French natural winemakers—“were actually going to be at this guy Hervé Villemade’s place”—I was definitely at this point still mispronouncing it ER-v rather than ehhhrr-VAY—“for this big annual open house party free tasting thing that you can just go to. He’s legendary and this party is legendary and so we went and it was so cool and all of these people whose names I’ve seen on bottles of wine were there getting drunk and pouring their wine like it was no big deal and roasting lambs over an open fire made of grape vines and it just felt like a big farm party and it was the first time I really got natural wine—that it’s wine made by real people who are farmers who you can visit. And I think it would be cool to go back and...write about it? Because Americans are so alienated from wine, they’re completely cut off from the production of the thing, but if we could help them understand that it is an agricultural product made by real people’s hands, they would come to appreciate it in a radically new way.”Needless to say, I did not walk out of that conference room thinking I would be booking a ticket to France the following month.I spent the next two weeks scrambling desperately to confirm that I hadn’t bluffed this whole story into existence. I couldn’t find information about the annual party anywhere. Hervé never responded to any of my emails. (French farmers don’t seem to be, er, computer people.) A wine distributor confirmed that Hervé is, to be sure, a Big Deal, a (literally!) sulphur-allergic vigneron who took over his parents’ estate and switched to natural winemaking at the turn of the millennium (i.e., before it was cool), and that the Villemade family’s generosity is well-known. Finally, a few days before my flight, Hervé’s U.S. importer communicated that I was coming, and Hervé communicated that that was fine. And I flew to France just to go to a party—and, I hoped, learn about the real people behind all that pét-nat.Illustration by Edward SteedFast-forward through our two-and-a-half-hour drive south from Paris and its graying late-autumn landscape, past Yellow Vest protesters burning pallets at roundabouts, to the tiny town of Chitenay. We checked in at our comically quaint country inn, where we were greeted by a stack of glossy four-by-eight-inch flyers with a photo of purple-black grape clusters overlaid with white lettering. “PORTES OUVERTES Chez Hervé VILLEMADE,” it read, and underneath, “8/9 Décembre 2018. Dégustation- Vente 11h>18h.”Our hotel was close to Hervé’s vineyard, a straight shot down a narrow country road flanked with towering trees, and we rolled up to what I understood to be the pre-party at 6:30 p.m. sharp to find a dozen or so mostly middle-aged winemakers slurping wine and shucking fat emerald-tinged Brittany oysters. I spotted Hervé right away. Sturdy, almost boyish looking despite his salt-and-pepper hair, he greeted me warmly with a handshake and a smile. And then...we stood there in a circle with some other guys while a conversation in French took place that I assume had something to do with my inexplicable presence.I quickly came to understand two things. First: It wasn’t that Hervé didn’t speak English, it’s just that he took no real pleasure in it. It seemed to fatigue him in the way that highly competent people are fatigued by activities they aren’t all that good at. He was not going to walk me through the particulars of his winemaking philosophy or practice—which was just as well, honestly, because my own grasp of that stuff in English is shaky at best. Second: It wasn’t that Hervé didn’t want me there, but he also didn’t exactly care in a special way either. This weekend, and especially this small pre-party gathering, was an opportunity for him to show hospitality to comrades and friends who weren’t merely consumers of wine; they were wine. I would experience the same abundant generosity that he showed all of his people, but there would be no dog and pony show for the American writer promising to write a Big Story for a Food Magazine. Publicity was not a means to greater interconnectedness with his community, and as such was pretty much beside the point.A tasting glass was thrust into my hand, and I followed Hervé and the gaggle of winemakers as they wound their way through rooms filled with towering tanks and barrels, sampling his wines in various stages of fermentation and finesse—cloudy, barely sweet whites working their way toward crispness; princess-pink, just-pressed reds that tasted like cherry kombucha. I nodded along, smiling, while the squad, I could only assume, asked technical questions and compared notes.This gave me ample time to gaze around the room at the blown-up freshly wheat-pasted photographs that covered the walls—images of bearded mop-wielding young men emerging giddily from what appeared to be the now-full tanks around us, portraits of dreadlocked women hauling bins full of grapes. I recognized two of the women from the photos, 20-somethings with leg warmers and knitted beanies, standing outside shucking oysters and approached them timidly.Illustration by Edward SteedI was relieved to find that Nou Nou and Mari, my new Party Friends, did, in fact, speak English. As we rolled cigarettes and slurped oysters, they explained that they had worked the harvest with Hervé. Winemaking is a year-round activity—there is always something to be done, be it bottling, shipping, pruning vines—but the harvest, from late summer to early fall, is an all-hands-on-deck frenzy. When the grapes are ripe for picking and pressing, it’s a race against time, and crews of workers camp out, sharing long days of work and long nights of partying. They seemed summer-camp-bonded with this place and each other. They had slept on this ground, eaten and drank together, lived by the rhythms of the grapes and the seasons. And we were here, after the dust had settled and the leaves had changed and everything had calmed, enjoying the fruits of their labor, together.More people showed up; more snacks were carted out. Wide ceramic troughs of homemade country pork pâté and rough, aspic-jiggly headcheese, wheels of crusty brown bread, fat links of saucisson sec, more oysters. The standing tables outside gradually filled with bottles in various states of open and emptiness, some of whose labels I recognized and some without labels at all. Then, at around 10 p.m., Hervé stood on a chair, announced something in French, and the now-two dozen or so revelers all filtered out into the parking lot to their cars, apparently to go to dinner. Wary of a DWI in a foreign country and with a long day ahead of us, our photographer, Jimmy, and I made our way to bed.“Where did you go last night?!” Nou Nou called to us from behind a long folding table on one side of the garage that was now stacked high with oysters trucked in from the coast. They had been out, by her hazy account, until 3 a.m. at least. It was 11 a.m., and last night’s revelers were arrayed across one of the large rooms, stationed at barrels, pouring (and drinking) wine from their respective properties for the early crowd. “We are a little, how you say, gueule de bois,” she said, crossing her eyes and knocking performatively on her head with a fist. “Er...hungover?” I offered delicately. “Oui! Oui!” she exclaimed.Illustration by Edward SteedBy noon the party was in full effect. Some people arrived in campers, in it for the long haul; some came in minivans, entered the tasting room with handcarts, and left with an axle-straining number of cases of wine. I made the rounds, edging my glass in between bodies to sample whatever each of the winemakers was pouring. There were 18 in all, small-scale vignerons from across the country whose names I recognized from the bottle lists of the kinds of natural-wine-obsessed restaurants I frequented back home. Breton. Mosse. Descombes. Binner. My notes started to make less and less sense, and I walked to the adjacent room lined with tables and benches where Hervé’s family had set out a seemingly never-ending buffet. Pâté en croûte. Carrot rapé. Celery root remoulade. One million funky, moldy, sweating disks of cheese and links of saucisson. If the wine on offer represented the vanguard, what’s happening right now, the food was classique. A band started playing and the echoey metal room reached a fever pitch loud enough to drown out the sound of shattering glasses. A duo of kids who couldn’t have been older than 12 set up deep fryers and started selling pommes frites outside, the Gallic answer to the suburban lemonade stand. It was 2 p.m.I made a new friend: Laurent Saillard, a local winemaker who spent decades in New York restaurants before moving to the Loire. Laurent became our default ambassador and hype man, introducing us around and whispering something in people’s ears that made them somewhat more interested in our presence. He graciously answered my questions about who was who and what was what. The scruffy Pig Pen–looking duo selling murky-looking unlabeled cider in a corner? “Hippies. Anarchists. They work the harvest, party hard but work harder. Get up drunk and work, work, work.” The fratty-looking men in puffy vests? “Ugh. Beaujolais. They’re fascists, but they have the best f*#%ing terroir, it’s not fair.”There was a palpable shift in the party’s energy around 5 p.m., when the winemakers gave up any pretense of conducting formal tastings and began to abandon their stations, leaving bottles open on their respective barrels, and repaired to the outdoors with cigarettes and full glasses in hand. That’s when the wheels really came off; the tasting room was now self-service. The vibe grew louder, drunker, rowdier.As things got looser I started making inroads with the younger crowd, the millennial sons and daughters of winemakers who were getting ready to take the reins from their parents. Joseph Mosse, the son of Agnès and René Mosse, who poured splashes of his herbaceous prototype vermouth into my glass of pét-nat rosé. I met Héloïse Lienhardt, who along with her brother Antoine took over the family winemaking operation in Burgundy. She feigned polite interest in my spiel about this story until I got to the “Like, I just want Americans to know that wine is made by farmers” bit, at which point she became so animated that she nearly spilled her wine. “Exactly! This is what they need to know! What we are doing is different.” For the next generation, this way of making wine is more than a vocation; it is a cult, a movement.Illustration by Edward SteedOver the next few hours, day-trippers began filtering out to their cars. The lights in the now-empty tasting room were turned down, middle school dance style. A long table was suddenly full of gigantic platters of oysters, magnums and jeroboams of wine—the Good Stuff, bottles that had been brought and saved for this day-end moment of ebullient fraternity. Then, at nearly 11 p.m.: dinner. Couscous and mild, tender braised lamb. Slow-simmered wedges of ochre pumpkin and cabbage and buttery potatoes. Chickpeas mixed with a sweet-savory onion jam. Hervé stood at the front of the room, smiling, watching the tipsy crowd work through the buffet line and find seats at wooden banquet tables. “He doesn’t have to do this, you know,” a wistful Laurent remarked, surveying the scene. “Hervé is special.”Special. That echoed in my half-drunk head. It all felt special. Special to be with the generous people who sweated over this wine and wanted to share it with me, with the world. Special just to know that this existed. That because I knew this I didn’t need to worry about the jargon and the grape names and appellations and all the B.S. that makes wine feel so intimidating and impossible sometimes. I could choose to drink wine made by people because I like people. This—this humanity behind the bottles—was reason enough.I snapped out of my reverie and noticed a somewhat agitated-looking Hervé a few feet away from me, one hand clutching a bottle and the other shielding his eyes from our photographer’s flash. I asked Laurent what he was saying. “Er...” he started delicately, “He says he’s starting to get sick of the f*#%ing cameras.” I looked at our photographer. It was time for us to leave.Illustration by Edward SteedAfter saying good night, I stood in my room for an anxious five minutes before deciding that I had to go back. I’m the kind of person who cannot sleep knowing that the party might still have legs, and since the innkeeper had given us a grave warning earlier about cops on the road, I would have to walk. It was cold and drizzly and almost 2 a.m. I was freaked out in that very foreign-seeming darkness, walking the medieval-spooky road that separated the hotel from Hervé’s place, cursing my FOMO and convincing myself that I was going to arrive to find the building dark, quiet, and empty.The rain stopped and the clouds broke just as I reached the edge of the vineyard. Winding my way through the lovingly trellised vines, I finally reached a ridge overlooking Hervé’s complex. The lights were still very much on. I stood perfectly still for a moment, listening. From the garage I suddenly heard a wolf howl...and then a bass line. “It’s after miiiiiiiiiiiiiiiiidniiiight”—the opening lines of “Thriller” rang loud and clear.I was glad I came.Explore Bon Appétitnatural wineWineFranceRead MorecultureHow a Wine Shop Helped Me Make Peace With My AgeBy Liz RiggscultureThe Maine Wine Shop That Makes Going Home Even BetterBy Bryan FountainLifestyleYou're Not Going to Believe I'm Saying This, But Merlot Is BackBy Marissa A. RossLifestyleThe Wine That Changed My Life Has a New Vintage, and I Can't Stop Thinking About ItBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-13", "author": ["Condé Nast", "Amiel Stanek"]}