{"id": "8471d0e654a2b0eb8293152b4caeb0ed", "url": "https://www.bonappetit.com/story/strawberry-chaat", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "Strawberry Chaat Is the Best Place to Put the Season's First Berries | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe First Strawberries of Spring Belong in Strawberry ChaatFor anyone who needs a little savory with their sweet.By Shayma Owaise SaadatApril 30, 2021FacebookTwitterEmailPhoto and Food Styling by Shayma Saadat FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.In my grandparents’ home in Lahore, we would gather in the living room for iftar—the nourishing feast Muslims enjoy after a day of fasting—where the tea trolley would arrive, lined with platters of food, a frosted pitcher filled with a rosy pink concoction of milk and Rooh Afza, and a teapot nestled under a tea cozy. There were puffed chicken patties and lemon tarts from Shezan Bakers; hot, crispy potato samosas; egg salad finger sandwiches; and disks of cumin-scented aubergine pakoras.But for me, the best part of the meal was the large bowl of sweet and savory fruit chaat. Made with whatever fruit was in season, my grandmother’s version often had chopped apple, grapes, guava, orange, and chickpeas. Tossed in fresh orange and lime juice, it came sprinkled with a punch of chaat masala.Chaat, which means “to lick” in Urdu and Hindi (it’s so good, you want to lick your fingers), is a sweet, sour, savory, spicy snack that comes in different variations all over the Indian subcontinent. Across Pakistan, India, and Bangladesh, you’ll find many versions, from samosa chaat, a crispy fried samosa bathed in yogurt with a fiery chutney and a crunchy topping, to fuchkas, crispy orbs that are pierced and filled with spicy potatoes and tamarind water. And every home has its own iteration too: Some like it with dollops of hari chutney; others like it with the tang of a date and tamarind syrup.Sohla El-Waylly’s corn and peach chaat is perfect for summer.\nPhoto by Laura Murray, Food styling by Sohla El-WayllyThe chaat I make for Ramadan these days is inspired by childhood trips to Anarkali Bazaar in Lahore. Whenever I went to Anarkali with my grandmother, I would peer into the chaat shop, its entry framed with fake bananas and oranges, and watch the vendor as he built the chaat in a mixing bowl. He’d toss sliced seasonal fruit in black salt and lime juice and spoon it into tiny dessert bowls. Each bowl was topped with yogurt and a drizzle of thick, sticky tamarind chutney. After sprinkling over pomegranate arils and crunchy papdi (strips of fried dough), he would hand it to the customer. But because I was with my grandmother, who believed “home food is best,” I never had the chance to taste his version.This strawberry chaat is my attempt to re-create that delectable fruit chaat I wanted to eat as a child. Though similar in flavor to my grandmother’s chaat, the one in Anarkali had some extra fixings—that creamy yogurt, the crunch of the fried papdi. Plus, that tangy tamarind chutney, which she never let me savor as a child. (“You’ll get a sore throat,” she’d say, protectively.) After a full day of fasting, my version is a welcome treat and, with the addition of chickpeas, includes a bit of protein too. Some chaats have a crunchy, crispy component. In my version, you can add sev, crispy bits of fried chickpea flour dough, or papdi, both of which can be found at Pakistani or Indian grocery stores. If you can find neither, use this trick I learned from my Aunty Bhupinder: Buy small tortillas, slice them into 1\" strips, and shallow-fry till crisp. They are a stand-in for papdi and work like a dream when served atop chaat.Here’s how to make it: A chaat is all about mise en place and assembly. First, set aside 1 cup papdi or sev. Then get going with the sweet and sour components. Start with the chutney. Traditionally, the chutney for chaat is made with tamarind. Some like to balance out the sour component with dates (my mother’s preferred ingredient); others use jaggery. My mother and aunties introduced me to this tasty Tamarind and Date Chutney, which you can find in Pakistani and Indian grocery stores. If you don’t have tamarind on hand, you can create a similar taste profile using my method: In a small bowl, whisk the juice of 2 limes (¼ cup juice), 1 tsp. kosher salt, 3 Tbsp. dark brown sugar, and ½ tsp. cayenne pepper until sugar is dissolved. This is your tangy lime and brown sugar syrup.Next, you want to get the base ingredients ready. Drain and rinse one 15.5 oz can chickpeas and add to a large bowl. Finely chop 2–3 shallots (you are looking for ⅓ cup yield). Hull and quarter 1 pint (¾ lb.) strawberries. Add shallots and strawberries to the bowl. Take 1 red Thai chile, and using your kitchen shears, finely chop half of it directly into the bowl (you can add more if you prefer more heat, but half a red Thai chile is very hot for my palate). Add 1 tsp. kosher salt, ½ tsp. cayenne pepper, and the juice of 1 lime (about 2 Tbsp.). Gently mix to combine. In a medium bowl, whisk ¾ cup full-fat plain yogurt with 2 Tbsp. ice water.We’re almost there, I promise! Coarsely chop ½ bunch cilantro (leaves and tender stems). Using a paring knife, cut and remove the crown of the pomegranate. Make 4–6 vertical superficial cuts along the side of the pomegranate, and use your fingers to pry open the sections. Carefully extract the arils from the peel and the membranes. You need ½ cup pomegranate arils for the chaat (reserve the rest for another recipe).Now comes the fun part: Time to assemble it all! Equally divide chickpea, shallot, and strawberry mixture among 4 bowls. Drizzle each bowl with a few tablespoons of yogurt followed by tangy lime and brown sugar syrup. Add a generous scattering of papdi or sev, pomegranate arils, and chopped cilantro on top.I’ve often thought about getting a tea trolley, like the one from my grandmother’s house in Lahore, for my home here in Toronto. I can just picture an iftar feast on it, on top of starched linen. I know I’ll have to pull out my tea cozy because even though the spread is slightly different, one thing remains the same: Fruit chaat is best with a hot cup of tea.Shayma Owaise Saadat is a Toronto-based writer, food stylist, photographer, and recipe developer whose work focuses on food, culture, and identity. Explore Bon AppétitIt's That SimpleRamadanSnackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-30", "author": ["Condé Nast", "Shayma Owaise Saadat"]}