{"id": "847d5fbbd9ab05e270bb959ba129ba58", "url": "https://www.bonappetit.com/recipe/rice-noodles-al-pomodoro-with-chili-oil", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Rice Noodles al Pomodoro Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueRice Noodles al Pomodoro with Chili OilBy Chris MoroccoJuly 10, 20184.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintChili oil and rice noodles completely upend the typical Italian flavor profile here. We’ve got bursting, jammy cherry tomatoes that make their own sauce, rice noodles that cook in a flash, and a weeknight dinner that tastes like it took a lot longer than 20 minutes.Ingredients4 servings Kosher salt12oz. wide rice noodles¼cup extra-virgin olive oil6garlic cloves, thinly sliced1Fresno chile or red jalapeño, thinly sliced2large sprigs basil, plus torn leaves for serving3pints cherry tomatoes, halved if largeChili oil and toasted sesame seeds (for serving)PreparationStep 1Bring a large saucepan of salted water to a boil. Remove from heat; add noodles. Let sit, stirring occasionally, until al dente, about 4 minutes (time may vary by brand). Drain and rinse under cold running water.Step 2Meanwhile, heat olive oil in a large skillet over medium. Cook garlic, stirring often, until softened and golden, about 3 minutes. Add chile and basil sprigs; cook, stirring, just until softened, about 1 minute. Add tomatoes and ¼ cup water and cook, stirring occasionally, until most of the tomatoes have burst and are jammy, 8–10 minutes. Season with salt.Step 3Add noodles to sauce and toss to coat. Season with more salt if needed. Divide among bowls; drizzle with chili oil and top with sesame seeds and torn basil.How would you rate Rice Noodles al Pomodoro with Chili Oil?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleReally good recipe, it feels a lot lighter using the rice noodles vs regular pasta noodles. My sauce came out a little thin and it needs a little richness, so I may add a little tomato paste if I make this again.Brad8675St. Paul, MN6/17/2019Explore Bon AppétitRice NoodleNoodlePasta & NoodlesCherry TomatoTomatoVegetableChileSummerQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeGluten-FreeVeganVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Chris Morocco"]}