{"id": "848ae9b1c2c4fff4743963f10dfb5900", "url": "https://www.bonappetit.com/story/shaved-ice-machine", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "For Perfect Halo-Halo (and Boozy Slushies), You Need This Shaved Ice Machine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingFor Perfect Halo-Halo (and Boozy Slushies), You Need This Shaved Ice MachineTurn a cup of ice cubes into delicate, frosty fluff in 30 seconds.By Tiffany HopkinsAugust 27, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Kat BoystovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve been known to splurge on high-tech kitchen equipment. A touch screen air fryer that’s slightly too big for my New York kitchen countertop? Have it. A galactic 1250-watt microwave that heats up food almost too quickly? Yep, I impulse-bought that during quarantine too. But one thing I’ll never get fancy with is my shaved ice machine. I grew up prepping big batches of fluffy ice for halo-halo with my siblings, and whether in my mom’s or my auntie’s kitchen, I can’t remember a time that we used anything other than a hand-operated machine to get the job done. Even though I’m now an adult who loves a gadget with bells and whistles, I’ll never replace my Manba manual shaved ice machine—which I use not only for halo-halo but also for spiked slushies—with an electric one.MANBA Ice Shaver and Snow Cone Machine$32 $24 at AmazonAssembling halo-halo is objectively fun—alternating layers of sweet red beans with coconut gel, jackfruit, and ube ice cream in a tall glass—but, to me, cranking the handle and watching the shards of ice fall takes me right back to childhood. At family cookouts, making shaved ice never felt like work to us kids because the machine was almost like a toy. We’d take it outside on the porch and fight over whose turn it was to work the crank, motivated by the knowledge that the more shaved ice we made, the more halo-halo we got to eat.But the ice shaver I used when I was younger had its drawbacks. It required big ice cylinders, so we’d have to plan ahead and make sure to fill the molds the day before. Sometimes I’d be hit by a halo-halo craving only to find we didn’t have ice blocks prepared—a particular kind of torture. That’s never an issue with the Manba because it can be filled with regular ice cubes (a silicone ice tray is even included). Another plus is that it’s so compact. At about six inches tall and five inches wide, it’s the perfect size for anyone—cough, cough, me—who finds themselves making a single serving of halo-halo on any given Tuesday. Despite its petite size, it has a sturdy build and is capable of crushing a cup of ice cubes into delicate, snow-like fluff in 30 seconds flat, minimal elbow grease required.With my own shaved ice machine, I can cool down with a glass of halo-halo any time the temperature breaks 85 degrees. But it’s so easy to use, clean, and store that I’ve also started using it for all of my summertime drinks. There’s nothing that makes you feel like you’ve really earned that lime-lemongrass slushy or strawberry frosé like hand-cranking your own crushed ice.Related:Halo-HaloThe Filipino dessert layers shaved ice and condensed milk on top of all sorts of texturally contrasting ingredients for a deliciously chewy, crunchy, creamy, sticky, and refreshing result.View RecipeExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-27", "author": ["Condé Nast", "Tiffany Hopkins"]}