{"id": "848e2a659d214451ec40284eeb8d574d", "url": "https://www.bonappetit.com/story/how-to-make-croutons", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "How to Make Croutons and Put Them on EVERYTHING | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Croutons and Put Them on EVERYTHINGYou can make the best part of any salad at home. Croutons, we're coming for you.By Alex DelanyApril 19, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou know when you were a kid and you’d pick out and eat all the croutons from your salad? And while you were doing that, a small part of you thought, Wow, salad is kind of awesome! But then you finished them all and were left with a big dumb pile of vegetables and realized that, No, salad isn't awesome—croutons are awesome! And now that you're an adult that can make important decisions for yourself, you can learn how to make croutons at home—so easy!—and put as many as you want anywhere you want. (Within reason.) Here's what you need to know to get into Club Crouton:The Oven StuffIf you want to make great croutons at home, you probably want to make them in your oven, and you want that oven to be hot—like, 425° hot . Here’s why: Making croutons in the oven is more hands-off, and will produce more evenly browned and crispy bread bits. You can 100% make croutons in a skillet, but the even, ambient heat of the oven will protect your croutons from being soggy on one side and burnt on the other, and it's just a little more foolproof.The Bread StuffWhat type of bread should we use? How do we make a big piece of bread into small pieces of bread? What is the average yearly rainfall in the Amazon rainforest? We’ll answer the first two. You can Google the third. You should use bread that is sturdy, with good structure, and maybe some nice air bubbles—a baguette or a nice country loaf of sourdough will work great. That loose structure allows the heat to penetrate the pieces and get the bread get super crispy. The denser the bread, the harder the crouton will be (and the longer it will need to cook). Truly, you can use whatever bread you have around, but not all croutons are created equal.And you can break up the bread however you’d like. You can slice the loaf into cubes if you’re more of a geometric, order-driven person. Or you can tear the bread into small craggy pieces with your hands. We like the latter, since it makes each crouton unique and special. It makes each crouton feel important.(About 80 inches per year, although some areas see up 430 inches. That’s the Amazon stuff. We Googled it for you. You’re welcome.)Those homemade croutons look a million times better than the packaged ones.\nPeden & MunkThe Bread-Tossing StuffThe most common blunder people commit when making croutons is not using enough oil. And also not using the right oil. You should toss your pieces of bread (or pre-croutons) in a bowl with olive oil, which will lend much more flavor than a neutral oil. Each pre-crouton should be totally coated. If you look into your bowl and see a large lake of oil with little bread rafts floating around in it, maybe that’s too much oil.This is also the time to add any dry spices you want to season your croutons with. Want a little chile flake or maybe some black pepper? Toss it in with the oil before you get the bread in there. If you want garlicky croutons, go ahead and microplane some fresh garlic into the oil. If you're interested in incorporating some hardy herbs—chopped sage, rosemary, or thyme—this is when you want to add those. Go wild, but keep in mind that more is not necessarily better; you still want to taste the bread.The Sheet Pan StuffYou want to make croutons on a rimmed sheet pan. When you put those oil-coated pre-croutons on the pan, make sure to space them out so none of them touch. This allows for even air circulation and browning. If you just throw all that bread on the pan in a giant mountain, you’ll have a bunch of soggy croutons, which is sad.The Are They Done Yet? StuffThe whole process will take 15-ish minutes, depending on the size of your croutons. This isn’t a throw-them-in-the-oven-and-take-them-out-when-the-timer-goes-off thing though. You need to keep your eye on the croutons. Check every few minutes or so, because they can go from lightly toasted to charcoal in no time. Once they start to take on a bit of color, give the pan a shake to expose any previously-unexposed surfaces to the heat.Once they’ve picked up color on every side, that’s a sign that they’re about done. Texture is a good indicator as well: The outsides should be crispy, with just a bit of give. You’ll also be able to smell them. A bread-y, toasty aroma is a sure-fire sign that they’re finished. If they're well-browned but aren't super crackly-crunchy, don't worry—they'll get crunchier when they cool down. Once they come out of the oven, immediately hit them with a good pinch of salt and then transfer them to a paper towel-lined plate to cool down.Soup + Croutons 4evr <3 <3 <3\nPeden & MunkThe OK, They’re Done Now StuffWhoa. Look at that. Those are croutons! If you want to add some fresh flavor, you can throw the croutons back in your mixing bowl with some some chopped, tender herbs like chives, basil, or parsley. Then you can put croutons in your salad. You can put them on pasta. You can put croutons on soup. You can put croutons in your little brother’s pillow case so when he lays his head down they crunch, and he’ll be like WTF is happening right now? That’s a hilarious prank! But, also...soup. Stick to stuff like soup. Soup is nicer.Here's a crouton canvas for you:Chopped Dinner Salad with Crispy ChickpeasExactly what you want when dinner NEEDS to be salad, and salad NEEDS to be dinner.View RecipeExplore Bon AppétitBasicallyCroutonSaladSoupPastaBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-19", "author": ["Condé Nast", "Alex Delany"]}