{"id": "8491cafad7da6cdba543eab3f51c0d0b", "url": "https://www.bonappetit.com/story/green-minestrone", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "This Minestrone Recipe Is Here to Justify Your Spring Farmers' Market Splurge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeLike a light jacket, this vegetable-packed soup is an April staple.By Aliza AbarbanelApril 18, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailI’ve been daydreaming about spring since the first day of winter, coping with chilly commutes by picturing Aperol spritz-fueled picnics with absurd quantities of strawberries. When April finally rolls around, the weather is somehow never as good as I imagined it would be, but there are snap peas at the farmers’ market. So when the forecast shows a full week of rain, there’s only one thing to cook: a fresh, vegetable-packed spring minestrone.Normally I'd argue that spring soup feels too much like settling. (Isn’t winter just four months of eating stew?) But senior food editor Andy Baraghani decided to create a bright but light broth that feels seasonally on point.He starts by sautéing garlic with ground pepper, coriander seeds, and fennel seeds, then adds scallions, half a serrano chile, and a few strips of lemon zest for an extra hit of brightness. Then, when the scallions are softened and slightly charred, he adds six cups of water to get a broth going. It’s the perfect cooking liquid for all leeks, snap peas, and cannellini beans.It also helps that the vegetables are simmered until just tender—not cooked to death like other soups that shall go unnamed. Seriously, I spent more time trimming peas and washing leeks than standing over the stove. The secret is to get all your chopping out of the way before turning on the stove, then strategically add ingredients based on how long they need to cook. So once the sturdier fennel and peas are almost tender, add the baby spinach and English peas along with a tablespoon of white miso to round out the broth. The result is a spring minestrone that's full of texture, with slightly crunchy snap peas, soft whisps of wilted spinach, and creamy miso-y beans.The vegetables shrink as they cook, but this recipe still hits high on the broth to mix-ins ratio. The final soup is like an entire farmers' market in one pot. And while there’s already a lot of green in your bowl, I recommend topping with chopped fennel fronds for maximum spring vibes. Think of this recipe like your go-to spring jacket—colorful enough to feel fresh but cozy enough to keep you warm until the clouds clear for good.It's (still) soup season:Spring MinestroneWith leeks, fennel, sugar snap peas, and English peas, this soup is perfect for ushering in spring.View RecipeExplore Bon AppétitHealthyishSpringSoupVegetarianSugar Snap PeaLeekRead MoreLifestyleBrothy Pasta With Chickpeas Are Like Healthyish Spaghetti-OsBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Aliza Abarbanel"]}