{"id": "849c57ad10d71454f617b5d1765084cc", "url": "https://www.bonappetit.com/story/black-girl-magic", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "BlackGirlMagic Takes Over The Kitchen In Jerrelle Guy's Book 'Black Girl Baking' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJerrelle Guy Is Bringing #BlackGirlMagic Into The KitchenHer new cookbook, Black Girl Baking, tells the story of a life through food.By Aliza AbarbanelFebruary 14, 2018FacebookTwitterEmailPhoto by Jerelle GuyFacebookTwitterEmailJerrelle Guy wants you to be comfortable. Warmth is her default disposition, and when the conversation turns from music recommendations to hard childhood memories, her warm laugh dissipates any awkwardness like air. Growing up in small-town Lantana, Florida, Guy's food memories were shaped by her Southern-born father and her Guam-born mother, but especially by her grandmother, Big Ma. In Big Ma's kitchen, canned vegetables were plentiful and fresh herbs were scarce, but food brought family together.Since 2012, Guy has knit together these memories with ruminations about Cardi B and recipes for pilau masala on her popular food blog, Chocolate for Basil. Now, she's taking an introspective look at the tastes and experiences that shaped her life in a new cookbook: Black Girl Baking: Wholesome Recipes Inspired by a Soulful Upbringing. We called her up to talk about #blackgirlmagic, vegan baking, and the therapeutic effects of kneading dough.What inspired you to write this cookbook?It was a real process. I called it Black Girl Baking because of the hashtag #blackgirlmagic— I got this book idea right after I saw that hashtag. I felt empowered by it, and it was interesting to think about claiming my blackness and bringing that into the food space. My whole  self-expression comes from being in the kitchen and exploring yourself, coming to a realization of who you are in that space.Guy's chickpea flour turmeric crackers.\nPhoto by Jerrelle GuyIn the book, you talk about how you're not a traditional baker. What's your approach?I want to bring art and expression into that conversation and take all the baking rules away. You don't have to be a baker to bake any of these recipes. It’s not about perfection; it’s about the journey, and I think that’s why I organized the book in a way that focuses on the process. I want to tell people that they can go in the kitchen and explore.As a black woman, we hold so much trauma, and there’s not a space where we can release it. I do a lot of yeast recipes in this book, and just the simple act of punching dough down is so powerful—it's a therapeutic space. I don’t know if I say the words \"bake therapy\" in the book, but I’m alluding to baking as therapy throughout the whole thing. I write about sad and painful memories because I'm trying to work through and reinvent them. I want people to find their own therapy or their own process; I’m just showing them mine.Many recipes in your book are tied to memories, like a breakfast bread based off your mom's ambrosia salad or honey buns inspired by the ones you'd buy at the corner store. Did you love food as a kid?Food for me was an escape. Growing up, there weren't a lot of resources or time—everybody was working, and there wasn't the luxury of sitting down to cook and share. My mom was a very lackadaisical cook; she just hated to be in the kitchen and I understand that, because there are days when you’re just too busy and don't want to think about food at all.I first really witnessed good food through my aunt, because she lived with us briefly, and I saw how excited she got about cooking. She went out and bought ingredients, bringing in resources that we didn't really have, so it got me excited. Watching TV also got me excited. It was like my fantasy world. I would do cooking videos and talk to the camera; it was my escape.The phrase \"soul food\" comes up a lot in the book. What does \"soul food\" mean to you?The whole point is to travel back to these moments where I’m watching people and the way that they treat food and the way that they think about food. When I talk about \"soul food,\" I’m not talking about the traditional kind; I’m talking about these memories. This is my food history. We don’t need to go to back to Africa—I love doing that too—but there’s so much information in what we have right now, right here in our own personal food histories.The book has a lot of vegan recipes and gluten-free options, like quinoa banana bread muffins and plaited dukkah bread. Are you vegan?I used to be a vegan, and that’s when I learned to cook, so I learned about food in that way. I eat eggs and dairy now, but I know that people are moving into vegan eating, so I wanted to offer them recipes that aren't built off eggs. You can remove eggs from the dish and still enjoy the same textures and flavors.You talk about how food brings people together. What recipes in the  book  any recipes in the book especially good for those occasions?I was just talking to someone about the apple cider monkey bread, because it's a jumbled loaf that people sit around, separate, and share. And they're not a dessert, but the smoked BBQ roasted veggies! They bring back memories of being in a huge family and having these loud family gatherings with music and laughter, a big platter of vegetables, and lots of deep flavors.Buy Black Girl Baking: Wholesome Recipes Inspired by a Soulful Upbringing on Amazon, $15.Explore Bon AppétitHealthyishHealthy DessertsVeganBakeCookbooksInterviewsRead MorecultureAfro-Vegan Is the Healthyish Cookbook We Need Right NowBy Nikita Richardson Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Aliza Abarbanel"]}