{"id": "84a3283b648a9aa9b9abc4ce0abcbc44", "url": "https://www.bonappetit.com/recipe/one-skillet-lemony-chicken-with-fennel-and-tomatoes", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "One-Skillet Lemony Chicken with Fennel and Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOne-Skillet Lemony Chicken with Fennel and TomatoesBy Andy BaraghaniJuly 24, 20184.5(88)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThis simple, satisfying one-skillet chicken recipe leaves you with a ton of sweet, sweet pan juices—plenty of crusty bread for sopping it all up is non-negotiable.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonLarge Skillet$84 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWooden Spoon$6 At AmazonInstant-Read Thermometer$35 At ThermoworksSmall Bowl$13 At AmazonIngredients4 servings6skin-on, bone-in chicken thighs (about 2 lb. total)Kosher salt2Tbsp. plus ¼ cup extra-virgin olive oil1fennel bulb2medium shallots1large heirloom tomato or beefsteak tomato1lemonFreshly ground black pepperToasted bread (for serving)PreparationStep 1Place a rack in top third of oven; preheat to 425º. Pat 6 chicken thighs dry with paper towels; season all over with salt.Step 2Place a large ovenproof skillet on stovetop and pour in 2 Tbsp. oil. Transfer chicken thighs to skillet, skin side down, and heat over medium. (That's right: Those chicken thighs are going into a cold pan, and then you turn the heat on. Trust!) Cook, rotating skillet to encourage even browning, until opaque around the edges and skin is deeply golden brown, 8–11 minutes. Transfer skin side up to a plate.Step 3Meanwhile, do some prep: First, remove fennel fronds from 1 fennel bulb and reserve for making the sauce. Cut fennel head in half lengthwise. Place halves cut side down on cutting board, then cut each half into ½\" wedges.Step 4Peel and slice 2 shallots into quarters lengthwise.Step 5Cut 1 tomato crosswise into ½\" rounds.Step 6Trims ends off 1 lemon. Cut half of the lemon into thin rounds (about ⅛\"). Reserve remaining half of lemon for later.Step 7Adjust heat to medium-high and add sliced fennel, shallots, and lemon rounds to skillet. Cook, stirring occasionally, until fennel just begins to soften, about 4 minutes. Season with salt and pepper and give mixture another stir. Remove skillet from heat.Step 8Arrange tomato rounds and chicken over fennel mixture; season with salt and pepper.Step 9Transfer skillet to oven and roast until chicken thighs are cooked through (an instant-read thermometer inserted into thickest part near the bone should register 165°), juices run clear, and vegetables begin to caramelize around edges of pan, 16–20 minutes. Carefully remove skillet from oven and let rest 5 minutes.Step 10While chicken is roasting, finely chop reserved fennel fronds until you have about ¼ cup.Step 11Squeeze juice from reserved lemon half into a small bowl. Add chopped fronds to bowl and stir in remaining ¼ cup oil; season with salt and pepper.Step 12Spoon fennel oil over chicken and serve with toast alongside.How would you rate One-Skillet Lemony Chicken with Fennel and Tomatoes ?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleDeliche, thanks.AnonymousSan Deigo CA11/28/2021I had a huge crop of fennel- googled recipes and came across yours. It was so easy to follow and really delicious- will cook it again and try more of your recipes- thanksCindy simsCape Town south africa11/4/2021I have a Remoska, an EU made cooking pot with the element in the lid. This is highly energy efficient and has the benefit of browning meat beautifully. I will use it for this recipe and add it to my list of fav recipes. I have the thighs in the fridge as well as fennel. Di DefriesFrance10/12/2021This is a great recipe and a really GREAT WAY to make chicken. I now use this way to brown chicken all the time.AnonymousProvidence RI10/11/2021I would like to print this recipe, but 3 pages. Seriously?Mrianne EvansCapitola CA9/28/2021This was easy to make, and packed with flavor! I was looking for a recipe to use fennel from our CSA, and this was a great intro for it. I also subbed shallot for spring onion and added zucchini and garlic scapes from our CSA to the mix too. Doubled the lemon and tomato to accommodate the extra veggie base, and still lots of pan juice at the end for pesto bread. LaurenPittsburgh, PA7/11/2021So delicious and easy to make. Only problem was that it stuck like glue to the skillet. I left it for an extra long time hoping it would stop sticking but no luck. I finally used a thin spatula and got the thighs off the pan. Next time I make this, and I will, I will use the old \"hot pan, cold oil, food won't stick\" method. It's worked for me for over 50 years. Other than that I won't change a thing.BabyRoseCentereach, NY6/15/2021The version with fennel is superb but a good substitute would be a similar aromatic root like celeriac (celery root). That should work as a replacement. Or just celery. \n\nI've also tried this recipe with limes instead of lemons and it was amazing. I put raw whole couscous in the skillet before putting it in the oven with a few dashes of za'atar which really amps up the flavor. \nGriffSan Jose, CA6/13/2021@LYSA PRICE - Maybe sliced cabbage in place of the fennel would work! Won't be the same over flavor, of course, but would make a tasty backdrop and soak up the sauce and pan juices.Alexandra RabeLafayette, CA5/30/2021A definite easy, week day hit (or for a Saturday like tonight, a cooler than usual early summer evening)! I made a few alterations: added 4 cloves of chopped garlic along with the shallots because... garlic. Also along with the fennel I added about 1.5 cups very small baby potatoes for a starch - for regular sized \"baby\" potatoes I would have cut in half to ensure they cooked through. Halfway through cooking in the oven, threw in about 10 or so cherry tomatoes that I needed to use up. I made the fennel oil but for some reason just didn't like the flavor - too oily and not really fennel-y. Instead, put some chopped chives on top for color. Next time I'd also include some pitted and halved kalamata olives either at the end or at the same time the cherry tomatoes went in. This was amazing with a side of homemade garlic bread and a simple green salad. Alexandra RabeLafayette, CA5/30/2021This is great! I'm trying this recipe with breasts since I don't eat dark meat. But you know what's interesting? I've never preheated the pans before cooking chicken, beef, pork or fish. I'm a last minute cook and it works out better for me and the results to start out cold and not burn it. Digna Irizarry CassensYucca Valley, California5/28/2021Love this sple recipe 😋AnonymousToronto Canada5/27/2021This recipe looks absolutely incredible. Would you have any recommendations if replacing the fennel? It is literally the one thing I despise most in the kitchen but want to make this recipe!Lysa PriceDenver 5/27/2021Absolutely a five-star recipe! VERY EASY for a weeknight dinner, but spiffy enough to use for entertaining. This dish is faster than it looks, and the technique for getting the skin super crispy is excellent! (I know. It seems weird, but seriously... go with it. You won't be disappointed.)  I receive rave reviews every time I pull this one out and have shared the recipe with countless friends and family members.  The dish is very forgiving in that you can adjust quantities of the veg to use whatever you have in the house, and I typically throw in extra of everything anyway just to make more of that awesome sauce.  I first tried this for a dinner party we had (pre- social distancing, sigh), and it was so easy and delicious, that it's now in my regular weeknight rotation. =) Kelly WilliamsAtlanta, GA11/16/2020Wow - this is even better than it looks.  I skipped the toast because I had focaccia for lunch, but I won't do that next time.  The sauce is amazing!  I've never cooked fennel before.  It is so lovely, very different than raw fennel, which I also like.  This is going on the list for next week's dinners for sure - with toast!\nAnonymousColorado6/5/2020Explore Bon AppétitChicken ThighChickenPoultryFennelVegetableTomatoLemonCitrusFruitSummerEasyOne-Pot MealsWeeknight MealsMainDairy-FreeNut-FreeKetoRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Andy Baraghani"]}