{"id": "84a55bfac2555e8e01773e116e31ffd4", "url": "https://www.bonappetit.com/recipe/grilled-chicken-breasts-with-tadka-sauce", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Grilled Chicken Breasts With Tadka-ish Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGrilled Chicken Breasts With Tadka-ish SauceBy Rachel GurjarJuly 6, 20215.0(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSkin-on, boneless breasts are ideal for grilling since they cook faster, are easier to carve than bone-in, and the skin protects the delicate cut from the heat. (You can find them at any supermarket with a butcher counter—just ask! Or in a pinch, you can use skin-on, bone-in breasts and add 10 minutes to the indirect grilling time.) To cook, treat the grill like an oven, keeping the heat low and closing the lid. Even if you cook the chicken a touch too long, that skin is moisture insurance! After it has cooled, slice and dress the chicken in a nigella-spiked sauce. —Rachel GurjarAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonHeat Resistant Leather Gloves$22 At AmazonInstant-Read Thermometer$35 At Thermoworks16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonIngredients4 - 6 ServingsDressingZest and juice of ½ lemon1garlic clove, finely grated½cup buttermilk1Tbsp. mayonnaise1½tsp. pure maple syrup½tsp. freshly ground black pepperKosher saltChicken2½lb. skin-on, boneless chicken breasts (about 5)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more2Tbsp. extra-virgin olive oil⅓cup vegetable oil1Tbsp. nigella seeds or cumin seeds5scallions, thinly slicedJuice of 1 lemon1Tbsp. pure maple syrup½tsp. cayenne pepper1head of Little Gem or romaine lettuce, leaves separated, torn into large pieces5oz. peppery greens (such as radicchio, arugula, or watercress)PreparationDressingStep 1Whisk lemon zest, lemon juice, garlic, buttermilk, mayonnaise, maple syrup, and pepper in a small bowl until mostly smooth and combined. Season buttermilk dressing with salt.Do ahead: Dressing can be made 1 day ahead. Cover and chill.chickenStep 2Prepare a grill for medium indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Place chicken breasts on a plate. Season all over with salt, then drizzle olive oil over both sides.Step 3Arrange chicken breasts, skin side up, over indirect heat, cover, and grill until cooked through and an instant-read thermometer inserted into the thickest part of a breast registers 160°, 10–12 minutes (bone-in breasts will take closer to 20 minutes).Step 4Turn chicken breasts skin side down and move over direct heat. Grill until skin is golden brown and crisp, about 2 minutes. Transfer chicken breasts to a plate and arrange skin side up. Let rest at least 5 minutes.Step 5Heat vegetable oil in a small saucepan over medium-high. Once oil is shimmering, add nigella seeds and cook until fragrant and oil around seeds starts to sputter, about 1 minute. Add scallions, reduce heat to medium-low, and cook, stirring constantly, until fragrant, about 1 minute. Immediately pour mixture into a medium bowl and let cool 5 minutes.Step 6Whisk lemon juice, maple syrup, cayenne, and remaining 1 tsp. salt into nigella seed tadka.Step 7Toss lettuce and greens in a large bowl to combine. Drizzle reserved buttermilk dressing over; toss to coat.Step 8Slice chicken breasts on a diagonal ½\" thick. Arrange over salad and spoon nigella seed tadka over.How would you rate Grilled Chicken Breasts With Tadka-ish Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSuch a lovely summer salad! I don’t each meat so I replaced with halloumi and was very tasty! Will definitely be making again!!AnonymousLondon, England7/20/2021So good!! Was looking for a fun summer salad recipe and this exceeded expectations. So much more than the sum of its parts. I’ve never had tadka before but it’s going to become a staple in our house! Used cumin seed as that’s what I had on hand and the flavors were incredible. Will definitely make again!Danielle Chicago7/15/2021Explore Bon AppétitSaladIndianSouth AsianAsianChicken BreastChickenPoultryScallionOnionVegetableRomaineLettuceLeafy GreensRadicchioChicoryArugulaSummerEasyMainGluten-FreeNut-FreeGrillingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Rachel Gurjar"]}