{"id": "84c272a0f3a834c66803b49df0169fd5", "url": "https://www.bonappetit.com/story/alexis-nikole-tiktok-forager", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Alexis Nikole Nelson Is Making #ForagerTikTok Our Favorite Place to Be | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAlexis Nikole Nelson Is Making #ForagerTikTok Our Favorite Place to BeShe's all about ’80s funk, bittercress salads, and finding abundance all around.By DennyMarch 17, 2021FacebookTwitterEmailPhotograph by Rachel Joy BarehlFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Alexis Nikole, a TikTok forager teaching her audience how to make the most of free and abundant plants.Alexis Nikole considers her TikTok fame a fortuitous accident. She knew nothing about the platform until she started an account for her day job as a social media manager. But when the 28-year-old from Columbus, Ohio, began experimenting on her personal page during the pandemic, she got more than she bargained for. Specifically: over 600,000 enthusiastic followers and 10.3 million likes.Since April of last year, Nikole’s now viral account has been showcasing her immeasurable knowledge of foraging and cooking with wild plants: a sorbet made out of Japanese knotweed (Reynoutria japonica), hairy bittercress (Cardamine hirsuta) turned into lush salads, and common dandelions (Taraxacum officinale) battered and fried like fritters. She studied environmental science and theater at Ohio State University, and often combines her two passions on the platform—where you’ll find her singing original songs about cattails and sassafras.Related: The Forager’s Dilemma With Alexis Nikole NelsonContentThis content can also be viewed on the site it originates from.By sharing excellent foraging tips laced with undiluted humor, Nikole’s intentions were for people to take agency over their meals and make the most of foods that were free and readily available all around; especially after COVID-19 hit American shores and shopping was anxiety inducing. During the early months of the pandemic, Nikole’s TikToks focused on how foraged goods could extend groceries and increase access to fresh ingredients, especially for those living in food deserts. This is precisely why Nikole’s videos are so grounding; in these times, it’s crucial to feel some sense of self-sufficiency and stability.Amid global adversity, Nikole forages because it reminds her that she’s human—and humans, at their very core, are part of the ecosystem, no matter how much we distance ourselves from that truth. I called up Nikole to learn more about her foraging background, how she practices gratitude for what is all around, and why the world needs more hyper-localized food systems.Foraging makes me feel I am a part of something bigger… and that feeling is really good at chasing the depression away. Typically I go out between two to five times a week on average. In the dead of winter, I might only go once, and during the dog days of summer, I’m in the woods and nearby parks every single day. I’ll jam to ’80s funk the entire walk to the creek, but the earbuds go away when I get there. I want to hear everything—the crunching leaves under my feet, the babbling brook, and people conversing and laughing in the distance.I used to dream of being a pop star… by night and a scientist by day. I’ve been surrounded by music for a long time. I was three when I joined the childrens’ choir at my dad’s Baptist church, I started classical piano at age five, I was in choir every year through junior high and high school, I performed a cappella in high school, and was on the e-board of ukulele club in college. I was never a prodigy, but music brings me so much joy, so I love being able to sneak that into my TikTok videos.The best meal I’ve made using a foraged ingredient is probably… chicken-of-the-woods mushroom (Laetiporus sulphureus) “crab cakes” and an American sea rocket (Cakile edentula) and steamed beach pea (Lathyrus japonicus) salad tossed in olive oil infused with goldenrod (Solidago). Very gourmet!My curiosity for the outdoors… was nurtured from a very young age by my parents. My two sets of grandparents knew that scouting was good for building connections and recognized the importance of getting outside, and thus got my parents into it early. My mom scouted longer than my dad did and went to sleepaway camp in New Hampshire in the summertime. Eventually, while working at Procter & Gamble, she gardened on the weekends to decompress. I would help her, spreading mulch or digging into the earth with a tiny trowel while she quizzed me on the plants. Unbeknownst to my mom, I was picking up a lot of information. From there it grew into a love of all things growing plants outdoors.You don't have to go full forager… to reduce your environmental impact. Over the past few decades society has trended away from a localized food system, toward a global one. On the upside, it’s much easier to find ingredients like star anise at the grocery store. However, access to tomatoes year-round means they’ve got a higher carbon footprint because they traveled thousands of miles to get to your plate. Even shopping at your local farmstand helps with lowering your carbon footprint; it’s also a little easier than identifying a plant and bringing it home to eat.Everyone was afraid of going to the grocery store… when I started my TikTok foraging videos in April 2020. So I thought: Hey! Here are a few plants that are really common and probably growing in your neighborhood that you can gather, and maybe that’ll stretch your groceries a bit.Poor and POC communities are hit hardest… when major disasters hit. We saw the same thing playing out in Texas with the massive winter storm. So I offer my knowledge to help someone who needs to get some fresh food on their plate.As a Black, queer female forager on the internet… I’m not the person people expect to see excited about foraging, the outdoors, biology, botany, and history. I have delightful forager friends who are white, and I notice they don’t get questioned nearly as much as I do. That’s heartbreaking. When my dad learned that my account becoming viral also meant me becoming susceptible to online harassment, he got angry and told me, “I’ve been alive for 65 years. It doesn’t feel good that you’re still called into question because of who you are.”Though, it all feels worth it when… a follower sends me a thank-you message saying, “Because of you, while I was out walking I recognized this plant and it made me feel like my neighborhood was a cooler and happier place.” To be less unacquainted with plants or more connected to surroundings because of me is a huge win. We take better care of the things we know.Explore Bon AppétitPerson of InterestHealthyishInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast"]}