{"id": "84d2a5a36edc13a3515d4ea9e1af0c2c", "url": "https://www.bonappetit.com/story/house-of-highlights", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "House of Highlights Founder Omar Raja Shoots Hoops at Work and Has a Thing for Grilled Chicken | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHouse of Highlights Founder Omar Raja Shoots Hoops at Work and Has a Thing for Grilled ChickenOver 10 million people follow House of Highlights to see the best sports moments (and to watch pro athletes sound off in the comments). Here's how Raja stays on his game.By Abid HaqueSeptember 26, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailOmar Raja hasn’t taken a vacation for four years—that’s how long ago the 24-year-old started his Instagram account, House of Highlights, as a way to catch (mostly) Lebron James’ offbeat highlights. Today the account counts over 10.5 million followers and has grown into a cultural phenomenon, covering everything from dog tricks to bench-pressing babies, with all-stars like James Harden and Steph Curry ribbing each other in the comments section (and likely sliding into Raja’s DMs, looking for some IG love).In 2015 when Bleacher Report acquired HoH, Raja moved to NYC from his hometown of Miami and laid down roots in Midtown, near Bleacher Report’s offices. Most of Raja’s time is spent working, but he makes time to exercise with celebrity trainers and professional athletes on the regular. And next month, he’s launching a live Twitter show that will combine conversation, stunts, scripted comedy, and live highlights as a new take on sports commentary.Because he follows games on both coasts, Raja doesn’t sleep or stray far from screens until 3 a.m. each night. Recently, Raja told us about his daily routine, what it’s like to hang out with NBA legends on the regular, and why HoH is the grilled chicken sandwich of the sports media world.What’s a typical morning like for you?I actually don't go to Instagram when I wake up. The first thing I do, usually around 10 or 11, is check Twitter and drink water. I use Twitter as my newspaper, then after that I’ll check my DMs on Instagram. I get like 500 of those every day. I go through all of that, and, once I'm done drinking the water, that's my cue to get out of bed.I heard people around the Bleacher Report office call you The Mayor. What’s up with that?Haha! So, I walk around the office a lot. Like, I probably know 90 to 95 percent of the names in the office just because I love talking to people. I walk around the office three of four times talking to people before I get a cup of water and get started.Instagram contentThis content can also be viewed on the site it originates from.What do you talk to people about?People have their own social media rules, right? Some people will never follow more than 400 people on Instagram; some people never like anyone's photo on Instagram; some people like everything on Instagram; some people will never follow back; some people follow back all the time. So I love asking people why they behave in certain ways on social media, because it helps my job, right? Because if you only follow 400 people for whatever reason, my account has to be so good that you're like, \"Yeah, I'm gonna break this rule and follow House of Highlights.\"What else happens at work on a typical day?Recently we’ve been working on brand deals. This is the first year for House of Highlights where we did invitation-only deals with brands. Requests come in and I figure it out with my team: How can we make content that resonates for the brand and for our audience. Then around 4 or 5 p.m., I go home and then I usually meet with my buddy Chris Brickley to work out.You seem to spend a lot of time with screens. What do you do to get away from them?Literally I walk around New York City. That's my favorite thing to do. I did that yesterday from 42nd and 11th to like 42nd and 2nd, then I took a cab home.Does “the Mayor” have any other healthy habits we should know about?I don't drink; I don't smoke. I have a pretty basic diet; I stick to grilled chicken for lunch with broccoli or sweet potatoes. I love the spot Dig Inn over here. I get the chicken with broccoli there. We have a Twitter show coming, so I'm trying get a little more lean. I'm on 2,000 calories; I try to stop before then. I also do intermittent fasting. I don't drink or eat until like 12 or 1, and then I have that eight-hour window where I try to fit in everything I need calorie-wise. So that way, when it's 11 p.m. and I'm working, I don't get tempted to order GrubHub or go downstairs to get dollar pizza. Every now and then I’m going to cheat. There’s one spot called Stickies where I'm gonna go at least once a week, but for the most part I stick to grilled chicken.What do you order at Stickies?Small chicken poppers, Cajun fries, and they have something called sassy barbeque sauce. It’s the best meal in the world.Instagram contentThis content can also be viewed on the site it originates from.We gotta ask: What’s it like hanging out with NBA legends?It’s been great because their advice still relates to me even though we work in similar but different industries. I was feeling a bit burnt out when I talked to Kobe Bryant earlier this year, and my conversation with him honestly energized me. He told me the grind doesn't stop until you're six feet under, and it's something I honestly think about every dayA large part of the players’ lives are working out and dieting. Will House of Highlights cover any of that?We cover the workouts. One of the highest viewed videos is actually Lebron not even shooting basketballs but working on his core.Do you cook at home?Yeah. Grilled chicken. Grilled chicken all the time. Salmon as well. That's pretty much it; I'm not the best cook in the world.Your parents are from Pakistan. How much do you eat traditional Pakistani food?I used to eat naan and nihari [stew] and all that stuff but, as I was telling my mom, I can't do it because it weighs on me. Like, I used to eat naan and nihari and just want to go to sleep because I’d just eat so much. So that's kinda been one thing I have given up over the past few years as I’ve had to work more and more.Lastly, if House of Highlights was a food, what would it be?A grilled chicken sandwich. It's a staple that's a part of your daily routine and everything you need in one bite. Quick and easy.Explore Bon AppétitHealthyishInterviewsRead MorecultureJohn Cena Drinks Protein Powder for Breakfast but Still Makes Time for Red WineBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Abid Haque"]}