{"id": "84d58802c283b34efda87f1847a4dab7", "url": "https://www.bonappetit.com/story/thera-cane", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "The Thera Cane Is a Back Massager That My Coworkers Like to Steal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Back Massager That My Coworkers Always Steal“Feel better and save money” is Thera Cane’s slogan, and now it's my slogan too. By Alex BeggsFebruary 21, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!My favorite way to solve my problems is to buy stuff. One recent problem: I tried golf a few months ago but every time I tried to make the stick hit the ball, the stick would slam into the grass, shooting pain up my arm into my back. This led to a minor back spasm that made my waking and sleeping life miserable. To lessen the pain, I’d massage my back with Carla Lalli Music’s Thera Cane, which I never gave back. Sorry, Carla!! It’s an S-curved piece of plastic with two prongs and rounded tip that digs into your muscles in a way I imagine a masseuse would, if I could afford deep tissue massage and wasn’t terrified of strangers’ touches.“Feel better and save money” is Thera Cane’s slogan, and why not yours too? On the company’s site, you can watch hilarious tutorials as gently muscled beige people in brandless workout gear probe the cane into their bodies’ crannies, staring blankly forward. The shape of the cane means you can apply pretty intense force depending on the angle you take when using it. For example, if you slept funny, you can put the curved corner to your left (like a comedian getting pulled off-stage) and press one of the ball-ended prongs into your neck. You can dig the end of the curve into that slope between your neck and shoulder after carrying a tote bag of potatoes. Or! Hook the curve behind you like you’re paddling a canoe and get into that creaky lower back. I tucked the curved end under my shoulder blade and gently moved the bottom of the cane up and down in front of me. It loosened up the junk from attempting golf of all freaking sports, increased oxygen flow in my bod (I think??), and made me look very cool while doing so.I find it best to scrunch up your face and make cow-like moans as you stab yourself in the near-spine at your desk in an open office. When I pull out the Thera Cane for a post-lunch pick-me-up, people come running to take their turn. Sometimes we stand around and argue about seeds in fruits, passing the cane around. Perhaps shared pain is more manageable than suffering alone.Buy it: Thera Cane, $32All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItSelf CareShoppingRead MoreLifestyleThis Futuristic Alarm Clock Turned Me Into a Morning PersonBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-21", "author": ["Condé Nast", "Alex Beggs"]}