{"id": "84e17ec399e42b196c45bb34e347f747", "url": "https://www.bonappetit.com/story/ask-an-expert-clam-shack", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Ask an Expert: What Is It Like to Work at a Clam Shack? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAsk an Expert: What Is It Like to Work at a Clam Shack?Well, first you have to get used to the smell.By Maggie LangeJuly 14, 2018FacebookTwitterEmailPhoto by Elizabeth CecilFacebookTwitterEmailBob’s Clam Hut in Kittery, ME, does a strong hustle every summer, feeding Route 1 travelers all the fried goods they’ve driven so far for. The Hut is staffed mainly by students riding high on the spirit of summer break and lobster rolls. We spoke to Parker Sikora, Colby College student and model employee, on what life is like behind the counter.What were you looking for in a summer job?I joined the team in May 2015. I reached out to a friend who was working at Bob’s already. She was actually my prom date her senior year. I said, “Why do you go back to this place every summer?” And she was like, “Come find out.”If you’re cooking yourself, might we suggest this Skillet Cod, Clams, and Corn with Parsley?\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenHow do you deal with the seafood smell?There’s a tradition we have when an employee leaves the Hut for the last time: We take a video of them tossing their shoes in the dumpster, because the floor gets so clammy with juice and flour for breading.Any daily strategies for dealing with the funk?It’s tough. It’s fresh seafood; you can smell it. We change our gloves often. But in my experience, I find flour everywhere. In my socks, on my back, in my hair. That was something I didn’t expect. You never know where you’re going to find flour.What do you eat on the job?There’s a joke: No one eats seafood on break. We go for a chicken salad, we go for a grilled cheese, we go for a burger.Why the Crocs? See questions No. 2.\nPhoto by Elizabeth CecilFavorite seafood prep task?Portioning! Going through and separating lobster meat. It feels good to make sure every lobster roll has a claw and tail. Having eaten a fair share of lobster rolls myself, I know that’s what I like to see. There are some tasks that are more hands-on. Cutting the calamari is really unpopular with people who don’t like calamari.What do you do with all the clamshells?We get them without the shells. We do reuse the clam buckets. You never know what’s going to be in a clam bucket, so we label it all. Forks. Knives. Carrot sticks.Now we know you’re in the mood for more seafood:Explore Bon AppétitClamSeafoodRestaurants + TravelRead MoreLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-14", "author": ["Condé Nast", "Maggie Lange"]}