{"id": "8503d02b52e907c5495b636a490c2c75", "url": "https://www.bonappetit.com/story/icy-cold-desserts-crisp-salads-and-other-july-fourth-faves", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Icy-Cold Desserts, Crisp Salads, and Other July Fourth Faves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIcy-Cold Desserts, Crisp Salads, and Other July Fourth FavesRecipe suggestions from Healthyish editor Amanda Shapiro.By Amanda ShapiroJuly 3, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Maybe you’re staring down the last few hours at the office; maybe you’re already in the vacation zone. Or maybe you’re like me, stuck in traffic, desperately trying to get there.Wherever you are, I thought you might want some last-minute recipe ideas for the holiday weekend. I’m not in charge of the cooking where I’m going, but if I were, you can bet I’d be grilling this salmon with whole lemon, some swordfish steaks with heirloom tomatoes, or a couple pounds of shrimp with spicy turmeric-citrus sauce.But the best summer party foods, in my opinion, are the sides. This potato-meets-egg salad with mustard vinaigrette is my never-fail potluck offering and I love the sweetness that dates lend to this celery-cucumber-arugula salad. I’m convinced the best way to eat green beans is with miso, based on this bean salad with miso dressing and these summer beans with miso butter. I nearly squealed when I remembered this roasted pepper caprese from last year’s Farmers’ Market Challenge: I love it so much.Green beans and cucumbers with miso dressing\nAlex LauIf there’s space on the grill (or you don’t mind turning on the stove), either of these two summer squash recipes will make you very happy: marinated with lemony ricotta or grilled with red onions and feta. And I’d be doing a disservice if I didn’t mention BA contributor Deb Perelman’s charred eggplant and walnut pesto pasta salad. I make it every summer, and every summer I remember that it’s the only pasta salad for me.I know everyone wants a summer-fruit-centric dessert, in which case: strawberry shortcake! But I’m more interested in something icy-cold, like a frozen Greek yogurt pie or a lemon-sesame semifreddo (use the optional CBD for some extra family-friendly chill). Want more? Here are 28 other summer-friendly dessert ideas.Whatever’s on your reusable plates, I hope you get the peace and quiet—or the fun and party—you’re looking for over this long weekend. I’m aiming for all of the above.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishFourth Of JulyRead Morecooking55 Healthy Grilling Recipes to Make This SummerGallery65 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Amanda Shapiro"]}