{"id": "850982f3f9c71e81d65dbe98a93566cc", "url": "https://www.bonappetit.com/story/vegan-puerto-rican-eateries", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "As The Plant-Based Movement Grows, Puerto Rican Restaurants Are Veganizing Their Menus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAs The Plant-Based Movement Grows, Puerto Rican Restaurants Are Veganizing Their MenusFrom San Juan to Oakland, chefs are breaking new ground with meat-free takes on the classics.By Raquel ReichardFebruary 24, 2021FacebookTwitterEmailArroz con gandules, maduro, pastelillo, and pollo con cebolla from Casa Borinqueña in Oakland, CA.Photograph by Nicola R ParisiFacebookTwitterEmailCasa Borinqueña has been feeding Oakland locals hungry for island cuisine since 2018. The pop-up and catering business won devout fans with pernil, shrimp mofongo, chicharrón de cerdo, and tostones con pollo. But last summer, Chef Lulu (who asked to be attributed by her first name) shocked, and in some cases angered, the small community when she veganized her menu. Many told the chef, who was raised on the archipelago and in Brooklyn, that Puerto Rican dishes sans meat, particularly pork, could never be authentic.“I started to question my own culinary skills: Would I be able to truly achieve the flavors?” chef Lulu asked herself. “I was also really sad because I felt abandoned by my own community. There was a sense of mourning. And there was also fear. I became anxious. I wondered if this was a good business move and, if it wasn’t, if I could ever recover from it.”The menu shift was a risky decision to make, especially amid a pandemic that destabilized the food industry. But while the founder lost some patrons, she found enthusiastic support among a vegan community searching for plant-based dishes surging with flavors. Casa Borinqueña’s rotating menu still features the classics: arroz con gandules, mofongo, maduros, and pastelillos, to name a few. “People tell me all the time that it’s the best vegan food they’ve ever tasted,” Chef Lulu says. “I’m just keeping on with tradition.”In Puerto Rico, more kitchens are preparing meat-free plates to meet the dietary demands of a growing vegan community. Across the archipelago, but especially in its capital of San Juan, vegan restaurants are offering locals and tourists signature meals rich in isle ingredients and precolonial techniques. In the contiguous U.S., a similar movement is growing. Preserving Puerto Rican culture in a plant-based movement that’s been commercially whitewashed, these vegan restaurants, cuchifritos, food trucks, pop-ups, and catering services have sprung up in cities that boast vast Puerto Rican populations, like Florida, New York, Pennsylvania, Connecticut, Illinois, and California.Growing up in San Juan, Javier Muñiz delivered his grandmother’s fiambreras, packed home-cooked dinners sold in the community, long before meal-prep services became a trend. In 2015, nine years after migrating to Orlando, he began cooking plant-based alternatives to Puerto Rican delicacies to impress his vegan girlfriend (and now wife), Karina Munoz Cancel. It started with sweets, from creamy coconut quesitos to the classic flan. Soon, every recipe he prepared was plant-based.The pair started vending the Caribbean pastries at local farmers markets, and in 2016, they opened the vegan Puerto Rican bakery Almendra’s. A year ago, they launched the Earthy Kitchen next door, and brought along Muñiz’s 70-year-old mom to ensure the sabor and spirit of Borikén are mixed into the pots and pans. The cuchifrito-style restaurant serves plant-based Puerto Rican soul food: savory frituras, deep-fried treats like empanadillas, alcapurria, and relleno de papa that satisfy patrons’ deepest hunger for home.“There are a lot of Hispanic restaurants in Central Florida, but none are fully plant-based,” Muñiz says. “We decided to open this idea with the hopes of giving the vegan community a taste of our unique flavors from Puerto Rico.”An order of sweet plantains from Philadelphia’s Bar Bombón.\nPhotograph by Hannah BakerTwo months after Muñiz opened the Earthy Kitchen, he was forced to close down the dining room due to the COVID-19 pandemic. The 36-year-old founder is eager to one day serve guests plant-based versions of island delights—like Jack mofongo, a spin on the classic chicharron mofongo that replaces pork rinds with jackfruit, and tripleta sandwiches, a popular criollo sandwich stacked with three meats, typically grilled steak, lechón pork, ham, or chicken, that Muñiz veganizes with jackfruit and homemade seitan—on dishware rather than in to-go boxes.Restaurateur Nicole Marquis opened Bar Bombón, an Old San Juan–inspired brick-and-mortar serving vegan Latin eats and fine cocktails, in Philadelphia’s Rittenhouse Square in 2015. The 38-year-old entrepreneur, who owns nine outposts of her fast-casual restaurant HipCityVeg and the bar-slash-café Charlie was a sinner, founded the stunning restaurant in homage to her Puerto Rican heritage.“I wanted to preserve that. There are a lot of people without access to plant-based Latino food, and I love my Puerto Rican roots and wanted to highlight and present it,” Marquis says, adding that many of her patrons are non-vegans who choose healthier options because the flavorings and textures remain intact.Like Muñiz, Marquis had to cut staff by the hundreds and lock the doors last year. Fearing the restaurant might have to close down for good, she was forced to get creative. In April, she cofounded Save Philly Restaurants, a campaign fighting for benefits and loans for hundreds of Philadelphia establishments. After conversations with elected officials, Marquis effectively pushed for the expansion of outdoor dining–including sidewalks, streets and parking lots–and most recently established a free testing center for all essential workers. Nearly a year after the first shutdown, she’s been able to bring back most of her staff and, with additional outdoor seating, Bar Bombón ended 2020 outperforming 2019 numbers.While the Earthy Kitchen and Bar Bombón were fighting to survive during the pandemic, Black Rican Vegan was making its launch. Named for chef and founder Lyana Blount’s Afro-Puerto Rican heritage, the Bronx-based  pop-up and delivery service opened in April, a month after Blount began sharing her plant-based recipes for island staples on Instagram to ease lockdown ennui. Soon, followers, which have now reached more than 28,000, urged her to cook and sell the traditional plates.“When people go vegan, they think they have to miss out and abandon their cultural dishes. They don’t,” says Blount, who previously headed the healthy meal-prep business Prepped to Go. She went vegan in 2016 after realizing that too many of her relatives passed away from poor health. Blount wants to break from the intergenerational cycle and provide affordable, healthy, culturally significant food for her Bronx community and everyday people across New York.Blount’s top-sellers—pastelón, a sweet plantain lasagna, and “vernil,” a slow-cooked pork roast made of canned jackfruit that is marinated with her homemade sofrito overnight and then baked to a crisp—provide nostalgic experiences that transport guests to off-shore kiosks in Piñones and Luquillo. She says that preparing her sold-out pasteles, mashed root vegetables wrapped in banana leaves that are popular during the holiday season, has similarly sent her back to the early 2000s, when she and her relatives crowded her grandmother's kitchen assembly-line style to prepare hundreds of the tender treat to friends and family, a process that started at 7 a.m. and ended at midnight.“When I think about love languages, cooking is definitely mine,” Blount says. “This is how my family showed love. I was welcomed with the smell of garlic, oil, and cilantro.”Explore Bon AppétitPuerto RicanPuerto RicoVeganHealthyishTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-24", "author": ["Condé Nast", "Raquel Reichard"]}