{"id": "852215b29cfa83f5c838f1e4b80f91b0", "url": "https://www.bonappetit.com/story/big-thick-asparagus", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "The One Thing to Look for When Buying Asparagus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe Like Big Asparagus and We Cannot LieWe're over those pencil-thin stalks of asparagus. Give us some substance, please!By Alex DelanyMay 30, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca JurkevichFacebookTwitterEmailSpindly little asparagus twigs don’t belong on your grill. Or in your oven. Or in that weirdly tall \"asparagus pot\" your mom gave you. We're not sure how people got it into their heads that thin asparagus was the platonic ideal of spring produce, that slim stalks were more tender or delicious or something. But we'd like to go on record and say that you can miss us with the thin stuff. We look at dinky asparagus like that and see a shadow of what this magical vegetable can be. Give us the thick stuff. Give us those fat stalks. Give us Big Asparagus.Because that’s what we love, especially when asparagus is in season and our grills are itching to be fired up. People seem to have the mistaken impression that thick stalks of asparagus are going to be woody or texturally unpleasant, but in reality, when you prep and cook it correctly, thick asparagus is one of the best vegetables around.Here's the problem with thin asparagus: It's not hearty enough to stand up to most high heat cooking techniques. It cooks way too quickly, leaving you practically no room to achieve that perfect crisp-tender level of doneness that you want out of fresh spring veggies. As soon as it hits the grill or a hot pan, those wispy little spears go as limp as noodles, leaving you with something more mushy than tender. Sometimes eating thin asparagus feels like eating, well, nothing at all.Breaking off those bottoms is the pro move.\nThick asparagus can stand up to high heat, allowing enough time for the exterior to take on some color and flavor before the inside reaches a perfect al dente. It holds that distinctive asparagus flavor we love in every crisp, juicy bite. And that woodiness that people complain about? That probably comes from the bottom of the stalks that they’re forgetting to snap off. Asparagus, regardless of thickness, won’t be enjoyable unless you trim it properly, which is stupid easy—just hold the stalk with two hands at the middle and bottom of the stalk and bend it until it snaps. The exact right amount of the tough part will come off every single time.But the best thing about thick asparagus is that it feels like you’re actually eating something. You get big, satisfying bites. It feels like you actually got something for your money. It has physical presence. So next time you’re serving chicken or pork or steak, serve a vegetable with just as much heft. Serve some stalks of the thick stuff.Thick asparagus: also great in a stir-fry.Steak, Snap Pea, and Asparagus Stir-FryYou can probably make it faster than you can say it.View RecipeExplore Bon AppétitBasicallyAsparagusVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Alex Delany"]}