{"id": "852dc4668948ace62bc21c52b463661d", "url": "https://www.bonappetit.com/story/di-an-di-nyc", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Why We’re All Eating at Di An Di in NYC Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhy We’re All Eating at Di An Di in NYC Right NowWe’re hooked on the rice paper salad and egg-yolky pho at the new Vietnamese restaurant in Greenpoint.By Elyse InamineJuly 2, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailIf you’re wondering where nearly every Bon Appétit editor is eating right now, here’s your answer: Di An Di in Greenpoint. Yes, this one restaurant out of the thousands of restaurants in New York City. You’ll understand soon enough.The Vietnamese restaurant, sister to An Choi in the Lower East Side, has tropical vibes, cubes (yes, cubes!) of charred rice noodles, and our full attention. Maybe it’s the leafy green wallpaper by the bar, the chilled Beaujolais beaded with slightly less sweat than your forehead, all the light that pours in from the skylights above the dining room, or the delicate beef pho speckled with scallions and a single golden yolk (MY PERSONAL FAVE). I could go on, but you get it. It’s got energy, atmosphere, and fantastic food. It’s only about a month old, but we’re already really into Di An Di. Basically editor Amiel Stanek was the first to go, and picking up the breadcrumb trail of Instagram, we all soon followed. Here are our go-to orders of the moment should you stop by our new home:Outside Di An Di in Greenpoint\nChelsie CraigBanh Trang Tron / Rice Paper Salad: “LITERALLY WTF IS THIS THING? Chewy shards of rice paper, chewier bits of jerky, a tangy-spicy-funky sauce, it’s a dream. Breathtakingly fun to eat.” —Amiel Stanek, Basically editorPho Ga Kho / Dry Bo Bo Chicken Noodles: “While I didn’t have any of the soups, the dry-style, broth-on-the-side chicken pho—wide rice noodles bathed in a ruddy-colored jasmine-chile sauce and tossed with herbs and bits of tender chicken—was irresistible. That was the thing that I overate until I was nearly sick. Wildly aromatic with just the right amount of heat, it was a really eye-opening dish for me.” —A.S.Bonus: “THE CONDIMENT CADDY. Four incredible house-made condiments—Sriracha, hoisin, pickled garlic, and some kind of chile sauce—make everything better. As a person who is perpetually feeling sauce-slighted, I was in heaven.” —A.S.Inside the restaurant\nChelsie CraigPho Thin Ha Noi / Beef Pho Hanoi: “It was amazing. Enough scallions scattered across the top that you could hardly see the broth. An egg yolk ready to be dragged through the soup. The right amount of brisket so that you you feel like you got your money’s worth. And thick-ish rice noodles that defied soggy-pho-noodle syndrome. I will forever crave this soup.” —Rachel Karten, senior social media managerSummer rolls, filled with pork and with a pork dipping sauce\nChelsie CraigBanh Xeo Cuon / Turmeric Crepe Wrapped in Rice Paper: “Turmeric crepe, grilled pork sausage (!), herb salad, all wrapped up in rice paper. Which on its own was herbfreshing, a term I have now coined. BUT THE DIPPING SAUCE. Wow. It was a savory ground pork and sweet rice situation. And, um, you’re dipping pork in more pork. That’s innovation if I’ve ever seen it.” —R.K.A kaffir lime leaf-laced cocktail\nChelsie CraigPho Ap Chao Chay / Crispy Rice Noodle: “The lotus root was perfectly cooked and crispy as all hell, while the little noodles are just chewy enough. The sauce they’re tossed in has a deep umami flavor you don’t expect to find in a vegan dish.” —Alex Delany, associate editorCrispy lotus root FTW\nChelsie CraigCa Tim Nurong / Grilled Eggplant: “Eggplant can be so meh, but this is the opposite. Halved and lacquered with a sweet and salty glaze, you’re staring at a plate covered with an glistening, perfectly-tender eggplant. Not fussy. Not elaborate. On point. This is the dish I was still thinking about walking out the door.” —A.D.Cha Ca La Vong / Sizzling Turmeric Basa Fish: “This came out on a sizzling cast iron platter—so sizzling that hot oil popped onto my shirt, which was a bit much (was sitting at the bar, intimate splatter zone)—but once the sizzling relaxed, you make bowls of rice, basil, tender dill-y fish, and top it with their homemade fish sauce, which is divine, and crushed peanuts. I second Amiel’s rec for the rice paper salad, too.” —Alex Beggs, senior editorThe scene at Di An Di\nChelsie CraigPho Thin Ha Noi, Chay / Pho Thin Ha Noi: “This vegetarian pho, with smoky shiitake and oyster mushrooms, scallions, and a poached egg, was so flavorful. I took the leftovers home and ended up eating the rest of it over the kitchen sink a couple hours later.” —Zoë Sessums, e-commerce editorial assistantBun Bo / Spicy Lemongrass Beef Noodle Soup: “I’m one of those people who slosh so much Sriracha and hoisin into my pho that it turns the broth the color of a murky latte. So naturally I welcomed the sate sauce that came on the side of this fragrant, meaty soup. The condiment is like a chunkier, fishier, spicier XO sauce—as in pretty addictive. You bet I was swirling it into my pho later on.” —Elyse Inamine, digital restaurant editorMake a Vietnamese shakerato to cap off your nightExplore Bon AppétitRestaurants + TravelNew York CityVietnameseRead MorerestaurantsThe Well-Crafted Kitchen: Inside the Whimsical, Dreamy World of FrenchetteBy Elyse InaminecultureI Went to BrunchCon, a Convention for People Who Love BrunchBy Kelly ConaboyrestaurantsWhy Be a Chef When You Can Be an “International Pizza Consultant”?By Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-02", "author": ["Condé Nast", "Elyse Inamine"]}