{"id": "852e1ae476749cc7c0899ec8b694ea36", "url": "https://www.bonappetit.com/story/palya-makes-nearly-any-vegetable-sing", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Palya is the South Indian Preparation That Makes Nearly Any Vegetable Sing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPalya Is the South Indian Preparation That Makes Nearly Any Vegetable SingYes, even those green beans in the back of your fridge.By Chitra AgrawalAugust 16, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailPalya is a classic South Indian recipe usually composed of a single vegetable chopped into bite-size pieces and sautéed in oil that has been seasoned with black mustard seeds, asafetida, chile, and curry leaves. The dish is then finished with lemon juice, grated coconut, and cilantro. Depending on which state in South India you’re in, this same preparation is referred to by different names, such as thoran or poriyal.While seasonal produce is preferred, this combination makes even the saddest of vegetables at the back of your fridge sing. Green beans are my favorite choice, but the recipe is extremely flexible and can be applied to beets, cabbage, potatoes, and, as I’ve discovered lately, asparagus.The unique step in this green beans recipe is chopping them into ¼-inch pieces. It may seem like a mundane, monotonous task, but for me it’s meditative. It also has major payoff—the increased surface area maximizes flavor (at least that’s my theory). I recall my mother sitting behind a heap of these green beans at our kitchen table in the evenings. She would cut the beans up before going to bed and then the next day after work, she would grab them from the fridge and quickly sauté them for our dinner.The other reason the beans are chopped so small is because they’re easier to eat in the traditional way, which is by hand with roti or with rice. I’ve found, though, that I prefer to cut and cook green beans in this fashion even if I just eat them along with a non-Indian meal, like thrown on top of a taco or folded into an omelet. They’re quite versatile.To make a meal of it, layer on top of chitranna with yogurt raita or plain yogurt and achaar.Get the recipe:Green Beans PalyaPalya is a classic South Indian recipe usually composed of a single vegetable chopped into bite-size pieces and sautéed in oil that has been seasoned with black mustard seeds, asafetida, chile, and curry leaves. The dish is then finished with lemon juice, grated coconut, and cilantro. This same preparation is referred to by different names such as thoran or poriyal depending on which state in South India you are in. Seasonal produce is preferred, but the combination makes even the saddest of vegetables at the back of your fridge sing. View RecipeChitra Agrawal is the author of Vibrant India: Fresh Vegetarian Recipes from Bangalore to Brooklyn and the founder of Brooklyn Delhi.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-16", "author": ["Condé Nast", "Chitra Agrawal"]}