{"id": "85339b5e84470670e788be295f8c939c", "url": "https://www.bonappetit.com/story/spicewalla-spice-collection", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "This Spicewalla Spice Collection Saved Me When I Moved | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Spice Collection That Saved Me When I MovedSpicewalla keeps my home-cooked meals tasting fresh.By Amanda ShapiroNovember 21, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Last spring, for the first time since I scored a single in college, I found myself living alone. It was amazing and a little weird to move into a clean-slate apartment with no roommate, no partner, just me, myself, and way too many houseplants. To make the place feel like home, I knew I had to cook. And to cook, I needed spices.I’d left my old jars behind because they were, well, old. Luckily I was given the Spicewalla kitchen essentials collection at just the right time. As promised, the spice collection includes all the essentials—which, turns out, is exactly the same lineup that Carla Lalli Music recommends in her cookbook, Where Cooking Begins.The spices were fresher than I knew spices could be: the cinnamon was spicy and potent, the crushed red pepper flakes were full of heat, and the whole cumin seeds were super fragrant. They come in small containers, which is a good thing because I know I’ll use them before they get dusty. And, at $95 for 18 high-quality containers, this spice collection is an investment I’m happy to make once a year to keep my home-cooked meals tasting fresh. Plus, they look cute on my spice shelf.Photo by Laura MurraySpicewalla 18-Pack Kitchen Essentials$99 $79 at SpicewallaExplore Bon AppétitHighly RecommendSpiceShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-21", "author": ["Condé Nast", "Amanda Shapiro"]}