{"id": "8536e8228898f62cbac0b7618fa7b80c", "url": "https://www.bonappetit.com/story/where-does-vanilla-extract-come-from", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Where Does Vanilla Extract Come From? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhere Does Vanilla Extract Come From?Plus, the deal with the imitation stuff.By Sarah JampelDecember 4, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you bake a lot, you’re constantly doling out vanilla extract—a teaspoon in chocolate chip cookies one day, a tablespoon in vanilla ice cream base the next. But have you ever stopped to ask: Where does vanilla extract come from? Or, wait a minute, what even is vanilla? We’ve got answers for you—like, newsflash, vanilla beans aren’t beans at all—below. Let’s begin:For starters, what is vanilla?To understand vanilla extract, you’ve got to know the basics about vanilla. First off, a vanilla bean is no bean—it’s actually the fruit of orchids in the genus Vanilla. Those vanilla orchids only grow in a very small subsection of the world, with Madagascar producing a whopping 80%. Every step of the labor-intensive harvesting process—from the pollination to the harvest to the curing (that is, the transformation of fat green vanilla pods into skinny black beans)—is done by hand! For all of these reasons, the demand greatly exceeds the supply, hence vanilla’s standing as the world’s second most expensive spice (around $270 a lb.), behind saffron. Not a bean.\nPhoto by Laura MurrayWhole vanilla beans are a splurge, so you’ll want to pick the plumpest, freshest ones available. Look for whole beans that are fat, shiny, and moist. While Madagascar produces approximately half of the world's crop, vanilla also comes from Mexico, French Polynesia, Uganda, China, and Indonesia, among other countries, and will have different flavor profiles depending on place of origin. Our test kitchen loves the incredibly fragrant and responsibly-harvested products from Heilala Vanilla, which come from the Kingdom of Tonga in the South Pacific. But why is vanilla a prized addition? What does it bring to the table? The comforting flavors in vanilla (toasty, musky, floral, or even smoky and earthy) enhance nearly any dessert, making it endlessly versatile. Its caramelly richness makes warm, deep flavors—coffee, chocolate, hazelnut, brown butter, and cinnamon—cozier and bright flavors—like citrus, hibiscus, rosemary, and berry—sharper and more pronounced.I have a vanilla bean. Now what do I do?To get to the seeds of the bean, use a paring knife to make a slit down the pod’s length, leaving the bottom intact. Open the sides like shutters to expose the grainy insides. Pressing gently, drag the flat side of the knife down the pod, gathering the seeds as you go. Then you’re ready to drop it into whatever sweet treat you’re cooking up. To store unused vanilla beans, wrap them up tightly in plastic wrap or reusable Bee's Wrap, and then place in an airtight container and refrigerate for up to six months.Where does vanilla extract come from?Vanilla extract—the kind that explicitly says “pure vanilla extract” on its label—is made by soaking vanilla beans in an alcohol solution to “extract” (get it?) all of their flavor compounds. According to the FDA, vanilla extract must be at least 35% alcohol with a minimum of 100 grams of vanilla beans per liter. When you’re shopping for high-quality extract, check the ingredients: It should only list vanilla beans, alcohol, and water, with no additives like sugar or artificial colors or flavors. Photo by Chelsie CraigPure Vanilla Extract$29.97 at Heilala VanillaOr, make your own extract at home with vanilla beans and high-proof liquor like bourbon, vodka, or rum. You can store extract, whether store-bought or homemade, in a cool, dark place almost indefinitely.Where does imitation vanilla come from? Ninety-nine percent of the world’s vanilla extract is fake imitation vanilla that’s not a product of the plant itself. Instead, it's flavored primarily with synthetic vanillin (a lab-produced version of the same chemical compound that occurs naturally in real vanilla). Typically labeled as “vanilla essence,” this artificial vanilla is usually derived from, uh, less-than-organic material (like petroleum). While it mimics vanilla’s smell, many would argue that it doesn’t come close to capturing all of the complex floral and woodsy notes that result from the myriad of other flavor compounds in true vanilla. This isn't to say that imitation vanilla doesn't have a purpose! It’s the way more economical choice, and you might not even be able to detect it as an imposter in desserts that are packed with lots of other flavorful ingredients or in baked goods that spend a significant time in the oven. Some new-classic desserts—think confetti cake and Dunkaroos—rely on imitation vanilla for their distinct wallop of big vanilla flavor. The real extract can't accomplish the same job! For sweets with pared-down ingredient lists or that come together over low heat or without any heat (like puddings, custards, pastry cream, no-bake desserts, whipped cream), however, the difference will likely be more pronounced.  What’s this about beaver butts?When it comes to imitation vanilla, there’s a whooole lot of talk about beaver anal glands. Beaver castoreum (the goo-like vanilla-scented secretion that comes from beavers’ castor sacs, located, yes, in close proximity to their anal glands) has been used as a food additive for much of the last century. It’s recognized as safe by the FDA and could, in theory, sneak onto ingredients lists under the label of “natural flavorings.” But the truth is you’re actually not likely to encounter it in your desserts. Global production is extremely limited, and it’s more commonly found in perfumes and cosmetics. When it comes to your average supermarket purchases, there’s no need to fret: Nearly all vanilla extracts are vegan—even the imitation ones. What other forms does vanilla come in? While extract and whole beans are among the most popular sources of vanilla flavor, they’re not the only ones out there. You can also purchase vanilla in the form of vanilla bean paste. A combination of vanilla bean seeds, extract, sugar, and natural gum thickeners, it gives you those classic speckles for a fraction of the price as whole beans. Vanilla Bean Paste$15 at Amazon$19.47 at HeilalaVanilla powder is less common and less versatile, but good for dry mixes like homemade pancake mix or dry rubs—it’s made from dried vanilla beans ground into a fine powder.Can I use vanilla extract if a recipe calls for vanilla bean?We get it. You’re tempted to swap out a pricey vanilla bean for the (slightly) more economical vanilla extract. But sometimes the seeds are worth it. When vanilla is the sole flavor and those signature flecks will be in the spotlight (think pudding, ice cream, crème brûlée, shortbread), splurge and buy the bean or use paste. But when vanilla is a backdrop to the star elements (in spice cookies, chocolate cake, and fruit pie filling, for example), save a buck and go with extract.How do I convert between extract, paste, and beans?As a general rule of thumb, 1 Tbsp. pure vanilla extract =one 6-inch vanilla bean = 1 Tbsp. vanilla bean paste. (But check your vanilla paste bottle, as some brands may vary!)Is there anything I can do with the spent pods?That scraped-out pod still holds a ton of flavor. So after you’ve used the seeds, rinse the pod, let it air dry, then put it to use. Bury it in a bag of sugar, then use that vanilla sugar for all-purpose baking, or bury it in a jar of salt, then use it to finish cookies and brownies. Add it to the pot when you’re making poached fruit or a compote, simmer it with sugar and water for a flavorful simple syrup, steep it in milk for vanilla-flavored custard, or drop it in a bottle of whiskey and reap the rewards.Chocolate + Vanilla = A Match Made In HeavenBlack-and-White ConchasWhy have a chocolate- or vanilla-flavored concha when you can have both in this New York–inspired twist on the classic Mexican sweet bread?View RecipeExplore Bon AppétitcookingVanillaVanilla ExtractRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-04", "author": ["Condé Nast", "Sarah Jampel"]}