{"id": "8553a0e77b334dcb4787715311c8dd64", "url": "https://www.bonappetit.com/story/gold-painted-nutella-hearts", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "New York City Cafe Offers Gold-Painted Nutella Hearts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNew York City Cafe Offers Gold-Painted Nutella HeartsHeavenly? Or Instagram bait?By D. ElizabethFebruary 14, 2018FacebookTwitterEmailGetty ImagesFacebookTwitterEmailAs the saying goes: The way to a person's heart is through their stomach. So two pounds of Nutella would, justifiably, give you two centuries of romance, no?We raise the question after being alerted, thanks to Eater, about a ravishing new dessert that's infiltrating New York City's West Village area. It's sweet, filling, delicious, and chocolate-y. And if you love Nutella, you're going to freak the hell out. Because thanks to the Sweet Corner Bakeshop, you can now get two pounds of the oozing chocolate-hazelnut spread cocooned by a gold-painted shell for your eating pleasure.The \"bonbon,\" as the shop calls it, was created last month in the lead-up to Valentine's Day, although it'll be staying on the menu for the foreseeable future. Everything about the dessert—or, who are we to judge, dinner—is edible, which includes the aforementioned Nutella feast and the gold-painted heart. When you crack that heart open and see that chocolate goodness begin to go nuts, your heart may skip a beat. The catch? The $45 price tag.Instagram contentThis content can also be viewed on the site it originates from.If you're lucky enough to live in New York and want to venture to the bakery for a sugar high, take note: Sweet Corner has been posting frequently about how often it is sold out of the treat. The shop only makes a certain amount every day, likely to keep up the in-demand status. (Think of it as the new cronut, if you will.) Still, that isn't stopping some of the most popular accounts on Instagram from posting videos like this.Instagram contentThis content can also be viewed on the site it originates from.Or, dear lord, this.Instagram contentThis content can also be viewed on the site it originates from.In addition to the Nutella heart in its purest form, the bakery is also selling cookies and brownies injected with a hearty dose of the gooey spread as well. Truly something for everybody!Instagram contentThis content can also be viewed on the site it originates from.We might stay in and make this Nutella pudding instead:Explore Bon AppétitValentines DayNutellaTrends + NewsTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "D. Elizabeth"]}