{"id": "85569a99a054f45f25fff31141df23ac", "url": "https://www.bonappetit.com/story/corn-salsa-recipe-so-chill", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "This Corn Salsa Recipe Is Way More Chill Than Your August Vacation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Corn Salsa Recipe Is Way More Chill Than Your August VacationNothing fancy here. Just a really damn good corn salsa recipe.By Alex DelanyAugust 21, 2018FacebookTwitterEmailPhoto by Caleb AdamsFacebookTwitterEmailI didn’t want to start this ode to a fantastic corn salsa recipe by reciting corn facts. I wanted to start by referencing a particular episode of Seinfeld or a salsa ad campaign from the ‘80s. But it turned out that both were too obscure, immediately shot down by my coworkers. So...did you know that on average an ear of corn has 800 kernels in 16 rows? Or that a bushel of corn can be turned into enough syrup to sweeten 400 cans of soda? Or that corn will always have an even number of rows on each cob? No? You didn’t? Neither did I, until I Googled “corn facts” and clicked on an article titled \"Fun Corn Facts for Kids.\" After reading, it became clear that while I do consider myself more worldly than the average first grader, my corn knowledge was baseline at best.But instead of feeling defeated, I decided that it didn’t really matter, because I knew the most important corn fact there is to know: Corn tastes like heaven in late summer. Especially when you char it and make it into a salsa.Yes! Salsa! The official condiment of the summer, as declared by me. Sure, you can eat is straight up, with some tortilla chips for dipping, but this charred corn salsa is good for so much more—don't pigeonhole it as a party appetizer. Let it run free as a topping for grilled meats, an instant upgrade for simple salads, a taco condiment, or even a snack to eat by the spoonful. If a condiment is truly exceptional, you can eat it straight-up—and this corn salsa is that kind of condiment. But first, we need to char some corn.You don’t need a grill to char corn. I know: \"Charring corn\" evokes visions of summertime beers around the Weber. And that’s great. But not all of us have room to grill. Some of us (read: me) live in little apartments without backyards. Which is fine, because you can char corn in a cast iron pan, right there in your kitchen, just as easily as you can char it on the grill. And char in our kitchen we shall!This recipe starts with two husked ears of corn and a poblano pepper in a dry cast iron, over high heat. You develop a nice deep brown/black color on the corn and the pepper over the course of about 10 minutes, rotating them every once in a while to spread the char out evenly. This is the most time consuming part of this recipe, and it’s not really that big of a deal at all.Corn salsa, in all her glory!\nPhoto by Caleb AdamsThen you slice the charred kernels from the cob (once they’ve cooled down a bit), and mash them up in a bowl with a potato masher or the back of a spoon. This releases the starches and juices in the kernels and will ultimately help to thicken the salsa, which is nice, because no one likes runny salsa.The salsa comes together quickly after the corn is charred and mashed. You remove the seeds from that charred poblano and then roughly chop it, finely chop a fresh jalapeno and some red onion, mix them with the corn, and season the whole thing with some kosher salt. Then we add our tomatoes, which we’ve halved, squeezed out all of the seeds and watery bits, and chopped into small pieces. As a finishing touch, you chop some cilantro (or parsley, if you’re really opposed to cilantro), and mix everything together with a squeeze of lime juice.Excluding the charring of the corn, this recipe takes about ten minutes to throw together. It requires no weird or fancy ingredients. And the list of kitchen tools is neither expansive nor obscure. This corn salsa is a simple recipe that celebrates the clean, sweet flavor of peak-season corn. And while you could be rattling off wild corn trivia left and right, that’s the only corn fact I really care about.Time to salsaaaaaaaaaa:Corn SalsaWhether it’s scooped up with tortilla chips or spooned over a simple fillet of fish, this zippy charred corn salsa is the ultimate peak-August condiment.View RecipeExplore Bon AppétitBasicallySalsaCornTomatoLimeChileRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Alex Delany"]}