{"id": "85618c0dcf6ca4215a852a4bdca35986", "url": "https://www.bonappetit.com/story/cooking-with-msg", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "MSG Makes Vegan Cooking a Breeze | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis One Ingredient Makes Vegan Cooking a BreezeMy panda-shaped shaker is the fastest route to flavorful plant-based meals.By Shaad D'SouzaApril 21, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.People often assume that going vegan is the ultimate sacrifice. You’re used to eating nothing but the 10s—juicy steaks, long-simmering broths, and buttercream frosting—and then suddenly you find a glass ceiling of 7s above your head. Lentil salad is great and all, but does it haunt your dreams like a dense, cheesy lasagna? When I first went vegan as a teenager, a whole world of food opened up to me. Bright-eyed and hugely idealistic, I wanted to do whatever I could to reduce my carbon footprint. Living in Melbourne, Australia, during the past decade, though, meant vegan options were hard to find at restaurants, and shortcut ingredients, like faux meats, were still a ways away from being particularly good dupes. But with the right ingredients—vital wheat gluten, legumes, and nutritional yeast—and a bit of labor-intensive cooking, I found that I could make meals that were complex, umami-rich, and vastly different to the simple greens-heavy cuisine I thought veganism would be. Then I finished school and started working full-time—and eating plant-based became a different beast. With only a fraction of the time I once used to cook, I began to lean on takeout and irregular snacky eating; weeknight cooking became a chore. I couldn’t muster the gumption to meal prep and ordering out was sending me broke. I needed an intervention: a shortcut that would consistently (and quickly!) turn my 7s into 10sFor me that came in the form of one perfect ingredient: MSG, which stands for monosodium glutamate. I had known about the ingredient for pretty much my whole life, thanks to racist rhetoric around “Chinese restaurant syndrome”—the now widely debunked “illness” some people were claiming to feel after consuming MSG—that was popular in the ’90s and 2000s. In truth, though, MSG has been a common pantry staple in many Asian households pretty much since its commercial release in the early 1900s. Glutamate is a naturally occurring compound that already exists in the body and a huge amount of the foods we eat every day, and it’s what gives ingredients like Parmesan and soy sauce their powerful umami flavor. When it first came on the market in Japan—developed by the University of Tokyo professor Kikunae Ikeda, who also developed the term umami—MSG was extracted from seaweed; now it’s made by fermenting beetroot, sugarcane, or molasses in a process similar to the production of yogurt or vinegar.Thanks to ambient cultural noise at the time, I’d heard of MSG, but I didn’t know it was commercially available—or that I’d already been eating it every day, in the Lao Gan Ma chili oil I was heaping on my weeknight dal. So, when I happened upon an adorable panda-shaped jar of MSG crystals at my local Asian grocer, I figured (given my chili oil obsession) I should just cut out the middleman and try to use the product in my own cooking.The difference was immediate. I started by stirring a couple pinches of MSG into my frozen dal after heating it up, an addition which gave a lip-smacking savoriness to a dish I already loved. Then I started adding a few generous pinches to my meal and found that it would provide layers of flavor to simple, cheap dishes: Minestrone regained the umami notes it usually absorbed from Parmesan rinds and bacon. Wilted kale or spinach became a profoundly more satisfying topping for toast or plain rice. And scrambled tofu was transformed into a tasty dinner without the need to bomb it with nutritional yeast or spend hours caramelizing onions. Through my experiments, I found that the easiest way to use MSG was to just treat it like salt: Add a pinch here and a pinch there until a dish tastes well-rounded and moreish.Suddenly, even my quickest meals had the meaty depth I was used to, and, amazingly, I started spending less money in boutique “health food” stores. Rather than buying bells-and-whistles vegan products, things designed to replicate the glutamate that naturally occurs in meats and animal products, I could just go straight to the source and give that same kind of umami love to plain tofu or tinned beans. In addition to speeding up my cooking process, MSG also helped me to start eating healthier—it made any vegetable infinitely tastier and cut my salt intake—which food scientist Steve Whitherly hypothesized would be an unexpected benefit of using the ingredient.I’m not strictly vegan anymore, but I still cook with MSG whenever I’m making vegetables. These days my plant-based cooking is about experimenting with produce—the silver beets and sweet potatoes of the world—I’d always thought were unpleasant or bland. As usual, I’ve been seasoning them with salt, pepper, and my trusty Panda shaker of MSG. Who knew savoy cabbage could be a 10?Photograph by Emma FishmanAjinomoto Ajipanda MSG$9 at AmazonExplore Bon AppétitVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-21", "author": ["Condé Nast", "Shaad D'Souza"]}