{"id": "8563d935bd91dfb54ec318c6c3f81259", "url": "https://www.bonappetit.com/recipe/sweet-potatoes-with-charred-lemons-and-crunchies", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Sweet Potatoes With Charred Lemons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSweet Potatoes With Charred Lemons and CrunchiesBy Molly BazNovember 10, 20194.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintWith custardy insides and charred exteriors, these sweet potatoes are everything you always wish roasted sweet potatoes could be. A crunchy mixture of toasted nuts and seeds provides pops of texture and spice, and a cooling lemony yogurt sauce cuts through the richness. Don't skip charring the lemons—it's not just a cute party trick: Caramelizing the sugars tames some of the acidity even as the juice remains fresh and bright. Plus, you'll use that lemon-infused oil to crisp the nuts. Arrange the sweet potatoes on a platter and serve with bread, pita, or crunchy vegetables, like carrots and radishes, for swiping up any leftover yogurt. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketParing Knife$10 At AmazonSpatula$12.99 At AmazonSmall Bowl$13 At AmazonSmall Skillet$40 At AmazonPlatter$29 At AmazonIngredients4 servings4medium sweet potatoes (about 2 lb. total)3Tbsp. plus 1 tsp. extra-virgin olive oil, dividedKosher salt½cup blanched hazelnuts1½tsp. fennel seeds1½tsp. cumin seeds2lemons1cup whole-milk Greek yogurt3Tbsp. unsalted butter2Tbsp. raw sesame seeds½tsp. crushed red pepper flakesPreparationStep 1Place a rack on bottom third of oven; preheat to 425°. Cut 4 medium sweet potatoes in half lengthwise and transfer to a large rimmed baking sheet. Drizzle with 3 Tbsp. olive oil, season with 1 tsp. kosher salt, and toss to coat. Roast potatoes until very tender all the way through and deeply charred on cut sides, 25–30 minutes. You can check for tenderness by piercing the flesh with a paring knife or cake tester. Using a spatula, release potatoes from pan.Step 2Meanwhile, prep your crunchies and lemony yogurt: Coarsely chop ½ cup blanched hazelnuts. (No hazelnuts? Pistachios, walnuts, and pecans all make good substitutes here.) Pile 1½ tsp. fennels seeds and 1½ tsp. cumin seeds on cutting board in a small mound and finely chop with a chef’s knife. Alternatively, break out your mortar and pestle.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Cut 2 lemons in half crosswise. Squeeze juice of 2 lemon halves into a small bowl. Add 1 cup whole-milk Greek yogurt and stir to combine. Season with salt.Step 4Heat remaining 1 tsp. olive oil in a small skillet over medium. Cook 2 unsqueezed lemon halves (cut sides down), undisturbed, until well caramelized around the edges, about 3 minutes. Transfer lemons to baking sheet with potatoes.Step 5Melt 3 Tbsp. butter in same skillet over medium heat. Add hazelnuts and 2 Tbsp. raw sesame seeds and cook, stirring often, until nuts are golden brown, 3–5 minutes. Add fennel, cumin, and ½ tsp. red pepper flakes and cook, stirring, to bloom spices, about 1 minute longer. Remove skillet from heat; season with ½ tsp. salt.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Spread lemony yogurt on a platter. Tear potatoes in half and arrange over yogurt. Spoon crunchies and browned butter over potatoes. Arrange charred lemons on platter for squeezing over.How would you rate Sweet Potatoes With Charred Lemons and Crunchies?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleBon Appetit for the win again! I’m not a big fan of sweet potatoes, but I loved the creaminess and sourness of the yogurt. I also added more red paper flakes bc I love spicy food. This is a must try. Erika RenataSan Antonio, TX1/24/2022TastyAnonymous11/16/2021Delicious! I made it without the lemons/yogurt just based on what I had on-hand. The sesame seeds are clutch.JSChicago, IL4/19/2021I added some ground sausage to this dish and served it with a side of cheesy grits. Yum! I know that takes out all the healthiness, but I felt like this dish needed something just a bit more savory. I've also been using the leftovers to make a breakfast hash in the morning and it works great. I'd definitely make this again, and I super recommend adding in some sausage to heat things up a bit.LTDenton, TX12/11/2020Can I substitute ricotta cheese instead of yogurt? I made this recipe before and absolutely loved it but I don’t want to have to go to the store just for yogurt lol. I also have sour cream and Mayo. What would you suggest?KLynamSouth bend IN11/25/2020Can I use ricotta instead of yogurt ? Kayla LSouth bend Indiana 11/25/2020This recipe is delicious! We all loved it - the flavor and texture combo is perfect and I now love this method of cooking sweet potatoes. I put parchment paper under the potato halves to keep from sticking AnonymousLouisville 11/21/2020Unfortunately this really wasn’t a win for me. It took a while longer for the sweet potatoes to char than expected and they stuck to the pan horribly (not BA’s fault, just a warning) and then while they themselves were quite tasty neither the yogurt nor crunchies wowed any of us. Now, caveat, I didn’t have fennel or cumin seeds so I used a much reduced portion of each, ground. The dish wasn’t terrible we certainly ate it but all wanted it to be either more savory or sweet and this seemed like not quite enough of either. The yogurt seemed kind of bland, I think it might’ve benefited from a little bit of sugar. The flavor combos here just weren’t gelling for us but I do like the concept and the different textures. BananaMartiniElkins Park, PA 11/4/2020This was so simple and delicious! Perfectly balanced. This will definitely be a weekday regular for me. Thanks, Molly!AnonymousDenver, CO5/21/2020Served this over mixed greens for dinner - super yum!AnonymousNashville 4/15/2020Made as written. Excellent dish. \nFlavors were well balanced, easy to put together.iz2Duvall, WA4/7/2020I loved the picture and wanted to try the recipe.  By the time I got around to it over the holidays my Greek yogurt had expired and I realized I had 2 pounds of sweet potatoes but only two separate ones...so the cooking took longer - the charring is a great clue to doneness.  I replaced the yogurt with mostly sour cream with a little bit of mayo to top up to 1/2 cup and then 1/2 c of whipping cream that I turned into buttermilk.  Even with all these changes, the flavour of this was outstanding!  Presentation was excellent and the dish got rave reviews.  The nut mix added so much depth/complexity of flavour.  Thanks for including the photo - showed what you meant by \"coarse chopped hazelnuts\".  LOVED this dish.AnonymousCalgary, Alberta12/31/2019Amazinggggg!!! So well balanced. That crispy spice nut mix is to die for - I’ll be making more to top yogurt bowls and salads! The browned butter adds so much depth of flavor. \n\nWe made this with carrots and it was a star dish. AnonymousBoston/Montreal12/2/2019Explore Bon AppétitSweet PotatoPotatoVegetableLemonCitrusFruitHazelnutNutFallWinterSideVegetarianGluten-FreeRoastThanksgivingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-10", "author": ["Condé Nast", "Molly Baz"]}