{"id": "857134a62b0df16dc482c3ffc3785440", "url": "https://www.bonappetit.com/story/big-spoon-roasters-chai-spice-peanut-butter", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "I Hate Myself for Spending $14 on Peanut Butter, But Dammit, Big Spoon Roasters Owns Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Hate Myself for Spending $14 on Peanut Butter, But Dammit, Big Spoon Roasters Owns MeThis North Carolina-based company knows its nuts.By Carey PolisApril 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Maybe you can’t quit your $4 pour over habit. Or there’s that slice of $8 cake you buy to assuage the Sunday scaries. I support you. Because sometimes I buy $14 peanut butter.But it’s not just any peanut butter. It’s Big Spoon Roasters’ Chai Spice peanut butter, which is a heavenly mixture of peanuts, almonds, cardamom, sugar, honey, clove, ginger, cinnamon, black pepper, vanilla, and Jacobsen sea salt. It evokes the same flavor profile as chai tea, and has lots of small crunchy bits that remind me of biting into a good, aged Parmesan. This peanut butter gets very close to straight-up dessert, but a nice salty hit helps bring it into sweet-or-savory land. Basically, this is the chunky peanut butter equivalent of fairies and cloudless 74° days and rainbows, but like…the indie, small-batch version of those things (the fairies definitely wear naturally dyed linen jumpsuits).It’s straight-out-of-the-jar good, but I prefer to really treat it right by spreading it (sparingly—I’m not a millionaire) on some toasted bread, perhaps with some thinly sliced banana. Or, as part of a brunch spread when you’re hosting guests, but only guests that you extra-special like or need to really cement a friendship with.So yeah, Big Spoon Roasters. Fairies and friendship. What could be better?Buy It: Big Spoon Roasters’ Chai Spice peanut butter, $14All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingPeanut ButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Carey Polis"]}