{"id": "85736dbcbac68783f69c45783c51f208", "url": "https://www.bonappetit.com/story/dinner-steak-and-eggs", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Steak and Eggs with Saucy Beans Are What’s For Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNo Time for Breakfast? Steak and Eggs with Saucy Beans Are What’s For DinnerThe diner staple gets an upgrade with creamy beans, a smoky rub, and sweet charred limes.By Hilary CadiganJanuary 9, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailSerious question: Is there any meal better than breakfast for dinner? If you answered yes then I’m sorry but you are wrong. Very wrong. But don’t take it too hard. We all make mistakes. What I have for you here is salvation of sorts. What I have for you here is Steak and Eggs with Saucy Beans.See, I’m one of those people. The ones who struggle with mornings. I hit snooze twelve times, wake in a panic, throw on whatever sweater I find on the ground, chug a scalding coffee, then sprint out the door as the last train getting me to work on time pulls out of the station. I never have time to eat breakfast. And that makes me very sad. But you know what cheers me up? Yes, you do. Having breakfast for dinner.Packed full o’ protein and heavy on the flavor, this particular breakfast for dinner is an excellent example of the form. It’s also a serious upgrade on the typical greasy laminated placemat iteration of steak-n-eggs, she of the tough under-seasoned meat and gelatinous scrambies. And making it is so easy that I might even consider waking up a little earli—lol jk. It’s dinner. Let’s talk strategy.First, you grab a couple of fine New York strip steaks and rub ‘em all over with a fiery blend of hot smoked paprika, Aleppo-style pepper, salt, and black pepper. This is the perfect cheat-rub for making quick pan-seared steak taste like it spent quality time on a grill when it’s too cold to grill outside. Let it sit and soak while you focus on those saucy, saucy beans.This part is simple: Sauté some shallots, garlic, and fresh cilantro stems (yes, they’re edible and you should never waste them!) until soft. Then add a can of pinto beans. On that subject, here’s some potentially unexpected advice from the Test Kitchen: For the best flavor, skip the “no salt added” beans and opt for a classic pre-seasoned brand like Goya. The beans pick up more flavor the first time they’re cooked (yes, in the factory) and it’s hard to get them to Ideal Saltiness Level once that opportunity’s been passed up. That said, definitely drain and rinse your beans—ain’t nobody got time for that mucous-y, preservative-filled can gloop.Next, add butter and water (to make up for the missing can gloop—you still need liquid), and let those beans simmer ‘til incorporated and saucy. Then remove them from the heat and stir in the leaves from those cilantro stems you didn’t waste. Sprinkle them with a bit of lime zest and half a lime’s worth of juice. Done. Cover them so they don’t get cold.Now: Steak, which gets cooked on a skillet (definitely opt for cast iron if you have it) for three minutes on each side. Here’s where things get craaaa-zy: Add a couple of halved limes to your skillet. Yeah. We went there. See, charring citrus is a great way to transform its sharp acidity into something more mellow and sweet. The cooking oil in the pan will suck those flavors right up into the meat, which will then get a double dose once you squeeze those sweet limey juices all over it after plating.Then come the eggs: Cooked sunny side up in the same skillet until their edges get lacy and brown and perfect. And that is it, folks! Spread the steak on a pretty slab of wood with the cut limes artfully scattered about, and slide an egg atop your plate. And suddenly, you’ll realize something. All those sanctimonious early birds? They can keep their slimy worms. We’ve got steak. And eggs. And the sauciest beans in town.Get the recipe:Steak and Eggs with Saucy BeansThe diner classic gets a boost from a pot of zesty, creamy beans and sweet charred limes.View RecipeExplore Bon AppétitDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-09", "author": ["Condé Nast", "Hilary Cadigan"]}