{"id": "85802790113db01031b922f8bcd230c6", "url": "https://www.bonappetit.com/story/dish-decoded-naemo-gujeolpan", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Every Little Thing That Goes Into Naemo’s Stunning Gujeolpan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEvery Little Thing That Goes Into Naemo’s Stunning GujeolpanPop-up founder Arnold Byun and chef Kyungbin Min walk us through each dish in this celebratory Korean platter.By Frances KimAugust 17, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Dish Decoded we break down all the components, stories, and techniques behind a restaurant’s...well...dish that we’re obsessed with right now.“There are so many amazing classical dishes in Korean cuisine that have been forgotten because no one is preserving them or giving them a contemporary voice,” says Arnold Byun, founder of Naemo, a modern Korean pop-up in Los Angeles.One of those dishes is gujeolpan, a celebratory dish that dates back to 14th-century Korea. Literally translating to “nine sectional plates,” gujeolpan consists of eight vegetable, meat, or seafood banchan (side dishes) that you can wrap in delicate crepe-like wheat pancakes. Byun first learned about the dish when he was researching Korean royal court cuisine while working as the maître d’ at New York City’s Atomix but didn’t think to make it until he started Naemo.Together with chef Kyungbin Min of Hanchic in L.A.’s Koreatown, he decided to reimagine gujeolpan with distinctly California ingredients (Meyer lemons!) and Korean cooking techniques (just look at that omelet) at Naemo. Byun’s attention to detail is evident in every aspect of the pop-up.“Naemo means ‘square’ in Korean. Here you have this square gujeolpan with square compartments, and it’s being [rolled out] on Instagram, which is a grid of squares,” Byun explains. “Everything is very intentional.”The food is no exception. While eggs, beef, shrimp, mushrooms, carrots, bean sprouts, and cucumbers are often included in gujeolpan, there are no hard-and-fast rules. The focus is on the preparation and presentation: Each ingredient is cooked separately, lightly seasoned, and artfully arranged on a partitioned plate. To eat this gujeolpan, take the pink radish square, add your choice of fillings, roll, and enjoy. It also comes with roe-and-radish-topped bap (rice) and a seasonal guk (here, the soup is made from simmered ribs). With this fluidity in mind, Byun and Min let the Santa Monica farmers market serve as their inspiration.Here they break down how they take hyper-seasonal California produce and thoughtfully apply Korean flavors to create a gujeolpan for the 21st century.Jidan MariJidan is a classic Korean garnish, and typically in this rolled omelet, the egg whites and yolks are separated, lightly fried, and julienned for gujeolpan. Here they’re layered with perilla and rolled up into the most eye-catching omelet instead.Mushroom MedleyMin loves this filling because it’s got an element of surprise: Beneath the blanket of carrots are butter-sautéed mushrooms (oyster, enoki, and shimeji).Myulchi Bokkeum (Anchovies)Min opts for humble stir-fried anchovies with dried shrimp and walnuts, but they’re gilded with two nontraditional additions: Deglet Noor dates for sweetness and white borage flowers for a cucumber-like flavor.Spring Chaeso“A salad in a Korean meal is so Korean American,” Byun says. They flip the script on sweetly dressed romaine salads served at Korean barbecue restaurants with this radicchio one tossed with maesil wonaek (plum extract) and Meyer lemon.Moo SsamTraditionally, miljeonbyeong (wheat pancakes) are the centerpiece of gujeolpan and used as wraps for the eight banchan (side dishes). Min wanted to anchor the dish with something lighter and more refreshing: pretty-in-pink breakfast radishes pickled in rice vinegar. Sigumchi NamulMin takes this banchan staple over the top by using gorgeously ridged Bloomsdale spinach and adding nutty, minty deulkkae (perilla seeds). “You get a nice little pop every time you take a bite,” he says.Romanesco DubuWhile romanesco and tofu are Min’s modern additions to gujeolpan, they help fulfill one of the platter’s defining characteristics: the presentation of obangsaek, the five traditional Korean colors, which are white, black, red, yellow, and blue or green.Rib-Eye JorimBeef is customarily the most luxurious ingredient in gujeolpan. Min ups the ante by braising fatty rib eye and boiled quail eggs in his signature galbi sauce (his secret ingredients include cola, kiwi, and apple).Hobak MuchimMin blends the old and the new with condiments in this yellow squash dish. It gets an umami boost from guk-ganjang (a light soy sauce used in Korean cooking for centuries) and Yondu (a fermented vegetable extract invented in 2010).Explore Bon AppétitRestaurantsDish DecodedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-17", "author": ["Condé Nast", "Frances Kim"]}