{"id": "8595a27608083577995909fef32aa607", "url": "https://www.bonappetit.com/story/cafe-bizou-undying-love", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Café Bizou in Sherman Oaks Has Zero Hype, and My Undying Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsCafé Bizou Has Zero Hype and My Undying LoveWhen you want to actually dine in secret, you have to give up one tiny thing: the food.By Jenni KonnerJune 6, 2018FacebookTwitterEmail@schwartzreportzFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the coolest people we know to reveal the local spots they love the most.The typical restaurant conversation in L.A. typically goes like this:“Have you been to that cute little—?” “Yes, last week. Loved it. Noodles were dope. Did you try the new—?” “Yep, was there two days ago. Totally worth the 14-hour wait in a dank alley.”It may be a town of many secrets, but food is not one of them. When I want to eat something delicious, I usually go to one of four places:Petit Trois for the buttery Boursin omelette.Jon & Vinny’s for the spicy fusilli with vodka sauce (preferably prepared by badass chef Courtney Storer) paired with a wine described  like a “straight up perfection Gam-eezy, make you feel so breezy” (wine director Helen Johannesen describes her wine like no other sommelier you’ve met).If I’m feeling Eastside vibes, I’ll go for some spiced lamb kabobs at Botanica or maybe the crispy, lemony potatoes at Mh Zh. But these are rightly well known and well traveled.Even the supposedly under-the-radar spots have been intensely researched and generously exposed by food critic Jonathan Gold. The man has left no dumpling unturned. The secret menus are no longer secret. “Animal Style” might as well be taught in preschools for the amount of people who know about it.When you want to actually dine in secret, you have to give up one tiny thing. The food. Because does it always have to be about the food? Look, I’m a lover of good meals—I’ve traveled thousands of miles for a good piece of uni. But there are times when all I want is a mediocre filet (I know, I know: rib eye, skirt, anything but filet...) and a baked potato.And so I travel. I travel all the way to Sherman Oaks. I sit in a restaurant that feels very 1982 Upper West Side in both its design and its clientele. On those nights, Café Bizou suits my needs perfectly: the white tablecloths, the fact that I’m the youngest person in the room who isn’t a petulant grandchild dragged along for a birthday or christening, the always available reservation. All of these things make up what can sometimes be the perfect meal. Sometimes it isn’t about finding the unknown jewel—it’s about a great baked potato, which is harder to find in L.A. than you could ever imagine.Jenni Konner was an executive producer of “Girls,” and is the co-creator of the upcoming show “Camping” on HBO.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRead MorerestaurantsHow a Cheap, Bent-Up Composition Notebook Helped Me Open a RestaurantBy Ori MenasherestaurantsWe Go to This Restaurant Just to Stare at the CeramicsBy Zan RomanoffrestaurantsWe Want Everything on the Menu at This New Cali-Filipino RestaurantBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Jenni Konner"]}