{"id": "85a8a706a85a1886f1a1d9f4caf137c5", "url": "https://www.bonappetit.com/story/best-drip-coffee-makers", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "The Best Drip Coffee Makers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Drip Coffee Makers, According to a Highly Caffeinated BA StafferYour old college coffeepot could never.By Jenna Adrian-DiazFebruary 22, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Shopping for a new drip coffeemaker can be positively daunting. But there are a handful of features that distinguish the best drip coffee makers; the ones that can consistently brew a cup of joe that will knock your house slippers off. My favorite is the Moccamaster Technivorm KBT, which produces the best homemade drip coffee I’ve ever tasted. It reliably churns out coffee that’s smooth, never sour or bitter, and actually evokes the tasting notes listed on a bag of beans. My college coffeepot could never.Technivorm Moccamaster KBT Coffee Brewer$329 at Amazon$340 at Sur La Table$319 at Food52To learn more about the features and specs that play a part in why some machines brew superior coffee, I turned to Cara Mitchell, public education manager at Joe Coffee, a chain of cafés in NYC that has been in business for 19 years. Joe’s house drip coffee has been dependably excellent for the seven years I’ve been sipping it, first as a university student and more recently as an occasional pick-me-up on the way to work. Mitchell chalks up the quality of their brew to using great beans that have been roasted within 30 days of use and machines that heat and distribute water in just the right ways.To help me understand the difference between a $30 drip coffee maker and a machine that costs four times that amount, I asked Mitchell what I’m actually paying for. Generally, “the more expensive machines are maintaining water temperature much better than the less expensive coffee makers,” she says, which helps extract maximum flavor from your beans. “They’re also dispensing the water a little more evenly over the bed of coffee [grounds]. And both of those things are really important.” The takeaway: Investing in a solid machine will result in a difference you can taste.The Moccamaster is the best drip coffee maker I’ve used. It brews a full 10-cup pot in six minutes or so—a literal lifesaver during the months I got to know its ins and outs while staying with family who use and swear by it too. Its copper heating element keeps the water temperature within the ideal range of 195–205 degrees Fahrenheit, meaning that our household of five adults was treated to consistently smooth coffee day after day. “When it comes to brewing coffee, you want to make sure that the water temperature is as even as possible throughout the entire brewing process,” Mitchell explains. And this machine’s temperature control is excellent: The conical filter basket positions the coffee grounds so that the water flows through (gravity!) rather than pooling in the filter basket and potentially over extracting the coffee, which is usually the culprit behind bitter brews.Of all its charms, my favorite feature of the Moccamaster Technivorm KBT is that it doesn’t use a glass pot and hot plate to keep your batch warm. Instead, coffee is brewed directly into a thermal carafe that maintains the temperature, as opposed to “cooking” it the way the machines with glass carafes and hot plates tend to do. “If you leave it too long on that hot plate, it’s going to end up tasting, well, not as good as if you maybe drank it 45 minutes earlier,” cautions Mitchell. “Those insulated carafes will keep your brew hot, but they’re not going to continue to extract the coffee.”While I love the Moccamaster Technivorm KBT, it’s not the only drip coffee maker on the market that meets Mitchell’s criteria for brewing great-tasting coffee. If you’re looking for something less expensive, more glamorous, or slightly smaller, we’ve got options for you as well.The Best Less-Expensive (but Still Fancy) Drip Coffee Maker“Whenever I think of coffee, I always want to make sure that it is as accessible as possible, and I always like to tell people that they don't have to have the most expensive equipment in order to get the best coffee at home,” says Mitchell, who recommends Oxo’s 8-cup drip coffee maker. It’s a “great entry-level machine at an excellent price point,” she says, especially in comparison to big-ticket brewers on the market.OXO Brew 8 Cup Coffee Maker$178 at Amazon$178 at Sur La Table$178 at OXOThe Oxo comes with a lot of the features commonly found in drip coffee machines above the $200 price point: a focus on maintaining consistent water temperature, an expansive showerhead to evenly distribute water over the bed of coffee grounds, and a certification by the SCA (that’s the Specialty Coffee Association) that the machine meets its standards for brewing great quality coffee. As a bonus the Oxo also includes a special filter you can use to brew a single cup of coffee—no pods or single-use plastic required. If I hadn’t already splurged on a home espresso machine, I’d seriously be stumped between shelling out for my own Moccamaster or opting for the Oxo brewer.The Best Small Drip Coffee MakerBonavita, a coffee machine manufacturer with several SCA-certified products, also happens to make this petite 5-cup brewer that meets Mitchell’s criteria. It can brew anywhere from three to five cups and maintains that ideal temperature range for optimal extraction. It’s available on Amazon and its plastic parts are all dishwasher-safe. It also happens to be the most affordable machine, albeit, without all the bells and whistles of the Oxo 8-cup brewer, on our list.Bonavita 5 Cup Coffee Maker$100 at Bed Bath and Beyond$130 at AmazonThe Best-Looking Drip Coffee MakerOur pick with the most countertop appeal also happens to be the highest-capacity brewer on our list: Zwilling’s Enfinigy drip coffee maker can brew up to 12 cups and looks downright futuristic (like a chic robot). This brewer has a stainless-steel boiler that the brand says is corrosion-resistant, so it won’t impart funky flavors into your coffee. While I didn’t love that it had a glass carafe and hot plate, I was intrigued by the fact that the hot plate stays on for only 30 minutes before the machine automatically shuts down. The fact that it keeps track of when it needs to be cleaned, and has an easy-to-use cleaning setting, also ups its convenience factor in a major way.Zwilling Enfinigy$200 at Amazon$200 at Bed Bath & BeyondMore caffeine-fueled content from BA’s Coffee Week:The Best Ways to Make Coffee, According to BaristasThis Reusable Coffee Filter Means I Never Worry About Running OutThe Coffee to Water Ratio That Makes a Perfect BrewThis Flash-Frozen Concentrate Is Revolutionizing the Way I Drink CoffeeYou Should Add Spices to Your Coffee GroundsExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-22", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}