{"id": "85a9e0fd4b1d496215f7002ecdbeb766", "url": "https://www.bonappetit.com/story/salt-your-potato-water", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "The Best Way to Boil Potatoes for Potato Salad is in Super Salty Water | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Potatoes Are Boiled in Exxxtremely Salty WaterNo! More! Bland! Potato! Salad!By Molly BazJune 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI’m sure you’ve heard about the whole “salt your pasta water until it’s salty like the sea” thing, but have you heard the whole “salt your potato water ‘til it’s salty like the sea” thing? It’s exactly what we’re here to discuss.Answer me this: Is there anything worse than a bland potato?! All that monotonous starch with nothing to make it tasty is a royal waste. And the highest-impact way to avoid under-seasoned, taste-like-nothing potatoes is to salt the potato cooking water. (Sadly, if you skip this step, almost no amount of salt added directly to the cooked potatoes can redeem them.)Most people, in my opinion, are drastically under-salting their potato water. Think about it: Even when they’re cut in half, potatoes are large, dense items. Salt has to penetrate a lot of mass in order to make it all the way through to the potatoes’ middles by the time they’re finished cooking.If adding 1 cup of kosher salt to your potato water (as in my recipe for Sour Cream and Onion Potato Salad) still seems like a lot, just think about how much of it is going down the pipes when you drain those potatoes. Nearly all of it! The cup of salt is there to make the potato water highly concentrated so that the salt can do its magic on those dense potatoes in the 15 or 20 minutes they take to cook through. Rest assured, I’ve done countless tests to determine the right proportion of salt to water when boiling potatoes—I urge you to trust the work of those before you.Beyond that, you’ll probably end up adding some kind of fat to those potatoes after you’ve cooked them (be it sour cream or mayonnaise in the case of potato salad, or olive oil in the case of crispy boys). When you’re doing that initial boil, take into account that the fat will mask and dilute salt.So what if I’ve been nicknamed “salty girl” over on YouTube due to my unwavering commitment to properly seasoned food? I’m actually just unwaveringly committed to delicious food, and delicious food starts with properly seasoned food, and that all comes back to learning how to salt it.Yeah, I’m a #saltygurl and I’m proud of it. Join me in the Salty Girls' Club. I promise you it’s super tasty over here.Ready, set, potato salad:Sour Cream and Onion Potato SaladThis recipe was an excuse to combine our favorite potato chip flavor with the creamy, salty \"salad\" of our dreams. To hammer that home, the whole dish is topped with crumbled sour cream and onion potato chips.View RecipeExplore Bon AppétitPotatoPotato SaladSaltRead MoreSmashed Potato SaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-25", "author": ["Condé Nast", "Molly Baz"]}