{"id": "85d3bc5d4de980a35580ee22d7d85511", "url": "https://www.bonappetit.com/story/craving-seafood-juneau-alaska-has-got-you-covered", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Craving Seafood? Juneau, Alaska, Has Got You Covered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredCraving Seafood? Juneau, Alaska, Has Got You CoveredBy Princess CruisesJuly 12, 2018FacebookTwitterEmailPAUL NORDMANNFacebookTwitterEmailEver since we watched BA Test Kitchen Manager Brad Leone catching crabs in Alaska, we’ve been on a serious seafood kick. You too? We don’t blame you. Juneau has a serious reputation for some of the country’s best catch, and we want to try it all. Give us freshly caught halibut, vibrant Alaska salmon, crab legs dripping in butter, creamy crab bisque, jumbo crab cakes, and more. When you’re docked by the wharf (hello, Princess Cruises) lace up your walking shoes for an adventure through town, and don’t miss the best local haunts. Read on for a list of some of our favorites with tips on what to order. And most importantly, don’t forget to pack an appetite! Pro-Tip: all spots available on the Juneau Foodie Walking Tour!Dinner with a View Never Tasted Quite So GoodServed up fish-and-chips style, overflowing in tacos, or grilled with light seasoning, sautéed or fried—Wild Alaska halibut should be on your mind the moment your ship docks in Juneau. The fish is firm, mild, and sweet, and found at almost every restaurant in the area (but we know where it really shines). At local hangout Hangar on the Wharf, the chef prepares the dish with a macadamia nut crust that pairs deliciously with its creamy pineapple curry sauce, and a side of fresh seasonal veggies. The veteran town favorite (celebrating their 21st anniversary in June!) offers open-air seating and the perfect vantage point to watch sea planes land on the water while you dine.Get the Best Legs in TownKing crab legs...smothered...in warm butter. Do we have your attention? If your mouth is watering, grab a pencil and jot this down: Tracy’s King Crab Shack. Known for having “the best legs in town,” Tracy’s is loved by locals and visitors alike, a must-stop for crab lovers from all around the world who come to Juneau. Tracy’s is also famous for their hockey puck sized crab cakes (which you can get piled into a sandwich topped with fresh coleslaw) or Tracy’s secret recipe for a cream-based crab bisque, which comes served with fresh garlic rolls. If you don’t make it to the restaurant, don’t you worry -these famous crab cakes are also available on the top deck grill aboard your Princess Cruise!Step Up Your Nacho GameAt V’s Cellar Door, upgrade your nacho game with their famous fusion-style nachos. We’re talking all the usual suspects; crispy tortilla chips, layered jack and cheddar cheeses, pinto beans, tomatoes, sour cream, house-made guacamole with a few dynamite additions that make this dish a must when you arrive in Juneau. The nachos are topped with V’s Cellar Door signature cabbage slaw, fresh caught flaky local halibut, house-made guacamole, and a unique Asian-inspired fusion sauce drizzled on top. V’s is a one of kind Asian-Mexican fusion spot so everything on your plate will rock you world, take our word for it.Fish Tacos for the WinFish tacos are a popular choice at bars and restaurants nowadays, but nobody makes them with as much passion and TLC as Deckhand Dave’s. Their taco truck is a must-visit while in Juneau, and you’ll be impressed by the quality and freshness of their menu, created by an ex-commercial fisherman (so you KNOW they are using the freshest catch of the day). Try the rockfish or halibut tacos-but for something truly special-order the panko-crusted salmon tacos with crunchy red cabbage slaw, pico de gallo, spicy avocado crema, and cilantro on soft flour tortillas. Tacolicious.Want to take a bigger bite out of Alaska’s seafood scene? Find out about the Juneau Foodie Walking Tour during your next Princess Alaska Cruise via princess.com/bonappetit.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Princess Cruises"]}