{"id": "85d9a172d2f237717caf83d39c1b2ab1", "url": "https://www.bonappetit.com/recipe/chocolate-biscoff-banoffee-pie", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Chocolate-Biscoff Banoffee Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueChocolate-Biscoff Banoffee PieBy Mallory CayonFebruary 9, 20214.3(32)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'Myrtrek BrownEmailPinterestPrintEmailPinterestPrintThis pie is a combination of chocolate, bananas, and butterscotch, but it isn’t your traditional British banoffee pie. Mallory Cayon, of Sunday Hospitality in NYC and L.A., uses crisp, gingerbread-like speculoos cookies in the crust to add just a hint of spice and bitter chocolate to contrast with the caramelly butterscotch filling. You’ll want to make this pie at least 6 hours before serving to give the pudding time to set up. This recipe calls for Biscoff, the biggest name in the speculoos cookie game, but other brands will work. And graham crackers would be a fine sub too.IngredientsMakes one 9\"-diameter pieCrust1sleeve Lotus Biscoff cookies (about 32)6Tbsp. unsalted butter, melted⅓cup (67 g) granulated sugarGanache3oz. semisweet chocolate (at least 64% cacao), chopped½cup heavy cream1Tbsp. unsalted butter, room temperaturePudding and Assembly⅓cup (67 g) granulated sugar1½cups whole milk2Tbsp. heavy cream, room temperature¼cup (50 g) light brown sugar1Tbsp. unsalted butter¼tsp. kosher salt3large egg yolks2Tbsp. plus 2 tsp. cornstarchChopped chocolate (for serving)2bananas, thinly slicedPreparationCrustStep 1Preheat oven to 350°. Crumble cookies into a food processor and pulse until very finely ground. (You should have a heaping 1½ cups.) Add butter and sugar; pulse until mixture is combined and sticks together when pressed between your fingers.Step 2Press mixture across bottom and up sides of a 9\"-diameter pie dish with your hands. Freeze crust 5 minutes.Step 3Bake crust until slightly darkened around the edges, 8–10 minutes. Let cool.GanacheStep 4Place chocolate in a medium bowl. Heat cream in a small saucepan until just beginning to simmer; immediately pour over chocolate. Let sit, undisturbed, 5 minutes.Step 5Add butter to chocolate mixture and stir with a heatproof rubber spatula until smooth and glossy. Scrape ganache into crust and smooth out any bubbles. Chill, uncovered, until set, about 30 minutes.Pudding and AssemblyStep 6Stir granulated sugar and 2 Tbsp. water in a medium heavy saucepan to combine. Bring to a boil over medium heat, stirring to dissolve sugar, then cook, swirling occasionally but not stirring, until deep amber, 7–9 minutes. Remove from heat.Step 7Gradually add milk and cream to caramel, whisking constantly until smooth. The caramelized sugar may stick to the bottom of the pan at first but will eventually loosen and become smooth. Whisk in brown sugar, butter, and salt, then bring butterscotch to a boil.Step 8Whisk egg yolks and cornstarch in a large bowl until smooth. Gradually pour in butterscotch, whisking constantly until combined. Wipe out saucepan and scrape pudding mixture into pan. Cook over medium heat, stirring often, until pudding bubbles occasionally and starts to thicken, about 5 minutes. Strain pudding through a fine-mesh sieve into a large bowl and let cool 10 minutes.Step 9Scrape pudding into crust on top of ganache and smooth surface. Chill pie, uncovered, until pudding is set, at least 6 hours.Step 10To serve, scatter chopped chocolate around edges of pie filling, then pile bananas in the center.Do ahead: Pie (without chopped chocolate and bananas) can be made 3 days ahead. Cover and keep chilled.How would you rate Chocolate-Biscoff Banoffee Pie?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleCaramel reaches Deep Amber at around 355°F, for anyone preferring to use a candy thermometer.\n\nThis was a big hit at a family party, though a few noted the pudding was too sweet. Will definitely toy with the sugar levels next time around.AAANew York, NY12/23/2021I thought this was stellar! The crust was the showstopper and I didn't put the sugar in since it was all cookies smothered in ganache. I would use this crust for all pudding pies now!\n\nThe pudding directions stressed me out (in a pot, in a bowl, in a pot), so I made it the way I normally do, by tempering the egg mixture with some of the hot milk and then whisking it into the pot on the stove.  No issues, no lumps (at least not by home cook standards). Anna McDermottMcLean VA11/6/2021This recipe was fantastic. One note: when I made the pudding, I removed the sugar from heat like step 6 instructed, and it instantly cooled SO quickly that even adding a tsp of the milk caused the entire sugar mix to turn into unsalvageable hard candy. I'd recommend keeping the sugar on the heat but lowering heat once it turns to the dark amber color. It's enough heat to make the caramel process go more smoothly.\n\nI also didn't strain my pudding and didn't have any chunks! Just have to be cautious and slow and whisk vigorously when mixing the eggs and hot ingredients.Anonymousutah7/22/2021The pudding instructions are misleading!!!! The way it reads makes it sound like the egg+cornstarch mixture needs to added to the butterscotch on the stove, but it is the opposite. Once I tried it again it went as planned. BrittPA4/24/2021I made this for Easter, it was so good but I did need to tweak it some. The crust was fine, and since the pudding is not too sweet, it added a nice contrast. My pie pan was smaller than the one indicated. I made the pudding as in the recipe, but needed another batch. On the second batch of pudding, I added an additional 1/2 C milk and increased the Cornstarch to 3 T. I also added an additional 1/2 C milk whisked into the eggs, which helped the yolk cornstarch mix blend into the pudding mix with WAY less lumps. These were the only tweaks, but next time I will add sliced bananas in the pudding mix.Diane BVancouver WA4/5/2021Everything was going so well and I was so excited.  Then I added the egg + cornstarch to the pudding and it became clumps of gritty scrambled egg.  I think there ought to be some tempering like you would do for a creme brûlée?Anonymous3/7/2021I wasn’t crazy about this turned out. The Biscoff cookies are already quite sweet so I found the extra sugar too much, and I have quite the sweet tooth! The chocolate layer was a nice addition. The pudding tasted great on its own but overall I found that there wasn’t much flavour, it just tasted sweet. Also I really wouldn’t call this banoffee, it’s very different from a classic banoffee pie. It wasn’t too much work though, quite easy to put together if your used to making caramel. AnonymousMontreal, Quebec, Canada3/7/2021This is a lovely-looking dessert, but please take the word \"banoffee\" out of the title. This bears no resemblance to banoffee pie.MarjorieIowa3/5/2021This pie is truly a delight. I had it for dessert last night and breakfast this morning. I will say the step making the caramel was very difficult to me and it took 4 tries. I need more practice making caramel in general. I also definitely used large egg yolks but it was very hard to make them a creamy consistency with that much corn starch. It was clumpy, so I started over with less cornstarch. I put the pudding on the stove on medium and vigorously whipped in the egg yolks and about 3 tablespoons  cornstarch until it thickened. If it isn’t thickened to your liking, you can just whisk in more cornstarch as it boils. You have to strain out the lumps anyway! If I was president I would make Biscoff cookie crusts the news standard instead of graham cracker crust. Why are we settling for less America?? Anyway, loved this twist on a Banoffee pie. Next time it will be much easier to make.Moriah Mason Salt Lake City2/27/2021This was so good! I would definitely make it again. This recipe is more involved/effortful than many desserts, which makes sense given it has three distinct layers. That said, it was worth it. This was my first time making caramel and pudding from scratch, and I was a bit unsure of the steps, but I followed the recipe as exact as I could and it all went fine. I think an important component is to use a heavy saucepan, like the recipe says.JaneyMountain View, CA2/24/2021This was really delicius but next time I will add another tbsp of conrstarch because it was a bit runny, even after chilling overnight. I would also add a small pinch of salt to the biscoff crust to balance out the 1/3 c of sugar. I served it with lighlty sweetened whipped cream and everyone loved it!AnonymousSalt lake city, utah2/22/2021my pudding split :( So not creamy as I had hoped.  The first time the milk/butterscotch is brought to a boil, it curdled for me. I thought maybe when i added the yolk and cornstarch it would smooth it out, but no.  Maybe my medium heat was too high? Otherwise awesome flavors, but the pudding component was above my skill set. Melanie2/20/2021Explore Bon AppétitPieDessertChocolateOther IngredientsBananaFruitNut-FreeVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Mallory Cayon"]}