{"id": "85db5b847a1e8ed91ecb1b8ee61c9e67", "url": "https://www.bonappetit.com/story/metro-shelving-kitchen-storage", "year": 2020.0, "month": 11.0, "day": 5.0, "content": "Metro Shelving Is the Answer to Every Storage Problem | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePantry Shelves Have Nothing on My Restaurant-Style Metro RacksIf you don’t have enough kitchen storage, it’s time to Metro Shelf–it.By Katrina YentchNovember 30, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.When I first saw Metro shelving in my partner’s apartment kitchen in Queens, I didn’t think twice about it. Both of us had spent the majority of our teens and 20s using them as staff at different coffee shops, bars, and restaurants, so it didn’t strike me as odd to see these giant industrial kitchen shelves at home—until a friend pointed them out. You see, I explained to said skeptical friend, although they’re not quite as cozy, their convenience and functionality far outweigh (literally, these are tanks) the cuteness of your typical pantry shelving setup.A lot of brands make something similar, but Metro shelving is the Kleenex of heavy-duty shelving. They’re the industry go-to! For one, they’re customizable for kitchens of pretty much any size. I know I said my boyfriend’s were huge, but it’s really a choose-your-own-adventure approach to shelving. They come in a range of widths, depths, heights, finishes, and installations—freestanding, wall-mounted, or on wheels! Too many roommates in the kitchen? Roll the shelves over to your “living-room-office” to make space.Oh, and those shelves? Well, they can be positioned at any spot along the posts for maximum versatility, so you aren’t stuck with that one tall appliance you just can’t find a space for. Plus, each of them can hold A LOT. Like anywhere from 250–800 pounds a lot. (See! I was not exaggerating. Tanks!) At a coffee shop where I used to work, we didn’t think twice about the 45-pound Cambros of iced coffee we threw onto them to brew overnight, or the heavy bags of beans we stored for use during the morning rush. They withstand it all. If you’re getting tired of gross little bottle rings left behind by sticky oyster sauce and sesame oil, have no fear. Metro shelves are also easy to clean. You can simply take a wet towel to them without worrying about damaging wood or veneer. They’re finished with a coating called Microban, which keeps the surface from getting covered in bacteria, mold, mildew, and all that other nasty stuff.But they’re not just for kitchens, either. They end up on construction sites, at hospitals, and in labs, so you can bet I use these elsewhere in my house too. (They’ve served my camping gear well in the garage.) As a longtime member of the F&B industry, these shelves are near and dear to my heart. As a person with quite a lot of stuff, I know there’s no better storage solution than to just Metro Shelf–it.Metro 18\" x 24\" x 74\" 5 Shelf Unit$215 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-30", "author": ["Condé Nast", "Katrina Yentch"]}