{"id": "85db0285f40a4abf0b7e8a038d276525", "url": "https://www.bonappetit.com/story/fewer-dirty-dishes", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "14 Ways to Make Fewer Dirty Dishes (Because Washing Them Sucks, OBVS) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking14 Ways to Make Fewer Dirty Dishes (Because Washing Them Sucks, OBVS)Washing dirty dishes is truly the most horrible thing. But the solution isn't to cook less—it's to cook smarter.By Sarah JampelMarch 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWashing dirty dishes is far and away the worst part about cooking at home. It’s worse than any annoying kitchen task—peeling carrots, separating eggs, picking herbs, deveining shrimp—because it typically comes after the meal, with no delicious reward to anticipate.There you are, relaxed, satisfied, nodding off a bit in your chair…when suddenly you remember the three pots, five cutting boards, dastardly fine-mesh sieve, and pile of knives waiting for you in the kitchen, all glommed with sauces and meat bits. There are even baking sheets slicked with oil. And you have no dishwashing machine. (I have just described most nights of my week to you.)But the solution for spending less time doing dishes isn’t to cook less (how could I endorse that?), it’s to cook smarter. Instead of rip-roaring through the kitchen, touching every appliance and utensil with your greasy hands, you can be a little more strategic about your dish usage. With a little brainpower, you can cut back on clean-up time (which’ll leave you more freedom to luxuriate at the table just a little bit longer). Here are 14 ways to cook with the aftermath in mind.Use both sides of the same cutting board so that you get two for the washing-price of one. Once you've finished with some messy prep, give it a quick wipe down, then flip it over to reveal the perfectly clean and dry reverse side. If you’re using a wooden cutting board, you’ll have to wash both sides anyway to prevent warping.And do as much as you can to prep all of the dry things (nuts, whole spices, hard vegetables) first, and smelly, watery, oily ingredients (kimchi, anchovies, blue cheese) towards the end. Taking a second to consider the order of operations will keep your cutting board and knife cleaner throughout your journey.Take a moment before you reach for a specialty tool to think about whether you can lean on something you’ve already used. Instead of fishing out the peeler for the ginger, use a spoon. Smash your garlic with a chef’s knife to peel it rather than using one of those fancy rolly tools. The same pair of tongs can toss the pasta and flip the roasted vegetables. One microplane can grate Parmesan and zest a lemon.How to Peel Ginger with a Spoon (Yes, a Spoon)Think you know how to peel ginger? Well, if you're using a vegetable peeler, you're doing it wrong.View StoryAnd try to keep track of what you’ve already dirtied, using a bowl or baking sheet to collect the items that have been “gently used”. Rather than placing every spoon in the sink, where it’ll get dirtier, put it somewhere (that won’t splotch your counter!) for safekeeping so that you can turn to it again, rather than reaching for a new specimen.Stash a bowl or deli container of soapy water next to or in your sink for cordoning off the truly dirty tools and utensils. Getting them soaking early on will make your clean-up easier, and quarantining them prevents a spoon covered in tomato paste from contaminating an otherwise almost-clean, easy-to-wash dish.Learn to love the quick-blanch. Rather than setting up a pot of boiling water and an ice bath (that’s two more bulky pieces to clean), blanch your vegetables in the sink. Put them in a colander, then pour water from the kettle over top. Rinse with cool water to stop the cooking process. We wouldn't recommend this for very delicate vegetables—like the first asparagus of the season—but it’s perfectly acceptable for hearty greens that you’re going to cook to oblivion anyway.)Are You Cleaning Your Kitchen Sink Often Enough?And what should you be cleaning it with? We got answers from cleaning experts.View StoryOr, at the very least, blanch the vegetables in the same pot as your pasta or grains. Before you dump your carb-of-choice into that boiling salted water—which will turn it starchy—take a moment to give those torn greens, broccoli, peas, or asparagus a quick bath. You can also do the reverse: If you were going to combine blanched vegetables with pasta later on, you can cook the noodles and throw the veggies in with them during the last few minutes of cooking. The timing is a little trickier with the latter method, but when it works you'll feel like a kitchen genius.Line your baking sheets with aluminum foil or parchment paper. Who likes to scrub sheet pans? No one, that's who. (If the wastefulness factor skeeves you, know that you can reuse clean-ish parchment paper several times. Remember: order of operations. If you use a piece of parchment or foil for toasting something dry, like nuts, it's ready to be used again for something more high-impact.) When you line the sheets for a messy task—like roasting tomatoes—you get the bonus of being able to easily funnel all of the saucy juices directly into your serving bowl. You can also use the same baking sheet two ways: With a little maneuvering and a good eye on the clock, you can toast nuts on one side and roast vegetables on the other. Hey, you could even create an aluminum foil barrier to make your job easier.How to Clean Baking Sheets So They Shine Like the Top of the Chrysler BuildingAll the tips and tools you need—including two ingredients you probably already have in your kitchen.View StoryIf you're mise-ing (and you're mise-ing, right?), read the recipe all the way through, then use one bowl for all of the ingredients that are part of the same step (garlic can usually mingle with onions, ginger, and chile, for example, and most spices will get added at once). And if you have a lot of ingredients that need to be separated, you can use something flat, like a sheet pan or platter, to lay them all out without dirtying five million teeny bowls.Measure dry stuff before wet stuff so that your measuring cups and spoons aren't too messy to keep using. You can use the same set for all ingredients going into the same dish—the flavors are going to overlap anyway!Or, if you’re getting advanced, eye more, measure less. This takes a bit of experience, and probably isn't recommended for things like baked goods, but if you pay attention to how much a teaspoon or quarter-cup looks like as you cook, you’ll start to get the hang of it. Remember to start with less than you think and taste as you cook so that you can adjust to your preferences.If You Hate Washing Dishes, These Are the Gloves for YouView StoryBest yet, if you're really into baking, buy a scale and say adieu to a pile of dirty measuring cups and spoons—good baking recipes will include both weight and volume measurements. It'll be the best $25 you spend this month.If you’re going to be measuring a lot of various liquids, maybe for a sauce or dressing, befriend the liquid measuring cup. With a bit of mental math and some estimating skills, you'll be able to pour all of the ingredients into one vessel. It saves you from dirtying lots of measuring cups—and then you can mix it together right in that Pyrex.When you’re meal prepping, try to use the same pan over and over again. Rice, lentils, and beans, for example, can all be cooked sequentially in the same pot, with just a wipe-out in between. This won’t save time as you cook, but you’ll make up for it later on.Another great solution for fewer dirty dishes:One-Skillet Dinners That Keep Dishwashing to a MinimumSteak. Chicken. Squash. It's all coming together in just one cast-iron skillet.View StoryExplore Bon AppétitBasicallyCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-05", "author": ["Condé Nast", "Sarah Jampel"]}