{"id": "85e18840ccb86eb995851ca6e88437b8", "url": "https://www.bonappetit.com/story/vichy-catalan-sparkling-mineral-water", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Vichy Catalan Is the Salty Mineral Water of My Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m a Freak for Salty Mineral Water, and This One Takes It Right to the EdgeVichy Catalan is a sultry, saline, crispy-but-not-too-fizzy water that just gets me.By Amiel StanekSeptember 25, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I hesitate to write this—because the general public already thinks that the editors at Bon Appétit are all shriveled, sodium-obsessed freaks—but here it goes: I like my water salty. And no, I’m not talking about pasta water, or blanching water, or water for storing freshly cut crudités—all of which I want to taste like the sea. I’m talking about drinking water.Okay, okay, not always; I’m not a monster. I consume my daily recommended ration of plain ol’ unadulterated H₂O like a good boy. But when I’m enjoying some Water Plus—that is to say, seltzer over ice, or some tap with a healthy squoze of citrus, the kind of NA bevvie that is more about recreation than hydration—I’ll add a tiny pinch of Diamond Crystal. Even the most conservative dose works the same magic on a beverage that it does for solid food, making the whole thing taste more: more savory, more quaffable, more craveable. Each swallow leaves my mouth watering, wanting more. This weird quirk of mine also makes me an anomaly in the bubbly water wars. You can keep your La Croix or Topo Chico or Polar. If I’m spending money on sparkling water, I want a cold liter of salty, salty Vichy Catalan.Let me tell you friends, this stuff is hot fire. Hailing from—you guessed it!—the Catalonia region of Spain, this wild-style mineral water contains, according to this water sommelier website that profiles boutique bottled water from around the world (LOL), a whopping 1 gram of sodium per liter. For context: The USDA recommends that adults consume no more than 2.3 grams of sodium per day. Y’all, this water has about as much sodium in it as a MF’ing Big Mac! It is the mineral water equivalent of an aggressive scrub down at a bathhouse or a deep tissue massage: punishing, purgative, purifying. And I cannot get enough.I remember my first taste of the stuff like it was yesterday. My dining companion and I decided to splash out for sparkling water at Frenchette, a tony modern French restaurant in Manhattan, and we were so engrossed in conversation that I didn’t even notice our water glasses being filled from a frosty, elegant, stone-textured bottle. I took a big swig mid-sentence and gasped with pleasure. It was explosive, psychedelically refreshing, like a gripping glass of Grüner cooled with rocks from a pebble beach. Sultry, saline, crispy-but-not-too-fizzy, I knew I had found the water that I would judge all others by, a water that truly got me.I fully understand if nothing I’ve said about my beloved Vichy Catalan makes it sound appealing to you. Different strokes! But just saying: If you’ve found yourself heeding any of BA’s insistent salt-related advice and found it changed, say, your pasta or grilled meat game for the better, consider giving Vichy Catalan a shot. A person can have a little salty water. You know, as a treat.Vichy Catalan Sparkling Mineral Water$3 at InstacartExplore Bon AppétitHighly RecommendShoppingRead MorecultureI’m Now a Leisure Soda Guy, Thanks to These Refreshing Leisure SodasBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-25", "author": ["Condé Nast", "Amiel Stanek"]}