{"id": "85e4376f85727d1d4f264848ff86b547", "url": "https://www.bonappetit.com/recipe/flaky-cod-with-celery-salad", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Flaky Cod with Celery Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFlaky Cod with Celery SaladBy Andy BaraghaniDecember 26, 20184.7(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe garlic-curry crisp in this recipe is your new secret weapon—the crunchy topping can embellish most other proteins, like braised chicken or roasted vegetables. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right. The plate pictured above is by Mondays.Ingredients2 servings26-oz. skinless, boneless firm whitefish fillets (such as cod, pollock, or halibut)2Tbsp. extra-virgin olive oilKosher salt2Tbsp. ghee2garlic cloves, thinly sliced2tsp. black or yellow mustard seeds11\" piece ginger, peeled, finely grated2tsp. curry powder, such as vadouvan2stalks celery, thinly sliced crosswise, plus 1 cup celery leaves, torn if large½small red onion, thinly sliced½lemonPreparationStep 1Preheat oven to 325°. Rub fish with oil on a parchment-lined rimmed baking sheet; season with salt. Bake fish until flesh is opaque and begins to flake, 12–16 minutes.Step 2Meanwhile, melt ghee in a small skillet over medium heat. Add garlic and mustard seeds and cook, shaking pan occasionally, until garlic is just beginning to turn golden and seeds begin to make a popping noise, about 4 minutes. Stir in ginger and curry powder and cook, stirring, until fragrant, about 20 seconds. Remove from heat; season lightly with salt.Step 3Toss celery, celery leaves, and onion in a small bowl. Finely grate zest and squeeze in juice from lemon into bowl; season with a pinch of salt. Toss to combine.Step 4Divide fish between plates. Spoon garlic curry over. Top with celery salad.How would you rate Flaky Cod with Celery Salad?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis recipe is a LOT better if you take the celery and cook it for 5 minutes in the sauce. Add the fish and then serve it all together. Huge difference.AnonymousChicago, IL3/4/2021This looks great and I'm making it tonight. However, there's no reason a printout of this (short) recipe should use three sheets of paper--one alone for the title. Can't BA adjust its Print options to fit this on one sheet? I hate grinding out all those empty but unusable sheets. TIA.Ellis WeinerL.A., CA1/31/2021This was a new flavor and ingredient combination for me, the reviews convinced me to try this recipe and it did not disappoint.  I followed the recipe which has great flavor combinations, easy preparation, and ingredients that I can get at my local grocery store.  It is a satisfying meal that did not leave us feeling weighed down after a holiday season of big & heavy meals.  Thanks to previous reviewers for giving me the confidence to try this new to me dish.   AnonymousOmaha, NE12/29/2020Yum! Used sole instead of cod and fennel instead of celery. The curry part is delicious!! Can’t wait to make again!AnonymousNY,NY11/18/2020This was so good! I was skeptical of the celery salad not having many ingredients but it was the perfect side to the fish. And the garlic and curry went wonderfully with cod. AnonymousDenton, TX3/18/2020Delightful flavors.  No ghee in the house, used oil and butter to substitute, otherwise by the book.  This goes on the \"impress your friends and neighbors\" list.  Used frozen cod (not much fresh seafood swimming around in AZ )and served with plain white rice so as not to distract from the unique flavors.  \nWill be doing this again and not changing a thing.\nscorpianPhoenix8/25/2019This has become a GoTo recipe. I’ve made it at least 3 times since seeing it, and I’m making it again tonight. It’s excellent fare! Cod in SoCal is typically frozen, so I use fresh Rockfish. It’s firm, which this recipe requires. I also use Cilantro instead of Celery Leaves, but that’s just a personal preference. I’m not a curry lover, but I LOVE this with the curry et al!  And it’s simple, fresh, quick, satisfying— everything a GoTo Recipe should be. Try it!  unechantuePasadena3/11/2019This was SO delicious!  I used pollack and mandolined the celery/onion.  I also doubled the garlic and curry mixture. It was easy to make and it tasted like something one would eat at a fancy restaurant. Great recipe! AnonymousNew York City 1/10/2019Excellent recipe with great flavors. I made a few substitutions, like butter for ghee and added tomatoes to the salad as well as a beans side dish, but overall this could have been perfect on its own. Will definitely make again - yum! AnonymousLos Angeles1/9/2019Delicious recipe! The red onion was way too strong for me so in the future I will use less. On the other hand, I was concerned that the mustard and curry would be overpowering, but it turned out just right! Thanks for helping me approach a new spice!lymbeverRaleigh, NC1/8/2019So delicious. Not gonna lie, the first time I made the garlic-mustard seed oil I accidentally burned it and had to start over. But it wasn't the end of the world and it was quick to redo! Cod turned out perfect, sauce was vibrant and crunchy, and I will definitely make this whole thing again. Celery, who knew?! Andy, I guess. alexbeggsBA.com 1/7/2019The variety of flavors and textures of the cod and celery salad is fantastic. mustard seeds add a pleasant crunch. Wonderful, definitely e keeper.ray.kennedy2014Minnesota, US1/6/2019Explore Bon AppétitCodFishSeafoodHalibutCeleryVegetableQuickEasyWeeknight MealsMainGluten-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Andy Baraghani"]}