{"id": "85e41bfcd863106f1eeeeb75d55e5bb1", "url": "https://www.bonappetit.com/story/how-to-tell-if-salmon-is-cooked", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Here's How to Tell if Salmon Is Cooked Perfectly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHere's How to Tell if Salmon is Cooked PerfectlyNever suffer through dry, chalky, stringy salmon again.By Alex DelanyAugust 14, 2019FacebookTwitterEmailFacebookTwitterEmailIf you think you don't like salmon, chances are high that you're overcooking it. Overcooked salmon is super-firm and opaque orange all the way through and whether it's farm-raised or wild, it will be dry, chalky, and, frankly, a waste of your hard-earned cash. (Another sign that salmon's gone too far? Tons of that white salmon goop called albumin.)For the benefit of salmon Niçoise salads everywhere, never cook your salmon above medium: That's the temperature where a fillet is at its prime level of juiciness (and is safe to eat).But how can you tell know how to tell when salmon is cooked to a perfect medium? Do you need an X-ray machine?No. No radiation needed here. The easiest way to see if your salmon has finished cooking is to gently press down on the top of the fillet with a fork or your finger. If the flesh of the salmon flakes—meaning, it separates easily along the white lines that run across the fillet (strips of fish fat)—it’s finished cooking. Take it off of the heat! Do it! Now! If you cook the salmon any further it will dry out and crumble when you cut into it. Salmon cooked to medium flakes gracefully. Keep it graceful, friends.Salmon cooked to medium flakes nicely and retains moisture all the way through.\nPhoto by Caleb AdamsIf you’re the type of person who likes to use cool little tools while cooking, you could also whip out a cake tester to test the doneness of your fish. The pastry tool is used in many restaurants to test the temp without without destroying a beautiful fillet. Just poke the skinny metal rod into the thickest part of the fish, hold it there for three seconds, remove it, and touch the tip of the cake tester to the skin under your bottom lip. If it’s warm, the fish has been cooked through. (If it's cold, keep the fish cooking; if it's hot... well, better luck next time.)But all you really need to know is that if the salmon separates easily, you’re good. And if the flesh inside is semi-translucent in the center, you’re also good. And by “good,” we mean, you’re about to eat some tasty, tender seafood. Enjoy.Once you cook your salmon to medium, make this super-rad salad:Summer Salmon NiçoiseWe love a classic Niçoise salad made with fancy oil-packed tuna, but using warm, slow-roasted salmon instead makes the whole thing feel a little more special.View RecipeExplore Bon AppétitBasicallyFishSalmonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-30", "author": ["Condé Nast", "Alex Delany"]}