{"id": "8601bc161ad67573d22c5ae52fc8c808", "url": "https://www.bonappetit.com/story/crispy-black-rice-with-chinese-sausage", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Crispy Black Rice and Sweet Chinese Sausage Team Up for the Thanksgiving Side of Our Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCrispy Black Rice and Sweet Chinese Sausage Team Up for the Thanksgiving Side of Our DreamsTell Aunt Jan we don’t need her Craisin-packed instant rice dressing this year.By Hilary CadiganNovember 16, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailSerious question: How many of the sides on your Thanksgiving table actually excite you?And how many are you just returning to, year after year, out of obligation, or some misguided sense of tradition, the roots of which no one can even recall? Sure, there are the mashed potatoes, which are obviously non-negotiable as long as they come with copious amounts of melty butter buried inside. And my mom’s famous cornbread casserole, which is perfect. And a few vegetables, which are necessary for, you know, fiber. But what about that tragic rice pilaf with the nuts and Craisins that Aunt Jan keeps bringing ’round simply because no one’s had the heart to stop her? Nobody wants seconds, Jan. Nobody.This was the conundrum Molly Baz set out to solve this year: How to turn an oft-flavorless table-filler into a main event. One that people would come back to not just for heaping firsts, seconds, and thirds, but make all year round.Meet Crispy Black Rice and Chinese Sausage, your new favorite side-that-eats-like-a-main.The secrets to success here are multifold, but let’s start with the backbone: the rice. Because we’re not just talking about any old rice here, we are talking about the best rice: black rice, a.k.a. Forbidden Rice, so named because back in the day it was reserved strictly for the Chinese emperor, to make sure he lived longer than everybody else. The flavor is rich and nutty and a teensy bit sweet, and the midnight sky hue comes from antioxidants, apparently, which, great.Then we gild the lily and crisp this stuff up by spreading an even layer of it over the bottom of a skillet and toasting it on both sides, so that it turns into something like the best popcorn you’ve ever tasted. (Seriously, good luck not Hoovering up the whole bowl while you wait for the other ingredients to cook—I strongly suggest making extra.) And while black rice is best, you can certainly sub it out for whatever leftover takeout rice you have lurking in the back of your fridge; the key is that it’s cooled before you pop it in the skillet, to pull out the moisture and let it crisp fully.Then comes the scene-stealer: lap cheong, a.k.a. Chinese sausage, which I would argue is the most delicious sausage known to man. Why? Because it tastes like a maple Krispy Kreme doughnut, and yet it is meat. What else do you want in life. If you haven’t tried lap cheong, I’m going to need you to drop everything right now and go out to your local Asian market (not Whole Foods, I looked) (get it together, Whole Foods) or order some online right now. Lap cheong comes in a variety of forms, from fresh and juicy to dried and shriveled (the furthest on the latter end of the spectrum may require a quick soak to bring out its flavor before cooking), but all are extra-fatty and supremely tasty.Next comes celery, an oft-underestimated ingredient. I mean, think about it: it’s both a vegetable AND an herb. Crispy-crunchy-fresh AND earthy-aromatic. This recipe lets celery shine, as long as you cook it just long enough to make it tender, but not so long that it goes floppy. About three or four minutes is just right. Next come shiitake mushrooms, which may at first seem superfluous but in fact help double down on the meatiness of the dish without adding extra fat.Sprinkle crunchy salted peanuts and an addictive dressing of Fresno chiles, vinegar, miso, maple syrup over the top with a scattering of celery leaves (extra freshness! no waste!) and suddenly, there it is: An addictively delicious rice-based side that pairs perfectly with just about any Thanksgiving or regular-old-dinner spread. It’ll even hold its own as a main—just throw a fried egg on top.And next time you see Jan? Slip her this recipe. See what happens.Get the recipe:Crispy Black Rice and Chinese Sausage DressingA riot of textures and sweet-and-savory flavors, this dish is anything but your typical Thanksgiving wild rice salad. View RecipeExplore Bon AppétitThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-16", "author": ["Condé Nast", "Hilary Cadigan"]}