{"id": "86036aedc6072a60ebdf90e4e4e6e50c", "url": "https://www.bonappetit.com/story/kimchi-meal-prep", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "If I Have Kimchi in the Fridge, I Know I Have Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf I Have Kimchi in the Fridge, I Know I Have DinnerAnd making it yourself is the best way to put back-of-fridge veggie scraps to good use.By Diana YenSeptember 12, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailI have the same dilemma after every weekend trip to the farmers market. I arrive home with my tote bags bursting with fresh produce and ready to start a new week, feeling proud I got my act together. As I begin unpacking, I start stressing about how I’m going to fit it all into the fridge. I rummage through the back, pulling out forgotten bags and containers: a few bulbs of bruised fennel, a leftover half head of cauliflower, rubbery week-old radishes. There’s no way to make way for the new stuff when I have all of these leftovers cramping my style!Clean-Out-the-Fridge KimchiThe fizziest, most fun way to use up all of those end-of-week veggie scraps.View RecipeWhen I need to use up all these slightly-wilted-but-still-good veggie leftovers, this Clean-Out-the-Fridge Kimchi is my go-to solve. This small-batch kimchi recipe uses end-of-the week fridge scraps that some might consider garbage or compost, and instead transforms them into a versatile kitchen staple, giving you a spicy sidekick for grain bowls, eggs, and stews for weeks to come.For the uninitiated, home fermentation can be intimidating, evocative of exploding jars and giant bubbling crocks. But this small-batch recipe is perfect for even the most inexperienced, and works in kitchens of any size—I made this in my tiny Brooklyn apartment. And you’ll be burping your kimchi daily—yes, like it’s your spicy baby—so there’s no chance it will explode. (Worried you’ll neglect your kimchi-burping duties? Feel free to use food-safe plastic containers instead of glass jars here, which are shatter-proof.)Spicy Kimchi–Sweet Potato FrittersA great appetizer or an indulgent snack, these crispy little fritters are best eaten right away.View RecipeOnce your jars of homemade kimchi have reached a state of fizzy, funky perfection, here are a few dishes I suggest trying out. (And, obviously, these can all be made with store-bought kimchi if you don’t want to DIY, or run out of your own stash.) For a great appetizer or fun snack to share, fry up a batch of Spicy Kimchi Sweet Potato Fritters with Gochujang Yogurt. A twist on traditional potato fritters, with tangy, spicy gochujang yogurt offsetting the subtle sweetness of the potatoes, a dreamy marriage of crispy and creamy.Inside-Out Kimchi Grilled CheeseMelty cheese and tangy, crunchy kimchi are a match made in heaven.View RecipeIf you’re looking for indulgent comfort food, try this Inside-Out Kimchi Grilled Cheese, which harks back to my childhood love of Sizzler’s cheese toast. There are a few key elements to perfecting this crispy, gooey, spicy sandwich: a strong, sharp cheddar to play off the tangy kimchi, the patience to let the cheese fully melt, and, more important, a fast, confident flip. (Pro tip: The crispy shards of cheese left in the pan are the ultimate chef’s treat.)Kimchi-Lentil Stew With Poached EggsA hearty handful of kimchi lends big flavor to this speedy, satisfying stew.View RecipeFinally, for an easy weeknight dinner well-suited to brisk evenings, check out this Kimchi Lentil Stew with Poached Eggs. In this riff on traditional kimchi jjigae, green lentils add heartiness and bite while runny poached eggs add an irresistible ooziness to each serving. The flavors are as complex as this dish is simple to make.Kimchi’s versatility comes from its ability to be eaten straight out of jars or used as an ingredient in cooking to give a flavorful kick to your meals. With all the inspiration in these dishes, it makes using up veggie scraps into something you can look forward to—and makes room for that next fresh farmers market haul in your fridge.Explore Bon AppétitcookingMeal PrepRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-12", "author": ["Condé Nast", "Diana Yen"]}