{"id": "86116194951b01c555f195a16c6c29b1", "url": "https://www.bonappetit.com/story/how-to-brown-butter", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "How to Brown Butter and Use It for Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Brown Butter and Use It for EverythingBrown butter is the ingredient that works wonders on foods you already love—and it's beyond easy to make.By Alex DelanyDecember 5, 2018FacebookTwitterEmailFacebookTwitterEmailIf you haven't been browning butter, you've only been living half your life. Sure, regular butter is a beautiful thing. It's creamy, makes sauces silky smooth, and turns the exterior of meats and baked goods to a beautiful golden-brown.  But the browned stuff is something else, and once you learn how to brown butter—which is a whole lot easier than it sounds—everything changes.  Brown butter posses a deep, nutty, miraculous flavor that has the capacity to transform foods into better versions of themselves.All you need is a skillet and a stick of butter. Here's a step-by-step that breaks down how to brown a single stick of butter, which will take you about 5-7 minutes in total.Photo by Alex LauStep 1: WarmingYou never want to throw a whole stick of butter into the pan. Chopping your butter into smaller places will ensure that it melts and browns evenly. At this point, your chopped butter should look opaque and pale. You know, like butter. Warm it until it's fully melted, about a minute or so.Step 2: SplutteringWow. Spluttering is a strange word. Once the butter is melted, it will start to splutter, which means the water is being cooked off and causing the remaining fat to pop. The butter will start to look yellow, not opaque, and you should stir it frequently at this stage, as the the butter spurs gently. Turn the heat down if the butter is spluttering violently. It should take you about four minutes to get fully spluttered.Photo by Alex LauStep 3: Sputtering SubsidesThe butter will turn into a delicate light foam and the color will change from pale to very yellow. At this point, most of the water has been cooked off of the butter, and you're left with the milk solids, which you'll be able to see floating around in the liquid, like sand at the bottom of a post-beach bath. This change on color happens right before browning, so keep that butter moving by stirring in tight circles. You're about a minute out from brown butter!Photo by Alex LauStep 4: Brown Brown!The first thing you'll notice about browned butter is the color. The second is the smell. Your butter will look very dark, deep yellow in color, and it will smell super toasty and caramel-y, The tell-tale sign is that those milk solids we were talking about earlier will become golden and highly visible in the butter. For a lightly browned butter, take the butter off of heat immediately upon seeing the golden specks. For a deeply browned butter, keep stirring for an additional minute, until the specks are a light brown.Step 5: DismountMake sure to take the pan off of the stove and pour the butter into a heatproof bowl as soon as those solids get to the color you want, since the butter will continue to cook and darken further in a hot pan. (Just so we're clear, the liquid fat and those toasty milk solids together constitute your brown butter.) You don't want to burn butter. That will ruin the toasty, caramel flavors we just developed. Now, you can add this now-browned butter to baked goods, pasta, sauces, grilled meats, or seared seafood. It's another layer of flavor that makes you like the stuff you already love ten times more.Now, let's make some wedding cookies.Brown Butter Wedding CookiesSix-ingredient cookies for people who don't think they can bake cookies.View RecipeExplore Bon AppétitBasicallyButterBrown ButtertechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Alex Delany"]}