{"id": "861466894fb852bf7db88ce0b035be90", "url": "https://www.bonappetit.com/recipe/squash-au-vin", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Squash au Vin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueSquash au VinBy Chris MoroccoFebruary 11, 20203.9(34)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintWhat would happen if you gave winter squash the coq au vin treatment? Layers of flavor from browned mushrooms, wine, and miso that give the classic a run for its money.Ingredients4–6 servings5Tbsp. extra-virgin olive oil, divided4oz. crimini mushrooms, quarteredKosher salt1large onion, thinly sliced4large shallots, halved through root ends, peeled6garlic cloves, 5 thinly sliced, 1 finely chopped3Tbsp. unsalted butter1¼cups dry white wine¾cup whole farro, barley, or freekeh3Tbsp. red or white miso1small kabocha squash (about 3 lb.), halved, seeds removed, cut into 2\"-thick wedges1medium delicata squash (about 12 oz.), halved, seeds removed, cut into 2\"-thick wedges1cup parsley leaves with tender stemsZest of 1⁄2 lemonPreparationStep 1Heat 2 Tbsp. oil in a medium Dutch oven over medium-high. Cook mushrooms, tossing occasionally, until browned and crisp, 6–8 minutes. Season with salt; transfer to a plate. Let pot cool 2 minutes.Step 2Set pot over medium heat and pour in remaining 3 Tbsp. oil. Cook onion and shallots, stirring occasionally, until softened and starting to brown, 6–8 minutes. Add sliced garlic and butter; cook, stirring often, until garlic is softened and starting to brown, about 2 minutes. Add wine; simmer, stirring once, until reduced by half, about 5 minutes. Add farro, miso, and 6 cups water. Bring to a boil, stirring to dissolve miso. Reduce heat and simmer, uncovered, stirring once or twice, until farro is halfway cooked, about 20 minutes.Step 3Taste broth and season with salt. Add squash (submerge the best you can), cover, and cook until tender, about 30 minutes. Add mushrooms; cook just until heated through, about 2 minutes.Step 4Ladle stew into bowls; top with parsley, lemon zest, and chopped garlic.How would you rate Squash au Vin?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI'm not sure why I had such a different experience with my squash doneness than it sounds like other people here. The flavor profile was good, though I did add more salt to it. I cut my squash in significantly smaller slices then the recipe recommended, and they were still completely uncooked after 30 minutes of simmering. It took another 15-20 minutes to get it the right texture, but it didn't soak up any of the flavor from the soup unfortunately.Casey MSan Francisco, CA1/24/2022This recipe is the best, I make this all the time. I don’t always find the squash in this recipe so I substitute with whatever squash I find at the store. I also usually just use baby bella mushrooms. I used orzo instead barley and cooked it separately and added it to the bowl when serving. I also use chicken stock instead of water and it comes out amazing.  The garlic at the end and the lemon zest makes all the difference Jessica Smith Staten Island, NY4/30/2021Loved it. Subbed red wine for white with red miso and it was rich and delicious. Miso is salty so didn’t add any salt at any point. Subbed chicken stock for 2/3 of the water. One kabocha and one butternut squash. If you find raw unpeeled squash hard to cut, which I do, warm it in the oven tented with foil at medium-high for 10 min and the skin softens. I love that this recipe uses squash skins. High in fibre and delicious. Best if you use organic. Rachel from Toronto Toronto, Canada4/5/2021The flavor profile of this dish is amazing. Truly wonderful. The proportions and time for cooking, however, are WAY off. Almost 4 lbs of squash to 4 oz mushroom...seriously? I doubled the mushrooms and still wanted more relative to the huge amount of squash.\n\nAlso, there is no reason to cook either the aromatics or the squash for so long or you end up with a mass of mush on your plate which is what happens with these timings.\n\nI'd suggest 2.5 lb squash –delicata, kambocha, butternut, all work well. One lb cremini (Baby Bella) mushrooms, left whole if small, halved if big. \n\nCook onion, shallots in the evoo over high heat to QUICKLY brown them. Then, add butter and garlic and cook quickly, only to begin to brown, about two minutes. The idea here is not to cook these aromatics. It's to brown them. They will cook with the squash.\n\nAdd wine, miso, 3-4c water, and bring to a boil, stirring to dissolve miso.\n\nAdd squash (submerge the best you can), cover, and cook until just tender, about 15- 20 minutes. Add mushrooms and heat through, about 2 minutes. Taste and adjust salt and add pepper to taste. I sprinkled parsley and lemon zest but no raw garlic is needed, because the layers of flavor are wonderful, robust and completely balanced. Raw garlic would bring the whole dish down.\n\nI didn't add grains to this dish b/c I can't have them right now. I also wanted protein, so I served with a side of quinoa, cooked separately alongside.AmaroneeWashington, DC1/18/2021I had to leave this review because I had zero expectations that this would be good based on the amount  bad reviews...I made the recipe pretty much verbatim..except I doubled the mushrooms, I peeled the two squashes, added better than bouillon no chick stock for some of the water, and used Vegan butter.   It was absolutely fantastic!  I would serve this at a dinner party for non plant eating friends.  I think a homemade pasta may compliment it well.  I also did not do the topping of lemon zest  parsley and garlic as my partner does not like those ingredients.  But I imagine that would elevate it yet more.  I don’t think squash could taste any better than this...Emmie Chappaqua NY1/6/2021Like everyone else, I had to make a lot of adjustments. For me, the miso and the squash just didn’t work together, and the whole soup needed more flavor overall. I recommend using more mushrooms (use both shiitake and  cremini), only 1 Tbsp of miso, 3 or 4 tsp of vegetable base, and throw in some veg like carrots and celery along with your onions + shallots.AnonymousPittsburgh, PA12/16/2020I made this recipe exactly the way it was written and even found freekeh.  The only substitute I made was with vegan butter.  It wasn't until after we tried to eat it that I read through the reviews and realized that everyone made their own variation.  This could be the worst meal I've ever made in my life, botched Thanksgiving turkeys and burnt leftover canned soup casseroles included.  Go with the substitutes in the comments if you are determined to make it.AnonymousLos Angeles10/1/2020Very flavorful and love the addition of farro. I used acorn squash and added 4 chicken thighs, a carrot, a handful of cherry tomatoes, with some sage & thyme. Used 5.5 cups of half stock/ water, and it was still a lot of liquid! Just 1.5 tbps of red miso since I had some chicken stock in there. Thickened it a bit with some arrowroot powder. A little too much oil/ butter for my taste as well, but overall, would make again with some modifications. AnonymousMiami, FL6/18/2020If you’re visiting this recipe from the gluten free list please note none of the grains called for in the recipe are gluten free. Anonymous4/27/2020Y'all, I loved this recipe, and if you're thinking about making it with substitutes (read: I took my maiden voyage with Squash Au Vin during quarantine), go for it. Subbed in acorn and pumpkin squash, whatever white wine we had on hand, barley, and vegan butter. No miso, so we went all in with some chicken stock instead of the 6 cups of water. It was a fantastic. Super rich, super comforting, and looking forward to the leftovers this week. haleyfreedlundSeattle, WA4/23/2020Love that BA is producing more vegetarian recipes. This one is great. I didn’t have an onion so I used carrots and celery stalks instead. I also added a small amount of cornstarch at the end because I prefer a slightly thicker broth. The flavour was rich and savoury. Don’t be afraid to increase the amount of mushrooms. The raw garlic and lemon zest are also a must. The only thing off was the colour, mine was very pale (perhaps in the photo they used red miso, I used white). Merci!AnonymousVancouver, B.C.4/7/2020I usually love Chris Morocco's recipes, but this one was a dud for me. Miso, tons of alliums, white wine (I used Pinot Grigio), butter, mushrooms - this dish has some great flavorful components. However, it was very \"meh\" (and I salted it very generously!) It was kind of just a mushy mess. We didn't even finish the leftovers unfortunately :( If you're looking for something vegetarian with lots of mushrooms, I'd make BA's Creamy-ish of Mushroom soup instead.AnonymousWhitefish, MT4/2/2020Made this with the abundance of carrots I had from a farmer's market haul. Absolutely delicious! Loved how the barley made the sauce thicker as it sat in the fridge. Wonderful leftovers.skylark21Brooklyn, NY3/11/2020I hardly ever comment but I love this recipe! Its a beautiful winter meal and I can't recommend it enough!Anonymous3/2/2020Great taste in all the parts of the dish : the soup, the squash (I used standard/basic butternut squash) and the barley. I would definitely cook this again :)AnonymousCopenhagen, Denmark3/1/2020Explore Bon AppétitFrenchEuropeanKabocha SquashSquashVegetableDelicata SquashWinterMainNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Chris Morocco"]}