{"id": "8618cc5509b5dc85db14373d1d27a597", "url": "https://www.bonappetit.com/story/save-money-on-groceries", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "17 Ways to Save Money on Groceries | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture17 Ways to Save Money on GroceriesMake clipping coupons cool again, buy in bulk sometimes, and more tips to save some dough.By Alyse WhitneyFebruary 7, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailA year ago, I started a food lovers' food budget plan. I learned a lot of money-saving tips along the way, but still struggle with how to save money on groceries. Sticking to a strict meal prep plan and grocery list to get the most food for my money are great jumping-off points, but most of the trouble happens from the temptation of wanting to buy 10 new condiments or getting everything to make spiced lamb chops then realizing that's way too much for one person to eat. Here are the best ways I've learned to save money when grocery shopping, from price comparing to using coupons to buying in bulk (and sometimes frozen!)1. Price Compare with Grocery Store AppsBrowse store flyers to find the best deals for what you definitely need. You can find out what's on sale on stores' websites or apps ( Aldi, Whole Foods, and Wegmans have them) or via app Flipp, which gathers many flyers in one place). Some show specials, and others allow you to clip coupons digitally. The Ibotta app will give you cash rebates for certain larger brands at big box stores by scanning your receipt after.2. Shop with a CalculatorIf you're trying to stick to a specific budget, then decide on that number—like not spending more than $50 at the store—and hold yourself accountable. One way to do this is to calculate every item as you add it to your cart. You have a calculator built into your phone, so there's no excuse! I find that writing a physical list feels satisfying to cross things off as I go, but going all-digital means you can't lose your list and scramble to try to remember everything you were going to buy. This will also help avoid impulse purchases.3. Plan Meals Based on What's in Your PantryIf you have a ton of chickpeas in the cupboard, look for recipes featuring them before you go to the store. (Cheap idea: herbed chickpeas. Boom.) Think of grocery shopping based on what's in your pantry as your own Chopped challenge to see what you can make without spending any money. That means using brown rice instead of buying farro for one recipe, or emptying out your crisper drawer for use-it-up frittata.4. Use a Smaller Cart or BasketI usually buy groceries based on the weight because I have weak arms and can't carry 20 lbs. of food home 10 blocks from the store. But using a basket or a small cart at the store will force you to only buy what you need instead of tossing in impulse purchases. And if you're only getting one night's dinner ingredients, see if you can get it in one armful. Get into that 10-items-or-less checkout line and be a minimalist with your food purchases.Vacuum sealing is ideal for sous vide cooking and freezing bulk amounts of meat.\nPhoto by Alex Lau, Food Styling by Anna Billingskog5. Buy in Bulk—OnlineIf you want to save money by buying in bulk, do it without purchasing a membership to a warehouse store! You can get great deals on bulk goods on Amazon, Boxed, Jet, or using Instacart to buy from Costco without membership (there's a slight markup on items, like $6.09 instead of $5 for a rotisserie chicken). But only buy in bulk for what you know you'll eventually use and have pantry space for—you probably don't need 10 pounds of pork chops or 30 cans of tomatoes.6. Vacuum Seal Meat and Freeze ItIf you use chicken breasts every single week and can get them for $0.99 per pound in bulk versus $5.99 per pound for a regular package, then use a vacuum sealer to store them properly. If you want to freeze 10 chicken breasts, taking all of the air out is imperative so they don't get freezer burn. The BA kitchen's favorite is the FoodSaver ($119 on Amazon), and it will pay for itself when you think about all the food you normally would have to throw away and the money you saved by buying in bulk. They're also great for sous vide cooking, so you'll be able to have a perfectly medium rare steak for dinner or a juicy piece of chicken anytime.7. Shop Bottom Shelves and Outer AislesGrocery stores put the pricier name brands at eye level so you're more likely to grab it without looking around for a better deal. Scan from top to bottom before you purchase—the $3 pickles may be hidden underneath the $10 ones.8. Go GenericIf you aren't brand loyal to a product, then try generic. I'll always get Hellmann's mayonnaise, but I don't care who makes my butter for everyday purposes.Make cheaper DIY granola from the bulk bins.\n9. Shop from the Bulk BinsNot sure if you like farro? Only need a cup of quinoa for a salad, or a sprinkle of peanuts to finish a dish? Hit the bulk bins. It's a great way to experiment with new grains, dried beans, nuts, or even spices (Wegmans has a selection of bulk spices) instead of committing to an expensive bag and letting it collect dust in the pantry. Food director Carla Lalli Music has a whole video series called Bin It to Win It that will inspire you to make the most of those cheap finds.10. Get Dried Beans Instead of CannedCooking with dried beans requires a little extra time to soak—unless you have an Instant Pot—to save a lot of money. Canned is fine for convenience, but if you eat a lot of beans, dried will take your dollar further—and taste better. Instead of paying $1 per 15 oz. can (which is almost half liquid and half cooked beans, so $2 per pound), you could get FOUR pounds of dried beans for $5 ($1.25 per pound dried, and they double in size when cooked). Make a big batch and freeze cooked beans in pint or quart containers for later use.11. Buy Frozen ShrimpMost \"fresh\" shrimp at grocery stores is previously frozen—and that is totally fine. To save a little cash, cut out the middleman and buy frozen unless you have a reliable fishmonger and/or live near an ocean. It will be less expensive and be there for you for a random weeknight shrimp stir-fry.Frozen shrimp = impromptu shrimp taco nights.\nBobbi Lin12. Buy Some Vegetables FrozenThere are three frozen vegetables we vouch for: peas, artichoke hearts, and cooked spinach. If any of your recipes call for them, frozen is typically cheaper and easier to use. You can throw peas directly into pasta water before you drain and they cook in 30 seconds—a tip from the Rent Week Special: Sad Boy Pasta edition—instead of blanching a bunch of fresh ones. And since spinach shrinks down so much when it cooks, you get way more spinach in a frozen bag than you would fresh since it's pre-blanched and wrung of some excess water.13. Buy Everything Else In-SeasonIn-season produce will be cheaper because it's so bountiful, even at a farmers' market. It's more common to find peaches or tomatoes on sale in the summer than in the winter.14. Get Bulk Bags of PotatoesAt Fairway, I saw that loose Yukon Gold potatoes were $1.69 per pound and $3.99 for a five-pound bag. That's almost a 50 percent savings at $0.79 per pound in bulk; the same amount of loose potatoes would be $8.45. Potatoes store relatively well for a few weeks and often you'll use a few pounds for roasted potatoes or mashed potatoes, so it's always better to get more.15. Wash Your Own LettuceBuying pre-washed bagged greens is always more expensive—and they're not always 100 percent clean. A 7 oz. tub of romaine leaves is $4.49 at Fairway, while three whole hearts (about 12 oz.) is $2.99. Buy and wash a ton of kale at once too—a bunch is typically at least 7 oz. for $2.50, while a washed bag of 5 oz. runs $4.50.Wash a TON of kale yourself in a clean sink, and save some green on greens.\nPhoto by Alex Lau16. Grate Your Own CheeseA block of cheddar will always be cheaper per pound than a bag. An 8 oz. block of Whole Foods brand sharp cheddar is $2.99, while 12 oz. of that same cheddar pre-shredded is $6.99. That's $5.98 per pound versus $9.32 per pound for the same thing.17. Shop OnlineMost of these price comparisons were used by looking up items on Instacart, which delivers from local grocery stores. I also use Peapod (which uses Stop and Shop's suburban prices) and Fresh Direct (our test kitchen's go-to for groceries) for convenience and the ability to know exactly what I'm spending and price compare without leaving my couch. It's the one time when laziness pays off.Some bulk-bin polenta inspiration:Explore Bon AppétitGroceryShoppingBudgetRead Moreculture5 Money-Saving Lessons I Learned in a Month of BudgetingBy Alyse WhitneycultureA Food Lovers' Guide to Eating on a BudgetBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-07", "author": ["Condé Nast", "Alyse Whitney"]}