{"id": "861b23ac2a4f7f1cf1645063f30d7893", "url": "https://www.bonappetit.com/story/sweet-spicy-grilled-squash", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "This Grilled Zucchini Goes Out to All the Vegetarians at the Barbecue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Sweet and Spicy Grilled Squash Goes Out to All the Vegetarians at the BarbecueGlazy, incredible grilled zucchini that will never turn out soggy.By Aliza AbarbanelJune 14, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailGrilled zucchini is a summer staple as essential as soft serve and SPF, but too many barbecues are cursed with soggy veggie skewers. It doesn’t have to be this way! Senior food editor Andy Baraghani is here to prove it. His glazed and grilled recipe is the way you’ll want to eat squash all summer, because it packs a punch without any advance marinating or fuss. Make it in 20 minutes to pair with chicken thighs or fish, or serve it with crusty bread and olives for laid-back happy hour bites.Summer squash like zucchini can quickly go mushy from their high water content, so Andy uses strategic (and aesthetically-pleasing) scoring to maximize flavor. He cuts each squash half in a  ¼” crosshatch pattern, then tosses it with 1 tsp. kosher salt in a colander. The salted squash hangs out over a bowl for 10 minutes—enough time for water to drain, ensuring less sog and more concentrated summer squash flavor. The slices also create space for the marinade sink into the starchy flesh.The marinade, by the way, is a spicy-sweet sambal-soy mixture fortified with honey and rice vinegar. It’s reduced in a saucepan until juuust on the verge of syrupy, creating a glaze that’s glossier than a millennial makeup brand. It gets brushed across the squash regularly while grilling (we recommend using this brush!) until there’s a bit of char and an irresistible, shiny lacquer.You could stop here, but a quick, bright herb salad brings this recipe over the top. Toss a sliced shallot and plenty of tender-stemmed cilantro in lime juice and salt, and you’re set. Transfer the squash to a platter, drizzle with leftover glaze, then make it rain herbs and sesame seeds. One bite yields a kaleidoscope of high-summer flavor—acidic quick-pickled shallot, spicy-sweet squash, a hint of char—that begs to be washed down with a glass of salted watermelon juice. It doesn’t get more summery than that.Get the recipe:Sweet and Spicy Grilled Summer SquashThe crosshatch pattern isn’t just for show (even though it does look cool)!View RecipeExplore Bon AppétitHealthyishSquashSummer SquashGrilled VegetablesGrillRead MorecookingThis Charred Cabbage with Goat Cheese Recipe Is Vegetarian Grilling at Its BestBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Aliza Abarbanel"]}